{
  "video_id": "nEQdkmuMUk8",
  "text": "number one and we of course have been studying through the book of Genesis in fact we this is our 51st lesson through the book of Genesis and we have effective successfully completed 19 chapters of study in 50 lessons and so we're right on track to finish in three years or so but in any case this lesson that I'm going to teach this evening that I have titled what about dinosaurs was a lesson that I was going to teach way back in March of 2020 and I guess last week of March first week of April somewhere in that time frame is what my plan was to teach it and of course kovat came and service schedules got all kinds of weird and I was preaching to a camera only and for several weeks and what have you just had a handful of people here and so I ended up just continuing to go through the book of Genesis and never really had an easy stopping point with regard to the just the dialogue that's going through the book of Genesis and when I finished the 19th chapter I felt that it was a good break point to be able to of course some things with Abraham continue but it was a good break point for us to be able to have this lesson this evening and so many of the children were coming up to me saying is it true pastor are you teaching about dinosaurs tonight and they were all excited and one little boy I won't tell you who was so excited that he almost couldn't ask me the question and the father kept saying go ahead ask him ask him ask him and finally enough courage to say is it true that you're gonna teach on dinosaurs and then asked why and of course the the truth of God's Word is important that we'd understand even the subject matter of dinosaurs in fact I believe this evening that there are times in our lives that we may shy away or maybe even avoid a conversation with someone about dinosaurs because we just simply don't know how to deal with it we don't know how to answer the questions we don't feel like we have been adequately trained we can't debate their science and so on and so forth and so we may shy away or even avoid altogether some conversations with people about a subject matter like dinosaurs because we just don't know and this evening I want to right up front admit to you that I am NOT a paleontologist I do not study dinosaurs I don't study fossils and I did a lot of study for this particular message and I hope it'll be a blessing to you but we understand that there are many paleontologists that do lots of work and there have been volumes scores of books that have been written upon dinosaurs and we understand there are many documentaries that you can watch and listen to and people that have all sorts of credentials and what-have-you in fact it's exciting that there are plenty of good resources that are available of those that have been adequately appropriately trained to be able to discuss the subject matter in great detail that are coming from it from a biblical worldview a biblical perspective you don't always find that of course and so I would encourage you that as of course children are super excited and interested in dinosaurs but as you begin to maybe through this study have some interest in learning some additional things there are some good resources out there I will say this there are two organizations one of them is answers in Genesis I do not give a broad statement of support to any organization but I will tell you that they have some good materials on creation they have some good materials on dinosaurs and what-have-you and then the Institute of Creation Research again I'm not giving a broad you know statement with support fully of either of these organizations but I do say that they are organizations are out there that have lots of good material that comes from a biblical perspective a biblical worldview I believe that as we begin to study and think about this that it would be important that we understand of course as a pastor that I'm going to be approaching this with a biblical worldview and having a biblical worldview and starting with and ending with the Bible will lead us to a place where we will have different conclusions and different understandings than those who doubt or just straight-up oppose the Word of God and so we have to understand that one of the lessons that I previously taught we dealt with the flood and I dealt with the Grand Canyon in a particular message and looked at a number of things of how the waters assuaged and how that could be formed very easily and quickly we also looked at a subject matter and spent an entire lesson dealing with the Ice Age and dealing with those things and one thing that I said repeatedly in those two messages I'll say it again this evening the problem is not with what we see but it's with how we interpret what we see listen there are plenty of fossils out there that show us that dinosaurs existed and the problem is not with what we see but it's in how we interpret that which we see and we find that it's important that we begin with the Bible what does the Word of God say these things that we see when we talk about maybe the the Grand Canyon we speak about the Ice Age we talk about dinosaurs these things do not take millions or even billions of years I I believe that they simply require the right conditions and we dealt with that we talked about the the Grand Canyon we dealt with that we talked about the Ice Age and some of those conditions and I think that that's also pertinent here to our discussion this evening I have you there in the book of Genesis I want to read one verse to you from the New Testament in 1st Thessalonians 5 and then we'll get right back to Genesis chapter 1 but in 1st Thessalonians 5 in verse number 21 the Bible says this prove all things hold fast that which is good and let me just give you let me look at read a couple of verses of Scripture and then give you some common teaching with regard to dinosaurs and then give some biblical answers in Genesis 1 in verse number 24 the Bible says this and God said let the earth bring forth the living creature after his kind cattle and creeping thing and beast of the earth after his kind and it was so and God made the beast of the earth after his kind and cattle after their kind and everything that creepeth upon the earth after his kind and God saw that it was good we'll look at some more verses here as we get through the lesson this evening but we find that here these verses in verse 24 and 25 are the first verses dealing with that which was created on day six of creation and we find that God is giving us information throughout the record of Genesis chapter 1 with regard to creation and one phrase that you'll find repeated we read it multiple times just in those two verses is this word kind after his kind after their kind and it's important that we understand that we dealt with that many many months ago actually a year and a half ago as we studied Genesis 1 in more detail in each day of creation with regard to dinosaurs specifically and answering the question what about dinosaurs let me just give you a few things that people will say common teaching common thoughts with regard to dinosaurs number one they'll say this dinosaurs reigned for a hundred and sixty five million years after evolving from some other type of reptile now rate at face value do you have any problems with that statement I got a couple of problems right away the timeline 165 million years I got a problem with the timeline and I got a problem with the fact that they evolve from other reptiles and we'll deal with that we'll discuss that approximately 65 million years ago so for a hundred and sixty five million years these dinosaurs reigned upon the earth and then 65 million years ago there was some major event they would believe it was some kind of an asteroid that struck earth and killed off the dinosaurs I got a problem with that as well I got a problem with the timeline again and I have a problem with the answer as to what happened but here's the the the reality remember the problem is not with what we see but how we interpret what we say right so nobody was around a hundred sixty five million years ago no one's around 65 million years ago and they're looking at these fossils and they're coming from a perspective of no biblical worldview and they're saying where did this stuff come from how did it get here and they just begin to come up with some kind of answers and they give some kind of scientific reason and logic and so on and so forth and we find that they would dismiss Bible truth another common teaching would be this that humans and dinosaurs did not live at the same time they would say that there was nearly 65 million years that passed before humans appeared on earth well I got a problem with that as well as you look at the account of Genesis and the verses that I just read in verses 24 and 25 of the creation of day six you know what happens right after that event is God creates man on the same day day number six and so I have problems with that and here's one of the things that they often say that I believe can cause us to have great difficulty in engaging in conversations with individuals and it's this that the word dinosaur doesn't even appear in the Bible right so they'll say something to the effect of the word dinosaur doesn't appear in the Bible and so the Bible doesn't say anything about dinosaurs there's nothing in there about it and so how are you going to talk to me about dinosaurs right they'll say something like that well here's what's interesting about the word dinosaur. The word dinosaur was first used by Sir Richard Owen in 1841. All right, that's a hundred and forty years ago. It was the first time the word dinosaur was ever used. It was used by this man, Sir Richard Owen, as he was addressing the British Association for the Advancement of Science. The term was then published in 1842. So if the term was first used in 1841 and we find that it was then used, I said, I think I said 140, it'd be 180 years ago, and it was then published in 1842, we would not expect the word dinosaur to be in our Bible, right? We understand that the word, if there's a word, you know, they have in the English language, the dictionary, they have new words that they add into the dictionary all the time. And each year they have a certain number of words that they add into the dictionary. Well, it would be foolish of us to say that there was a word entered into the dictionary in 2020 and we'd have an issue with the fact that that word was nowhere to be found in any legal documents or otherwise in 1984. Well, of course it wasn't in those documents in 1984 because those documents were written before that word was ever injected into the English language. And so we understand that the Bible was originally the the Old Testament, Hebrew and Aramaic. We understand the New Testament to be Greek, and we find that this Bible, of course, you think about the Word of God and the existence of the Word of God and how God gave His Word, and in 1841 some guy comes along and uses the word dinosaur, and there are people that will say to you as a Bible-believing Christian that you can't have, you have no authority to talk about dinosaurs because the word doesn't exist in the Bible, and so God doesn't know anything about it. That's just foolish. But the reality is that sometimes it will stop us dead in our tracks because you cannot find the word dinosaur in the Bible. I don't care what kind of concordance you have, it's not there, but it does not mean that God's Word doesn't deal with the subject matter of dinosaurs. And so let me answer just a few questions if I can. The first question I would ask by way of kind of teaching through this this evening would be this, where did dinosaurs come from? Of course, I'm sure you already know what my answer is, but let's look at what the Word of God says. Where did dinosaurs come from? Of course, we mentioned that they said that they reigned upon the earth for about 165 million years after evolving from reptiles, some other kind of reptile. We reject evolution, and therefore we would conclude that they had to have been created by God. The Word of God clearly states in multiple places, remember I mentioned to you that the the subject of creation is not isolated to Genesis 1. The subject of creation is found all throughout the Word of God, and we find that there are many references throughout the whole of the Bible that speaks of God being the creator of all things. And we find that God is the creator of all things, and we understand that as you read the record of Genesis chapter number 1, and we dealt with this in great detail, that this is a literal 24-hour day, a six-day creation. We find that God mentions to the children of Israel that in six days God made all things, and he repeats this throughout the Word of God. And the reference that I read in verses 24 and 25, that is the event of the creation on day number six, and you find that in verse number 25 that the Word of God says, and God made the beast of the earth after his kind. And so we find their cattle after their kind, everything that creepeth upon the earth after his kind, and God saw that was good. And we focus upon that statement, it says God made the beast of the earth after his kind. Admittedly, the Word is not dinosaur. Again, to reference what I said a moment ago, the Word did not exist, and therefore we would not expect to find that Word in the Word of God. But we remember, and we're mindful of the fact that God's Word clearly teaches that God made all things in six days, and that would include dinosaurs. Now, there are some that would have the idea that perhaps it was on day five and day six, maybe there was some on day five, some on day six, there is certainly some that could have an argument with that On day number five, you'll see that it begins in verse number 20, and God said, Let the waters bring forth abundantly the moving creature that hath life, and fowl that they may fly above the earth in the open firmament of heaven. And God created great whales, and every living creature that moveth, which the waters brought forth abundantly after their kind, and every winged fowl after his kind. And God saw that it was good. And God blessed them, saying, Be fruitful and multiply, and fill the waters in the seas, and let fowl multiply in the earth. And the evening and the morning were the fifth day. If you study all of the dinosaurs, and I'm not going to get into it this evening, there are way too many of them, and all this, I can't say all the words anyway, some of these little boys can probably say some of the words better than I can, but the reality is that there were some that were land creatures, some that were that were flying creatures, and some that were in the the water, marine creatures, if you will. And so no doubt some of them could have been created there on day number five. It is of interest and of note that many people would argue, those that would adopt the evolutionary perspective of not only where did dinosaurs come from, but where did they end up, that they would speak about them becoming or evolving into birds. But birds were created on day number five, as we see clearly indicated here, and we find that to be the case in the Word of God. Now, when we think about God creating these dinosaurs on day number six, as we look at verses 24 and 25, we will remember to answer the question where they say that man and dinosaur did not dwell on the earth at the same time. Remember they mentioned that there's 65 million years after the extinction, if you will, of dinosaurs, that man came upon the earth. Well, the Bible continues in verse number 26 of Genesis 1, and says, and God said, let us make man in our image after our likeness, and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth. Verse 27, so God created man in his own image, and the image of God created he him, male and female created he them. God blessed them, and God said unto them, be fruitful and multiply, replenish the earth, and subdue it, and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth, including dinosaurs. All right, that's what God says. He doesn't say including dinosaurs, I'm saying that's what he's saying, because he says every living thing that moveth upon the earth, that would be inclusive of dinosaurs, and therefore we would confidently conclude that humans and dinosaurs absolutely lived at the same time, 100%. And we find, turn over to the book of Job, if you will, Job chapter number 40. Turn to the book of Job, and I'm not gonna get into all of this this evening, we won't be able to take the time to do so. I'm just gonna look at chapter number 40, but you can look at chapter number 41 and read about Leviathan. We're gonna look at chapter number 40 and read about a behemoth, and we think about behemoth, it begins here in Job chapter number 40, and I want you to begin looking with me at verse number 15. Job 40 and verse number 15. Notice what God is saying here. This is God's second speech, speaking of his power, the Lord answered Job, if you look at verse number six, it said, then answered the Lord unto Job out of the whirlwind and said, and so just so we can pick up context, I'm gonna begin in verse 15, but just so you understand, this is the Lord speaking to Job. Behold now, behemoth, which I have made with thee, he eateth grass as an ox. Now notice the phrase, God says, which I made with thee, right? So this behemoth that he's speaking of, God says, I made him, and then he says, he eateth grass as an ox. Lo, now, verse number 16, his strength is in his loins and his force is in the navel of his belly. Verse 17, he moveth his tail like a cedar. The sinews of his stones are wrapped together. His bones are as strong pieces of brass. His bones are like bars of iron. Notice verse 19, he is the chief of the ways of God. He that made him, who's that? That's God. He that made him can make his sword to approach unto him. Surely the mountains bring him forth food, where all the beasts of the field play. He lieth under the shady trees and the covert of the reed and fens. The shady trees cover him with their shadow. The willows of the brook compass him about. Behold, he drinketh up a river and hasteth not. He trusteth that he can draw up Jordan into his mouth. And so we begin to see, verse number 24, says he taketh it with his eyes, his nose pierceth through with piercing, pierceth through snares. And so we begin to look at these phraseologies and all that's done and how it's explained to us. There are some, in fact, it might be that you have a study Bible in your hand this evening that will say that behemoth was like a hippopotamus, or that behemoth was like an elephant. Well, the description that I just read to you does not line up with, I know what a hippopotamus is, amen? I know what an elephant is. Neither one of them have a tail like a cedar, right? I mean, they just don't fit the description. And so therefore, for us to take this approach, and unfortunately Bible, study Bibles and some Bible scholars of yesteryear, they would just take this approach of saying, well, it must be a hippopotamus, it must be a whatever, because they don't know how to answer the question. And then you have more problems interacting with somebody because, well, the word dinosaur isn't there and they say that it's a hippopotamus. It just doesn't line up. The description that God gives here at the end of Job chapter number 40, this This is not a hippo, this is not some kind of a large mammal, animal, elephant or otherwise. We find that the description is given of a huge animal with a long neck that ate grass. I believe that it would describe a sauropod if you would, perhaps even, and you guys bear with me, some of these little kids can say the words better than I can, a brachiosaurus. And when you think about this particular, and I didn't take pictures and bring it up here or anything, but you think about this particular dinosaur and you think about the description of this dinosaur and you think about the way in which this description here in Job 40 and the fossils that have been found, it matches greatly. It's a great answer to, okay, it must have been behemoth, must have been a sauropod, and specifically a brachiosaurus. And so we think about the pre-flood climate, remember we dealt with the flood and we talked about that pre-flood climate and how things, you think about the longevity of life, the longevity of all of those things, the way the climate was and so on and so forth, and you begin to find out how these creatures could thrive in such an environment. It's interesting because this here text tells us in verse number 15 about behemoth that he eateth grass as an ox. Well, that was always a problem for folks when they began to, especially with these evolutionary scientists that would give their answers as to what they would believe with regard to dinosaurs and their aging and so on and so forth. But there was some, and I apologize if it's crude, but there was some fossilized dinosaur dung that was found in the rocks of India. And this fossilized dinosaur dung that was found in the rocks of India showed very plainly that sauropods ate grass. Well that kind of caused a problem for them, because they didn't believe that grass existed at the same time that these dinosaurs existed, because on their evolutionary timeline it didn't line up that way. So when you look at all the millions of years and all the things that go on, it's okay, we need to go back to the drawing board and figure this out. From a Bible perspective, I have no problem with behemoth eating grass. Why? Because on day number three is when God created grass. If you go back to Genesis chapter number one and you look at verse number 11, the Bible says, and God said, let the earth bring forth grass. And guess what? In verse number 12, the earth brought forth grass. As we've mentioned as we've studied through Genesis chapter number one, again, it's been a long time ago when we're studying through it specifically, but we mentioned how God everything he does is in order, right? There's decency and order with God, and we find that God, as he would create, he would provide the provision for the next thing that he would create. These things needed to have some kind of food source, and so God created the food source and then created the creature. And so it's no problem for us as a biblical creationist to say, well, there's a fossil that is of a dinosaur and he has grass. Well, sure. In fact, it wasn't until after the flood that they ate meat. They all ate grass. But here's what happens. Remember my statement in the very beginning. It's not so much with what we see, but how we interpret what we see. Sometimes they see these dinosaurs and they got these big, huge teeth, and I mean, they're sharp and all this stuff, and they just, man, they have to be these ferocious meat eaters and so on and so forth. How do you reach the conclusion? Behemoth ate grass as an ox. It's what God tells us. And so as we begin to understand and ask the question, where did dinosaurs come from, we're able to very easily answer some of the questions with regard to not only the fact of creation, but answer the question about them being on the earth and roaming the earth at the same time as man. But then it also leads us to the question of what happened to the dinosaurs. What happened to the dinosaurs? And maybe we'd follow it up with this question. Why are there so many fossils? Why are there so many fossils? Well, between the record of Genesis chapter number one and the record of the flood in Genesis six through eight, we understand the timeline that there's roughly 1,656 years between the creation and the flood. So 1,656 years. That's a far cry from 165 million years, but it's 1,656 years. Now remember the climate pre-flood and the way in which the longevity of man, you can read of the time in which man lived and their days, and you can read about just all of the way in which the climate would support life and allow life to really thrive. And so we find that 1,656 years after creation, we would say, as we look at the word of God, that there was a global flood as is recorded in Genesis six through eight. And the global flood provides us with wonderful answers with regard to answering the question, what happened to the dinosaurs? And then follow up question of that, why are there so many fossils? And so when we begin to answer this question, we would understand as we look at the record of the book of Genesis, that it was not through the flood that every dinosaur was destroyed. See there are some that would teach that have this idea, these evolutionary scientists that would say that when that asteroid hit earth, that basically there are some that would say that it was in a moment, in an instant, it just destroyed all of them. And there are some that would say it destroyed most of them. And then over a period of years, and they speak in terms of millions of years as if it's just a couple of minutes. And then, you know, they began to die off entirely. We don't believe that the flood destroyed all of the dinosaurs because Noah was told to bring dinosaurs or bring all of the animals onto the ark, right? Look in Genesis chapter number 7 if you will, we believe that Noah took dinosaurs onto the ark. Now, there are some that immediately oppose that and they say, well, the ark wasn't big enough, there's no way you could get dinosaurs, I mean, look at the size of these sauropods and T-Rex and all of this. Who said that he had to bring adult grown, fully grown animals onto the ark? There's no need to bring fully grown animals onto the ark. In fact, it would be much wiser to bring adolescent sized animals onto the ark. Not only would they be smaller, but they would be ready to be productive and reproduce after they got off the ark. And that's what they were instructed to do, right? Not only Noah and his family, but all of the animals. They were to come off the ark and they were to replenish the earth. And so we find that here in Genesis chapter number 7, in verse number 7, notice what the word of God says, and Noah went in and his sons and his wife and his son's wives with him into the ark because of the waters of the flood of clean beasts and of beasts that are not clean and of fowls and of everything that creepeth upon the earth. There went in two and two unto Noah into the ark, the male and the female, as God had commanded Noah and it came to pass after seven days that the waters of the flood were upon the earth. And so God moved and God worked, God created these animals, God brought these animals onto the ark. And of course, Noah was responsible for building the ark and what have you. But we find that Noah would take these dinosaurs onto the ark. Again, not only did they not have to be fully grown dinosaurs, but not every single species of dinosaur. You think about dogs and you think about the kind, right? The dog kind. But then how many variants are there? When you go through the whole process and you want this breed of dog or that breed of dog and crossbreeding and so on and so forth. Now, you can't do it with a dog and cat because they're not the same kind, right? We understand that, but we find that you can certainly within the kind, you can have a variety of families or breeds, if you will. And so we find that here, God specifically in Genesis one repeats kind, kind, kind after his kind. And so it's believed by people that are much smarter than I am, that there were probably about 60 pairs of dinosaurs that would have to be on the ark. Now, those 60 pairs of dinosaurs, but it's interesting to understand this, the average size of a dinosaur was the size of a large sheep. So you have some really big dinosaurs, but you also have some small creatures. And so this is not, when you understand the fact that they weren't these fully grown, they didn't have to be fully grown, and it wasn't that you had to have every variant, every type that's out there, you would understand that it was certainly adequate for them to fit on the ark. We went through, as we talked about the ark many lessons ago, we talked about the size of the ark and how many freight cars of, you know, cubic feet that they had for storage and so on and so forth, sufficiently sized for all these creatures. Let me say this, Noah took all the animals on the ark, including dinosaurs, but we also understand as we read the Genesis flood, that all living creatures that were not on the ark died. Genesis 7, continue reading, look down at verse 21. The Bible says, \"...and all flesh died that moved upon the earth, both of fowl and of cattle and of beasts and of every creeping thing that creepeth upon the earth, and every man and in whose nostrils was the breath of life, of all that was in the dry land died.\" Verse 23 of Genesis 7, \"...and every living substance was destroyed which was upon the face of the ground, both man and cattle and the creeping thing and the fowl of the heaven, and they were destroyed from the earth, and Noah only remained alive and they that were with him in the ark, and the waters prevailed upon the earth in a hundred and fifty days.\" And so all living creatures that were not on the ark died. So there were lives. lots of dinosaurs that died during the flood. We don't know the number, but we do know this, and I'm gonna read this to you. The rocks of the Earth's crust now contain the fossil remains of unnumbered billions of plants and animals buried in water-transported sediments, which quickly became stone. This geologic column has been grossly distorted by evolutionists into the record of an imagined three-billion-year history of evolution during the geological ages. Actually, it represents the deposits of the cataclysmic flood, with the fossils order primarily depicting the relative elevations of the habitats, and therefore, the usual order of sedimentary burial in the flood of the organisms of the pre-flood world. Many modern geologists are again admitting the necessity of catastrophic formation and burial to explain the fossil rocks in the geological column. The reason why very few fossilized men, so this is another question that comes up, why do we find these dinosaurs that are fossilized, but we don't find men that are fossilized? And if they lived at the same time, then you would find, if you're gonna find fossilized dinosaurs, you should find fossilized men. I thought it was an interesting statement here. The reason why very few fossilized men and also very few fossilized flying birds are found in the rocks is their high mobility and ability to escape burial and sediments. When eventually drowned, their bodies would remain on the surface until they decayed. Well, if you decay, you don't fossilize, right? It just can't happen. In fact, someone said this, fossils, in order for a fossil to be created, they have to be buried fast and deep to be preserved. There's no gentle drifting out to sea, settling to the bottom and then somehow becoming buried so that no scavengers attack the carcasses. This was something that happened very quickly. Now, think about the flood and think about all of the great deeps opening up and the water coming, and then you begin to think about when the waters assuaged and how everything was rapidly moving and all of that earth being so soft because of the number of days in which the water was on the earth. And then when God calls the wind to come to assuage the waters, I mean, it's just catastrophic event. And no doubt resulting in many of these fossils that are being found today. We not only believe that they were created by God and that Noah took them on the ark and those that were not on the ark died in the flood, but we also believe that they were brought off of the ark. Genesis chapter number eight, verse 15. Notice in Genesis eight and verse 15, it says, God spake unto Noah saying, go forth of the ark. What a wonderful day that must have been. Amen? After being on that ark, it's time to get off. Get off the ark, thou and thy wife and thy sons and thy sons' wives with thee. Notice verse 17, bring forth with thee every living thing that is with thee of all flesh, both of fowl and of cattle and of every creeping thing that creepeth upon the earth that they may notice that they may breed abundantly in the earth and be fruitful and multiply upon the earth. And Noah went forth and his sons and his wife and his sons' wives with him, every beast, every creeping thing and every fowl and whatsoever creepeth upon the earth after their kinds went forth out of the ark. Therefore, we would, just as I said earlier, confidently conclude that man and dinosaur dwelt at the same time, we would conclude that dinosaurs lived after the flood. They lived after the flood. You say, are you sure about that? Well, did you just read what I read? They went on the ark, if everything went on the ark and then everything came off the ark, then they existed after the flood. So what happened to them? Why is it that after the ark, of course, we don't believe in their extinction immediately because of the flood, but we would find that they obviously died out after a period of time and we don't know exactly the time in all of the regions and what have you, but the reality is that the post-flood climate was drastically different than the pre-flood climate. The climatic changes upon earth, post-flood versus pre-flood are just amazing. I mean, just, you just think about it in the life expectancy of mankind and you see the way in which man, very quickly, their life expectancy decreases after the flood and you begin to see the impact of the climate and so we see that lifespan decreases. Think about the vegetation changes, right? And so what is the vegetation? Well, that's a source of sustenance for these animals and you understand that. You think about the ice age. We dealt with a whole lesson on the ice age. Well, what kind of an impact did the ice age have upon the dinosaurs? Some animals, no doubt, as they came off the ark and they began to deal with some of the climatic changes that were so much drastically different, the oxygen levels in the atmosphere are different than they were pre-flood and just so many variables and you say, okay, how did all of these things impact the ability for certain animals to live? And how did it cause those things to happen? And so we look at that and we find that all of these factors would contribute to an eventual extinction of dinosaurs. I would also say this. The reality is that the animal-human interaction differed greatly post-flood. Pre-flood, there was a way in which God had given the instruction, as you look in Genesis 1 and we read it earlier, when God created man, he was to have dominion over, right? And there was this certain level of interaction, if I can use that terminology this evening, of how man and animal would interact with each other. But after the flood, all of those things changed. We understand that one day, there's going to be in the millennial kingdom of Christ, there's going to be a change into the animal kingdom as well and how man interacts with animals and so on and so forth and you see that. You read in Isaiah some of those things that God gives us with regard to the millennial reign of Christ. And so that difference in the interaction between these that would now leave the ark and go to inhabit the earth, you think about the way in which the Tower of Babel is described in chapter number 11 of the book of Genesis and how those people eventually, after their language was changed, how they departed and spread out, no doubt they would come in contact with dinosaurs. And what would they do? How would that interaction be? And we find there are plenty of historical events and evidences, if you will, that would refer to various encounters that individuals had with these dragons or these dinosaur-like creatures. And we find that, as we mentioned earlier in Job chapter number 40 about behemoth, we also would understand and say tonight, we're not gonna look at the references because there's many of them, but you would understand that in the word of God in our Bibles, the word dragon appears several times. And so that word dragon, again, it's not the word dinosaur because the word dinosaur didn't exist, but it's the word dragon. You read about behemoth, you read about Leviathan, you read about these dragons that are mentioned in the word of God, and you begin to see how the word of God provides us with evidence that yes, dinosaurs existed. We're not some backwards group of people. Oh, you're a biblical Christian and you don't believe in dinosaurs. No, we believe in dinosaurs. It's just what we believe about dinosaurs varies greatly from what you believe about dinosaurs because we don't believe that they evolved from some other type of reptile. We don't believe that they were here for 165 million years and then all of a sudden an asteroid came and destroyed them and then 65 million years later after that, man showed up. We just go ahead and get rid of all of that. We don't believe that. Why? Because we believe and start with the word of God. What does God's word tell us? In addition to having the word of God, I thought it was noteworthy of interest to share some things with you about some just historical evidence, if you will, for us to understand the truth that dinosaurs existed after the flood. Now, I don't know, I've not done surveys on this, I didn't read a whole lot on this, but I began the message this evening by saying that there are times in which we as Christians may shy away or avoid a conversation with somebody about dinosaurs because we just don't know how to talk about it. There's also the subject matter, there are some that just have the answer that dinosaurs were destroyed during the flood entirely, but that doesn't answer the question of some of these historical evidences of dinosaurs existing after the flood. And so just as Noah would have taken dinosaurs onto the ark, we've already dealt with the fact that he would have brought them off of the ark, so it's easy for us to acknowledge this evening that no, the flood didn't destroy all of the dinosaurs because they came off of the ark. A number of events took place, obviously through all of those factors that we mentioned a few moments ago, eventually they would become extinct, but I wanna share with you just a few historical evidences, and you can look these things up and see their validity, but Alexander the Great, as he was going and conquering and moving forth, when he went into India in 326 BC, he gave record of finding hissing dragons. that were very descriptive-like to some of these types of dinosaurs that you hear about. In fact, many of us know about Marco Polo, and it's more than just a game that you play Marco Polo, and you kind of answer it, so on and so forth, but there was this man, The Travels of Marco Polo, right? He traveled all over the place, and he would describe in this book, The Travels of Marco Polo, he described in great detail a number of the animals that he would see in different parts of the world during his travels, and no doubt, if you were to read through the descriptions, he definitely could have had some contact with some dinosaurs as he had these travels. I would say this, there's this ancient Egyptian plaque, and the Narmer Palette, it depicts humans handling two creatures that are obvious long-necked dinosaurs. So how do they have this plaque that depicts these humans that are handling this dinosaur? If dinosaurs and humans didn't exist at the same time, or if dinosaurs were done away with during the flood, and they just ended, and so on and so forth, well, there's evidences out there that these dinosaurs existed, and they have these. There's a Stegosaurus carving on a Cambodian temple wall, and this Stegosaurus that's carved on this wall in this Cambodian temple, it was carved nearly 800 years before any fossil of a Stegosaurus was ever found. That's interesting. I mean, somebody just make it up? No, they probably saw them. They lived there. They dwelled in that area. It's also interesting, how many of you have ever gone to a Chinese restaurant, and you sat down to eat, and they have that little placemat that has all those little animals, and you are the year of the—I'm the year of the monkey, 1980, year of the monkey. I don't know. It just is what it is, right? The Chinese Zodiac. The Chinese Zodiac has 12 animals on it. 11 of them are animals that we know. But then there's a dragon. There's a dragon. And many people would say, as they would look at that Chinese Zodiac, that it features these 12 animals, and that 11 are real, and one is mythological. Does that really make sense? If they have 11 known animals that we can still see today, that we still understand what they are, then they have this dragon. I think that it's a better explanation to say that they encountered these types of dinosaurs, these dragon-like animals, and they probably called them dragons because, remember, it wasn't until 1841 that the word dinosaur was ever used in the English language. I want to read this to you as well as we conclude this evening. This is an article that was written in June of 2020. So just a year and a couple of weeks ago, it was written on June 10th of 2020. And it says, in 2017, so a few years ago, a large dinosaur was discovered, washed out to sea, and it was similar to a dinosaur bone that was found 70 miles off of Norway's coast. Only this one was partially intact, nearly perfectly preserved. And here's something that's very interesting. It still contained its last meal fossilized inside its stomach. That's of interest, is it not? I read part of this a moment ago, but fossils have to be buried fast and deep to be preserved. There's no gentle drifting out to sea, settling to the bottom, and then somehow becoming buried so that no scavengers attack the carcass. As the dinosaurs did various research and what have you on this particular fossil, they discovered that there were 48 varieties of plants in this dinosaur's stomach. They made very interesting comments with regard to the plants that were found and just the plant structure and so on and so forth. And they say this, the man that wrote the article says, obviously the dinosaur was buried so quickly in the ocean that even its stomach contents didn't have time to rot. And then he asked this question, how do you explain that? What's your explanation for that? How does someone explain this? And he says this, again, to answer or to ask the question that I mentioned at the very beginning, the problem is not what we see, but how we interpret what we see. So when somebody sees this and they see this fossil, this dinosaur, and it's got its last meal fossilized in its stomach, it didn't even rot, it didn't decay, it's fossilized in its stomach, 48 varieties of plants. How does that happen? The man that wrote this article says the best explanation for this wonderfully preserved dinosaur and its intact stomach contents is that it was buried rapidly in the flood. Only a global flood with massive tsunami-like waves could transport a nearly intact one-and-a-half ton dinosaur out to sea and bury it fast enough to preserve it so perfectly. That was a great conclusion to this particular article with regard to how do you explain what you're seeing. We don't have to be afraid of talking to people about dinosaurs. But I will caution you with this, most people aren't coming from a biblical worldview. So when you begin with a biblical worldview, you understand that people are going to oppose that. But I would tell you this, especially for those that have children at home and some of the little kids that were so excited about dinosaurs and so on and so forth, little Ari had a dinosaur shirt on, I saw him on Friday and he had a dinosaur shirt on, and kids like dinosaurs. But I would caution you with regard to dinosaurs because the world teaches something entirely different than what the Word of God would say about dinosaurs. When they begin to teach all of their evolutionary nonsense and they teach all of their stuff about all of these millions and billions of years, it really can undermine the authority of the Word of God with regard to other subject matters. And so I would encourage that we would be able to adequately go to the Word of God and say, here's what God's Word says. You don't have to see the word dinosaur to understand that these beasts exist. And that though that word isn't used, it wasn't used for a long time in any other writings. So why criticize the Bible because the word isn't there? It wasn't a word that existed. And therefore that argument should be thrown out, in my opinion. And so this evening, we can answer the question, where did dinosaurs come from? God made them. God made them. Did dinosaurs and humans live at the same time? Emphatically, yes. Absolutely. To the best of our understanding of Genesis chapter 1, they were created on the same exact day. Where did they go? What happened to them? Why so many fossils? There was a global flood. And only the things that were taken onto the ark, only Noah and his wife and his three sons and their wives, eight people, they were the only ones saved. And the animals that were brought thereon. Every other thing died. Therefore you have lots of fossils, billions of fossils. We find that one day when God said, alright Noah, the waters have assuaged, it's time to come off the ark. Not only did Noah and his family come off, but all the animals came off, including dinosaurs. And therefore we have records, of some of which I shared with you this evening, we have these historical records of man interacting with dinosaurs. Man depicting dinosaurs in very old carvings and paintings and what have you. Why? Because they exist. They existed. And they're a real thing. And so we don't have to shy away from it. We don't have to be fearful of it. And we start with the Bible and we end with the Bible. Here's what the Word of God says. Understand, the natural man receiveth not the things of the Spirit of God, their foolishness unto him, neither can he know them, for they are spiritually discerned. People continue to push away the record of Genesis, and they seek to interpret things through their own mind and their own understanding. But the reality is that God's record makes a lot of sense. It gives us the truth. Why? Because He is the truth. And He is the Creator. And He says, here's how it all happened. We love you. We thank you for loving us. I know it was a very teachy type of a message this evening, but I hope that somehow tonight you have strengthened us in our ability to have confidence in your Word with regard even to the subject matter of dinosaurs. There are times in which we see things. Perhaps we've been taught things in some other setting somewhere, maybe in college or elsewhere, where people have sought to teach us something entirely different with regard to dinosaurs. And maybe we just felt inadequate on being able to answer the question or even to engage in discussion with someone. God, I pray that you'd help us tonight to once again have that firm foundation of your Word, knowing that you've given us the truth, knowing that you are the Creator of all things, and that you've given us a record that provides us with answers to many of these questions. I pray that you'd strengthen our faith. Lord, we pray that you'd give us a blessed time of fellowship tonight as we have birthday fellowship. I pray that you would be exalted in our midst, that you'd help us to have a sweet time, and we'll thank you for all that you'll do. For it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.880000114440918,
      "text": " number one and we of course have been studying through the book of Genesis in"
    },
    {
      "id": 1,
      "start": 4.880000114440918,
      "end": 10.800000190734863,
      "text": " fact we this is our 51st lesson through the book of Genesis and we have"
    },
    {
      "id": 2,
      "start": 10.800000190734863,
      "end": 17.719999313354492,
      "text": " effective successfully completed 19 chapters of study in 50 lessons and so"
    },
    {
      "id": 3,
      "start": 17.719999313354492,
      "end": 24.0,
      "text": " we're right on track to finish in three years or so but in any case this lesson"
    },
    {
      "id": 4,
      "start": 24.0,
      "end": 27.920000076293945,
      "text": " that I'm going to teach this evening that I have titled what about dinosaurs"
    },
    {
      "id": 5,
      "start": 27.920000076293945,
      "end": 34.400001525878906,
      "text": " was a lesson that I was going to teach way back in March of 2020 and I guess"
    },
    {
      "id": 6,
      "start": 34.400001525878906,
      "end": 38.0,
      "text": " last week of March first week of April somewhere in that time frame is what my"
    },
    {
      "id": 7,
      "start": 38.0,
      "end": 42.52000045776367,
      "text": " plan was to teach it and of course kovat came and service schedules got all kinds"
    },
    {
      "id": 8,
      "start": 42.52000045776367,
      "end": 48.20000076293945,
      "text": " of weird and I was preaching to a camera only and for several weeks and what have"
    },
    {
      "id": 9,
      "start": 48.20000076293945,
      "end": 52.63999938964844,
      "text": " you just had a handful of people here and so I ended up just continuing to go"
    },
    {
      "id": 10,
      "start": 52.63999938964844,
      "end": 57.880001068115234,
      "text": " through the book of Genesis and never really had an easy stopping point with"
    },
    {
      "id": 11,
      "start": 57.880001068115234,
      "end": 62.400001525878906,
      "text": " regard to the just the dialogue that's going through the book of Genesis and"
    },
    {
      "id": 12,
      "start": 62.400001525878906,
      "end": 66.91999816894531,
      "text": " when I finished the 19th chapter I felt that it was a good break point to be"
    },
    {
      "id": 13,
      "start": 66.91999816894531,
      "end": 70.4800033569336,
      "text": " able to of course some things with Abraham continue but it was a good"
    },
    {
      "id": 14,
      "start": 70.4800033569336,
      "end": 75.68000030517578,
      "text": " break point for us to be able to have this lesson this evening and so many of"
    },
    {
      "id": 15,
      "start": 75.68000030517578,
      "end": 81.44000244140625,
      "text": " the children were coming up to me saying is it true pastor are you teaching about"
    },
    {
      "id": 16,
      "start": 81.44000244140625,
      "end": 87.4800033569336,
      "text": " dinosaurs tonight and they were all excited and one little boy I won't tell"
    },
    {
      "id": 17,
      "start": 87.4800033569336,
      "end": 91.5199966430664,
      "text": " you who was so excited that he almost couldn't ask me the question and the"
    },
    {
      "id": 18,
      "start": 91.5199966430664,
      "end": 95.55999755859375,
      "text": " father kept saying go ahead ask him ask him ask him and finally enough courage"
    },
    {
      "id": 19,
      "start": 95.55999755859375,
      "end": 100.08000183105469,
      "text": " to say is it true that you're gonna teach on dinosaurs and then asked why"
    },
    {
      "id": 20,
      "start": 100.08000183105469,
      "end": 105.91999816894531,
      "text": " and of course the the truth of God's Word is important that we'd understand"
    },
    {
      "id": 21,
      "start": 105.91999816894531,
      "end": 111.4800033569336,
      "text": " even the subject matter of dinosaurs in fact I believe this evening that there"
    },
    {
      "id": 22,
      "start": 111.4800033569336,
      "end": 117.68000030517578,
      "text": " are times in our lives that we may shy away or maybe even avoid a conversation"
    },
    {
      "id": 23,
      "start": 117.68000030517578,
      "end": 121.4000015258789,
      "text": " with someone about dinosaurs because we just simply don't know how to deal with"
    },
    {
      "id": 24,
      "start": 121.4000015258789,
      "end": 125.0,
      "text": " it we don't know how to answer the questions we don't feel like we have"
    },
    {
      "id": 25,
      "start": 125.0,
      "end": 131.75999450683594,
      "text": " been adequately trained we can't debate their science and so on and so forth and"
    },
    {
      "id": 26,
      "start": 131.75999450683594,
      "end": 138.0800018310547,
      "text": " so we may shy away or even avoid altogether some conversations with"
    },
    {
      "id": 27,
      "start": 138.0800018310547,
      "end": 142.16000366210938,
      "text": " people about a subject matter like dinosaurs because we just don't know and"
    },
    {
      "id": 28,
      "start": 142.16000366210938,
      "end": 147.16000366210938,
      "text": " this evening I want to right up front admit to you that I am NOT a"
    },
    {
      "id": 29,
      "start": 147.16000366210938,
      "end": 152.75999450683594,
      "text": " paleontologist I do not study dinosaurs I don't study fossils and I did a lot of"
    },
    {
      "id": 30,
      "start": 152.75999450683594,
      "end": 157.1999969482422,
      "text": " study for this particular message and I hope it'll be a blessing to you but we"
    },
    {
      "id": 31,
      "start": 157.1999969482422,
      "end": 161.67999267578125,
      "text": " understand that there are many paleontologists that do lots of work and"
    },
    {
      "id": 32,
      "start": 161.67999267578125,
      "end": 167.9199981689453,
      "text": " there have been volumes scores of books that have been written upon dinosaurs"
    },
    {
      "id": 33,
      "start": 167.9199981689453,
      "end": 172.1999969482422,
      "text": " and we understand there are many documentaries that you can watch and"
    },
    {
      "id": 34,
      "start": 172.1999969482422,
      "end": 177.16000366210938,
      "text": " listen to and people that have all sorts of credentials and what-have-you in fact"
    },
    {
      "id": 35,
      "start": 177.16000366210938,
      "end": 182.24000549316406,
      "text": " it's exciting that there are plenty of good resources that are available of"
    },
    {
      "id": 36,
      "start": 182.24000549316406,
      "end": 187.0,
      "text": " those that have been adequately appropriately trained to be able to"
    },
    {
      "id": 37,
      "start": 187.0,
      "end": 192.47999572753906,
      "text": " discuss the subject matter in great detail that are coming from it from a"
    },
    {
      "id": 38,
      "start": 192.47999572753906,
      "end": 197.0800018310547,
      "text": " biblical worldview a biblical perspective you don't always find that"
    },
    {
      "id": 39,
      "start": 197.0800018310547,
      "end": 202.1999969482422,
      "text": " of course and so I would encourage you that as of course children are super"
    },
    {
      "id": 40,
      "start": 202.1999969482422,
      "end": 206.16000366210938,
      "text": " excited and interested in dinosaurs but as you begin to maybe through this study"
    },
    {
      "id": 41,
      "start": 206.16000366210938,
      "end": 210.0,
      "text": " have some interest in learning some additional things there are some good"
    },
    {
      "id": 42,
      "start": 210.0,
      "end": 215.36000061035156,
      "text": " resources out there I will say this there are two organizations one of them"
    },
    {
      "id": 43,
      "start": 215.36000061035156,
      "end": 220.47999572753906,
      "text": " is answers in Genesis I do not give a broad statement of support to any"
    },
    {
      "id": 44,
      "start": 220.47999572753906,
      "end": 224.60000610351562,
      "text": " organization but I will tell you that they have some good materials on"
    },
    {
      "id": 45,
      "start": 224.60000610351562,
      "end": 228.8800048828125,
      "text": " creation they have some good materials on dinosaurs and what-have-you and then"
    },
    {
      "id": 46,
      "start": 228.8800048828125,
      "end": 232.8800048828125,
      "text": " the Institute of Creation Research again I'm not giving a broad you know"
    },
    {
      "id": 47,
      "start": 232.8800048828125,
      "end": 238.0399932861328,
      "text": " statement with support fully of either of these organizations but I do say that"
    },
    {
      "id": 48,
      "start": 238.0399932861328,
      "end": 241.67999267578125,
      "text": " they are organizations are out there that have lots of good material that"
    },
    {
      "id": 49,
      "start": 241.67999267578125,
      "end": 246.47999572753906,
      "text": " comes from a biblical perspective a biblical worldview I believe that as we"
    },
    {
      "id": 50,
      "start": 246.47999572753906,
      "end": 250.0,
      "text": " begin to study and think about this that it would be important that we understand"
    },
    {
      "id": 51,
      "start": 250.0,
      "end": 254.44000244140625,
      "text": " of course as a pastor that I'm going to be approaching this with a biblical"
    },
    {
      "id": 52,
      "start": 254.44000244140625,
      "end": 259.2799987792969,
      "text": " worldview and having a biblical worldview and starting with and ending"
    },
    {
      "id": 53,
      "start": 259.2799987792969,
      "end": 264.3599853515625,
      "text": " with the Bible will lead us to a place where we will have different conclusions"
    },
    {
      "id": 54,
      "start": 264.3599853515625,
      "end": 269.9599914550781,
      "text": " and different understandings than those who doubt or just straight-up oppose the"
    },
    {
      "id": 55,
      "start": 269.9599914550781,
      "end": 275.1199951171875,
      "text": " Word of God and so we have to understand that one of the lessons that I"
    },
    {
      "id": 56,
      "start": 275.1199951171875,
      "end": 279.6400146484375,
      "text": " previously taught we dealt with the flood and I dealt with the Grand Canyon"
    },
    {
      "id": 57,
      "start": 279.6400146484375,
      "end": 283.3999938964844,
      "text": " in a particular message and looked at a number of things of how the waters"
    },
    {
      "id": 58,
      "start": 283.3999938964844,
      "end": 287.67999267578125,
      "text": " assuaged and how that could be formed very easily and quickly we also looked"
    },
    {
      "id": 59,
      "start": 287.67999267578125,
      "end": 291.20001220703125,
      "text": " at a subject matter and spent an entire lesson dealing with the Ice Age and"
    },
    {
      "id": 60,
      "start": 291.20001220703125,
      "end": 294.9200134277344,
      "text": " dealing with those things and one thing that I said repeatedly in those two"
    },
    {
      "id": 61,
      "start": 294.9200134277344,
      "end": 300.67999267578125,
      "text": " messages I'll say it again this evening the problem is not with what we see but"
    },
    {
      "id": 62,
      "start": 300.67999267578125,
      "end": 304.67999267578125,
      "text": " it's with how we interpret what we see listen there are plenty of fossils out"
    },
    {
      "id": 63,
      "start": 304.67999267578125,
      "end": 309.760009765625,
      "text": " there that show us that dinosaurs existed and the problem is not with what"
    },
    {
      "id": 64,
      "start": 309.760009765625,
      "end": 315.44000244140625,
      "text": " we see but it's in how we interpret that which we see and we find that it's"
    },
    {
      "id": 65,
      "start": 315.44000244140625,
      "end": 320.32000732421875,
      "text": " important that we begin with the Bible what does the Word of God say these"
    },
    {
      "id": 66,
      "start": 320.32000732421875,
      "end": 324.94000244140625,
      "text": " things that we see when we talk about maybe the the Grand Canyon we speak"
    },
    {
      "id": 67,
      "start": 324.94000244140625,
      "end": 328.9599914550781,
      "text": " about the Ice Age we talk about dinosaurs these things do not take"
    },
    {
      "id": 68,
      "start": 328.9599914550781,
      "end": 334.32000732421875,
      "text": " millions or even billions of years I I believe that they simply require the"
    },
    {
      "id": 69,
      "start": 334.32000732421875,
      "end": 339.739990234375,
      "text": " right conditions and we dealt with that we talked about the the Grand Canyon we"
    },
    {
      "id": 70,
      "start": 339.739990234375,
      "end": 343.1600036621094,
      "text": " dealt with that we talked about the Ice Age and some of those conditions and I"
    },
    {
      "id": 71,
      "start": 343.1600036621094,
      "end": 347.0,
      "text": " think that that's also pertinent here to our discussion this evening I have you"
    },
    {
      "id": 72,
      "start": 347.0,
      "end": 350.1199951171875,
      "text": " there in the book of Genesis I want to read one verse to you from the New"
    },
    {
      "id": 73,
      "start": 350.1199951171875,
      "end": 354.29998779296875,
      "text": " Testament in 1st Thessalonians 5 and then we'll get right back to Genesis"
    },
    {
      "id": 74,
      "start": 354.29998779296875,
      "end": 358.7799987792969,
      "text": " chapter 1 but in 1st Thessalonians 5 in verse number 21 the Bible says this"
    },
    {
      "id": 75,
      "start": 358.7799987792969,
      "end": 366.739990234375,
      "text": " prove all things hold fast that which is good and let me just give you let me"
    },
    {
      "id": 76,
      "start": 366.739990234375,
      "end": 370.3800048828125,
      "text": " look at read a couple of verses of Scripture and then give you some common"
    },
    {
      "id": 77,
      "start": 370.3800048828125,
      "end": 374.7799987792969,
      "text": " teaching with regard to dinosaurs and then give some biblical answers in"
    },
    {
      "id": 78,
      "start": 374.7799987792969,
      "end": 380.4200134277344,
      "text": " Genesis 1 in verse number 24 the Bible says this and God said let the earth"
    },
    {
      "id": 79,
      "start": 380.4200134277344,
      "end": 387.5400085449219,
      "text": " bring forth the living creature after his kind cattle and creeping thing and"
    },
    {
      "id": 80,
      "start": 387.5400085449219,
      "end": 395.1000061035156,
      "text": " beast of the earth after his kind and it was so and God made the beast of the"
    },
    {
      "id": 81,
      "start": 395.1000061035156,
      "end": 401.260009765625,
      "text": " earth after his kind and cattle after their kind and everything that creepeth"
    },
    {
      "id": 82,
      "start": 401.260009765625,
      "end": 407.9800109863281,
      "text": " upon the earth after his kind and God saw that it was good we'll look at some"
    },
    {
      "id": 83,
      "start": 407.9800109863281,
      "end": 412.1000061035156,
      "text": " more verses here as we get through the lesson this evening but we find that"
    },
    {
      "id": 84,
      "start": 412.1000061035156,
      "end": 417.5799865722656,
      "text": " here these verses in verse 24 and 25 are the first verses dealing with that which"
    },
    {
      "id": 85,
      "start": 417.5799865722656,
      "end": 422.05999755859375,
      "text": " was created on day six of creation and we find that God is giving us"
    },
    {
      "id": 86,
      "start": 422.05999755859375,
      "end": 426.0199890136719,
      "text": " information throughout the record of Genesis chapter 1 with regard to"
    },
    {
      "id": 87,
      "start": 426.0199890136719,
      "end": 430.94000244140625,
      "text": " creation and one phrase that you'll find repeated we read it multiple times just"
    },
    {
      "id": 88,
      "start": 430.94000244140625,
      "end": 437.739990234375,
      "text": " in those two verses is this word kind after his kind after their kind and it's"
    },
    {
      "id": 89,
      "start": 437.739990234375,
      "end": 440.739990234375,
      "text": " important that we understand that we dealt with that many many months ago"
    },
    {
      "id": 90,
      "start": 440.739990234375,
      "end": 444.739990234375,
      "text": " actually a year and a half ago as we studied Genesis 1 in more detail in each"
    },
    {
      "id": 91,
      "start": 444.739990234375,
      "end": 449.82000732421875,
      "text": " day of creation with regard to dinosaurs specifically and answering the question"
    },
    {
      "id": 92,
      "start": 449.82000732421875,
      "end": 453.8999938964844,
      "text": " what about dinosaurs let me just give you a few things that people will say"
    },
    {
      "id": 93,
      "start": 453.8999938964844,
      "end": 458.1000061035156,
      "text": " common teaching common thoughts with regard to dinosaurs number one they'll"
    },
    {
      "id": 94,
      "start": 458.1000061035156,
      "end": 464.5,
      "text": " say this dinosaurs reigned for a hundred and sixty five million years after"
    },
    {
      "id": 95,
      "start": 464.5,
      "end": 469.70001220703125,
      "text": " evolving from some other type of reptile now rate at face value do you have any"
    },
    {
      "id": 96,
      "start": 469.70001220703125,
      "end": 474.1000061035156,
      "text": " problems with that statement I got a couple of problems right away the"
    },
    {
      "id": 97,
      "start": 474.1000061035156,
      "end": 478.1400146484375,
      "text": " timeline 165 million years I got a problem with the timeline and I got a"
    },
    {
      "id": 98,
      "start": 478.17999267578125,
      "end": 481.6600036621094,
      "text": " problem with the fact that they evolve from other reptiles and we'll deal with"
    },
    {
      "id": 99,
      "start": 481.6600036621094,
      "end": 486.70001220703125,
      "text": " that we'll discuss that approximately 65 million years ago so for a hundred and"
    },
    {
      "id": 100,
      "start": 486.70001220703125,
      "end": 491.2200012207031,
      "text": " sixty five million years these dinosaurs reigned upon the earth and then 65"
    },
    {
      "id": 101,
      "start": 491.2200012207031,
      "end": 495.1000061035156,
      "text": " million years ago there was some major event they would believe it was some"
    },
    {
      "id": 102,
      "start": 495.1000061035156,
      "end": 500.8999938964844,
      "text": " kind of an asteroid that struck earth and killed off the dinosaurs I got a"
    },
    {
      "id": 103,
      "start": 500.8999938964844,
      "end": 504.82000732421875,
      "text": " problem with that as well I got a problem with the timeline again and I"
    },
    {
      "id": 104,
      "start": 504.82000732421875,
      "end": 508.4200134277344,
      "text": " have a problem with the answer as to what happened but here's the the the"
    },
    {
      "id": 105,
      "start": 508.4200134277344,
      "end": 512.8599853515625,
      "text": " reality remember the problem is not with what we see but how we interpret what we"
    },
    {
      "id": 106,
      "start": 512.8599853515625,
      "end": 516.5,
      "text": " say right so nobody was around a hundred sixty five million years ago no one's"
    },
    {
      "id": 107,
      "start": 516.5,
      "end": 520.2999877929688,
      "text": " around 65 million years ago and they're looking at these fossils and they're"
    },
    {
      "id": 108,
      "start": 520.2999877929688,
      "end": 524.4199829101562,
      "text": " coming from a perspective of no biblical worldview and they're saying where did"
    },
    {
      "id": 109,
      "start": 524.4199829101562,
      "end": 529.6599731445312,
      "text": " this stuff come from how did it get here and they just begin to come up with some"
    },
    {
      "id": 110,
      "start": 529.6599731445312,
      "end": 533.4199829101562,
      "text": " kind of answers and they give some kind of scientific reason and logic and so on"
    },
    {
      "id": 111,
      "start": 533.4199829101562,
      "end": 539.0599975585938,
      "text": " and so forth and we find that they would dismiss Bible truth another common"
    },
    {
      "id": 112,
      "start": 539.0599975585938,
      "end": 544.3400268554688,
      "text": " teaching would be this that humans and dinosaurs did not live at the same time"
    },
    {
      "id": 113,
      "start": 544.3400268554688,
      "end": 550.2999877929688,
      "text": " they would say that there was nearly 65 million years that passed before humans"
    },
    {
      "id": 114,
      "start": 550.2999877929688,
      "end": 555.5,
      "text": " appeared on earth well I got a problem with that as well as you look at the"
    },
    {
      "id": 115,
      "start": 555.5,
      "end": 560.780029296875,
      "text": " account of Genesis and the verses that I just read in verses 24 and 25 of the"
    },
    {
      "id": 116,
      "start": 560.780029296875,
      "end": 564.1400146484375,
      "text": " creation of day six you know what happens right after that event is God"
    },
    {
      "id": 117,
      "start": 564.1400146484375,
      "end": 569.5800170898438,
      "text": " creates man on the same day day number six and so I have problems with that and"
    },
    {
      "id": 118,
      "start": 569.5800170898438,
      "end": 575.0599975585938,
      "text": " here's one of the things that they often say that I believe can cause us to have"
    },
    {
      "id": 119,
      "start": 575.0599975585938,
      "end": 579.260009765625,
      "text": " great difficulty in engaging in conversations with individuals and it's"
    },
    {
      "id": 120,
      "start": 579.260009765625,
      "end": 585.739990234375,
      "text": " this that the word dinosaur doesn't even appear in the Bible right so they'll say"
    },
    {
      "id": 121,
      "start": 585.739990234375,
      "end": 588.6199951171875,
      "text": " something to the effect of the word dinosaur doesn't appear in the Bible and"
    },
    {
      "id": 122,
      "start": 588.6599731445312,
      "end": 592.4199829101562,
      "text": " so the Bible doesn't say anything about dinosaurs there's nothing in there about"
    },
    {
      "id": 123,
      "start": 592.4199829101562,
      "end": 596.9400024414062,
      "text": " it and so how are you going to talk to me about dinosaurs right they'll say"
    },
    {
      "id": 124,
      "start": 596.9400024414062,
      "end": 600.0599975585938,
      "text": " something like that well here's what's interesting about the word"
    },
    {
      "id": 0,
      "start": 600.0599975585938,
      "end": 607.0599975585938,
      "text": " dinosaur. The word dinosaur was first used by Sir Richard Owen in 1841. All"
    },
    {
      "id": 1,
      "start": 607.0599975585938,
      "end": 610.7999973297119,
      "text": " right, that's a hundred and forty years ago. It was the first time the word"
    },
    {
      "id": 2,
      "start": 610.7999973297119,
      "end": 616.0999984741211,
      "text": " dinosaur was ever used. It was used by this man, Sir Richard Owen, as he was"
    },
    {
      "id": 3,
      "start": 616.0999984741211,
      "end": 620.5799980163574,
      "text": " addressing the British Association for the Advancement of Science. The term was"
    },
    {
      "id": 4,
      "start": 620.5799980163574,
      "end": 627.5399971008301,
      "text": " then published in 1842. So if the term was first used in 1841 and we find that"
    },
    {
      "id": 5,
      "start": 627.5399971008301,
      "end": 632.819995880127,
      "text": " it was then used, I said, I think I said 140, it'd be 180 years ago, and it was"
    },
    {
      "id": 6,
      "start": 632.819995880127,
      "end": 637.8599967956543,
      "text": " then published in 1842, we would not expect the word dinosaur to be in our"
    },
    {
      "id": 7,
      "start": 637.8599967956543,
      "end": 644.1399993896484,
      "text": " Bible, right? We understand that the word, if there's a word, you know, they have"
    },
    {
      "id": 8,
      "start": 644.1399993896484,
      "end": 649.3399963378906,
      "text": " in the English language, the dictionary, they have new words that they add into"
    },
    {
      "id": 9,
      "start": 649.3399963378906,
      "end": 652.6599960327148,
      "text": " the dictionary all the time. And each year they have a certain number of words"
    },
    {
      "id": 10,
      "start": 652.6599960327148,
      "end": 656.2599983215332,
      "text": " that they add into the dictionary. Well, it would be foolish of us to say that"
    },
    {
      "id": 11,
      "start": 656.2599983215332,
      "end": 660.4599990844727,
      "text": " there was a word entered into the dictionary in 2020 and we'd have an"
    },
    {
      "id": 12,
      "start": 660.4599990844727,
      "end": 664.2599945068359,
      "text": " issue with the fact that that word was nowhere to be found in any legal"
    },
    {
      "id": 13,
      "start": 664.2599945068359,
      "end": 669.9599990844727,
      "text": " documents or otherwise in 1984. Well, of course it wasn't in those documents in"
    },
    {
      "id": 14,
      "start": 669.9599990844727,
      "end": 673.8600006103516,
      "text": " 1984 because those documents were written before that word was ever"
    },
    {
      "id": 15,
      "start": 673.8600006103516,
      "end": 677.8600006103516,
      "text": " injected into the English language. And so we understand that the Bible was"
    },
    {
      "id": 16,
      "start": 677.8600006103516,
      "end": 682.8999938964844,
      "text": " originally the the Old Testament, Hebrew and Aramaic. We understand the New"
    },
    {
      "id": 17,
      "start": 682.8999938964844,
      "end": 687.5799942016602,
      "text": " Testament to be Greek, and we find that this Bible, of course, you think about"
    },
    {
      "id": 18,
      "start": 687.5799942016602,
      "end": 690.6599960327148,
      "text": " the Word of God and the existence of the Word of God and how God gave His Word,"
    },
    {
      "id": 19,
      "start": 690.6599960327148,
      "end": 695.2999954223633,
      "text": " and in 1841 some guy comes along and uses the word dinosaur, and there are"
    },
    {
      "id": 20,
      "start": 695.2999954223633,
      "end": 698.3399963378906,
      "text": " people that will say to you as a Bible-believing Christian that you can't"
    },
    {
      "id": 21,
      "start": 698.3399963378906,
      "end": 702.5,
      "text": " have, you have no authority to talk about dinosaurs because the word doesn't exist"
    },
    {
      "id": 22,
      "start": 702.5,
      "end": 706.5,
      "text": " in the Bible, and so God doesn't know anything about it. That's just foolish."
    },
    {
      "id": 23,
      "start": 706.5,
      "end": 710.9399948120117,
      "text": " But the reality is that sometimes it will stop us dead in our tracks because"
    },
    {
      "id": 24,
      "start": 710.9399948120117,
      "end": 714.9399948120117,
      "text": " you cannot find the word dinosaur in the Bible. I don't care what kind of"
    },
    {
      "id": 25,
      "start": 714.9399948120117,
      "end": 718.8600006103516,
      "text": " concordance you have, it's not there, but it does not"
    },
    {
      "id": 26,
      "start": 718.8600006103516,
      "end": 723.8600006103516,
      "text": " mean that God's Word doesn't deal with the subject matter of dinosaurs. And so"
    },
    {
      "id": 27,
      "start": 723.8600006103516,
      "end": 728.0599975585938,
      "text": " let me answer just a few questions if I can. The first question I would ask by"
    },
    {
      "id": 28,
      "start": 728.0599975585938,
      "end": 730.7799987792969,
      "text": " way of kind of teaching through this this evening would be this, where did"
    },
    {
      "id": 29,
      "start": 730.7799987792969,
      "end": 735.2599945068359,
      "text": " dinosaurs come from? Of course, I'm sure you already know what my answer is, but"
    },
    {
      "id": 30,
      "start": 735.2599945068359,
      "end": 738.7799987792969,
      "text": " let's look at what the Word of God says. Where did dinosaurs come from? Of course,"
    },
    {
      "id": 31,
      "start": 738.8199920654297,
      "end": 742.3399963378906,
      "text": " we mentioned that they said that they reigned upon the earth for about 165"
    },
    {
      "id": 32,
      "start": 742.3399963378906,
      "end": 746.739990234375,
      "text": " million years after evolving from reptiles, some other kind of reptile. We"
    },
    {
      "id": 33,
      "start": 746.739990234375,
      "end": 751.3800048828125,
      "text": " reject evolution, and therefore we would conclude that they had to have been"
    },
    {
      "id": 34,
      "start": 751.3800048828125,
      "end": 756.3399963378906,
      "text": " created by God. The Word of God clearly states in multiple places, remember I"
    },
    {
      "id": 35,
      "start": 756.3399963378906,
      "end": 761.8999938964844,
      "text": " mentioned to you that the the subject of creation is not isolated to Genesis 1."
    },
    {
      "id": 36,
      "start": 761.8999938964844,
      "end": 766.4199981689453,
      "text": " The subject of creation is found all throughout the Word of God, and we find"
    },
    {
      "id": 37,
      "start": 766.4199981689453,
      "end": 770.2200012207031,
      "text": " that there are many references throughout the whole of the Bible that"
    },
    {
      "id": 38,
      "start": 770.2200012207031,
      "end": 776.1799926757812,
      "text": " speaks of God being the creator of all things. And we find that God is the"
    },
    {
      "id": 39,
      "start": 776.1799926757812,
      "end": 779.7799987792969,
      "text": " creator of all things, and we understand that as you read the record of Genesis"
    },
    {
      "id": 40,
      "start": 779.7799987792969,
      "end": 784.0999908447266,
      "text": " chapter number 1, and we dealt with this in great detail, that this is a"
    },
    {
      "id": 41,
      "start": 784.0999908447266,
      "end": 790.6600036621094,
      "text": " literal 24-hour day, a six-day creation. We find that God mentions to the"
    },
    {
      "id": 42,
      "start": 790.6600036621094,
      "end": 794.3399963378906,
      "text": " children of Israel that in six days God made all things, and he repeats this"
    },
    {
      "id": 43,
      "start": 794.4199981689453,
      "end": 797.7799987792969,
      "text": " throughout the Word of God. And the reference that I read in verses 24 and"
    },
    {
      "id": 44,
      "start": 797.7799987792969,
      "end": 803.0200042724609,
      "text": " 25, that is the event of the creation on day number six, and you find that in verse"
    },
    {
      "id": 45,
      "start": 803.0200042724609,
      "end": 807.9400024414062,
      "text": " number 25 that the Word of God says, and God made the beast of the"
    },
    {
      "id": 46,
      "start": 807.9400024414062,
      "end": 812.8600006103516,
      "text": " earth after his kind. And so we find their cattle after their kind, everything"
    },
    {
      "id": 47,
      "start": 812.8600006103516,
      "end": 817.0999908447266,
      "text": " that creepeth upon the earth after his kind, and God saw that was good. And we"
    },
    {
      "id": 48,
      "start": 817.0999908447266,
      "end": 820.6999969482422,
      "text": " focus upon that statement, it says God made the beast of the earth after his"
    },
    {
      "id": 49,
      "start": 820.739990234375,
      "end": 825.1799926757812,
      "text": " kind. Admittedly, the Word is not dinosaur. Again, to reference what I said a moment"
    },
    {
      "id": 50,
      "start": 825.1799926757812,
      "end": 828.3399963378906,
      "text": " ago, the Word did not exist, and therefore we would not expect to find"
    },
    {
      "id": 51,
      "start": 828.3399963378906,
      "end": 833.0200042724609,
      "text": " that Word in the Word of God. But we remember, and we're mindful of the fact"
    },
    {
      "id": 52,
      "start": 833.0200042724609,
      "end": 837.6999969482422,
      "text": " that God's Word clearly teaches that God made all things in six days, and that"
    },
    {
      "id": 53,
      "start": 837.6999969482422,
      "end": 841.2599945068359,
      "text": " would include dinosaurs. Now, there are some that would have the idea that"
    },
    {
      "id": 54,
      "start": 841.2599945068359,
      "end": 846.6199951171875,
      "text": " perhaps it was on day five and day six, maybe there was some on day five, some on"
    },
    {
      "id": 55,
      "start": 846.6199951171875,
      "end": 849.739990234375,
      "text": " day six, there is certainly some that could have an argument with that"
    },
    {
      "id": 56,
      "start": 849.8199920654297,
      "end": 853.7799987792969,
      "text": " On day number five, you'll see that it begins in verse number 20, and God"
    },
    {
      "id": 57,
      "start": 853.7799987792969,
      "end": 857.5,
      "text": " said, Let the waters bring forth abundantly the moving creature that hath"
    },
    {
      "id": 58,
      "start": 857.5,
      "end": 861.0599975585938,
      "text": " life, and fowl that they may fly above the earth in the open firmament of heaven."
    },
    {
      "id": 59,
      "start": 861.0599975585938,
      "end": 864.5400085449219,
      "text": " And God created great whales, and every living creature that moveth, which the"
    },
    {
      "id": 60,
      "start": 864.5400085449219,
      "end": 868.7799987792969,
      "text": " waters brought forth abundantly after their kind, and every winged fowl after"
    },
    {
      "id": 61,
      "start": 868.7799987792969,
      "end": 872.9400024414062,
      "text": " his kind. And God saw that it was good. And God blessed them, saying, Be fruitful"
    },
    {
      "id": 62,
      "start": 872.9400024414062,
      "end": 876.4599914550781,
      "text": " and multiply, and fill the waters in the seas, and let fowl multiply in the earth."
    },
    {
      "id": 63,
      "start": 876.4599914550781,
      "end": 879.8599853515625,
      "text": " And the evening and the morning were the fifth day. If you study all of the"
    },
    {
      "id": 64,
      "start": 879.8599853515625,
      "end": 882.8599853515625,
      "text": " dinosaurs, and I'm not going to get into it this evening, there are way too many of"
    },
    {
      "id": 65,
      "start": 882.8599853515625,
      "end": 885.8200073242188,
      "text": " them, and all this, I can't say all the words anyway, some of these little boys"
    },
    {
      "id": 66,
      "start": 885.8200073242188,
      "end": 889.2999877929688,
      "text": " can probably say some of the words better than I can, but the reality is"
    },
    {
      "id": 67,
      "start": 889.2999877929688,
      "end": 894.0599975585938,
      "text": " that there were some that were land creatures, some that were that were"
    },
    {
      "id": 68,
      "start": 894.0599975585938,
      "end": 897.2200012207031,
      "text": " flying creatures, and some that were in the the water, marine creatures, if you"
    },
    {
      "id": 69,
      "start": 897.2200012207031,
      "end": 901.260009765625,
      "text": " will. And so no doubt some of them could have been created there on day number"
    },
    {
      "id": 70,
      "start": 901.260009765625,
      "end": 906.1399841308594,
      "text": " five. It is of interest and of note that many people would argue, those that would"
    },
    {
      "id": 71,
      "start": 906.1399841308594,
      "end": 910.7000122070312,
      "text": " adopt the evolutionary perspective of not only where did dinosaurs come from,"
    },
    {
      "id": 72,
      "start": 910.7000122070312,
      "end": 914.0599975585938,
      "text": " but where did they end up, that they would speak about them becoming or"
    },
    {
      "id": 73,
      "start": 914.0599975585938,
      "end": 919.2999877929688,
      "text": " evolving into birds. But birds were created on day number five, as we see"
    },
    {
      "id": 74,
      "start": 919.2999877929688,
      "end": 925.0199890136719,
      "text": " clearly indicated here, and we find that to be the case in the Word of God. Now,"
    },
    {
      "id": 75,
      "start": 925.0199890136719,
      "end": 930.8999938964844,
      "text": " when we think about God creating these dinosaurs on day number six, as we look"
    },
    {
      "id": 76,
      "start": 930.8999938964844,
      "end": 935.739990234375,
      "text": " at verses 24 and 25, we will remember to answer the question where they say that"
    },
    {
      "id": 77,
      "start": 935.739990234375,
      "end": 940.6600036621094,
      "text": " man and dinosaur did not dwell on the earth at the same time. Remember they"
    },
    {
      "id": 78,
      "start": 940.6600036621094,
      "end": 946.2200012207031,
      "text": " mentioned that there's 65 million years after the extinction, if you will, of"
    },
    {
      "id": 79,
      "start": 946.2200012207031,
      "end": 950.1799926757812,
      "text": " dinosaurs, that man came upon the earth. Well, the Bible continues in verse number"
    },
    {
      "id": 80,
      "start": 950.1799926757812,
      "end": 956.739990234375,
      "text": " 26 of Genesis 1, and says, and God said, let us make man in our image after our"
    },
    {
      "id": 81,
      "start": 956.739990234375,
      "end": 960.4199829101562,
      "text": " likeness, and let them have dominion over the fish of the sea, and over the fowl of"
    },
    {
      "id": 82,
      "start": 960.4199829101562,
      "end": 964.1799926757812,
      "text": " the air, and over the cattle, and over all the earth, and over every creeping thing"
    },
    {
      "id": 83,
      "start": 964.1799926757812,
      "end": 968.8999938964844,
      "text": " that creepeth upon the earth. Verse 27, so God created man in his own image, and"
    },
    {
      "id": 84,
      "start": 968.8999938964844,
      "end": 974.5,
      "text": " the image of God created he him, male and female created he them. God blessed them,"
    },
    {
      "id": 85,
      "start": 974.5,
      "end": 978.7799987792969,
      "text": " and God said unto them, be fruitful and multiply, replenish the earth, and subdue"
    },
    {
      "id": 86,
      "start": 978.7799987792969,
      "end": 981.739990234375,
      "text": " it, and have dominion over the fish of the sea, and over the fowl of the air, and"
    },
    {
      "id": 87,
      "start": 981.739990234375,
      "end": 987.9400024414062,
      "text": " over every living thing that moveth upon the earth, including dinosaurs. All right,"
    },
    {
      "id": 88,
      "start": 987.9400024414062,
      "end": 991.1799926757812,
      "text": " that's what God says. He doesn't say including dinosaurs, I'm saying"
    },
    {
      "id": 89,
      "start": 991.1799926757812,
      "end": 995.4599914550781,
      "text": " that's what he's saying, because he says every living thing that"
    },
    {
      "id": 90,
      "start": 995.4599914550781,
      "end": 1000.0599975585938,
      "text": " moveth upon the earth, that would be inclusive of dinosaurs, and therefore we"
    },
    {
      "id": 91,
      "start": 1000.0599975585938,
      "end": 1006.2999877929688,
      "text": " would confidently conclude that humans and dinosaurs absolutely lived at the"
    },
    {
      "id": 92,
      "start": 1006.2999877929688,
      "end": 1012.2999877929688,
      "text": " same time, 100%. And we find, turn over to the book of Job, if you will, Job chapter"
    },
    {
      "id": 93,
      "start": 1012.2999877929688,
      "end": 1017.5400085449219,
      "text": " number 40. Turn to the book of Job, and I'm not gonna get into all of this this"
    },
    {
      "id": 94,
      "start": 1017.6199951171875,
      "end": 1021.4199829101562,
      "text": " evening, we won't be able to take the time to do so. I'm just gonna look at"
    },
    {
      "id": 95,
      "start": 1021.4199829101562,
      "end": 1025.1399841308594,
      "text": " chapter number 40, but you can look at chapter number 41 and read about Leviathan."
    },
    {
      "id": 96,
      "start": 1025.1399841308594,
      "end": 1028.8599853515625,
      "text": " We're gonna look at chapter number 40 and read about a behemoth, and"
    },
    {
      "id": 97,
      "start": 1028.8599853515625,
      "end": 1034.8200073242188,
      "text": " we think about behemoth, it begins here in Job chapter number 40, and I want you"
    },
    {
      "id": 98,
      "start": 1034.8200073242188,
      "end": 1041.8599853515625,
      "text": " to begin looking with me at verse number 15. Job 40 and verse number 15. Notice"
    },
    {
      "id": 99,
      "start": 1041.8599853515625,
      "end": 1046.1199951171875,
      "text": " what God is saying here. This is God's second speech, speaking of his power, the"
    },
    {
      "id": 100,
      "start": 1046.1199951171875,
      "end": 1049.3599853515625,
      "text": " Lord answered Job, if you look at verse number six, it said, then answered the"
    },
    {
      "id": 101,
      "start": 1049.3599853515625,
      "end": 1052.8800048828125,
      "text": " Lord unto Job out of the whirlwind and said, and so just so we can pick up"
    },
    {
      "id": 102,
      "start": 1052.8800048828125,
      "end": 1056.239990234375,
      "text": " context, I'm gonna begin in verse 15, but just so you understand, this is the Lord"
    },
    {
      "id": 103,
      "start": 1056.239990234375,
      "end": 1062.4800109863281,
      "text": " speaking to Job. Behold now, behemoth, which I have made with thee, he eateth"
    },
    {
      "id": 104,
      "start": 1062.4800109863281,
      "end": 1069.6000061035156,
      "text": " grass as an ox. Now notice the phrase, God says, which I made with thee, right? So"
    },
    {
      "id": 105,
      "start": 1069.6000061035156,
      "end": 1074.0,
      "text": " this behemoth that he's speaking of, God says, I made him, and then he says, he"
    },
    {
      "id": 106,
      "start": 1074.0799865722656,
      "end": 1083.2000122070312,
      "text": " eateth grass as an ox. Lo, now, verse number 16, his strength is in his loins and his"
    },
    {
      "id": 107,
      "start": 1083.2000122070312,
      "end": 1090.2000122070312,
      "text": " force is in the navel of his belly. Verse 17, he moveth his tail like a cedar. The"
    },
    {
      "id": 108,
      "start": 1090.2000122070312,
      "end": 1094.7200012207031,
      "text": " sinews of his stones are wrapped together. His bones are as strong pieces"
    },
    {
      "id": 109,
      "start": 1094.7200012207031,
      "end": 1101.6799926757812,
      "text": " of brass. His bones are like bars of iron. Notice verse 19, he is the chief of the"
    },
    {
      "id": 110,
      "start": 1101.6799926757812,
      "end": 1109.7200012207031,
      "text": " ways of God. He that made him, who's that? That's God. He that made him can make his"
    },
    {
      "id": 111,
      "start": 1109.7200012207031,
      "end": 1114.9600219726562,
      "text": " sword to approach unto him. Surely the mountains bring him forth food, where all"
    },
    {
      "id": 112,
      "start": 1114.9600219726562,
      "end": 1120.52001953125,
      "text": " the beasts of the field play. He lieth under the shady trees and the covert of"
    },
    {
      "id": 113,
      "start": 1120.52001953125,
      "end": 1125.5599975585938,
      "text": " the reed and fens. The shady trees cover him with their shadow. The willows of the"
    },
    {
      "id": 114,
      "start": 1125.5599975585938,
      "end": 1130.8400268554688,
      "text": " brook compass him about. Behold, he drinketh up a river and hasteth not. He"
    },
    {
      "id": 115,
      "start": 1130.8400268554688,
      "end": 1135.5599975585938,
      "text": " trusteth that he can draw up Jordan into his mouth. And so we begin to see, verse"
    },
    {
      "id": 116,
      "start": 1135.5599975585938,
      "end": 1139.3200073242188,
      "text": " number 24, says he taketh it with his eyes, his nose pierceth through with"
    },
    {
      "id": 117,
      "start": 1139.3200073242188,
      "end": 1144.5599975585938,
      "text": " piercing, pierceth through snares. And so we begin to look at these phraseologies and"
    },
    {
      "id": 118,
      "start": 1144.5599975585938,
      "end": 1149.2000122070312,
      "text": " all that's done and how it's explained to us. There are some, in fact, it might be"
    },
    {
      "id": 119,
      "start": 1149.2000122070312,
      "end": 1153.4000244140625,
      "text": " that you have a study Bible in your hand this evening that will say that behemoth"
    },
    {
      "id": 120,
      "start": 1153.4000244140625,
      "end": 1159.3599853515625,
      "text": " was like a hippopotamus, or that behemoth was like an elephant. Well, the"
    },
    {
      "id": 121,
      "start": 1159.3599853515625,
      "end": 1162.9600219726562,
      "text": " description that I just read to you does not line up with, I know what a"
    },
    {
      "id": 122,
      "start": 1162.9600219726562,
      "end": 1168.3599853515625,
      "text": " hippopotamus is, amen? I know what an elephant is. Neither one of them have a"
    },
    {
      "id": 123,
      "start": 1168.3599853515625,
      "end": 1174.0399780273438,
      "text": " tail like a cedar, right? I mean, they just don't fit the description. And so"
    },
    {
      "id": 124,
      "start": 1174.0399780273438,
      "end": 1178.8800048828125,
      "text": " therefore, for us to take this approach, and unfortunately Bible, study"
    },
    {
      "id": 125,
      "start": 1178.8800048828125,
      "end": 1182.3599853515625,
      "text": " Bibles and some Bible scholars of yesteryear, they would just take this"
    },
    {
      "id": 126,
      "start": 1182.3599853515625,
      "end": 1185.6799926757812,
      "text": " approach of saying, well, it must be a hippopotamus, it must be a whatever,"
    },
    {
      "id": 127,
      "start": 1185.6799926757812,
      "end": 1188.719970703125,
      "text": " because they don't know how to answer the question. And then you have more problems"
    },
    {
      "id": 128,
      "start": 1188.719970703125,
      "end": 1192.5599975585938,
      "text": " interacting with somebody because, well, the word dinosaur isn't there and they"
    },
    {
      "id": 129,
      "start": 1192.5599975585938,
      "end": 1197.2799682617188,
      "text": " say that it's a hippopotamus. It just doesn't line up. The description that God"
    },
    {
      "id": 130,
      "start": 1197.2799682617188,
      "end": 1202.1599731445312,
      "text": " gives here at the end of Job chapter number 40, this"
    },
    {
      "id": 0,
      "start": 1202.1599731445312,
      "end": 1210.1999731063843,
      "text": " This is not a hippo, this is not some kind of a large mammal, animal, elephant or otherwise."
    },
    {
      "id": 1,
      "start": 1210.1999731063843,
      "end": 1214.959973335266,
      "text": " We find that the description is given of a huge animal with a long neck that ate grass."
    },
    {
      "id": 2,
      "start": 1214.959973335266,
      "end": 1220.3199729919434,
      "text": " I believe that it would describe a sauropod if you would, perhaps even, and you guys bear"
    },
    {
      "id": 3,
      "start": 1220.3199729919434,
      "end": 1225.9999732971191,
      "text": " with me, some of these little kids can say the words better than I can, a brachiosaurus."
    },
    {
      "id": 4,
      "start": 1225.9999732971191,
      "end": 1228.9599723815918,
      "text": " And when you think about this particular, and I didn't take pictures and bring it up"
    },
    {
      "id": 5,
      "start": 1228.9599723815918,
      "end": 1234.5199737548828,
      "text": " here or anything, but you think about this particular dinosaur and you think about the"
    },
    {
      "id": 6,
      "start": 1234.5199737548828,
      "end": 1238.7599716186523,
      "text": " description of this dinosaur and you think about the way in which this description here"
    },
    {
      "id": 7,
      "start": 1238.7599716186523,
      "end": 1244.7599716186523,
      "text": " in Job 40 and the fossils that have been found, it matches greatly."
    },
    {
      "id": 8,
      "start": 1244.7599716186523,
      "end": 1249.119972229004,
      "text": " It's a great answer to, okay, it must have been behemoth, must have been a sauropod,"
    },
    {
      "id": 9,
      "start": 1249.119972229004,
      "end": 1252.399974822998,
      "text": " and specifically a brachiosaurus."
    },
    {
      "id": 10,
      "start": 1252.399974822998,
      "end": 1256.4399719238281,
      "text": " And so we think about the pre-flood climate, remember we dealt with the flood and we talked"
    },
    {
      "id": 11,
      "start": 1256.4399719238281,
      "end": 1261.8799743652344,
      "text": " about that pre-flood climate and how things, you think about the longevity of life, the"
    },
    {
      "id": 12,
      "start": 1261.8799743652344,
      "end": 1266.719970703125,
      "text": " longevity of all of those things, the way the climate was and so on and so forth, and"
    },
    {
      "id": 13,
      "start": 1266.719970703125,
      "end": 1271.839973449707,
      "text": " you begin to find out how these creatures could thrive in such an environment."
    },
    {
      "id": 14,
      "start": 1271.839973449707,
      "end": 1277.8799743652344,
      "text": " It's interesting because this here text tells us in verse number 15 about behemoth that"
    },
    {
      "id": 15,
      "start": 1277.8799743652344,
      "end": 1280.4799728393555,
      "text": " he eateth grass as an ox."
    },
    {
      "id": 16,
      "start": 1280.8799743652344,
      "end": 1285.9999694824219,
      "text": " Well, that was always a problem for folks when they began to, especially with these"
    },
    {
      "id": 17,
      "start": 1285.9999694824219,
      "end": 1291.2799758911133,
      "text": " evolutionary scientists that would give their answers as to what they would believe with"
    },
    {
      "id": 18,
      "start": 1291.2799758911133,
      "end": 1295.6799697875977,
      "text": " regard to dinosaurs and their aging and so on and so forth."
    },
    {
      "id": 19,
      "start": 1295.6799697875977,
      "end": 1301.0799713134766,
      "text": " But there was some, and I apologize if it's crude, but there was some fossilized dinosaur"
    },
    {
      "id": 20,
      "start": 1301.0799713134766,
      "end": 1306.1599731445312,
      "text": " dung that was found in the rocks of India."
    },
    {
      "id": 21,
      "start": 1306.1599731445312,
      "end": 1311.959976196289,
      "text": " And this fossilized dinosaur dung that was found in the rocks of India showed very plainly"
    },
    {
      "id": 22,
      "start": 1311.959976196289,
      "end": 1315.4399719238281,
      "text": " that sauropods ate grass."
    },
    {
      "id": 23,
      "start": 1315.4399719238281,
      "end": 1320.4799728393555,
      "text": " Well that kind of caused a problem for them, because they didn't believe that grass existed"
    },
    {
      "id": 24,
      "start": 1320.4799728393555,
      "end": 1327.3999710083008,
      "text": " at the same time that these dinosaurs existed, because on their evolutionary timeline it"
    },
    {
      "id": 25,
      "start": 1327.3999710083008,
      "end": 1329.5999755859375,
      "text": " didn't line up that way."
    },
    {
      "id": 26,
      "start": 1329.5999755859375,
      "end": 1332.8399658203125,
      "text": " So when you look at all the millions of years and all the things that go on, it's okay,"
    },
    {
      "id": 27,
      "start": 1332.8399658203125,
      "end": 1335.0399780273438,
      "text": " we need to go back to the drawing board and figure this out."
    },
    {
      "id": 28,
      "start": 1335.0399780273438,
      "end": 1338.9999694824219,
      "text": " From a Bible perspective, I have no problem with behemoth eating grass."
    },
    {
      "id": 29,
      "start": 1338.9999694824219,
      "end": 1339.9999694824219,
      "text": " Why?"
    },
    {
      "id": 30,
      "start": 1339.9999694824219,
      "end": 1343.7599792480469,
      "text": " Because on day number three is when God created grass."
    },
    {
      "id": 31,
      "start": 1343.7599792480469,
      "end": 1347.47998046875,
      "text": " If you go back to Genesis chapter number one and you look at verse number 11, the Bible"
    },
    {
      "id": 32,
      "start": 1347.47998046875,
      "end": 1350.959976196289,
      "text": " says, and God said, let the earth bring forth grass."
    },
    {
      "id": 33,
      "start": 1350.959976196289,
      "end": 1351.959976196289,
      "text": " And guess what?"
    },
    {
      "id": 34,
      "start": 1351.959976196289,
      "end": 1355.8399658203125,
      "text": " In verse number 12, the earth brought forth grass."
    },
    {
      "id": 35,
      "start": 1355.8399658203125,
      "end": 1358.9999694824219,
      "text": " As we've mentioned as we've studied through Genesis chapter number one, again, it's been"
    },
    {
      "id": 36,
      "start": 1358.9999694824219,
      "end": 1362.959976196289,
      "text": " a long time ago when we're studying through it specifically, but we mentioned how God"
    },
    {
      "id": 37,
      "start": 1363.959976196289,
      "end": 1366.0399780273438,
      "text": " everything he does is in order, right?"
    },
    {
      "id": 38,
      "start": 1366.0399780273438,
      "end": 1371.8799743652344,
      "text": " There's decency and order with God, and we find that God, as he would create, he would"
    },
    {
      "id": 39,
      "start": 1371.8799743652344,
      "end": 1375.5599670410156,
      "text": " provide the provision for the next thing that he would create."
    },
    {
      "id": 40,
      "start": 1375.5599670410156,
      "end": 1378.9999694824219,
      "text": " These things needed to have some kind of food source, and so God created the food source"
    },
    {
      "id": 41,
      "start": 1378.9999694824219,
      "end": 1380.8799743652344,
      "text": " and then created the creature."
    },
    {
      "id": 42,
      "start": 1380.8799743652344,
      "end": 1385.7999725341797,
      "text": " And so it's no problem for us as a biblical creationist to say, well, there's a fossil"
    },
    {
      "id": 43,
      "start": 1385.7999725341797,
      "end": 1388.7599792480469,
      "text": " that is of a dinosaur and he has grass."
    },
    {
      "id": 44,
      "start": 1388.7599792480469,
      "end": 1389.7599792480469,
      "text": " Well, sure."
    },
    {
      "id": 45,
      "start": 1390.239974975586,
      "end": 1393.5999755859375,
      "text": " In fact, it wasn't until after the flood that they ate meat."
    },
    {
      "id": 46,
      "start": 1393.5999755859375,
      "end": 1394.6799774169922,
      "text": " They all ate grass."
    },
    {
      "id": 47,
      "start": 1394.6799774169922,
      "end": 1395.6799774169922,
      "text": " But here's what happens."
    },
    {
      "id": 48,
      "start": 1395.6799774169922,
      "end": 1398.199966430664,
      "text": " Remember my statement in the very beginning."
    },
    {
      "id": 49,
      "start": 1398.199966430664,
      "end": 1402.5199737548828,
      "text": " It's not so much with what we see, but how we interpret what we see."
    },
    {
      "id": 50,
      "start": 1402.5199737548828,
      "end": 1405.6399688720703,
      "text": " Sometimes they see these dinosaurs and they got these big, huge teeth, and I mean, they're"
    },
    {
      "id": 51,
      "start": 1405.6399688720703,
      "end": 1409.47998046875,
      "text": " sharp and all this stuff, and they just, man, they have to be these ferocious meat eaters"
    },
    {
      "id": 52,
      "start": 1409.47998046875,
      "end": 1412.3999786376953,
      "text": " and so on and so forth."
    },
    {
      "id": 53,
      "start": 1412.3999786376953,
      "end": 1414.3999786376953,
      "text": " How do you reach the conclusion?"
    },
    {
      "id": 54,
      "start": 1414.3999786376953,
      "end": 1417.0399780273438,
      "text": " Behemoth ate grass as an ox."
    },
    {
      "id": 55,
      "start": 1417.0399780273438,
      "end": 1419.239974975586,
      "text": " It's what God tells us."
    },
    {
      "id": 56,
      "start": 1419.239974975586,
      "end": 1424.4399719238281,
      "text": " And so as we begin to understand and ask the question, where did dinosaurs come from, we're"
    },
    {
      "id": 57,
      "start": 1424.4399719238281,
      "end": 1431.8799743652344,
      "text": " able to very easily answer some of the questions with regard to not only the fact of creation,"
    },
    {
      "id": 58,
      "start": 1431.8799743652344,
      "end": 1435.199966430664,
      "text": " but answer the question about them being on the earth and roaming the earth at the same"
    },
    {
      "id": 59,
      "start": 1435.199966430664,
      "end": 1437.199966430664,
      "text": " time as man."
    },
    {
      "id": 60,
      "start": 1437.199966430664,
      "end": 1442.5599670410156,
      "text": " But then it also leads us to the question of what happened to the dinosaurs."
    },
    {
      "id": 61,
      "start": 1442.5599670410156,
      "end": 1444.2799682617188,
      "text": " What happened to the dinosaurs?"
    },
    {
      "id": 62,
      "start": 1444.2799682617188,
      "end": 1446.0799713134766,
      "text": " And maybe we'd follow it up with this question."
    },
    {
      "id": 63,
      "start": 1446.0799713134766,
      "end": 1447.0799713134766,
      "text": " Why are there so many fossils?"
    },
    {
      "id": 64,
      "start": 1448.0799713134766,
      "end": 1449.8399658203125,
      "text": " Why are there so many fossils?"
    },
    {
      "id": 65,
      "start": 1449.8399658203125,
      "end": 1454.1599731445312,
      "text": " Well, between the record of Genesis chapter number one and the record of the flood in"
    },
    {
      "id": 66,
      "start": 1454.1599731445312,
      "end": 1461.7599792480469,
      "text": " Genesis six through eight, we understand the timeline that there's roughly 1,656 years"
    },
    {
      "id": 67,
      "start": 1461.7599792480469,
      "end": 1464.9199829101562,
      "text": " between the creation and the flood."
    },
    {
      "id": 68,
      "start": 1464.9199829101562,
      "end": 1467.2799682617188,
      "text": " So 1,656 years."
    },
    {
      "id": 69,
      "start": 1467.2799682617188,
      "end": 1471.9999694824219,
      "text": " That's a far cry from 165 million years, but it's 1,656 years."
    },
    {
      "id": 70,
      "start": 1471.9999694824219,
      "end": 1477.5999755859375,
      "text": " Now remember the climate pre-flood and the way in which the longevity of man, you can"
    },
    {
      "id": 71,
      "start": 1477.5999755859375,
      "end": 1483.8399658203125,
      "text": " read of the time in which man lived and their days, and you can read about just all of the"
    },
    {
      "id": 72,
      "start": 1483.8399658203125,
      "end": 1487.7999877929688,
      "text": " way in which the climate would support life and allow life to really thrive."
    },
    {
      "id": 73,
      "start": 1487.7999877929688,
      "end": 1495.2399597167969,
      "text": " And so we find that 1,656 years after creation, we would say, as we look at the word of God,"
    },
    {
      "id": 74,
      "start": 1495.2399597167969,
      "end": 1499.9599609375,
      "text": " that there was a global flood as is recorded in Genesis six through eight."
    },
    {
      "id": 75,
      "start": 1499.9599609375,
      "end": 1506.2399597167969,
      "text": " And the global flood provides us with wonderful answers with regard to answering the question,"
    },
    {
      "id": 76,
      "start": 1506.2399597167969,
      "end": 1508.3599853515625,
      "text": " what happened to the dinosaurs?"
    },
    {
      "id": 77,
      "start": 1508.3599853515625,
      "end": 1512.3599853515625,
      "text": " And then follow up question of that, why are there so many fossils?"
    },
    {
      "id": 78,
      "start": 1512.3599853515625,
      "end": 1516.9199829101562,
      "text": " And so when we begin to answer this question, we would understand as we look at the record"
    },
    {
      "id": 79,
      "start": 1516.9199829101562,
      "end": 1523.3999633789062,
      "text": " of the book of Genesis, that it was not through the flood that every dinosaur was destroyed."
    },
    {
      "id": 80,
      "start": 1523.3999633789062,
      "end": 1528.47998046875,
      "text": " See there are some that would teach that have this idea, these evolutionary scientists that"
    },
    {
      "id": 81,
      "start": 1528.47998046875,
      "end": 1532.9999694824219,
      "text": " would say that when that asteroid hit earth, that basically there are some that would say"
    },
    {
      "id": 82,
      "start": 1532.9999694824219,
      "end": 1535.7599792480469,
      "text": " that it was in a moment, in an instant, it just destroyed all of them."
    },
    {
      "id": 83,
      "start": 1535.7599792480469,
      "end": 1537.9199829101562,
      "text": " And there are some that would say it destroyed most of them."
    },
    {
      "id": 84,
      "start": 1537.9199829101562,
      "end": 1541.9999694824219,
      "text": " And then over a period of years, and they speak in terms of millions of years as if"
    },
    {
      "id": 85,
      "start": 1541.9999694824219,
      "end": 1544.0799865722656,
      "text": " it's just a couple of minutes."
    },
    {
      "id": 86,
      "start": 1544.0799865722656,
      "end": 1547.719970703125,
      "text": " And then, you know, they began to die off entirely."
    },
    {
      "id": 87,
      "start": 1547.719970703125,
      "end": 1552.7599792480469,
      "text": " We don't believe that the flood destroyed all of the dinosaurs because Noah was told"
    },
    {
      "id": 88,
      "start": 1552.7599792480469,
      "end": 1556.7799682617188,
      "text": " to bring dinosaurs or bring all of the animals onto the ark, right?"
    },
    {
      "id": 89,
      "start": 1556.7799682617188,
      "end": 1563.0599670410156,
      "text": " Look in Genesis chapter number 7 if you will, we believe that Noah took dinosaurs onto the"
    },
    {
      "id": 90,
      "start": 1563.0599670410156,
      "end": 1564.0599670410156,
      "text": " ark."
    },
    {
      "id": 91,
      "start": 1564.0599670410156,
      "end": 1567.6999816894531,
      "text": " Now, there are some that immediately oppose that and they say, well, the ark wasn't big"
    },
    {
      "id": 92,
      "start": 1567.6999816894531,
      "end": 1572.1399841308594,
      "text": " enough, there's no way you could get dinosaurs, I mean, look at the size of these sauropods"
    },
    {
      "id": 93,
      "start": 1572.1399841308594,
      "end": 1574.2999877929688,
      "text": " and T-Rex and all of this."
    },
    {
      "id": 94,
      "start": 1574.2999877929688,
      "end": 1580.8599853515625,
      "text": " Who said that he had to bring adult grown, fully grown animals onto the ark?"
    },
    {
      "id": 95,
      "start": 1580.8599853515625,
      "end": 1586.4199829101562,
      "text": " There's no need to bring fully grown animals onto the ark."
    },
    {
      "id": 96,
      "start": 1586.4199829101562,
      "end": 1591.5799865722656,
      "text": " In fact, it would be much wiser to bring adolescent sized animals onto the ark."
    },
    {
      "id": 97,
      "start": 1591.5799865722656,
      "end": 1596.9399719238281,
      "text": " Not only would they be smaller, but they would be ready to be productive and reproduce after"
    },
    {
      "id": 98,
      "start": 1596.9399719238281,
      "end": 1598.6599731445312,
      "text": " they got off the ark."
    },
    {
      "id": 99,
      "start": 1598.6599731445312,
      "end": 1601.219970703125,
      "text": " And that's what they were instructed to do, right?"
    },
    {
      "id": 100,
      "start": 1601.219970703125,
      "end": 1604.3799743652344,
      "text": " Not only Noah and his family, but all of the animals."
    },
    {
      "id": 101,
      "start": 1604.3799743652344,
      "end": 1607.4999694824219,
      "text": " They were to come off the ark and they were to replenish the earth."
    },
    {
      "id": 102,
      "start": 1607.4999694824219,
      "end": 1611.1799621582031,
      "text": " And so we find that here in Genesis chapter number 7, in verse number 7, notice what the"
    },
    {
      "id": 103,
      "start": 1611.1799621582031,
      "end": 1617.1799621582031,
      "text": " word of God says, and Noah went in and his sons and his wife and his son's wives with"
    },
    {
      "id": 104,
      "start": 1617.1799621582031,
      "end": 1621.5399780273438,
      "text": " him into the ark because of the waters of the flood of clean beasts and of beasts that"
    },
    {
      "id": 105,
      "start": 1621.5399780273438,
      "end": 1625.3799743652344,
      "text": " are not clean and of fowls and of everything that creepeth upon the earth."
    },
    {
      "id": 106,
      "start": 1625.3799743652344,
      "end": 1630.7399597167969,
      "text": " There went in two and two unto Noah into the ark, the male and the female, as God had commanded"
    },
    {
      "id": 107,
      "start": 1630.7399597167969,
      "end": 1635.2999877929688,
      "text": " Noah and it came to pass after seven days that the waters of the flood were upon the"
    },
    {
      "id": 108,
      "start": 1635.2999877929688,
      "end": 1636.2999877929688,
      "text": " earth."
    },
    {
      "id": 109,
      "start": 1636.2999877929688,
      "end": 1641.0999755859375,
      "text": " And so God moved and God worked, God created these animals, God brought these animals onto"
    },
    {
      "id": 110,
      "start": 1642.0199584960938,
      "end": 1643.0199584960938,
      "text": " the ark."
    },
    {
      "id": 111,
      "start": 1643.0199584960938,
      "end": 1645.4199829101562,
      "text": " And of course, Noah was responsible for building the ark and what have you."
    },
    {
      "id": 112,
      "start": 1645.4199829101562,
      "end": 1650.6599731445312,
      "text": " But we find that Noah would take these dinosaurs onto the ark."
    },
    {
      "id": 113,
      "start": 1650.6599731445312,
      "end": 1656.8999633789062,
      "text": " Again, not only did they not have to be fully grown dinosaurs, but not every single species"
    },
    {
      "id": 114,
      "start": 1656.8999633789062,
      "end": 1657.8999633789062,
      "text": " of dinosaur."
    },
    {
      "id": 115,
      "start": 1657.8999633789062,
      "end": 1660.4199829101562,
      "text": " You think about dogs and you think about the kind, right?"
    },
    {
      "id": 116,
      "start": 1660.4199829101562,
      "end": 1662.2599792480469,
      "text": " The dog kind."
    },
    {
      "id": 117,
      "start": 1662.2599792480469,
      "end": 1664.5999755859375,
      "text": " But then how many variants are there?"
    },
    {
      "id": 118,
      "start": 1664.5999755859375,
      "end": 1667.9399719238281,
      "text": " When you go through the whole process and you want this breed of dog or that breed of"
    },
    {
      "id": 119,
      "start": 1667.9399719238281,
      "end": 1669.97998046875,
      "text": " dog and crossbreeding and so on and so forth."
    },
    {
      "id": 120,
      "start": 1669.97998046875,
      "end": 1673.7399597167969,
      "text": " Now, you can't do it with a dog and cat because they're not the same kind, right?"
    },
    {
      "id": 121,
      "start": 1673.7399597167969,
      "end": 1679.0999755859375,
      "text": " We understand that, but we find that you can certainly within the kind, you can have a"
    },
    {
      "id": 122,
      "start": 1679.0999755859375,
      "end": 1682.6599731445312,
      "text": " variety of families or breeds, if you will."
    },
    {
      "id": 123,
      "start": 1682.6599731445312,
      "end": 1690.6999816894531,
      "text": " And so we find that here, God specifically in Genesis one repeats kind, kind, kind after"
    },
    {
      "id": 124,
      "start": 1690.6999816894531,
      "end": 1691.6999816894531,
      "text": " his kind."
    },
    {
      "id": 125,
      "start": 1691.6999816894531,
      "end": 1695.6199645996094,
      "text": " And so it's believed by people that are much smarter than I am, that there were probably"
    },
    {
      "id": 126,
      "start": 1695.6199645996094,
      "end": 1699.8999633789062,
      "text": " about 60 pairs of dinosaurs that would have to be on the ark."
    },
    {
      "id": 127,
      "start": 1700.8199768066406,
      "end": 1705.5799865722656,
      "text": " Now, those 60 pairs of dinosaurs, but it's interesting to understand this, the average"
    },
    {
      "id": 128,
      "start": 1705.5799865722656,
      "end": 1710.1799621582031,
      "text": " size of a dinosaur was the size of a large sheep."
    },
    {
      "id": 129,
      "start": 1710.1799621582031,
      "end": 1714.699951171875,
      "text": " So you have some really big dinosaurs, but you also have some small creatures."
    },
    {
      "id": 130,
      "start": 1714.699951171875,
      "end": 1719.3799438476562,
      "text": " And so this is not, when you understand the fact that they weren't these fully grown,"
    },
    {
      "id": 131,
      "start": 1719.3799438476562,
      "end": 1724.2599487304688,
      "text": " they didn't have to be fully grown, and it wasn't that you had to have every variant,"
    },
    {
      "id": 132,
      "start": 1724.2599487304688,
      "end": 1728.6199951171875,
      "text": " every type that's out there, you would understand that it was certainly adequate for them to"
    },
    {
      "id": 133,
      "start": 1728.6199951171875,
      "end": 1730.3399658203125,
      "text": " fit on the ark."
    },
    {
      "id": 134,
      "start": 1730.3399658203125,
      "end": 1734.8799438476562,
      "text": " We went through, as we talked about the ark many lessons ago, we talked about the size"
    },
    {
      "id": 135,
      "start": 1734.8799438476562,
      "end": 1742.3399658203125,
      "text": " of the ark and how many freight cars of, you know, cubic feet that they had for storage"
    },
    {
      "id": 136,
      "start": 1742.3399658203125,
      "end": 1747.2599487304688,
      "text": " and so on and so forth, sufficiently sized for all these creatures."
    },
    {
      "id": 137,
      "start": 1747.2599487304688,
      "end": 1752.6199951171875,
      "text": " Let me say this, Noah took all the animals on the ark, including dinosaurs, but we also"
    },
    {
      "id": 138,
      "start": 1752.6199951171875,
      "end": 1756.8599853515625,
      "text": " understand as we read the Genesis flood, that all living creatures that were not on the"
    },
    {
      "id": 139,
      "start": 1756.8599853515625,
      "end": 1759.0599975585938,
      "text": " ark died."
    },
    {
      "id": 140,
      "start": 1759.0599975585938,
      "end": 1763.3799438476562,
      "text": " Genesis 7, continue reading, look down at verse 21."
    },
    {
      "id": 141,
      "start": 1763.3799438476562,
      "end": 1768.1799926757812,
      "text": " The Bible says, \"...and all flesh died that moved upon the earth, both of fowl and of"
    },
    {
      "id": 142,
      "start": 1768.1799926757812,
      "end": 1771.6599731445312,
      "text": " cattle and of beasts and of every creeping thing that creepeth upon the earth, and every"
    },
    {
      "id": 143,
      "start": 1771.6599731445312,
      "end": 1777.97998046875,
      "text": " man and in whose nostrils was the breath of life, of all that was in the dry land died.\""
    },
    {
      "id": 144,
      "start": 1777.97998046875,
      "end": 1782.2599487304688,
      "text": " Verse 23 of Genesis 7, \"...and every living substance was destroyed which was upon the"
    },
    {
      "id": 145,
      "start": 1782.2599487304688,
      "end": 1786.97998046875,
      "text": " face of the ground, both man and cattle and the creeping thing and the fowl of the heaven,"
    },
    {
      "id": 146,
      "start": 1786.97998046875,
      "end": 1792.219970703125,
      "text": " and they were destroyed from the earth, and Noah only remained alive and they that were"
    },
    {
      "id": 147,
      "start": 1792.219970703125,
      "end": 1797.0199584960938,
      "text": " with him in the ark, and the waters prevailed upon the earth in a hundred and fifty days.\""
    },
    {
      "id": 148,
      "start": 1797.0199584960938,
      "end": 1800.9400024414062,
      "text": " And so all living creatures that were not on the ark died."
    },
    {
      "id": 149,
      "start": 1800.9400024414062,
      "end": 1801.9400024414062,
      "text": " So there were lives."
    },
    {
      "id": 0,
      "start": 1801.9400024414062,
      "end": 1805.220002412796,
      "text": " lots of dinosaurs that died during the flood."
    },
    {
      "id": 1,
      "start": 1805.220002412796,
      "end": 1808.3000025749207,
      "text": " We don't know the number, but we do know this,"
    },
    {
      "id": 2,
      "start": 1808.3000025749207,
      "end": 1810.1400022506714,
      "text": " and I'm gonna read this to you."
    },
    {
      "id": 3,
      "start": 1810.1400022506714,
      "end": 1811.6400022506714,
      "text": " The rocks of the Earth's crust"
    },
    {
      "id": 4,
      "start": 1811.6400022506714,
      "end": 1814.46000289917,
      "text": " now contain the fossil remains"
    },
    {
      "id": 5,
      "start": 1814.46000289917,
      "end": 1818.9400024414062,
      "text": " of unnumbered billions of plants and animals"
    },
    {
      "id": 6,
      "start": 1818.9400024414062,
      "end": 1821.900001525879,
      "text": " buried in water-transported sediments,"
    },
    {
      "id": 7,
      "start": 1821.900001525879,
      "end": 1824.700002670288,
      "text": " which quickly became stone."
    },
    {
      "id": 8,
      "start": 1824.700002670288,
      "end": 1827.6000022888184,
      "text": " This geologic column has been grossly distorted"
    },
    {
      "id": 9,
      "start": 1827.6000022888184,
      "end": 1829.540002822876,
      "text": " by evolutionists into the record"
    },
    {
      "id": 10,
      "start": 1829.540002822876,
      "end": 1832.2200031280518,
      "text": " of an imagined three-billion-year history of evolution"
    },
    {
      "id": 11,
      "start": 1832.2200031280518,
      "end": 1834.3800010681152,
      "text": " during the geological ages."
    },
    {
      "id": 12,
      "start": 1834.3800010681152,
      "end": 1836.7400016784668,
      "text": " Actually, it represents the deposits"
    },
    {
      "id": 13,
      "start": 1836.7400016784668,
      "end": 1840.6000022888184,
      "text": " of the cataclysmic flood, with the fossils order"
    },
    {
      "id": 14,
      "start": 1840.6000022888184,
      "end": 1842.96000289917,
      "text": " primarily depicting the relative elevations"
    },
    {
      "id": 15,
      "start": 1842.96000289917,
      "end": 1845.1000022888184,
      "text": " of the habitats, and therefore,"
    },
    {
      "id": 16,
      "start": 1845.1000022888184,
      "end": 1848.7400016784668,
      "text": " the usual order of sedimentary burial in the flood"
    },
    {
      "id": 17,
      "start": 1848.7400016784668,
      "end": 1851.020004272461,
      "text": " of the organisms of the pre-flood world."
    },
    {
      "id": 18,
      "start": 1851.020004272461,
      "end": 1853.4200019836426,
      "text": " Many modern geologists are again admitting"
    },
    {
      "id": 19,
      "start": 1853.4200019836426,
      "end": 1857.020004272461,
      "text": " the necessity of catastrophic formation and burial"
    },
    {
      "id": 20,
      "start": 1857.020004272461,
      "end": 1860.3600006103516,
      "text": " to explain the fossil rocks in the geological column."
    },
    {
      "id": 21,
      "start": 1860.3600006103516,
      "end": 1862.620002746582,
      "text": " The reason why very few fossilized men,"
    },
    {
      "id": 22,
      "start": 1862.620002746582,
      "end": 1864.3800010681152,
      "text": " so this is another question that comes up,"
    },
    {
      "id": 23,
      "start": 1864.3800010681152,
      "end": 1866.900001525879,
      "text": " why do we find these dinosaurs that are fossilized,"
    },
    {
      "id": 24,
      "start": 1866.900001525879,
      "end": 1869.3800048828125,
      "text": " but we don't find men that are fossilized?"
    },
    {
      "id": 25,
      "start": 1869.3800048828125,
      "end": 1871.740005493164,
      "text": " And if they lived at the same time,"
    },
    {
      "id": 26,
      "start": 1871.740005493164,
      "end": 1873.4599990844727,
      "text": " then you would find, if you're gonna find"
    },
    {
      "id": 27,
      "start": 1873.4599990844727,
      "end": 1876.7799987792969,
      "text": " fossilized dinosaurs, you should find fossilized men."
    },
    {
      "id": 28,
      "start": 1876.7799987792969,
      "end": 1879.1600036621094,
      "text": " I thought it was an interesting statement here."
    },
    {
      "id": 29,
      "start": 1879.1600036621094,
      "end": 1881.2600021362305,
      "text": " The reason why very few fossilized men"
    },
    {
      "id": 30,
      "start": 1881.2600021362305,
      "end": 1883.900001525879,
      "text": " and also very few fossilized flying birds"
    },
    {
      "id": 31,
      "start": 1883.900001525879,
      "end": 1886.7799987792969,
      "text": " are found in the rocks is their high mobility"
    },
    {
      "id": 32,
      "start": 1887.5400009155273,
      "end": 1890.3000030517578,
      "text": " and ability to escape burial and sediments."
    },
    {
      "id": 33,
      "start": 1890.3000030517578,
      "end": 1893.1800003051758,
      "text": " When eventually drowned, their bodies"
    },
    {
      "id": 34,
      "start": 1893.1800003051758,
      "end": 1896.3000030517578,
      "text": " would remain on the surface until they decayed."
    },
    {
      "id": 35,
      "start": 1896.3000030517578,
      "end": 1899.3400039672852,
      "text": " Well, if you decay, you don't fossilize, right?"
    },
    {
      "id": 36,
      "start": 1899.3400039672852,
      "end": 1900.3800048828125,
      "text": " It just can't happen."
    },
    {
      "id": 37,
      "start": 1900.3800048828125,
      "end": 1904.5400009155273,
      "text": " In fact, someone said this, fossils,"
    },
    {
      "id": 38,
      "start": 1904.5400009155273,
      "end": 1906.3000030517578,
      "text": " in order for a fossil to be created,"
    },
    {
      "id": 39,
      "start": 1906.3000030517578,
      "end": 1910.6600036621094,
      "text": " they have to be buried fast and deep to be preserved."
    },
    {
      "id": 40,
      "start": 1910.6600036621094,
      "end": 1912.6600036621094,
      "text": " There's no gentle drifting out to sea,"
    },
    {
      "id": 41,
      "start": 1912.6600036621094,
      "end": 1915.2200012207031,
      "text": " settling to the bottom and then somehow becoming buried"
    },
    {
      "id": 42,
      "start": 1915.2200012207031,
      "end": 1917.9400024414062,
      "text": " so that no scavengers attack the carcasses."
    },
    {
      "id": 43,
      "start": 1917.9400024414062,
      "end": 1920.0,
      "text": " This was something that happened very quickly."
    },
    {
      "id": 44,
      "start": 1920.0,
      "end": 1922.5800018310547,
      "text": " Now, think about the flood and think about"
    },
    {
      "id": 45,
      "start": 1922.5800018310547,
      "end": 1925.7799987792969,
      "text": " all of the great deeps opening up and the water coming,"
    },
    {
      "id": 46,
      "start": 1925.7799987792969,
      "end": 1928.520004272461,
      "text": " and then you begin to think about when the waters assuaged"
    },
    {
      "id": 47,
      "start": 1928.520004272461,
      "end": 1931.7200012207031,
      "text": " and how everything was rapidly moving"
    },
    {
      "id": 48,
      "start": 1931.7200012207031,
      "end": 1934.5,
      "text": " and all of that earth being so soft"
    },
    {
      "id": 49,
      "start": 1934.5,
      "end": 1936.1199951171875,
      "text": " because of the number of days in which"
    },
    {
      "id": 50,
      "start": 1936.1199951171875,
      "end": 1937.8600006103516,
      "text": " the water was on the earth."
    },
    {
      "id": 51,
      "start": 1937.8600006103516,
      "end": 1939.6800079345703,
      "text": " And then when God calls the wind to come"
    },
    {
      "id": 52,
      "start": 1939.6800079345703,
      "end": 1944.6800079345703,
      "text": " to assuage the waters, I mean, it's just catastrophic event."
    },
    {
      "id": 53,
      "start": 1944.8399963378906,
      "end": 1949.520004272461,
      "text": " And no doubt resulting in many of these fossils"
    },
    {
      "id": 54,
      "start": 1949.520004272461,
      "end": 1951.2799987792969,
      "text": " that are being found today."
    },
    {
      "id": 55,
      "start": 1951.2799987792969,
      "end": 1955.6800079345703,
      "text": " We not only believe that they were created by God"
    },
    {
      "id": 56,
      "start": 1955.6800079345703,
      "end": 1958.4400024414062,
      "text": " and that Noah took them on the ark"
    },
    {
      "id": 57,
      "start": 1958.4400024414062,
      "end": 1961.2799987792969,
      "text": " and those that were not on the ark died in the flood,"
    },
    {
      "id": 58,
      "start": 1961.2799987792969,
      "end": 1964.1999969482422,
      "text": " but we also believe that they were brought off of the ark."
    },
    {
      "id": 59,
      "start": 1964.1999969482422,
      "end": 1968.8800048828125,
      "text": " Genesis chapter number eight, verse 15."
    },
    {
      "id": 60,
      "start": 1968.8800048828125,
      "end": 1972.479995727539,
      "text": " Notice in Genesis eight and verse 15,"
    },
    {
      "id": 61,
      "start": 1972.479995727539,
      "end": 1975.240005493164,
      "text": " it says, God spake unto Noah saying,"
    },
    {
      "id": 62,
      "start": 1975.240005493164,
      "end": 1977.0400085449219,
      "text": " go forth of the ark."
    },
    {
      "id": 63,
      "start": 1977.0400085449219,
      "end": 1979.8000030517578,
      "text": " What a wonderful day that must have been."
    },
    {
      "id": 64,
      "start": 1979.8000030517578,
      "end": 1980.6800079345703,
      "text": " Amen?"
    },
    {
      "id": 65,
      "start": 1980.6800079345703,
      "end": 1985.6800079345703,
      "text": " After being on that ark, it's time to get off."
    },
    {
      "id": 66,
      "start": 1985.760009765625,
      "end": 1989.3600006103516,
      "text": " Get off the ark, thou and thy wife and thy sons"
    },
    {
      "id": 67,
      "start": 1989.3600006103516,
      "end": 1990.6399993896484,
      "text": " and thy sons' wives with thee."
    },
    {
      "id": 68,
      "start": 1990.6399993896484,
      "end": 1993.520004272461,
      "text": " Notice verse 17, bring forth with thee"
    },
    {
      "id": 69,
      "start": 1993.520004272461,
      "end": 1996.3600006103516,
      "text": " every living thing that is with thee"
    },
    {
      "id": 70,
      "start": 1996.3600006103516,
      "end": 1998.5599975585938,
      "text": " of all flesh, both of fowl and of cattle"
    },
    {
      "id": 71,
      "start": 1998.5599975585938,
      "end": 2000.9199981689453,
      "text": " and of every creeping thing that creepeth upon the earth"
    },
    {
      "id": 72,
      "start": 2000.9199981689453,
      "end": 2004.8399963378906,
      "text": " that they may notice that they may breed abundantly"
    },
    {
      "id": 73,
      "start": 2004.8399963378906,
      "end": 2008.5599975585938,
      "text": " in the earth and be fruitful and multiply upon the earth."
    },
    {
      "id": 74,
      "start": 2010.4000091552734,
      "end": 2012.5599975585938,
      "text": " And Noah went forth and his sons and his wife"
    },
    {
      "id": 75,
      "start": 2012.5599975585938,
      "end": 2014.7200012207031,
      "text": " and his sons' wives with him, every beast,"
    },
    {
      "id": 76,
      "start": 2014.7200012207031,
      "end": 2016.8800048828125,
      "text": " every creeping thing and every fowl"
    },
    {
      "id": 77,
      "start": 2016.8800048828125,
      "end": 2018.520004272461,
      "text": " and whatsoever creepeth upon the earth"
    },
    {
      "id": 78,
      "start": 2018.520004272461,
      "end": 2023.520004272461,
      "text": " after their kinds went forth out of the ark."
    },
    {
      "id": 79,
      "start": 2023.520004272461,
      "end": 2026.8200073242188,
      "text": " Therefore, we would, just as I said earlier,"
    },
    {
      "id": 80,
      "start": 2026.8200073242188,
      "end": 2030.0800018310547,
      "text": " confidently conclude that man and dinosaur"
    },
    {
      "id": 81,
      "start": 2030.1199951171875,
      "end": 2032.3200073242188,
      "text": " dwelt at the same time, we would conclude"
    },
    {
      "id": 82,
      "start": 2032.3200073242188,
      "end": 2035.1600036621094,
      "text": " that dinosaurs lived after the flood."
    },
    {
      "id": 83,
      "start": 2035.1600036621094,
      "end": 2036.8800048828125,
      "text": " They lived after the flood."
    },
    {
      "id": 84,
      "start": 2036.8800048828125,
      "end": 2038.6399993896484,
      "text": " You say, are you sure about that?"
    },
    {
      "id": 85,
      "start": 2038.6399993896484,
      "end": 2040.8800048828125,
      "text": " Well, did you just read what I read?"
    },
    {
      "id": 86,
      "start": 2040.8800048828125,
      "end": 2043.6000061035156,
      "text": " They went on the ark, if everything went on the ark"
    },
    {
      "id": 87,
      "start": 2043.6000061035156,
      "end": 2046.1999969482422,
      "text": " and then everything came off the ark,"
    },
    {
      "id": 88,
      "start": 2046.1999969482422,
      "end": 2048.760009765625,
      "text": " then they existed after the flood."
    },
    {
      "id": 89,
      "start": 2048.760009765625,
      "end": 2050.960006713867,
      "text": " So what happened to them?"
    },
    {
      "id": 90,
      "start": 2050.960006713867,
      "end": 2054.540008544922,
      "text": " Why is it that after the ark, of course,"
    },
    {
      "id": 91,
      "start": 2054.540008544922,
      "end": 2056.6800079345703,
      "text": " we don't believe in their extinction immediately"
    },
    {
      "id": 92,
      "start": 2056.6800079345703,
      "end": 2058.959991455078,
      "text": " because of the flood, but we would find"
    },
    {
      "id": 93,
      "start": 2059.0800170898438,
      "end": 2061.739990234375,
      "text": " that they obviously died out after a period of time"
    },
    {
      "id": 94,
      "start": 2061.739990234375,
      "end": 2063.1199951171875,
      "text": " and we don't know exactly the time"
    },
    {
      "id": 95,
      "start": 2063.1199951171875,
      "end": 2065.220001220703,
      "text": " in all of the regions and what have you,"
    },
    {
      "id": 96,
      "start": 2065.220001220703,
      "end": 2067.959991455078,
      "text": " but the reality is that the post-flood climate"
    },
    {
      "id": 97,
      "start": 2067.959991455078,
      "end": 2071.9200134277344,
      "text": " was drastically different than the pre-flood climate."
    },
    {
      "id": 98,
      "start": 2071.9200134277344,
      "end": 2076.9200134277344,
      "text": " The climatic changes upon earth, post-flood versus pre-flood"
    },
    {
      "id": 99,
      "start": 2077.1600036621094,
      "end": 2079.040008544922,
      "text": " are just amazing."
    },
    {
      "id": 100,
      "start": 2079.040008544922,
      "end": 2081.040008544922,
      "text": " I mean, just, you just think about it"
    },
    {
      "id": 101,
      "start": 2081.040008544922,
      "end": 2083.720001220703,
      "text": " in the life expectancy of mankind"
    },
    {
      "id": 102,
      "start": 2083.720001220703,
      "end": 2086.8399963378906,
      "text": " and you see the way in which man, very quickly,"
    },
    {
      "id": 103,
      "start": 2086.8399963378906,
      "end": 2089.959991455078,
      "text": " their life expectancy decreases after the flood"
    },
    {
      "id": 104,
      "start": 2089.959991455078,
      "end": 2093.0800170898438,
      "text": " and you begin to see the impact of the climate"
    },
    {
      "id": 105,
      "start": 2093.0800170898438,
      "end": 2095.0800170898438,
      "text": " and so we see that lifespan decreases."
    },
    {
      "id": 106,
      "start": 2095.0800170898438,
      "end": 2097.959991455078,
      "text": " Think about the vegetation changes, right?"
    },
    {
      "id": 107,
      "start": 2097.959991455078,
      "end": 2099.239990234375,
      "text": " And so what is the vegetation?"
    },
    {
      "id": 108,
      "start": 2099.239990234375,
      "end": 2103.1600036621094,
      "text": " Well, that's a source of sustenance for these animals"
    },
    {
      "id": 109,
      "start": 2103.1600036621094,
      "end": 2104.8399963378906,
      "text": " and you understand that."
    },
    {
      "id": 110,
      "start": 2104.8399963378906,
      "end": 2107.6000061035156,
      "text": " You think about the ice age."
    },
    {
      "id": 111,
      "start": 2107.6000061035156,
      "end": 2109.5800170898438,
      "text": " We dealt with a whole lesson on the ice age."
    },
    {
      "id": 112,
      "start": 2109.5800170898438,
      "end": 2112.5599975585938,
      "text": " Well, what kind of an impact did the ice age have"
    },
    {
      "id": 113,
      "start": 2112.5599975585938,
      "end": 2114.2999877929688,
      "text": " upon the dinosaurs?"
    },
    {
      "id": 114,
      "start": 2114.2999877929688,
      "end": 2117.1400146484375,
      "text": " Some animals, no doubt, as they came off the ark"
    },
    {
      "id": 115,
      "start": 2117.1400146484375,
      "end": 2119.4200134277344,
      "text": " and they began to deal with some of the climatic changes"
    },
    {
      "id": 116,
      "start": 2119.4200134277344,
      "end": 2121.5800170898438,
      "text": " that were so much drastically different,"
    },
    {
      "id": 117,
      "start": 2121.5800170898438,
      "end": 2124.6199951171875,
      "text": " the oxygen levels in the atmosphere"
    },
    {
      "id": 118,
      "start": 2124.6199951171875,
      "end": 2126.2999877929688,
      "text": " are different than they were pre-flood"
    },
    {
      "id": 119,
      "start": 2126.2999877929688,
      "end": 2128.5800170898438,
      "text": " and just so many variables and you say,"
    },
    {
      "id": 120,
      "start": 2128.5800170898438,
      "end": 2131.9200134277344,
      "text": " okay, how did all of these things impact"
    },
    {
      "id": 121,
      "start": 2131.9200134277344,
      "end": 2135.779998779297,
      "text": " the ability for certain animals to live?"
    },
    {
      "id": 122,
      "start": 2135.779998779297,
      "end": 2138.779998779297,
      "text": " And how did it cause those things to happen?"
    },
    {
      "id": 123,
      "start": 2138.779998779297,
      "end": 2140.980010986328,
      "text": " And so we look at that and we find that"
    },
    {
      "id": 124,
      "start": 2140.980010986328,
      "end": 2143.3800048828125,
      "text": " all of these factors would contribute"
    },
    {
      "id": 125,
      "start": 2143.3800048828125,
      "end": 2146.1000061035156,
      "text": " to an eventual extinction of dinosaurs."
    },
    {
      "id": 126,
      "start": 2146.1000061035156,
      "end": 2147.5800170898438,
      "text": " I would also say this."
    },
    {
      "id": 127,
      "start": 2148.4400024414062,
      "end": 2153.1000061035156,
      "text": " The reality is that the animal-human interaction"
    },
    {
      "id": 128,
      "start": 2153.1000061035156,
      "end": 2155.9400024414062,
      "text": " differed greatly post-flood."
    },
    {
      "id": 129,
      "start": 2155.9400024414062,
      "end": 2159.9200134277344,
      "text": " Pre-flood, there was a way in which God"
    },
    {
      "id": 130,
      "start": 2159.9200134277344,
      "end": 2162.1000061035156,
      "text": " had given the instruction, as you look in Genesis 1"
    },
    {
      "id": 131,
      "start": 2162.1000061035156,
      "end": 2164.3999938964844,
      "text": " and we read it earlier, when God created man,"
    },
    {
      "id": 132,
      "start": 2164.3999938964844,
      "end": 2167.779998779297,
      "text": " he was to have dominion over, right?"
    },
    {
      "id": 133,
      "start": 2167.779998779297,
      "end": 2170.4200134277344,
      "text": " And there was this certain level of interaction,"
    },
    {
      "id": 134,
      "start": 2170.4200134277344,
      "end": 2173.0,
      "text": " if I can use that terminology this evening,"
    },
    {
      "id": 135,
      "start": 2173.540008544922,
      "end": 2176.3200073242188,
      "text": " of how man and animal would interact with each other."
    },
    {
      "id": 136,
      "start": 2176.3200073242188,
      "end": 2180.8800048828125,
      "text": " But after the flood, all of those things changed."
    },
    {
      "id": 137,
      "start": 2180.8800048828125,
      "end": 2183.8800048828125,
      "text": " We understand that one day, there's going to be"
    },
    {
      "id": 138,
      "start": 2183.8800048828125,
      "end": 2186.1600036621094,
      "text": " in the millennial kingdom of Christ,"
    },
    {
      "id": 139,
      "start": 2186.1600036621094,
      "end": 2188.7999877929688,
      "text": " there's going to be a change into the animal kingdom"
    },
    {
      "id": 140,
      "start": 2188.7999877929688,
      "end": 2190.760009765625,
      "text": " as well and how man interacts with animals"
    },
    {
      "id": 141,
      "start": 2190.760009765625,
      "end": 2192.480010986328,
      "text": " and so on and so forth and you see that."
    },
    {
      "id": 142,
      "start": 2192.480010986328,
      "end": 2195.019989013672,
      "text": " You read in Isaiah some of those things"
    },
    {
      "id": 143,
      "start": 2195.019989013672,
      "end": 2197.1199951171875,
      "text": " that God gives us with regard to"
    },
    {
      "id": 144,
      "start": 2197.1199951171875,
      "end": 2198.480010986328,
      "text": " the millennial reign of Christ."
    },
    {
      "id": 145,
      "start": 2198.480010986328,
      "end": 2201.6400146484375,
      "text": " And so that difference in the interaction"
    },
    {
      "id": 146,
      "start": 2201.6400146484375,
      "end": 2205.1000061035156,
      "text": " between these that would now leave the ark"
    },
    {
      "id": 147,
      "start": 2205.1000061035156,
      "end": 2208.3600158691406,
      "text": " and go to inhabit the earth, you think about"
    },
    {
      "id": 148,
      "start": 2208.3600158691406,
      "end": 2211.720001220703,
      "text": " the way in which the Tower of Babel is described"
    },
    {
      "id": 149,
      "start": 2211.720001220703,
      "end": 2214.7999877929688,
      "text": " in chapter number 11 of the book of Genesis"
    },
    {
      "id": 150,
      "start": 2214.7999877929688,
      "end": 2216.3999938964844,
      "text": " and how those people eventually,"
    },
    {
      "id": 151,
      "start": 2216.3999938964844,
      "end": 2219.0800170898438,
      "text": " after their language was changed,"
    },
    {
      "id": 152,
      "start": 2219.0800170898438,
      "end": 2221.0800170898438,
      "text": " how they departed and spread out,"
    },
    {
      "id": 153,
      "start": 2221.0800170898438,
      "end": 2225.959991455078,
      "text": " no doubt they would come in contact with dinosaurs."
    },
    {
      "id": 154,
      "start": 2226.7999877929688,
      "end": 2228.2000122070312,
      "text": " And what would they do?"
    },
    {
      "id": 155,
      "start": 2228.2000122070312,
      "end": 2230.480010986328,
      "text": " How would that interaction be?"
    },
    {
      "id": 156,
      "start": 2230.480010986328,
      "end": 2233.8399963378906,
      "text": " And we find there are plenty of historical events"
    },
    {
      "id": 157,
      "start": 2233.8399963378906,
      "end": 2235.760009765625,
      "text": " and evidences, if you will,"
    },
    {
      "id": 158,
      "start": 2235.760009765625,
      "end": 2240.720001220703,
      "text": " that would refer to various encounters"
    },
    {
      "id": 159,
      "start": 2240.720001220703,
      "end": 2243.519989013672,
      "text": " that individuals had with these dragons"
    },
    {
      "id": 160,
      "start": 2243.519989013672,
      "end": 2247.279998779297,
      "text": " or these dinosaur-like creatures."
    },
    {
      "id": 161,
      "start": 2247.279998779297,
      "end": 2250.2000122070312,
      "text": " And we find that, as we mentioned earlier"
    },
    {
      "id": 162,
      "start": 2250.2000122070312,
      "end": 2252.540008544922,
      "text": " in Job chapter number 40 about behemoth,"
    },
    {
      "id": 163,
      "start": 2252.540008544922,
      "end": 2254.8200073242188,
      "text": " we also would understand and say tonight,"
    },
    {
      "id": 164,
      "start": 2254.8200073242188,
      "end": 2256.2000122070312,
      "text": " we're not gonna look at the references"
    },
    {
      "id": 165,
      "start": 2256.2000122070312,
      "end": 2257.5599975585938,
      "text": " because there's many of them,"
    },
    {
      "id": 166,
      "start": 2257.5599975585938,
      "end": 2259.739990234375,
      "text": " but you would understand that in the word of God"
    },
    {
      "id": 167,
      "start": 2259.739990234375,
      "end": 2263.739990234375,
      "text": " in our Bibles, the word dragon appears several times."
    },
    {
      "id": 168,
      "start": 2263.739990234375,
      "end": 2265.220001220703,
      "text": " And so that word dragon, again,"
    },
    {
      "id": 169,
      "start": 2265.220001220703,
      "end": 2266.3399963378906,
      "text": " it's not the word dinosaur"
    },
    {
      "id": 170,
      "start": 2266.3399963378906,
      "end": 2267.6600036621094,
      "text": " because the word dinosaur didn't exist,"
    },
    {
      "id": 171,
      "start": 2267.6600036621094,
      "end": 2268.6400146484375,
      "text": " but it's the word dragon."
    },
    {
      "id": 172,
      "start": 2268.6400146484375,
      "end": 2270.739990234375,
      "text": " You read about behemoth, you read about Leviathan,"
    },
    {
      "id": 173,
      "start": 2270.739990234375,
      "end": 2272.540008544922,
      "text": " you read about these dragons"
    },
    {
      "id": 174,
      "start": 2272.540008544922,
      "end": 2273.9400024414062,
      "text": " that are mentioned in the word of God,"
    },
    {
      "id": 175,
      "start": 2273.9400024414062,
      "end": 2277.4200134277344,
      "text": " and you begin to see how the word of God"
    },
    {
      "id": 176,
      "start": 2277.4200134277344,
      "end": 2281.779998779297,
      "text": " provides us with evidence that yes, dinosaurs existed."
    },
    {
      "id": 177,
      "start": 2281.779998779297,
      "end": 2283.8200073242188,
      "text": " We're not some backwards group of people."
    },
    {
      "id": 178,
      "start": 2283.8200073242188,
      "end": 2285.1000061035156,
      "text": " Oh, you're a biblical Christian"
    },
    {
      "id": 179,
      "start": 2285.1000061035156,
      "end": 2286.459991455078,
      "text": " and you don't believe in dinosaurs."
    },
    {
      "id": 180,
      "start": 2286.459991455078,
      "end": 2288.5800170898438,
      "text": " No, we believe in dinosaurs."
    },
    {
      "id": 181,
      "start": 2288.5800170898438,
      "end": 2290.3399963378906,
      "text": " It's just what we believe about dinosaurs"
    },
    {
      "id": 182,
      "start": 2290.3399963378906,
      "end": 2292.779998779297,
      "text": " varies greatly from what you believe about dinosaurs"
    },
    {
      "id": 183,
      "start": 2292.779998779297,
      "end": 2294.459991455078,
      "text": " because we don't believe that they evolved"
    },
    {
      "id": 184,
      "start": 2294.459991455078,
      "end": 2295.8600158691406,
      "text": " from some other type of reptile."
    },
    {
      "id": 185,
      "start": 2295.8600158691406,
      "end": 2298.5599975585938,
      "text": " We don't believe that they were here for 165 million years"
    },
    {
      "id": 186,
      "start": 2298.5599975585938,
      "end": 2301.260009765625,
      "text": " and then all of a sudden an asteroid came and destroyed them"
    },
    {
      "id": 187,
      "start": 2301.260009765625,
      "end": 2304.459991455078,
      "text": " and then 65 million years later after that, man showed up."
    },
    {
      "id": 188,
      "start": 2304.459991455078,
      "end": 2307.6199951171875,
      "text": " We just go ahead and get rid of all of that."
    },
    {
      "id": 189,
      "start": 2307.6199951171875,
      "end": 2309.220001220703,
      "text": " We don't believe that."
    },
    {
      "id": 190,
      "start": 2309.220001220703,
      "end": 2310.0599975585938,
      "text": " Why?"
    },
    {
      "id": 191,
      "start": 2310.0599975585938,
      "end": 2312.5800170898438,
      "text": " Because we believe and start with the word of God."
    },
    {
      "id": 192,
      "start": 2312.5800170898438,
      "end": 2314.2200317382812,
      "text": " What does God's word tell us?"
    },
    {
      "id": 193,
      "start": 2314.2200317382812,
      "end": 2315.6199951171875,
      "text": " In addition to having the word of God,"
    },
    {
      "id": 194,
      "start": 2315.6199951171875,
      "end": 2317.5800170898438,
      "text": " I thought it was noteworthy of interest"
    },
    {
      "id": 195,
      "start": 2317.5800170898438,
      "end": 2319.0599975585938,
      "text": " to share some things with you"
    },
    {
      "id": 196,
      "start": 2319.0599975585938,
      "end": 2322.5,
      "text": " about some just historical evidence, if you will,"
    },
    {
      "id": 197,
      "start": 2322.5,
      "end": 2326.4199829101562,
      "text": " for us to understand the truth"
    },
    {
      "id": 198,
      "start": 2326.4199829101562,
      "end": 2329.4600219726562,
      "text": " that dinosaurs existed after the flood."
    },
    {
      "id": 199,
      "start": 2329.4600219726562,
      "end": 2332.4600219726562,
      "text": " Now, I don't know, I've not done surveys on this,"
    },
    {
      "id": 200,
      "start": 2332.4600219726562,
      "end": 2334.1199951171875,
      "text": " I didn't read a whole lot on this,"
    },
    {
      "id": 201,
      "start": 2334.1199951171875,
      "end": 2336.1400146484375,
      "text": " but I began the message this evening"
    },
    {
      "id": 202,
      "start": 2336.1400146484375,
      "end": 2338.97998046875,
      "text": " by saying that there are times in which"
    },
    {
      "id": 203,
      "start": 2338.97998046875,
      "end": 2343.2999877929688,
      "text": " we as Christians may shy away or avoid a conversation"
    },
    {
      "id": 204,
      "start": 2343.2999877929688,
      "end": 2344.2999877929688,
      "text": " with somebody about dinosaurs"
    },
    {
      "id": 205,
      "start": 2344.2999877929688,
      "end": 2346.260009765625,
      "text": " because we just don't know how to talk about it."
    },
    {
      "id": 206,
      "start": 2346.260009765625,
      "end": 2347.5800170898438,
      "text": " There's also the subject matter,"
    },
    {
      "id": 207,
      "start": 2347.5800170898438,
      "end": 2349.97998046875,
      "text": " there are some that just have the answer"
    },
    {
      "id": 208,
      "start": 2349.97998046875,
      "end": 2354.97998046875,
      "text": " that dinosaurs were destroyed during the flood entirely,"
    },
    {
      "id": 209,
      "start": 2355.0599975585938,
      "end": 2356.7000122070312,
      "text": " but that doesn't answer the question"
    },
    {
      "id": 210,
      "start": 2356.7000122070312,
      "end": 2358.9400024414062,
      "text": " of some of these historical evidences"
    },
    {
      "id": 211,
      "start": 2358.9400024414062,
      "end": 2361.739990234375,
      "text": " of dinosaurs existing after the flood."
    },
    {
      "id": 212,
      "start": 2361.739990234375,
      "end": 2365.5599975585938,
      "text": " And so just as Noah would have taken dinosaurs onto the ark,"
    },
    {
      "id": 213,
      "start": 2365.5599975585938,
      "end": 2366.5999755859375,
      "text": " we've already dealt with the fact"
    },
    {
      "id": 214,
      "start": 2366.5999755859375,
      "end": 2368.6799926757812,
      "text": " that he would have brought them off of the ark,"
    },
    {
      "id": 215,
      "start": 2368.6799926757812,
      "end": 2371.7000122070312,
      "text": " so it's easy for us to acknowledge this evening"
    },
    {
      "id": 216,
      "start": 2371.7000122070312,
      "end": 2374.260009765625,
      "text": " that no, the flood didn't destroy all of the dinosaurs"
    },
    {
      "id": 217,
      "start": 2374.260009765625,
      "end": 2377.0,
      "text": " because they came off of the ark."
    },
    {
      "id": 218,
      "start": 2377.0,
      "end": 2378.52001953125,
      "text": " A number of events took place,"
    },
    {
      "id": 219,
      "start": 2378.52001953125,
      "end": 2381.260009765625,
      "text": " obviously through all of those factors"
    },
    {
      "id": 220,
      "start": 2381.260009765625,
      "end": 2383.1400146484375,
      "text": " that we mentioned a few moments ago,"
    },
    {
      "id": 221,
      "start": 2383.1400146484375,
      "end": 2384.9000244140625,
      "text": " eventually they would become extinct,"
    },
    {
      "id": 222,
      "start": 2384.9000244140625,
      "end": 2388.6199951171875,
      "text": " but I wanna share with you just a few historical evidences,"
    },
    {
      "id": 223,
      "start": 2388.6199951171875,
      "end": 2391.4199829101562,
      "text": " and you can look these things up and see their validity,"
    },
    {
      "id": 224,
      "start": 2391.4199829101562,
      "end": 2395.2200317382812,
      "text": " but Alexander the Great, as he was going and conquering"
    },
    {
      "id": 225,
      "start": 2395.2200317382812,
      "end": 2399.0999755859375,
      "text": " and moving forth, when he went into India in 326 BC,"
    },
    {
      "id": 226,
      "start": 2399.0999755859375,
      "end": 2402.260009765625,
      "text": " he gave record of finding hissing dragons."
    },
    {
      "id": 0,
      "start": 2402.260009765625,
      "end": 2407.96000957489,
      "text": " that were very descriptive-like to some of these types of dinosaurs that you hear about."
    },
    {
      "id": 1,
      "start": 2407.96000957489,
      "end": 2413.96000957489,
      "text": " In fact, many of us know about Marco Polo, and it's more than just a game that you play Marco Polo,"
    },
    {
      "id": 2,
      "start": 2413.96000957489,
      "end": 2419.4600105285645,
      "text": " and you kind of answer it, so on and so forth, but there was this man, The Travels of Marco Polo, right?"
    },
    {
      "id": 3,
      "start": 2419.4600105285645,
      "end": 2425.8600101470947,
      "text": " He traveled all over the place, and he would describe in this book, The Travels of Marco Polo,"
    },
    {
      "id": 4,
      "start": 2425.8600101470947,
      "end": 2432.0600090026855,
      "text": " he described in great detail a number of the animals that he would see in different parts of the world"
    },
    {
      "id": 5,
      "start": 2432.0600090026855,
      "end": 2436.660011291504,
      "text": " during his travels, and no doubt, if you were to read through the descriptions,"
    },
    {
      "id": 6,
      "start": 2436.660011291504,
      "end": 2442.4600105285645,
      "text": " he definitely could have had some contact with some dinosaurs as he had these travels."
    },
    {
      "id": 7,
      "start": 2442.4600105285645,
      "end": 2449.260009765625,
      "text": " I would say this, there's this ancient Egyptian plaque, and the Narmer Palette,"
    },
    {
      "id": 8,
      "start": 2449.260009765625,
      "end": 2457.260009765625,
      "text": " it depicts humans handling two creatures that are obvious long-necked dinosaurs."
    },
    {
      "id": 9,
      "start": 2457.260009765625,
      "end": 2463.4600105285645,
      "text": " So how do they have this plaque that depicts these humans that are handling this dinosaur?"
    },
    {
      "id": 10,
      "start": 2463.4600105285645,
      "end": 2468.560012817383,
      "text": " If dinosaurs and humans didn't exist at the same time, or if dinosaurs were done away with during the flood,"
    },
    {
      "id": 11,
      "start": 2468.560012817383,
      "end": 2474.060012817383,
      "text": " and they just ended, and so on and so forth, well, there's evidences out there that these dinosaurs existed,"
    },
    {
      "id": 12,
      "start": 2474.060012817383,
      "end": 2480.960006713867,
      "text": " and they have these. There's a Stegosaurus carving on a Cambodian temple wall,"
    },
    {
      "id": 13,
      "start": 2480.960006713867,
      "end": 2485.360008239746,
      "text": " and this Stegosaurus that's carved on this wall in this Cambodian temple,"
    },
    {
      "id": 14,
      "start": 2485.360008239746,
      "end": 2492.460006713867,
      "text": " it was carved nearly 800 years before any fossil of a Stegosaurus was ever found."
    },
    {
      "id": 15,
      "start": 2492.460006713867,
      "end": 2495.460006713867,
      "text": " That's interesting. I mean, somebody just make it up?"
    },
    {
      "id": 16,
      "start": 2495.460006713867,
      "end": 2500.560012817383,
      "text": " No, they probably saw them. They lived there. They dwelled in that area."
    },
    {
      "id": 17,
      "start": 2500.560012817383,
      "end": 2505.160011291504,
      "text": " It's also interesting, how many of you have ever gone to a Chinese restaurant,"
    },
    {
      "id": 18,
      "start": 2505.160011291504,
      "end": 2510.160011291504,
      "text": " and you sat down to eat, and they have that little placemat that has all those little animals,"
    },
    {
      "id": 19,
      "start": 2510.160011291504,
      "end": 2514.560012817383,
      "text": " and you are the year of the—I'm the year of the monkey, 1980, year of the monkey."
    },
    {
      "id": 20,
      "start": 2514.560012817383,
      "end": 2518.160011291504,
      "text": " I don't know. It just is what it is, right? The Chinese Zodiac."
    },
    {
      "id": 21,
      "start": 2518.160011291504,
      "end": 2523.860008239746,
      "text": " The Chinese Zodiac has 12 animals on it. 11 of them are animals that we know."
    },
    {
      "id": 22,
      "start": 2523.860008239746,
      "end": 2527.360008239746,
      "text": " But then there's a dragon. There's a dragon."
    },
    {
      "id": 23,
      "start": 2527.360008239746,
      "end": 2531.8600158691406,
      "text": " And many people would say, as they would look at that Chinese Zodiac,"
    },
    {
      "id": 24,
      "start": 2531.8600158691406,
      "end": 2537.3600158691406,
      "text": " that it features these 12 animals, and that 11 are real, and one is mythological."
    },
    {
      "id": 25,
      "start": 2537.3600158691406,
      "end": 2539.6600036621094,
      "text": " Does that really make sense?"
    },
    {
      "id": 26,
      "start": 2539.6600036621094,
      "end": 2546.1600036621094,
      "text": " If they have 11 known animals that we can still see today, that we still understand what they are,"
    },
    {
      "id": 27,
      "start": 2546.1600036621094,
      "end": 2550.8600158691406,
      "text": " then they have this dragon. I think that it's a better explanation to say that they encountered"
    },
    {
      "id": 28,
      "start": 2550.8600158691406,
      "end": 2554.3600158691406,
      "text": " these types of dinosaurs, these dragon-like animals,"
    },
    {
      "id": 29,
      "start": 2554.3600158691406,
      "end": 2558.760009765625,
      "text": " and they probably called them dragons because, remember, it wasn't until 1841"
    },
    {
      "id": 30,
      "start": 2558.760009765625,
      "end": 2562.8600158691406,
      "text": " that the word dinosaur was ever used in the English language."
    },
    {
      "id": 31,
      "start": 2562.8600158691406,
      "end": 2566.3600158691406,
      "text": " I want to read this to you as well as we conclude this evening."
    },
    {
      "id": 32,
      "start": 2566.3600158691406,
      "end": 2569.1600036621094,
      "text": " This is an article that was written in June of 2020."
    },
    {
      "id": 33,
      "start": 2569.1600036621094,
      "end": 2574.460006713867,
      "text": " So just a year and a couple of weeks ago, it was written on June 10th of 2020."
    },
    {
      "id": 34,
      "start": 2574.460006713867,
      "end": 2581.6600036621094,
      "text": " And it says, in 2017, so a few years ago, a large dinosaur was discovered, washed out to sea,"
    },
    {
      "id": 35,
      "start": 2581.6600036621094,
      "end": 2586.3600158691406,
      "text": " and it was similar to a dinosaur bone that was found 70 miles off of Norway's coast."
    },
    {
      "id": 36,
      "start": 2586.3600158691406,
      "end": 2592.3600158691406,
      "text": " Only this one was partially intact, nearly perfectly preserved."
    },
    {
      "id": 37,
      "start": 2592.3600158691406,
      "end": 2593.560012817383,
      "text": " And here's something that's very interesting."
    },
    {
      "id": 38,
      "start": 2593.560012817383,
      "end": 2599.8600158691406,
      "text": " It still contained its last meal fossilized inside its stomach."
    },
    {
      "id": 39,
      "start": 2599.8600158691406,
      "end": 2602.8600158691406,
      "text": " That's of interest, is it not?"
    },
    {
      "id": 40,
      "start": 2602.8600158691406,
      "end": 2607.8600158691406,
      "text": " I read part of this a moment ago, but fossils have to be buried fast and deep to be preserved."
    },
    {
      "id": 41,
      "start": 2607.8600158691406,
      "end": 2610.560012817383,
      "text": " There's no gentle drifting out to sea, settling to the bottom,"
    },
    {
      "id": 42,
      "start": 2610.560012817383,
      "end": 2615.760009765625,
      "text": " and then somehow becoming buried so that no scavengers attack the carcass."
    },
    {
      "id": 43,
      "start": 2615.760009765625,
      "end": 2621.560012817383,
      "text": " As the dinosaurs did various research and what have you on this particular fossil,"
    },
    {
      "id": 44,
      "start": 2621.560012817383,
      "end": 2628.560012817383,
      "text": " they discovered that there were 48 varieties of plants in this dinosaur's stomach."
    },
    {
      "id": 45,
      "start": 2628.560012817383,
      "end": 2633.560012817383,
      "text": " They made very interesting comments with regard to the plants that were found"
    },
    {
      "id": 46,
      "start": 2633.560012817383,
      "end": 2637.560012817383,
      "text": " and just the plant structure and so on and so forth."
    },
    {
      "id": 47,
      "start": 2637.560012817383,
      "end": 2640.560012817383,
      "text": " And they say this, the man that wrote the article says,"
    },
    {
      "id": 48,
      "start": 2640.560012817383,
      "end": 2644.560012817383,
      "text": " obviously the dinosaur was buried so quickly in the ocean"
    },
    {
      "id": 49,
      "start": 2644.560012817383,
      "end": 2648.560012817383,
      "text": " that even its stomach contents didn't have time to rot."
    },
    {
      "id": 50,
      "start": 2648.560012817383,
      "end": 2653.560012817383,
      "text": " And then he asked this question, how do you explain that?"
    },
    {
      "id": 51,
      "start": 2653.560012817383,
      "end": 2655.560012817383,
      "text": " What's your explanation for that?"
    },
    {
      "id": 52,
      "start": 2655.560012817383,
      "end": 2657.560012817383,
      "text": " How does someone explain this?"
    },
    {
      "id": 53,
      "start": 2657.560012817383,
      "end": 2662.5599975585938,
      "text": " And he says this, again, to answer or to ask the question that I mentioned at the very beginning,"
    },
    {
      "id": 54,
      "start": 2662.5599975585938,
      "end": 2665.5599975585938,
      "text": " the problem is not what we see, but how we interpret what we see."
    },
    {
      "id": 55,
      "start": 2665.5599975585938,
      "end": 2669.5599975585938,
      "text": " So when somebody sees this and they see this fossil, this dinosaur,"
    },
    {
      "id": 56,
      "start": 2669.5599975585938,
      "end": 2674.5599975585938,
      "text": " and it's got its last meal fossilized in its stomach, it didn't even rot, it didn't decay,"
    },
    {
      "id": 57,
      "start": 2674.5599975585938,
      "end": 2680.5599975585938,
      "text": " it's fossilized in its stomach, 48 varieties of plants."
    },
    {
      "id": 58,
      "start": 2680.5599975585938,
      "end": 2684.5599975585938,
      "text": " How does that happen?"
    },
    {
      "id": 59,
      "start": 2684.5599975585938,
      "end": 2689.5599975585938,
      "text": " The man that wrote this article says the best explanation for this wonderfully preserved dinosaur"
    },
    {
      "id": 60,
      "start": 2689.5599975585938,
      "end": 2694.5599975585938,
      "text": " and its intact stomach contents is that it was buried rapidly in the flood."
    },
    {
      "id": 61,
      "start": 2694.5599975585938,
      "end": 2699.5599975585938,
      "text": " Only a global flood with massive tsunami-like waves could transport a nearly intact"
    },
    {
      "id": 62,
      "start": 2699.5599975585938,
      "end": 2706.5599975585938,
      "text": " one-and-a-half ton dinosaur out to sea and bury it fast enough to preserve it so perfectly."
    },
    {
      "id": 63,
      "start": 2706.5599975585938,
      "end": 2713.5599975585938,
      "text": " That was a great conclusion to this particular article with regard to how do you explain what you're seeing."
    },
    {
      "id": 64,
      "start": 2713.5599975585938,
      "end": 2717.5599975585938,
      "text": " We don't have to be afraid of talking to people about dinosaurs."
    },
    {
      "id": 65,
      "start": 2717.5599975585938,
      "end": 2723.5599975585938,
      "text": " But I will caution you with this, most people aren't coming from a biblical worldview."
    },
    {
      "id": 66,
      "start": 2723.5599975585938,
      "end": 2727.5599975585938,
      "text": " So when you begin with a biblical worldview, you understand that people are going to oppose that."
    },
    {
      "id": 67,
      "start": 2727.5599975585938,
      "end": 2730.5599975585938,
      "text": " But I would tell you this, especially for those that have children at home"
    },
    {
      "id": 68,
      "start": 2730.5599975585938,
      "end": 2735.5599975585938,
      "text": " and some of the little kids that were so excited about dinosaurs and so on and so forth,"
    },
    {
      "id": 69,
      "start": 2735.5599975585938,
      "end": 2740.5599975585938,
      "text": " little Ari had a dinosaur shirt on, I saw him on Friday and he had a dinosaur shirt on,"
    },
    {
      "id": 70,
      "start": 2740.5599975585938,
      "end": 2743.5599975585938,
      "text": " and kids like dinosaurs."
    },
    {
      "id": 71,
      "start": 2743.5599975585938,
      "end": 2750.5599975585938,
      "text": " But I would caution you with regard to dinosaurs because the world teaches something entirely different"
    },
    {
      "id": 72,
      "start": 2750.5599975585938,
      "end": 2753.5599975585938,
      "text": " than what the Word of God would say about dinosaurs."
    },
    {
      "id": 73,
      "start": 2753.5599975585938,
      "end": 2757.5599975585938,
      "text": " When they begin to teach all of their evolutionary nonsense and they teach all of their stuff"
    },
    {
      "id": 74,
      "start": 2757.5599975585938,
      "end": 2760.5599975585938,
      "text": " about all of these millions and billions of years,"
    },
    {
      "id": 75,
      "start": 2760.5599975585938,
      "end": 2765.5599975585938,
      "text": " it really can undermine the authority of the Word of God with regard to other subject matters."
    },
    {
      "id": 76,
      "start": 2765.5599975585938,
      "end": 2772.5599975585938,
      "text": " And so I would encourage that we would be able to adequately go to the Word of God and say,"
    },
    {
      "id": 77,
      "start": 2772.5599975585938,
      "end": 2774.5599975585938,
      "text": " here's what God's Word says."
    },
    {
      "id": 78,
      "start": 2774.5599975585938,
      "end": 2780.5599975585938,
      "text": " You don't have to see the word dinosaur to understand that these beasts exist."
    },
    {
      "id": 79,
      "start": 2780.5599975585938,
      "end": 2787.5599975585938,
      "text": " And that though that word isn't used, it wasn't used for a long time in any other writings."
    },
    {
      "id": 80,
      "start": 2787.5599975585938,
      "end": 2791.5599975585938,
      "text": " So why criticize the Bible because the word isn't there?"
    },
    {
      "id": 81,
      "start": 2791.5599975585938,
      "end": 2793.5599975585938,
      "text": " It wasn't a word that existed."
    },
    {
      "id": 82,
      "start": 2793.5599975585938,
      "end": 2797.5599975585938,
      "text": " And therefore that argument should be thrown out, in my opinion."
    },
    {
      "id": 83,
      "start": 2797.5599975585938,
      "end": 2801.5599975585938,
      "text": " And so this evening, we can answer the question, where did dinosaurs come from?"
    },
    {
      "id": 84,
      "start": 2801.5599975585938,
      "end": 2804.5599975585938,
      "text": " God made them. God made them."
    },
    {
      "id": 85,
      "start": 2804.5599975585938,
      "end": 2807.5599975585938,
      "text": " Did dinosaurs and humans live at the same time?"
    },
    {
      "id": 86,
      "start": 2807.5599975585938,
      "end": 2810.5599975585938,
      "text": " Emphatically, yes. Absolutely."
    },
    {
      "id": 87,
      "start": 2810.5599975585938,
      "end": 2817.5599975585938,
      "text": " To the best of our understanding of Genesis chapter 1, they were created on the same exact day."
    },
    {
      "id": 88,
      "start": 2817.5599975585938,
      "end": 2821.5599975585938,
      "text": " Where did they go? What happened to them?"
    },
    {
      "id": 89,
      "start": 2821.5599975585938,
      "end": 2823.5599975585938,
      "text": " Why so many fossils?"
    },
    {
      "id": 90,
      "start": 2823.5599975585938,
      "end": 2825.5599975585938,
      "text": " There was a global flood."
    },
    {
      "id": 91,
      "start": 2825.5599975585938,
      "end": 2828.5599975585938,
      "text": " And only the things that were taken onto the ark,"
    },
    {
      "id": 92,
      "start": 2828.5599975585938,
      "end": 2832.5599975585938,
      "text": " only Noah and his wife and his three sons and their wives, eight people,"
    },
    {
      "id": 93,
      "start": 2832.5599975585938,
      "end": 2834.5599975585938,
      "text": " they were the only ones saved."
    },
    {
      "id": 94,
      "start": 2834.5599975585938,
      "end": 2836.5599975585938,
      "text": " And the animals that were brought thereon."
    },
    {
      "id": 95,
      "start": 2836.5599975585938,
      "end": 2838.5599975585938,
      "text": " Every other thing died."
    },
    {
      "id": 96,
      "start": 2838.5599975585938,
      "end": 2843.5599975585938,
      "text": " Therefore you have lots of fossils, billions of fossils."
    },
    {
      "id": 97,
      "start": 2843.5599975585938,
      "end": 2846.5599975585938,
      "text": " We find that one day when God said,"
    },
    {
      "id": 98,
      "start": 2846.5599975585938,
      "end": 2851.5599975585938,
      "text": " alright Noah, the waters have assuaged, it's time to come off the ark."
    },
    {
      "id": 99,
      "start": 2851.5599975585938,
      "end": 2856.5599975585938,
      "text": " Not only did Noah and his family come off, but all the animals came off, including dinosaurs."
    },
    {
      "id": 100,
      "start": 2856.5599975585938,
      "end": 2861.5599975585938,
      "text": " And therefore we have records, of some of which I shared with you this evening,"
    },
    {
      "id": 101,
      "start": 2861.5599975585938,
      "end": 2866.5599975585938,
      "text": " we have these historical records of man interacting with dinosaurs."
    },
    {
      "id": 102,
      "start": 2866.5599975585938,
      "end": 2874.5599975585938,
      "text": " Man depicting dinosaurs in very old carvings and paintings and what have you."
    },
    {
      "id": 103,
      "start": 2874.5599975585938,
      "end": 2876.5599975585938,
      "text": " Why? Because they exist."
    },
    {
      "id": 104,
      "start": 2876.5599975585938,
      "end": 2878.5599975585938,
      "text": " They existed."
    },
    {
      "id": 105,
      "start": 2878.5599975585938,
      "end": 2880.5599975585938,
      "text": " And they're a real thing."
    },
    {
      "id": 106,
      "start": 2880.5599975585938,
      "end": 2883.5599975585938,
      "text": " And so we don't have to shy away from it. We don't have to be fearful of it."
    },
    {
      "id": 107,
      "start": 2883.5599975585938,
      "end": 2886.5599975585938,
      "text": " And we start with the Bible and we end with the Bible."
    },
    {
      "id": 108,
      "start": 2886.5599975585938,
      "end": 2888.5599975585938,
      "text": " Here's what the Word of God says."
    },
    {
      "id": 109,
      "start": 2888.5599975585938,
      "end": 2891.5599975585938,
      "text": " Understand, the natural man receiveth not the things of the Spirit of God,"
    },
    {
      "id": 110,
      "start": 2891.5599975585938,
      "end": 2895.5599975585938,
      "text": " their foolishness unto him, neither can he know them, for they are spiritually discerned."
    },
    {
      "id": 111,
      "start": 2895.5599975585938,
      "end": 2898.5599975585938,
      "text": " People continue to push away the record of Genesis,"
    },
    {
      "id": 112,
      "start": 2898.5599975585938,
      "end": 2902.5599975585938,
      "text": " and they seek to interpret things through their own mind and their own understanding."
    },
    {
      "id": 113,
      "start": 2902.5599975585938,
      "end": 2908.5599975585938,
      "text": " But the reality is that God's record makes a lot of sense."
    },
    {
      "id": 114,
      "start": 2908.5599975585938,
      "end": 2910.5599975585938,
      "text": " It gives us the truth. Why?"
    },
    {
      "id": 115,
      "start": 2910.5599975585938,
      "end": 2912.5599975585938,
      "text": " Because He is the truth."
    },
    {
      "id": 116,
      "start": 2912.5599975585938,
      "end": 2914.5599975585938,
      "text": " And He is the Creator."
    },
    {
      "id": 117,
      "start": 2914.5599975585938,
      "end": 2916.5599975585938,
      "text": " And He says, here's how it all happened."
    },
    {
      "id": 118,
      "start": 2916.5599975585938,
      "end": 2919.5599975585938,
      "text": " We love you. We thank you for loving us."
    },
    {
      "id": 119,
      "start": 2919.5599975585938,
      "end": 2924.5599975585938,
      "text": " I know it was a very teachy type of a message this evening,"
    },
    {
      "id": 120,
      "start": 2924.5599975585938,
      "end": 2934.5599975585938,
      "text": " but I hope that somehow tonight you have strengthened us in our ability to have confidence in your Word"
    },
    {
      "id": 121,
      "start": 2934.5599975585938,
      "end": 2937.5599975585938,
      "text": " with regard even to the subject matter of dinosaurs."
    },
    {
      "id": 122,
      "start": 2937.5599975585938,
      "end": 2939.5599975585938,
      "text": " There are times in which we see things."
    },
    {
      "id": 123,
      "start": 2939.5599975585938,
      "end": 2942.5599975585938,
      "text": " Perhaps we've been taught things in some other setting somewhere,"
    },
    {
      "id": 124,
      "start": 2942.5599975585938,
      "end": 2945.5599975585938,
      "text": " maybe in college or elsewhere,"
    },
    {
      "id": 125,
      "start": 2945.5599975585938,
      "end": 2949.5599975585938,
      "text": " where people have sought to teach us something entirely different with regard to dinosaurs."
    },
    {
      "id": 126,
      "start": 2949.5599975585938,
      "end": 2953.5599975585938,
      "text": " And maybe we just felt inadequate on being able to answer the question"
    },
    {
      "id": 127,
      "start": 2953.5599975585938,
      "end": 2956.5599975585938,
      "text": " or even to engage in discussion with someone."
    },
    {
      "id": 128,
      "start": 2956.5599975585938,
      "end": 2965.5599975585938,
      "text": " God, I pray that you'd help us tonight to once again have that firm foundation of your Word,"
    },
    {
      "id": 129,
      "start": 2965.5599975585938,
      "end": 2968.5599975585938,
      "text": " knowing that you've given us the truth,"
    },
    {
      "id": 130,
      "start": 2968.5599975585938,
      "end": 2971.5599975585938,
      "text": " knowing that you are the Creator of all things,"
    },
    {
      "id": 131,
      "start": 2971.5599975585938,
      "end": 2977.5599975585938,
      "text": " and that you've given us a record that provides us with answers to many of these questions."
    },
    {
      "id": 132,
      "start": 2977.5599975585938,
      "end": 2980.5599975585938,
      "text": " I pray that you'd strengthen our faith."
    },
    {
      "id": 133,
      "start": 2980.5599975585938,
      "end": 2985.5599975585938,
      "text": " Lord, we pray that you'd give us a blessed time of fellowship tonight as we have birthday fellowship."
    },
    {
      "id": 134,
      "start": 2985.5599975585938,
      "end": 2989.5599975585938,
      "text": " I pray that you would be exalted in our midst, that you'd help us to have a sweet time,"
    },
    {
      "id": 135,
      "start": 2989.5599975585938,
      "end": 2991.5599975585938,
      "text": " and we'll thank you for all that you'll do."
    },
    {
      "id": 136,
      "start": 2991.5599975585938,
      "end": 2992.5599975585938,
      "text": " For it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-17T05:33:35.945193"
}