{
  "video_id": "NGIJFkrbrSQ",
  "text": "Matthew chapter number 16 this evening, Matthew chapter number 16, and as you know, this is part of our study through the book of Titus, and you say we haven't been in Titus in a long time. I understand, but let me remind you of what Paul says to Titus in Titus chapter number 2 and verse number 1. He says, but speak thou the things which become sound doctrine. And so we, from that passage of scripture, of course, we made references, we studied through Titus chapter number 1, the references that are given to us there with regard to doctrine and sound doctrine and the importance of sound doctrine. And so as we entered into the second chapter of the book of Titus, we kind of took this path of dealing with doctrinal issues. Doctrine is important, and we've laid the foundation, we dealt with bibliology, we then dealt with theology, and this evening we'll deal with Christology, and we'll begin studying the doctrine of Christ, and we'll begin this evening with this passage of scripture in Matthew chapter number 16. And so we'll be transitioning from the doctrine of God to the doctrine of Christ, and it's important as we look at this passage of scripture, we'll focus upon the significance of this question that Jesus asked to his disciples. We'll find this evening that the record that we'll look at is recorded here in Matthew, Mark, and also in the book of Luke, and so we'll reference each of those books this evening, and it's such an important question that is asked in verse number 13 of Matthew 16. The Bible says this, when Jesus came into the coast of Caesarea Philippi, he asked his disciples saying, whom do men say that I, the Son of Man, am? And as we think about this question that is at the end of verse number 13 here in Matthew's Gospel in the 16th chapter, I would say this tonight, that this question is as important today as it was on the first day that Jesus asked this question. And why is it that we'd say that? He's speaking to the disciples, of course, and he's asking them, whom do men say that I, the Son of Man, am? And of course, he will say, as we'll study through the passage this evening in verse number 15, but whom say ye that I am? And we find the significance of this question is this, if you get it wrong about Jesus and who he is, you're in grave danger. And we'll find this evening that just as we look at the passage of scripture that is recorded for us, we will find that there still exists a great amount of confusion today about who is Jesus. Who is he? And we, of course, as followers of Jesus Christ, we need to know ourselves who he is, but it's also imperative that we are able to communicate with those that we come into contact with who he is. We preach Christ. That's what Paul says, he's writing to the believers in Corinth, and of course, we understand as we read throughout the scriptures that we've been given the great commission that we're to go and preach the gospel to every creature, and you understand today that there is a great percentage of our population that do not know the Jesus of the Bible. They may know some things about Jesus, they may have been told some things about who Jesus is, some, I believe this evening with all of my heart, that some in our community, in our world, they know Jesus as nothing more than a swear word. They don't know who he is. And as his people, as his followers, it's imperative that we know who he is, but that we are adequately equipped to be able to share that truth with those that we come in contact with. And so, over the next several weeks, as we study the doctrine of Christ and we look at the truth of God's word with regard to who Christ is, what are we doing? We're trying to build up our faith, we're trying to get us to a place where we are sound in doctrine, so that when we come in contact with those in our world that do not know Jesus, that we are equipped to be able to preach Christ. It's interesting, today, I had a dental appointment this morning, and as I was there at the dentist, and I had never actually had this dentist do any work on me before, my dentist was tied up and his partner was able to see me this morning. In any case, I told him that I was a pastor, we were just kind of chit-chatting in the beginning and what have you, and after they kind of gave me the shots and let the numbness kind of set in, he said, so give me a preview of your message this evening. What a great opportunity. And I said, here's the message I'll be preaching tonight, whom do men say that I am? And I said, Jesus was speaking to his disciples, and he asked them that question, and they responded. The disciples say, well, some say this, some say that, and I began to share with him the truth of who Jesus is, a unique opportunity. And I was thankful for the divine appointment that God had given me that this evening the subject matter of our message was whom do men say that I am? And he says, give me a preview of the message, what a great opportunity. And this evening, we'll find that as we look at this passage and look at the sister passages of Mark and Luke, we'll find the significance of this truth. So the title, if you're taking notes, whom do men say that I am? Whom do men say that I am? Notice with me, if you're taking notes, number one, the confusion of the people. The confusion of the people. We find that Jesus is speaking to his disciples directly in verse number 13. And he says to them, whom do men say that I, the Son of Man am? And they said, the disciples provide an answer to the Lord Jesus Christ in verse number 14. And notice, there are really four different aspects that are given here. It says this, some say that thou art John the Baptist. So there was a group of people, there was a contingency of those that they had come in contact with that the disciples were aware of what their understanding of who Jesus was. Because listen, Jesus was well known. There were many people. You find that as you study through the scriptures, as Jesus would enter into a community, as he would go and he'd teach, there were throngs of people. They were aware of Jesus, but the question is, who is he? Who is this Jesus? Who is this one? And we find that Jesus says, whom do men say that I, the Son of Man am? And they said, well, there's some that say you're John the Baptist. There's another group, notice in verse number 14, some, Elias or Elijah. We find that it says, and others, Jeremias or Jeremiah. And then there's this last statement, or one of the prophets. And so there are people that have come to this conclusion of who Jesus is. And there's confusion. We see the confusion of the people. Is Jesus John the Baptist? No, he's not. Is Jesus Elijah? No. Is he Jeremiah? No. Is he one of the prophets? No. He is God in flesh. But there were some people that had, it wasn't like, well, they don't know who you are. They don't know. They concluded wrong. They were confused as to who Jesus was. And they said, John the Baptist, Elijah, Jeremiah, one of the prophets. And it's interesting, for as we look at this passage of Scripture and see the way in which the disciples answered Jesus, I want you to keep this in mind and turn to Mark chapter number six, if you will. And this is not the sister passage that deals with the same context of what we're dealing with with this question. We'll look at that in just a moment. But in Mark chapter number six, I want you to see this reference with regard to Herod. In Mark six and verse number 14, the Bible says this, and King Herod heard of him. The him is Jesus. It says, for his name was spread abroad. I just told you that we understand. You study through the Gospels and you'll see that there were many that knew about Jesus. And he said, Herod said that John the Baptist was risen from the dead. And therefore mighty works do show forth themselves in him. Others said that it is a prophet or as one of the prophets. But when Herod heard thereof, he said, it is John whom I beheaded. He is risen from the dead. Herod was wrong. He was wrong about who Jesus was. Jesus wasn't John the Baptist resurrected. And he is, Jesus is God in flesh. But we find that as the disciples would give the answer that we are reading in Matthew chapter number 16, that there's record of Herod having this idea that Jesus is John the Baptist, that there were others that said, no, we hear what you're saying, but we don't think he's John the Baptist. We think he's Elijah or he's one of the prophets or he's like a prophet. Notice a few passages over in Mark chapter number nine, excuse me, Mark chapter number eight, the sister passage for what we're studying there in Matthew's gospel, Jesus is speaking in verse number 27, it says this, and Jesus went out and his disciples into the towns of Caesarea Philippi. And by the way, he asked his disciples saying unto them, whom do men say that I am? And we see the same discussion that takes place. He'll then ask them in verse number 29. but whom say ye that I am?\" And as we look here, it's interesting, for the Bible says that as they were going, listen, they were... Jesus went out, his disciples into the towns of Caesarea Philippi, and by the way, he asked his disciples, saying unto them, whom do men say that I am? Notice over in the book of Luke, in Luke chapter 9, and I want you to notice here the passage and the insight that we're given with regard to this again, what's taking place. It says in verse number 18 of Luke chapter number 9, and it came to pass as he was alone praying, his disciples were with him, and he asked them, saying, whom say the people that I am? They answering said, John the Baptist, but some say Elias, and others say that one of the old prophets is risen again, and then of course he says, but whom say ye that I am? And so Matthew, Mark, and Luke are all recording this absolute significant question. We're dealing with, as we begin studying and looking at this question that is asked, we're dealing with the confusion of the people, and I would ask this, why? Why is there confusion about who Jesus is? I believe there's a very simple answer as to the source of the confusion, and it's found in the truth that Paul would give to us in 2nd Corinthians chapter number 4. Hold your place there in Matthew chapter 16, and turn to the book of 2nd Corinthians, if you will, in chapter number 4, and as we look at this passage and look at this truth that Paul is sharing with the church in Corinth and with these believers, remember they've already been instructed with regard to a number of things, and about the importance, the significance of preaching the gospel in the first letter that's titled 1st Corinthians, but we notice here in 2nd Corinthians chapter number 4 in verse number 3, it says, but if our gospel be hid, it is hid to them that are lost. Now notice what the Bible says in verse number 4, in whom the God of this world hath blinded the minds of them which believe not, lest the light of the glorious gospel of Christ, who is the image of God, should shine unto them. For we preach not ourselves, but Christ Jesus the Lord, and ourselves your servants for Jesus's sake. You notice in verse number 4, the Bible speaks about the God of this world, that's Satan, and the work that he's done to blind the minds of them which believe not. You understand this evening that Satan does not want people to know who Jesus is. He doesn't want people to know that Jesus is God, that he is the Messiah, that he is the only way to heaven. He doesn't want people to know that, and so we find that there's this confusion. Listen, Satan is perfectly fine with somebody believing in a historical Jesus as being a prophet, or being John the Baptist, risen again, or being you name it. Satan's perfectly fine with that, because if you get it wrong on Jesus, you're in grave danger, and we find that the God of this world, Satan himself, has blinded the minds of them which believe not, lest the light of the glorious gospel of Christ, who is the image of God, should shine unto them. And so we understand this evening the source of this confusion, why it was that these people were confused. Of course, Satan is working. Remember, there's this spiritual battle that is constantly raging, and Satan does not desire for anyone to know who Jesus really is. We find that the confusion that is evidenced here in Matthew chapter number 16 in each of the Gospels that record this discussion in Matthew, Mark, and Luke, the confusion that is obvious, that is evidenced through the answer that the disciples give—well, some say John the Baptist, some say Elijah, some Jeremiah, some say one of the prophets—in that obvious confusion, the reality is that that confusion still exists today. It continues to exist today. You can talk to various people that you come into contact with, and you can ask them who Jesus is. Whom do men say that I am? Jesus asks his disciples that, but you just go ahead and start asking some people, who is Jesus? Who is he? You know, there are some cults that teach some really blasphemous things with regard to who Jesus Christ is. There are some world religions that teach some blasphemous things with regard to who Jesus Christ is. They're perfectly fine with saying that he existed as a man, that he was a prophet, he was a good man, he did some good things. They're okay with that. Why? Because he's not the Savior of the world. Because he's not God in flesh. And we find that the battle that was raging during the life and ministry of the Lord Jesus Christ with regard to his person and who he is continues to exist today. There's great confusion. It was interesting as I was speaking with the dentist this morning, and I was sharing things with him, he began to share with me where he was from and some things that he experienced as a young person, so on and so forth, and he identified with a certain denomination. And so he had some knowledge of some of the scriptural things. And as we were speaking, he shared with me how that in his country where he was from, and he grew up there and he was there until he was 18, that it was very common to be able to talk openly about your beliefs and about your religion, quote-unquote, even amongst those that differed in their philosophies, their ideologies, it was a very common thing. And he said, I noticed when I came to America that increasingly over the years that I've been here, and he's been here for longer than he was in his home country, that it's not commonly accepted to be able to just talk freely about Jesus. It was very insightful to hear him say that because the reality is that there are some people—I remember hearing when I was a child that there were two things that you didn't talk about amongst family, religion and politics. I heard that various times as I was growing up. You would come into the group of a family reunion, if you will, and there were two subject matters in which they often said those were off-limits. Well, one of the grave results of those topics not being discussed is that there's a lack of knowledge about the truth of who Jesus is. Why? Because there were some people that knew who he is, they know who he is, but they don't talk about it because they don't feel like it's commonly accepted, socially acceptable to talk about who Jesus is. But you understand that as God's people, we've been given a command. We've been instructed to be his representatives, to be his ambassadors, to go forth and to speak his word with boldness, and that's our responsibility. And so we find that the confusion that existed during the life and ministry of the Lord Jesus Christ nearly 2,000 years ago continues to exist to this very day. Now, honestly, I've not met anyone that said that he's John the Baptist. The confusion is different as to who Jesus is, but I would submit to you that there's still confusion, a great amount of confusion. And we understand that they're confused because Satan has blinded their minds, and Satan is perfectly fine with groups of people, world religions, cults, others, just believing something short of who Jesus really is. We find not only the confusion of the people, but I want you to notice with me as we go back to Matthew 16, the confidence of Peter, the confidence of Peter. It's interesting in verse number 15 that Jesus, after he receives the answer that is provided from these disciples, and it is interesting to me that the record that is given to us in verse number 14, and they said, that's plural, correct? And Jesus is speaking to his disciples in verse number 13. He asked his disciples, again plural, whom do men say that I, the Son of Man, am? And they said, so there was more than one disciple that responded, that answered Jesus. I almost, in my mind's eye, imagine it as they're there together, that one of the disciples, Andrew, James, John, Peter, whomever, says, hey, some say that you're John the Baptist, and then one pipes up and says, Jeremiah, and one says, right? Because they responded. But Jesus then says unto them, is them singular or plural? It's plural. He says to them, to the disciples, the same group of people that he's speaking to in verse 13, but whom say ye that I am? And Simon Peter answered. Simon Peter answered. He is the one, singular, the individual that provides an answer. I see the confidence of Peter as I look at the passage of Scripture. In my mind's eye, again, as I would imagine them walking and ministering and Jesus asking the disciples and how they responded. And then, as he said, but whom do ye say that I am? And I can, in my mind's eye, I can see Peter and I can hear Peter with boldness and with confidence. I don't see it as being a timid response. Have you ever asked somebody a question and in their response you understand that they're not really sure that that answer was correct? You've ever had that situation? You ask somebody and they kind of, you know, and you can just kind of tell they just aren't real sure what they're talking about. But when you ask somebody a question and they are confident in their response, they're a matter of fact, you gain from their response, you gain a level of confidence as well. And we find that Peter answered, again, I believe with confidence and boldness, and he says, \"'Thou art the Christ, the Son of the living God.'\" What a great declaration. We find that the name, of course, Jesus, in verse number 13, when Jesus came into the coast of Caesarea Philippi, we had studied about the names of God in the Old Testament. We will also, as we study the doctrine of Christ, we'll review several of the names that are mentioned of Jesus here in the New Testament. But it is interesting that Jesus, the name that is mentioned in verse number 13, and then in verse number 16, that he, Peter, says, \"'Thou art the Christ.'\" Now, as we understand the name Jesus, it means Jehovah is salvation, God incarnate. Remember, when the angel appeared to Mary with regard to the announcement of the birth of Jesus, she was instructed that his name shall be called Jesus. Remember in verse 21 of Matthew 1, you don't need to turn there, I'll read it, \"'And she shall bring forth a son, and thou shalt call his name Jesus.'\" Why? \"'For he shall save his people from their sins.'\" And so Jehovah is salvation, God incarnate. The name Christ, when Peter stands up and says, \"'Thou art the Christ, the Son of the living God,' the name Christ means the anointed, the Messiah, the Son of God, the promised one, the one that all of those messianic prophecies that you study and you read about in the Old Testament and how that they are properly fulfilled in the person of Jesus Christ. Peter stands with this boldness and this confidence and he says, \"'Thou art the Christ, the Son of the living God.'\" It's interesting what is said in Jesus' response to Peter in verse number 17, \"'And Jesus answered and said unto him, Blessed art thou, Simon Bar-Jonah, for flesh and blood hath not revealed it unto thee, but my Father which is in heaven.'\" You understand that God wants us to know who Jesus is. When I say it that way, we understand that Jesus is God. But what I'm saying is that we understand that Jesus is revealing himself. We understand that he manifested himself as we study the gospels and we look at all that's taking place in the incarnation and the deity of Christ and we study through the doctrine of Christ how encouraged we will be as we understand the significance of who Jesus is. And we understand, listen, you're not going to get this from some place, some school somewhere, some… No, God is revealing to Peter here, he's referred to as Simon Bar-Jonah in verse 17, God has revealed this truth to him as to who Jesus is. The question that I have this evening for myself and for each of us that are here is this. We understand that there is confusion amongst the people, we understand that, but which one amongst us will have the confidence that Peter had to stand up and declare who Jesus is? See, it's important, as I said by way of introduction, it's important for us as the followers of Christ to know who he is, that he is God, that he is the only Messiah. It's important for us to understand who Jesus is for ourselves, but also so that we could share that message with those that we come into contact with. Why? Because the only hope for anyone is Jesus. Jesus is the hope for lost sinners, Jesus is the hope for our nation, and the true Jesus of the Bible. Not some, well, he's a prophet, or he's a created angel, or he's a created being, he's a, no, those are not true. He's God. And this evening, as we look at this passage of Scripture and begin our study of the doctrine of Christ, we are mindful of the fact that even as Jesus asked this question nearly 2,000 years ago, the question begs to be asked again this evening amongst those that we come into contact with. We tonight, if we were to sit down and give an answer, even as the disciples did, whom do men say that I am? You've come in contact with people. Who is it that those that you've spoken to, who is it that they say Jesus is? Have you heard some say that he's a teacher? He's a prophet? He's a good man? I mean, some try to deny the very existence of Jesus, but you find that it's very hard to deny his existence, so what the enemy has sought to do is not deny the existence, but change who he is. It's very difficult to say that Jesus didn't exist. There's record, abundance of record, that he existed. But what the enemy has done is not to deny his existence, but to alter who he is, to cause confusion amongst the people of who he is. Because if man does not know who Jesus is, there's grave consequences. It's a grave danger. Why? For there's no other name under heaven given among men whereby we must be saved. Listen, Jesus is not a way to heaven, he is the way to heaven. And we need to understand this evening that we're living in the midst of a people that are confused about who Jesus is. And we've been given a unique opportunity to be his representatives, his ambassadors, and we need to have the kind of confidence that Peter had. I understand he's answering Jesus, but I'm saying that we need to be able to have that kind of boldness and confidence as we come into contact with people. You hear people talking about Jesus and they're talking about him in a wrong way, that we'd have the opportunity to be able to stand up and say, hey, that's my Savior. He died for me and he died for you. Begin to share the truth of who Jesus really is. He's not a swear word. He's God and he's the Savior of the world. And this evening, I hope that as we, tonight, have this introductory thought into the next several lessons of the doctrine of Christ, that we would be mindful of the confusion that exists around us, that we would understand why that confusion exists, and that we would be properly, adequately equipped so that we could give an answer, so that we not only know ourselves who he is, but so that we could go and share that truth with those that we come into contact with. You know, there are people that have been, I mean, they have made it their life mission to go through and try to attack every reference of Jesus being God, because we understand the work of Satan behind the whole thing. And so when we get to a position and we begin to interact with people and speak to them about Jesus, and they have these ideas of who Jesus is, and I could share some with you privately of some things that I've heard over the years, how do we respond to it? Are we equipped to be able to answer the questions, to be able to preach Christ and Christ alone? This evening, whom do men say that I am? Of course, Peter stood up with great boldness and confidence, thou art the Christ, the Son of the living God. That's when Jesus said, whom do ye say that I am? Because there was confusion, but Peter had confidence, and we need to have that same confidence. Let's pray. Father, we love you. We thank you for loving us. We thank you for your Word, for how you have revealed yourself to us through your Word. We thank you this evening for the opportunity to be your representatives. And God, we are mindful, keenly aware of the fact that we live in the midst of a people that are greatly confused about who you are. The enemy has worked through cults and false teachers, world religions, to give a false teaching of the person of Jesus Christ. And God, I pray this evening that we as your followers would be properly, adequately equipped to be able to give an answer, to stand up with confidence and to proclaim who you are. We know the significance of this question. We know the cause of the confusion, and I pray that we would dig into your Word so that we could be equipped to answer. I pray that you'd bless our time of prayer. We thank you again for the privilege. I pray that you'd be honored and glorified through all that's said and done for the remainder of our service. For it's in Christ's name we pray. Amen. All right, if you have your prayer bullets in this evening.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 7.159999847412109,
      "text": " Matthew chapter number 16 this evening, Matthew chapter number 16, and as you know, this is"
    },
    {
      "id": 1,
      "start": 7.159999847412109,
      "end": 11.880000114440918,
      "text": " part of our study through the book of Titus, and you say we haven't been in Titus in a"
    },
    {
      "id": 2,
      "start": 11.880000114440918,
      "end": 12.880000114440918,
      "text": " long time."
    },
    {
      "id": 3,
      "start": 12.880000114440918,
      "end": 18.719999313354492,
      "text": " I understand, but let me remind you of what Paul says to Titus in Titus chapter number"
    },
    {
      "id": 4,
      "start": 18.719999313354492,
      "end": 21.280000686645508,
      "text": " 2 and verse number 1."
    },
    {
      "id": 5,
      "start": 21.280000686645508,
      "end": 25.959999084472656,
      "text": " He says, but speak thou the things which become sound doctrine."
    },
    {
      "id": 6,
      "start": 25.959999084472656,
      "end": 30.360000610351562,
      "text": " And so we, from that passage of scripture, of course, we made references, we studied"
    },
    {
      "id": 7,
      "start": 30.360000610351562,
      "end": 36.86000061035156,
      "text": " through Titus chapter number 1, the references that are given to us there with regard to"
    },
    {
      "id": 8,
      "start": 36.86000061035156,
      "end": 41.0,
      "text": " doctrine and sound doctrine and the importance of sound doctrine."
    },
    {
      "id": 9,
      "start": 41.0,
      "end": 45.65999984741211,
      "text": " And so as we entered into the second chapter of the book of Titus, we kind of took this"
    },
    {
      "id": 10,
      "start": 45.65999984741211,
      "end": 49.0,
      "text": " path of dealing with doctrinal issues."
    },
    {
      "id": 11,
      "start": 49.0,
      "end": 54.0,
      "text": " Doctrine is important, and we've laid the foundation, we dealt with bibliology, we then"
    },
    {
      "id": 12,
      "start": 54.0,
      "end": 58.959999084472656,
      "text": " dealt with theology, and this evening we'll deal with Christology, and we'll begin studying"
    },
    {
      "id": 13,
      "start": 58.959999084472656,
      "end": 63.31999969482422,
      "text": " the doctrine of Christ, and we'll begin this evening with this passage of scripture in"
    },
    {
      "id": 14,
      "start": 63.31999969482422,
      "end": 64.91999816894531,
      "text": " Matthew chapter number 16."
    },
    {
      "id": 15,
      "start": 64.91999816894531,
      "end": 71.04000091552734,
      "text": " And so we'll be transitioning from the doctrine of God to the doctrine of Christ, and it's"
    },
    {
      "id": 16,
      "start": 71.04000091552734,
      "end": 76.95999908447266,
      "text": " important as we look at this passage of scripture, we'll focus upon the significance of this"
    },
    {
      "id": 17,
      "start": 76.95999908447266,
      "end": 81.27999877929688,
      "text": " question that Jesus asked to his disciples."
    },
    {
      "id": 18,
      "start": 81.27999877929688,
      "end": 86.16000366210938,
      "text": " We'll find this evening that the record that we'll look at is recorded here in Matthew,"
    },
    {
      "id": 19,
      "start": 86.16000366210938,
      "end": 92.0,
      "text": " Mark, and also in the book of Luke, and so we'll reference each of those books this evening,"
    },
    {
      "id": 20,
      "start": 92.0,
      "end": 98.55999755859375,
      "text": " and it's such an important question that is asked in verse number 13 of Matthew 16."
    },
    {
      "id": 21,
      "start": 98.55999755859375,
      "end": 105.0,
      "text": " The Bible says this, when Jesus came into the coast of Caesarea Philippi, he asked his"
    },
    {
      "id": 22,
      "start": 105.0,
      "end": 113.55999755859375,
      "text": " disciples saying, whom do men say that I, the Son of Man, am?"
    },
    {
      "id": 23,
      "start": 113.55999755859375,
      "end": 119.83999633789062,
      "text": " And as we think about this question that is at the end of verse number 13 here in Matthew's"
    },
    {
      "id": 24,
      "start": 119.83999633789062,
      "end": 126.19999694824219,
      "text": " Gospel in the 16th chapter, I would say this tonight, that this question is as important"
    },
    {
      "id": 25,
      "start": 126.19999694824219,
      "end": 131.83999633789062,
      "text": " today as it was on the first day that Jesus asked this question."
    },
    {
      "id": 26,
      "start": 131.83999633789062,
      "end": 133.44000244140625,
      "text": " And why is it that we'd say that?"
    },
    {
      "id": 27,
      "start": 133.44000244140625,
      "end": 137.63999938964844,
      "text": " He's speaking to the disciples, of course, and he's asking them, whom do men say that"
    },
    {
      "id": 28,
      "start": 137.63999938964844,
      "end": 140.1199951171875,
      "text": " I, the Son of Man, am?"
    },
    {
      "id": 29,
      "start": 140.1199951171875,
      "end": 143.32000732421875,
      "text": " And of course, he will say, as we'll study through the passage this evening in verse"
    },
    {
      "id": 30,
      "start": 143.32000732421875,
      "end": 146.5800018310547,
      "text": " number 15, but whom say ye that I am?"
    },
    {
      "id": 31,
      "start": 146.5800018310547,
      "end": 153.32000732421875,
      "text": " And we find the significance of this question is this, if you get it wrong about Jesus and"
    },
    {
      "id": 32,
      "start": 153.32000732421875,
      "end": 156.24000549316406,
      "text": " who he is, you're in grave danger."
    },
    {
      "id": 33,
      "start": 156.24000549316406,
      "end": 162.0399932861328,
      "text": " And we'll find this evening that just as we look at the passage of scripture that is recorded"
    },
    {
      "id": 34,
      "start": 162.0399932861328,
      "end": 170.16000366210938,
      "text": " for us, we will find that there still exists a great amount of confusion today about who"
    },
    {
      "id": 35,
      "start": 170.16000366210938,
      "end": 172.05999755859375,
      "text": " is Jesus."
    },
    {
      "id": 36,
      "start": 172.05999755859375,
      "end": 173.36000061035156,
      "text": " Who is he?"
    },
    {
      "id": 37,
      "start": 173.36000061035156,
      "end": 179.89999389648438,
      "text": " And we, of course, as followers of Jesus Christ, we need to know ourselves who he is, but it's"
    },
    {
      "id": 38,
      "start": 179.89999389648438,
      "end": 186.9199981689453,
      "text": " also imperative that we are able to communicate with those that we come into contact with"
    },
    {
      "id": 39,
      "start": 186.9199981689453,
      "end": 188.67999267578125,
      "text": " who he is."
    },
    {
      "id": 40,
      "start": 188.67999267578125,
      "end": 189.8000030517578,
      "text": " We preach Christ."
    },
    {
      "id": 41,
      "start": 189.8000030517578,
      "end": 194.55999755859375,
      "text": " That's what Paul says, he's writing to the believers in Corinth, and of course, we understand"
    },
    {
      "id": 42,
      "start": 194.55999755859375,
      "end": 198.13999938964844,
      "text": " as we read throughout the scriptures that we've been given the great commission that"
    },
    {
      "id": 43,
      "start": 198.13999938964844,
      "end": 203.60000610351562,
      "text": " we're to go and preach the gospel to every creature, and you understand today that there"
    },
    {
      "id": 44,
      "start": 203.60000610351562,
      "end": 210.47999572753906,
      "text": " is a great percentage of our population that do not know the Jesus of the Bible."
    },
    {
      "id": 45,
      "start": 210.47999572753906,
      "end": 215.39999389648438,
      "text": " They may know some things about Jesus, they may have been told some things about who Jesus"
    },
    {
      "id": 46,
      "start": 215.39999389648438,
      "end": 222.52000427246094,
      "text": " is, some, I believe this evening with all of my heart, that some in our community, in"
    },
    {
      "id": 47,
      "start": 222.52000427246094,
      "end": 227.47999572753906,
      "text": " our world, they know Jesus as nothing more than a swear word."
    },
    {
      "id": 48,
      "start": 227.47999572753906,
      "end": 229.6199951171875,
      "text": " They don't know who he is."
    },
    {
      "id": 49,
      "start": 229.6199951171875,
      "end": 235.9199981689453,
      "text": " And as his people, as his followers, it's imperative that we know who he is, but that"
    },
    {
      "id": 50,
      "start": 235.9199981689453,
      "end": 241.24000549316406,
      "text": " we are adequately equipped to be able to share that truth with those that we come in contact"
    },
    {
      "id": 51,
      "start": 241.24000549316406,
      "end": 242.24000549316406,
      "text": " with."
    },
    {
      "id": 52,
      "start": 242.24000549316406,
      "end": 245.67999267578125,
      "text": " And so, over the next several weeks, as we study the doctrine of Christ and we look at"
    },
    {
      "id": 53,
      "start": 245.67999267578125,
      "end": 250.1999969482422,
      "text": " the truth of God's word with regard to who Christ is, what are we doing?"
    },
    {
      "id": 54,
      "start": 250.1999969482422,
      "end": 254.52000427246094,
      "text": " We're trying to build up our faith, we're trying to get us to a place where we are sound"
    },
    {
      "id": 55,
      "start": 254.52000427246094,
      "end": 261.32000732421875,
      "text": " in doctrine, so that when we come in contact with those in our world that do not know Jesus,"
    },
    {
      "id": 56,
      "start": 261.32000732421875,
      "end": 264.0,
      "text": " that we are equipped to be able to preach Christ."
    },
    {
      "id": 57,
      "start": 264.0,
      "end": 270.55999755859375,
      "text": " It's interesting, today, I had a dental appointment this morning, and as I was there at the dentist,"
    },
    {
      "id": 58,
      "start": 270.55999755859375,
      "end": 276.67999267578125,
      "text": " and I had never actually had this dentist do any work on me before, my dentist was tied"
    },
    {
      "id": 59,
      "start": 276.67999267578125,
      "end": 279.8800048828125,
      "text": " up and his partner was able to see me this morning."
    },
    {
      "id": 60,
      "start": 279.8800048828125,
      "end": 283.8800048828125,
      "text": " In any case, I told him that I was a pastor, we were just kind of chit-chatting in the"
    },
    {
      "id": 61,
      "start": 283.8800048828125,
      "end": 289.7200012207031,
      "text": " beginning and what have you, and after they kind of gave me the shots and let the numbness"
    },
    {
      "id": 62,
      "start": 289.7200012207031,
      "end": 294.239990234375,
      "text": " kind of set in, he said, so give me a preview of your message this evening."
    },
    {
      "id": 63,
      "start": 294.239990234375,
      "end": 296.239990234375,
      "text": " What a great opportunity."
    },
    {
      "id": 64,
      "start": 296.239990234375,
      "end": 301.9200134277344,
      "text": " And I said, here's the message I'll be preaching tonight, whom do men say that I am?"
    },
    {
      "id": 65,
      "start": 301.9200134277344,
      "end": 306.9200134277344,
      "text": " And I said, Jesus was speaking to his disciples, and he asked them that question, and they"
    },
    {
      "id": 66,
      "start": 306.9200134277344,
      "end": 307.9200134277344,
      "text": " responded."
    },
    {
      "id": 67,
      "start": 307.9200134277344,
      "end": 313.20001220703125,
      "text": " The disciples say, well, some say this, some say that, and I began to share with him the"
    },
    {
      "id": 68,
      "start": 313.20001220703125,
      "end": 316.8800048828125,
      "text": " truth of who Jesus is, a unique opportunity."
    },
    {
      "id": 69,
      "start": 316.8800048828125,
      "end": 323.3999938964844,
      "text": " And I was thankful for the divine appointment that God had given me that this evening the"
    },
    {
      "id": 70,
      "start": 323.3999938964844,
      "end": 327.760009765625,
      "text": " subject matter of our message was whom do men say that I am?"
    },
    {
      "id": 71,
      "start": 327.760009765625,
      "end": 332.2799987792969,
      "text": " And he says, give me a preview of the message, what a great opportunity."
    },
    {
      "id": 72,
      "start": 332.2799987792969,
      "end": 337.20001220703125,
      "text": " And this evening, we'll find that as we look at this passage and look at the sister passages"
    },
    {
      "id": 73,
      "start": 337.20001220703125,
      "end": 341.79998779296875,
      "text": " of Mark and Luke, we'll find the significance of this truth."
    },
    {
      "id": 74,
      "start": 341.79998779296875,
      "end": 347.0400085449219,
      "text": " So the title, if you're taking notes, whom do men say that I am?"
    },
    {
      "id": 75,
      "start": 347.0400085449219,
      "end": 348.79998779296875,
      "text": " Whom do men say that I am?"
    },
    {
      "id": 76,
      "start": 348.79998779296875,
      "end": 354.0799865722656,
      "text": " Notice with me, if you're taking notes, number one, the confusion of the people."
    },
    {
      "id": 77,
      "start": 354.0799865722656,
      "end": 355.8399963378906,
      "text": " The confusion of the people."
    },
    {
      "id": 78,
      "start": 355.8399963378906,
      "end": 360.6400146484375,
      "text": " We find that Jesus is speaking to his disciples directly in verse number 13."
    },
    {
      "id": 79,
      "start": 360.6400146484375,
      "end": 363.9200134277344,
      "text": " And he says to them, whom do men say that I, the Son of Man am?"
    },
    {
      "id": 80,
      "start": 363.9200134277344,
      "end": 369.6000061035156,
      "text": " And they said, the disciples provide an answer to the Lord Jesus Christ in verse number 14."
    },
    {
      "id": 81,
      "start": 369.6000061035156,
      "end": 373.760009765625,
      "text": " And notice, there are really four different aspects that are given here."
    },
    {
      "id": 82,
      "start": 373.760009765625,
      "end": 379.0799865722656,
      "text": " It says this, some say that thou art John the Baptist."
    },
    {
      "id": 83,
      "start": 379.0799865722656,
      "end": 383.8399963378906,
      "text": " So there was a group of people, there was a contingency of those that they had come"
    },
    {
      "id": 84,
      "start": 383.8399963378906,
      "end": 390.79998779296875,
      "text": " in contact with that the disciples were aware of what their understanding of who Jesus was."
    },
    {
      "id": 85,
      "start": 390.79998779296875,
      "end": 392.760009765625,
      "text": " Because listen, Jesus was well known."
    },
    {
      "id": 86,
      "start": 392.760009765625,
      "end": 393.760009765625,
      "text": " There were many people."
    },
    {
      "id": 87,
      "start": 393.760009765625,
      "end": 398.3999938964844,
      "text": " You find that as you study through the scriptures, as Jesus would enter into a community, as"
    },
    {
      "id": 88,
      "start": 398.3999938964844,
      "end": 401.8399963378906,
      "text": " he would go and he'd teach, there were throngs of people."
    },
    {
      "id": 89,
      "start": 401.8399963378906,
      "end": 406.5199890136719,
      "text": " They were aware of Jesus, but the question is, who is he?"
    },
    {
      "id": 90,
      "start": 406.5199890136719,
      "end": 409.0,
      "text": " Who is this Jesus?"
    },
    {
      "id": 91,
      "start": 409.0,
      "end": 410.3800048828125,
      "text": " Who is this one?"
    },
    {
      "id": 92,
      "start": 410.3800048828125,
      "end": 414.44000244140625,
      "text": " And we find that Jesus says, whom do men say that I, the Son of Man am?"
    },
    {
      "id": 93,
      "start": 414.44000244140625,
      "end": 418.760009765625,
      "text": " And they said, well, there's some that say you're John the Baptist."
    },
    {
      "id": 94,
      "start": 418.760009765625,
      "end": 424.44000244140625,
      "text": " There's another group, notice in verse number 14, some, Elias or Elijah."
    },
    {
      "id": 95,
      "start": 424.44000244140625,
      "end": 429.32000732421875,
      "text": " We find that it says, and others, Jeremias or Jeremiah."
    },
    {
      "id": 96,
      "start": 429.32000732421875,
      "end": 434.67999267578125,
      "text": " And then there's this last statement, or one of the prophets."
    },
    {
      "id": 97,
      "start": 434.67999267578125,
      "end": 440.6400146484375,
      "text": " And so there are people that have come to this conclusion of who Jesus is."
    },
    {
      "id": 98,
      "start": 440.6400146484375,
      "end": 441.67999267578125,
      "text": " And there's confusion."
    },
    {
      "id": 99,
      "start": 441.67999267578125,
      "end": 444.3599853515625,
      "text": " We see the confusion of the people."
    },
    {
      "id": 100,
      "start": 444.3599853515625,
      "end": 445.67999267578125,
      "text": " Is Jesus John the Baptist?"
    },
    {
      "id": 101,
      "start": 445.67999267578125,
      "end": 446.9200134277344,
      "text": " No, he's not."
    },
    {
      "id": 102,
      "start": 446.9200134277344,
      "end": 447.9200134277344,
      "text": " Is Jesus Elijah?"
    },
    {
      "id": 103,
      "start": 447.9200134277344,
      "end": 448.9200134277344,
      "text": " No."
    },
    {
      "id": 104,
      "start": 448.9200134277344,
      "end": 449.9200134277344,
      "text": " Is he Jeremiah?"
    },
    {
      "id": 105,
      "start": 449.9200134277344,
      "end": 450.9200134277344,
      "text": " No."
    },
    {
      "id": 106,
      "start": 450.9200134277344,
      "end": 451.9200134277344,
      "text": " Is he one of the prophets?"
    },
    {
      "id": 107,
      "start": 451.9200134277344,
      "end": 452.9200134277344,
      "text": " No."
    },
    {
      "id": 108,
      "start": 452.9200134277344,
      "end": 453.9200134277344,
      "text": " He is God in flesh."
    },
    {
      "id": 109,
      "start": 453.9200134277344,
      "end": 458.20001220703125,
      "text": " But there were some people that had, it wasn't like, well, they don't know who you are."
    },
    {
      "id": 110,
      "start": 458.20001220703125,
      "end": 459.20001220703125,
      "text": " They don't know."
    },
    {
      "id": 111,
      "start": 459.20001220703125,
      "end": 460.20001220703125,
      "text": " They concluded wrong."
    },
    {
      "id": 112,
      "start": 460.20001220703125,
      "end": 463.2799987792969,
      "text": " They were confused as to who Jesus was."
    },
    {
      "id": 113,
      "start": 463.2799987792969,
      "end": 467.9599914550781,
      "text": " And they said, John the Baptist, Elijah, Jeremiah, one of the prophets."
    },
    {
      "id": 114,
      "start": 467.9599914550781,
      "end": 473.0400085449219,
      "text": " And it's interesting, for as we look at this passage of Scripture and see the way in which"
    },
    {
      "id": 115,
      "start": 473.0400085449219,
      "end": 478.20001220703125,
      "text": " the disciples answered Jesus, I want you to keep this in mind and turn to Mark chapter"
    },
    {
      "id": 116,
      "start": 478.20001220703125,
      "end": 480.260009765625,
      "text": " number six, if you will."
    },
    {
      "id": 117,
      "start": 480.260009765625,
      "end": 485.79998779296875,
      "text": " And this is not the sister passage that deals with the same context of what we're dealing"
    },
    {
      "id": 118,
      "start": 485.79998779296875,
      "end": 486.79998779296875,
      "text": " with with this question."
    },
    {
      "id": 119,
      "start": 486.79998779296875,
      "end": 488.239990234375,
      "text": " We'll look at that in just a moment."
    },
    {
      "id": 120,
      "start": 488.239990234375,
      "end": 494.3999938964844,
      "text": " But in Mark chapter number six, I want you to see this reference with regard to Herod."
    },
    {
      "id": 121,
      "start": 494.3999938964844,
      "end": 501.1199951171875,
      "text": " In Mark six and verse number 14, the Bible says this, and King Herod heard of him."
    },
    {
      "id": 122,
      "start": 501.1199951171875,
      "end": 503.8800048828125,
      "text": " The him is Jesus."
    },
    {
      "id": 123,
      "start": 503.8800048828125,
      "end": 506.4800109863281,
      "text": " It says, for his name was spread abroad."
    },
    {
      "id": 124,
      "start": 506.4800109863281,
      "end": 508.6199951171875,
      "text": " I just told you that we understand."
    },
    {
      "id": 125,
      "start": 508.6199951171875,
      "end": 513.6599731445312,
      "text": " You study through the Gospels and you'll see that there were many that knew about Jesus."
    },
    {
      "id": 126,
      "start": 513.6599731445312,
      "end": 521.9000244140625,
      "text": " And he said, Herod said that John the Baptist was risen from the dead."
    },
    {
      "id": 127,
      "start": 521.9000244140625,
      "end": 527.1799926757812,
      "text": " And therefore mighty works do show forth themselves in him."
    },
    {
      "id": 128,
      "start": 527.1799926757812,
      "end": 533.6599731445312,
      "text": " Others said that it is a prophet or as one of the prophets."
    },
    {
      "id": 129,
      "start": 533.6599731445312,
      "end": 538.780029296875,
      "text": " But when Herod heard thereof, he said, it is John whom I beheaded."
    },
    {
      "id": 130,
      "start": 538.780029296875,
      "end": 541.1400146484375,
      "text": " He is risen from the dead."
    },
    {
      "id": 131,
      "start": 541.1400146484375,
      "end": 542.1400146484375,
      "text": " Herod was wrong."
    },
    {
      "id": 132,
      "start": 542.7000122070312,
      "end": 544.4600219726562,
      "text": " He was wrong about who Jesus was."
    },
    {
      "id": 133,
      "start": 544.4600219726562,
      "end": 547.9400024414062,
      "text": " Jesus wasn't John the Baptist resurrected."
    },
    {
      "id": 134,
      "start": 547.9400024414062,
      "end": 550.8200073242188,
      "text": " And he is, Jesus is God in flesh."
    },
    {
      "id": 135,
      "start": 550.8200073242188,
      "end": 554.8400268554688,
      "text": " But we find that as the disciples would give the answer that we are reading in Matthew"
    },
    {
      "id": 136,
      "start": 554.8400268554688,
      "end": 561.3800048828125,
      "text": " chapter number 16, that there's record of Herod having this idea that Jesus is John"
    },
    {
      "id": 137,
      "start": 561.3800048828125,
      "end": 565.9000244140625,
      "text": " the Baptist, that there were others that said, no, we hear what you're saying, but we don't"
    },
    {
      "id": 138,
      "start": 565.9000244140625,
      "end": 567.2000122070312,
      "text": " think he's John the Baptist."
    },
    {
      "id": 139,
      "start": 567.2000122070312,
      "end": 571.5800170898438,
      "text": " We think he's Elijah or he's one of the prophets or he's like a prophet."
    },
    {
      "id": 140,
      "start": 571.5800170898438,
      "end": 576.4600219726562,
      "text": " Notice a few passages over in Mark chapter number nine, excuse me, Mark chapter number"
    },
    {
      "id": 141,
      "start": 576.4600219726562,
      "end": 583.02001953125,
      "text": " eight, the sister passage for what we're studying there in Matthew's gospel, Jesus is speaking"
    },
    {
      "id": 142,
      "start": 583.02001953125,
      "end": 587.9400024414062,
      "text": " in verse number 27, it says this, and Jesus went out and his disciples into the towns"
    },
    {
      "id": 143,
      "start": 587.9400024414062,
      "end": 588.9400024414062,
      "text": " of Caesarea Philippi."
    },
    {
      "id": 144,
      "start": 588.9400024414062,
      "end": 595.5,
      "text": " And by the way, he asked his disciples saying unto them, whom do men say that I am?"
    },
    {
      "id": 145,
      "start": 595.5,
      "end": 598.5,
      "text": " And we see the same discussion that takes place."
    },
    {
      "id": 146,
      "start": 598.5,
      "end": 600.2999877929688,
      "text": " He'll then ask them in verse number 29."
    },
    {
      "id": 0,
      "start": 600.2999877929688,
      "end": 604.8399877548218,
      "text": " but whom say ye that I am?\" And as we look here, it's interesting, for the Bible"
    },
    {
      "id": 1,
      "start": 604.8399877548218,
      "end": 608.8599882125854,
      "text": " says that as they were going, listen, they were... Jesus went out, his disciples"
    },
    {
      "id": 2,
      "start": 608.8599882125854,
      "end": 614.4199876785278,
      "text": " into the towns of Caesarea Philippi, and by the way, he asked his disciples, saying"
    },
    {
      "id": 3,
      "start": 614.4199876785278,
      "end": 618.4199886322021,
      "text": " unto them, whom do men say that I am? Notice over in the book of Luke, in Luke"
    },
    {
      "id": 4,
      "start": 618.4199886322021,
      "end": 625.1399879455566,
      "text": " chapter 9, and I want you to notice here the passage and the"
    },
    {
      "id": 5,
      "start": 625.1399879455566,
      "end": 631.0999870300293,
      "text": " insight that we're given with regard to this again, what's taking place. It says"
    },
    {
      "id": 6,
      "start": 631.0999870300293,
      "end": 635.179988861084,
      "text": " in verse number 18 of Luke chapter number 9, and it came to pass as he was"
    },
    {
      "id": 7,
      "start": 635.179988861084,
      "end": 638.9599876403809,
      "text": " alone praying, his disciples were with him, and he asked them, saying, whom say"
    },
    {
      "id": 8,
      "start": 638.9599876403809,
      "end": 643.9799880981445,
      "text": " the people that I am? They answering said, John the Baptist, but some say Elias, and"
    },
    {
      "id": 9,
      "start": 643.9799880981445,
      "end": 647.7399864196777,
      "text": " others say that one of the old prophets is risen again, and then of course he"
    },
    {
      "id": 10,
      "start": 647.7399864196777,
      "end": 652.4999885559082,
      "text": " says, but whom say ye that I am? And so Matthew, Mark, and Luke are all recording"
    },
    {
      "id": 11,
      "start": 652.4999885559082,
      "end": 659.4999885559082,
      "text": " this absolute significant question. We're dealing with, as we begin studying"
    },
    {
      "id": 12,
      "start": 659.4999885559082,
      "end": 662.9799880981445,
      "text": " and looking at this question that is asked, we're dealing with the confusion of the"
    },
    {
      "id": 13,
      "start": 662.9799880981445,
      "end": 667.9799880981445,
      "text": " people, and I would ask this, why? Why is there confusion about who Jesus is? I"
    },
    {
      "id": 14,
      "start": 667.9799880981445,
      "end": 673.1999893188477,
      "text": " believe there's a very simple answer as to the source of the confusion, and it's"
    },
    {
      "id": 15,
      "start": 673.1999893188477,
      "end": 677.0199890136719,
      "text": " found in the truth that Paul would give to us in 2nd Corinthians chapter"
    },
    {
      "id": 16,
      "start": 677.0199890136719,
      "end": 681.1399841308594,
      "text": " number 4. Hold your place there in Matthew chapter 16, and turn to the book"
    },
    {
      "id": 17,
      "start": 681.1399841308594,
      "end": 686.0999908447266,
      "text": " of 2nd Corinthians, if you will, in chapter number 4, and as we look at this"
    },
    {
      "id": 18,
      "start": 686.0999908447266,
      "end": 690.8199844360352,
      "text": " passage and look at this truth that Paul is sharing with the church in Corinth"
    },
    {
      "id": 19,
      "start": 690.8199844360352,
      "end": 695.1399841308594,
      "text": " and with these believers, remember they've already been instructed with"
    },
    {
      "id": 20,
      "start": 695.1399841308594,
      "end": 699.1799850463867,
      "text": " regard to a number of things, and about the importance, the significance of"
    },
    {
      "id": 21,
      "start": 699.1799850463867,
      "end": 705.1399841308594,
      "text": " preaching the gospel in the first letter that's titled 1st Corinthians, but we"
    },
    {
      "id": 22,
      "start": 705.1399841308594,
      "end": 708.9799880981445,
      "text": " notice here in 2nd Corinthians chapter number 4 in verse number 3, it says, but"
    },
    {
      "id": 23,
      "start": 708.9799880981445,
      "end": 714.739990234375,
      "text": " if our gospel be hid, it is hid to them that are lost. Now notice what the Bible"
    },
    {
      "id": 24,
      "start": 714.739990234375,
      "end": 721.6999893188477,
      "text": " says in verse number 4, in whom the God of this world hath blinded the minds of"
    },
    {
      "id": 25,
      "start": 721.6999893188477,
      "end": 726.8599853515625,
      "text": " them which believe not, lest the light of the glorious gospel of Christ, who is"
    },
    {
      "id": 26,
      "start": 726.8599853515625,
      "end": 732.0999908447266,
      "text": " the image of God, should shine unto them. For we preach not ourselves, but Christ"
    },
    {
      "id": 27,
      "start": 732.0999908447266,
      "end": 737.4599914550781,
      "text": " Jesus the Lord, and ourselves your servants for Jesus's sake. You notice in"
    },
    {
      "id": 28,
      "start": 737.4599914550781,
      "end": 742.0599822998047,
      "text": " verse number 4, the Bible speaks about the God of this world, that's Satan, and"
    },
    {
      "id": 29,
      "start": 742.0599822998047,
      "end": 747.1799926757812,
      "text": " the work that he's done to blind the minds of them which believe not. You"
    },
    {
      "id": 30,
      "start": 747.1799926757812,
      "end": 753.8199920654297,
      "text": " understand this evening that Satan does not want people to know who Jesus is. He"
    },
    {
      "id": 31,
      "start": 753.8199920654297,
      "end": 758.7199859619141,
      "text": " doesn't want people to know that Jesus is God, that he is the Messiah, that he is"
    },
    {
      "id": 32,
      "start": 758.7199859619141,
      "end": 762.4199829101562,
      "text": " the only way to heaven. He doesn't want people to know that, and so"
    },
    {
      "id": 33,
      "start": 762.4199829101562,
      "end": 766.5799865722656,
      "text": " we find that there's this confusion. Listen, Satan is perfectly fine with"
    },
    {
      "id": 34,
      "start": 766.5799865722656,
      "end": 771.739990234375,
      "text": " somebody believing in a historical Jesus as being a prophet, or being John"
    },
    {
      "id": 35,
      "start": 771.739990234375,
      "end": 776.8199920654297,
      "text": " the Baptist, risen again, or being you name it. Satan's perfectly fine with that,"
    },
    {
      "id": 36,
      "start": 776.8199920654297,
      "end": 782.2999877929688,
      "text": " because if you get it wrong on Jesus, you're in grave danger, and we find that"
    },
    {
      "id": 37,
      "start": 782.2999877929688,
      "end": 787.4199829101562,
      "text": " the God of this world, Satan himself, has blinded the minds of them which"
    },
    {
      "id": 38,
      "start": 787.4199829101562,
      "end": 791.6599884033203,
      "text": " believe not, lest the light of the glorious gospel of Christ, who is the"
    },
    {
      "id": 39,
      "start": 791.6599884033203,
      "end": 797.1399841308594,
      "text": " image of God, should shine unto them. And so we understand this evening the source"
    },
    {
      "id": 40,
      "start": 797.1399841308594,
      "end": 803.3799896240234,
      "text": " of this confusion, why it was that these people were confused. Of course, Satan is"
    },
    {
      "id": 41,
      "start": 803.3799896240234,
      "end": 808.5799865722656,
      "text": " working. Remember, there's this spiritual battle that is constantly raging, and"
    },
    {
      "id": 42,
      "start": 808.5799865722656,
      "end": 815.6999816894531,
      "text": " Satan does not desire for anyone to know who Jesus really is. We find that the"
    },
    {
      "id": 43,
      "start": 815.6999816894531,
      "end": 820.739990234375,
      "text": " confusion that is evidenced here in Matthew chapter number 16 in each of the"
    },
    {
      "id": 44,
      "start": 820.739990234375,
      "end": 826.739990234375,
      "text": " Gospels that record this discussion in Matthew, Mark, and Luke, the confusion"
    },
    {
      "id": 45,
      "start": 826.739990234375,
      "end": 830.3399810791016,
      "text": " that is obvious, that is evidenced through the answer that the disciples"
    },
    {
      "id": 46,
      "start": 830.3399810791016,
      "end": 834.8999938964844,
      "text": " give—well, some say John the Baptist, some say Elijah, some Jeremiah, some say one of"
    },
    {
      "id": 47,
      "start": 834.8999938964844,
      "end": 841.1399841308594,
      "text": " the prophets—in that obvious confusion, the reality is that that confusion still"
    },
    {
      "id": 48,
      "start": 841.1399841308594,
      "end": 848.4999847412109,
      "text": " exists today. It continues to exist today. You can talk to various people that you"
    },
    {
      "id": 49,
      "start": 848.4999847412109,
      "end": 853.4599914550781,
      "text": " come into contact with, and you can ask them who Jesus is. Whom do men say that I"
    },
    {
      "id": 50,
      "start": 853.4599914550781,
      "end": 857.8599853515625,
      "text": " am? Jesus asks his disciples that, but you just go ahead and start asking some"
    },
    {
      "id": 51,
      "start": 857.8599853515625,
      "end": 863.5,
      "text": " people, who is Jesus? Who is he? You know, there are some cults that teach some"
    },
    {
      "id": 52,
      "start": 863.5,
      "end": 869.97998046875,
      "text": " really blasphemous things with regard to who Jesus Christ is. There are some world"
    },
    {
      "id": 53,
      "start": 869.97998046875,
      "end": 874.97998046875,
      "text": " religions that teach some blasphemous things with regard to who Jesus Christ"
    },
    {
      "id": 54,
      "start": 874.97998046875,
      "end": 879.8999938964844,
      "text": " is. They're perfectly fine with saying that he existed as a man, that he was a"
    },
    {
      "id": 55,
      "start": 879.8999938964844,
      "end": 883.9400024414062,
      "text": " prophet, he was a good man, he did some good things. They're okay with that. Why?"
    },
    {
      "id": 56,
      "start": 883.9400024414062,
      "end": 889.0999755859375,
      "text": " Because he's not the Savior of the world. Because he's not God in flesh. And we"
    },
    {
      "id": 57,
      "start": 889.0999755859375,
      "end": 894.0599975585938,
      "text": " find that the battle that was raging during the life and ministry of the Lord"
    },
    {
      "id": 58,
      "start": 894.0599975585938,
      "end": 899.739990234375,
      "text": " Jesus Christ with regard to his person and who he is continues to exist today."
    },
    {
      "id": 59,
      "start": 899.739990234375,
      "end": 904.8599853515625,
      "text": " There's great confusion. It was interesting as I was speaking with the"
    },
    {
      "id": 60,
      "start": 904.8599853515625,
      "end": 908.4199829101562,
      "text": " dentist this morning, and I was sharing things with him, he began to share with"
    },
    {
      "id": 61,
      "start": 908.4199829101562,
      "end": 912.5799865722656,
      "text": " me where he was from and some things that he experienced as a young person, so"
    },
    {
      "id": 62,
      "start": 912.5799865722656,
      "end": 918.5399780273438,
      "text": " on and so forth, and he identified with a certain denomination. And so he had some"
    },
    {
      "id": 63,
      "start": 918.5399780273438,
      "end": 923.4599914550781,
      "text": " knowledge of some of the scriptural things. And as we were speaking, he"
    },
    {
      "id": 64,
      "start": 923.4599914550781,
      "end": 927.6599731445312,
      "text": " shared with me how that in his country where he was from, and he grew up there"
    },
    {
      "id": 65,
      "start": 927.6599731445312,
      "end": 931.6599731445312,
      "text": " and he was there until he was 18, that it was very common to be able to talk openly"
    },
    {
      "id": 66,
      "start": 931.7799987792969,
      "end": 937.1799926757812,
      "text": " about your beliefs and about your religion, quote-unquote, even amongst those"
    },
    {
      "id": 67,
      "start": 937.1799926757812,
      "end": 941.5799865722656,
      "text": " that differed in their philosophies, their ideologies, it was a very common"
    },
    {
      "id": 68,
      "start": 941.5799865722656,
      "end": 946.4599914550781,
      "text": " thing. And he said, I noticed when I came to America that increasingly over the"
    },
    {
      "id": 69,
      "start": 946.4599914550781,
      "end": 949.2599792480469,
      "text": " years that I've been here, and he's been here for longer than he was in his home"
    },
    {
      "id": 70,
      "start": 949.2599792480469,
      "end": 955.5,
      "text": " country, that it's not commonly accepted to be able to just talk freely about"
    },
    {
      "id": 71,
      "start": 955.5,
      "end": 961.3399963378906,
      "text": " Jesus. It was very insightful to hear him say that because the reality is that"
    },
    {
      "id": 72,
      "start": 961.3399963378906,
      "end": 964.7799987792969,
      "text": " there are some people—I remember hearing when I was a child that there"
    },
    {
      "id": 73,
      "start": 964.7799987792969,
      "end": 969.5,
      "text": " were two things that you didn't talk about amongst family, religion and"
    },
    {
      "id": 74,
      "start": 969.5,
      "end": 975.3199768066406,
      "text": " politics. I heard that various times as I was growing up. You would come into the"
    },
    {
      "id": 75,
      "start": 975.3199768066406,
      "end": 979.4599914550781,
      "text": " group of a family reunion, if you will, and there were two subject matters in"
    },
    {
      "id": 76,
      "start": 979.4599914550781,
      "end": 984.97998046875,
      "text": " which they often said those were off-limits. Well, one of the grave"
    },
    {
      "id": 77,
      "start": 984.97998046875,
      "end": 989.5799865722656,
      "text": " results of those topics not being discussed is that there's a lack of"
    },
    {
      "id": 78,
      "start": 989.8199768066406,
      "end": 994.2200012207031,
      "text": " knowledge about the truth of who Jesus is. Why? Because there were some people"
    },
    {
      "id": 79,
      "start": 994.2200012207031,
      "end": 998.5,
      "text": " that knew who he is, they know who he is, but they don't talk about it because"
    },
    {
      "id": 80,
      "start": 998.5,
      "end": 1003.1399841308594,
      "text": " they don't feel like it's commonly accepted, socially acceptable to talk"
    },
    {
      "id": 81,
      "start": 1003.1399841308594,
      "end": 1007.8599853515625,
      "text": " about who Jesus is. But you understand that as God's people, we've been given a"
    },
    {
      "id": 82,
      "start": 1007.8599853515625,
      "end": 1015.2599792480469,
      "text": " command. We've been instructed to be his representatives, to be his ambassadors, to"
    },
    {
      "id": 83,
      "start": 1015.2599792480469,
      "end": 1021.4599914550781,
      "text": " go forth and to speak his word with boldness, and that's our responsibility."
    },
    {
      "id": 84,
      "start": 1021.4599914550781,
      "end": 1026.2999877929688,
      "text": " And so we find that the confusion that existed during the life and ministry of"
    },
    {
      "id": 85,
      "start": 1026.2999877929688,
      "end": 1032.4199829101562,
      "text": " the Lord Jesus Christ nearly 2,000 years ago continues to exist to this very day."
    },
    {
      "id": 86,
      "start": 1032.4199829101562,
      "end": 1038.2599792480469,
      "text": " Now, honestly, I've not met anyone that said that he's John the Baptist. The"
    },
    {
      "id": 87,
      "start": 1038.2599792480469,
      "end": 1043.5,
      "text": " confusion is different as to who Jesus is, but I would submit to you that"
    },
    {
      "id": 88,
      "start": 1043.5399780273438,
      "end": 1049.0199890136719,
      "text": " there's still confusion, a great amount of confusion. And we understand that"
    },
    {
      "id": 89,
      "start": 1049.0199890136719,
      "end": 1053.6999816894531,
      "text": " they're confused because Satan has blinded their minds, and Satan is"
    },
    {
      "id": 90,
      "start": 1053.6999816894531,
      "end": 1060.8599853515625,
      "text": " perfectly fine with groups of people, world religions, cults, others, just"
    },
    {
      "id": 91,
      "start": 1060.8599853515625,
      "end": 1069.2599792480469,
      "text": " believing something short of who Jesus really is. We find not only the confusion"
    },
    {
      "id": 92,
      "start": 1069.2599792480469,
      "end": 1073.2999877929688,
      "text": " of the people, but I want you to notice with me as we go back to Matthew 16, the"
    },
    {
      "id": 93,
      "start": 1073.2999877929688,
      "end": 1078.8599853515625,
      "text": " confidence of Peter, the confidence of Peter. It's interesting in verse number"
    },
    {
      "id": 94,
      "start": 1078.8599853515625,
      "end": 1085.1399841308594,
      "text": " 15 that Jesus, after he receives the answer that is provided from these"
    },
    {
      "id": 95,
      "start": 1085.1399841308594,
      "end": 1092.5,
      "text": " disciples, and it is interesting to me that the record that is given to us in"
    },
    {
      "id": 96,
      "start": 1092.5,
      "end": 1098.2599792480469,
      "text": " verse number 14, and they said, that's plural, correct? And Jesus is speaking to"
    },
    {
      "id": 97,
      "start": 1098.2599792480469,
      "end": 1102.97998046875,
      "text": " his disciples in verse number 13. He asked his disciples, again plural, whom"
    },
    {
      "id": 98,
      "start": 1102.97998046875,
      "end": 1107.8999938964844,
      "text": " do men say that I, the Son of Man, am? And they said, so there was more than one"
    },
    {
      "id": 99,
      "start": 1107.8999938964844,
      "end": 1113.739990234375,
      "text": " disciple that responded, that answered Jesus. I almost, in my mind's eye, imagine"
    },
    {
      "id": 100,
      "start": 1113.739990234375,
      "end": 1119.0599975585938,
      "text": " it as they're there together, that one of the disciples, Andrew, James, John,"
    },
    {
      "id": 101,
      "start": 1119.0599975585938,
      "end": 1123.0199584960938,
      "text": " Peter, whomever, says, hey, some say that you're John the Baptist, and then one"
    },
    {
      "id": 102,
      "start": 1123.0199584960938,
      "end": 1129.9199829101562,
      "text": " pipes up and says, Jeremiah, and one says, right? Because they responded. But Jesus"
    },
    {
      "id": 103,
      "start": 1129.9599609375,
      "end": 1136.4400024414062,
      "text": " then says unto them, is them singular or plural? It's plural. He says to them, to"
    },
    {
      "id": 104,
      "start": 1136.4400024414062,
      "end": 1139.8800048828125,
      "text": " the disciples, the same group of people that he's speaking to in verse 13, but"
    },
    {
      "id": 105,
      "start": 1139.8800048828125,
      "end": 1151.2000122070312,
      "text": " whom say ye that I am? And Simon Peter answered. Simon Peter answered. He is the"
    },
    {
      "id": 106,
      "start": 1151.2000122070312,
      "end": 1156.9599609375,
      "text": " one, singular, the individual that provides an answer. I see the confidence"
    },
    {
      "id": 107,
      "start": 1157.0399780273438,
      "end": 1161.5199584960938,
      "text": " of Peter as I look at the passage of Scripture. In my mind's eye, again, as I"
    },
    {
      "id": 108,
      "start": 1161.5199584960938,
      "end": 1165.760009765625,
      "text": " would imagine them walking and ministering and Jesus asking the"
    },
    {
      "id": 109,
      "start": 1165.760009765625,
      "end": 1170.8399658203125,
      "text": " disciples and how they responded. And then, as he said, but whom do ye say that I am?"
    },
    {
      "id": 110,
      "start": 1170.8399658203125,
      "end": 1178.2000122070312,
      "text": " And I can, in my mind's eye, I can see Peter and I can hear Peter with"
    },
    {
      "id": 111,
      "start": 1178.2000122070312,
      "end": 1185.239990234375,
      "text": " boldness and with confidence. I don't see it as being a timid response. Have you ever"
    },
    {
      "id": 112,
      "start": 1185.239990234375,
      "end": 1189.3200073242188,
      "text": " asked somebody a question and in their response you understand that they're not"
    },
    {
      "id": 113,
      "start": 1189.3200073242188,
      "end": 1194.0800170898438,
      "text": " really sure that that answer was correct? You've ever had that situation? You ask"
    },
    {
      "id": 114,
      "start": 1194.0800170898438,
      "end": 1197.9199829101562,
      "text": " somebody and they kind of, you know, and you can just kind of tell they just"
    },
    {
      "id": 115,
      "start": 1197.9199829101562,
      "end": 1201.2799682617188,
      "text": " aren't real sure what they're talking about."
    },
    {
      "id": 0,
      "start": 1201.2799682617188,
      "end": 1206.5999684333801,
      "text": " But when you ask somebody a question and they are confident in their response, they're a"
    },
    {
      "id": 1,
      "start": 1206.5999684333801,
      "end": 1213.719967842102,
      "text": " matter of fact, you gain from their response, you gain a level of confidence as well."
    },
    {
      "id": 2,
      "start": 1213.719967842102,
      "end": 1217.9599685668945,
      "text": " And we find that Peter answered, again, I believe with confidence and boldness, and"
    },
    {
      "id": 3,
      "start": 1217.9599685668945,
      "end": 1225.7399673461914,
      "text": " he says, \"'Thou art the Christ, the Son of the living God.'\""
    },
    {
      "id": 4,
      "start": 1225.7399673461914,
      "end": 1228.3599681854248,
      "text": " What a great declaration."
    },
    {
      "id": 5,
      "start": 1228.3599681854248,
      "end": 1234.4799690246582,
      "text": " We find that the name, of course, Jesus, in verse number 13, when Jesus came into the"
    },
    {
      "id": 6,
      "start": 1234.4799690246582,
      "end": 1238.6799697875977,
      "text": " coast of Caesarea Philippi, we had studied about the names of God in the Old Testament."
    },
    {
      "id": 7,
      "start": 1238.6799697875977,
      "end": 1242.5599670410156,
      "text": " We will also, as we study the doctrine of Christ, we'll review several of the names"
    },
    {
      "id": 8,
      "start": 1242.5599670410156,
      "end": 1245.4799690246582,
      "text": " that are mentioned of Jesus here in the New Testament."
    },
    {
      "id": 9,
      "start": 1245.4799690246582,
      "end": 1250.8799667358398,
      "text": " But it is interesting that Jesus, the name that is mentioned in verse number 13, and"
    },
    {
      "id": 10,
      "start": 1250.8799667358398,
      "end": 1255.3599700927734,
      "text": " then in verse number 16, that he, Peter, says, \"'Thou art the Christ.'\""
    },
    {
      "id": 11,
      "start": 1255.3599700927734,
      "end": 1262.2399673461914,
      "text": " Now, as we understand the name Jesus, it means Jehovah is salvation, God incarnate."
    },
    {
      "id": 12,
      "start": 1262.2399673461914,
      "end": 1267.5199661254883,
      "text": " Remember, when the angel appeared to Mary with regard to the announcement of the birth"
    },
    {
      "id": 13,
      "start": 1267.5199661254883,
      "end": 1273.5399703979492,
      "text": " of Jesus, she was instructed that his name shall be called Jesus."
    },
    {
      "id": 14,
      "start": 1273.5399703979492,
      "end": 1276.9599685668945,
      "text": " Remember in verse 21 of Matthew 1, you don't need to turn there, I'll read it, \"'And she"
    },
    {
      "id": 15,
      "start": 1276.9599685668945,
      "end": 1280.5199661254883,
      "text": " shall bring forth a son, and thou shalt call his name Jesus.'\""
    },
    {
      "id": 16,
      "start": 1280.5199661254883,
      "end": 1281.5199661254883,
      "text": " Why?"
    },
    {
      "id": 17,
      "start": 1281.5199661254883,
      "end": 1284.7999649047852,
      "text": " \"'For he shall save his people from their sins.'\""
    },
    {
      "id": 18,
      "start": 1284.7999649047852,
      "end": 1288.199966430664,
      "text": " And so Jehovah is salvation, God incarnate."
    },
    {
      "id": 19,
      "start": 1288.199966430664,
      "end": 1293.479965209961,
      "text": " The name Christ, when Peter stands up and says, \"'Thou art the Christ, the Son of the"
    },
    {
      "id": 20,
      "start": 1293.479965209961,
      "end": 1301.1599655151367,
      "text": " living God,' the name Christ means the anointed, the Messiah, the Son of God, the promised"
    },
    {
      "id": 21,
      "start": 1301.1599655151367,
      "end": 1307.7599716186523,
      "text": " one, the one that all of those messianic prophecies that you study and you read about in the Old"
    },
    {
      "id": 22,
      "start": 1307.7599716186523,
      "end": 1311.9199676513672,
      "text": " Testament and how that they are properly fulfilled in the person of Jesus Christ."
    },
    {
      "id": 23,
      "start": 1312.5199661254883,
      "end": 1317.6799697875977,
      "text": " Peter stands with this boldness and this confidence and he says, \"'Thou art the Christ, the Son"
    },
    {
      "id": 24,
      "start": 1317.6799697875977,
      "end": 1319.8799667358398,
      "text": " of the living God.'\""
    },
    {
      "id": 25,
      "start": 1319.8799667358398,
      "end": 1326.7999649047852,
      "text": " It's interesting what is said in Jesus' response to Peter in verse number 17, \"'And Jesus answered"
    },
    {
      "id": 26,
      "start": 1326.7999649047852,
      "end": 1332.8799743652344,
      "text": " and said unto him, Blessed art thou, Simon Bar-Jonah, for flesh and blood hath not revealed"
    },
    {
      "id": 27,
      "start": 1332.8799743652344,
      "end": 1336.4399719238281,
      "text": " it unto thee, but my Father which is in heaven.'\""
    },
    {
      "id": 28,
      "start": 1336.4399719238281,
      "end": 1339.7999725341797,
      "text": " You understand that God wants us to know who Jesus is."
    },
    {
      "id": 29,
      "start": 1339.7999725341797,
      "end": 1343.3199615478516,
      "text": " When I say it that way, we understand that Jesus is God."
    },
    {
      "id": 30,
      "start": 1343.3199615478516,
      "end": 1347.6399688720703,
      "text": " But what I'm saying is that we understand that Jesus is revealing himself."
    },
    {
      "id": 31,
      "start": 1347.6399688720703,
      "end": 1353.9599609375,
      "text": " We understand that he manifested himself as we study the gospels and we look at all that's"
    },
    {
      "id": 32,
      "start": 1353.9599609375,
      "end": 1359.0399627685547,
      "text": " taking place in the incarnation and the deity of Christ and we study through the doctrine"
    },
    {
      "id": 33,
      "start": 1359.0399627685547,
      "end": 1367.5999755859375,
      "text": " of Christ how encouraged we will be as we understand the significance of who Jesus is."
    },
    {
      "id": 34,
      "start": 1367.5999755859375,
      "end": 1372.6399688720703,
      "text": " And we understand, listen, you're not going to get this from some place, some school somewhere,"
    },
    {
      "id": 35,
      "start": 1372.6399688720703,
      "end": 1373.6399688720703,
      "text": " some…"
    },
    {
      "id": 36,
      "start": 1373.6399688720703,
      "end": 1382.3599700927734,
      "text": " No, God is revealing to Peter here, he's referred to as Simon Bar-Jonah in verse 17, God has"
    },
    {
      "id": 37,
      "start": 1382.3599700927734,
      "end": 1388.3199615478516,
      "text": " revealed this truth to him as to who Jesus is."
    },
    {
      "id": 38,
      "start": 1388.3199615478516,
      "end": 1393.0799713134766,
      "text": " The question that I have this evening for myself and for each of us that are here is"
    },
    {
      "id": 39,
      "start": 1393.0799713134766,
      "end": 1394.6199645996094,
      "text": " this."
    },
    {
      "id": 40,
      "start": 1394.6199645996094,
      "end": 1399.9399719238281,
      "text": " We understand that there is confusion amongst the people, we understand that, but which"
    },
    {
      "id": 41,
      "start": 1399.9399719238281,
      "end": 1406.979965209961,
      "text": " one amongst us will have the confidence that Peter had to stand up and declare who Jesus"
    },
    {
      "id": 42,
      "start": 1406.979965209961,
      "end": 1407.979965209961,
      "text": " is?"
    },
    {
      "id": 43,
      "start": 1407.979965209961,
      "end": 1413.6599731445312,
      "text": " See, it's important, as I said by way of introduction, it's important for us as the followers of"
    },
    {
      "id": 44,
      "start": 1413.6599731445312,
      "end": 1422.739974975586,
      "text": " Christ to know who he is, that he is God, that he is the only Messiah."
    },
    {
      "id": 45,
      "start": 1422.739974975586,
      "end": 1428.5799713134766,
      "text": " It's important for us to understand who Jesus is for ourselves, but also so that we could"
    },
    {
      "id": 46,
      "start": 1428.5799713134766,
      "end": 1431.8199615478516,
      "text": " share that message with those that we come into contact with."
    },
    {
      "id": 47,
      "start": 1431.8199615478516,
      "end": 1432.8199615478516,
      "text": " Why?"
    },
    {
      "id": 48,
      "start": 1432.8199615478516,
      "end": 1435.8599700927734,
      "text": " Because the only hope for anyone is Jesus."
    },
    {
      "id": 49,
      "start": 1435.8599700927734,
      "end": 1442.7799682617188,
      "text": " Jesus is the hope for lost sinners, Jesus is the hope for our nation, and the true Jesus"
    },
    {
      "id": 50,
      "start": 1442.7799682617188,
      "end": 1444.7799682617188,
      "text": " of the Bible."
    },
    {
      "id": 51,
      "start": 1444.7799682617188,
      "end": 1450.0599670410156,
      "text": " Not some, well, he's a prophet, or he's a created angel, or he's a created being, he's"
    },
    {
      "id": 52,
      "start": 1450.0599670410156,
      "end": 1452.979965209961,
      "text": " a, no, those are not true."
    },
    {
      "id": 53,
      "start": 1452.979965209961,
      "end": 1453.979965209961,
      "text": " He's God."
    },
    {
      "id": 54,
      "start": 1453.979965209961,
      "end": 1460.8199768066406,
      "text": " And this evening, as we look at this passage of Scripture and begin our study of the doctrine"
    },
    {
      "id": 55,
      "start": 1460.8199768066406,
      "end": 1466.97998046875,
      "text": " of Christ, we are mindful of the fact that even as Jesus asked this question nearly 2,000"
    },
    {
      "id": 56,
      "start": 1466.97998046875,
      "end": 1473.4599609375,
      "text": " years ago, the question begs to be asked again this evening amongst those that we come into"
    },
    {
      "id": 57,
      "start": 1473.4599609375,
      "end": 1475.0199584960938,
      "text": " contact with."
    },
    {
      "id": 58,
      "start": 1475.7399597167969,
      "end": 1481.1399536132812,
      "text": " We tonight, if we were to sit down and give an answer, even as the disciples did, whom"
    },
    {
      "id": 59,
      "start": 1481.1399536132812,
      "end": 1483.6599731445312,
      "text": " do men say that I am?"
    },
    {
      "id": 60,
      "start": 1483.6599731445312,
      "end": 1485.3399658203125,
      "text": " You've come in contact with people."
    },
    {
      "id": 61,
      "start": 1485.3399658203125,
      "end": 1491.9399719238281,
      "text": " Who is it that those that you've spoken to, who is it that they say Jesus is?"
    },
    {
      "id": 62,
      "start": 1491.9399719238281,
      "end": 1494.7799682617188,
      "text": " Have you heard some say that he's a teacher?"
    },
    {
      "id": 63,
      "start": 1494.7799682617188,
      "end": 1496.4599609375,
      "text": " He's a prophet?"
    },
    {
      "id": 64,
      "start": 1496.4599609375,
      "end": 1497.4599609375,
      "text": " He's a good man?"
    },
    {
      "id": 65,
      "start": 1497.4599609375,
      "end": 1503.1799621582031,
      "text": " I mean, some try to deny the very existence of Jesus, but you find that it's very hard"
    },
    {
      "id": 66,
      "start": 1503.1799621582031,
      "end": 1510.1399536132812,
      "text": " to deny his existence, so what the enemy has sought to do is not deny the existence,"
    },
    {
      "id": 67,
      "start": 1510.1399536132812,
      "end": 1513.0599670410156,
      "text": " but change who he is."
    },
    {
      "id": 68,
      "start": 1513.0599670410156,
      "end": 1517.8999633789062,
      "text": " It's very difficult to say that Jesus didn't exist."
    },
    {
      "id": 69,
      "start": 1517.8999633789062,
      "end": 1524.2999572753906,
      "text": " There's record, abundance of record, that he existed."
    },
    {
      "id": 70,
      "start": 1524.2999572753906,
      "end": 1530.6999816894531,
      "text": " But what the enemy has done is not to deny his existence, but to alter who he is, to"
    },
    {
      "id": 71,
      "start": 1530.7399597167969,
      "end": 1534.7399597167969,
      "text": " cause confusion amongst the people of who he is."
    },
    {
      "id": 72,
      "start": 1534.7399597167969,
      "end": 1542.1399536132812,
      "text": " Because if man does not know who Jesus is, there's grave consequences."
    },
    {
      "id": 73,
      "start": 1542.1399536132812,
      "end": 1543.5399780273438,
      "text": " It's a grave danger."
    },
    {
      "id": 74,
      "start": 1543.5399780273438,
      "end": 1544.5399780273438,
      "text": " Why?"
    },
    {
      "id": 75,
      "start": 1544.5399780273438,
      "end": 1549.8999633789062,
      "text": " For there's no other name under heaven given among men whereby we must be saved."
    },
    {
      "id": 76,
      "start": 1549.8999633789062,
      "end": 1557.8999633789062,
      "text": " Listen, Jesus is not a way to heaven, he is the way to heaven."
    },
    {
      "id": 77,
      "start": 1557.9399719238281,
      "end": 1562.2599792480469,
      "text": " And we need to understand this evening that we're living in the midst of a people that"
    },
    {
      "id": 78,
      "start": 1562.2599792480469,
      "end": 1565.4599609375,
      "text": " are confused about who Jesus is."
    },
    {
      "id": 79,
      "start": 1565.4599609375,
      "end": 1570.7399597167969,
      "text": " And we've been given a unique opportunity to be his representatives, his ambassadors,"
    },
    {
      "id": 80,
      "start": 1570.7399597167969,
      "end": 1574.1799621582031,
      "text": " and we need to have the kind of confidence that Peter had."
    },
    {
      "id": 81,
      "start": 1574.1799621582031,
      "end": 1577.6999816894531,
      "text": " I understand he's answering Jesus, but I'm saying that we need to be able to have that"
    },
    {
      "id": 82,
      "start": 1577.6999816894531,
      "end": 1582.2599792480469,
      "text": " kind of boldness and confidence as we come into contact with people."
    },
    {
      "id": 83,
      "start": 1582.2599792480469,
      "end": 1586.3799743652344,
      "text": " You hear people talking about Jesus and they're talking about him in a wrong way, that we'd"
    },
    {
      "id": 84,
      "start": 1586.3799743652344,
      "end": 1591.2599792480469,
      "text": " have the opportunity to be able to stand up and say, hey, that's my Savior."
    },
    {
      "id": 85,
      "start": 1591.2599792480469,
      "end": 1594.2999572753906,
      "text": " He died for me and he died for you."
    },
    {
      "id": 86,
      "start": 1594.2999572753906,
      "end": 1597.9399719238281,
      "text": " Begin to share the truth of who Jesus really is."
    },
    {
      "id": 87,
      "start": 1597.9399719238281,
      "end": 1600.3799743652344,
      "text": " He's not a swear word."
    },
    {
      "id": 88,
      "start": 1600.3799743652344,
      "end": 1604.6199645996094,
      "text": " He's God and he's the Savior of the world."
    },
    {
      "id": 89,
      "start": 1604.6199645996094,
      "end": 1612.2999572753906,
      "text": " And this evening, I hope that as we, tonight, have this introductory thought into the next"
    },
    {
      "id": 90,
      "start": 1612.2999572753906,
      "end": 1616.7399597167969,
      "text": " several lessons of the doctrine of Christ, that we would be mindful of the confusion"
    },
    {
      "id": 91,
      "start": 1616.7399597167969,
      "end": 1621.2999572753906,
      "text": " that exists around us, that we would understand why that confusion exists, and that we would"
    },
    {
      "id": 92,
      "start": 1621.2999572753906,
      "end": 1626.97998046875,
      "text": " be properly, adequately equipped so that we could give an answer, so that we not only"
    },
    {
      "id": 93,
      "start": 1626.97998046875,
      "end": 1632.0999755859375,
      "text": " know ourselves who he is, but so that we could go and share that truth with those that we"
    },
    {
      "id": 94,
      "start": 1632.0999755859375,
      "end": 1633.6999816894531,
      "text": " come into contact with."
    },
    {
      "id": 95,
      "start": 1633.6999816894531,
      "end": 1640.8599548339844,
      "text": " You know, there are people that have been, I mean, they have made it their life mission"
    },
    {
      "id": 96,
      "start": 1641.0199584960938,
      "end": 1648.8999633789062,
      "text": " to go through and try to attack every reference of Jesus being God, because we understand"
    },
    {
      "id": 97,
      "start": 1648.8999633789062,
      "end": 1652.219970703125,
      "text": " the work of Satan behind the whole thing."
    },
    {
      "id": 98,
      "start": 1652.219970703125,
      "end": 1656.7399597167969,
      "text": " And so when we get to a position and we begin to interact with people and speak to them"
    },
    {
      "id": 99,
      "start": 1656.7399597167969,
      "end": 1660.4599609375,
      "text": " about Jesus, and they have these ideas of who Jesus is, and I could share some with"
    },
    {
      "id": 100,
      "start": 1660.4599609375,
      "end": 1665.1399536132812,
      "text": " you privately of some things that I've heard over the years, how do we respond to it?"
    },
    {
      "id": 101,
      "start": 1665.1399536132812,
      "end": 1671.7799682617188,
      "text": " Are we equipped to be able to answer the questions, to be able to preach Christ and"
    },
    {
      "id": 102,
      "start": 1671.7799682617188,
      "end": 1673.2599792480469,
      "text": " Christ alone?"
    },
    {
      "id": 103,
      "start": 1673.2599792480469,
      "end": 1675.7799682617188,
      "text": " This evening, whom do men say that I am?"
    },
    {
      "id": 104,
      "start": 1675.7799682617188,
      "end": 1682.0999755859375,
      "text": " Of course, Peter stood up with great boldness and confidence, thou art the Christ, the Son"
    },
    {
      "id": 105,
      "start": 1682.0999755859375,
      "end": 1683.0999755859375,
      "text": " of the living God."
    },
    {
      "id": 106,
      "start": 1683.0999755859375,
      "end": 1685.7399597167969,
      "text": " That's when Jesus said, whom do ye say that I am?"
    },
    {
      "id": 107,
      "start": 1685.7399597167969,
      "end": 1690.1799621582031,
      "text": " Because there was confusion, but Peter had confidence, and we need to have that same"
    },
    {
      "id": 108,
      "start": 1690.1799621582031,
      "end": 1691.1799621582031,
      "text": " confidence."
    },
    {
      "id": 109,
      "start": 1691.1799621582031,
      "end": 1692.1799621582031,
      "text": " Let's pray."
    },
    {
      "id": 110,
      "start": 1692.1799621582031,
      "end": 1693.1799621582031,
      "text": " Father, we love you."
    },
    {
      "id": 111,
      "start": 1693.1799621582031,
      "end": 1694.1799621582031,
      "text": " We thank you for loving us."
    },
    {
      "id": 112,
      "start": 1694.219970703125,
      "end": 1699.5799560546875,
      "text": " We thank you for your Word, for how you have revealed yourself to us through your Word."
    },
    {
      "id": 113,
      "start": 1699.5799560546875,
      "end": 1703.7799682617188,
      "text": " We thank you this evening for the opportunity to be your representatives."
    },
    {
      "id": 114,
      "start": 1703.7799682617188,
      "end": 1709.8199768066406,
      "text": " And God, we are mindful, keenly aware of the fact that we live in the midst of a people"
    },
    {
      "id": 115,
      "start": 1709.8199768066406,
      "end": 1713.8599853515625,
      "text": " that are greatly confused about who you are."
    },
    {
      "id": 116,
      "start": 1713.8599853515625,
      "end": 1725.4599609375,
      "text": " The enemy has worked through cults and false teachers, world religions, to give a false"
    },
    {
      "id": 117,
      "start": 1725.4599609375,
      "end": 1729.4999389648438,
      "text": " teaching of the person of Jesus Christ."
    },
    {
      "id": 118,
      "start": 1729.4999389648438,
      "end": 1736.1799926757812,
      "text": " And God, I pray this evening that we as your followers would be properly, adequately equipped"
    },
    {
      "id": 119,
      "start": 1736.1799926757812,
      "end": 1743.739990234375,
      "text": " to be able to give an answer, to stand up with confidence and to proclaim who you are."
    },
    {
      "id": 120,
      "start": 1743.739990234375,
      "end": 1746.8599853515625,
      "text": " We know the significance of this question."
    },
    {
      "id": 121,
      "start": 1746.8599853515625,
      "end": 1751.5799560546875,
      "text": " We know the cause of the confusion, and I pray that we would dig into your Word so that"
    },
    {
      "id": 122,
      "start": 1751.5799560546875,
      "end": 1753.8599853515625,
      "text": " we could be equipped to answer."
    },
    {
      "id": 123,
      "start": 1753.8599853515625,
      "end": 1755.3399658203125,
      "text": " I pray that you'd bless our time of prayer."
    },
    {
      "id": 124,
      "start": 1755.3399658203125,
      "end": 1756.6199951171875,
      "text": " We thank you again for the privilege."
    },
    {
      "id": 125,
      "start": 1756.6199951171875,
      "end": 1760.4999389648438,
      "text": " I pray that you'd be honored and glorified through all that's said and done for the remainder"
    },
    {
      "id": 126,
      "start": 1760.4999389648438,
      "end": 1761.4999389648438,
      "text": " of our service."
    },
    {
      "id": 127,
      "start": 1761.4999389648438,
      "end": 1763.4199829101562,
      "text": " For it's in Christ's name we pray."
    },
    {
      "id": 128,
      "start": 1763.4199829101562,
      "end": 1764.4199829101562,
      "text": " Amen."
    },
    {
      "id": 129,
      "start": 1764.4199829101562,
      "end": 1766.7799682617188,
      "text": " All right, if you have your prayer bullets in this evening."
    }
  ],
  "processed_at": "2025-04-17T10:20:03.014813"
}