{
  "video_id": "nS3pAoxKMb4",
  "text": "Opportunity to look at this model prayer many times referred to as the Lord's Prayer and we know that we've Repeated often throughout this mini-series that the Lord never told his disciples to use this as a Verbatim prayer that we just memorize and aimlessly or I should say mindlessly repeat the words That are contained herein and all of the prayers that are recorded throughout the New Testament many of which we have studied over the years You do not find that this is quoted verbatim It's not just simply something to be repeated, but we find that the Lord Jesus Christ our wonderful Savior is giving In response to the request of the disciple when he said Lord teach us to pray the Lord Jesus Christ is providing framework a model if you will as I've said is we would use this kind of as a Model and then add to it and begin to develop Using as a guideline the truth that that the Lord gives us in this portion of Scripture and follow that framework, I believe that it would cause us to be mindful of many things and Just to review quickly it would cause us to be mindful of our relationship To the Lord and the fact that God Almighty is our father and he is the Lord God Omnipotent that he reigns and rules but he is my father I have access because I have relationship to as many as as we've believed on the Lord Jesus Christ as many as received him to them gave he power to become the sons of God according To John 1 in verse number 12, and I'm so thankful that I can say father and Go to the Lord knowing that I have relationship. We understand that we would be mindful of the holiness and the Greatness of our God hallowed be thy name and you think about his greatness our father Which are in heaven the psalmist said we know I know that the Lord is great The psalmist said in Psalm 48 great is the Lord and greatly to be praised and you read through that portion of Scripture in Psalm 48 and you get to the very last verse of that passage and the Bible says this God is our God and After he goes through and describes the greatness of God and what a blessing to be mindful of how great our God is and the Reality that he is holy. We're mindful of his provision I'm thankful for the good hand of God and for his provision for us as his children and the way that he takes care of Us we're reminded of his forgiveness with thee there is forgiveness we understand that our God is ready to pardon and ready to forgive and when the It says there in in verse number four at the beginning and forgive us our sins we're mindful of the fact that we're sinful people and we're mindful of the fact that our God is a Forgiving God and I'm thankful that he has revealed that attribute of his to us in his word we also as we studied last Wednesday evening have understood the importance and we'd be mindful of the importance of forgiving others and someone said this as bread is to the Human flesh so forgiveness is to the human soul and how important it is that we would forgive one another that we would love one another and That we would not allow bitterness to grab root in our hearts in our lives We understand that not only would we be mindful of these things that I've mentioned briefly But it would also cause us to develop an attitude of reverence and submission When we go to God in prayer and we follow the framework that is provided for us here and we use this model It will help us to have That attitude of reverence and that attitude of submission and I believe those are necessary Attitudes when we go to God in prayer we find that as we would conclude this evening this particular Model prayer and look at the last phrase of verse number four We would note this evening that really it finishes with a twofold request that of direction and deliverance notice Verse number four of Luke 11. The Bible says and forgive us our sins For we also forgive everyone that is indebted to us and lead us not into temptation But deliver us from evil the title if you're taking notes this evening direction and Deliverance direction and deliverance as we note this twofold request that completes verse number four We are mindful of the fact that this is not a general request for direction and deliverance I am thankful that our God does provide leadership guidance direction for his children and how we need direction from God Almighty as you study the Old Testament you have the opportunity to see how God provided direction for the children of Israel as they wandered around as the pillar of cloud by day and the pillar of fire by night and the leadership the direction that was provided in fact as you look at the exodus and you look at their exit from Egypt you find that the Bible specifically says God led them and I'm thankful for the leadership and direction that God provides and the reality is that we need God's direction and we understand that as Our shepherd that he does guide us. He does lead us I'm thankful for God's deliverance and I'm thankful that he's able to deliver us from anything At times in our lives. He's able to Instead of delivering us from something he will develop us through something but we find this evening that the request the twofold request that completes verse number four is not a general request for direction and deliverance, but it is a specific request with regard to temptation and Evil notice the first phrase as we complete verse number four. It says lead us not into temptation Lead us not into temptation. It is a known reality that we have an enemy Amen, we understand that we have an adversary the devil He's a roaring line walketh about seeking whom he may devour and we are mindful of the fact that we have an enemy The reality is that a few chapters earlier if you turn back to Luke chapter number four You'll find that God provides for us here in this portion of Scripture the passage in which the devil tempted the Lord Jesus Christ while he was in the wilderness and we understand that the Bible tells us in verse number one of Luke 4 and Jesus being full of the Holy Ghost returned from Jordan and was led by the Spirit into the wilderness being 40 days Tempted of the devil and in those days he did eat nothing and when they were ended he afterward and hungered and We are not gonna read through the whole portion But I want you to notice in verse number 12 The Bible says in Jesus answering said unto him it is said thou shalt not tempt the Lord thy God We find that it's in verse number four that he says it is written again in verse number eight it is written and here in verse number 12, it is said by the way, the Lord is providing for us a a Model on how we respond to temptation using the Word of God But notice in verse number 13 and when the devil had ended all the temptation he departed from him for a season We have an enemy if the enemy is gonna try to tempt the Lord Jesus Christ And we understand the reason in which he would seek to tempt the Lord Jesus Christ I'm thankful that our God was tempted in all points like as we are such as we are yet without sin and What a blessing to understand the truth of that teaching of the Word of God But for us as the people of God, we understand that we have an enemy and the enemy is going to tempt us He's gonna tempt us to do evil We understand that God has given us this great truth in first Corinthians 10 in verse number 13 as Paul is ministering to the believers in Corinth a Verse that is so important for us to understand and really if you go through the entirety of chapter number 10 He will Paul will use some some information with regard to the Old Testament nation of Israel and Share with them some historical data to help them understand The the truth that he is giving to them and he says this in verse number 12 of first Corinthians 10 Wherefore let him that thinketh he standeth take heed lest he fall Verse 13 there hath no temptation taken you but such as is common to man Notice these next four words that are worth highlighting underlining in your Bible, but God is faithful But God is faithful who will not suffer you to be tempted above that you're able But will with the temptation also make a way to escape that ye may be able to bear it So we understand that we have an enemy we understand the reality of temptation And we understand that our God is faithful and will provide as I like to call it an escape route According to verse number 13 of first Corinthians 10 We also understand according to James chapter number 1 that our God does not tempt us to sin in James chapter Number 1 is specifically in verses 13 through 15 We find that this truth is being given to us with regard to temptation to sin or to do evil And in verse number 13 of James 1 the Bible says let no man say when he is tempted I am tempted of God for God cannot be tempted with evil neither tempteth He any man but every man is tempted when he is drawn away of his own lust and enticed then when lust hath conceived it bringeth forth sin and sin when it is finished bringeth forth death so we understand The the truth of temptation and we understand that we have an enemy We think about this model that is given to us in Luke chapter number 11 and really the significance of this last statement I I believe that it's helpful for us to understand that the Lord Jesus Christ is is giving this model this framework to the disciples, of course by way of preservation to us this evening, so that we would be helped in our prayer time, so that we would understand and have some guide as we go to God in prayer, that it's not just haphazardly praying, but we have some framework in which we would follow. And he says, lead us not into temptation. I wonder this evening, do we pray that God would keep us from temptation? I mean, really, do we pray, God, would you help me as I go to this place, as I go throughout my day today, as I'm interacting with these individuals, would you keep me, would you lead me not into temptation, would you help me in that area? And the reality is that if we begin to pray up like that, if we follow the framework and the model, I believe that we would be more aware of the temptation when it's presented, right? Because we're praying about it, we're saying, God, lead me not, lead us not into temptation. And so we're mindful of the fact that we have an enemy. Just by praying that way, lead us not into temptation, we are acknowledging the fact that we have an enemy that's going to try to tempt us to sin. And we understand that when we sin, yes, we have an advocate with the Father, and we are rejoicing and thankful for that, but we also understand that it hinders our fellowship with God Almighty. And so we, as we would understand the model and understand what's taking place as the Lord is giving this response to the disciples, and for us this evening when we say, Lord, lead us not into temptation, again, not just these vain words, just repetition, but really being mindful of, hey, I'm, you know, I'm going to be in this place, amongst this situation, would you help me, would you lead me not into temptation? Notice the last phrase, but deliver us from evil. Deliver us from evil. And so we see the direction and the deliverance. The reality is that, listen, though we know that there are times in which we face temptation, in fact, you may have been tempted to sin today. You know, the temptations come, and so we say, listen, I don't want to be tempted, but we understand that the enemy is going to tempt us, and so, therefore, when that temptation comes, deliver us from evil. Deliver us from evil. I believe that, really, as we look at this thought at the end of verse number four, in this really prayer for deliverance, that it reminds me of that escape route that I mentioned that Paul speaks of in 1 Corinthians chapter number 10, when he said, but God is faithful. And we must be mindful of that. Listen, the enemy wants to attack, and the enemy wants to set a trap, the enemy wants us to fall into sin and to destroy our testimony and to have hindered fellowship with God Almighty, but we find that our God is faithful, not only that it says, who will not suffer you to be tempted above that you're able, but then says, but will with the temptation also make a way to escape that you may be able to bear it. I find, oftentimes, that it's unfortunate that too many of God's people are not looking for the escape route, so to speak. I think about the illustrations, and we'll go over the book of Genesis as we conclude this evening, but we think about the illustration of Joseph and how Joseph retained his integrity, how that Joseph got out of the situation, but we find if we were to contrast that with David, with the sin of Bathsheba, though he was told when he inquired, asked to Bathsheba, who is she? Who is this woman? He is told who she is, not only being the daughter of, but the wife of, and very specifically, he is made aware of the fact that she was another man's wife. And yet, he didn't look for the escape route, did he? And we find that God will provide that way of escape, and when the enemy tempts us, we're asking that God would deliver us from evil. You know, the reality is that if we're saved this evening, if you've trusted Christ as your Savior, that you're no longer bound by sin. Sin no longer has dominion over us. When we were lost before we trusted Christ as our Savior, the Bible describes us in a number of ways, but one way in which it describes us is that we were dead in our sins, in our trespasses. And we are not a sinner because we sin, rather we sin because we're sinners. We're born sinners, and therefore it's the outworking of being a sinner is that we sin, and we understand that we're dead in our sins and our trespasses, that we, apart from the deliverance that God provides through Calvary, we are bound by that sin. Notice what God says in Romans chapter 6 as Paul is speaking to the believers here and trying to help them understand this truth of being delivered from the very power of sin. The Bible says in Romans 6, and we'll pick it up in verse 12. Romans 6 and verse 12, the Bible says, Romans 6 12, let not sin therefore reign in your mortal body, that you should obey it in the lust thereof, neither yield ye your members as instruments of unrighteousness unto sin, but yield yourselves unto God as those that are alive from the dead, and your members as instruments of righteousness unto God. Because we're saved, we now can yield ourselves unto God. Notice the truth of verse 14, for sin shall not have dominion over you, for you're not under the law, but under grace. And I'm so thankful, notice Romans 8 and verse number 2, where the Bible says, for the law of the Spirit of life in Christ Jesus hath made me free from the law of sin and death. And I'm no longer bound by the power of sin. We understand that the Bible teaches us that our flesh still has an appetite and still has a desire. The Bible tells us in Galatians 5 that the Spirit is at enmity, or the flesh is at enmity with the Spirit, they're contrary one to the other. And it says, the flesh lusteth against the Spirit and the Spirit against the flesh, and these are contrary the one to the other, so that you cannot do the things that you would. So what's the answer? Walk in the Spirit, that you should not fulfill the lust of the flesh. So when we understand that we have an enemy, when we understand that he's seeking to tempt us, and that temptation is going to come in our lives, and the enemy is going to seek to tempt us to do evil, and if we're mindful of how the Lord provides this framework and this model prayer, that we would be mindful of praying for God's direction and for God's deliverance with regards specifically to temptation and to evil. I'm mindful, we'll get to Genesis 39 in just a moment, but turn to Proverbs chapter number 1, if you will, and let me just share with you a thought from this portion of Scripture before we get there to Genesis chapter 39. But in Proverbs chapter number 1, verse number 10, the Bible says, My son, if sinners entice thee, consent thou not. If they say, Come with us, let us lay wait for blood, let us lurk privily for the innocent without cause. Let us swallow them up alive as the grave and whole as those that go down into the pit. We shall find all precious substance, we shall fill our houses with spoil. Cast in thy lot among us, let us all have one purse. They're making it sound good, right? I mean, they're enticing you to do evil. And he tells them, consent thou not. In verse number 10, he's telling them what they're going to say. Here's what they're going to say. Come with us and do these things. And this will be the result. Verse 15, My son, walk not thou in the way with them. Refrain thy foot from their path, for their feet run to evil and make haste to shed blood. Surely in vain the net is spread in the sight of any bird. I'm mindful of this passage when I think about the phraseology in verse number 10, when it says, If sinners entice thee, consent thou not. We think about the temptation of our enemy. You know, he makes it look good. He makes sin look desirable. He makes sin look like it's going to benefit us somehow. And we find that he makes it look shimmery and shiny and makes it look appealing. And in doing so, he's seeking to entice us to engage in whatever that particular sinful activity is. But when we're mindful of this model prayer, if we would pray in this fashion, if we would be mindful of that which the Lord is giving to the disciples, perhaps we would become more actively aware of the escape routes that God would provide us with. And perhaps we would face less temptation because we would be mindful on a more regular basis. And we would be ready and prepared as we were praying in that fashion. Look at Genesis 39, and we'll finish here this evening before we have our time of prayer. In Genesis chapter 39, a great portion of Scripture with regard to the Bible character of Joseph, and of course we understand that he's there, and he's prospering, and God is blessing, and he's in Potiphar's house, and the Lord blessed him, and the Lord blessed the Egyptians' house for Joseph's sake, according to verse number 5. But you find that the Bible says, notice verse 6, And he left all that he had in Joseph's hand, speaking of Potiphar, and he knew not all he had, save the bread which he did eat. And Joseph was a goodly person, and well favored. And it came to pass after these things, that his master's wife cast her eyes upon Joseph, and she said, Lie with me. But he refused, and said unto his master's wife, Behold, my master wilteth not what is with me in the house, and he hath committed all that he hath to my hand. There is none greater in this house than I, neither hath he kept back anything from me but thee, because thou art his wife. How then can I do this great wickedness and sin against God?\" I want you to notice in verse number 10, I mean, that's a good response from Joseph, is it not? Commendable response. It would have been evil, it would have been wicked for him to engage in this act that this Potiphar's wife desired for Joseph to engage in this activity. It would be sinful, it would be wicked. He said, How can I do this great wickedness and sin against God? What a great response from Joseph in this passage of Scripture. And sometimes when temptation comes in our lives, man, we are ready for it in the sense of we've prayed, perhaps, and we're acknowledging it and we respond properly, but you understand the devil doesn't just depart after one time of resisting that temptation, of providing that answer. In Luke chapter number 4, when the enemy, when the devil is tempting the Lord Jesus Christ, after the first response of Jesus, when Jesus said it is written, the devil didn't just leave. He tempted him a second time, and then a third time. And I read verse number 12 of Luke 4, particularly this evening, because the Bible says that he departed for a season, and we find that here in the life of Joseph, he responds properly. But I want you to notice in verse number 10, it says, And it came to pass, as she spake to Joseph, what does it say? Day by day. You know what the enemy tries to do? He tries to wear you down. Bring that temptation day by day, day by day. Wear you down. Somebody said that the enemy, the devil, will go by your door, quote-unquote, every day, go by it a thousand times to find it cracked just once. And the analogy or the imagery that they were using in making that statement is that, listen, though we have responded properly and though we've walked in the Spirit, we must understand that the enemy is going to continue to come, and it says, day by day, that he hearkened not unto her, to lie by her, to be with her. And it came to pass about this time that Joseph went into the house to do his business, and there was none of the men of the house there within. And so we find that verse number 12 tells us that she was going to capitalize on this opportunity, if you will, and it says that she caught him by his garment, saying, Lie with me. And he left his garment in her hand and fled and got him out. I've often said, as I've looked at verse number 12 of Genesis 39, that Joseph lost his coat, but he retained his character. It was far better for Joseph to spend time in prison, falsely accused, than to have engaged in that sinful behavior. Amen? You say, well, that's not so great, being in prison. I understand, but we're going to stand before God. It'd be better to be falsely accused and suffer, not for wrongdoing, but suffer for being wrongly accused and being right with God. And we understand that God knew all that was going on, and God had a plan, and we're familiar with, of course, the life of Joseph and all that comes to pass, and the way in which God's plan was working out. You understand in our lives, and I don't want to get too off track from what the subject matter is this evening, but God has a plan. And if Joseph didn't end up in that prison, I'm not so sure that he would have met the butler or the baker. Right? And if he didn't meet the butler, perhaps it would not have been possible for Pharaoh, when he had a dream, to say, hey, who's going to interpret? You know? And so we begin to look at how God is God. But as we look at the subject matter which we're dealing with this evening, you find that Joseph responds properly to this temptation. The temptation came on one particular day, and then it came day by day, day by day, and she kept saying, lie with me, lie with me, and then she tries to seize the opportunity when there's no one else around, and Joseph got himself out of the situation. There's a little kid's song, Put On Your Running Shoes, and the thought of fleeing from temptation, fleeing from youthful lust, and we see that as Paul would say that truth to Timothy. And this evening, when we think about the model prayer as it ends here in Luke 11, in verse number 4, and we've looked at all of these phrases, and we've studied through this, and we come to this last section when it says, lead us not into temptation, but deliver us from evil. And we think about God's direction and God's deliverance, not generally speaking, but specifically with regard to temptation and to evil. And again, as I mentioned a moment ago, if we would follow the framework of this model prayer, we would be mindful of many things. I mentioned a whole list of those as we started our message this evening, recapping the first few verses of this portion of Scripture and how we would be mindful of those great truths. But as we finish this evening, we would be mindful of temptation. You'd be aware, listen, the devil's going to try to tempt me today. He's going to try to tempt you today. He's going to try to tempt you when you go home in just a little while, right? He wants to cause us to sin. He wants us to have hindered fellowship. He wants us to lose our testimony with those that we're seeking to share the gospel with. You think about David and his great sin with Bathsheba, it brought reproach against the name of God that the enemy could speak ill of. You begin to consider this prayer of direction or for direction and deliverance, oh, that we would be mindful this evening that we have an enemy, but we have a God who is faithful. He's not going to suffer us, allow us to be tempted above that which we are able. He says that He'll also provide a way to escape. And I think as God's people, we need to be more, and if we'd be praying in this fashion, in this manner, maybe we'd be more actively engaged in looking for the escape route. Because we've been mindful to pray for the direction, lead us not into temptation, deliver us from evil, amen? A prayer for direction and a prayer for deliverance, oh, that God would help us to walk wholly. That we'd be holy in all matter of conversation, according to what He says in 1 Peter 1. Let's pray together. Father, we love You. Thank You for loving us. We know that we have an enemy, and we know that the enemy, even as he tempted the Lord Jesus Christ there in the wilderness, he seeks to tempt us to do evil, to sin, that it might hinder our walk with Thee, adversely impact our testimony for Thee. God, I pray that You'd help us as we see and conclude this model prayer this evening, to be mindful of the work of the enemy. God that You would help us to be aware of and mindful of the promise that You've given us there in 1 Corinthians 10 and verse 13. God that we would actively look for the escape route when that temptation comes, because we've prayed for deliverance, deliver us from evil. We do thank You for the privilege of corporate prayer, and I pray that as we now enter into this time of our service, as we pray one with another, that Lord, You'd be glorified. We'll thank You for all that You'll do, for it's in Christ's name we pray, amen. Does anyone need a prayer bulletin this evening? Anyone need one?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.78000020980835,
      "text": " Opportunity to look at this model prayer many times referred to as the Lord's Prayer and we know that we've"
    },
    {
      "id": 1,
      "start": 7.480000019073486,
      "end": 9.760000228881836,
      "text": " Repeated often throughout this mini-series"
    },
    {
      "id": 2,
      "start": 10.319999694824219,
      "end": 14.039999961853027,
      "text": " that the Lord never told his disciples to use this as a"
    },
    {
      "id": 3,
      "start": 14.479999542236328,
      "end": 21.260000228881836,
      "text": " Verbatim prayer that we just memorize and aimlessly or I should say mindlessly repeat the words"
    },
    {
      "id": 4,
      "start": 21.760000228881836,
      "end": 27.860000610351562,
      "text": " That are contained herein and all of the prayers that are recorded throughout the New Testament many of which we have studied over the years"
    },
    {
      "id": 5,
      "start": 28.200000762939453,
      "end": 31.739999771118164,
      "text": " You do not find that this is quoted verbatim"
    },
    {
      "id": 6,
      "start": 31.739999771118164,
      "end": 38.939998626708984,
      "text": " It's not just simply something to be repeated, but we find that the Lord Jesus Christ our wonderful Savior is giving"
    },
    {
      "id": 7,
      "start": 39.459999084472656,
      "end": 44.779998779296875,
      "text": " In response to the request of the disciple when he said Lord teach us to pray"
    },
    {
      "id": 8,
      "start": 45.29999923706055,
      "end": 51.880001068115234,
      "text": " the Lord Jesus Christ is providing framework a model if you will as I've said is we would use this kind of as a"
    },
    {
      "id": 9,
      "start": 52.099998474121094,
      "end": 55.34000015258789,
      "text": " Model and then add to it and begin to develop"
    },
    {
      "id": 10,
      "start": 56.29999923706055,
      "end": 62.720001220703125,
      "text": " Using as a guideline the truth that that the Lord gives us in this portion of Scripture and follow that"
    },
    {
      "id": 11,
      "start": 63.29999923706055,
      "end": 67.33999633789062,
      "text": " framework, I believe that it would cause us to be mindful of many things and"
    },
    {
      "id": 12,
      "start": 67.94000244140625,
      "end": 72.0199966430664,
      "text": " Just to review quickly it would cause us to be mindful of our relationship"
    },
    {
      "id": 13,
      "start": 72.5,
      "end": 78.0199966430664,
      "text": " To the Lord and the fact that God Almighty is our father and he is the Lord God"
    },
    {
      "id": 14,
      "start": 78.30000305175781,
      "end": 81.5,
      "text": " Omnipotent that he reigns and rules but he is my father"
    },
    {
      "id": 15,
      "start": 81.5,
      "end": 85.54000091552734,
      "text": " I have access because I have relationship to as many as"
    },
    {
      "id": 16,
      "start": 86.41999816894531,
      "end": 92.66000366210938,
      "text": " as we've believed on the Lord Jesus Christ as many as received him to them gave he power to become the sons of God according"
    },
    {
      "id": 17,
      "start": 92.66000366210938,
      "end": 97.19999694824219,
      "text": " To John 1 in verse number 12, and I'm so thankful that I can say"
    },
    {
      "id": 18,
      "start": 97.86000061035156,
      "end": 99.26000213623047,
      "text": " father and"
    },
    {
      "id": 19,
      "start": 99.26000213623047,
      "end": 106.13999938964844,
      "text": " Go to the Lord knowing that I have relationship. We understand that we would be mindful of the holiness and the"
    },
    {
      "id": 20,
      "start": 106.9000015258789,
      "end": 112.41999816894531,
      "text": " Greatness of our God hallowed be thy name and you think about his greatness our father"
    },
    {
      "id": 21,
      "start": 112.41999816894531,
      "end": 117.33999633789062,
      "text": " Which are in heaven the psalmist said we know I know that the Lord is great"
    },
    {
      "id": 22,
      "start": 117.9000015258789,
      "end": 124.66000366210938,
      "text": " The psalmist said in Psalm 48 great is the Lord and greatly to be praised and you read through that portion of Scripture in Psalm"
    },
    {
      "id": 23,
      "start": 124.66000366210938,
      "end": 131.17999267578125,
      "text": " 48 and you get to the very last verse of that passage and the Bible says this God is our God and"
    },
    {
      "id": 24,
      "start": 131.3000030517578,
      "end": 138.05999755859375,
      "text": " After he goes through and describes the greatness of God and what a blessing to be mindful of how great our God is and the"
    },
    {
      "id": 25,
      "start": 138.10000610351562,
      "end": 141.33999633789062,
      "text": " Reality that he is holy. We're mindful of his provision"
    },
    {
      "id": 26,
      "start": 141.5399932861328,
      "end": 148.10000610351562,
      "text": " I'm thankful for the good hand of God and for his provision for us as his children and the way that he takes care of"
    },
    {
      "id": 27,
      "start": 148.10000610351562,
      "end": 152.89999389648438,
      "text": " Us we're reminded of his forgiveness with thee there is forgiveness"
    },
    {
      "id": 28,
      "start": 152.89999389648438,
      "end": 157.33999633789062,
      "text": " we understand that our God is ready to pardon and ready to forgive and when the"
    },
    {
      "id": 29,
      "start": 157.77999877929688,
      "end": 162.10000610351562,
      "text": " It says there in in verse number four at the beginning and forgive us our sins"
    },
    {
      "id": 30,
      "start": 162.10000610351562,
      "end": 166.77999877929688,
      "text": " we're mindful of the fact that we're sinful people and we're mindful of the fact that our God is a"
    },
    {
      "id": 31,
      "start": 167.25999450683594,
      "end": 173.94000244140625,
      "text": " Forgiving God and I'm thankful that he has revealed that attribute of his to us in his word"
    },
    {
      "id": 32,
      "start": 174.02000427246094,
      "end": 181.6199951171875,
      "text": " we also as we studied last Wednesday evening have understood the importance and we'd be mindful of the importance of forgiving others and"
    },
    {
      "id": 33,
      "start": 182.17999267578125,
      "end": 184.74000549316406,
      "text": " someone said this as bread is to the"
    },
    {
      "id": 34,
      "start": 185.33999633789062,
      "end": 188.89999389648438,
      "text": " Human flesh so forgiveness is to the human soul and"
    },
    {
      "id": 35,
      "start": 189.4600067138672,
      "end": 194.3000030517578,
      "text": " how important it is that we would forgive one another that we would love one another and"
    },
    {
      "id": 36,
      "start": 194.74000549316406,
      "end": 199.6999969482422,
      "text": " That we would not allow bitterness to grab root in our hearts in our lives"
    },
    {
      "id": 37,
      "start": 200.02000427246094,
      "end": 204.5399932861328,
      "text": " We understand that not only would we be mindful of these things that I've mentioned briefly"
    },
    {
      "id": 38,
      "start": 204.5399932861328,
      "end": 209.5800018310547,
      "text": " But it would also cause us to develop an attitude of reverence and submission"
    },
    {
      "id": 39,
      "start": 210.10000610351562,
      "end": 215.82000732421875,
      "text": " When we go to God in prayer and we follow the framework that is provided for us here and we use this model"
    },
    {
      "id": 40,
      "start": 215.82000732421875,
      "end": 217.82000732421875,
      "text": " It will help us to have"
    },
    {
      "id": 41,
      "start": 218.05999755859375,
      "end": 223.5,
      "text": " That attitude of reverence and that attitude of submission and I believe those are necessary"
    },
    {
      "id": 42,
      "start": 224.05999755859375,
      "end": 230.10000610351562,
      "text": " Attitudes when we go to God in prayer we find that as we would conclude this evening this particular"
    },
    {
      "id": 43,
      "start": 230.66000366210938,
      "end": 234.05999755859375,
      "text": " Model prayer and look at the last phrase of verse number four"
    },
    {
      "id": 44,
      "start": 234.4600067138672,
      "end": 242.0800018310547,
      "text": " We would note this evening that really it finishes with a twofold request that of direction and deliverance notice"
    },
    {
      "id": 45,
      "start": 242.4600067138672,
      "end": 247.10000610351562,
      "text": " Verse number four of Luke 11. The Bible says and forgive us our sins"
    },
    {
      "id": 46,
      "start": 247.74000549316406,
      "end": 253.66000366210938,
      "text": " For we also forgive everyone that is indebted to us and lead us not into temptation"
    },
    {
      "id": 47,
      "start": 253.97999572753906,
      "end": 256.82000732421875,
      "text": " But deliver us from evil"
    },
    {
      "id": 48,
      "start": 257.3800048828125,
      "end": 261.3800048828125,
      "text": " the title if you're taking notes this evening direction and"
    },
    {
      "id": 49,
      "start": 261.8999938964844,
      "end": 268.17999267578125,
      "text": " Deliverance direction and deliverance as we note this twofold request that completes verse number four"
    },
    {
      "id": 50,
      "start": 268.260009765625,
      "end": 273.5400085449219,
      "text": " We are mindful of the fact that this is not a general request for direction and deliverance"
    },
    {
      "id": 51,
      "start": 273.5400085449219,
      "end": 280.4599914550781,
      "text": " I am thankful that our God does provide leadership guidance direction for his children and how we need"
    },
    {
      "id": 52,
      "start": 280.70001220703125,
      "end": 284.4200134277344,
      "text": " direction from God Almighty as you study the Old Testament you have the"
    },
    {
      "id": 53,
      "start": 284.5400085449219,
      "end": 289.8599853515625,
      "text": " opportunity to see how God provided direction for the children of Israel as they wandered around as the"
    },
    {
      "id": 54,
      "start": 290.29998779296875,
      "end": 297.3800048828125,
      "text": " pillar of cloud by day and the pillar of fire by night and the leadership the direction that was provided in fact as you look"
    },
    {
      "id": 55,
      "start": 297.3800048828125,
      "end": 298.5,
      "text": " at the"
    },
    {
      "id": 56,
      "start": 298.5,
      "end": 300.4200134277344,
      "text": " exodus and you look at their"
    },
    {
      "id": 57,
      "start": 300.4200134277344,
      "end": 305.6600036621094,
      "text": " exit from Egypt you find that the Bible specifically says God led them and"
    },
    {
      "id": 58,
      "start": 306.1400146484375,
      "end": 313.4200134277344,
      "text": " I'm thankful for the leadership and direction that God provides and the reality is that we need God's direction and we understand that as"
    },
    {
      "id": 59,
      "start": 313.4200134277344,
      "end": 316.5,
      "text": " Our shepherd that he does guide us. He does lead us"
    },
    {
      "id": 60,
      "start": 316.5,
      "end": 320.8999938964844,
      "text": " I'm thankful for God's deliverance and I'm thankful that he's able to deliver us from anything"
    },
    {
      "id": 61,
      "start": 321.8599853515625,
      "end": 324.1400146484375,
      "text": " At times in our lives. He's able to"
    },
    {
      "id": 62,
      "start": 324.8599853515625,
      "end": 329.1400146484375,
      "text": " Instead of delivering us from something he will develop us through something"
    },
    {
      "id": 63,
      "start": 329.1400146484375,
      "end": 335.5799865722656,
      "text": " but we find this evening that the request the twofold request that completes verse number four is not a"
    },
    {
      "id": 64,
      "start": 335.94000244140625,
      "end": 343.260009765625,
      "text": " general request for direction and deliverance, but it is a specific request with regard to temptation and"
    },
    {
      "id": 65,
      "start": 343.82000732421875,
      "end": 350.0199890136719,
      "text": " Evil notice the first phrase as we complete verse number four. It says lead us not"
    },
    {
      "id": 66,
      "start": 350.739990234375,
      "end": 352.739990234375,
      "text": " into temptation"
    },
    {
      "id": 67,
      "start": 352.739990234375,
      "end": 357.8599853515625,
      "text": " Lead us not into temptation. It is a known reality that we have an enemy"
    },
    {
      "id": 68,
      "start": 358.5,
      "end": 362.17999267578125,
      "text": " Amen, we understand that we have an adversary the devil"
    },
    {
      "id": 69,
      "start": 362.17999267578125,
      "end": 369.8599853515625,
      "text": " He's a roaring line walketh about seeking whom he may devour and we are mindful of the fact that we have an enemy"
    },
    {
      "id": 70,
      "start": 370.1000061035156,
      "end": 374.5799865722656,
      "text": " The reality is that a few chapters earlier if you turn back to Luke chapter number four"
    },
    {
      "id": 71,
      "start": 374.6600036621094,
      "end": 378.70001220703125,
      "text": " You'll find that God provides for us here in this portion of Scripture"
    },
    {
      "id": 72,
      "start": 378.70001220703125,
      "end": 384.82000732421875,
      "text": " the passage in which the devil tempted the Lord Jesus Christ while he was in the wilderness and we"
    },
    {
      "id": 73,
      "start": 384.8599853515625,
      "end": 388.6600036621094,
      "text": " understand that the Bible tells us in verse number one of Luke 4 and"
    },
    {
      "id": 74,
      "start": 389.0199890136719,
      "end": 394.94000244140625,
      "text": " Jesus being full of the Holy Ghost returned from Jordan and was led by the Spirit into the wilderness being 40 days"
    },
    {
      "id": 75,
      "start": 395.3800048828125,
      "end": 401.6600036621094,
      "text": " Tempted of the devil and in those days he did eat nothing and when they were ended he afterward and hungered and"
    },
    {
      "id": 76,
      "start": 402.1400146484375,
      "end": 404.5,
      "text": " We are not gonna read through the whole portion"
    },
    {
      "id": 77,
      "start": 404.5,
      "end": 406.29998779296875,
      "text": " But I want you to notice in verse number 12"
    },
    {
      "id": 78,
      "start": 406.29998779296875,
      "end": 412.17999267578125,
      "text": " The Bible says in Jesus answering said unto him it is said thou shalt not tempt the Lord thy God"
    },
    {
      "id": 79,
      "start": 412.6199951171875,
      "end": 416.6600036621094,
      "text": " We find that it's in verse number four that he says it is written again in verse number eight"
    },
    {
      "id": 80,
      "start": 416.6600036621094,
      "end": 422.29998779296875,
      "text": " it is written and here in verse number 12, it is said by the way, the Lord is providing for us a"
    },
    {
      "id": 81,
      "start": 422.82000732421875,
      "end": 423.8599853515625,
      "text": " a"
    },
    {
      "id": 82,
      "start": 423.8599853515625,
      "end": 427.82000732421875,
      "text": " Model on how we respond to temptation using the Word of God"
    },
    {
      "id": 83,
      "start": 427.94000244140625,
      "end": 435.8999938964844,
      "text": " But notice in verse number 13 and when the devil had ended all the temptation he departed from him for a season"
    },
    {
      "id": 84,
      "start": 436.70001220703125,
      "end": 440.260009765625,
      "text": " We have an enemy if the enemy is gonna try to tempt the Lord Jesus Christ"
    },
    {
      "id": 85,
      "start": 440.4200134277344,
      "end": 444.4599914550781,
      "text": " And we understand the reason in which he would seek to tempt the Lord Jesus Christ"
    },
    {
      "id": 86,
      "start": 444.4599914550781,
      "end": 450.5400085449219,
      "text": " I'm thankful that our God was tempted in all points like as we are such as we are yet without sin and"
    },
    {
      "id": 87,
      "start": 450.82000732421875,
      "end": 455.739990234375,
      "text": " What a blessing to understand the truth of that teaching of the Word of God"
    },
    {
      "id": 88,
      "start": 455.739990234375,
      "end": 460.8999938964844,
      "text": " But for us as the people of God, we understand that we have an enemy and the enemy is going to tempt us"
    },
    {
      "id": 89,
      "start": 460.8999938964844,
      "end": 462.5799865722656,
      "text": " He's gonna tempt us to do evil"
    },
    {
      "id": 90,
      "start": 462.5799865722656,
      "end": 470.70001220703125,
      "text": " We understand that God has given us this great truth in first Corinthians 10 in verse number 13 as Paul is ministering to the believers"
    },
    {
      "id": 91,
      "start": 470.70001220703125,
      "end": 472.29998779296875,
      "text": " in Corinth a"
    },
    {
      "id": 92,
      "start": 472.29998779296875,
      "end": 478.8999938964844,
      "text": " Verse that is so important for us to understand and really if you go through the entirety of chapter number 10"
    },
    {
      "id": 93,
      "start": 478.8999938964844,
      "end": 481.8999938964844,
      "text": " He will Paul will use some some"
    },
    {
      "id": 94,
      "start": 482.6199951171875,
      "end": 486.3399963378906,
      "text": " information with regard to the Old Testament nation of Israel and"
    },
    {
      "id": 95,
      "start": 486.8599853515625,
      "end": 491.260009765625,
      "text": " Share with them some historical data to help them understand"
    },
    {
      "id": 96,
      "start": 492.260009765625,
      "end": 497.82000732421875,
      "text": " The the truth that he is giving to them and he says this in verse number 12 of first Corinthians 10"
    },
    {
      "id": 97,
      "start": 498.3800048828125,
      "end": 502.79998779296875,
      "text": " Wherefore let him that thinketh he standeth take heed lest he fall"
    },
    {
      "id": 98,
      "start": 503.5199890136719,
      "end": 509.5199890136719,
      "text": " Verse 13 there hath no temptation taken you but such as is common to man"
    },
    {
      "id": 99,
      "start": 510.3599853515625,
      "end": 517.1599731445312,
      "text": " Notice these next four words that are worth highlighting underlining in your Bible, but God is faithful"
    },
    {
      "id": 100,
      "start": 517.760009765625,
      "end": 522.8400268554688,
      "text": " But God is faithful who will not suffer you to be tempted above that you're able"
    },
    {
      "id": 101,
      "start": 523.0399780273438,
      "end": 529.5800170898438,
      "text": " But will with the temptation also make a way to escape that ye may be able to bear it"
    },
    {
      "id": 102,
      "start": 529.5800170898438,
      "end": 534.1799926757812,
      "text": " So we understand that we have an enemy we understand the reality of temptation"
    },
    {
      "id": 103,
      "start": 534.1799926757812,
      "end": 539.5399780273438,
      "text": " And we understand that our God is faithful and will provide as I like to call it an escape route"
    },
    {
      "id": 104,
      "start": 539.5399780273438,
      "end": 541.9400024414062,
      "text": " According to verse number 13 of first Corinthians 10"
    },
    {
      "id": 105,
      "start": 541.9400024414062,
      "end": 549.739990234375,
      "text": " We also understand according to James chapter number 1 that our God does not tempt us to sin in James chapter"
    },
    {
      "id": 106,
      "start": 549.739990234375,
      "end": 552.9199829101562,
      "text": " Number 1 is specifically in verses 13 through 15"
    },
    {
      "id": 107,
      "start": 553.02001953125,
      "end": 558.9000244140625,
      "text": " We find that this truth is being given to us with regard to temptation to sin or to do evil"
    },
    {
      "id": 108,
      "start": 558.9000244140625,
      "end": 563.8200073242188,
      "text": " And in verse number 13 of James 1 the Bible says let no man say when he is tempted"
    },
    {
      "id": 109,
      "start": 563.8200073242188,
      "end": 569.4199829101562,
      "text": " I am tempted of God for God cannot be tempted with evil neither tempteth"
    },
    {
      "id": 110,
      "start": 569.4199829101562,
      "end": 576.5,
      "text": " He any man but every man is tempted when he is drawn away of his own lust and enticed then when lust hath conceived it bringeth"
    },
    {
      "id": 111,
      "start": 576.5,
      "end": 580.7000122070312,
      "text": " forth sin and sin when it is finished bringeth forth death"
    },
    {
      "id": 112,
      "start": 581.260009765625,
      "end": 583.0999755859375,
      "text": " so we understand"
    },
    {
      "id": 113,
      "start": 583.0999755859375,
      "end": 587.0599975585938,
      "text": " The the truth of temptation and we understand that we have an enemy"
    },
    {
      "id": 114,
      "start": 587.0999755859375,
      "end": 593.5,
      "text": " We think about this model that is given to us in Luke chapter number 11 and really the significance of this last statement"
    },
    {
      "id": 115,
      "start": 593.5,
      "end": 599.8800048828125,
      "text": " I I believe that it's helpful for us to understand that the Lord Jesus Christ is is giving this"
    },
    {
      "id": 0,
      "start": 599.8800048828125,
      "end": 605.0400047302246,
      "text": " model this framework to the disciples, of course by way of preservation to us this evening,"
    },
    {
      "id": 1,
      "start": 605.0400047302246,
      "end": 609.4800052642822,
      "text": " so that we would be helped in our prayer time, so that we would understand and have some"
    },
    {
      "id": 2,
      "start": 609.4800052642822,
      "end": 616.4000053405762,
      "text": " guide as we go to God in prayer, that it's not just haphazardly praying, but we have"
    },
    {
      "id": 3,
      "start": 616.4000053405762,
      "end": 622.2800045013428,
      "text": " some framework in which we would follow. And he says, lead us not into temptation. I wonder"
    },
    {
      "id": 4,
      "start": 622.2800045013428,
      "end": 629.7200050354004,
      "text": " this evening, do we pray that God would keep us from temptation? I mean, really, do we"
    },
    {
      "id": 5,
      "start": 629.7200050354004,
      "end": 635.3600044250488,
      "text": " pray, God, would you help me as I go to this place, as I go throughout my day today, as"
    },
    {
      "id": 6,
      "start": 635.3600044250488,
      "end": 642.080005645752,
      "text": " I'm interacting with these individuals, would you keep me, would you lead me not into temptation,"
    },
    {
      "id": 7,
      "start": 642.080005645752,
      "end": 648.5600051879883,
      "text": " would you help me in that area? And the reality is that if we begin to pray up like that,"
    },
    {
      "id": 8,
      "start": 648.5600051879883,
      "end": 653.8400039672852,
      "text": " if we follow the framework and the model, I believe that we would be more aware of the"
    },
    {
      "id": 9,
      "start": 653.8400039672852,
      "end": 659.2000045776367,
      "text": " temptation when it's presented, right? Because we're praying about it, we're saying, God,"
    },
    {
      "id": 10,
      "start": 659.2000045776367,
      "end": 665.0400085449219,
      "text": " lead me not, lead us not into temptation. And so we're mindful of the fact that we have"
    },
    {
      "id": 11,
      "start": 665.0400085449219,
      "end": 671.5600051879883,
      "text": " an enemy. Just by praying that way, lead us not into temptation, we are acknowledging"
    },
    {
      "id": 12,
      "start": 671.5600051879883,
      "end": 677.6000061035156,
      "text": " the fact that we have an enemy that's going to try to tempt us to sin. And we understand"
    },
    {
      "id": 13,
      "start": 677.6000061035156,
      "end": 681.2800064086914,
      "text": " that when we sin, yes, we have an advocate with the Father, and we are rejoicing and"
    },
    {
      "id": 14,
      "start": 681.2800064086914,
      "end": 687.120002746582,
      "text": " thankful for that, but we also understand that it hinders our fellowship with God Almighty."
    },
    {
      "id": 15,
      "start": 687.120002746582,
      "end": 692.120002746582,
      "text": " And so we, as we would understand the model and understand what's taking place as the"
    },
    {
      "id": 16,
      "start": 692.120002746582,
      "end": 697.3800048828125,
      "text": " Lord is giving this response to the disciples, and for us this evening when we say, Lord,"
    },
    {
      "id": 17,
      "start": 697.3800048828125,
      "end": 703.4600067138672,
      "text": " lead us not into temptation, again, not just these vain words, just repetition, but really"
    },
    {
      "id": 18,
      "start": 703.4600067138672,
      "end": 709.120002746582,
      "text": " being mindful of, hey, I'm, you know, I'm going to be in this place, amongst this situation,"
    },
    {
      "id": 19,
      "start": 709.120002746582,
      "end": 713.9200057983398,
      "text": " would you help me, would you lead me not into temptation? Notice the last phrase, but deliver"
    },
    {
      "id": 20,
      "start": 713.9200057983398,
      "end": 721.8400039672852,
      "text": " us from evil. Deliver us from evil. And so we see the direction and the deliverance."
    },
    {
      "id": 21,
      "start": 721.8400039672852,
      "end": 727.7200012207031,
      "text": " The reality is that, listen, though we know that there are times in which we face temptation,"
    },
    {
      "id": 22,
      "start": 727.7200012207031,
      "end": 734.6000061035156,
      "text": " in fact, you may have been tempted to sin today. You know, the temptations come, and"
    },
    {
      "id": 23,
      "start": 734.6000061035156,
      "end": 740.3200073242188,
      "text": " so we say, listen, I don't want to be tempted, but we understand that the enemy is going"
    },
    {
      "id": 24,
      "start": 740.3200073242188,
      "end": 747.5200042724609,
      "text": " to tempt us, and so, therefore, when that temptation comes, deliver us from evil. Deliver"
    },
    {
      "id": 25,
      "start": 747.5200042724609,
      "end": 748.5200042724609,
      "text": " us from evil."
    },
    {
      "id": 26,
      "start": 748.5200042724609,
      "end": 753.2799987792969,
      "text": " I believe that, really, as we look at this thought at the end of verse number four, in"
    },
    {
      "id": 27,
      "start": 753.2799987792969,
      "end": 758.6000061035156,
      "text": " this really prayer for deliverance, that it reminds me of that escape route that I mentioned"
    },
    {
      "id": 28,
      "start": 758.6000061035156,
      "end": 764.2200012207031,
      "text": " that Paul speaks of in 1 Corinthians chapter number 10, when he said, but God is faithful."
    },
    {
      "id": 29,
      "start": 764.2200012207031,
      "end": 768.1000061035156,
      "text": " And we must be mindful of that. Listen, the enemy wants to attack, and the enemy wants"
    },
    {
      "id": 30,
      "start": 768.1000061035156,
      "end": 774.3800048828125,
      "text": " to set a trap, the enemy wants us to fall into sin and to destroy our testimony and"
    },
    {
      "id": 31,
      "start": 774.3800048828125,
      "end": 780.2799987792969,
      "text": " to have hindered fellowship with God Almighty, but we find that our God is faithful, not"
    },
    {
      "id": 32,
      "start": 780.2799987792969,
      "end": 784.9800109863281,
      "text": " only that it says, who will not suffer you to be tempted above that you're able, but"
    },
    {
      "id": 33,
      "start": 784.9800109863281,
      "end": 790.6200103759766,
      "text": " then says, but will with the temptation also make a way to escape that you may be able"
    },
    {
      "id": 34,
      "start": 790.6200103759766,
      "end": 792.4600067138672,
      "text": " to bear it."
    },
    {
      "id": 35,
      "start": 792.4600067138672,
      "end": 797.7799987792969,
      "text": " I find, oftentimes, that it's unfortunate that too many of God's people are not looking"
    },
    {
      "id": 36,
      "start": 797.9600067138672,
      "end": 803.5800018310547,
      "text": " for the escape route, so to speak. I think about the illustrations, and we'll go over"
    },
    {
      "id": 37,
      "start": 803.5800018310547,
      "end": 808.3400115966797,
      "text": " the book of Genesis as we conclude this evening, but we think about the illustration of Joseph"
    },
    {
      "id": 38,
      "start": 808.3400115966797,
      "end": 814.4600067138672,
      "text": " and how Joseph retained his integrity, how that Joseph got out of the situation, but"
    },
    {
      "id": 39,
      "start": 814.4600067138672,
      "end": 820.3400115966797,
      "text": " we find if we were to contrast that with David, with the sin of Bathsheba, though he was told"
    },
    {
      "id": 40,
      "start": 820.3400115966797,
      "end": 826.7799987792969,
      "text": " when he inquired, asked to Bathsheba, who is she? Who is this woman? He is told who"
    },
    {
      "id": 41,
      "start": 826.7799987792969,
      "end": 833.4600067138672,
      "text": " she is, not only being the daughter of, but the wife of, and very specifically, he is"
    },
    {
      "id": 42,
      "start": 833.4600067138672,
      "end": 841.3000030517578,
      "text": " made aware of the fact that she was another man's wife. And yet, he didn't look for the"
    },
    {
      "id": 43,
      "start": 841.3000030517578,
      "end": 847.0200042724609,
      "text": " escape route, did he? And we find that God will provide that way of escape, and when"
    },
    {
      "id": 44,
      "start": 847.0200042724609,
      "end": 853.1800079345703,
      "text": " the enemy tempts us, we're asking that God would deliver us from evil. You know, the"
    },
    {
      "id": 45,
      "start": 853.1800079345703,
      "end": 858.02001953125,
      "text": " reality is that if we're saved this evening, if you've trusted Christ as your Savior,"
    },
    {
      "id": 46,
      "start": 858.02001953125,
      "end": 865.9400024414062,
      "text": " that you're no longer bound by sin. Sin no longer has dominion over us. When we were"
    },
    {
      "id": 47,
      "start": 865.9400024414062,
      "end": 871.6600036621094,
      "text": " lost before we trusted Christ as our Savior, the Bible describes us in a number of ways,"
    },
    {
      "id": 48,
      "start": 871.6600036621094,
      "end": 877.1799926757812,
      "text": " but one way in which it describes us is that we were dead in our sins, in our trespasses."
    },
    {
      "id": 49,
      "start": 877.1799926757812,
      "end": 885.4200134277344,
      "text": " And we are not a sinner because we sin, rather we sin because we're sinners. We're born sinners,"
    },
    {
      "id": 50,
      "start": 885.4200134277344,
      "end": 890.739990234375,
      "text": " and therefore it's the outworking of being a sinner is that we sin, and we understand"
    },
    {
      "id": 51,
      "start": 890.739990234375,
      "end": 896.4599914550781,
      "text": " that we're dead in our sins and our trespasses, that we, apart from the deliverance that God"
    },
    {
      "id": 52,
      "start": 896.4599914550781,
      "end": 902.7799987792969,
      "text": " provides through Calvary, we are bound by that sin. Notice what God says in Romans chapter"
    },
    {
      "id": 53,
      "start": 902.8200073242188,
      "end": 909.3200073242188,
      "text": " 6 as Paul is speaking to the believers here and trying to help them understand this truth"
    },
    {
      "id": 54,
      "start": 909.3200073242188,
      "end": 915.5599975585938,
      "text": " of being delivered from the very power of sin. The Bible says in Romans 6, and we'll"
    },
    {
      "id": 55,
      "start": 915.5599975585938,
      "end": 921.7200012207031,
      "text": " pick it up in verse 12. Romans 6 and verse 12, the Bible says,"
    },
    {
      "id": 56,
      "start": 921.7200012207031,
      "end": 926.4400024414062,
      "text": " Romans 6 12, let not sin therefore reign in your mortal body, that you should obey it"
    },
    {
      "id": 57,
      "start": 926.4400024414062,
      "end": 932.2000122070312,
      "text": " in the lust thereof, neither yield ye your members as instruments of unrighteousness"
    },
    {
      "id": 58,
      "start": 932.2000122070312,
      "end": 938.0,
      "text": " unto sin, but yield yourselves unto God as those that are alive from the dead, and your"
    },
    {
      "id": 59,
      "start": 938.0,
      "end": 943.8800048828125,
      "text": " members as instruments of righteousness unto God. Because we're saved, we now can yield"
    },
    {
      "id": 60,
      "start": 943.8800048828125,
      "end": 951.239990234375,
      "text": " ourselves unto God. Notice the truth of verse 14, for sin shall not have dominion over you,"
    },
    {
      "id": 61,
      "start": 951.239990234375,
      "end": 957.52001953125,
      "text": " for you're not under the law, but under grace. And I'm so thankful, notice Romans 8 and verse"
    },
    {
      "id": 62,
      "start": 957.52001953125,
      "end": 961.8800048828125,
      "text": " number 2, where the Bible says, for the law of the Spirit of life in Christ Jesus hath"
    },
    {
      "id": 63,
      "start": 961.8800048828125,
      "end": 971.0,
      "text": " made me free from the law of sin and death. And I'm no longer bound by the power of sin."
    },
    {
      "id": 64,
      "start": 971.0,
      "end": 975.7200012207031,
      "text": " We understand that the Bible teaches us that our flesh still has an appetite and still"
    },
    {
      "id": 65,
      "start": 975.7200012207031,
      "end": 981.8399963378906,
      "text": " has a desire. The Bible tells us in Galatians 5 that the Spirit is at enmity, or the flesh"
    },
    {
      "id": 66,
      "start": 981.8399963378906,
      "end": 987.1199951171875,
      "text": " is at enmity with the Spirit, they're contrary one to the other. And it says, the flesh lusteth"
    },
    {
      "id": 67,
      "start": 987.1199951171875,
      "end": 992.0400085449219,
      "text": " against the Spirit and the Spirit against the flesh, and these are contrary the one"
    },
    {
      "id": 68,
      "start": 992.0400085449219,
      "end": 996.0800170898438,
      "text": " to the other, so that you cannot do the things that you would. So what's the answer? Walk"
    },
    {
      "id": 69,
      "start": 996.0800170898438,
      "end": 1001.5599975585938,
      "text": " in the Spirit, that you should not fulfill the lust of the flesh."
    },
    {
      "id": 70,
      "start": 1001.5599975585938,
      "end": 1006.6000061035156,
      "text": " So when we understand that we have an enemy, when we understand that he's seeking to tempt"
    },
    {
      "id": 71,
      "start": 1006.6000061035156,
      "end": 1013.239990234375,
      "text": " us, and that temptation is going to come in our lives, and the enemy is going to seek"
    },
    {
      "id": 72,
      "start": 1013.239990234375,
      "end": 1018.8000183105469,
      "text": " to tempt us to do evil, and if we're mindful of how the Lord provides this framework and"
    },
    {
      "id": 73,
      "start": 1018.8000183105469,
      "end": 1025.3600158691406,
      "text": " this model prayer, that we would be mindful of praying for God's direction and for God's"
    },
    {
      "id": 74,
      "start": 1025.3600158691406,
      "end": 1031.4800109863281,
      "text": " deliverance with regards specifically to temptation and to evil. I'm mindful, we'll get to Genesis"
    },
    {
      "id": 75,
      "start": 1032.3999938964844,
      "end": 1036.0400085449219,
      "text": " 39 in just a moment, but turn to Proverbs chapter number 1, if you will, and let me"
    },
    {
      "id": 76,
      "start": 1036.0400085449219,
      "end": 1040.3999938964844,
      "text": " just share with you a thought from this portion of Scripture before we get there to Genesis"
    },
    {
      "id": 77,
      "start": 1040.3999938964844,
      "end": 1047.3999938964844,
      "text": " chapter 39. But in Proverbs chapter number 1, verse number 10, the Bible says, My son,"
    },
    {
      "id": 78,
      "start": 1053.6799926757812,
      "end": 1058.1600036621094,
      "text": " if sinners entice thee, consent thou not. If they say, Come with us, let us lay wait"
    },
    {
      "id": 79,
      "start": 1058.1600036621094,
      "end": 1063.0400085449219,
      "text": " for blood, let us lurk privily for the innocent without cause. Let us swallow them up alive"
    },
    {
      "id": 80,
      "start": 1063.0400085449219,
      "end": 1068.1000061035156,
      "text": " as the grave and whole as those that go down into the pit. We shall find all precious substance,"
    },
    {
      "id": 81,
      "start": 1068.1000061035156,
      "end": 1073.7200012207031,
      "text": " we shall fill our houses with spoil. Cast in thy lot among us, let us all have one purse."
    },
    {
      "id": 82,
      "start": 1073.7200012207031,
      "end": 1077.8399963378906,
      "text": " They're making it sound good, right? I mean, they're enticing you to do evil. And he tells"
    },
    {
      "id": 83,
      "start": 1077.8399963378906,
      "end": 1081.1199951171875,
      "text": " them, consent thou not. In verse number 10, he's telling them what they're going to say."
    },
    {
      "id": 84,
      "start": 1081.1199951171875,
      "end": 1084.7200012207031,
      "text": " Here's what they're going to say. Come with us and do these things. And this will be the"
    },
    {
      "id": 85,
      "start": 1084.7200012207031,
      "end": 1090.1199951171875,
      "text": " result. Verse 15, My son, walk not thou in the way with them. Refrain thy foot from"
    },
    {
      "id": 86,
      "start": 1090.1199951171875,
      "end": 1095.7200012207031,
      "text": " their path, for their feet run to evil and make haste to shed blood. Surely in vain the"
    },
    {
      "id": 87,
      "start": 1095.7200012207031,
      "end": 1100.9599914550781,
      "text": " net is spread in the sight of any bird. I'm mindful of this passage when I think about"
    },
    {
      "id": 88,
      "start": 1100.9599914550781,
      "end": 1104.9200134277344,
      "text": " the phraseology in verse number 10, when it says, If sinners entice thee, consent thou"
    },
    {
      "id": 89,
      "start": 1104.9200134277344,
      "end": 1111.4800109863281,
      "text": " not. We think about the temptation of our enemy. You know, he makes it look good. He"
    },
    {
      "id": 90,
      "start": 1111.4800109863281,
      "end": 1118.5999755859375,
      "text": " makes sin look desirable. He makes sin look like it's going to benefit us somehow. And"
    },
    {
      "id": 91,
      "start": 1118.5999755859375,
      "end": 1123.1600341796875,
      "text": " we find that he makes it look shimmery and shiny and makes it look appealing. And in"
    },
    {
      "id": 92,
      "start": 1123.1600341796875,
      "end": 1129.9199829101562,
      "text": " doing so, he's seeking to entice us to engage in whatever that particular sinful activity"
    },
    {
      "id": 93,
      "start": 1129.9199829101562,
      "end": 1136.52001953125,
      "text": " is. But when we're mindful of this model prayer, if we would pray in this fashion, if we would"
    },
    {
      "id": 94,
      "start": 1136.52001953125,
      "end": 1142.0800170898438,
      "text": " be mindful of that which the Lord is giving to the disciples, perhaps we would become"
    },
    {
      "id": 95,
      "start": 1142.0800170898438,
      "end": 1148.6799926757812,
      "text": " more actively aware of the escape routes that God would provide us with. And perhaps we"
    },
    {
      "id": 96,
      "start": 1148.6799926757812,
      "end": 1153.7200317382812,
      "text": " would face less temptation because we would be mindful on a more regular basis. And we"
    },
    {
      "id": 97,
      "start": 1153.7200317382812,
      "end": 1159.0,
      "text": " would be ready and prepared as we were praying in that fashion. Look at Genesis 39, and we'll"
    },
    {
      "id": 98,
      "start": 1159.0,
      "end": 1164.8400268554688,
      "text": " finish here this evening before we have our time of prayer. In Genesis chapter 39, a great"
    },
    {
      "id": 99,
      "start": 1164.8400268554688,
      "end": 1171.0800170898438,
      "text": " portion of Scripture with regard to the Bible character of Joseph, and of course we understand"
    },
    {
      "id": 100,
      "start": 1171.0800170898438,
      "end": 1178.280029296875,
      "text": " that he's there, and he's prospering, and God is blessing, and he's in Potiphar's house,"
    },
    {
      "id": 101,
      "start": 1178.280029296875,
      "end": 1183.280029296875,
      "text": " and the Lord blessed him, and the Lord blessed the Egyptians' house for Joseph's sake, according"
    },
    {
      "id": 102,
      "start": 1183.280029296875,
      "end": 1188.3599853515625,
      "text": " to verse number 5. But you find that the Bible says, notice verse 6, And he left all that"
    },
    {
      "id": 103,
      "start": 1188.3599853515625,
      "end": 1192.7999877929688,
      "text": " he had in Joseph's hand, speaking of Potiphar, and he knew not all he had, save the bread"
    },
    {
      "id": 104,
      "start": 1192.7999877929688,
      "end": 1197.280029296875,
      "text": " which he did eat. And Joseph was a goodly person, and well favored. And it came to pass"
    },
    {
      "id": 105,
      "start": 1197.280029296875,
      "end": 1199.8400268554688,
      "text": " after these things, that his master's wife cast her"
    },
    {
      "id": 0,
      "start": 1199.8400268554688,
      "end": 1203.0800268650055,
      "text": " eyes upon Joseph, and she said, Lie with me."
    },
    {
      "id": 1,
      "start": 1203.0800268650055,
      "end": 1209.320026397705,
      "text": " But he refused, and said unto his master's wife, Behold, my master wilteth not what is"
    },
    {
      "id": 2,
      "start": 1209.320026397705,
      "end": 1213.200026512146,
      "text": " with me in the house, and he hath committed all that he hath to my hand."
    },
    {
      "id": 3,
      "start": 1213.200026512146,
      "end": 1216.6000270843506,
      "text": " There is none greater in this house than I, neither hath he kept back anything from me"
    },
    {
      "id": 4,
      "start": 1216.6000270843506,
      "end": 1219.7600269317627,
      "text": " but thee, because thou art his wife."
    },
    {
      "id": 5,
      "start": 1219.7600269317627,
      "end": 1225.9600276947021,
      "text": " How then can I do this great wickedness and sin against God?\""
    },
    {
      "id": 6,
      "start": 1225.9600276947021,
      "end": 1229.5200271606445,
      "text": " I want you to notice in verse number 10, I mean, that's a good response from Joseph,"
    },
    {
      "id": 7,
      "start": 1229.5200271606445,
      "end": 1231.0000267028809,
      "text": " is it not?"
    },
    {
      "id": 8,
      "start": 1231.0000267028809,
      "end": 1232.8400268554688,
      "text": " Commendable response."
    },
    {
      "id": 9,
      "start": 1232.8400268554688,
      "end": 1236.9200286865234,
      "text": " It would have been evil, it would have been wicked for him to engage in this act that"
    },
    {
      "id": 10,
      "start": 1236.9200286865234,
      "end": 1242.720027923584,
      "text": " this Potiphar's wife desired for Joseph to engage in this activity."
    },
    {
      "id": 11,
      "start": 1242.720027923584,
      "end": 1244.2400283813477,
      "text": " It would be sinful, it would be wicked."
    },
    {
      "id": 12,
      "start": 1244.2400283813477,
      "end": 1248.8000259399414,
      "text": " He said, How can I do this great wickedness and sin against God?"
    },
    {
      "id": 13,
      "start": 1248.8000259399414,
      "end": 1253.2800254821777,
      "text": " What a great response from Joseph in this passage of Scripture."
    },
    {
      "id": 14,
      "start": 1253.2800254821777,
      "end": 1258.5200271606445,
      "text": " And sometimes when temptation comes in our lives, man, we are ready for it in the sense"
    },
    {
      "id": 15,
      "start": 1258.5200271606445,
      "end": 1262.9200286865234,
      "text": " of we've prayed, perhaps, and we're acknowledging it and we respond properly, but you understand"
    },
    {
      "id": 16,
      "start": 1262.9200286865234,
      "end": 1269.1200256347656,
      "text": " the devil doesn't just depart after one time of resisting that temptation, of providing"
    },
    {
      "id": 17,
      "start": 1269.1200256347656,
      "end": 1270.1200256347656,
      "text": " that answer."
    },
    {
      "id": 18,
      "start": 1270.1200256347656,
      "end": 1274.760025024414,
      "text": " In Luke chapter number 4, when the enemy, when the devil is tempting the Lord Jesus"
    },
    {
      "id": 19,
      "start": 1274.760025024414,
      "end": 1280.6800231933594,
      "text": " Christ, after the first response of Jesus, when Jesus said it is written, the devil didn't"
    },
    {
      "id": 20,
      "start": 1280.6800231933594,
      "end": 1282.3200302124023,
      "text": " just leave."
    },
    {
      "id": 21,
      "start": 1282.3200302124023,
      "end": 1285.3200302124023,
      "text": " He tempted him a second time, and then a third time."
    },
    {
      "id": 22,
      "start": 1285.3200302124023,
      "end": 1290.2000274658203,
      "text": " And I read verse number 12 of Luke 4, particularly this evening, because the Bible says that"
    },
    {
      "id": 23,
      "start": 1290.2000274658203,
      "end": 1297.8000259399414,
      "text": " he departed for a season, and we find that here in the life of Joseph, he responds properly."
    },
    {
      "id": 24,
      "start": 1297.8000259399414,
      "end": 1301.760025024414,
      "text": " But I want you to notice in verse number 10, it says, And it came to pass, as she spake"
    },
    {
      "id": 25,
      "start": 1301.760025024414,
      "end": 1303.8000259399414,
      "text": " to Joseph, what does it say?"
    },
    {
      "id": 26,
      "start": 1303.8000259399414,
      "end": 1305.8000259399414,
      "text": " Day by day."
    },
    {
      "id": 27,
      "start": 1305.8000259399414,
      "end": 1307.8000259399414,
      "text": " You know what the enemy tries to do?"
    },
    {
      "id": 28,
      "start": 1307.8000259399414,
      "end": 1311.0000305175781,
      "text": " He tries to wear you down."
    },
    {
      "id": 29,
      "start": 1311.0000305175781,
      "end": 1314.6400299072266,
      "text": " Bring that temptation day by day, day by day."
    },
    {
      "id": 30,
      "start": 1314.6400299072266,
      "end": 1316.3200302124023,
      "text": " Wear you down."
    },
    {
      "id": 31,
      "start": 1316.3200302124023,
      "end": 1324.160026550293,
      "text": " Somebody said that the enemy, the devil, will go by your door, quote-unquote, every day,"
    },
    {
      "id": 32,
      "start": 1324.160026550293,
      "end": 1329.0800323486328,
      "text": " go by it a thousand times to find it cracked just once."
    },
    {
      "id": 33,
      "start": 1329.0800323486328,
      "end": 1334.0800323486328,
      "text": " And the analogy or the imagery that they were using in making that statement is that, listen,"
    },
    {
      "id": 34,
      "start": 1334.0800323486328,
      "end": 1339.4400329589844,
      "text": " though we have responded properly and though we've walked in the Spirit, we must understand"
    },
    {
      "id": 35,
      "start": 1339.4400329589844,
      "end": 1342.6000213623047,
      "text": " that the enemy is going to continue to come, and it says, day by day, that he hearkened"
    },
    {
      "id": 36,
      "start": 1342.6000213623047,
      "end": 1345.0000305175781,
      "text": " not unto her, to lie by her, to be with her."
    },
    {
      "id": 37,
      "start": 1345.0000305175781,
      "end": 1349.800033569336,
      "text": " And it came to pass about this time that Joseph went into the house to do his business, and"
    },
    {
      "id": 38,
      "start": 1349.800033569336,
      "end": 1353.2400207519531,
      "text": " there was none of the men of the house there within."
    },
    {
      "id": 39,
      "start": 1353.2400207519531,
      "end": 1359.6000213623047,
      "text": " And so we find that verse number 12 tells us that she was going to capitalize on this"
    },
    {
      "id": 40,
      "start": 1359.6000213623047,
      "end": 1363.7000274658203,
      "text": " opportunity, if you will, and it says that she caught him by his garment, saying, Lie"
    },
    {
      "id": 41,
      "start": 1363.7000274658203,
      "end": 1364.7000274658203,
      "text": " with me."
    },
    {
      "id": 42,
      "start": 1364.7000274658203,
      "end": 1369.5600280761719,
      "text": " And he left his garment in her hand and fled and got him out."
    },
    {
      "id": 43,
      "start": 1369.5600280761719,
      "end": 1375.1200256347656,
      "text": " I've often said, as I've looked at verse number 12 of Genesis 39, that Joseph lost"
    },
    {
      "id": 44,
      "start": 1375.1200256347656,
      "end": 1378.2000274658203,
      "text": " his coat, but he retained his character."
    },
    {
      "id": 45,
      "start": 1378.2000274658203,
      "end": 1385.280029296875,
      "text": " It was far better for Joseph to spend time in prison, falsely accused, than to have engaged"
    },
    {
      "id": 46,
      "start": 1385.280029296875,
      "end": 1386.6000213623047,
      "text": " in that sinful behavior."
    },
    {
      "id": 47,
      "start": 1386.6000213623047,
      "end": 1387.6000213623047,
      "text": " Amen?"
    },
    {
      "id": 48,
      "start": 1387.6000213623047,
      "end": 1390.040023803711,
      "text": " You say, well, that's not so great, being in prison."
    },
    {
      "id": 49,
      "start": 1390.040023803711,
      "end": 1392.8400268554688,
      "text": " I understand, but we're going to stand before God."
    },
    {
      "id": 50,
      "start": 1393.8400268554688,
      "end": 1400.2400207519531,
      "text": " It'd be better to be falsely accused and suffer, not for wrongdoing, but suffer for being wrongly"
    },
    {
      "id": 51,
      "start": 1400.2400207519531,
      "end": 1403.1600341796875,
      "text": " accused and being right with God."
    },
    {
      "id": 52,
      "start": 1403.1600341796875,
      "end": 1408.040023803711,
      "text": " And we understand that God knew all that was going on, and God had a plan, and we're familiar"
    },
    {
      "id": 53,
      "start": 1408.040023803711,
      "end": 1414.040023803711,
      "text": " with, of course, the life of Joseph and all that comes to pass, and the way in which God's"
    },
    {
      "id": 54,
      "start": 1414.040023803711,
      "end": 1415.3200225830078,
      "text": " plan was working out."
    },
    {
      "id": 55,
      "start": 1415.3200225830078,
      "end": 1418.9200286865234,
      "text": " You understand in our lives, and I don't want to get too off track from what the subject"
    },
    {
      "id": 56,
      "start": 1418.9200286865234,
      "end": 1422.6800231933594,
      "text": " matter is this evening, but God has a plan."
    },
    {
      "id": 57,
      "start": 1422.6800231933594,
      "end": 1427.6400299072266,
      "text": " And if Joseph didn't end up in that prison, I'm not so sure that he would have met the"
    },
    {
      "id": 58,
      "start": 1427.6400299072266,
      "end": 1429.1200256347656,
      "text": " butler or the baker."
    },
    {
      "id": 59,
      "start": 1429.1200256347656,
      "end": 1430.1200256347656,
      "text": " Right?"
    },
    {
      "id": 60,
      "start": 1430.1200256347656,
      "end": 1437.280029296875,
      "text": " And if he didn't meet the butler, perhaps it would not have been possible for Pharaoh,"
    },
    {
      "id": 61,
      "start": 1437.280029296875,
      "end": 1439.800033569336,
      "text": " when he had a dream, to say, hey, who's going to interpret?"
    },
    {
      "id": 62,
      "start": 1439.800033569336,
      "end": 1440.800033569336,
      "text": " You know?"
    },
    {
      "id": 63,
      "start": 1440.800033569336,
      "end": 1444.280029296875,
      "text": " And so we begin to look at how God is God."
    },
    {
      "id": 64,
      "start": 1444.280029296875,
      "end": 1448.040023803711,
      "text": " But as we look at the subject matter which we're dealing with this evening, you find"
    },
    {
      "id": 65,
      "start": 1448.1600341796875,
      "end": 1451.6800231933594,
      "text": " that Joseph responds properly to this temptation."
    },
    {
      "id": 66,
      "start": 1451.6800231933594,
      "end": 1457.9600219726562,
      "text": " The temptation came on one particular day, and then it came day by day, day by day, and"
    },
    {
      "id": 67,
      "start": 1457.9600219726562,
      "end": 1461.6000366210938,
      "text": " she kept saying, lie with me, lie with me, and then she tries to seize the opportunity"
    },
    {
      "id": 68,
      "start": 1461.6000366210938,
      "end": 1466.0800170898438,
      "text": " when there's no one else around, and Joseph got himself out of the situation."
    },
    {
      "id": 69,
      "start": 1466.0800170898438,
      "end": 1474.9600219726562,
      "text": " There's a little kid's song, Put On Your Running Shoes, and the thought of fleeing from temptation,"
    },
    {
      "id": 70,
      "start": 1474.9600219726562,
      "end": 1481.0400390625,
      "text": " fleeing from youthful lust, and we see that as Paul would say that truth to Timothy."
    },
    {
      "id": 71,
      "start": 1481.0400390625,
      "end": 1485.4000244140625,
      "text": " And this evening, when we think about the model prayer as it ends here in Luke 11, in"
    },
    {
      "id": 72,
      "start": 1485.4000244140625,
      "end": 1489.7200317382812,
      "text": " verse number 4, and we've looked at all of these phrases, and we've studied through this,"
    },
    {
      "id": 73,
      "start": 1489.7200317382812,
      "end": 1494.8200378417969,
      "text": " and we come to this last section when it says, lead us not into temptation, but deliver us"
    },
    {
      "id": 74,
      "start": 1494.8200378417969,
      "end": 1495.8200378417969,
      "text": " from evil."
    },
    {
      "id": 75,
      "start": 1495.8200378417969,
      "end": 1502.1000366210938,
      "text": " And we think about God's direction and God's deliverance, not generally speaking, but specifically"
    },
    {
      "id": 76,
      "start": 1502.1000366210938,
      "end": 1506.5400390625,
      "text": " with regard to temptation and to evil."
    },
    {
      "id": 77,
      "start": 1506.5400390625,
      "end": 1513.1000366210938,
      "text": " And again, as I mentioned a moment ago, if we would follow the framework of this model"
    },
    {
      "id": 78,
      "start": 1513.1000366210938,
      "end": 1516.1800231933594,
      "text": " prayer, we would be mindful of many things."
    },
    {
      "id": 79,
      "start": 1516.1800231933594,
      "end": 1521.6200256347656,
      "text": " I mentioned a whole list of those as we started our message this evening, recapping the first"
    },
    {
      "id": 80,
      "start": 1521.6200256347656,
      "end": 1528.1400146484375,
      "text": " few verses of this portion of Scripture and how we would be mindful of those great truths."
    },
    {
      "id": 81,
      "start": 1528.1400146484375,
      "end": 1532.02001953125,
      "text": " But as we finish this evening, we would be mindful of temptation."
    },
    {
      "id": 82,
      "start": 1532.02001953125,
      "end": 1534.5400390625,
      "text": " You'd be aware, listen, the devil's going to try to tempt me today."
    },
    {
      "id": 83,
      "start": 1534.5400390625,
      "end": 1537.3400268554688,
      "text": " He's going to try to tempt you today."
    },
    {
      "id": 84,
      "start": 1537.3400268554688,
      "end": 1543.5800170898438,
      "text": " He's going to try to tempt you when you go home in just a little while, right?"
    },
    {
      "id": 85,
      "start": 1543.5800170898438,
      "end": 1544.9000244140625,
      "text": " He wants to cause us to sin."
    },
    {
      "id": 86,
      "start": 1544.9000244140625,
      "end": 1547.3000183105469,
      "text": " He wants us to have hindered fellowship."
    },
    {
      "id": 87,
      "start": 1547.3000183105469,
      "end": 1555.2600402832031,
      "text": " He wants us to lose our testimony with those that we're seeking to share the gospel with."
    },
    {
      "id": 88,
      "start": 1555.2600402832031,
      "end": 1560.5000305175781,
      "text": " You think about David and his great sin with Bathsheba, it brought reproach against the"
    },
    {
      "id": 89,
      "start": 1560.5000305175781,
      "end": 1566.9000244140625,
      "text": " name of God that the enemy could speak ill of."
    },
    {
      "id": 90,
      "start": 1566.9000244140625,
      "end": 1573.9800415039062,
      "text": " You begin to consider this prayer of direction or for direction and deliverance, oh, that"
    },
    {
      "id": 91,
      "start": 1573.9800415039062,
      "end": 1580.6200256347656,
      "text": " we would be mindful this evening that we have an enemy, but we have a God who is faithful."
    },
    {
      "id": 92,
      "start": 1580.6200256347656,
      "end": 1586.02001953125,
      "text": " He's not going to suffer us, allow us to be tempted above that which we are able."
    },
    {
      "id": 93,
      "start": 1586.02001953125,
      "end": 1589.5800170898438,
      "text": " He says that He'll also provide a way to escape."
    },
    {
      "id": 94,
      "start": 1589.6600341796875,
      "end": 1593.9800415039062,
      "text": " And I think as God's people, we need to be more, and if we'd be praying in this fashion,"
    },
    {
      "id": 95,
      "start": 1593.9800415039062,
      "end": 1601.1000366210938,
      "text": " in this manner, maybe we'd be more actively engaged in looking for the escape route."
    },
    {
      "id": 96,
      "start": 1601.1000366210938,
      "end": 1607.6200256347656,
      "text": " Because we've been mindful to pray for the direction, lead us not into temptation, deliver"
    },
    {
      "id": 97,
      "start": 1607.6200256347656,
      "end": 1612.3400268554688,
      "text": " us from evil, amen?"
    },
    {
      "id": 98,
      "start": 1612.3400268554688,
      "end": 1618.3400268554688,
      "text": " A prayer for direction and a prayer for deliverance, oh, that God would help us to walk wholly."
    },
    {
      "id": 99,
      "start": 1618.3400268554688,
      "end": 1624.5400390625,
      "text": " That we'd be holy in all matter of conversation, according to what He says in 1 Peter 1."
    },
    {
      "id": 100,
      "start": 1624.5400390625,
      "end": 1625.5400390625,
      "text": " Let's pray together."
    },
    {
      "id": 101,
      "start": 1625.5400390625,
      "end": 1627.1400146484375,
      "text": " Father, we love You."
    },
    {
      "id": 102,
      "start": 1627.1400146484375,
      "end": 1629.5800170898438,
      "text": " Thank You for loving us."
    },
    {
      "id": 103,
      "start": 1629.5800170898438,
      "end": 1635.02001953125,
      "text": " We know that we have an enemy, and we know that the enemy, even as he tempted the Lord"
    },
    {
      "id": 104,
      "start": 1635.02001953125,
      "end": 1640.5400390625,
      "text": " Jesus Christ there in the wilderness, he seeks to tempt us to do evil, to sin, that it might"
    },
    {
      "id": 105,
      "start": 1640.5400390625,
      "end": 1647.5000305175781,
      "text": " hinder our walk with Thee, adversely impact our testimony for Thee."
    },
    {
      "id": 106,
      "start": 1647.5000305175781,
      "end": 1654.0600280761719,
      "text": " God, I pray that You'd help us as we see and conclude this model prayer this evening, to"
    },
    {
      "id": 107,
      "start": 1654.0600280761719,
      "end": 1661.02001953125,
      "text": " be mindful of the work of the enemy."
    },
    {
      "id": 108,
      "start": 1661.02001953125,
      "end": 1669.5800170898438,
      "text": " God that You would help us to be aware of and mindful of the promise that You've given"
    },
    {
      "id": 109,
      "start": 1669.5800170898438,
      "end": 1674.1000366210938,
      "text": " us there in 1 Corinthians 10 and verse 13."
    },
    {
      "id": 110,
      "start": 1674.1000366210938,
      "end": 1678.2600402832031,
      "text": " God that we would actively look for the escape route when that temptation comes, because"
    },
    {
      "id": 111,
      "start": 1678.2600402832031,
      "end": 1683.3800354003906,
      "text": " we've prayed for deliverance, deliver us from evil."
    },
    {
      "id": 112,
      "start": 1683.3800354003906,
      "end": 1687.6200256347656,
      "text": " We do thank You for the privilege of corporate prayer, and I pray that as we now enter into"
    },
    {
      "id": 113,
      "start": 1687.6200256347656,
      "end": 1693.5000305175781,
      "text": " this time of our service, as we pray one with another, that Lord, You'd be glorified."
    },
    {
      "id": 114,
      "start": 1693.5000305175781,
      "end": 1697.1000366210938,
      "text": " We'll thank You for all that You'll do, for it's in Christ's name we pray, amen."
    },
    {
      "id": 115,
      "start": 1697.4200134277344,
      "end": 1701.4200134277344,
      "text": " Does anyone need a prayer bulletin this evening?"
    },
    {
      "id": 116,
      "start": 1701.4200134277344,
      "end": 1701.9000244140625,
      "text": " Anyone need one?"
    }
  ],
  "processed_at": "2025-04-17T06:57:50.064753"
}