{
  "video_id": "OcBw3vCuyDU",
  "text": "If you will, and turn to the book of Philemon, and be looking at just a verse of Scripture here from the book of Philemon. And I won't be dealing with the whole thought of that which is developed here in the book of Philemon. There's only one chapter, so turn to chapter number one, amen? And we'll look here at just a verse of Scripture. I hope to be a blessing to you this evening as we think about this truth that is given to us. The Apostle Paul had the privilege to serve in many regions during his ministry. In fact, as you trace the steps of Paul, if you begin to look through the book of Acts and trace the missionary journeys, the first, second, and third, you begin to see the regions in which God enabled and allowed the Apostle Paul to serve and to minister. And along the way, he had the opportunity to meet a whole lot of people. And he had people that he was able to meet that, of course, were the enemies, the opposition, those that opposed him. And occasionally he mentions those folks, but there are a lot of people that he had the opportunity to serve God with. And as he would serve and as he would minister in various regions, God would allow him to have those relationships established. In fact, as you read through the New Testament, and you have the opportunity to read many of the books that God has allowed the Apostle Paul to be the human penman of, that you have the privilege of reading of several of those names that are mentioned. In fact, you can look at the end of many of the epistles and see where the Apostle will mention people by name, specifically. Sometimes he gives us some information about them. Sometimes there's not a whole lot that's given to us, but names are provided. It's interesting if you were to read Romans 16, that is an especially lengthy portion of Scripture with a lot of names that are provided of these people that God allowed the path of the Apostle Paul to cross with and to serve alongside of. And of course, in many cases, to minister to them, but also to minister along with them. The name Archippus is found both here in the book of Philemon. It's also found over in the book of Colossians. And we'll look at both passages of Scripture this evening. Notice in verse number one of the book of Philemon, the Bible says, Paul, a prisoner of Jesus Christ, and Timothy, our brother, unto Philemon, our dearly beloved and fellow laborer. And he says this, and to our beloved Athia and Archippus, our fellow soldier, and to the church in thy house, grace to you and peace from God our Father and the Lord Jesus Christ. Right in the beginning of the letter, we find that God gives us an understanding as to the time of the writing of this short letter that is sent, of course, to Philemon and also to Athia and Archippus, as it's mentioned in verse number two. As we would consider the timing of the letter, he says that Paul, a prisoner of Jesus Christ. We understand many of the epistles we would refer to as the prison epistles, and this letter, along with the book of Colossians that we'll reference this evening as well, they were both written, they're both referred to as these prison epistles that were written around the same time from the same location during Paul's first confinement there in Rome. And so we understand a little bit of background about what God is giving us with regard to the timing of the writing and who he's writing to. We're not going to deal with really the thought and the full message of the book of Philemon. In fact, if you go back and read through it, you'll see a beautiful picture that is given to us with regard to this one on Onesimus and all that took place and how in the past he was unprofitable, but now he's profitable. Why? Because he's been saved. And great message, but not the message for this evening. The message for this evening, we're going to focus on this one, Archippus. Notice the Bible tells us, and we're going to use it for our title this evening, look at it, it says, and to our beloved Athia, and Archippus, our fellow soldier. Archippus, our fellow soldier, is the title for the message this evening. I want you to notice, first of all, if you're taking notes, notice how this man is identified. We've read it there in verse number two, he's identified as a fellow soldier. I like that terminology. I like the picture that you get in your mind when you read that description, that identifying name title, if you will, that is given. The Bible says, now, and Archippus, our fellow soldier. It's interesting to me that the title, if I could use that terminology this evening, of fellow soldier, that the Apostle Paul only refers to two people in all of the Scriptures with that title. We read about being a good soldier, and so on and so forth, and we'll reference some of that this evening, but there are two people specifically that he mentions as being fellow soldiers. We notice in the first verse of Philemon, that as he speaks about Philemon, he uses this terminology, our dearly beloved and fellow laborer. I'm thankful that he was a co-laborer, a fellow laborer, and in that word is used, we find that Paul says there in the church in Corinth, as he's ministering to them, of course, the divisions and schisms and all that was taking place in Corinth, and I'm of Paul, and I'm of Cephas, and I'm of Apollos, and so on and so forth, and Paul says, we're just laborers together with God. And in chapter number three of 1 Corinthians, what a great perspective to have. But this title that we find here that is given as an identifier, if you will, for Archippus is fellow soldier. It is used also of speaking of Epaphroditus. Turn back to the book of Philippians, if you will, in chapter number two of the book of Philippians. Now, Epaphroditus was a man we believe most likely the pastor of the church there in Philippi. He speaks about him as being a companion in labor, my brother, but notice in Philippians two, in verse number 25, it says, yet I supposed it necessary to send to you Epaphroditus, my brother and companion in labor, and fellow soldier, but your messenger, and he that ministered to my wants. It's commonly believed that as the church at Philippi collected this offering to assist the apostle Paul, that it was taken, delivered to Paul by the hand of Epaphroditus, and he took that as the messenger of the church, he brought that offering to the apostle Paul, and then Paul would deliver this letter back to the church at Philippi by the hands of Epaphroditus. And we find here that he's referred to as fellow soldier. And again, it's Epaphroditus and this one, Archippus. It's interesting because this title reveals to me the fact that they were engaged in battle. You immediately get in your mind when you read that title, that term that is ascribed to Archippus here, the way in which he's identified, we see this fellow soldier, he's engaged in the battle. The battle that he's engaged in though is a spiritual battle. And the reality this evening is that each and every one of us are engaged in a spiritual battle. We see this spiritual battle, this spiritual warfare that Paul speaks of to the believers in the book of Ephesians there as they're ministering in the city of Ephesus and that church that is there and ministering and serving. And Paul tells them, listen, we are engaged in spiritual warfare. And the reality is that if you have any sense about you, and I don't say that to be condescending, you can obviously, without hesitation, identify today that we're in the midst of spiritual warfare. I mean, the spiritual battle that is raging. And we find that this man, Archippus, not to say that others weren't fellow soldiers, but it's interesting that there's just a couple of people that are given, that are spoken of in this term. You find often that the Apostle Paul, when he speaks about Timothy, how does he refer to Timothy? My son in the faith. He refers to Titus in like manner. In fact, he speaks of Onesimus in that fashion as well. But we find that there's a purpose. We believe that every word of God is pure. And the Bible says that all Scripture is given by inspiration of God. And God led the Apostle Paul to use this term, this title, in identifying this one, Archippus. Now, the reality is that Paul had spoken to Timothy about the importance of understanding our place as being a soldier and what it means to be a good soldier. Notice if you will, over in 2 Timothy chapter number 2, I'm going to draw your attention quickly this evening to just the first four verses of this passage of Scripture. And I want you to just get the instruction that Paul is leaving for Timothy, of course, by way of preservation for us as well to this day. He says this in verse number 1 of 2 Timothy 2, Thou, therefore, my son, be strong in the grace that is in Christ Jesus. The things that thou hast heard of me among many witnesses, the same commit thou to faithful men who shall be able to teach others also. He says this, Thou, therefore, endure hardness as a good soldier of Jesus Christ. He says, No man that woreth and tangleth himself with the affairs of this life, that he may please him who hath chosen him to be a soldier. Who's that? Well, that's the Lord. Amen? You trust that Christ is your personal Savior. You are enlisted in the Lord's army. Amen? You became a soldier of Jesus Christ. We find that we sing the song with the kids about being in the Lord's army, right? And we have fun with singing that. We sing. songs about onward Christian soldier right and we understand some of the songwriters that have taken up on this thought of being a soldier and this is an analogy an illustration that is used to help us understand this this Christian life that we're living in this battle in which were engaged in and Paul says to Timothy that that you might be a good soldier that you may please him who have chosen him to be a soldier wonder this evening as we would think about this title that is given to Archippus in our text of Scripture the way in which he is identified I wonder this evening if someone would say of me if someone would say of you there are fellow soldier a fellow soldier I wonder this evening if we understand really the the spiritual warfare in battle that we are engaged in the truth of Ephesians 6 is a powerful truth that we must be mindful of on a regular basis we spoke of course of the theme for 2019 be strong the Lord I preached to the whole book of Ephesians we belabored the point but it's good to be reminded of the fact that we're engaged in spiritual warfare and we wrestle not against flesh and blood we're to put on the whole armor of God by the way that's not a one-and-done situation that is an everyday sometimes you might have to go put the armor on again because something happened as you were engaged in battle and you you have to understand the importance of this battle that we're in and Paul says as he refers to this one this co-laborer but more than that a fellow soldier we notice how he's identified I want you to notice over the book of Colossians how he is instructed the book of Colossians gives us some some information at the end of the book again I mentioned how that many times I said this by way of introduction that you get to the end of some of these epistles that God allowed Paul to be the human penman of and you see a reference to a number of individuals people that he served and ministered to people that he served alongside of and we find that beginning in Colossians 4 and verse number 7 is where you begin to see a number of those names that will be mentioned throughout the end of this particular passage of Scripture names that Paul mentions we get down to verse number 17 and it says this notice and say to Archippus so so this is this interesting to me because really he says just catch it in context notice in verse number 7 all my states shall take a kiss declare unto you who is a beloved brother and faithful minister and fellow servant the Lord verse 9 with Onesimus a faithful and beloved brother who's one of you they shall make known unto all things which are done here we see that he mentions about others he goes through and he speaks of them favorably and about their labor and their service but when he comes to verse number 17 and he's going to speak about Archippus he says and say to Archippus there's some instruction that I want to make sure it gets delivered to this one this fellow soldier that's engaged in the battle there's some instruction that I want to make sure it gets to him see with the other folks that are mentioned there's not necessarily a piece of information that is to be given to them as much as there's a description as to how they're engaged in the work and what they're doing and their faithfulness and we notice that Paul says this notice what he says we're gonna break the statement down number one he says take heed to the ministry now we're going to pause right there I know that's not the fullness of the thought but we're just gonna pause there for just a moment and this idea of taking heed to to discern to understand to have a knowledge of and he says take heed but notice what he says he could have stopped again every word of God is pure take heed to the ministry notice how it's described which thou hast received in the Lord now let me ask you do those words that are given after ministry don't you think those are important words he didn't just stop take heed to the ministry he says take heed to the ministry which thou hast received in the Lord I think about the message that would be delivered I believe that the recipients here would have faithfully taken and delivered this message and say to archivist okay here's the message for you it's been contained and preserved for us so that we can read it and be encouraged by it and be challenged by it but we find that as he would receive those words when when it says take heed to the ministry and then which thou hast received in the Lord it's the Lord that calls us to the ministry it's the Lord that equips us for the work of the ministry it's the Lord who enables us we find that as we would understand the truth of spiritual gifts within the the Church of God and we'd understand how the Holy Spirit of God gifts each individual believer as he will amen and he's the one that gives you and equips you for the work of the ministry for the the work that God has called us to now this one archivist he may have had a particular position there's some that have the idea that he may have been a pastor of a church and whatever the particular ministry may have been that he was engaged in we find that the Apostle Paul in delivering this message of taking heed to the ministry which now has received in the Lord is reminding him that he had been called by God they've been given this ministry by the Lord I think about the words of Paul when he says this and and you can just let me read the verse to you but in first Timothy 1 in verse number 12 Paul says and I thank Christ Jesus our Lord who hath enabled me for that he counted me faithful putting me into the ministry see Paul understood that he was called by God in fact as you read through many of the epistles and that that Paul was the human penman for you'll find that he references the call that God has placed upon his life in those introductory statements in fact here in first Timothy 1 in verse number 1 Paul says this he says Paul an apostle of Jesus Christ by the commandment of God our Savior and Lord Jesus Christ which is our hope we find that Paul understood something about the ministry he understood that he was called by God and now as he's giving this word to archivist is he giving this instruction he says take heed to the ministry which thou hast received in the Lord then notice this last phrase that thou fulfill it that thou fulfill it see whether this man quit or was just simply tempted to quit is really not certain in fact the only two verses of Scripture that we have specifically about this man archivist or the two that we've looked at this evening Philemon one verse number two and here in Colossians 4 and verse number 17 theologians of yesteryear have spun theories about whether or not he quit the ministry and got off track and so on and so forth the reality is that we don't know factually biblically speaking but I can tell you this that when you're engaged in spiritual battle when you're a fellow soldier there's some things that come in your life that cause you to consider walking away quitting giving up is it worth it and Paul whether this one archivist whether he was just facing this time of maybe difficulty and discouragement maybe he was tempted with the idea of not continuing it's just not worth it it's too challenging it's too difficult you don't know what I've had to deal with again we don't know all of that but Paul having obviously under the inspiration of the Holy Spirit but having an understanding of this man and in writing this and giving this instruction he says that thou fulfill it the importance of completion the importance of finishing the importance of understanding that that we that as we serve God that we're serving God and that as we run our race we're not running our race to compete against one another we're running our own race and as we're running our race our goal is to finish in fact Paul said this to the believers that he is writing to in the region of Galatia of course there's been many things that had taken place and the Judaizers that came in and all of the false teaching and he asks him this question he says ye did run well who did hinder you that you should not obey the truth in Galatians 5 and verse number 7 I love the testimony of the Apostle Paul you come to the book of 2nd Timothy chapter number 4 of course we're familiar with the passage of Scripture we understand how that he's writing to to Timothy and he begins to share this testimony of course he's given Timothy these final words of instruction these words of instruction by the way are are really summed up in in this idea continue continue I mean if you read the third chapter of the book of 2 Timothy, you begin to read about the perilous times that shall come, and Paul starts it this way by saying, this know also. Remember, Paul often as he writes, he will speak of, you know, I would not that you be ignorant, brother. I want you to know something. I want you to be informed of something. And here he says to Timothy, this know also, then the last days perilous times shall come. And by the way, he begins to go through and to explain some of these things and give some descriptions as to what would be endured and what would be experienced. He tells them in v. 12, yea, and all that will live godly in Christ Jesus shall suffer persecution. Can I tell you that the persecution in which the first century believers faced and endured is different than anything any of us have ever experienced. He says evil men and seducers shall wax worse and worse deceiving and being deceived. Then notice what he says in v. 14. But continue. But continue thou in the things which thou hast learned and been assured of, knowing of whom thou hast learned them. And he goes through and he begins to give this charge to Timothy to continue. Yea, these things are going to happen. We're going to face opposition. We're in a battle. We're in spiritual warfare. You're a fellow soldier. I know sometimes in the battle it gets hard. I know sometimes in the battle it gets overwhelming. That thou fulfill it. Continue. Be faithful. The Scriptures speak about being faithful unto death. Being faithful unto the end. Paul says this. He gives him the charge in v. 1 of chapter 4 about preaching the Word of God. He says in v. 2, Preach the Word, be instant in season, out of season, reprove, rebuke, exhort, with all longsuffering and doctrine. He tells them, hey, the time's going to come when they're not going to endure sound doctrine. Right? Why? Because after their own lusts shall they heap to themselves teachers having itching ears. We see this stuff. I mean, this is where we live. He says in v. 6 as we get to the point of Paul's testimony, he had given this instruction to this one archipis, he says, Take heed to the ministry which thou hast received in the Lord, that thou fulfill it. And Paul's personal testimony is given to us in v. 6-7 of 2 Timothy 4, where I am now ready to be offered. The time of my departure is at hand. I have fought a good fight. I love it. I have finished my course. I have kept the faith. We're familiar with the verses of Scripture. We reference them often. But I want you to really think about the testimony of Paul. And I want you to think about the instruction that he's given here in Colossians 4 and v. 17 as he's closing this book, as he's closing, and he mentions several people by name, and he goes through many different attributes of these people and what they were engaged in and what they were doing, but he says, And say to archipis, Take heed to the ministry which thou hast received in the Lord, that thou fulfill it. Archipis, don't give up. You're a fellow soldier. I know you're in the battle. Sometimes when you're in the trenches of the battle, like I've never been a soldier in the U.S. Armed Forces of any branch, but I can only imagine. You read some of those stories about some of the wars that our nation has been engaged in throughout our history. If you're a history buff and you've read accounts of battles that have taken place in other portions of the world history, and you begin to see what's happening, and you think about those fellow soldiers, and you think about some of the things that they experienced, some of the difficulties in which they endured, and Paul says, Archipis, take heed to this ministry which you've received in the Lord, that thou fulfill it. I hope this evening that sometimes when we're engaged in the battle, we can become overwhelmed. By the way, if you watch too much news, you're gonna be overwhelmed in a hurry. I'm just telling you. You're gonna be overwhelmed in a hurry. The enemy wants to get your mind. It really does. Can I remind you that we're on the winning side? We're more than conquerors in Christ, but thanks be to God which giveth us the victory through our Lord Jesus Christ, amen? We're fellow soldiers. By the way, I think about this term. It's been said by many throughout the history, really, of Christianity where, I shouldn't say the entire history, the recent history, I guess I should say it that way, that far too often as a soldier, as a fellow believer is wounded that we kick our own wounded. It ought not be that way, brethren. We're fellow soldiers. We wanna encourage them that thou fulfill it. See, because you have a race that you're running, and as we run our race, we're not competing with one another. We're simply striving to please him who's called us to be a soldier. And what a blessing. To think about this really obscure Bible character, archivist, we don't know a whole lot about him, but Paul says, I wanna get a message to him. Again, I don't know all of the circumstances surrounding this man's ministry and all that he was dealing with, but can I tell you today, that I get reports, I get phone calls, I read articles about people in the ministry that quit every single day. Hundreds. It's sad. I don't know the reason for all of them. There's no way I could. I don't know the real reason for many of them, to be real honest with you. But I do know this. I've heard people say something like this. It's just too much. It's too hard. I had one man, I tried to encourage him, and I used this terminology. He was ready to quit. I mean, he had dealt with a bad situation. And I said to this man, as I spoke to him on the phone, I said, listen, brother, you're at a crossroads. Don't be discouraged. Keep your eyes on Jesus. He's got a plan. We don't understand all this mess that you're dealing with right now, but we know that the enemy's at work. Keep your eyes on Jesus, and just understand that you're at a crossroads. Here's what his words were. He said, no, I'm at a dead end. It hurt. Because his perspective was, I'm done with this. It's too much. And that's exactly what the enemy wants to do. Right? That's what he wants to do. And so Paul says, deliver this message to Archippus. He's a fellow soldier. That's how he's identified, but he's instructed. Take heed to the ministry which thou hast received in the Lord, that thou fulfill it. Father, we love you. We thank you for loving us. God, we thank you for your word. Lord, we know that we're engaged in spiritual battle and spiritual warfare. Lord, we know that you've given us in thy word truth with regard to the last days and the things that will endure. God, I pray that you'd help us to be strong in the Lord and the power of his might. Help us, God, to understand that we need to put on the whole armor of God. Help us to understand that we wrestle not against flesh and blood. The weapons of our warfare are not carnal. They're spiritual. Help us, God, to understand that you have called us to be a soldier. Help us to be a good soldier. Help us to fulfill. To finish. To complete our race. I pray that you would work in each heart, in each individual. Lord, help us to just keep our eyes on Jesus. We know that the enemy is ruthless, relentless. He's walking about seeking whom he may devour. But God, we're on the winning side. More than conquerors through Christ. Thank you for the victory that is possible only through the Lord Jesus Christ. Work in hearts and lives. Help us, Lord. We'll thank you for it. In Christ's name we pray, amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.960000038146973,
      "text": " If you will, and turn to the book of Philemon, and be looking at just a verse of Scripture"
    },
    {
      "id": 1,
      "start": 4.960000038146973,
      "end": 6.760000228881836,
      "text": " here from the book of Philemon."
    },
    {
      "id": 2,
      "start": 6.760000228881836,
      "end": 10.319999694824219,
      "text": " And I won't be dealing with the whole thought of that which is developed here in the book"
    },
    {
      "id": 3,
      "start": 10.319999694824219,
      "end": 11.319999694824219,
      "text": " of Philemon."
    },
    {
      "id": 4,
      "start": 11.319999694824219,
      "end": 14.680000305175781,
      "text": " There's only one chapter, so turn to chapter number one, amen?"
    },
    {
      "id": 5,
      "start": 14.680000305175781,
      "end": 17.719999313354492,
      "text": " And we'll look here at just a verse of Scripture."
    },
    {
      "id": 6,
      "start": 17.719999313354492,
      "end": 22.760000228881836,
      "text": " I hope to be a blessing to you this evening as we think about this truth that is given"
    },
    {
      "id": 7,
      "start": 22.760000228881836,
      "end": 23.760000228881836,
      "text": " to us."
    },
    {
      "id": 8,
      "start": 23.760000228881836,
      "end": 28.479999542236328,
      "text": " The Apostle Paul had the privilege to serve in many regions during his ministry."
    },
    {
      "id": 9,
      "start": 28.479999542236328,
      "end": 32.52000045776367,
      "text": " In fact, as you trace the steps of Paul, if you begin to look through the book of Acts"
    },
    {
      "id": 10,
      "start": 32.52000045776367,
      "end": 38.08000183105469,
      "text": " and trace the missionary journeys, the first, second, and third, you begin to see the regions"
    },
    {
      "id": 11,
      "start": 38.08000183105469,
      "end": 43.52000045776367,
      "text": " in which God enabled and allowed the Apostle Paul to serve and to minister."
    },
    {
      "id": 12,
      "start": 43.52000045776367,
      "end": 47.7599983215332,
      "text": " And along the way, he had the opportunity to meet a whole lot of people."
    },
    {
      "id": 13,
      "start": 47.7599983215332,
      "end": 52.959999084472656,
      "text": " And he had people that he was able to meet that, of course, were the enemies, the opposition,"
    },
    {
      "id": 14,
      "start": 52.959999084472656,
      "end": 54.400001525878906,
      "text": " those that opposed him."
    },
    {
      "id": 15,
      "start": 54.400001525878906,
      "end": 58.2400016784668,
      "text": " And occasionally he mentions those folks, but there are a lot of people that he had"
    },
    {
      "id": 16,
      "start": 58.2400016784668,
      "end": 61.52000045776367,
      "text": " the opportunity to serve God with."
    },
    {
      "id": 17,
      "start": 61.52000045776367,
      "end": 68.36000061035156,
      "text": " And as he would serve and as he would minister in various regions, God would allow him to"
    },
    {
      "id": 18,
      "start": 68.36000061035156,
      "end": 70.31999969482422,
      "text": " have those relationships established."
    },
    {
      "id": 19,
      "start": 70.31999969482422,
      "end": 75.5999984741211,
      "text": " In fact, as you read through the New Testament, and you have the opportunity to read many"
    },
    {
      "id": 20,
      "start": 75.5999984741211,
      "end": 81.12000274658203,
      "text": " of the books that God has allowed the Apostle Paul to be the human penman of, that you have"
    },
    {
      "id": 21,
      "start": 81.12000274658203,
      "end": 85.31999969482422,
      "text": " the privilege of reading of several of those names that are mentioned."
    },
    {
      "id": 22,
      "start": 85.4000015258789,
      "end": 89.95999908447266,
      "text": " In fact, you can look at the end of many of the epistles and see where the Apostle will"
    },
    {
      "id": 23,
      "start": 89.95999908447266,
      "end": 92.68000030517578,
      "text": " mention people by name, specifically."
    },
    {
      "id": 24,
      "start": 92.68000030517578,
      "end": 95.19999694824219,
      "text": " Sometimes he gives us some information about them."
    },
    {
      "id": 25,
      "start": 95.19999694824219,
      "end": 99.27999877929688,
      "text": " Sometimes there's not a whole lot that's given to us, but names are provided."
    },
    {
      "id": 26,
      "start": 99.27999877929688,
      "end": 103.72000122070312,
      "text": " It's interesting if you were to read Romans 16, that is an especially lengthy portion"
    },
    {
      "id": 27,
      "start": 103.72000122070312,
      "end": 109.36000061035156,
      "text": " of Scripture with a lot of names that are provided of these people that God allowed"
    },
    {
      "id": 28,
      "start": 109.36000061035156,
      "end": 114.76000213623047,
      "text": " the path of the Apostle Paul to cross with and to serve alongside of."
    },
    {
      "id": 29,
      "start": 114.76000213623047,
      "end": 120.76000213623047,
      "text": " And of course, in many cases, to minister to them, but also to minister along with them."
    },
    {
      "id": 30,
      "start": 120.76000213623047,
      "end": 123.68000030517578,
      "text": " The name Archippus is found both here in the book of Philemon."
    },
    {
      "id": 31,
      "start": 123.68000030517578,
      "end": 126.68000030517578,
      "text": " It's also found over in the book of Colossians."
    },
    {
      "id": 32,
      "start": 126.68000030517578,
      "end": 129.75999450683594,
      "text": " And we'll look at both passages of Scripture this evening."
    },
    {
      "id": 33,
      "start": 129.75999450683594,
      "end": 134.39999389648438,
      "text": " Notice in verse number one of the book of Philemon, the Bible says, Paul, a prisoner"
    },
    {
      "id": 34,
      "start": 134.39999389648438,
      "end": 139.44000244140625,
      "text": " of Jesus Christ, and Timothy, our brother, unto Philemon, our dearly beloved and fellow"
    },
    {
      "id": 35,
      "start": 139.44000244140625,
      "end": 140.44000244140625,
      "text": " laborer."
    },
    {
      "id": 36,
      "start": 140.44000244140625,
      "end": 145.8000030517578,
      "text": " And he says this, and to our beloved Athia and Archippus, our fellow soldier, and to"
    },
    {
      "id": 37,
      "start": 145.8000030517578,
      "end": 151.0399932861328,
      "text": " the church in thy house, grace to you and peace from God our Father and the Lord Jesus"
    },
    {
      "id": 38,
      "start": 151.0399932861328,
      "end": 152.0399932861328,
      "text": " Christ."
    },
    {
      "id": 39,
      "start": 152.0399932861328,
      "end": 157.1199951171875,
      "text": " Right in the beginning of the letter, we find that God gives us an understanding as to the"
    },
    {
      "id": 40,
      "start": 157.1199951171875,
      "end": 162.9199981689453,
      "text": " time of the writing of this short letter that is sent, of course, to Philemon and also to"
    },
    {
      "id": 41,
      "start": 162.9199981689453,
      "end": 166.27999877929688,
      "text": " Athia and Archippus, as it's mentioned in verse number two."
    },
    {
      "id": 42,
      "start": 166.27999877929688,
      "end": 172.0399932861328,
      "text": " As we would consider the timing of the letter, he says that Paul, a prisoner of Jesus Christ."
    },
    {
      "id": 43,
      "start": 172.0399932861328,
      "end": 177.1999969482422,
      "text": " We understand many of the epistles we would refer to as the prison epistles, and this"
    },
    {
      "id": 44,
      "start": 177.1999969482422,
      "end": 183.32000732421875,
      "text": " letter, along with the book of Colossians that we'll reference this evening as well,"
    },
    {
      "id": 45,
      "start": 183.32000732421875,
      "end": 187.16000366210938,
      "text": " they were both written, they're both referred to as these prison epistles that were written"
    },
    {
      "id": 46,
      "start": 187.16000366210938,
      "end": 193.44000244140625,
      "text": " around the same time from the same location during Paul's first confinement there in Rome."
    },
    {
      "id": 47,
      "start": 193.44000244140625,
      "end": 197.36000061035156,
      "text": " And so we understand a little bit of background about what God is giving us with regard to"
    },
    {
      "id": 48,
      "start": 197.36000061035156,
      "end": 200.16000366210938,
      "text": " the timing of the writing and who he's writing to."
    },
    {
      "id": 49,
      "start": 200.16000366210938,
      "end": 204.52000427246094,
      "text": " We're not going to deal with really the thought and the full message of the book of Philemon."
    },
    {
      "id": 50,
      "start": 204.52000427246094,
      "end": 208.60000610351562,
      "text": " In fact, if you go back and read through it, you'll see a beautiful picture that is given"
    },
    {
      "id": 51,
      "start": 208.60000610351562,
      "end": 214.55999755859375,
      "text": " to us with regard to this one on Onesimus and all that took place and how in the past"
    },
    {
      "id": 52,
      "start": 214.55999755859375,
      "end": 216.8800048828125,
      "text": " he was unprofitable, but now he's profitable."
    },
    {
      "id": 53,
      "start": 216.8800048828125,
      "end": 217.8800048828125,
      "text": " Why?"
    },
    {
      "id": 54,
      "start": 217.8800048828125,
      "end": 218.8800048828125,
      "text": " Because he's been saved."
    },
    {
      "id": 55,
      "start": 218.8800048828125,
      "end": 222.1999969482422,
      "text": " And great message, but not the message for this evening."
    },
    {
      "id": 56,
      "start": 222.1999969482422,
      "end": 225.63999938964844,
      "text": " The message for this evening, we're going to focus on this one, Archippus."
    },
    {
      "id": 57,
      "start": 225.63999938964844,
      "end": 230.55999755859375,
      "text": " Notice the Bible tells us, and we're going to use it for our title this evening, look"
    },
    {
      "id": 58,
      "start": 230.55999755859375,
      "end": 236.39999389648438,
      "text": " at it, it says, and to our beloved Athia, and Archippus, our fellow soldier."
    },
    {
      "id": 59,
      "start": 236.39999389648438,
      "end": 241.47999572753906,
      "text": " Archippus, our fellow soldier, is the title for the message this evening."
    },
    {
      "id": 60,
      "start": 241.47999572753906,
      "end": 247.16000366210938,
      "text": " I want you to notice, first of all, if you're taking notes, notice how this man is identified."
    },
    {
      "id": 61,
      "start": 247.16000366210938,
      "end": 252.55999755859375,
      "text": " We've read it there in verse number two, he's identified as a fellow soldier."
    },
    {
      "id": 62,
      "start": 252.55999755859375,
      "end": 254.24000549316406,
      "text": " I like that terminology."
    },
    {
      "id": 63,
      "start": 254.24000549316406,
      "end": 260.760009765625,
      "text": " I like the picture that you get in your mind when you read that description, that identifying"
    },
    {
      "id": 64,
      "start": 260.760009765625,
      "end": 264.0,
      "text": " name title, if you will, that is given."
    },
    {
      "id": 65,
      "start": 264.0,
      "end": 271.2799987792969,
      "text": " The Bible says, now, and Archippus, our fellow soldier."
    },
    {
      "id": 66,
      "start": 271.2799987792969,
      "end": 275.760009765625,
      "text": " It's interesting to me that the title, if I could use that terminology this evening,"
    },
    {
      "id": 67,
      "start": 275.760009765625,
      "end": 282.32000732421875,
      "text": " of fellow soldier, that the Apostle Paul only refers to two people in all of the Scriptures"
    },
    {
      "id": 68,
      "start": 282.32000732421875,
      "end": 283.9200134277344,
      "text": " with that title."
    },
    {
      "id": 69,
      "start": 283.9200134277344,
      "end": 287.6400146484375,
      "text": " We read about being a good soldier, and so on and so forth, and we'll reference some"
    },
    {
      "id": 70,
      "start": 287.6400146484375,
      "end": 292.1199951171875,
      "text": " of that this evening, but there are two people specifically that he mentions as being fellow"
    },
    {
      "id": 71,
      "start": 292.1199951171875,
      "end": 293.1199951171875,
      "text": " soldiers."
    },
    {
      "id": 72,
      "start": 293.1199951171875,
      "end": 298.2799987792969,
      "text": " We notice in the first verse of Philemon, that as he speaks about Philemon, he uses"
    },
    {
      "id": 73,
      "start": 298.2799987792969,
      "end": 303.44000244140625,
      "text": " this terminology, our dearly beloved and fellow laborer."
    },
    {
      "id": 74,
      "start": 303.4800109863281,
      "end": 309.1600036621094,
      "text": " I'm thankful that he was a co-laborer, a fellow laborer, and in that word is used, we find"
    },
    {
      "id": 75,
      "start": 309.1600036621094,
      "end": 314.8399963378906,
      "text": " that Paul says there in the church in Corinth, as he's ministering to them, of course, the"
    },
    {
      "id": 76,
      "start": 314.8399963378906,
      "end": 318.67999267578125,
      "text": " divisions and schisms and all that was taking place in Corinth, and I'm of Paul, and I'm"
    },
    {
      "id": 77,
      "start": 318.67999267578125,
      "end": 323.94000244140625,
      "text": " of Cephas, and I'm of Apollos, and so on and so forth, and Paul says, we're just laborers"
    },
    {
      "id": 78,
      "start": 323.94000244140625,
      "end": 326.32000732421875,
      "text": " together with God."
    },
    {
      "id": 79,
      "start": 326.32000732421875,
      "end": 330.8800048828125,
      "text": " And in chapter number three of 1 Corinthians, what a great perspective to have."
    },
    {
      "id": 80,
      "start": 330.8800048828125,
      "end": 336.6400146484375,
      "text": " But this title that we find here that is given as an identifier, if you will, for"
    },
    {
      "id": 81,
      "start": 336.6400146484375,
      "end": 338.9599914550781,
      "text": " Archippus is fellow soldier."
    },
    {
      "id": 82,
      "start": 338.9599914550781,
      "end": 343.1199951171875,
      "text": " It is used also of speaking of Epaphroditus."
    },
    {
      "id": 83,
      "start": 343.1199951171875,
      "end": 346.1199951171875,
      "text": " Turn back to the book of Philippians, if you will, in chapter number two of the book of"
    },
    {
      "id": 84,
      "start": 346.1199951171875,
      "end": 347.1199951171875,
      "text": " Philippians."
    },
    {
      "id": 85,
      "start": 347.1199951171875,
      "end": 353.0400085449219,
      "text": " Now, Epaphroditus was a man we believe most likely the pastor of the church there in Philippi."
    },
    {
      "id": 86,
      "start": 353.0400085449219,
      "end": 360.1600036621094,
      "text": " He speaks about him as being a companion in labor, my brother, but notice in Philippians"
    },
    {
      "id": 87,
      "start": 360.1600036621094,
      "end": 367.0,
      "text": " two, in verse number 25, it says, yet I supposed it necessary to send to you Epaphroditus,"
    },
    {
      "id": 88,
      "start": 367.0,
      "end": 374.8800048828125,
      "text": " my brother and companion in labor, and fellow soldier, but your messenger, and he that ministered"
    },
    {
      "id": 89,
      "start": 374.8800048828125,
      "end": 375.8800048828125,
      "text": " to my wants."
    },
    {
      "id": 90,
      "start": 375.8800048828125,
      "end": 381.20001220703125,
      "text": " It's commonly believed that as the church at Philippi collected this offering to assist"
    },
    {
      "id": 91,
      "start": 381.20001220703125,
      "end": 387.239990234375,
      "text": " the apostle Paul, that it was taken, delivered to Paul by the hand of Epaphroditus, and he"
    },
    {
      "id": 92,
      "start": 387.32000732421875,
      "end": 393.9599914550781,
      "text": " took that as the messenger of the church, he brought that offering to the apostle Paul,"
    },
    {
      "id": 93,
      "start": 393.9599914550781,
      "end": 397.79998779296875,
      "text": " and then Paul would deliver this letter back to the church at Philippi by the hands of"
    },
    {
      "id": 94,
      "start": 397.79998779296875,
      "end": 399.0799865722656,
      "text": " Epaphroditus."
    },
    {
      "id": 95,
      "start": 399.0799865722656,
      "end": 403.4800109863281,
      "text": " And we find here that he's referred to as fellow soldier."
    },
    {
      "id": 96,
      "start": 403.4800109863281,
      "end": 408.3999938964844,
      "text": " And again, it's Epaphroditus and this one, Archippus."
    },
    {
      "id": 97,
      "start": 408.3999938964844,
      "end": 416.239990234375,
      "text": " It's interesting because this title reveals to me the fact that they were engaged in battle."
    },
    {
      "id": 98,
      "start": 417.239990234375,
      "end": 423.3999938964844,
      "text": " You immediately get in your mind when you read that title, that term that is ascribed"
    },
    {
      "id": 99,
      "start": 423.3999938964844,
      "end": 429.760009765625,
      "text": " to Archippus here, the way in which he's identified, we see this fellow soldier, he's engaged in"
    },
    {
      "id": 100,
      "start": 429.760009765625,
      "end": 431.3599853515625,
      "text": " the battle."
    },
    {
      "id": 101,
      "start": 431.3599853515625,
      "end": 435.79998779296875,
      "text": " The battle that he's engaged in though is a spiritual battle."
    },
    {
      "id": 102,
      "start": 435.79998779296875,
      "end": 440.20001220703125,
      "text": " And the reality this evening is that each and every one of us are engaged in a spiritual"
    },
    {
      "id": 103,
      "start": 440.20001220703125,
      "end": 442.05999755859375,
      "text": " battle."
    },
    {
      "id": 104,
      "start": 442.05999755859375,
      "end": 446.3399963378906,
      "text": " We see this spiritual battle, this spiritual warfare that Paul speaks of to the believers"
    },
    {
      "id": 105,
      "start": 446.3399963378906,
      "end": 451.17999267578125,
      "text": " in the book of Ephesians there as they're ministering in the city of Ephesus and that"
    },
    {
      "id": 106,
      "start": 451.17999267578125,
      "end": 454.05999755859375,
      "text": " church that is there and ministering and serving."
    },
    {
      "id": 107,
      "start": 454.05999755859375,
      "end": 459.6199951171875,
      "text": " And Paul tells them, listen, we are engaged in spiritual warfare."
    },
    {
      "id": 108,
      "start": 459.6199951171875,
      "end": 465.4800109863281,
      "text": " And the reality is that if you have any sense about you, and I don't say that to be condescending,"
    },
    {
      "id": 109,
      "start": 465.4800109863281,
      "end": 472.5199890136719,
      "text": " you can obviously, without hesitation, identify today that we're in the midst of spiritual"
    },
    {
      "id": 110,
      "start": 472.5199890136719,
      "end": 473.5199890136719,
      "text": " warfare."
    },
    {
      "id": 111,
      "start": 473.5199890136719,
      "end": 476.6400146484375,
      "text": " I mean, the spiritual battle that is raging."
    },
    {
      "id": 112,
      "start": 476.6400146484375,
      "end": 483.20001220703125,
      "text": " And we find that this man, Archippus, not to say that others weren't fellow soldiers,"
    },
    {
      "id": 113,
      "start": 483.20001220703125,
      "end": 487.0,
      "text": " but it's interesting that there's just a couple of people that are given, that are spoken"
    },
    {
      "id": 114,
      "start": 487.0,
      "end": 488.4800109863281,
      "text": " of in this term."
    },
    {
      "id": 115,
      "start": 488.4800109863281,
      "end": 491.760009765625,
      "text": " You find often that the Apostle Paul, when he speaks about Timothy, how does he refer"
    },
    {
      "id": 116,
      "start": 491.760009765625,
      "end": 492.760009765625,
      "text": " to Timothy?"
    },
    {
      "id": 117,
      "start": 492.760009765625,
      "end": 494.1600036621094,
      "text": " My son in the faith."
    },
    {
      "id": 118,
      "start": 494.8399963378906,
      "end": 497.239990234375,
      "text": " He refers to Titus in like manner."
    },
    {
      "id": 119,
      "start": 497.239990234375,
      "end": 500.5199890136719,
      "text": " In fact, he speaks of Onesimus in that fashion as well."
    },
    {
      "id": 120,
      "start": 500.5199890136719,
      "end": 503.6000061035156,
      "text": " But we find that there's a purpose."
    },
    {
      "id": 121,
      "start": 503.6000061035156,
      "end": 506.6400146484375,
      "text": " We believe that every word of God is pure."
    },
    {
      "id": 122,
      "start": 506.6400146484375,
      "end": 510.239990234375,
      "text": " And the Bible says that all Scripture is given by inspiration of God."
    },
    {
      "id": 123,
      "start": 510.239990234375,
      "end": 517.3599853515625,
      "text": " And God led the Apostle Paul to use this term, this title, in identifying this one, Archippus."
    },
    {
      "id": 124,
      "start": 517.3599853515625,
      "end": 523.0999755859375,
      "text": " Now, the reality is that Paul had spoken to Timothy about the importance of understanding"
    },
    {
      "id": 125,
      "start": 523.0999755859375,
      "end": 527.02001953125,
      "text": " our place as being a soldier and what it means to be a good soldier."
    },
    {
      "id": 126,
      "start": 527.02001953125,
      "end": 530.9000244140625,
      "text": " Notice if you will, over in 2 Timothy chapter number 2, I'm going to draw your attention"
    },
    {
      "id": 127,
      "start": 530.9000244140625,
      "end": 535.5399780273438,
      "text": " quickly this evening to just the first four verses of this passage of Scripture."
    },
    {
      "id": 128,
      "start": 535.5399780273438,
      "end": 540.5800170898438,
      "text": " And I want you to just get the instruction that Paul is leaving for Timothy, of course,"
    },
    {
      "id": 129,
      "start": 540.5800170898438,
      "end": 544.1400146484375,
      "text": " by way of preservation for us as well to this day."
    },
    {
      "id": 130,
      "start": 544.1400146484375,
      "end": 546.9400024414062,
      "text": " He says this in verse number 1 of 2 Timothy 2,"
    },
    {
      "id": 131,
      "start": 546.9400024414062,
      "end": 552.97998046875,
      "text": " Thou, therefore, my son, be strong in the grace that is in Christ Jesus."
    },
    {
      "id": 132,
      "start": 552.97998046875,
      "end": 557.3800048828125,
      "text": " The things that thou hast heard of me among many witnesses, the same commit thou to faithful"
    },
    {
      "id": 133,
      "start": 557.3800048828125,
      "end": 561.5399780273438,
      "text": " men who shall be able to teach others also."
    },
    {
      "id": 134,
      "start": 561.5399780273438,
      "end": 570.8400268554688,
      "text": " He says this, Thou, therefore, endure hardness as a good soldier of Jesus Christ."
    },
    {
      "id": 135,
      "start": 570.8400268554688,
      "end": 577.0399780273438,
      "text": " He says, No man that woreth and tangleth himself with the affairs of this life, that"
    },
    {
      "id": 136,
      "start": 577.0399780273438,
      "end": 582.280029296875,
      "text": " he may please him who hath chosen him to be a soldier."
    },
    {
      "id": 137,
      "start": 582.280029296875,
      "end": 583.280029296875,
      "text": " Who's that?"
    },
    {
      "id": 138,
      "start": 583.280029296875,
      "end": 584.280029296875,
      "text": " Well, that's the Lord."
    },
    {
      "id": 139,
      "start": 584.280029296875,
      "end": 585.280029296875,
      "text": " Amen?"
    },
    {
      "id": 140,
      "start": 585.280029296875,
      "end": 587.52001953125,
      "text": " You trust that Christ is your personal Savior."
    },
    {
      "id": 141,
      "start": 587.52001953125,
      "end": 589.6400146484375,
      "text": " You are enlisted in the Lord's army."
    },
    {
      "id": 142,
      "start": 589.6400146484375,
      "end": 590.6400146484375,
      "text": " Amen?"
    },
    {
      "id": 143,
      "start": 590.6400146484375,
      "end": 593.1599731445312,
      "text": " You became a soldier of Jesus Christ."
    },
    {
      "id": 144,
      "start": 593.1599731445312,
      "end": 597.7999877929688,
      "text": " We find that we sing the song with the kids about being in the Lord's army, right?"
    },
    {
      "id": 145,
      "start": 597.7999877929688,
      "end": 599.6400146484375,
      "text": " And we have fun with singing that."
    },
    {
      "id": 146,
      "start": 599.6400146484375,
      "end": 600.1400146484375,
      "text": " We sing."
    },
    {
      "id": 0,
      "start": 600.1400146484375,
      "end": 606.1800146102905,
      "text": " songs about onward Christian soldier right and we understand some of the"
    },
    {
      "id": 1,
      "start": 606.1800146102905,
      "end": 611.3000144958496,
      "text": " songwriters that have taken up on this thought of being a soldier and this is"
    },
    {
      "id": 2,
      "start": 611.3000144958496,
      "end": 616.7400150299072,
      "text": " an analogy an illustration that is used to help us understand this this"
    },
    {
      "id": 3,
      "start": 616.7400150299072,
      "end": 622.8200149536133,
      "text": " Christian life that we're living in this battle in which were engaged in and Paul"
    },
    {
      "id": 4,
      "start": 622.8200149536133,
      "end": 629.1800155639648,
      "text": " says to Timothy that that you might be a good soldier that you may please him who"
    },
    {
      "id": 5,
      "start": 629.1800155639648,
      "end": 636.0600128173828,
      "text": " have chosen him to be a soldier wonder this evening as we would think about"
    },
    {
      "id": 6,
      "start": 636.0600128173828,
      "end": 642.1800155639648,
      "text": " this title that is given to Archippus in our text of Scripture the way in which"
    },
    {
      "id": 7,
      "start": 642.1800155639648,
      "end": 646.8200149536133,
      "text": " he is identified I wonder this evening if someone would say of me if someone"
    },
    {
      "id": 8,
      "start": 646.8200149536133,
      "end": 652.4200134277344,
      "text": " would say of you there are fellow soldier a fellow soldier I wonder this"
    },
    {
      "id": 9,
      "start": 652.4200134277344,
      "end": 658.340015411377,
      "text": " evening if we understand really the the spiritual warfare in battle that we are"
    },
    {
      "id": 10,
      "start": 658.340015411377,
      "end": 663.6200141906738,
      "text": " engaged in the truth of Ephesians 6 is a powerful truth that we must be"
    },
    {
      "id": 11,
      "start": 663.6200141906738,
      "end": 669.2600173950195,
      "text": " mindful of on a regular basis we spoke of course of the theme for 2019 be"
    },
    {
      "id": 12,
      "start": 669.2600173950195,
      "end": 672.9800109863281,
      "text": " strong the Lord I preached to the whole book of Ephesians we belabored the point"
    },
    {
      "id": 13,
      "start": 672.9800109863281,
      "end": 677.1000137329102,
      "text": " but it's good to be reminded of the fact that we're engaged in spiritual warfare"
    },
    {
      "id": 14,
      "start": 677.1000137329102,
      "end": 682.6600112915039,
      "text": " and we wrestle not against flesh and blood we're to put on the whole armor of"
    },
    {
      "id": 15,
      "start": 682.6600112915039,
      "end": 687.4600143432617,
      "text": " God by the way that's not a one-and-done situation that is an everyday"
    },
    {
      "id": 16,
      "start": 687.4600143432617,
      "end": 691.8200149536133,
      "text": " sometimes you might have to go put the armor on again because something"
    },
    {
      "id": 17,
      "start": 691.8200149536133,
      "end": 696.8600158691406,
      "text": " happened as you were engaged in battle and you you have to understand the"
    },
    {
      "id": 18,
      "start": 696.8600158691406,
      "end": 704.6600112915039,
      "text": " importance of this battle that we're in and Paul says as he refers to this one"
    },
    {
      "id": 19,
      "start": 704.6600112915039,
      "end": 710.5000152587891,
      "text": " this co-laborer but more than that a fellow soldier we notice how he's"
    },
    {
      "id": 20,
      "start": 710.5000152587891,
      "end": 716.7000122070312,
      "text": " identified I want you to notice over the book of Colossians how he is instructed"
    },
    {
      "id": 21,
      "start": 716.7000122070312,
      "end": 721.2200164794922,
      "text": " the book of Colossians gives us some some information at the end of the book"
    },
    {
      "id": 22,
      "start": 721.2200164794922,
      "end": 726.1400146484375,
      "text": " again I mentioned how that many times I said this by way of introduction that"
    },
    {
      "id": 23,
      "start": 726.1400146484375,
      "end": 730.1000213623047,
      "text": " you get to the end of some of these epistles that God allowed Paul to be the"
    },
    {
      "id": 24,
      "start": 730.1000213623047,
      "end": 734.7000122070312,
      "text": " human penman of and you see a reference to a number of individuals people that"
    },
    {
      "id": 25,
      "start": 734.7000122070312,
      "end": 740.1800079345703,
      "text": " he served and ministered to people that he served alongside of and we find that"
    },
    {
      "id": 26,
      "start": 740.1800079345703,
      "end": 743.3800201416016,
      "text": " beginning in Colossians 4 and verse number 7 is where you begin to see a"
    },
    {
      "id": 27,
      "start": 743.3800201416016,
      "end": 746.7400207519531,
      "text": " number of those names that will be mentioned throughout the end of this"
    },
    {
      "id": 28,
      "start": 746.7400207519531,
      "end": 752.0600128173828,
      "text": " particular passage of Scripture names that Paul mentions we get down to verse"
    },
    {
      "id": 29,
      "start": 752.0600128173828,
      "end": 759.3800201416016,
      "text": " number 17 and it says this notice and say to Archippus so so this is this"
    },
    {
      "id": 30,
      "start": 759.3800201416016,
      "end": 764.5400085449219,
      "text": " interesting to me because really he says just catch it in context notice in verse"
    },
    {
      "id": 31,
      "start": 764.5400085449219,
      "end": 768.4600219726562,
      "text": " number 7 all my states shall take a kiss declare unto you who is a beloved"
    },
    {
      "id": 32,
      "start": 768.4600219726562,
      "end": 773.1400146484375,
      "text": " brother and faithful minister and fellow servant the Lord verse 9 with Onesimus a"
    },
    {
      "id": 33,
      "start": 773.1400146484375,
      "end": 777.5000152587891,
      "text": " faithful and beloved brother who's one of you they shall make known unto all"
    },
    {
      "id": 34,
      "start": 777.5000152587891,
      "end": 782.1400146484375,
      "text": " things which are done here we see that he mentions about others he goes through"
    },
    {
      "id": 35,
      "start": 782.1400146484375,
      "end": 786.0600128173828,
      "text": " and he speaks of them favorably and about their labor and their service but"
    },
    {
      "id": 36,
      "start": 786.0600128173828,
      "end": 790.2200164794922,
      "text": " when he comes to verse number 17 and he's going to speak about Archippus he"
    },
    {
      "id": 37,
      "start": 790.2200164794922,
      "end": 795.7800140380859,
      "text": " says and say to Archippus there's some instruction that I want to make sure it"
    },
    {
      "id": 38,
      "start": 795.7800140380859,
      "end": 801.8200073242188,
      "text": " gets delivered to this one this fellow soldier that's engaged in the battle"
    },
    {
      "id": 39,
      "start": 801.8200073242188,
      "end": 807.02001953125,
      "text": " there's some instruction that I want to make sure it gets to him see with the"
    },
    {
      "id": 40,
      "start": 807.02001953125,
      "end": 812.0600128173828,
      "text": " other folks that are mentioned there's not necessarily a piece of information"
    },
    {
      "id": 41,
      "start": 812.0600128173828,
      "end": 817.0600128173828,
      "text": " that is to be given to them as much as there's a description as to how they're"
    },
    {
      "id": 42,
      "start": 817.0600128173828,
      "end": 821.1800079345703,
      "text": " engaged in the work and what they're doing and their faithfulness and we"
    },
    {
      "id": 43,
      "start": 821.1800079345703,
      "end": 825.0000152587891,
      "text": " notice that Paul says this notice what he says we're gonna break the statement"
    },
    {
      "id": 44,
      "start": 825.0000152587891,
      "end": 831.6200103759766,
      "text": " down number one he says take heed to the ministry now we're going to pause"
    },
    {
      "id": 45,
      "start": 831.6200103759766,
      "end": 834.5400085449219,
      "text": " right there I know that's not the fullness of the thought but we're just"
    },
    {
      "id": 46,
      "start": 834.5400085449219,
      "end": 839.3000183105469,
      "text": " gonna pause there for just a moment and this idea of taking heed to to discern"
    },
    {
      "id": 47,
      "start": 839.3000183105469,
      "end": 844.3800201416016,
      "text": " to understand to have a knowledge of and he says take heed but notice what he"
    },
    {
      "id": 48,
      "start": 844.3800201416016,
      "end": 849.1400146484375,
      "text": " says he could have stopped again every word of God is pure take heed to the"
    },
    {
      "id": 49,
      "start": 849.1400146484375,
      "end": 856.9000244140625,
      "text": " ministry notice how it's described which thou hast received in the Lord now let"
    },
    {
      "id": 50,
      "start": 856.9000244140625,
      "end": 862.5,
      "text": " me ask you do those words that are given after ministry don't you think"
    },
    {
      "id": 51,
      "start": 862.5,
      "end": 868.9800109863281,
      "text": " those are important words he didn't just stop take heed to the ministry he says"
    },
    {
      "id": 52,
      "start": 868.9800109863281,
      "end": 877.4600219726562,
      "text": " take heed to the ministry which thou hast received in the Lord I think about"
    },
    {
      "id": 53,
      "start": 877.4600219726562,
      "end": 882.2200012207031,
      "text": " the message that would be delivered I believe that the recipients here would"
    },
    {
      "id": 54,
      "start": 882.2200012207031,
      "end": 886.5800170898438,
      "text": " have faithfully taken and delivered this message and say to archivist okay here's"
    },
    {
      "id": 55,
      "start": 886.5800170898438,
      "end": 890.2200012207031,
      "text": " the message for you it's been contained and preserved for us so that we can read"
    },
    {
      "id": 56,
      "start": 890.2200012207031,
      "end": 894.7000122070312,
      "text": " it and be encouraged by it and be challenged by it but we find that as he"
    },
    {
      "id": 57,
      "start": 894.7000122070312,
      "end": 900.4600219726562,
      "text": " would receive those words when when it says take heed to the ministry and then"
    },
    {
      "id": 58,
      "start": 900.4600219726562,
      "end": 907.260009765625,
      "text": " which thou hast received in the Lord it's the Lord that calls us to the"
    },
    {
      "id": 59,
      "start": 907.260009765625,
      "end": 911.4600219726562,
      "text": " ministry it's the Lord that equips us for the work of the ministry it's the"
    },
    {
      "id": 60,
      "start": 911.4600219726562,
      "end": 916.2200012207031,
      "text": " Lord who enables us we find that as we would understand the truth of spiritual"
    },
    {
      "id": 61,
      "start": 916.260009765625,
      "end": 920.1400146484375,
      "text": " gifts within the the Church of God and we'd understand how the Holy Spirit of"
    },
    {
      "id": 62,
      "start": 920.1400146484375,
      "end": 926.780029296875,
      "text": " God gifts each individual believer as he will amen and he's the one that gives"
    },
    {
      "id": 63,
      "start": 926.780029296875,
      "end": 932.5,
      "text": " you and equips you for the work of the ministry for the the work that God has"
    },
    {
      "id": 64,
      "start": 932.5,
      "end": 938.260009765625,
      "text": " called us to now this one archivist he may have had a particular position"
    },
    {
      "id": 65,
      "start": 938.260009765625,
      "end": 942.3000183105469,
      "text": " there's some that have the idea that he may have been a pastor of a church and"
    },
    {
      "id": 66,
      "start": 942.3000183105469,
      "end": 948.1000061035156,
      "text": " whatever the particular ministry may have been that he was engaged in we find"
    },
    {
      "id": 67,
      "start": 948.1000061035156,
      "end": 952.8200073242188,
      "text": " that the Apostle Paul in delivering this message of taking heed to the ministry"
    },
    {
      "id": 68,
      "start": 952.8200073242188,
      "end": 957.6200256347656,
      "text": " which now has received in the Lord is reminding him that he had been called by"
    },
    {
      "id": 69,
      "start": 957.6200256347656,
      "end": 963.1800231933594,
      "text": " God they've been given this ministry by the Lord I think about the words of Paul"
    },
    {
      "id": 70,
      "start": 963.1800231933594,
      "end": 968.3400268554688,
      "text": " when he says this and and you can just let me read the verse to you but in"
    },
    {
      "id": 71,
      "start": 968.3400268554688,
      "end": 974.5800170898438,
      "text": " first Timothy 1 in verse number 12 Paul says and I thank Christ Jesus our Lord"
    },
    {
      "id": 72,
      "start": 974.5800170898438,
      "end": 982.6600036621094,
      "text": " who hath enabled me for that he counted me faithful putting me into the ministry"
    },
    {
      "id": 73,
      "start": 982.6600036621094,
      "end": 987.5,
      "text": " see Paul understood that he was called by God in fact as you read through many"
    },
    {
      "id": 74,
      "start": 987.5,
      "end": 992.5800170898438,
      "text": " of the epistles and that that Paul was the human penman for you'll find that he"
    },
    {
      "id": 75,
      "start": 992.5800170898438,
      "end": 998.1000061035156,
      "text": " references the call that God has placed upon his life in those introductory"
    },
    {
      "id": 76,
      "start": 998.1000061035156,
      "end": 1001.7000122070312,
      "text": " statements in fact here in first Timothy 1 in verse number 1 Paul says"
    },
    {
      "id": 77,
      "start": 1001.7000122070312,
      "end": 1007.260009765625,
      "text": " this he says Paul an apostle of Jesus Christ by the commandment of God our"
    },
    {
      "id": 78,
      "start": 1007.260009765625,
      "end": 1013.780029296875,
      "text": " Savior and Lord Jesus Christ which is our hope we find that Paul understood"
    },
    {
      "id": 79,
      "start": 1013.780029296875,
      "end": 1017.780029296875,
      "text": " something about the ministry he understood that he was called by God and"
    },
    {
      "id": 80,
      "start": 1017.780029296875,
      "end": 1022.8600158691406,
      "text": " now as he's giving this word to archivist is he giving this instruction"
    },
    {
      "id": 81,
      "start": 1022.8600158691406,
      "end": 1027.02001953125,
      "text": " he says take heed to the ministry which thou hast received in the Lord then"
    },
    {
      "id": 82,
      "start": 1027.02001953125,
      "end": 1037.3000183105469,
      "text": " notice this last phrase that thou fulfill it that thou fulfill it see"
    },
    {
      "id": 83,
      "start": 1037.3000183105469,
      "end": 1046.0600280761719,
      "text": " whether this man quit or was just simply tempted to quit is really not certain in"
    },
    {
      "id": 84,
      "start": 1046.0600280761719,
      "end": 1050.5400085449219,
      "text": " fact the only two verses of Scripture that we have specifically about this"
    },
    {
      "id": 85,
      "start": 1050.5400085449219,
      "end": 1054.7000122070312,
      "text": " man archivist or the two that we've looked at this evening Philemon one"
    },
    {
      "id": 86,
      "start": 1054.7000122070312,
      "end": 1059.8200073242188,
      "text": " verse number two and here in Colossians 4 and verse number 17 theologians of"
    },
    {
      "id": 87,
      "start": 1059.8200073242188,
      "end": 1063.5400085449219,
      "text": " yesteryear have spun theories about whether or not he quit the ministry and"
    },
    {
      "id": 88,
      "start": 1063.5400085449219,
      "end": 1068.260009765625,
      "text": " got off track and so on and so forth the reality is that we don't know factually"
    },
    {
      "id": 89,
      "start": 1068.260009765625,
      "end": 1074.3400268554688,
      "text": " biblically speaking but I can tell you this that when you're engaged in"
    },
    {
      "id": 90,
      "start": 1074.3400268554688,
      "end": 1080.1800231933594,
      "text": " spiritual battle when you're a fellow soldier there's some things that come in"
    },
    {
      "id": 91,
      "start": 1080.1800231933594,
      "end": 1087.5800170898438,
      "text": " your life that cause you to consider walking away quitting giving up is it"
    },
    {
      "id": 92,
      "start": 1087.5800170898438,
      "end": 1094.1800231933594,
      "text": " worth it and Paul whether this one archivist whether he was just facing"
    },
    {
      "id": 93,
      "start": 1094.1800231933594,
      "end": 1100.0600280761719,
      "text": " this time of maybe difficulty and discouragement maybe he was tempted with"
    },
    {
      "id": 94,
      "start": 1100.0600280761719,
      "end": 1105.6200256347656,
      "text": " the idea of not continuing it's just not worth it it's too challenging it's too"
    },
    {
      "id": 95,
      "start": 1105.6200256347656,
      "end": 1110.0600280761719,
      "text": " difficult you don't know what I've had to deal with again we don't know all of"
    },
    {
      "id": 96,
      "start": 1110.260009765625,
      "end": 1114.260009765625,
      "text": " that but Paul having obviously under the inspiration of the Holy Spirit but"
    },
    {
      "id": 97,
      "start": 1114.260009765625,
      "end": 1117.9400024414062,
      "text": " having an understanding of this man and in writing this and giving this"
    },
    {
      "id": 98,
      "start": 1117.9400024414062,
      "end": 1125.4200439453125,
      "text": " instruction he says that thou fulfill it the importance of completion the"
    },
    {
      "id": 99,
      "start": 1125.4200439453125,
      "end": 1132.5,
      "text": " importance of finishing the importance of understanding that that we that as we"
    },
    {
      "id": 100,
      "start": 1132.5,
      "end": 1138.9400024414062,
      "text": " serve God that we're serving God and that as we run our race we're not"
    },
    {
      "id": 101,
      "start": 1138.9400024414062,
      "end": 1143.4600219726562,
      "text": " running our race to compete against one another we're running our own race and"
    },
    {
      "id": 102,
      "start": 1143.4600219726562,
      "end": 1149.3800048828125,
      "text": " as we're running our race our goal is to finish in fact Paul said this to the"
    },
    {
      "id": 103,
      "start": 1149.3800048828125,
      "end": 1154.5400390625,
      "text": " believers that he is writing to in the region of Galatia of course there's been"
    },
    {
      "id": 104,
      "start": 1154.5400390625,
      "end": 1158.8200073242188,
      "text": " many things that had taken place and the Judaizers that came in and all of the"
    },
    {
      "id": 105,
      "start": 1158.8200073242188,
      "end": 1164.9800415039062,
      "text": " false teaching and he asks him this question he says ye did run well who did"
    },
    {
      "id": 106,
      "start": 1164.9800415039062,
      "end": 1170.1400146484375,
      "text": " hinder you that you should not obey the truth in Galatians 5 and verse number"
    },
    {
      "id": 107,
      "start": 1170.1400146484375,
      "end": 1176.2200317382812,
      "text": " 7 I love the testimony of the Apostle Paul you come to the book of 2nd"
    },
    {
      "id": 108,
      "start": 1176.2200317382812,
      "end": 1180.9000244140625,
      "text": " Timothy chapter number 4 of course we're familiar with the passage of Scripture"
    },
    {
      "id": 109,
      "start": 1180.9000244140625,
      "end": 1186.3400268554688,
      "text": " we understand how that he's writing to to Timothy and he begins to share this"
    },
    {
      "id": 110,
      "start": 1186.3400268554688,
      "end": 1191.2999877929688,
      "text": " testimony of course he's given Timothy these final words of instruction these"
    },
    {
      "id": 111,
      "start": 1191.3400268554688,
      "end": 1196.2200317382812,
      "text": " words of instruction by the way are are really summed up in in this idea"
    },
    {
      "id": 112,
      "start": 1196.2200317382812,
      "end": 1200.1400146484375,
      "text": " continue continue I mean if you read the third"
    },
    {
      "id": 0,
      "start": 1200.1400146484375,
      "end": 1201.6800146102905,
      "text": " chapter of the book of 2 Timothy,"
    },
    {
      "id": 1,
      "start": 1201.6800146102905,
      "end": 1203.7200145721436,
      "text": " you begin to read about the perilous times"
    },
    {
      "id": 2,
      "start": 1203.7200145721436,
      "end": 1204.6400146484375,
      "text": " that shall come,"
    },
    {
      "id": 3,
      "start": 1204.6400146484375,
      "end": 1206.7200145721436,
      "text": " and Paul starts it this way by saying,"
    },
    {
      "id": 4,
      "start": 1206.7200145721436,
      "end": 1210.2600145339966,
      "text": " this know also."
    },
    {
      "id": 5,
      "start": 1210.2600145339966,
      "end": 1212.9800148010254,
      "text": " Remember, Paul often as he writes,"
    },
    {
      "id": 6,
      "start": 1212.9800148010254,
      "end": 1214.0600147247314,
      "text": " he will speak of,"
    },
    {
      "id": 7,
      "start": 1214.0600147247314,
      "end": 1216.2200145721436,
      "text": " you know, I would not that you be ignorant, brother."
    },
    {
      "id": 8,
      "start": 1216.2200145721436,
      "end": 1217.5600147247314,
      "text": " I want you to know something."
    },
    {
      "id": 9,
      "start": 1217.5600147247314,
      "end": 1219.5600147247314,
      "text": " I want you to be informed of something."
    },
    {
      "id": 10,
      "start": 1219.5600147247314,
      "end": 1220.9800148010254,
      "text": " And here he says to Timothy,"
    },
    {
      "id": 11,
      "start": 1220.9800148010254,
      "end": 1222.360013961792,
      "text": " this know also,"
    },
    {
      "id": 12,
      "start": 1222.360013961792,
      "end": 1224.520013809204,
      "text": " then the last days perilous times shall come."
    },
    {
      "id": 13,
      "start": 1224.520013809204,
      "end": 1226.4000148773193,
      "text": " And by the way, he begins to go through"
    },
    {
      "id": 14,
      "start": 1226.4000148773193,
      "end": 1228.5600147247314,
      "text": " and to explain some of these things"
    },
    {
      "id": 15,
      "start": 1228.5600147247314,
      "end": 1230.020013809204,
      "text": " and give some descriptions"
    },
    {
      "id": 16,
      "start": 1230.020013809204,
      "end": 1231.860013961792,
      "text": " as to what would be endured"
    },
    {
      "id": 17,
      "start": 1231.860013961792,
      "end": 1235.780014038086,
      "text": " and what would be experienced."
    },
    {
      "id": 18,
      "start": 1235.780014038086,
      "end": 1237.3200149536133,
      "text": " He tells them in v. 12,"
    },
    {
      "id": 19,
      "start": 1237.3200149536133,
      "end": 1239.9000129699707,
      "text": " yea, and all that will live godly in Christ Jesus"
    },
    {
      "id": 20,
      "start": 1239.9000129699707,
      "end": 1243.3600158691406,
      "text": " shall suffer persecution."
    },
    {
      "id": 21,
      "start": 1243.3600158691406,
      "end": 1244.9000129699707,
      "text": " Can I tell you that the persecution"
    },
    {
      "id": 22,
      "start": 1244.9000129699707,
      "end": 1247.440013885498,
      "text": " in which the first century believers"
    },
    {
      "id": 23,
      "start": 1247.440013885498,
      "end": 1248.7400131225586,
      "text": " faced and endured"
    },
    {
      "id": 24,
      "start": 1248.7400131225586,
      "end": 1250.8600158691406,
      "text": " is different than anything any of us"
    },
    {
      "id": 25,
      "start": 1250.8600158691406,
      "end": 1255.940013885498,
      "text": " have ever experienced."
    },
    {
      "id": 26,
      "start": 1255.940013885498,
      "end": 1258.1000137329102,
      "text": " He says evil men and seducers"
    },
    {
      "id": 27,
      "start": 1258.1400146484375,
      "end": 1259.4800148010254,
      "text": " shall wax worse and worse"
    },
    {
      "id": 28,
      "start": 1259.4800148010254,
      "end": 1262.5600128173828,
      "text": " deceiving and being deceived."
    },
    {
      "id": 29,
      "start": 1262.5600128173828,
      "end": 1264.9400177001953,
      "text": " Then notice what he says in v. 14."
    },
    {
      "id": 30,
      "start": 1264.9400177001953,
      "end": 1268.3200149536133,
      "text": " But continue."
    },
    {
      "id": 31,
      "start": 1268.3200149536133,
      "end": 1271.5600128173828,
      "text": " But continue thou in the things"
    },
    {
      "id": 32,
      "start": 1271.5600128173828,
      "end": 1273.9400177001953,
      "text": " which thou hast learned and been assured of,"
    },
    {
      "id": 33,
      "start": 1273.9400177001953,
      "end": 1276.3200149536133,
      "text": " knowing of whom thou hast learned them."
    },
    {
      "id": 34,
      "start": 1276.3200149536133,
      "end": 1278.0200119018555,
      "text": " And he goes through and he begins"
    },
    {
      "id": 35,
      "start": 1278.0200119018555,
      "end": 1281.3200149536133,
      "text": " to give this charge to Timothy"
    },
    {
      "id": 36,
      "start": 1281.3200149536133,
      "end": 1283.3600158691406,
      "text": " to continue."
    },
    {
      "id": 37,
      "start": 1283.3600158691406,
      "end": 1285.4800109863281,
      "text": " Yea, these things are going to happen."
    },
    {
      "id": 38,
      "start": 1286.4400177001953,
      "end": 1288.160011291504,
      "text": " We're going to face opposition."
    },
    {
      "id": 39,
      "start": 1288.160011291504,
      "end": 1290.2400131225586,
      "text": " We're in a battle."
    },
    {
      "id": 40,
      "start": 1290.2400131225586,
      "end": 1293.0400161743164,
      "text": " We're in spiritual warfare."
    },
    {
      "id": 41,
      "start": 1293.0400161743164,
      "end": 1295.2400131225586,
      "text": " You're a fellow soldier."
    },
    {
      "id": 42,
      "start": 1295.2400131225586,
      "end": 1297.620018005371,
      "text": " I know sometimes in the battle it gets hard."
    },
    {
      "id": 43,
      "start": 1297.620018005371,
      "end": 1299.160011291504,
      "text": " I know sometimes in the battle"
    },
    {
      "id": 44,
      "start": 1299.160011291504,
      "end": 1303.2400131225586,
      "text": " it gets overwhelming."
    },
    {
      "id": 45,
      "start": 1303.2400131225586,
      "end": 1304.9600143432617,
      "text": " That thou fulfill it."
    },
    {
      "id": 46,
      "start": 1304.9600143432617,
      "end": 1306.0400161743164,
      "text": " Continue."
    },
    {
      "id": 47,
      "start": 1306.0400161743164,
      "end": 1307.7400131225586,
      "text": " Be faithful."
    },
    {
      "id": 48,
      "start": 1307.7400131225586,
      "end": 1310.4600143432617,
      "text": " The Scriptures speak about being faithful unto death."
    },
    {
      "id": 49,
      "start": 1310.4600143432617,
      "end": 1312.9600143432617,
      "text": " Being faithful unto the end."
    },
    {
      "id": 50,
      "start": 1312.9600143432617,
      "end": 1315.380012512207,
      "text": " Paul says this."
    },
    {
      "id": 51,
      "start": 1315.400016784668,
      "end": 1318.3200149536133,
      "text": " He gives him the charge in v. 1 of chapter 4"
    },
    {
      "id": 52,
      "start": 1318.3200149536133,
      "end": 1320.4600143432617,
      "text": " about preaching the Word of God."
    },
    {
      "id": 53,
      "start": 1320.4600143432617,
      "end": 1321.5800170898438,
      "text": " He says in v. 2,"
    },
    {
      "id": 54,
      "start": 1321.5800170898438,
      "end": 1323.4200134277344,
      "text": " Preach the Word, be instant in season,"
    },
    {
      "id": 55,
      "start": 1323.4200134277344,
      "end": 1325.4200134277344,
      "text": " out of season, reprove, rebuke, exhort,"
    },
    {
      "id": 56,
      "start": 1325.4200134277344,
      "end": 1327.3400115966797,
      "text": " with all longsuffering and doctrine."
    },
    {
      "id": 57,
      "start": 1327.3400115966797,
      "end": 1329.4600219726562,
      "text": " He tells them, hey, the time's going to come"
    },
    {
      "id": 58,
      "start": 1329.4600219726562,
      "end": 1331.7200164794922,
      "text": " when they're not going to endure sound doctrine."
    },
    {
      "id": 59,
      "start": 1331.7200164794922,
      "end": 1332.3000183105469,
      "text": " Right?"
    },
    {
      "id": 60,
      "start": 1332.3000183105469,
      "end": 1332.8400115966797,
      "text": " Why?"
    },
    {
      "id": 61,
      "start": 1332.8400115966797,
      "end": 1334.3000183105469,
      "text": " Because after their own lusts"
    },
    {
      "id": 62,
      "start": 1334.3000183105469,
      "end": 1336.6000213623047,
      "text": " shall they heap to themselves teachers"
    },
    {
      "id": 63,
      "start": 1336.6000213623047,
      "end": 1339.1800079345703,
      "text": " having itching ears."
    },
    {
      "id": 64,
      "start": 1339.1800079345703,
      "end": 1341.7200164794922,
      "text": " We see this stuff."
    },
    {
      "id": 65,
      "start": 1341.7400207519531,
      "end": 1347.0600128173828,
      "text": " I mean, this is where we live."
    },
    {
      "id": 66,
      "start": 1347.0600128173828,
      "end": 1348.9000091552734,
      "text": " He says in v. 6"
    },
    {
      "id": 67,
      "start": 1348.9000091552734,
      "end": 1352.3600158691406,
      "text": " as we get to the point of Paul's testimony,"
    },
    {
      "id": 68,
      "start": 1352.3600158691406,
      "end": 1355.1200103759766,
      "text": " he had given this instruction to"
    },
    {
      "id": 69,
      "start": 1355.1200103759766,
      "end": 1357.4600219726562,
      "text": " this one archipis, he says,"
    },
    {
      "id": 70,
      "start": 1357.4600219726562,
      "end": 1359.8400115966797,
      "text": " Take heed to the ministry which thou hast received"
    },
    {
      "id": 71,
      "start": 1359.8400115966797,
      "end": 1362.5400085449219,
      "text": " in the Lord, that thou fulfill it."
    },
    {
      "id": 72,
      "start": 1362.5400085449219,
      "end": 1364.9600219726562,
      "text": " And Paul's personal testimony is given to us"
    },
    {
      "id": 73,
      "start": 1364.9600219726562,
      "end": 1367.9200134277344,
      "text": " in v. 6-7 of 2 Timothy 4,"
    },
    {
      "id": 74,
      "start": 1367.9200134277344,
      "end": 1372.0800170898438,
      "text": " where I am now ready to be offered."
    },
    {
      "id": 75,
      "start": 1372.0800170898438,
      "end": 1374.6600189208984,
      "text": " The time of my departure is at hand."
    },
    {
      "id": 76,
      "start": 1374.6600189208984,
      "end": 1376.3600158691406,
      "text": " I have fought a good fight."
    },
    {
      "id": 77,
      "start": 1376.3600158691406,
      "end": 1376.9600219726562,
      "text": " I love it."
    },
    {
      "id": 78,
      "start": 1376.9600219726562,
      "end": 1379.1800079345703,
      "text": " I have finished my course."
    },
    {
      "id": 79,
      "start": 1379.1800079345703,
      "end": 1381.2000122070312,
      "text": " I have kept the faith."
    },
    {
      "id": 80,
      "start": 1381.2000122070312,
      "end": 1383.3600158691406,
      "text": " We're familiar with the verses of Scripture."
    },
    {
      "id": 81,
      "start": 1383.3600158691406,
      "end": 1385.500015258789,
      "text": " We reference them often."
    },
    {
      "id": 82,
      "start": 1385.500015258789,
      "end": 1387.0800170898438,
      "text": " But I want you to really think about"
    },
    {
      "id": 83,
      "start": 1387.0800170898438,
      "end": 1389.6200103759766,
      "text": " the testimony of Paul."
    },
    {
      "id": 84,
      "start": 1389.6200103759766,
      "end": 1391.1200103759766,
      "text": " And I want you to think about"
    },
    {
      "id": 85,
      "start": 1391.1200103759766,
      "end": 1393.2200164794922,
      "text": " the instruction that he's given"
    },
    {
      "id": 86,
      "start": 1393.2200164794922,
      "end": 1395.6000213623047,
      "text": " here in Colossians 4 and v. 17"
    },
    {
      "id": 87,
      "start": 1395.6000213623047,
      "end": 1397.2400207519531,
      "text": " as he's closing this book,"
    },
    {
      "id": 88,
      "start": 1397.2400207519531,
      "end": 1399.4200134277344,
      "text": " as he's closing, and he mentions"
    },
    {
      "id": 89,
      "start": 1399.4200134277344,
      "end": 1400.8200073242188,
      "text": " several people by name,"
    },
    {
      "id": 90,
      "start": 1400.8200073242188,
      "end": 1403.3800201416016,
      "text": " and he goes through many different attributes"
    },
    {
      "id": 91,
      "start": 1403.3800201416016,
      "end": 1405.260009765625,
      "text": " of these people and what they were engaged in"
    },
    {
      "id": 92,
      "start": 1405.260009765625,
      "end": 1406.4600219726562,
      "text": " and what they were doing, but he says,"
    },
    {
      "id": 93,
      "start": 1406.4600219726562,
      "end": 1409.6600189208984,
      "text": " And say to archipis,"
    },
    {
      "id": 94,
      "start": 1409.6600189208984,
      "end": 1412.5800170898438,
      "text": " Take heed to the ministry"
    },
    {
      "id": 95,
      "start": 1412.5800170898438,
      "end": 1414.8200073242188,
      "text": " which thou hast received in the Lord,"
    },
    {
      "id": 96,
      "start": 1414.8200073242188,
      "end": 1417.780014038086,
      "text": " that thou fulfill it."
    },
    {
      "id": 97,
      "start": 1417.780014038086,
      "end": 1418.8200073242188,
      "text": " Archipis, don't give up."
    },
    {
      "id": 98,
      "start": 1418.8200073242188,
      "end": 1420.4200134277344,
      "text": " You're a fellow soldier."
    },
    {
      "id": 99,
      "start": 1420.4200134277344,
      "end": 1422.3200073242188,
      "text": " I know you're in the battle."
    },
    {
      "id": 100,
      "start": 1422.3200073242188,
      "end": 1423.780014038086,
      "text": " Sometimes when you're in the trenches of the battle,"
    },
    {
      "id": 101,
      "start": 1423.780014038086,
      "end": 1426.0600128173828,
      "text": " like I've never been a soldier"
    },
    {
      "id": 102,
      "start": 1426.0800170898438,
      "end": 1429.3600158691406,
      "text": " in the U.S. Armed Forces of any branch,"
    },
    {
      "id": 103,
      "start": 1429.3600158691406,
      "end": 1431.4400177001953,
      "text": " but I can only imagine."
    },
    {
      "id": 104,
      "start": 1431.4400177001953,
      "end": 1433.1200103759766,
      "text": " You read some of those stories"
    },
    {
      "id": 105,
      "start": 1433.1200103759766,
      "end": 1435.2000122070312,
      "text": " about some of the wars that our nation"
    },
    {
      "id": 106,
      "start": 1435.2000122070312,
      "end": 1437.9200134277344,
      "text": " has been engaged in throughout our history."
    },
    {
      "id": 107,
      "start": 1437.9200134277344,
      "end": 1441.280014038086,
      "text": " If you're a history buff"
    },
    {
      "id": 108,
      "start": 1441.280014038086,
      "end": 1444.52001953125,
      "text": " and you've read accounts of battles"
    },
    {
      "id": 109,
      "start": 1444.52001953125,
      "end": 1446.4400177001953,
      "text": " that have taken place in other portions"
    },
    {
      "id": 110,
      "start": 1446.4400177001953,
      "end": 1448.1200103759766,
      "text": " of the world history,"
    },
    {
      "id": 111,
      "start": 1448.1200103759766,
      "end": 1449.9600219726562,
      "text": " and you begin to see what's happening,"
    },
    {
      "id": 112,
      "start": 1449.9600219726562,
      "end": 1452.3800201416016,
      "text": " and you think about those fellow soldiers,"
    },
    {
      "id": 113,
      "start": 1452.3800201416016,
      "end": 1453.4800109863281,
      "text": " and you think about some of the things"
    },
    {
      "id": 114,
      "start": 1453.4800109863281,
      "end": 1455.0400085449219,
      "text": " that they experienced,"
    },
    {
      "id": 115,
      "start": 1455.0400085449219,
      "end": 1457.6200256347656,
      "text": " some of the difficulties in which they endured,"
    },
    {
      "id": 116,
      "start": 1458.9000244140625,
      "end": 1460.1200256347656,
      "text": " and Paul says,"
    },
    {
      "id": 117,
      "start": 1460.1200256347656,
      "end": 1462.780029296875,
      "text": " Archipis, take heed to this ministry"
    },
    {
      "id": 118,
      "start": 1462.780029296875,
      "end": 1464.5,
      "text": " which you've received in the Lord,"
    },
    {
      "id": 119,
      "start": 1464.5,
      "end": 1466.5,
      "text": " that thou fulfill it."
    },
    {
      "id": 120,
      "start": 1466.5,
      "end": 1467.5400085449219,
      "text": " I hope this evening"
    },
    {
      "id": 121,
      "start": 1468.7000122070312,
      "end": 1471.2400207519531,
      "text": " that sometimes when we're engaged in the battle,"
    },
    {
      "id": 122,
      "start": 1471.2400207519531,
      "end": 1472.9400024414062,
      "text": " we can become overwhelmed."
    },
    {
      "id": 123,
      "start": 1472.9400024414062,
      "end": 1474.4600219726562,
      "text": " By the way, if you watch too much news,"
    },
    {
      "id": 124,
      "start": 1474.4600219726562,
      "end": 1477.4200134277344,
      "text": " you're gonna be overwhelmed in a hurry."
    },
    {
      "id": 125,
      "start": 1477.4200134277344,
      "end": 1478.4600219726562,
      "text": " I'm just telling you."
    },
    {
      "id": 126,
      "start": 1480.2000122070312,
      "end": 1482.1600036621094,
      "text": " You're gonna be overwhelmed in a hurry."
    },
    {
      "id": 127,
      "start": 1483.0600280761719,
      "end": 1488.0600280761719,
      "text": " The enemy wants to get your mind."
    },
    {
      "id": 128,
      "start": 1488.0600280761719,
      "end": 1488.9600219726562,
      "text": " It really does."
    },
    {
      "id": 129,
      "start": 1489.8200073242188,
      "end": 1492.260009765625,
      "text": " Can I remind you that we're on the winning side?"
    },
    {
      "id": 130,
      "start": 1493.2200012207031,
      "end": 1495.5800170898438,
      "text": " We're more than conquerors in Christ,"
    },
    {
      "id": 131,
      "start": 1495.5800170898438,
      "end": 1498.1400146484375,
      "text": " but thanks be to God which giveth us the victory"
    },
    {
      "id": 132,
      "start": 1498.1400146484375,
      "end": 1500.5800170898438,
      "text": " through our Lord Jesus Christ, amen?"
    },
    {
      "id": 133,
      "start": 1500.5800170898438,
      "end": 1502.8600158691406,
      "text": " We're fellow soldiers."
    },
    {
      "id": 134,
      "start": 1502.8600158691406,
      "end": 1505.1800231933594,
      "text": " By the way, I think about this term."
    },
    {
      "id": 135,
      "start": 1505.1800231933594,
      "end": 1508.9200134277344,
      "text": " It's been said by many throughout the history,"
    },
    {
      "id": 136,
      "start": 1508.9200134277344,
      "end": 1510.9400024414062,
      "text": " really, of Christianity"
    },
    {
      "id": 137,
      "start": 1510.9600219726562,
      "end": 1513.9600219726562,
      "text": " where, I shouldn't say the entire history,"
    },
    {
      "id": 138,
      "start": 1513.9600219726562,
      "end": 1516.8400268554688,
      "text": " the recent history, I guess I should say it that way,"
    },
    {
      "id": 139,
      "start": 1516.8400268554688,
      "end": 1520.6800231933594,
      "text": " that far too often as a soldier,"
    },
    {
      "id": 140,
      "start": 1520.6800231933594,
      "end": 1522.5600280761719,
      "text": " as a fellow believer is wounded"
    },
    {
      "id": 141,
      "start": 1522.5600280761719,
      "end": 1525.0800170898438,
      "text": " that we kick our own wounded."
    },
    {
      "id": 142,
      "start": 1525.0800170898438,
      "end": 1527.9800109863281,
      "text": " It ought not be that way, brethren."
    },
    {
      "id": 143,
      "start": 1527.9800109863281,
      "end": 1530.0400085449219,
      "text": " We're fellow soldiers."
    },
    {
      "id": 144,
      "start": 1530.0400085449219,
      "end": 1533.3600158691406,
      "text": " We wanna encourage them that thou fulfill it."
    },
    {
      "id": 145,
      "start": 1533.3600158691406,
      "end": 1536.4400024414062,
      "text": " See, because you have a race that you're running,"
    },
    {
      "id": 146,
      "start": 1536.4400024414062,
      "end": 1537.760009765625,
      "text": " and as we run our race,"
    },
    {
      "id": 147,
      "start": 1537.760009765625,
      "end": 1540.4800109863281,
      "text": " we're not competing with one another."
    },
    {
      "id": 148,
      "start": 1540.8200073242188,
      "end": 1544.6600036621094,
      "text": " We're simply striving to please him"
    },
    {
      "id": 149,
      "start": 1544.6600036621094,
      "end": 1548.02001953125,
      "text": " who's called us to be a soldier."
    },
    {
      "id": 150,
      "start": 1548.02001953125,
      "end": 1549.5800170898438,
      "text": " And what a blessing."
    },
    {
      "id": 151,
      "start": 1549.5800170898438,
      "end": 1553.8200073242188,
      "text": " To think about this really obscure Bible character,"
    },
    {
      "id": 152,
      "start": 1553.8200073242188,
      "end": 1556.5600280761719,
      "text": " archivist, we don't know a whole lot about him,"
    },
    {
      "id": 153,
      "start": 1556.5600280761719,
      "end": 1559.3800048828125,
      "text": " but Paul says, I wanna get a message to him."
    },
    {
      "id": 154,
      "start": 1560.8800048828125,
      "end": 1563.2200012207031,
      "text": " Again, I don't know all of the circumstances"
    },
    {
      "id": 155,
      "start": 1563.2200012207031,
      "end": 1565.4200134277344,
      "text": " surrounding this man's ministry"
    },
    {
      "id": 156,
      "start": 1565.4200134277344,
      "end": 1567.6200256347656,
      "text": " and all that he was dealing with,"
    },
    {
      "id": 157,
      "start": 1567.6200256347656,
      "end": 1569.260009765625,
      "text": " but can I tell you today,"
    },
    {
      "id": 158,
      "start": 1570.7000122070312,
      "end": 1575.5800170898438,
      "text": " that I get reports, I get phone calls,"
    },
    {
      "id": 159,
      "start": 1575.5800170898438,
      "end": 1578.5800170898438,
      "text": " I read articles about people in the ministry"
    },
    {
      "id": 160,
      "start": 1578.5800170898438,
      "end": 1581.3400268554688,
      "text": " that quit every single day."
    },
    {
      "id": 161,
      "start": 1583.02001953125,
      "end": 1584.0800170898438,
      "text": " Hundreds."
    },
    {
      "id": 162,
      "start": 1585.4800109863281,
      "end": 1586.3600158691406,
      "text": " It's sad."
    },
    {
      "id": 163,
      "start": 1588.4200134277344,
      "end": 1590.4200134277344,
      "text": " I don't know the reason for all of them."
    },
    {
      "id": 164,
      "start": 1591.3000183105469,
      "end": 1592.9000244140625,
      "text": " There's no way I could."
    },
    {
      "id": 165,
      "start": 1592.9000244140625,
      "end": 1594.9400024414062,
      "text": " I don't know the real reason for many of them,"
    },
    {
      "id": 166,
      "start": 1594.9400024414062,
      "end": 1596.3000183105469,
      "text": " to be real honest with you."
    },
    {
      "id": 167,
      "start": 1597.3800048828125,
      "end": 1599.260009765625,
      "text": " But I do know this."
    },
    {
      "id": 168,
      "start": 1599.260009765625,
      "end": 1601.5,
      "text": " I've heard people say something like this."
    },
    {
      "id": 169,
      "start": 1603.0,
      "end": 1604.1600036621094,
      "text": " It's just too much."
    },
    {
      "id": 170,
      "start": 1605.1200256347656,
      "end": 1606.7000122070312,
      "text": " It's too hard."
    },
    {
      "id": 171,
      "start": 1606.7000122070312,
      "end": 1611.0800170898438,
      "text": " I had one man, I tried to encourage him,"
    },
    {
      "id": 172,
      "start": 1611.0800170898438,
      "end": 1612.9600219726562,
      "text": " and I used this terminology."
    },
    {
      "id": 173,
      "start": 1612.9600219726562,
      "end": 1613.8800048828125,
      "text": " He was ready to quit."
    },
    {
      "id": 174,
      "start": 1613.8800048828125,
      "end": 1616.8200073242188,
      "text": " I mean, he had dealt with a bad situation."
    },
    {
      "id": 175,
      "start": 1618.3600158691406,
      "end": 1622.52001953125,
      "text": " And I said to this man, as I spoke to him on the phone,"
    },
    {
      "id": 176,
      "start": 1622.52001953125,
      "end": 1625.6800231933594,
      "text": " I said, listen, brother, you're at a crossroads."
    },
    {
      "id": 177,
      "start": 1626.8000183105469,
      "end": 1629.0600280761719,
      "text": " Don't be discouraged."
    },
    {
      "id": 178,
      "start": 1629.8200073242188,
      "end": 1631.1600036621094,
      "text": " Keep your eyes on Jesus."
    },
    {
      "id": 179,
      "start": 1631.1600036621094,
      "end": 1632.9600219726562,
      "text": " He's got a plan."
    },
    {
      "id": 180,
      "start": 1632.9600219726562,
      "end": 1634.6800231933594,
      "text": " We don't understand all this mess"
    },
    {
      "id": 181,
      "start": 1634.6800231933594,
      "end": 1636.3800048828125,
      "text": " that you're dealing with right now,"
    },
    {
      "id": 182,
      "start": 1636.3800048828125,
      "end": 1639.2400207519531,
      "text": " but we know that the enemy's at work."
    },
    {
      "id": 183,
      "start": 1639.2400207519531,
      "end": 1641.5600280761719,
      "text": " Keep your eyes on Jesus,"
    },
    {
      "id": 184,
      "start": 1641.5600280761719,
      "end": 1643.8000183105469,
      "text": " and just understand that you're at a crossroads."
    },
    {
      "id": 185,
      "start": 1643.8000183105469,
      "end": 1645.1600036621094,
      "text": " Here's what his words were."
    },
    {
      "id": 186,
      "start": 1647.6000061035156,
      "end": 1650.0,
      "text": " He said, no, I'm at a dead end."
    },
    {
      "id": 187,
      "start": 1652.6400146484375,
      "end": 1653.4800109863281,
      "text": " It hurt."
    },
    {
      "id": 188,
      "start": 1654.4600219726562,
      "end": 1659.4600219726562,
      "text": " Because his perspective was, I'm done with this."
    },
    {
      "id": 189,
      "start": 1660.6600036621094,
      "end": 1662.6200256347656,
      "text": " It's too much."
    },
    {
      "id": 190,
      "start": 1662.6200256347656,
      "end": 1665.1600036621094,
      "text": " And that's exactly what the enemy wants to do."
    },
    {
      "id": 191,
      "start": 1667.1800231933594,
      "end": 1668.02001953125,
      "text": " Right?"
    },
    {
      "id": 192,
      "start": 1668.02001953125,
      "end": 1670.1000061035156,
      "text": " That's what he wants to do."
    },
    {
      "id": 193,
      "start": 1670.1000061035156,
      "end": 1672.9800109863281,
      "text": " And so Paul says, deliver this message to Archippus."
    },
    {
      "id": 194,
      "start": 1672.9800109863281,
      "end": 1674.2400207519531,
      "text": " He's a fellow soldier."
    },
    {
      "id": 195,
      "start": 1674.2400207519531,
      "end": 1677.1000061035156,
      "text": " That's how he's identified, but he's instructed."
    },
    {
      "id": 196,
      "start": 1677.1000061035156,
      "end": 1679.9800109863281,
      "text": " Take heed to the ministry which thou hast received"
    },
    {
      "id": 197,
      "start": 1679.9800109863281,
      "end": 1684.7200012207031,
      "text": " in the Lord, that thou fulfill it."
    },
    {
      "id": 198,
      "start": 1684.7200012207031,
      "end": 1685.5600280761719,
      "text": " Father, we love you."
    },
    {
      "id": 199,
      "start": 1685.5600280761719,
      "end": 1688.02001953125,
      "text": " We thank you for loving us."
    },
    {
      "id": 200,
      "start": 1688.02001953125,
      "end": 1689.8800048828125,
      "text": " God, we thank you for your word."
    },
    {
      "id": 201,
      "start": 1692.8800048828125,
      "end": 1695.4800109863281,
      "text": " Lord, we know that we're engaged in spiritual battle"
    },
    {
      "id": 202,
      "start": 1695.4800109863281,
      "end": 1696.9400024414062,
      "text": " and spiritual warfare."
    },
    {
      "id": 203,
      "start": 1699.6800231933594,
      "end": 1703.1600036621094,
      "text": " Lord, we know that you've given us in thy word"
    },
    {
      "id": 204,
      "start": 1703.1600036621094,
      "end": 1705.4000244140625,
      "text": " truth with regard to the last days"
    },
    {
      "id": 205,
      "start": 1705.4000244140625,
      "end": 1708.0400085449219,
      "text": " and the things that will endure."
    },
    {
      "id": 206,
      "start": 1708.0600280761719,
      "end": 1710.3000183105469,
      "text": " God, I pray that you'd help us to be strong"
    },
    {
      "id": 207,
      "start": 1710.3000183105469,
      "end": 1712.5400390625,
      "text": " in the Lord and the power of his might."
    },
    {
      "id": 208,
      "start": 1712.5400390625,
      "end": 1714.260009765625,
      "text": " Help us, God, to understand that we need"
    },
    {
      "id": 209,
      "start": 1714.260009765625,
      "end": 1716.1400146484375,
      "text": " to put on the whole armor of God."
    },
    {
      "id": 210,
      "start": 1717.4600219726562,
      "end": 1719.1400146484375,
      "text": " Help us to understand that we wrestle not"
    },
    {
      "id": 211,
      "start": 1719.1400146484375,
      "end": 1721.02001953125,
      "text": " against flesh and blood."
    },
    {
      "id": 212,
      "start": 1721.02001953125,
      "end": 1723.6600341796875,
      "text": " The weapons of our warfare are not carnal."
    },
    {
      "id": 213,
      "start": 1723.6600341796875,
      "end": 1724.6199951171875,
      "text": " They're spiritual."
    },
    {
      "id": 214,
      "start": 1726.6199951171875,
      "end": 1729.1400146484375,
      "text": " Help us, God, to understand that you"
    },
    {
      "id": 215,
      "start": 1729.1400146484375,
      "end": 1730.9800415039062,
      "text": " have called us to be a soldier."
    },
    {
      "id": 216,
      "start": 1732.5,
      "end": 1734.2200317382812,
      "text": " Help us to be a good soldier."
    },
    {
      "id": 217,
      "start": 1735.9000244140625,
      "end": 1737.4600219726562,
      "text": " Help us to fulfill."
    },
    {
      "id": 218,
      "start": 1738.5400390625,
      "end": 1739.7000122070312,
      "text": " To finish."
    },
    {
      "id": 219,
      "start": 1739.7000122070312,
      "end": 1741.739990234375,
      "text": " To complete our race."
    },
    {
      "id": 220,
      "start": 1744.5400390625,
      "end": 1747.1000366210938,
      "text": " I pray that you would work in each heart,"
    },
    {
      "id": 221,
      "start": 1747.1000366210938,
      "end": 1748.3400268554688,
      "text": " in each individual."
    },
    {
      "id": 222,
      "start": 1749.7000122070312,
      "end": 1752.4400024414062,
      "text": " Lord, help us to just keep our eyes on Jesus."
    },
    {
      "id": 223,
      "start": 1753.8200073242188,
      "end": 1757.5599975585938,
      "text": " We know that the enemy is ruthless, relentless."
    },
    {
      "id": 224,
      "start": 1759.9000244140625,
      "end": 1764.4600219726562,
      "text": " He's walking about seeking whom he may devour."
    },
    {
      "id": 225,
      "start": 1765.9000244140625,
      "end": 1767.8599853515625,
      "text": " But God, we're on the winning side."
    },
    {
      "id": 226,
      "start": 1768.6400146484375,
      "end": 1770.4400024414062,
      "text": " More than conquerors through Christ."
    },
    {
      "id": 227,
      "start": 1770.4400024414062,
      "end": 1773.6000366210938,
      "text": " Thank you for the victory that is possible"
    },
    {
      "id": 228,
      "start": 1773.6000366210938,
      "end": 1776.8800048828125,
      "text": " only through the Lord Jesus Christ."
    },
    {
      "id": 229,
      "start": 1776.8800048828125,
      "end": 1777.9600219726562,
      "text": " Work in hearts and lives."
    },
    {
      "id": 230,
      "start": 1777.9600219726562,
      "end": 1779.3599853515625,
      "text": " Help us, Lord."
    },
    {
      "id": 231,
      "start": 1779.3599853515625,
      "end": 1780.239990234375,
      "text": " We'll thank you for it."
    },
    {
      "id": 232,
      "start": 1780.239990234375,
      "end": 1782.5599975585938,
      "text": " In Christ's name we pray, amen."
    }
  ],
  "processed_at": "2025-04-17T16:35:04.520600"
}