{
  "video_id": "oHhbZQxf4Do",
  "text": "37 this evening, Genesis chapter number 37 this evening. And I've titled the message, Joseph was 17 years old. My Joseph is only 16. And I was thinking about that this week. And as I obviously were preparing for Brianna's graduation party and all of those things, and then thinking about Joseph as I'm writing and studying this message and thinking about our youngest is 16, it's amazing how quickly time goes by. And I was thinking about the life of Joseph here in the Bible. It's interesting in Genesis chapter 36, we dealt with this chapter last week in Genesis chapter 36. The Bible talks about these are the generations of Esau. And we looked at a number of things last week from that portion of scripture and made some application that I believe would be helpful for us to understand. As we get into Genesis chapter 37, you'll note that there's a term very similar to what we see a phrase that we see in verse number one of chapter 36. Here in chapter number 37, it's verse number two. And the Bible says these are the generations of Jacob. And so we saw in Genesis 36, the generations of Esau. Here in Genesis chapter number 37, we will read of the generations of Jacob. We find that specifically it is here that the lens of scripture will focus upon the life of Joseph. Of course, we understand that from here, Genesis 37 through the end of the book, chapter number 50, every portion of the remaining chapters, except for chapter 38, deal with some aspect of the life of Joseph. And what a godly young man, what a man that was used for the glory of God. And many of you know, I've shared this over the years, that Joseph is my favorite Bible character. And thus our son is not Christopher III, he is Joseph Christopher, just because of the significance of the Bible character Joseph. It's hard to believe, in just about six weeks or so, we'll be here for 12 years as being the pastor, and I've never preached through the life of Joseph. And though he's my favorite Bible character, the Lord's just never led me and never given me that liberty or direction to preach through the life of Joseph. And so I am so excited about the opportunity here on Sunday evenings for the next several months to be able to study through the life of Joseph. We first read of the character, the Bible character Joseph in Genesis chapter 30, verses 22 through 24. We won't take the time to turn back there, but it's there in those verses that God records for us the birth of Joseph. And we read that from that point until here in Genesis chapter number 37, obviously 17 years past, because the text tells us that he's 17 years old. There's only a couple of references to the life of Joseph from Genesis chapter 30 to Genesis chapter number 37. And both of those are found in Genesis 32 and 33, simply stating how that Jacob in preparing to meet Esau put them in the back of the camp and so on and so forth. And so his name is just mentioned very briefly. And so nothing about him is given to us as far as his life, his upbringing and so on and so forth. And so we come here to Genesis 37 and we read that he's 17 years old, but notice what the Bible tells us beginning in verse number one. And Jacob dwelt in the land wherein his father was a stranger in the land of Canaan. These are the generations of Jacob. Joseph being 17 years old was feeding the flock with his brethren. The lad was with the sons of Bilhah and with the sons of Zilpah, his father's wives, and Joseph brought unto his father their evil report. Now Israel loved Joseph more than all his children because he was the son of his old age. And he made him a coat of many colors. And when his brethren saw that their father loved him more than all his brethren, they hated him and could not speak peaceably unto him. As we come to this text of scripture this evening, I just have two thoughts for you. Number one, if you're taking notes, notice with me the childhood of Joseph. We don't have much scripture that God would give us the insight into the particulars of Joseph's childhood, his upbringing. But as we begin to think about the text of scripture here and read that he's 17 years old, and we can understand as we've studied through these chapters in the book of Genesis, we can piece things together with regard to the childhood of Joseph. I do not believe that it's here in verse three and four when he's 17 years old that it's first known to the family that he was the most loved son. It is not the result of Joseph bringing unto his father their evil report that he, Joseph, was given a coat of many colors. I believe that happened many years earlier in his life, and it was a known thing. And as we begin to think about the childhood of Joseph, we have made it known in previous messages, we've noted the fact that the family that Joseph was brought up in obviously was dysfunctional. It was a dysfunctional family. We hear that term today kind of tossed around, and we understand what some would imply or mean by that phraseology of being a dysfunctional family. But as you would go back, and we're not gonna take the time this evening to review it, but if you'd go back to Genesis chapter 29 and 30, you would find that the conflict between Leah and Rachel along with their handmaids is well-documented. We studied through those chapters in chapter 29 and 30, and it was just, I mean, mind-blowing, some of the things that were taking place within the family, and just the conflict between Leah and Rachel and all that was going on. And we think about that conflict, and we know that Joseph is the son of Jacob's old age, and we know that he's the son of Jacob and Rachel, but remember, Rachel was the one that was, if you wanna use the term, the favorite wife, okay? And so now, all of a sudden, he has this son from his favorite wife. I mean, it's just a dysfunctional family. We find that not only was it a dysfunctional family, but he's there, he's born into the time of Jacob's life when Jacob has already fled from the face of Esau, because Esau said, I'm gonna kill my brother because he took the blessing. He's already stolen the birthright, now he's taking the blessing, and I'm gonna kill him, and so Jacob has to go to Paddan Aram, and of course, it's there where Joseph would be born, and you think about the years there with Laban. They were turbulent years. I mean, they were difficult years. All of the things that we've studied and all that had taken place, and you begin to look at that timing and Joseph being raised up, being brought up in that kind of a setting, the childhood of Joseph. The family was divided. The text of Scripture makes it clear that Joseph was loved more than all the other children. Now, that's a real problem. Sometimes we joke about who's a favorite child, and those of you that are only children, you just hold that title all to your own, right? But those that have siblings, my brother and I will tease with my parents, my mom in particular, because it really bothers her, when we'll say that, well, we know he's your favorite, and so on and so forth. But the reality is that this was legitimate how their life and their upbringing was. This is what was going on in the home. It was known. And the Bible says in verse number three, now Israel loved Joseph more than all his children, because he was the son of his old age, and he made him a coat of many colors. No doubt, and we see obviously within the text of Scripture that this love that Jacob had for Joseph that surpassed the love that he had for his other children, this would cause great conflict in the home. When I think about the conflict in the home, listen, I'm thankful that God has given us instruction as word how that we can have a home that is harmonious and melodious, a home that honors the Lord, where it can be void of conflict, and when conflict would enter into a relationship, whether that relationship is the home or some other entity, that God has given us instruction on how to resolve conflict. But we find that within the home of Jacob, there's all of this dysfunction, and this is how Joseph is raised. This is what he's seeing. This is what he's experiencing. And we find that in verse number four, I want you to see what the Bible says. And when his brethren saw that their father loved him more than all his brethren, I think that they saw a whole lot more than just a coat of many colors. They saw actions and behaviors and favors and whatever it was, they saw the evidence of this truth that Jacob loved Joseph more than all of his children. It was obvious to them. And the Bible says that when they saw that, notice what it says, they hated him. They hated him. That's strong language. Not sure if any of you ever said when you were a child or if any of the children in here ever said something about hating someone, but I know that if it was ever even spoken in our home, whether it was when I was a child or from our children, that language was not allowed. We didn't use that terminology. I've heard children say, well, I hate broccoli. No, no, no, you can just say you don't like it. We try to avoid that word, but think about. what is carried here with this context of God revealing to us that the Bible says that they hated him. They hated him. Now, I want you to think about Joseph for just a moment. Was there anything that he did to make his father love him more than any of the other brethren? I mean, as far as we can tell, the Bible says here in verse number 3 that Jacob loved him more than all his other children. Why? Because he was the son of his old age. There was nothing that we can tell biblically that caused Joseph to have this elevated favor and love from his father, but we find that the Bible tells us that it was obvious and the brethren knew it, the brothers saw, and they were aware of this, and they hated him. I'm not sure if you've ever had somebody that's really disliked you. You take it to a level of hatred. It's beyond really maybe for many of us our ability to comprehend. And the Bible says that they hated him, and notice how it's described here, and could not speak peaceably unto him. Now, can you imagine the dysfunction in this home? Can you imagine the childhood of Joseph growing up in this setting, in this environment? The families, as we'll see, as we'll note in just a moment, obviously as we understand the timing and all that's going on at this particular era of history, they spent a lot of time together. They were close to one another, and yet the Bible tells us that Joseph had to deal with this regular animosity. They could not speak peaceably unto him. I can't imagine growing up in that fashion, honestly. I really can't. I'm sure that as a parent, I know we experienced this, and I'm sure that as a parent you experienced, will my kids ever love each other? They fight all the time. What's going on? But this is a whole other level. It's a whole other level. When I think about the childhood of Joseph, and we come to Genesis 37, and God introduces us to Joseph, and what he tells us in verse number 2 about Joseph, reveals to me not only as we would consider the childhood of Joseph, but I want you to think about the character of Joseph. The character of Joseph. The Bible tells us in verse number 2, these are the generations of Jacob. Joseph, being 17 years old, notice what the Bible says, was feeding the flock with his brethren. As we begin to think about the character of Joseph, I would say first of all, that when we note the character of Joseph, that we must note that he was a worker. He was a worker. The Bible says that he was feeding the flock. That's work. That's labor. And I want you to think about the character. Listen, it takes a measure of character to do hard work. We live in a time in which people seem to be allergic to hard work. It can drive you crazy in the society in which we live. Honestly. The idea of just being a hard worker is something that many times has slipped by in our society today. And we find that here, as you look at the text of Scripture, that Joseph, he's only 17 years old, but he was feeding the flock, and he's a hard worker. I believe that there was a measure of diligence in his work. I believe that as he's working, and he's doing what he's been instructed to do, that this is honoring to God. You know, we're to be hard workers. What's your hand find it to do? Do it how? Half-heartedly? No. With all thy might. We think about this thing. You've heard the term, obviously, we live in the greater DC area, that people will use that phraseology, it's good enough for government work. Has anyone ever heard somebody use that phraseology? It's good enough for government work. Listen, that ought not be the perspective of God's people. God honors hard work. And we find that as we look here, remember, you understand that sometimes we have the idea that work is part of the curse. But you know that Adam had a responsibility to work before the curse. There was a responsibility that God gave to Adam that was work. Now, you understand the work intensified after the curse, but there was work. And we begin to think about this subject of work and we look at the character. Listen, the character of a man is important for us to understand. And as we begin to enter into the study of the life of Joseph, it's important for us to understand the character of Joseph. And we find, as I referenced already there in Colossians 3 and verse 23, and whatsoever you do, do it heartily as to the Lord and not unto men. You know, your perspective of work and my perspective of work ought to be different than our lost co-workers. It ought to be different than our lost co-workers. The young people in our church, you know what, they need to learn how to work. Honestly, they didn't learn how to work. It's good for them to move tables around. It's good for them to, I'll pick just from little Ari, he's tired this afternoon, but man, he was pulling weeds the other night outside after church. He's just pulling weeds. And I went to Pierre and Kimberly, I said, man, he's pulling weeds. He can come back anytime he wants. We've got a whole lot of weeds. He's pulling weeds. A little Isaac a few weeks ago, probably actually six or eight weeks ago now, I was out on a Wednesday evening before church and just a couple of people were here and the porch had all kinds of stuff that had blown on it from the wind and the trees and what have you. And I'm out there with a broom and I'm sweeping the porch. Isaac is watching me. You know, Isaac's a thinker. He really is. Isaac, how you doing? And there's like this long pause. Good. And I'm like, that's not like, it's not like most of us. How are you doing? Good. And you just don't even think about it. Right. But Isaac and Isaac kind of watching me and then he goes away and he goes into the van of the tray hose. He comes back and his little kids broom and he starts helping me sweep the porch. I didn't ask him to help me. It's good for kids to learn how to work. It really is. And we see in the truth of God's Word with regard to work. Listen, the Bible tells us if a man doesn't work, he shouldn't eat. Now I understand that's not popular today. I understand. But it's biblical. It's biblical. And hard work we see in the life as we begin to look at the life of Joseph and as we begin an introduction for this study that will spend and span a number of chapters from God's Word with regard to the life of Joseph, we see here that he's, he's working. But notice what the Bible says back in Genesis chapter 37 and verse number two. I want you to notice that the Bible says this. These are the generations of Jacob. Joseph being 17 years old was feeding the flock. Did you notice the next three words? With his brethren. He's feeding the flock with the very ones that hate him, with the very ones that cannot speak peaceably unto him. And he's working with them. Now I can only imagine and this is just my perspective. This is, the Bible doesn't tell us this but it's just my perspective. I would think that if they hated him and could not speak peaceably unto him that they probably tried to give him the hardest jobs. And give him the tasks that they didn't want to do. By the way, he's younger. They're older. You think about that dynamic. And I see Joseph here and I think about the fact that he's working, that he's feeding the flock and he's working right alongside those that hate him. Just because they hated him doesn't mean he has to hate them. The Bible tells us in Romans chapter 12, if you want to take a moment to turn there, in Romans chapter number 12 God gives us some instruction that quite honestly goes against your flesh and my flesh. But the Bible tells us in Romans chapter number 12, in verse number 17, recompense to no man evil for evil. Provide things honest in the sight of all men. Notice verse 18, if it be possible, as much as life in you, live peaceably with all men. Sometimes that's a challenging verse of scripture to live out in your life. Joseph was hated by his brethren. They could not speak peaceably unto him. But he's working with them. He's working with them. Just because they hated him doesn't mean he has to hate them. Dearly beloved, verse 19, avenge not yourselves but rather give place unto wrath for it is written vengeance is mine. I will repay, saith the Lord. Therefore, if thine enemy hunger, feed him. If he thirst, give him drink. For in so doing, thou shalt heap coals of fire in his head. Be not overcome of evil, but overcome evil with good. Listen, that goes against your flesh and my flesh. It really does. That's trusting God. That's taking your walk of faith to a whole nother level. And we find that here, it reminds me of the relationship or the interaction, if you will, between David and Saul. Saul wanted to kill David. Saul tried to get others to kill him. He tried to get the Philistines to kill him and tried to get his own men to kill him. And then David is hunted by Saul. He goes out, he's seeking him every day. He's going and doing all that he can. David says it this way, there's but a step between me and death. He understood. But just because Saul made David his enemy, and the Bible says he made him his enemy continually, doesn't mean that David viewed Saul as an enemy. When David had opportunity to kill Saul, he didn't do it. He didn't raise his hand against God's anointed. And this evening, when I look at the character of this man, Joseph, I understand his childhood and I understand what's going on as we begin to piece Scripture together and look at what God tells us about the dysfunction of the family and all that Joseph would have dealt with. But as I come and I look at the character of Joseph, I see that he's a man that's hardworking. I see that he's working even amongst those that hate him and cannot speak peaceably unto him. That tells me a lot about a man's character. That he's not fleshly minded. Remember we looked at the life there last Sunday night, looked at Genesis 36 when we talked about Esau. He's a fleshly minded man. The Bible tells us the contrast between Jacob and Esau. Remember, why was all that was taking place there even in the womb and the struggle within the womb and God answered and said there's two nations within thy womb. But we understand that by application there were two natures. Jacob representing the spirit and Esau representing the flesh. And here in the text of Scripture, we do not see that Joseph was a man that was operating within the flesh. He was a man that was trusting the Lord. By the way, if you think about all of the things that we will study, all of the events that are recorded in the life of Joseph and many of us are familiar with his life, the character of Joseph was not developed when he was in the pit. The character of Joseph was not developed when he was in the prison. The character of Joseph was developed when he was just a young man. You know, when he was dealing with all that he was dealing with, what's happening is God is revealing to us his character. And here we see at the very start of God's introduction to this man, Joseph, we see there's a man of character. I would say this, not only was he hard working, not only was he a man that was not given to the flesh, but I find this, that he was a man that had a moral compass. What do I mean by that? Well, he was a man that obviously knew the difference between right and wrong, good and evil. The Bible says in verse number two that they're there feeding the flock with his brethren and the lad was with the sons of Bilhon, with the sons of Zilpah, so the Bible tells us which of the sons specifically he was there with as they were working and it ends in verse number two by saying this, and Joseph brought unto his father their evil report. He brought unto their father, Jacob, their evil report. Joseph had a moral compass. With all that he dealt with and all of the dysfunction within the family, with all of the turbulent times that were there in Paddan Aram with Laban and all that had taken place, evidently God had worked in Joseph's life for him to have an understanding of who God is. And the difference between right and wrong, good and evil. Listen, when he stood in Potiphar's house and Potiphar's wife said continually, lie with me day by day, it wasn't in that moment that all of a sudden Joseph developed this moral compass. No, early in his life he was able to understand that there's a God and there's truth and there's right and there's wrong, there's good and there's evil. And he said, how then can I do this evil in the sight of God? And that's a powerful statement that Joseph makes. But we find all the way back here in Genesis 37 when we're first introduced to this man Joseph that he has a moral compass and begin to meditate upon this truth that he's bringing to his father, their evil report, and I'm reminded of what happened in Genesis 35. Turn back, if you will, to Genesis chapter number 35. We studied this portion of scripture several weeks ago, but I want you to understand that as you come here to Genesis chapter 35, the reunion with Esau has already taken place and all that's gone on there, but we find that the Bible tells us, remember in chapter 34, we read of that situation with the massacre at Shechem and all that took place and we dealt with that, but you come to chapter 35 and God says to Jacob in verse number one, arise, go up to Bethel, and dwell there. And we made note as we studied Genesis chapter number 35 that they were going to Bethel, they were going to the house of God. And Jacob gave some instruction to his family when they were preparing to go to the house of God. And he says to them in verse number two, then Jacob said unto his household and to all that were with him, put away the strange gods that are among you and be clean and change your garments and let us arise and go up to Bethel and I will make there an altar unto God who answered me in the day of my distress and was with me in the way which I went. Jacob had been to Bethel before. As far as I can tell in my Bible study, Joseph has not been to Bethel until this time in Genesis 35, but Jacob had been at Bethel and Jacob had experienced that and Jacob knew what God did when he was there in Bethel and he says to his family, he says, we're going to go to Bethel and we are going to worship God. And as I preached through Genesis chapter 35 several weeks ago, I mentioned how that we must be prepared for worship. He tells them in verse two, to put away the strange gods that are among you, to be clean and to change your garments. I'm not gonna re-preach what I preached a few weeks ago, but I believe this evening that as we come to chapter 37 and we're introduced to Joseph as a 17 year old young man, that their moral compass that was developed in Joseph, that somehow there was an impact in his life from that experience in Genesis 35 when they went to Bethel, when they went to the house of God. And God did something in Joseph's life. Joseph, listen, I understand that the other sons were there but you understand there are a whole bunch of people that heard Jesus preach and some left doing what Jesus said and others left not doing what Jesus said. It wasn't in the message or the messenger, it was in the individual. We find that Jesus said, those that hear and do are like the wise man. Those that hear and do not are like the foolish man. We sing the song with the children, the wise man built his house upon the rocks. We find that here, that though the other sons, they went to Bethel as well, I believe that Joseph had an encounter with God that had an impact in his life, that helped him have this moral compass. You understand this evening that there is right and wrong. There is good and evil. Our theme for Vacation Bible School will be dealing with this truth of being keepers of the kingdom and dealing with the fact that there are two kingdoms in this world. There's a kingdom for good and there's a kingdom for evil. Good master is what one said to Jesus. And Jesus said, why calleth me good? Who defines good? God, because only God is good. And when God tells us in his word to do good, we have to go to the Bible and find out what that is, what pleases him. And we find that Joseph having this moral compass, being 17 years old, the Bible says that he brought unto his father their evil report. You're in a situation where you knew you had to do something right, but it was gonna be hard to do. Some people would look at verse number two and say that Joseph was a tattletale. He's running back and I don't look at it that way. He had a moral compass. And so what those boys are doing. is not right. And it had to have been so egregious that Joseph understood that Jacob had to be aware of this. And Joseph had courage to bring that evil report back to his father. I don't think it would be easy. I really don't. I think that understanding the childhood and the upbringing, the family dynamic, and understand the Bible says they hated him and they could not speak peaceably unto him. Obviously in just a little while we'll find how they take him and they're gonna conspire to kill him. And then they say, well, no, let's just sell him because we can get some money for him, and so on and so forth. But we find here that when Joseph brought unto his father their evil report, this took a measure of courage. He didn't just turn a blind eye. I understand this evening that it's not popular, it's not comfortable to confront someone about their wicked behavior, to deal with something. But I would submit to you this evening that there is right and there is wrong. There's good and there's evil. There are times in our lives where God will put us in a place where we have to have that moral compass and we have to be willing to have that measure of courage to be able to stand and say, no, that's just not right. That's just not right. He had this moral compass and therefore he stood for right. He stood for right. I think about Nathan. I already mentioned about David and Saul. But think about Nathan. God supernaturally revealed to Nathan the sin of David and then instructed him to confront David. By the way, it's no easy task to go stand before a king and to say, thou art the man. But it was necessary. It was needful. And I think about Joseph here in Genesis chapter 37. And I think about Joseph and I think about his character and how he brought unto his father their evil report. And as I look at that statement and I see what's happening, yes, the moral compass, but the standing for right. Look over to Ephesians chapter 6, if you will. Ephesians chapter number 6. As we look at Ephesians 6, we're familiar with the passage of scripture. As we think about the character of Joseph and the need for us this evening to stand, we sing, stand up, stand up, stand up for Jesus. God says through Paul to the believers of Ephesus, finally in verse number 10 of Ephesians 6, my brethren, be strong in the Lord and the power of His might. Put on the whole armor of God, why? That you may be able to stand against the wiles of the devil. For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places. Wherefore, take unto you the whole armor of God, that you may be able to withstand in the evil day, having done all to stand. Stand therefore, having your loins girt about with truth, and having on the breastplate of righteousness, your feet shod with the preparation of the gospel of peace. Above all, taking the shield of faith, wherewith ye shall be able to quench all the fiery darts of the wicked, and take the helmet of salvation and the sword of the Spirit, which is the word of God. As you read these few verses of scripture, verse 18 says, praying always with all prayer and supplication of the Spirit, and watching thereunto with all perseverance and supplication for all saints. But as you read through this portion of scripture, you'll see stand or withstand mentioned several times. We're living in a time where we need some of God's people to have the kind of character that Joseph had. As a 17 year old boy, to stand up for truth, to stand up for right, what you're doing is wrong. It's evil. It's ungodly. Again, it must have been egregious for Joseph to have that understanding that he had to bring this evil report to his father Jacob. No doubt this would only add to the dysfunction of the family, to the hatred of the brethren towards Joseph. But Jesus said this, if the world hates you, just remember that they hated me first. If you read through the Gospel of John, you find that God is preparing His servants. Look over, if you will, at John 15, and notice what the Bible says as you begin to look through this portion of scripture and begin to understand as the Lord Jesus Christ is trying to prepare His children for their service to Him. Listen, if the world loves us, there's probably something wrong. Honestly. Look at John 15 and verse 18. If the world hates you, you know that it hated me before it hated you. If ye were of the world, the world would love his own. But are we to be of the world? The Bible says love not the world, neither the things that are in the world. The Bible tells us that if we love the world, that the love of the Father is not in us. You read the book of James, it's pretty strong language that if we're friends with the world, that we're enemies of God. That's pretty strong language. Here he says in verse 19, if ye were of the world, the world would love his own. But because you're not of the world, but I have chosen you out of the world, therefore the world hateth you. Remember the word that I said unto you, the servant is not greater than his Lord. If they have persecuted me, they will also persecute you. If they have kept my saying, they will keep yours also. But all these things will they do unto you for my name's sake, because they know not him that sent me. We could read through the end of the chapter, we could read into the beginning of chapter 16, and we could read all of that text and see how the Lord is preparing his servants, but we find here this evening that listen, when we stand for truth and we stand for right, when we have that moral compass that is the result of the biblical truth that God has given us, it's not going to make us popular with the world. But I'd rather be right with God than popular with the world. And this evening, listen we're dealing with some things in our world today. We're dealing with some crazy things in our world today. There's right and wrong. There's good and evil. When I begin to look at the life of Joseph and all the things that we're studying, all the events that God gives us, I see in just these first few verses of introduction that Joseph was a man of character. At 17 years old, he had character. He stood for what was right. Listen, he could have, as some have developed today in our society, developed some kind of a victim mentality. Excused his not serving the Lord because of his upbringing and all the things that he had to deal with. And I was hated of my brethren and I was this and I was that and so on and so forth. But Joseph, he wasn't going to let his past define him. He was going to serve God. He was a man that did not have the whole Bible as we do, but so many biblical truths that God has given us, we can go back to the life of Joseph and see them in his life. He was a man that set his affection on things above. He was a man that saw and knew the presence of God. He was a man that sought to please the Lord. This evening, we see his childhood. We learn some things about what he dealt with, but I see his character. Character is important in a man. Character is important. Hard working. Not given place to the flesh. Having a moral compass and standing for what is right. This evening, I hope that God would help us to have the kind of character in our lives that Joseph had in his life. Let's pray together. Father, we love you. We thank you for loving us. We thank you for the introduction of the life of Joseph and as we look at these few verses of Scripture, God, I pray that you'd help us to be individuals of character. God that we would allow your word to have an impact and influence in our lives. We'd have an encounter with you that we would daily enter into. your presence. God, I pray that even as we have the entirety of your word, we have the instruction there in Ephesians 6 with putting on the whole armor of God, you'd help us to stand, to stand for truth, to stand for right, to stand against the wiles of the devil, the enemy. Lord, in this society in which we're living, where evil is called good, good is called evil, wickedness is celebrated. Wickedness is not just allowed or tolerated, it is celebrated. God, I pray that you'd help us to stand for truth. Help us, God, to be beacons and lights. Help us to remember that the light shines. God, help us to remember that if our gospel be hid, it is hid to them that are lost. I pray, God, that you'd give us this kind of character. Bless now as we have an opportunity for responding, a time of invitation. Lord, I pray that you'd have your will and way, work in hearts and lives. I pray that you'd be glorified through every decision. For it's in Christ's name we pray. Would you stand with me, heads are bowed, eyes are closed.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.099999904632568,
      "text": " 37 this evening, Genesis chapter number 37 this evening."
    },
    {
      "id": 1,
      "start": 4.099999904632568,
      "end": 7.480000019073486,
      "text": " And I've titled the message, Joseph was 17 years old."
    },
    {
      "id": 2,
      "start": 7.480000019073486,
      "end": 9.5,
      "text": " My Joseph is only 16."
    },
    {
      "id": 3,
      "start": 9.5,
      "end": 11.5,
      "text": " And I was thinking about that this week."
    },
    {
      "id": 4,
      "start": 11.5,
      "end": 13.460000038146973,
      "text": " And as I obviously were preparing"
    },
    {
      "id": 5,
      "start": 13.460000038146973,
      "end": 16.280000686645508,
      "text": " for Brianna's graduation party and all of those things,"
    },
    {
      "id": 6,
      "start": 16.280000686645508,
      "end": 18.299999237060547,
      "text": " and then thinking about Joseph"
    },
    {
      "id": 7,
      "start": 18.299999237060547,
      "end": 20.81999969482422,
      "text": " as I'm writing and studying this message"
    },
    {
      "id": 8,
      "start": 20.81999969482422,
      "end": 22.899999618530273,
      "text": " and thinking about our youngest is 16,"
    },
    {
      "id": 9,
      "start": 22.899999618530273,
      "end": 26.139999389648438,
      "text": " it's amazing how quickly time goes by."
    },
    {
      "id": 10,
      "start": 26.139999389648438,
      "end": 28.34000015258789,
      "text": " And I was thinking about the life of Joseph"
    },
    {
      "id": 11,
      "start": 28.34000015258789,
      "end": 29.540000915527344,
      "text": " here in the Bible."
    },
    {
      "id": 12,
      "start": 29.579999923706055,
      "end": 31.5,
      "text": " It's interesting in Genesis chapter 36,"
    },
    {
      "id": 13,
      "start": 31.5,
      "end": 35.220001220703125,
      "text": " we dealt with this chapter last week in Genesis chapter 36."
    },
    {
      "id": 14,
      "start": 35.220001220703125,
      "end": 39.459999084472656,
      "text": " The Bible talks about these are the generations of Esau."
    },
    {
      "id": 15,
      "start": 39.459999084472656,
      "end": 42.18000030517578,
      "text": " And we looked at a number of things last week"
    },
    {
      "id": 16,
      "start": 42.18000030517578,
      "end": 46.29999923706055,
      "text": " from that portion of scripture and made some application"
    },
    {
      "id": 17,
      "start": 46.29999923706055,
      "end": 49.47999954223633,
      "text": " that I believe would be helpful for us to understand."
    },
    {
      "id": 18,
      "start": 49.47999954223633,
      "end": 51.900001525878906,
      "text": " As we get into Genesis chapter 37,"
    },
    {
      "id": 19,
      "start": 51.900001525878906,
      "end": 54.34000015258789,
      "text": " you'll note that there's a term very similar"
    },
    {
      "id": 20,
      "start": 54.34000015258789,
      "end": 55.7400016784668,
      "text": " to what we see a phrase that we see"
    },
    {
      "id": 21,
      "start": 55.7400016784668,
      "end": 57.939998626708984,
      "text": " in verse number one of chapter 36."
    },
    {
      "id": 22,
      "start": 57.939998626708984,
      "end": 60.5,
      "text": " Here in chapter number 37, it's verse number two."
    },
    {
      "id": 23,
      "start": 60.5,
      "end": 64.05999755859375,
      "text": " And the Bible says these are the generations of Jacob."
    },
    {
      "id": 24,
      "start": 64.05999755859375,
      "end": 67.5,
      "text": " And so we saw in Genesis 36, the generations of Esau."
    },
    {
      "id": 25,
      "start": 67.5,
      "end": 69.37999725341797,
      "text": " Here in Genesis chapter number 37,"
    },
    {
      "id": 26,
      "start": 69.37999725341797,
      "end": 72.05999755859375,
      "text": " we will read of the generations of Jacob."
    },
    {
      "id": 27,
      "start": 72.05999755859375,
      "end": 74.22000122070312,
      "text": " We find that specifically it is here"
    },
    {
      "id": 28,
      "start": 74.22000122070312,
      "end": 77.0199966430664,
      "text": " that the lens of scripture will focus"
    },
    {
      "id": 29,
      "start": 77.0199966430664,
      "end": 79.9000015258789,
      "text": " upon the life of Joseph."
    },
    {
      "id": 30,
      "start": 79.9000015258789,
      "end": 82.9800033569336,
      "text": " Of course, we understand that from here,"
    },
    {
      "id": 31,
      "start": 82.9800033569336,
      "end": 86.86000061035156,
      "text": " Genesis 37 through the end of the book, chapter number 50,"
    },
    {
      "id": 32,
      "start": 86.86000061035156,
      "end": 90.41999816894531,
      "text": " every portion of the remaining chapters,"
    },
    {
      "id": 33,
      "start": 90.41999816894531,
      "end": 92.30000305175781,
      "text": " except for chapter 38,"
    },
    {
      "id": 34,
      "start": 92.30000305175781,
      "end": 95.73999786376953,
      "text": " deal with some aspect of the life of Joseph."
    },
    {
      "id": 35,
      "start": 95.73999786376953,
      "end": 98.41999816894531,
      "text": " And what a godly young man,"
    },
    {
      "id": 36,
      "start": 98.41999816894531,
      "end": 101.76000213623047,
      "text": " what a man that was used for the glory of God."
    },
    {
      "id": 37,
      "start": 101.76000213623047,
      "end": 104.37999725341797,
      "text": " And many of you know, I've shared this over the years,"
    },
    {
      "id": 38,
      "start": 104.37999725341797,
      "end": 107.5,
      "text": " that Joseph is my favorite Bible character."
    },
    {
      "id": 39,
      "start": 107.5,
      "end": 110.62000274658203,
      "text": " And thus our son is not Christopher III,"
    },
    {
      "id": 40,
      "start": 110.62000274658203,
      "end": 112.9000015258789,
      "text": " he is Joseph Christopher,"
    },
    {
      "id": 41,
      "start": 112.9000015258789,
      "end": 114.54000091552734,
      "text": " just because of the significance"
    },
    {
      "id": 42,
      "start": 114.54000091552734,
      "end": 116.05999755859375,
      "text": " of the Bible character Joseph."
    },
    {
      "id": 43,
      "start": 116.05999755859375,
      "end": 118.66000366210938,
      "text": " It's hard to believe, in just about six weeks or so,"
    },
    {
      "id": 44,
      "start": 118.66000366210938,
      "end": 121.5,
      "text": " we'll be here for 12 years as being the pastor,"
    },
    {
      "id": 45,
      "start": 121.5,
      "end": 124.58000183105469,
      "text": " and I've never preached through the life of Joseph."
    },
    {
      "id": 46,
      "start": 124.58000183105469,
      "end": 127.05999755859375,
      "text": " And though he's my favorite Bible character,"
    },
    {
      "id": 47,
      "start": 127.05999755859375,
      "end": 128.66000366210938,
      "text": " the Lord's just never led me"
    },
    {
      "id": 48,
      "start": 128.66000366210938,
      "end": 130.77999877929688,
      "text": " and never given me that liberty or direction"
    },
    {
      "id": 49,
      "start": 130.77999877929688,
      "end": 132.5,
      "text": " to preach through the life of Joseph."
    },
    {
      "id": 50,
      "start": 132.5,
      "end": 135.4600067138672,
      "text": " And so I am so excited about the opportunity here"
    },
    {
      "id": 51,
      "start": 135.4600067138672,
      "end": 137.94000244140625,
      "text": " on Sunday evenings for the next several months"
    },
    {
      "id": 52,
      "start": 137.94000244140625,
      "end": 140.86000061035156,
      "text": " to be able to study through the life of Joseph."
    },
    {
      "id": 53,
      "start": 140.86000061035156,
      "end": 143.66000366210938,
      "text": " We first read of the character,"
    },
    {
      "id": 54,
      "start": 143.66000366210938,
      "end": 146.6999969482422,
      "text": " the Bible character Joseph in Genesis chapter 30,"
    },
    {
      "id": 55,
      "start": 146.6999969482422,
      "end": 148.33999633789062,
      "text": " verses 22 through 24."
    },
    {
      "id": 56,
      "start": 148.33999633789062,
      "end": 150.5800018310547,
      "text": " We won't take the time to turn back there,"
    },
    {
      "id": 57,
      "start": 150.5800018310547,
      "end": 151.86000061035156,
      "text": " but it's there in those verses"
    },
    {
      "id": 58,
      "start": 151.86000061035156,
      "end": 155.02000427246094,
      "text": " that God records for us the birth of Joseph."
    },
    {
      "id": 59,
      "start": 155.02000427246094,
      "end": 158.25999450683594,
      "text": " And we read that from that point"
    },
    {
      "id": 60,
      "start": 158.25999450683594,
      "end": 160.6999969482422,
      "text": " until here in Genesis chapter number 37,"
    },
    {
      "id": 61,
      "start": 160.6999969482422,
      "end": 163.13999938964844,
      "text": " obviously 17 years past,"
    },
    {
      "id": 62,
      "start": 163.13999938964844,
      "end": 166.97999572753906,
      "text": " because the text tells us that he's 17 years old."
    },
    {
      "id": 63,
      "start": 166.97999572753906,
      "end": 168.97999572753906,
      "text": " There's only a couple of references"
    },
    {
      "id": 64,
      "start": 168.97999572753906,
      "end": 172.97999572753906,
      "text": " to the life of Joseph from Genesis chapter 30"
    },
    {
      "id": 65,
      "start": 172.97999572753906,
      "end": 174.66000366210938,
      "text": " to Genesis chapter number 37."
    },
    {
      "id": 66,
      "start": 174.66000366210938,
      "end": 177.6999969482422,
      "text": " And both of those are found in Genesis 32 and 33,"
    },
    {
      "id": 67,
      "start": 177.6999969482422,
      "end": 182.5800018310547,
      "text": " simply stating how that Jacob in preparing to meet Esau"
    },
    {
      "id": 68,
      "start": 182.5800018310547,
      "end": 186.74000549316406,
      "text": " put them in the back of the camp and so on and so forth."
    },
    {
      "id": 69,
      "start": 186.74000549316406,
      "end": 189.02000427246094,
      "text": " And so his name is just mentioned very briefly."
    },
    {
      "id": 70,
      "start": 189.02000427246094,
      "end": 191.5800018310547,
      "text": " And so nothing about him is given to us"
    },
    {
      "id": 71,
      "start": 191.5800018310547,
      "end": 195.25999450683594,
      "text": " as far as his life, his upbringing and so on and so forth."
    },
    {
      "id": 72,
      "start": 195.25999450683594,
      "end": 197.4600067138672,
      "text": " And so we come here to Genesis 37"
    },
    {
      "id": 73,
      "start": 197.4600067138672,
      "end": 199.5,
      "text": " and we read that he's 17 years old,"
    },
    {
      "id": 74,
      "start": 199.5,
      "end": 200.89999389648438,
      "text": " but notice what the Bible tells us"
    },
    {
      "id": 75,
      "start": 200.89999389648438,
      "end": 202.33999633789062,
      "text": " beginning in verse number one."
    },
    {
      "id": 76,
      "start": 202.33999633789062,
      "end": 204.5800018310547,
      "text": " And Jacob dwelt in the land"
    },
    {
      "id": 77,
      "start": 204.5800018310547,
      "end": 207.86000061035156,
      "text": " wherein his father was a stranger in the land of Canaan."
    },
    {
      "id": 78,
      "start": 207.86000061035156,
      "end": 210.10000610351562,
      "text": " These are the generations of Jacob."
    },
    {
      "id": 79,
      "start": 210.10000610351562,
      "end": 212.5,
      "text": " Joseph being 17 years old"
    },
    {
      "id": 80,
      "start": 212.5,
      "end": 215.6199951171875,
      "text": " was feeding the flock with his brethren."
    },
    {
      "id": 81,
      "start": 215.6199951171875,
      "end": 217.74000549316406,
      "text": " The lad was with the sons of Bilhah"
    },
    {
      "id": 82,
      "start": 217.74000549316406,
      "end": 220.86000061035156,
      "text": " and with the sons of Zilpah, his father's wives,"
    },
    {
      "id": 83,
      "start": 220.86000061035156,
      "end": 225.86000061035156,
      "text": " and Joseph brought unto his father their evil report."
    },
    {
      "id": 84,
      "start": 226.4199981689453,
      "end": 229.97999572753906,
      "text": " Now Israel loved Joseph more than all his children"
    },
    {
      "id": 85,
      "start": 229.97999572753906,
      "end": 232.3000030517578,
      "text": " because he was the son of his old age."
    },
    {
      "id": 86,
      "start": 233.13999938964844,
      "end": 234.3800048828125,
      "text": " And he made him a coat of many colors."
    },
    {
      "id": 87,
      "start": 234.3800048828125,
      "end": 237.10000610351562,
      "text": " And when his brethren saw that their father loved him"
    },
    {
      "id": 88,
      "start": 237.10000610351562,
      "end": 238.77999877929688,
      "text": " more than all his brethren,"
    },
    {
      "id": 89,
      "start": 238.77999877929688,
      "end": 243.77999877929688,
      "text": " they hated him and could not speak peaceably unto him."
    },
    {
      "id": 90,
      "start": 244.74000549316406,
      "end": 247.02000427246094,
      "text": " As we come to this text of scripture this evening,"
    },
    {
      "id": 91,
      "start": 247.02000427246094,
      "end": 248.3000030517578,
      "text": " I just have two thoughts for you."
    },
    {
      "id": 92,
      "start": 248.3000030517578,
      "end": 249.5800018310547,
      "text": " Number one, if you're taking notes,"
    },
    {
      "id": 93,
      "start": 249.5800018310547,
      "end": 252.6199951171875,
      "text": " notice with me the childhood of Joseph."
    },
    {
      "id": 94,
      "start": 252.6199951171875,
      "end": 255.66000366210938,
      "text": " We don't have much scripture that God would give us"
    },
    {
      "id": 95,
      "start": 255.66000366210938,
      "end": 257.5799865722656,
      "text": " the insight into the particulars"
    },
    {
      "id": 96,
      "start": 257.5799865722656,
      "end": 261.17999267578125,
      "text": " of Joseph's childhood, his upbringing."
    },
    {
      "id": 97,
      "start": 261.17999267578125,
      "end": 263.760009765625,
      "text": " But as we begin to think about the text of scripture here"
    },
    {
      "id": 98,
      "start": 263.760009765625,
      "end": 265.7799987792969,
      "text": " and read that he's 17 years old,"
    },
    {
      "id": 99,
      "start": 265.7799987792969,
      "end": 267.82000732421875,
      "text": " and we can understand as we've studied"
    },
    {
      "id": 100,
      "start": 267.82000732421875,
      "end": 270.20001220703125,
      "text": " through these chapters in the book of Genesis,"
    },
    {
      "id": 101,
      "start": 270.20001220703125,
      "end": 271.9200134277344,
      "text": " we can piece things together"
    },
    {
      "id": 102,
      "start": 271.9200134277344,
      "end": 274.5,
      "text": " with regard to the childhood of Joseph."
    },
    {
      "id": 103,
      "start": 274.5,
      "end": 277.1400146484375,
      "text": " I do not believe that it's here in verse three and four"
    },
    {
      "id": 104,
      "start": 277.1400146484375,
      "end": 280.7799987792969,
      "text": " when he's 17 years old that it's first known to the family"
    },
    {
      "id": 105,
      "start": 280.7799987792969,
      "end": 284.70001220703125,
      "text": " that he was the most loved son."
    },
    {
      "id": 106,
      "start": 284.70001220703125,
      "end": 288.7200012207031,
      "text": " It is not the result of Joseph bringing unto his father"
    },
    {
      "id": 107,
      "start": 288.7200012207031,
      "end": 291.32000732421875,
      "text": " their evil report that he, Joseph,"
    },
    {
      "id": 108,
      "start": 291.32000732421875,
      "end": 293.32000732421875,
      "text": " was given a coat of many colors."
    },
    {
      "id": 109,
      "start": 293.32000732421875,
      "end": 296.6000061035156,
      "text": " I believe that happened many years earlier in his life,"
    },
    {
      "id": 110,
      "start": 296.6000061035156,
      "end": 297.8599853515625,
      "text": " and it was a known thing."
    },
    {
      "id": 111,
      "start": 297.8599853515625,
      "end": 301.3599853515625,
      "text": " And as we begin to think about the childhood of Joseph,"
    },
    {
      "id": 112,
      "start": 301.3599853515625,
      "end": 304.32000732421875,
      "text": " we have made it known in previous messages,"
    },
    {
      "id": 113,
      "start": 304.32000732421875,
      "end": 306.20001220703125,
      "text": " we've noted the fact that the family"
    },
    {
      "id": 114,
      "start": 306.20001220703125,
      "end": 311.20001220703125,
      "text": " that Joseph was brought up in obviously was dysfunctional."
    },
    {
      "id": 115,
      "start": 311.2799987792969,
      "end": 312.9200134277344,
      "text": " It was a dysfunctional family."
    },
    {
      "id": 116,
      "start": 312.9200134277344,
      "end": 316.1000061035156,
      "text": " We hear that term today kind of tossed around,"
    },
    {
      "id": 117,
      "start": 316.1000061035156,
      "end": 319.5,
      "text": " and we understand what some would imply or mean"
    },
    {
      "id": 118,
      "start": 319.5,
      "end": 322.70001220703125,
      "text": " by that phraseology of being a dysfunctional family."
    },
    {
      "id": 119,
      "start": 322.70001220703125,
      "end": 323.82000732421875,
      "text": " But as you would go back,"
    },
    {
      "id": 120,
      "start": 323.82000732421875,
      "end": 326.4200134277344,
      "text": " and we're not gonna take the time this evening to review it,"
    },
    {
      "id": 121,
      "start": 326.4200134277344,
      "end": 329.29998779296875,
      "text": " but if you'd go back to Genesis chapter 29 and 30,"
    },
    {
      "id": 122,
      "start": 329.29998779296875,
      "end": 332.4200134277344,
      "text": " you would find that the conflict between Leah and Rachel"
    },
    {
      "id": 123,
      "start": 332.4200134277344,
      "end": 335.4200134277344,
      "text": " along with their handmaids is well-documented."
    },
    {
      "id": 124,
      "start": 335.4200134277344,
      "end": 338.5799865722656,
      "text": " We studied through those chapters in chapter 29 and 30,"
    },
    {
      "id": 125,
      "start": 338.5799865722656,
      "end": 341.4599914550781,
      "text": " and it was just, I mean, mind-blowing,"
    },
    {
      "id": 126,
      "start": 341.4599914550781,
      "end": 344.4599914550781,
      "text": " some of the things that were taking place within the family,"
    },
    {
      "id": 127,
      "start": 344.4599914550781,
      "end": 348.5400085449219,
      "text": " and just the conflict between Leah and Rachel"
    },
    {
      "id": 128,
      "start": 348.5400085449219,
      "end": 349.9800109863281,
      "text": " and all that was going on."
    },
    {
      "id": 129,
      "start": 349.9800109863281,
      "end": 351.739990234375,
      "text": " And we think about that conflict,"
    },
    {
      "id": 130,
      "start": 351.739990234375,
      "end": 355.94000244140625,
      "text": " and we know that Joseph is the son of Jacob's old age,"
    },
    {
      "id": 131,
      "start": 355.94000244140625,
      "end": 358.5799865722656,
      "text": " and we know that he's the son of Jacob and Rachel,"
    },
    {
      "id": 132,
      "start": 358.5799865722656,
      "end": 361.0199890136719,
      "text": " but remember, Rachel was the one that was,"
    },
    {
      "id": 133,
      "start": 361.0199890136719,
      "end": 365.1400146484375,
      "text": " if you wanna use the term, the favorite wife, okay?"
    },
    {
      "id": 134,
      "start": 365.1400146484375,
      "end": 366.70001220703125,
      "text": " And so now, all of a sudden,"
    },
    {
      "id": 135,
      "start": 366.70001220703125,
      "end": 369.5799865722656,
      "text": " he has this son from his favorite wife."
    },
    {
      "id": 136,
      "start": 369.5799865722656,
      "end": 371.94000244140625,
      "text": " I mean, it's just a dysfunctional family."
    },
    {
      "id": 137,
      "start": 372.8599853515625,
      "end": 377.05999755859375,
      "text": " We find that not only was it a dysfunctional family,"
    },
    {
      "id": 138,
      "start": 377.05999755859375,
      "end": 381.4599914550781,
      "text": " but he's there, he's born into the time of Jacob's life"
    },
    {
      "id": 139,
      "start": 381.4599914550781,
      "end": 384.5400085449219,
      "text": " when Jacob has already fled from the face of Esau,"
    },
    {
      "id": 140,
      "start": 384.5400085449219,
      "end": 386.4599914550781,
      "text": " because Esau said, I'm gonna kill my brother"
    },
    {
      "id": 141,
      "start": 386.4599914550781,
      "end": 388.5,
      "text": " because he took the blessing."
    },
    {
      "id": 142,
      "start": 388.5,
      "end": 389.70001220703125,
      "text": " He's already stolen the birthright,"
    },
    {
      "id": 143,
      "start": 389.70001220703125,
      "end": 392.6199951171875,
      "text": " now he's taking the blessing, and I'm gonna kill him,"
    },
    {
      "id": 144,
      "start": 392.6199951171875,
      "end": 396.1400146484375,
      "text": " and so Jacob has to go to Paddan Aram,"
    },
    {
      "id": 145,
      "start": 396.1400146484375,
      "end": 399.4200134277344,
      "text": " and of course, it's there where Joseph would be born,"
    },
    {
      "id": 146,
      "start": 399.4200134277344,
      "end": 403.70001220703125,
      "text": " and you think about the years there with Laban."
    },
    {
      "id": 147,
      "start": 403.70001220703125,
      "end": 405.5400085449219,
      "text": " They were turbulent years."
    },
    {
      "id": 148,
      "start": 405.5400085449219,
      "end": 407.6199951171875,
      "text": " I mean, they were difficult years."
    },
    {
      "id": 149,
      "start": 407.6199951171875,
      "end": 409.4200134277344,
      "text": " All of the things that we've studied"
    },
    {
      "id": 150,
      "start": 409.4200134277344,
      "end": 410.9800109863281,
      "text": " and all that had taken place,"
    },
    {
      "id": 151,
      "start": 410.9800109863281,
      "end": 413.4599914550781,
      "text": " and you begin to look at that timing"
    },
    {
      "id": 152,
      "start": 413.4599914550781,
      "end": 415.9800109863281,
      "text": " and Joseph being raised up,"
    },
    {
      "id": 153,
      "start": 415.9800109863281,
      "end": 418.8999938964844,
      "text": " being brought up in that kind of a setting,"
    },
    {
      "id": 154,
      "start": 418.8999938964844,
      "end": 421.0799865722656,
      "text": " the childhood of Joseph."
    },
    {
      "id": 155,
      "start": 421.0799865722656,
      "end": 422.8999938964844,
      "text": " The family was divided."
    },
    {
      "id": 156,
      "start": 424.1400146484375,
      "end": 426.8800048828125,
      "text": " The text of Scripture makes it clear"
    },
    {
      "id": 157,
      "start": 426.8800048828125,
      "end": 431.8800048828125,
      "text": " that Joseph was loved more than all the other children."
    },
    {
      "id": 158,
      "start": 432.6000061035156,
      "end": 433.9599914550781,
      "text": " Now, that's a real problem."
    },
    {
      "id": 159,
      "start": 435.6400146484375,
      "end": 440.20001220703125,
      "text": " Sometimes we joke about who's a favorite child,"
    },
    {
      "id": 160,
      "start": 440.20001220703125,
      "end": 442.2200012207031,
      "text": " and those of you that are only children,"
    },
    {
      "id": 161,
      "start": 442.2200012207031,
      "end": 445.4800109863281,
      "text": " you just hold that title all to your own, right?"
    },
    {
      "id": 162,
      "start": 445.4800109863281,
      "end": 447.6400146484375,
      "text": " But those that have siblings,"
    },
    {
      "id": 163,
      "start": 447.6400146484375,
      "end": 449.79998779296875,
      "text": " my brother and I will tease with my parents,"
    },
    {
      "id": 164,
      "start": 449.79998779296875,
      "end": 452.6400146484375,
      "text": " my mom in particular, because it really bothers her,"
    },
    {
      "id": 165,
      "start": 452.6400146484375,
      "end": 456.0400085449219,
      "text": " when we'll say that, well, we know he's your favorite,"
    },
    {
      "id": 166,
      "start": 456.0400085449219,
      "end": 457.1199951171875,
      "text": " and so on and so forth."
    },
    {
      "id": 167,
      "start": 457.1199951171875,
      "end": 460.0400085449219,
      "text": " But the reality is that this was legitimate"
    },
    {
      "id": 168,
      "start": 460.0400085449219,
      "end": 462.1000061035156,
      "text": " how their life and their upbringing was."
    },
    {
      "id": 169,
      "start": 462.1000061035156,
      "end": 464.4800109863281,
      "text": " This is what was going on in the home."
    },
    {
      "id": 170,
      "start": 464.4800109863281,
      "end": 466.0400085449219,
      "text": " It was known."
    },
    {
      "id": 171,
      "start": 466.0400085449219,
      "end": 467.3599853515625,
      "text": " And the Bible says in verse number three,"
    },
    {
      "id": 172,
      "start": 467.3599853515625,
      "end": 472.20001220703125,
      "text": " now Israel loved Joseph more than all his children,"
    },
    {
      "id": 173,
      "start": 472.20001220703125,
      "end": 474.2799987792969,
      "text": " because he was the son of his old age,"
    },
    {
      "id": 174,
      "start": 474.2799987792969,
      "end": 477.0799865722656,
      "text": " and he made him a coat of many colors."
    },
    {
      "id": 175,
      "start": 477.0799865722656,
      "end": 480.760009765625,
      "text": " No doubt, and we see obviously within the text of Scripture"
    },
    {
      "id": 176,
      "start": 480.760009765625,
      "end": 483.8999938964844,
      "text": " that this love that Jacob had for Joseph"
    },
    {
      "id": 177,
      "start": 483.8999938964844,
      "end": 486.8599853515625,
      "text": " that surpassed the love that he had for his other children,"
    },
    {
      "id": 178,
      "start": 486.8599853515625,
      "end": 491.6600036621094,
      "text": " this would cause great conflict in the home."
    },
    {
      "id": 179,
      "start": 491.6600036621094,
      "end": 493.17999267578125,
      "text": " When I think about the conflict in the home,"
    },
    {
      "id": 180,
      "start": 493.17999267578125,
      "end": 496.4599914550781,
      "text": " listen, I'm thankful that God has given us"
    },
    {
      "id": 181,
      "start": 496.4599914550781,
      "end": 499.4599914550781,
      "text": " instruction as word how that we can have a home"
    },
    {
      "id": 182,
      "start": 499.4599914550781,
      "end": 501.5799865722656,
      "text": " that is harmonious and melodious,"
    },
    {
      "id": 183,
      "start": 501.5799865722656,
      "end": 503.4599914550781,
      "text": " a home that honors the Lord,"
    },
    {
      "id": 184,
      "start": 503.4599914550781,
      "end": 505.4599914550781,
      "text": " where it can be void of conflict,"
    },
    {
      "id": 185,
      "start": 505.4599914550781,
      "end": 508.79998779296875,
      "text": " and when conflict would enter into a relationship,"
    },
    {
      "id": 186,
      "start": 508.79998779296875,
      "end": 511.7799987792969,
      "text": " whether that relationship is the home or some other entity,"
    },
    {
      "id": 187,
      "start": 511.7799987792969,
      "end": 513.4199829101562,
      "text": " that God has given us instruction"
    },
    {
      "id": 188,
      "start": 513.4199829101562,
      "end": 515.7000122070312,
      "text": " on how to resolve conflict."
    },
    {
      "id": 189,
      "start": 515.7000122070312,
      "end": 517.9400024414062,
      "text": " But we find that within the home of Jacob,"
    },
    {
      "id": 190,
      "start": 517.9400024414062,
      "end": 519.7000122070312,
      "text": " there's all of this dysfunction,"
    },
    {
      "id": 191,
      "start": 519.7000122070312,
      "end": 522.0599975585938,
      "text": " and this is how Joseph is raised."
    },
    {
      "id": 192,
      "start": 522.0599975585938,
      "end": 522.9000244140625,
      "text": " This is what he's seeing."
    },
    {
      "id": 193,
      "start": 522.9000244140625,
      "end": 524.739990234375,
      "text": " This is what he's experiencing."
    },
    {
      "id": 194,
      "start": 526.02001953125,
      "end": 527.6199951171875,
      "text": " And we find that in verse number four,"
    },
    {
      "id": 195,
      "start": 527.6199951171875,
      "end": 529.6199951171875,
      "text": " I want you to see what the Bible says."
    },
    {
      "id": 196,
      "start": 530.8200073242188,
      "end": 534.780029296875,
      "text": " And when his brethren saw that their father loved him"
    },
    {
      "id": 197,
      "start": 534.780029296875,
      "end": 536.719970703125,
      "text": " more than all his brethren,"
    },
    {
      "id": 198,
      "start": 536.719970703125,
      "end": 538.7000122070312,
      "text": " I think that they saw a whole lot more"
    },
    {
      "id": 199,
      "start": 538.7000122070312,
      "end": 540.5599975585938,
      "text": " than just a coat of many colors."
    },
    {
      "id": 200,
      "start": 541.5599975585938,
      "end": 545.5,
      "text": " They saw actions and behaviors and favors"
    },
    {
      "id": 201,
      "start": 545.5,
      "end": 546.5999755859375,
      "text": " and whatever it was,"
    },
    {
      "id": 202,
      "start": 546.5999755859375,
      "end": 551.5999755859375,
      "text": " they saw the evidence of this truth"
    },
    {
      "id": 203,
      "start": 552.0,
      "end": 555.5800170898438,
      "text": " that Jacob loved Joseph more than all of his children."
    },
    {
      "id": 204,
      "start": 555.5800170898438,
      "end": 556.780029296875,
      "text": " It was obvious to them."
    },
    {
      "id": 205,
      "start": 558.4400024414062,
      "end": 561.0399780273438,
      "text": " And the Bible says that when they saw that,"
    },
    {
      "id": 206,
      "start": 561.0399780273438,
      "end": 562.9199829101562,
      "text": " notice what it says,"
    },
    {
      "id": 207,
      "start": 562.9199829101562,
      "end": 565.9600219726562,
      "text": " they hated him."
    },
    {
      "id": 208,
      "start": 567.0800170898438,
      "end": 568.1599731445312,
      "text": " They hated him."
    },
    {
      "id": 209,
      "start": 569.1599731445312,
      "end": 571.1799926757812,
      "text": " That's strong language."
    },
    {
      "id": 210,
      "start": 572.8400268554688,
      "end": 575.3599853515625,
      "text": " Not sure if any of you ever said when you were a child"
    },
    {
      "id": 211,
      "start": 575.3599853515625,
      "end": 577.3200073242188,
      "text": " or if any of the children in here ever said something"
    },
    {
      "id": 212,
      "start": 577.3200073242188,
      "end": 578.8800048828125,
      "text": " about hating someone,"
    },
    {
      "id": 213,
      "start": 578.8800048828125,
      "end": 582.280029296875,
      "text": " but I know that if it was ever even spoken in our home,"
    },
    {
      "id": 214,
      "start": 582.280029296875,
      "end": 585.47998046875,
      "text": " whether it was when I was a child or from our children,"
    },
    {
      "id": 215,
      "start": 585.47998046875,
      "end": 587.7999877929688,
      "text": " that language was not allowed."
    },
    {
      "id": 216,
      "start": 587.7999877929688,
      "end": 589.5399780273438,
      "text": " We didn't use that terminology."
    },
    {
      "id": 217,
      "start": 590.7000122070312,
      "end": 594.6799926757812,
      "text": " I've heard children say, well, I hate broccoli."
    },
    {
      "id": 218,
      "start": 594.6799926757812,
      "end": 597.280029296875,
      "text": " No, no, no, you can just say you don't like it."
    },
    {
      "id": 219,
      "start": 597.4000244140625,
      "end": 599.0800170898438,
      "text": " We try to avoid that word,"
    },
    {
      "id": 220,
      "start": 599.0800170898438,
      "end": 600.1199951171875,
      "text": " but think about."
    },
    {
      "id": 0,
      "start": 600.1199951171875,
      "end": 606.639995098114,
      "text": " what is carried here with this context of God revealing to us that the Bible says that"
    },
    {
      "id": 1,
      "start": 606.639995098114,
      "end": 614.5599946975708,
      "text": " they hated him. They hated him. Now, I want you to think about Joseph for just a moment."
    },
    {
      "id": 2,
      "start": 614.5599946975708,
      "end": 618.1199951171875,
      "text": " Was there anything that he did to make his father love him more than any of the other"
    },
    {
      "id": 3,
      "start": 618.1199951171875,
      "end": 623.5999946594238,
      "text": " brethren? I mean, as far as we can tell, the Bible says here in verse number 3 that Jacob"
    },
    {
      "id": 4,
      "start": 623.5999946594238,
      "end": 628.5599956512451,
      "text": " loved him more than all his other children. Why? Because he was the son of his old age."
    },
    {
      "id": 5,
      "start": 628.5599956512451,
      "end": 636.2399940490723,
      "text": " There was nothing that we can tell biblically that caused Joseph to have this elevated favor"
    },
    {
      "id": 6,
      "start": 636.2399940490723,
      "end": 641.2399940490723,
      "text": " and love from his father, but we find that the Bible tells us that it was obvious and"
    },
    {
      "id": 7,
      "start": 641.2399940490723,
      "end": 646.3999938964844,
      "text": " the brethren knew it, the brothers saw, and they were aware of this, and they hated him."
    },
    {
      "id": 8,
      "start": 646.3999938964844,
      "end": 653.1399955749512,
      "text": " I'm not sure if you've ever had somebody that's really disliked you. You take it to a level"
    },
    {
      "id": 9,
      "start": 653.1399955749512,
      "end": 660.6999969482422,
      "text": " of hatred. It's beyond really maybe for many of us our ability to comprehend. And the Bible"
    },
    {
      "id": 10,
      "start": 660.6999969482422,
      "end": 668.9799957275391,
      "text": " says that they hated him, and notice how it's described here, and could not speak peaceably"
    },
    {
      "id": 11,
      "start": 668.9799957275391,
      "end": 677.879997253418,
      "text": " unto him. Now, can you imagine the dysfunction in this home? Can you imagine the childhood"
    },
    {
      "id": 12,
      "start": 677.9199981689453,
      "end": 684.9199981689453,
      "text": " of Joseph growing up in this setting, in this environment? The families, as we'll see, as"
    },
    {
      "id": 13,
      "start": 684.9199981689453,
      "end": 689.7199935913086,
      "text": " we'll note in just a moment, obviously as we understand the timing and all that's going"
    },
    {
      "id": 14,
      "start": 689.7199935913086,
      "end": 697.0799942016602,
      "text": " on at this particular era of history, they spent a lot of time together. They were close"
    },
    {
      "id": 15,
      "start": 697.0799942016602,
      "end": 703.7599945068359,
      "text": " to one another, and yet the Bible tells us that Joseph had to deal with this regular"
    },
    {
      "id": 16,
      "start": 703.7599945068359,
      "end": 715.0799942016602,
      "text": " animosity. They could not speak peaceably unto him. I can't imagine growing up in that"
    },
    {
      "id": 17,
      "start": 715.0799942016602,
      "end": 726.1999969482422,
      "text": " fashion, honestly. I really can't. I'm sure that as a parent, I know we experienced this,"
    },
    {
      "id": 18,
      "start": 726.1999969482422,
      "end": 732.0800018310547,
      "text": " and I'm sure that as a parent you experienced, will my kids ever love each other? They fight"
    },
    {
      "id": 19,
      "start": 732.0800018310547,
      "end": 740.7200012207031,
      "text": " all the time. What's going on? But this is a whole other level. It's a whole other level."
    },
    {
      "id": 20,
      "start": 740.7200012207031,
      "end": 745.6599884033203,
      "text": " When I think about the childhood of Joseph, and we come to Genesis 37, and God introduces"
    },
    {
      "id": 21,
      "start": 745.6599884033203,
      "end": 751.3999938964844,
      "text": " us to Joseph, and what he tells us in verse number 2 about Joseph, reveals to me not only"
    },
    {
      "id": 22,
      "start": 751.3999938964844,
      "end": 754.8799896240234,
      "text": " as we would consider the childhood of Joseph, but I want you to think about the character"
    },
    {
      "id": 23,
      "start": 754.8799896240234,
      "end": 762.4799957275391,
      "text": " of Joseph. The character of Joseph. The Bible tells us in verse number 2, these are the"
    },
    {
      "id": 24,
      "start": 762.4799957275391,
      "end": 770.8399963378906,
      "text": " generations of Jacob. Joseph, being 17 years old, notice what the Bible says, was feeding"
    },
    {
      "id": 25,
      "start": 770.8399963378906,
      "end": 776.6799926757812,
      "text": " the flock with his brethren. As we begin to think about the character of Joseph, I would"
    },
    {
      "id": 26,
      "start": 776.6799926757812,
      "end": 781.1999969482422,
      "text": " say first of all, that when we note the character of Joseph, that we must note that he was a"
    },
    {
      "id": 27,
      "start": 781.1999969482422,
      "end": 787.8799896240234,
      "text": " worker. He was a worker. The Bible says that he was feeding the flock. That's work. That's"
    },
    {
      "id": 28,
      "start": 787.8799896240234,
      "end": 794.0800018310547,
      "text": " labor. And I want you to think about the character. Listen, it takes a measure of character to"
    },
    {
      "id": 29,
      "start": 794.0800018310547,
      "end": 801.1599884033203,
      "text": " do hard work. We live in a time in which people seem to be allergic to hard work. It can drive"
    },
    {
      "id": 30,
      "start": 801.1599884033203,
      "end": 809.0,
      "text": " you crazy in the society in which we live. Honestly. The idea of just being a hard worker"
    },
    {
      "id": 31,
      "start": 809.0,
      "end": 815.1599884033203,
      "text": " is something that many times has slipped by in our society today. And we find that"
    },
    {
      "id": 32,
      "start": 815.1599884033203,
      "end": 819.7599945068359,
      "text": " here, as you look at the text of Scripture, that Joseph, he's only 17 years old, but he"
    },
    {
      "id": 33,
      "start": 819.7599945068359,
      "end": 824.1199951171875,
      "text": " was feeding the flock, and he's a hard worker. I believe that there was a measure of diligence"
    },
    {
      "id": 34,
      "start": 824.1199951171875,
      "end": 829.0800018310547,
      "text": " in his work. I believe that as he's working, and he's doing what he's been instructed to"
    },
    {
      "id": 35,
      "start": 829.0800018310547,
      "end": 835.8399963378906,
      "text": " do, that this is honoring to God. You know, we're to be hard workers. What's your hand"
    },
    {
      "id": 36,
      "start": 835.8399963378906,
      "end": 845.3999938964844,
      "text": " find it to do? Do it how? Half-heartedly? No. With all thy might. We think about this"
    },
    {
      "id": 37,
      "start": 845.3999938964844,
      "end": 849.4799957275391,
      "text": " thing. You've heard the term, obviously, we live in the greater DC area, that people will"
    },
    {
      "id": 38,
      "start": 849.4799957275391,
      "end": 853.0399932861328,
      "text": " use that phraseology, it's good enough for government work. Has anyone ever heard somebody"
    },
    {
      "id": 39,
      "start": 853.0399932861328,
      "end": 859.4400024414062,
      "text": " use that phraseology? It's good enough for government work. Listen, that ought not be"
    },
    {
      "id": 40,
      "start": 859.4400024414062,
      "end": 868.760009765625,
      "text": " the perspective of God's people. God honors hard work. And we find that as we look here,"
    },
    {
      "id": 41,
      "start": 868.760009765625,
      "end": 873.2799987792969,
      "text": " remember, you understand that sometimes we have the idea that work is part of the curse."
    },
    {
      "id": 42,
      "start": 873.2799987792969,
      "end": 880.3200073242188,
      "text": " But you know that Adam had a responsibility to work before the curse. There was a responsibility"
    },
    {
      "id": 43,
      "start": 880.3200073242188,
      "end": 886.47998046875,
      "text": " that God gave to Adam that was work. Now, you understand the work intensified after"
    },
    {
      "id": 44,
      "start": 886.47998046875,
      "end": 892.7999877929688,
      "text": " the curse, but there was work. And we begin to think about this subject of work and we"
    },
    {
      "id": 45,
      "start": 892.7999877929688,
      "end": 897.1600036621094,
      "text": " look at the character. Listen, the character of a man is important for us to understand."
    },
    {
      "id": 46,
      "start": 897.1600036621094,
      "end": 901.7200012207031,
      "text": " And as we begin to enter into the study of the life of Joseph, it's important for us"
    },
    {
      "id": 47,
      "start": 901.7200012207031,
      "end": 906.9199829101562,
      "text": " to understand the character of Joseph. And we find, as I referenced already there in"
    },
    {
      "id": 48,
      "start": 906.9199829101562,
      "end": 915.1999816894531,
      "text": " Colossians 3 and verse 23, and whatsoever you do, do it heartily as to the Lord and"
    },
    {
      "id": 49,
      "start": 915.1999816894531,
      "end": 920.8399963378906,
      "text": " not unto men. You know, your perspective of work and my perspective of work ought to be"
    },
    {
      "id": 50,
      "start": 920.8399963378906,
      "end": 928.6000061035156,
      "text": " different than our lost co-workers. It ought to be different than our lost co-workers."
    },
    {
      "id": 51,
      "start": 928.6000061035156,
      "end": 932.6000061035156,
      "text": " The young people in our church, you know what, they need to learn how to work. Honestly,"
    },
    {
      "id": 52,
      "start": 932.6000061035156,
      "end": 939.9599914550781,
      "text": " they didn't learn how to work. It's good for them to move tables around. It's good"
    },
    {
      "id": 53,
      "start": 939.9599914550781,
      "end": 947.47998046875,
      "text": " for them to, I'll pick just from little Ari, he's tired this afternoon, but man, he was"
    },
    {
      "id": 54,
      "start": 947.47998046875,
      "end": 953.1600036621094,
      "text": " pulling weeds the other night outside after church. He's just pulling weeds. And I went"
    },
    {
      "id": 55,
      "start": 953.1600036621094,
      "end": 957.2799987792969,
      "text": " to Pierre and Kimberly, I said, man, he's pulling weeds. He can come back anytime he"
    },
    {
      "id": 56,
      "start": 957.2799987792969,
      "end": 963.8399963378906,
      "text": " wants. We've got a whole lot of weeds. He's pulling weeds. A little Isaac a few weeks"
    },
    {
      "id": 57,
      "start": 963.8399963378906,
      "end": 967.6600036621094,
      "text": " ago, probably actually six or eight weeks ago now, I was out on a Wednesday evening"
    },
    {
      "id": 58,
      "start": 967.6600036621094,
      "end": 972.6399841308594,
      "text": " before church and just a couple of people were here and the porch had all kinds of stuff"
    },
    {
      "id": 59,
      "start": 972.6399841308594,
      "end": 976.7200012207031,
      "text": " that had blown on it from the wind and the trees and what have you. And I'm out there"
    },
    {
      "id": 60,
      "start": 976.7200012207031,
      "end": 985.9199829101562,
      "text": " with a broom and I'm sweeping the porch. Isaac is watching me. You know, Isaac's a thinker."
    },
    {
      "id": 61,
      "start": 985.9199829101562,
      "end": 993.6000061035156,
      "text": " He really is. Isaac, how you doing? And there's like this long pause. Good. And I'm like,"
    },
    {
      "id": 62,
      "start": 993.6000061035156,
      "end": 996.760009765625,
      "text": " that's not like, it's not like most of us. How are you doing? Good. And you just don't"
    },
    {
      "id": 63,
      "start": 996.760009765625,
      "end": 1002.0400085449219,
      "text": " even think about it. Right. But Isaac and Isaac kind of watching me and then he goes"
    },
    {
      "id": 64,
      "start": 1002.0400085449219,
      "end": 1007.5199890136719,
      "text": " away and he goes into the van of the tray hose. He comes back and his little kids broom"
    },
    {
      "id": 65,
      "start": 1007.5199890136719,
      "end": 1015.5599975585938,
      "text": " and he starts helping me sweep the porch. I didn't ask him to help me. It's good for"
    },
    {
      "id": 66,
      "start": 1015.6000061035156,
      "end": 1023.9199829101562,
      "text": " kids to learn how to work. It really is. And we see in the truth of God's Word with regard"
    },
    {
      "id": 67,
      "start": 1023.9199829101562,
      "end": 1030.1600036621094,
      "text": " to work. Listen, the Bible tells us if a man doesn't work, he shouldn't eat. Now I understand"
    },
    {
      "id": 68,
      "start": 1030.1600036621094,
      "end": 1039.1199951171875,
      "text": " that's not popular today. I understand. But it's biblical. It's biblical. And hard work"
    },
    {
      "id": 69,
      "start": 1039.1199951171875,
      "end": 1044.6799926757812,
      "text": " we see in the life as we begin to look at the life of Joseph and as we begin an introduction"
    },
    {
      "id": 70,
      "start": 1044.6799926757812,
      "end": 1050.1999816894531,
      "text": " for this study that will spend and span a number of chapters from God's Word with regard"
    },
    {
      "id": 71,
      "start": 1050.1999816894531,
      "end": 1057.0799865722656,
      "text": " to the life of Joseph, we see here that he's, he's working. But notice what the Bible says"
    },
    {
      "id": 72,
      "start": 1057.0799865722656,
      "end": 1061.6799926757812,
      "text": " back in Genesis chapter 37 and verse number two. I want you to notice that the Bible says"
    },
    {
      "id": 73,
      "start": 1061.6799926757812,
      "end": 1068.5599975585938,
      "text": " this. These are the generations of Jacob. Joseph being 17 years old was feeding the"
    },
    {
      "id": 74,
      "start": 1068.5599975585938,
      "end": 1079.7200012207031,
      "text": " flock. Did you notice the next three words? With his brethren. He's feeding the flock"
    },
    {
      "id": 75,
      "start": 1079.7200012207031,
      "end": 1086.8800048828125,
      "text": " with the very ones that hate him, with the very ones that cannot speak peaceably unto"
    },
    {
      "id": 76,
      "start": 1086.8800048828125,
      "end": 1093.8399963378906,
      "text": " him. And he's working with them. Now I can only imagine and this is just my perspective."
    },
    {
      "id": 77,
      "start": 1093.8399963378906,
      "end": 1097.9199829101562,
      "text": " This is, the Bible doesn't tell us this but it's just my perspective. I would think that"
    },
    {
      "id": 78,
      "start": 1097.9199829101562,
      "end": 1102.0799865722656,
      "text": " if they hated him and could not speak peaceably unto him that they probably tried to give"
    },
    {
      "id": 79,
      "start": 1102.0799865722656,
      "end": 1109.2799987792969,
      "text": " him the hardest jobs. And give him the tasks that they didn't want to do. By the way, he's"
    },
    {
      "id": 80,
      "start": 1109.2799987792969,
      "end": 1117.0399780273438,
      "text": " younger. They're older. You think about that dynamic. And I see Joseph here and I think"
    },
    {
      "id": 81,
      "start": 1117.0399780273438,
      "end": 1123.0800170898438,
      "text": " about the fact that he's working, that he's feeding the flock and he's working right alongside"
    },
    {
      "id": 82,
      "start": 1123.2000122070312,
      "end": 1131.9199829101562,
      "text": " those that hate him. Just because they hated him doesn't mean he has to hate them. The"
    },
    {
      "id": 83,
      "start": 1131.9199829101562,
      "end": 1138.7999877929688,
      "text": " Bible tells us in Romans chapter 12, if you want to take a moment to turn there, in Romans"
    },
    {
      "id": 84,
      "start": 1138.7999877929688,
      "end": 1149.260009765625,
      "text": " chapter number 12 God gives us some instruction that quite honestly goes against your flesh"
    },
    {
      "id": 85,
      "start": 1149.260009765625,
      "end": 1158.7000122070312,
      "text": " and my flesh. But the Bible tells us in Romans chapter number 12, in verse number 17, recompense"
    },
    {
      "id": 86,
      "start": 1158.7000122070312,
      "end": 1165.7799682617188,
      "text": " to no man evil for evil. Provide things honest in the sight of all men. Notice verse 18,"
    },
    {
      "id": 87,
      "start": 1165.7799682617188,
      "end": 1173.5800170898438,
      "text": " if it be possible, as much as life in you, live peaceably with all men. Sometimes that's"
    },
    {
      "id": 88,
      "start": 1173.5800170898438,
      "end": 1180.6599731445312,
      "text": " a challenging verse of scripture to live out in your life. Joseph was hated by his"
    },
    {
      "id": 89,
      "start": 1180.6599731445312,
      "end": 1186.8200073242188,
      "text": " brethren. They could not speak peaceably unto him. But he's working with them. He's working"
    },
    {
      "id": 90,
      "start": 1186.8200073242188,
      "end": 1192.6199951171875,
      "text": " with them. Just because they hated him doesn't mean he has to hate them. Dearly beloved,"
    },
    {
      "id": 91,
      "start": 1192.6199951171875,
      "end": 1197.8599853515625,
      "text": " verse 19, avenge not yourselves but rather give place unto wrath for it is written vengeance"
    },
    {
      "id": 92,
      "start": 1197.8599853515625,
      "end": 1200.219970703125,
      "text": " is mine. I will repay, saith the Lord."
    },
    {
      "id": 0,
      "start": 1200.219970703125,
      "end": 1202.4199707508087,
      "text": " Therefore, if thine enemy hunger, feed him."
    },
    {
      "id": 1,
      "start": 1202.4199707508087,
      "end": 1203.7399706840515,
      "text": " If he thirst, give him drink."
    },
    {
      "id": 2,
      "start": 1203.7399706840515,
      "end": 1206.5799708366394,
      "text": " For in so doing, thou shalt heap coals of fire in his head."
    },
    {
      "id": 3,
      "start": 1206.5799708366394,
      "end": 1210.6999702453613,
      "text": " Be not overcome of evil, but overcome evil with good."
    },
    {
      "id": 4,
      "start": 1210.6999702453613,
      "end": 1213.7799711227417,
      "text": " Listen, that goes against your flesh and my flesh."
    },
    {
      "id": 5,
      "start": 1213.7799711227417,
      "end": 1215.379970550537,
      "text": " It really does."
    },
    {
      "id": 6,
      "start": 1215.379970550537,
      "end": 1217.3399715423584,
      "text": " That's trusting God."
    },
    {
      "id": 7,
      "start": 1217.3399715423584,
      "end": 1220.2599716186523,
      "text": " That's taking your walk of faith to a whole nother level."
    },
    {
      "id": 8,
      "start": 1221.3399715423584,
      "end": 1225.3399715423584,
      "text": " And we find that here, it reminds me of the relationship"
    },
    {
      "id": 9,
      "start": 1225.3399715423584,
      "end": 1229.059970855713,
      "text": " or the interaction, if you will, between David and Saul."
    },
    {
      "id": 10,
      "start": 1230.059970855713,
      "end": 1232.2999725341797,
      "text": " Saul wanted to kill David."
    },
    {
      "id": 11,
      "start": 1233.4599723815918,
      "end": 1235.4599723815918,
      "text": " Saul tried to get others to kill him."
    },
    {
      "id": 12,
      "start": 1235.4599723815918,
      "end": 1237.379970550537,
      "text": " He tried to get the Philistines to kill him"
    },
    {
      "id": 13,
      "start": 1237.379970550537,
      "end": 1239.2599716186523,
      "text": " and tried to get his own men to kill him."
    },
    {
      "id": 14,
      "start": 1239.2599716186523,
      "end": 1241.5799713134766,
      "text": " And then David is hunted by Saul."
    },
    {
      "id": 15,
      "start": 1241.5799713134766,
      "end": 1243.379970550537,
      "text": " He goes out, he's seeking him every day."
    },
    {
      "id": 16,
      "start": 1243.379970550537,
      "end": 1245.0999717712402,
      "text": " He's going and doing all that he can."
    },
    {
      "id": 17,
      "start": 1245.0999717712402,
      "end": 1246.4199714660645,
      "text": " David says it this way,"
    },
    {
      "id": 18,
      "start": 1246.4199714660645,
      "end": 1249.4199714660645,
      "text": " there's but a step between me and death."
    },
    {
      "id": 19,
      "start": 1249.4199714660645,
      "end": 1250.9799690246582,
      "text": " He understood."
    },
    {
      "id": 20,
      "start": 1250.9799690246582,
      "end": 1253.5799713134766,
      "text": " But just because Saul made David his enemy,"
    },
    {
      "id": 21,
      "start": 1253.5799713134766,
      "end": 1256.2999725341797,
      "text": " and the Bible says he made him his enemy continually,"
    },
    {
      "id": 22,
      "start": 1257.2999725341797,
      "end": 1261.6999702453613,
      "text": " doesn't mean that David viewed Saul as an enemy."
    },
    {
      "id": 23,
      "start": 1261.6999702453613,
      "end": 1266.6999740600586,
      "text": " When David had opportunity to kill Saul, he didn't do it."
    },
    {
      "id": 24,
      "start": 1266.819969177246,
      "end": 1269.219970703125,
      "text": " He didn't raise his hand against God's anointed."
    },
    {
      "id": 25,
      "start": 1270.0599670410156,
      "end": 1272.3799743652344,
      "text": " And this evening, when I look at the character"
    },
    {
      "id": 26,
      "start": 1272.3799743652344,
      "end": 1275.2599716186523,
      "text": " of this man, Joseph, I understand his childhood"
    },
    {
      "id": 27,
      "start": 1275.2599716186523,
      "end": 1277.1399688720703,
      "text": " and I understand what's going on"
    },
    {
      "id": 28,
      "start": 1277.1399688720703,
      "end": 1280.4599685668945,
      "text": " as we begin to piece Scripture together"
    },
    {
      "id": 29,
      "start": 1280.4599685668945,
      "end": 1283.5799713134766,
      "text": " and look at what God tells us about the dysfunction"
    },
    {
      "id": 30,
      "start": 1283.5799713134766,
      "end": 1285.9999694824219,
      "text": " of the family and all that Joseph would have dealt with."
    },
    {
      "id": 31,
      "start": 1286.6999740600586,
      "end": 1288.9999694824219,
      "text": " But as I come and I look at the character of Joseph,"
    },
    {
      "id": 32,
      "start": 1288.9999694824219,
      "end": 1290.8799743652344,
      "text": " I see that he's a man that's hardworking."
    },
    {
      "id": 33,
      "start": 1290.8799743652344,
      "end": 1293.0799713134766,
      "text": " I see that he's working even amongst those"
    },
    {
      "id": 34,
      "start": 1293.0799713134766,
      "end": 1296.599967956543,
      "text": " that hate him and cannot speak peaceably unto him."
    },
    {
      "id": 35,
      "start": 1296.599967956543,
      "end": 1298.7999725341797,
      "text": " That tells me a lot about a man's character."
    },
    {
      "id": 36,
      "start": 1299.9799728393555,
      "end": 1302.5599670410156,
      "text": " That he's not fleshly minded."
    },
    {
      "id": 37,
      "start": 1302.5599670410156,
      "end": 1305.4199676513672,
      "text": " Remember we looked at the life there last Sunday night,"
    },
    {
      "id": 38,
      "start": 1305.4199676513672,
      "end": 1308.839973449707,
      "text": " looked at Genesis 36 when we talked about Esau."
    },
    {
      "id": 39,
      "start": 1308.839973449707,
      "end": 1310.219970703125,
      "text": " He's a fleshly minded man."
    },
    {
      "id": 40,
      "start": 1312.119972229004,
      "end": 1314.9599685668945,
      "text": " The Bible tells us the contrast between Jacob and Esau."
    },
    {
      "id": 41,
      "start": 1314.9599685668945,
      "end": 1319.2799682617188,
      "text": " Remember, why was all that was taking place there"
    },
    {
      "id": 42,
      "start": 1319.2799682617188,
      "end": 1322.1999740600586,
      "text": " even in the womb and the struggle within the womb"
    },
    {
      "id": 43,
      "start": 1322.1999740600586,
      "end": 1325.3599700927734,
      "text": " and God answered and said there's two nations"
    },
    {
      "id": 44,
      "start": 1325.3599700927734,
      "end": 1326.6399688720703,
      "text": " within thy womb."
    },
    {
      "id": 45,
      "start": 1326.6399688720703,
      "end": 1328.5599670410156,
      "text": " But we understand that by application"
    },
    {
      "id": 46,
      "start": 1328.5599670410156,
      "end": 1330.239974975586,
      "text": " there were two natures."
    },
    {
      "id": 47,
      "start": 1331.1199645996094,
      "end": 1333.0399780273438,
      "text": " Jacob representing the spirit"
    },
    {
      "id": 48,
      "start": 1333.0399780273438,
      "end": 1336.3199768066406,
      "text": " and Esau representing the flesh."
    },
    {
      "id": 49,
      "start": 1336.3199768066406,
      "end": 1338.1199645996094,
      "text": " And here in the text of Scripture,"
    },
    {
      "id": 50,
      "start": 1338.1199645996094,
      "end": 1341.4199676513672,
      "text": " we do not see that Joseph was a man"
    },
    {
      "id": 51,
      "start": 1341.4199676513672,
      "end": 1343.8399658203125,
      "text": " that was operating within the flesh."
    },
    {
      "id": 52,
      "start": 1344.9999694824219,
      "end": 1348.4399719238281,
      "text": " He was a man that was trusting the Lord."
    },
    {
      "id": 53,
      "start": 1348.4399719238281,
      "end": 1351.9999694824219,
      "text": " By the way, if you think about all of the things"
    },
    {
      "id": 54,
      "start": 1351.9999694824219,
      "end": 1354.6399688720703,
      "text": " that we will study, all of the events that are recorded"
    },
    {
      "id": 55,
      "start": 1354.6399688720703,
      "end": 1357.3399658203125,
      "text": " in the life of Joseph and many of us are familiar"
    },
    {
      "id": 56,
      "start": 1357.3399658203125,
      "end": 1361.3199768066406,
      "text": " with his life, the character of Joseph"
    },
    {
      "id": 57,
      "start": 1361.3199768066406,
      "end": 1364.239974975586,
      "text": " was not developed when he was in the pit."
    },
    {
      "id": 58,
      "start": 1365.7799682617188,
      "end": 1368.0799713134766,
      "text": " The character of Joseph was not developed"
    },
    {
      "id": 59,
      "start": 1368.0799713134766,
      "end": 1369.3999633789062,
      "text": " when he was in the prison."
    },
    {
      "id": 60,
      "start": 1372.5199737548828,
      "end": 1374.0799713134766,
      "text": " The character of Joseph was developed"
    },
    {
      "id": 61,
      "start": 1374.0799713134766,
      "end": 1375.479965209961,
      "text": " when he was just a young man."
    },
    {
      "id": 62,
      "start": 1377.199966430664,
      "end": 1382.1199645996094,
      "text": " You know, when he was dealing with all"
    },
    {
      "id": 63,
      "start": 1382.1199645996094,
      "end": 1384.719970703125,
      "text": " that he was dealing with, what's happening"
    },
    {
      "id": 64,
      "start": 1384.719970703125,
      "end": 1387.0399780273438,
      "text": " is God is revealing to us his character."
    },
    {
      "id": 65,
      "start": 1388.199966430664,
      "end": 1392.1399688720703,
      "text": " And here we see at the very start of God's introduction"
    },
    {
      "id": 66,
      "start": 1392.1399688720703,
      "end": 1395.3999633789062,
      "text": " to this man, Joseph, we see there's a man of character."
    },
    {
      "id": 67,
      "start": 1395.3999633789062,
      "end": 1397.1599731445312,
      "text": " I would say this, not only was he hard working,"
    },
    {
      "id": 68,
      "start": 1397.1599731445312,
      "end": 1400.0799713134766,
      "text": " not only was he a man that was not given to the flesh,"
    },
    {
      "id": 69,
      "start": 1400.0799713134766,
      "end": 1401.8799743652344,
      "text": " but I find this, that he was a man"
    },
    {
      "id": 70,
      "start": 1401.8799743652344,
      "end": 1404.4399719238281,
      "text": " that had a moral compass."
    },
    {
      "id": 71,
      "start": 1404.4399719238281,
      "end": 1405.2799682617188,
      "text": " What do I mean by that?"
    },
    {
      "id": 72,
      "start": 1405.2799682617188,
      "end": 1407.6399688720703,
      "text": " Well, he was a man that obviously knew"
    },
    {
      "id": 73,
      "start": 1407.6399688720703,
      "end": 1411.719970703125,
      "text": " the difference between right and wrong, good and evil."
    },
    {
      "id": 74,
      "start": 1411.719970703125,
      "end": 1413.3999633789062,
      "text": " The Bible says in verse number two"
    },
    {
      "id": 75,
      "start": 1413.3999633789062,
      "end": 1415.2799682617188,
      "text": " that they're there feeding the flock with his brethren"
    },
    {
      "id": 76,
      "start": 1415.2799682617188,
      "end": 1417.2799682617188,
      "text": " and the lad was with the sons of Bilhon,"
    },
    {
      "id": 77,
      "start": 1417.2799682617188,
      "end": 1419.6399688720703,
      "text": " with the sons of Zilpah, so the Bible tells us"
    },
    {
      "id": 78,
      "start": 1419.6399688720703,
      "end": 1422.959976196289,
      "text": " which of the sons specifically he was there with"
    },
    {
      "id": 79,
      "start": 1422.959976196289,
      "end": 1425.1199645996094,
      "text": " as they were working and it ends in verse number two"
    },
    {
      "id": 80,
      "start": 1425.1199645996094,
      "end": 1429.1199645996094,
      "text": " by saying this, and Joseph brought unto his father"
    },
    {
      "id": 81,
      "start": 1429.1199645996094,
      "end": 1432.6399688720703,
      "text": " their evil report."
    },
    {
      "id": 82,
      "start": 1432.6399688720703,
      "end": 1437.6399688720703,
      "text": " He brought unto their father, Jacob, their evil report."
    },
    {
      "id": 83,
      "start": 1437.959976196289,
      "end": 1440.1599731445312,
      "text": " Joseph had a moral compass."
    },
    {
      "id": 84,
      "start": 1440.1599731445312,
      "end": 1442.9199676513672,
      "text": " With all that he dealt with and all of the dysfunction"
    },
    {
      "id": 85,
      "start": 1442.9199676513672,
      "end": 1445.7999725341797,
      "text": " within the family, with all of the turbulent times"
    },
    {
      "id": 86,
      "start": 1445.7999725341797,
      "end": 1448.6799774169922,
      "text": " that were there in Paddan Aram with Laban"
    },
    {
      "id": 87,
      "start": 1448.6799774169922,
      "end": 1449.9199676513672,
      "text": " and all that had taken place,"
    },
    {
      "id": 88,
      "start": 1449.9199676513672,
      "end": 1453.719970703125,
      "text": " evidently God had worked in Joseph's life"
    },
    {
      "id": 89,
      "start": 1453.719970703125,
      "end": 1458.0399780273438,
      "text": " for him to have an understanding of who God is."
    },
    {
      "id": 90,
      "start": 1458.0399780273438,
      "end": 1461.5599670410156,
      "text": " And the difference between right and wrong, good and evil."
    },
    {
      "id": 91,
      "start": 1461.5599670410156,
      "end": 1464.1999816894531,
      "text": " Listen, when he stood in Potiphar's house"
    },
    {
      "id": 92,
      "start": 1464.1999816894531,
      "end": 1466.0799560546875,
      "text": " and Potiphar's wife said continually,"
    },
    {
      "id": 93,
      "start": 1466.0799560546875,
      "end": 1469.5999755859375,
      "text": " lie with me day by day, it wasn't in that moment"
    },
    {
      "id": 94,
      "start": 1469.5999755859375,
      "end": 1473.5999755859375,
      "text": " that all of a sudden Joseph developed this moral compass."
    },
    {
      "id": 95,
      "start": 1473.5999755859375,
      "end": 1476.9999694824219,
      "text": " No, early in his life he was able to understand"
    },
    {
      "id": 96,
      "start": 1476.9999694824219,
      "end": 1478.9599609375,
      "text": " that there's a God and there's truth"
    },
    {
      "id": 97,
      "start": 1478.9599609375,
      "end": 1480.5999755859375,
      "text": " and there's right and there's wrong,"
    },
    {
      "id": 98,
      "start": 1480.5999755859375,
      "end": 1482.5999755859375,
      "text": " there's good and there's evil."
    },
    {
      "id": 99,
      "start": 1482.5999755859375,
      "end": 1486.1199645996094,
      "text": " And he said, how then can I do this evil"
    },
    {
      "id": 100,
      "start": 1486.1199645996094,
      "end": 1488.0799560546875,
      "text": " in the sight of God?"
    },
    {
      "id": 101,
      "start": 1488.0799560546875,
      "end": 1490.97998046875,
      "text": " And that's a powerful statement that Joseph makes."
    },
    {
      "id": 102,
      "start": 1491.8399658203125,
      "end": 1494.6399841308594,
      "text": " But we find all the way back here in Genesis 37"
    },
    {
      "id": 103,
      "start": 1494.6399841308594,
      "end": 1496.8799743652344,
      "text": " when we're first introduced to this man Joseph"
    },
    {
      "id": 104,
      "start": 1496.8799743652344,
      "end": 1500.4199829101562,
      "text": " that he has a moral compass and begin to meditate"
    },
    {
      "id": 105,
      "start": 1500.4199829101562,
      "end": 1503.1799621582031,
      "text": " upon this truth that he's bringing to his father,"
    },
    {
      "id": 106,
      "start": 1503.1799621582031,
      "end": 1505.2399597167969,
      "text": " their evil report, and I'm reminded"
    },
    {
      "id": 107,
      "start": 1505.2399597167969,
      "end": 1507.6399841308594,
      "text": " of what happened in Genesis 35."
    },
    {
      "id": 108,
      "start": 1508.4999694824219,
      "end": 1512.3199768066406,
      "text": " Turn back, if you will, to Genesis chapter number 35."
    },
    {
      "id": 109,
      "start": 1512.3199768066406,
      "end": 1515.5199584960938,
      "text": " We studied this portion of scripture several weeks ago,"
    },
    {
      "id": 110,
      "start": 1515.9199829101562,
      "end": 1517.9999694824219,
      "text": " but I want you to understand that as you come here"
    },
    {
      "id": 111,
      "start": 1517.9999694824219,
      "end": 1522.3999633789062,
      "text": " to Genesis chapter 35, the reunion with Esau"
    },
    {
      "id": 112,
      "start": 1522.3999633789062,
      "end": 1525.9999694824219,
      "text": " has already taken place and all that's gone on there,"
    },
    {
      "id": 113,
      "start": 1525.9999694824219,
      "end": 1528.3599853515625,
      "text": " but we find that the Bible tells us,"
    },
    {
      "id": 114,
      "start": 1528.3599853515625,
      "end": 1532.3999633789062,
      "text": " remember in chapter 34, we read of that situation"
    },
    {
      "id": 115,
      "start": 1532.3999633789062,
      "end": 1535.8399658203125,
      "text": " with the massacre at Shechem and all that took place"
    },
    {
      "id": 116,
      "start": 1535.8399658203125,
      "end": 1538.9199829101562,
      "text": " and we dealt with that, but you come to chapter 35"
    },
    {
      "id": 117,
      "start": 1538.9199829101562,
      "end": 1541.5199584960938,
      "text": " and God says to Jacob in verse number one,"
    },
    {
      "id": 118,
      "start": 1541.5199584960938,
      "end": 1545.7999572753906,
      "text": " arise, go up to Bethel, and dwell there."
    },
    {
      "id": 119,
      "start": 1545.7999572753906,
      "end": 1549.3199768066406,
      "text": " And we made note as we studied Genesis chapter number 35"
    },
    {
      "id": 120,
      "start": 1549.3199768066406,
      "end": 1551.1999816894531,
      "text": " that they were going to Bethel,"
    },
    {
      "id": 121,
      "start": 1551.1999816894531,
      "end": 1553.7999572753906,
      "text": " they were going to the house of God."
    },
    {
      "id": 122,
      "start": 1556.3999633789062,
      "end": 1560.8399658203125,
      "text": " And Jacob gave some instruction to his family"
    },
    {
      "id": 123,
      "start": 1560.8399658203125,
      "end": 1565.1799621582031,
      "text": " when they were preparing to go to the house of God."
    },
    {
      "id": 124,
      "start": 1565.1799621582031,
      "end": 1567.2399597167969,
      "text": " And he says to them in verse number two,"
    },
    {
      "id": 125,
      "start": 1567.2399597167969,
      "end": 1569.0399780273438,
      "text": " then Jacob said unto his household"
    },
    {
      "id": 126,
      "start": 1569.0399780273438,
      "end": 1570.5599670410156,
      "text": " and to all that were with him,"
    },
    {
      "id": 127,
      "start": 1570.5599670410156,
      "end": 1573.5199584960938,
      "text": " put away the strange gods that are among you"
    },
    {
      "id": 128,
      "start": 1573.5199584960938,
      "end": 1576.8799743652344,
      "text": " and be clean and change your garments"
    },
    {
      "id": 129,
      "start": 1576.8799743652344,
      "end": 1579.4399719238281,
      "text": " and let us arise and go up to Bethel"
    },
    {
      "id": 130,
      "start": 1579.4399719238281,
      "end": 1581.4399719238281,
      "text": " and I will make there an altar unto God"
    },
    {
      "id": 131,
      "start": 1581.4399719238281,
      "end": 1583.5999755859375,
      "text": " who answered me in the day of my distress"
    },
    {
      "id": 132,
      "start": 1583.5999755859375,
      "end": 1586.5199584960938,
      "text": " and was with me in the way which I went."
    },
    {
      "id": 133,
      "start": 1587.6399841308594,
      "end": 1589.7799682617188,
      "text": " Jacob had been to Bethel before."
    },
    {
      "id": 134,
      "start": 1590.7999572753906,
      "end": 1593.1599731445312,
      "text": " As far as I can tell in my Bible study,"
    },
    {
      "id": 135,
      "start": 1593.1599731445312,
      "end": 1595.9199829101562,
      "text": " Joseph has not been to Bethel until this time"
    },
    {
      "id": 136,
      "start": 1595.9199829101562,
      "end": 1600.47998046875,
      "text": " in Genesis 35, but Jacob had been at Bethel"
    },
    {
      "id": 137,
      "start": 1601.3199768066406,
      "end": 1602.2399597167969,
      "text": " and Jacob had experienced that"
    },
    {
      "id": 138,
      "start": 1602.2399597167969,
      "end": 1606.1599731445312,
      "text": " and Jacob knew what God did when he was there in Bethel"
    },
    {
      "id": 139,
      "start": 1606.1599731445312,
      "end": 1608.2399597167969,
      "text": " and he says to his family, he says,"
    },
    {
      "id": 140,
      "start": 1608.2399597167969,
      "end": 1609.9599609375,
      "text": " we're going to go to Bethel"
    },
    {
      "id": 141,
      "start": 1609.9599609375,
      "end": 1612.719970703125,
      "text": " and we are going to worship God."
    },
    {
      "id": 142,
      "start": 1614.47998046875,
      "end": 1616.5999755859375,
      "text": " And as I preached through Genesis chapter 35"
    },
    {
      "id": 143,
      "start": 1616.5999755859375,
      "end": 1619.9999694824219,
      "text": " several weeks ago, I mentioned how that we must be prepared"
    },
    {
      "id": 144,
      "start": 1619.9999694824219,
      "end": 1620.8799743652344,
      "text": " for worship."
    },
    {
      "id": 145,
      "start": 1622.7599792480469,
      "end": 1624.47998046875,
      "text": " He tells them in verse two,"
    },
    {
      "id": 146,
      "start": 1624.47998046875,
      "end": 1626.9199829101562,
      "text": " to put away the strange gods that are among you,"
    },
    {
      "id": 147,
      "start": 1626.9199829101562,
      "end": 1630.3999633789062,
      "text": " to be clean and to change your garments."
    },
    {
      "id": 148,
      "start": 1631.3199768066406,
      "end": 1632.8399658203125,
      "text": " I'm not gonna re-preach what I preached a few weeks ago,"
    },
    {
      "id": 149,
      "start": 1632.8399658203125,
      "end": 1636.3199768066406,
      "text": " but I believe this evening that as we come to chapter 37"
    },
    {
      "id": 150,
      "start": 1636.3199768066406,
      "end": 1640.0799560546875,
      "text": " and we're introduced to Joseph as a 17 year old young man,"
    },
    {
      "id": 151,
      "start": 1640.0799560546875,
      "end": 1643.5199584960938,
      "text": " that their moral compass that was developed in Joseph,"
    },
    {
      "id": 152,
      "start": 1643.5199584960938,
      "end": 1646.7999572753906,
      "text": " that somehow there was an impact in his life"
    },
    {
      "id": 153,
      "start": 1646.7999572753906,
      "end": 1648.5999755859375,
      "text": " from that experience in Genesis 35"
    },
    {
      "id": 154,
      "start": 1648.5999755859375,
      "end": 1651.5999755859375,
      "text": " when they went to Bethel, when they went to the house of God."
    },
    {
      "id": 155,
      "start": 1652.8399658203125,
      "end": 1655.3599853515625,
      "text": " And God did something in Joseph's life."
    },
    {
      "id": 156,
      "start": 1656.3599853515625,
      "end": 1661.3599853515625,
      "text": " Joseph, listen, I understand that the other sons were there"
    },
    {
      "id": 157,
      "start": 1663.3199768066406,
      "end": 1664.719970703125,
      "text": " but you understand there are a whole bunch of people"
    },
    {
      "id": 158,
      "start": 1664.719970703125,
      "end": 1666.3199768066406,
      "text": " that heard Jesus preach"
    },
    {
      "id": 159,
      "start": 1668.1999816894531,
      "end": 1670.3999633789062,
      "text": " and some left doing what Jesus said"
    },
    {
      "id": 160,
      "start": 1670.3999633789062,
      "end": 1673.219970703125,
      "text": " and others left not doing what Jesus said."
    },
    {
      "id": 161,
      "start": 1674.1999816894531,
      "end": 1678.3599853515625,
      "text": " It wasn't in the message or the messenger,"
    },
    {
      "id": 162,
      "start": 1678.3599853515625,
      "end": 1679.5999755859375,
      "text": " it was in the individual."
    },
    {
      "id": 163,
      "start": 1680.9599609375,
      "end": 1683.0799560546875,
      "text": " We find that Jesus said,"
    },
    {
      "id": 164,
      "start": 1683.0799560546875,
      "end": 1685.9399719238281,
      "text": " those that hear and do are like the wise man."
    },
    {
      "id": 165,
      "start": 1687.3199768066406,
      "end": 1692.3199768066406,
      "text": " Those that hear and do not are like the foolish man."
    },
    {
      "id": 166,
      "start": 1692.8399658203125,
      "end": 1694.3999633789062,
      "text": " We sing the song with the children,"
    },
    {
      "id": 167,
      "start": 1694.3999633789062,
      "end": 1696.719970703125,
      "text": " the wise man built his house upon the rocks."
    },
    {
      "id": 168,
      "start": 1698.9599609375,
      "end": 1703.3799743652344,
      "text": " We find that here, that though the other sons,"
    },
    {
      "id": 169,
      "start": 1703.3799743652344,
      "end": 1705.1599731445312,
      "text": " they went to Bethel as well,"
    },
    {
      "id": 170,
      "start": 1705.1599731445312,
      "end": 1710.1599731445312,
      "text": " I believe that Joseph had an encounter with God"
    },
    {
      "id": 171,
      "start": 1710.1999816894531,
      "end": 1712.6599731445312,
      "text": " that had an impact in his life,"
    },
    {
      "id": 172,
      "start": 1713.2599487304688,
      "end": 1715.5399780273438,
      "text": " that helped him have this moral compass."
    },
    {
      "id": 173,
      "start": 1715.5399780273438,
      "end": 1719.2799682617188,
      "text": " You understand this evening that there is right and wrong."
    },
    {
      "id": 174,
      "start": 1720.3799438476562,
      "end": 1721.8799438476562,
      "text": " There is good and evil."
    },
    {
      "id": 175,
      "start": 1723.9199829101562,
      "end": 1725.6199951171875,
      "text": " Our theme for Vacation Bible School"
    },
    {
      "id": 176,
      "start": 1725.6199951171875,
      "end": 1727.699951171875,
      "text": " will be dealing with this truth"
    },
    {
      "id": 177,
      "start": 1727.699951171875,
      "end": 1729.1799926757812,
      "text": " of being keepers of the kingdom"
    },
    {
      "id": 178,
      "start": 1729.1799926757812,
      "end": 1731.8799438476562,
      "text": " and dealing with the fact that there are two kingdoms"
    },
    {
      "id": 179,
      "start": 1731.8799438476562,
      "end": 1732.719970703125,
      "text": " in this world."
    },
    {
      "id": 180,
      "start": 1732.719970703125,
      "end": 1737.0399780273438,
      "text": " There's a kingdom for good and there's a kingdom for evil."
    },
    {
      "id": 181,
      "start": 1737.7999877929688,
      "end": 1742.7999877929688,
      "text": " Good master is what one said to Jesus."
    },
    {
      "id": 182,
      "start": 1747.3199462890625,
      "end": 1750.0199584960938,
      "text": " And Jesus said, why calleth me good?"
    },
    {
      "id": 183,
      "start": 1753.0799560546875,
      "end": 1754.3999633789062,
      "text": " Who defines good?"
    },
    {
      "id": 184,
      "start": 1755.4599609375,
      "end": 1758.0,
      "text": " God, because only God is good."
    },
    {
      "id": 185,
      "start": 1759.5999755859375,
      "end": 1762.6799926757812,
      "text": " And when God tells us in his word to do good,"
    },
    {
      "id": 186,
      "start": 1763.6799926757812,
      "end": 1767.3199462890625,
      "text": " we have to go to the Bible and find out what that is,"
    },
    {
      "id": 187,
      "start": 1767.3199462890625,
      "end": 1768.3799438476562,
      "text": " what pleases him."
    },
    {
      "id": 188,
      "start": 1769.199951171875,
      "end": 1773.3999633789062,
      "text": " And we find that Joseph having this moral compass,"
    },
    {
      "id": 189,
      "start": 1773.3999633789062,
      "end": 1775.8399658203125,
      "text": " being 17 years old, the Bible says that he brought"
    },
    {
      "id": 190,
      "start": 1775.8399658203125,
      "end": 1779.8399658203125,
      "text": " unto his father their evil report."
    },
    {
      "id": 191,
      "start": 1779.8399658203125,
      "end": 1781.7599487304688,
      "text": " You're in a situation where you knew"
    },
    {
      "id": 192,
      "start": 1781.7599487304688,
      "end": 1782.8399658203125,
      "text": " you had to do something right,"
    },
    {
      "id": 193,
      "start": 1782.8399658203125,
      "end": 1784.3999633789062,
      "text": " but it was gonna be hard to do."
    },
    {
      "id": 194,
      "start": 1785.9199829101562,
      "end": 1788.0,
      "text": " Some people would look at verse number two"
    },
    {
      "id": 195,
      "start": 1788.0,
      "end": 1791.2999877929688,
      "text": " and say that Joseph was a tattletale."
    },
    {
      "id": 196,
      "start": 1792.2999877929688,
      "end": 1795.739990234375,
      "text": " He's running back and I don't look at it that way."
    },
    {
      "id": 197,
      "start": 1797.699951171875,
      "end": 1799.2999877929688,
      "text": " He had a moral compass."
    },
    {
      "id": 198,
      "start": 1799.2999877929688,
      "end": 1800.8999633789062,
      "text": " And so what those boys are doing."
    },
    {
      "id": 0,
      "start": 1800.8999633789062,
      "end": 1808.91996383667,
      "text": " is not right. And it had to have been so egregious that Joseph understood that"
    },
    {
      "id": 1,
      "start": 1808.91996383667,
      "end": 1817.4799633026123,
      "text": " Jacob had to be aware of this. And Joseph had courage to bring that evil report"
    },
    {
      "id": 2,
      "start": 1817.4799633026123,
      "end": 1823.6399631500244,
      "text": " back to his father. I don't think it would be easy. I really don't. I think"
    },
    {
      "id": 3,
      "start": 1823.6399631500244,
      "end": 1828.2799625396729,
      "text": " that understanding the childhood and the upbringing, the family"
    },
    {
      "id": 4,
      "start": 1828.2799625396729,
      "end": 1831.8199634552002,
      "text": " dynamic, and understand the Bible says they hated him and they could not speak"
    },
    {
      "id": 5,
      "start": 1831.8199634552002,
      "end": 1835.6599617004395,
      "text": " peaceably unto him. Obviously in just a little while we'll find how they take"
    },
    {
      "id": 6,
      "start": 1835.6599617004395,
      "end": 1838.5399627685547,
      "text": " him and they're gonna conspire to kill him. And then they say, well, no, let's"
    },
    {
      "id": 7,
      "start": 1838.5399627685547,
      "end": 1842.139965057373,
      "text": " just sell him because we can get some money for him, and so on and so forth. But"
    },
    {
      "id": 8,
      "start": 1842.139965057373,
      "end": 1846.2599639892578,
      "text": " we find here that when Joseph brought unto his father their evil report,"
    },
    {
      "id": 9,
      "start": 1846.2599639892578,
      "end": 1855.6599617004395,
      "text": " this took a measure of courage. He didn't just turn a blind eye. I understand this"
    },
    {
      "id": 10,
      "start": 1855.6599617004395,
      "end": 1864.0599632263184,
      "text": " evening that it's not popular, it's not comfortable to confront someone about"
    },
    {
      "id": 11,
      "start": 1864.0599632263184,
      "end": 1869.8199615478516,
      "text": " their wicked behavior, to deal with something. But I would submit to you this"
    },
    {
      "id": 12,
      "start": 1869.8199615478516,
      "end": 1875.0199661254883,
      "text": " evening that there is right and there is wrong. There's good and there's evil."
    },
    {
      "id": 13,
      "start": 1875.0199661254883,
      "end": 1878.979965209961,
      "text": " There are times in our lives where God will put us in a place where we have to"
    },
    {
      "id": 14,
      "start": 1878.979965209961,
      "end": 1886.0599670410156,
      "text": " have that moral compass and we have to be willing to have that measure of"
    },
    {
      "id": 15,
      "start": 1886.0599670410156,
      "end": 1893.0199661254883,
      "text": " courage to be able to stand and say, no, that's just not right. That's just not"
    },
    {
      "id": 16,
      "start": 1893.0199661254883,
      "end": 1900.2199630737305,
      "text": " right. He had this moral compass and therefore he stood for right. He stood"
    },
    {
      "id": 17,
      "start": 1900.2199630737305,
      "end": 1906.859962463379,
      "text": " for right. I think about Nathan. I already mentioned about David and Saul. But think"
    },
    {
      "id": 18,
      "start": 1906.8999633789062,
      "end": 1918.6199645996094,
      "text": " about Nathan. God supernaturally revealed to Nathan the sin of David and then"
    },
    {
      "id": 19,
      "start": 1918.6199645996094,
      "end": 1926.2599639892578,
      "text": " instructed him to confront David. By the way, it's no easy task to go stand before"
    },
    {
      "id": 20,
      "start": 1926.2599639892578,
      "end": 1936.8999633789062,
      "text": " a king and to say, thou art the man. But it was necessary. It was needful. And I think"
    },
    {
      "id": 21,
      "start": 1936.8999633789062,
      "end": 1942.8199615478516,
      "text": " about Joseph here in Genesis chapter 37. And I think about Joseph and I think about"
    },
    {
      "id": 22,
      "start": 1942.8199615478516,
      "end": 1947.6599578857422,
      "text": " his character and how he brought unto his father their evil report. And as I look at"
    },
    {
      "id": 23,
      "start": 1947.6599578857422,
      "end": 1951.0999603271484,
      "text": " that statement and I see what's happening, yes, the moral compass, but the standing"
    },
    {
      "id": 24,
      "start": 1951.0999603271484,
      "end": 1961.8999633789062,
      "text": " for right. Look over to Ephesians chapter 6, if you will. Ephesians chapter number 6."
    },
    {
      "id": 25,
      "start": 1961.8999633789062,
      "end": 1966.4599609375,
      "text": " As we look at Ephesians 6, we're familiar with the passage of scripture. As we think"
    },
    {
      "id": 26,
      "start": 1966.4599609375,
      "end": 1973.6599578857422,
      "text": " about the character of Joseph and the need for us this evening to stand, we sing, stand"
    },
    {
      "id": 27,
      "start": 1973.6599578857422,
      "end": 1986.4599609375,
      "text": " up, stand up, stand up for Jesus. God says through Paul to the believers of Ephesus,"
    },
    {
      "id": 28,
      "start": 1986.4599609375,
      "end": 1992.699966430664,
      "text": " finally in verse number 10 of Ephesians 6, my brethren, be strong in the Lord and the"
    },
    {
      "id": 29,
      "start": 1992.699966430664,
      "end": 2001.2999572753906,
      "text": " power of His might. Put on the whole armor of God, why? That you may be able to stand"
    },
    {
      "id": 30,
      "start": 2001.2999572753906,
      "end": 2009.4599609375,
      "text": " against the wiles of the devil. For we wrestle not against flesh and blood, but against principalities,"
    },
    {
      "id": 31,
      "start": 2009.4599609375,
      "end": 2012.4199676513672,
      "text": " against powers, against the rulers of the darkness of this world, against spiritual"
    },
    {
      "id": 32,
      "start": 2012.4199676513672,
      "end": 2019.5799560546875,
      "text": " wickedness in high places. Wherefore, take unto you the whole armor of God, that you"
    },
    {
      "id": 33,
      "start": 2019.5799560546875,
      "end": 2028.219970703125,
      "text": " may be able to withstand in the evil day, having done all to stand. Stand therefore,"
    },
    {
      "id": 34,
      "start": 2028.219970703125,
      "end": 2034.8599700927734,
      "text": " having your loins girt about with truth, and having on the breastplate of righteousness,"
    },
    {
      "id": 35,
      "start": 2034.8599700927734,
      "end": 2040.0199584960938,
      "text": " your feet shod with the preparation of the gospel of peace. Above all, taking the shield"
    },
    {
      "id": 36,
      "start": 2040.0199584960938,
      "end": 2044.5399627685547,
      "text": " of faith, wherewith ye shall be able to quench all the fiery darts of the wicked, and take"
    },
    {
      "id": 37,
      "start": 2044.5399627685547,
      "end": 2050.8599700927734,
      "text": " the helmet of salvation and the sword of the Spirit, which is the word of God. As you read"
    },
    {
      "id": 38,
      "start": 2050.8599700927734,
      "end": 2054.8199615478516,
      "text": " these few verses of scripture, verse 18 says, praying always with all prayer and supplication"
    },
    {
      "id": 39,
      "start": 2054.8199615478516,
      "end": 2058.7799682617188,
      "text": " of the Spirit, and watching thereunto with all perseverance and supplication for all"
    },
    {
      "id": 40,
      "start": 2058.7799682617188,
      "end": 2063.219970703125,
      "text": " saints. But as you read through this portion of scripture, you'll see stand or withstand"
    },
    {
      "id": 41,
      "start": 2063.219970703125,
      "end": 2069.1399536132812,
      "text": " mentioned several times. We're living in a time where we need some of God's people to"
    },
    {
      "id": 42,
      "start": 2069.1399536132812,
      "end": 2077.1399536132812,
      "text": " have the kind of character that Joseph had. As a 17 year old boy, to stand up for truth,"
    },
    {
      "id": 43,
      "start": 2077.1399536132812,
      "end": 2083.499969482422,
      "text": " to stand up for right, what you're doing is wrong. It's evil. It's ungodly. Again, it"
    },
    {
      "id": 44,
      "start": 2083.499969482422,
      "end": 2089.6199645996094,
      "text": " must have been egregious for Joseph to have that understanding that he had to bring this"
    },
    {
      "id": 45,
      "start": 2089.6199645996094,
      "end": 2099.5799560546875,
      "text": " evil report to his father Jacob. No doubt this would only add to the dysfunction of"
    },
    {
      "id": 46,
      "start": 2099.5799560546875,
      "end": 2106.0199584960938,
      "text": " the family, to the hatred of the brethren towards Joseph. But Jesus said this, if the"
    },
    {
      "id": 47,
      "start": 2106.0199584960938,
      "end": 2113.499969482422,
      "text": " world hates you, just remember that they hated me first. If you read through the Gospel"
    },
    {
      "id": 48,
      "start": 2113.499969482422,
      "end": 2118.0199584960938,
      "text": " of John, you find that God is preparing His servants. Look over, if you will, at John"
    },
    {
      "id": 49,
      "start": 2118.0199584960938,
      "end": 2125.4599609375,
      "text": " 15, and notice what the Bible says as you begin to look through this portion of scripture"
    },
    {
      "id": 50,
      "start": 2125.4599609375,
      "end": 2133.5399780273438,
      "text": " and begin to understand as the Lord Jesus Christ is trying to prepare His children for"
    },
    {
      "id": 51,
      "start": 2133.5399780273438,
      "end": 2144.3799743652344,
      "text": " their service to Him. Listen, if the world loves us, there's probably something wrong."
    },
    {
      "id": 52,
      "start": 2144.3799743652344,
      "end": 2155.8999633789062,
      "text": " Honestly. Look at John 15 and verse 18. If the world hates you, you know that it hated"
    },
    {
      "id": 53,
      "start": 2155.8999633789062,
      "end": 2163.2599487304688,
      "text": " me before it hated you. If ye were of the world, the world would love his own. But are"
    },
    {
      "id": 54,
      "start": 2163.2599487304688,
      "end": 2166.6199645996094,
      "text": " we to be of the world? The Bible says love not the world, neither the things that are"
    },
    {
      "id": 55,
      "start": 2166.6199645996094,
      "end": 2170.8999633789062,
      "text": " in the world. The Bible tells us that if we love the world, that the love of the Father"
    },
    {
      "id": 56,
      "start": 2170.8999633789062,
      "end": 2178.0799560546875,
      "text": " is not in us. You read the book of James, it's pretty strong language that if we're"
    },
    {
      "id": 57,
      "start": 2178.0799560546875,
      "end": 2185.2999572753906,
      "text": " friends with the world, that we're enemies of God. That's pretty strong language. Here"
    },
    {
      "id": 58,
      "start": 2185.2999572753906,
      "end": 2189.979949951172,
      "text": " he says in verse 19, if ye were of the world, the world would love his own. But because"
    },
    {
      "id": 59,
      "start": 2189.979949951172,
      "end": 2194.1399536132812,
      "text": " you're not of the world, but I have chosen you out of the world, therefore the world"
    },
    {
      "id": 60,
      "start": 2194.1399536132812,
      "end": 2198.739959716797,
      "text": " hateth you. Remember the word that I said unto you, the servant is not greater than"
    },
    {
      "id": 61,
      "start": 2198.739959716797,
      "end": 2202.8599548339844,
      "text": " his Lord. If they have persecuted me, they will also persecute you. If they have kept"
    },
    {
      "id": 62,
      "start": 2202.8599548339844,
      "end": 2207.419952392578,
      "text": " my saying, they will keep yours also. But all these things will they do unto you for"
    },
    {
      "id": 63,
      "start": 2207.419952392578,
      "end": 2213.0199584960938,
      "text": " my name's sake, because they know not him that sent me. We could read through the end"
    },
    {
      "id": 64,
      "start": 2213.0199584960938,
      "end": 2216.8999633789062,
      "text": " of the chapter, we could read into the beginning of chapter 16, and we could read all of that"
    },
    {
      "id": 65,
      "start": 2216.8999633789062,
      "end": 2222.8999633789062,
      "text": " text and see how the Lord is preparing his servants, but we find here this evening that"
    },
    {
      "id": 66,
      "start": 2222.8999633789062,
      "end": 2227.2999572753906,
      "text": " listen, when we stand for truth and we stand for right, when we have that moral compass"
    },
    {
      "id": 67,
      "start": 2227.2999572753906,
      "end": 2232.8599548339844,
      "text": " that is the result of the biblical truth that God has given us, it's not going to make us"
    },
    {
      "id": 68,
      "start": 2232.8599548339844,
      "end": 2245.2599487304688,
      "text": " popular with the world. But I'd rather be right with God than popular with the world."
    },
    {
      "id": 69,
      "start": 2245.2599487304688,
      "end": 2251.8199768066406,
      "text": " And this evening, listen we're dealing with some things in our world today. We're dealing"
    },
    {
      "id": 70,
      "start": 2251.8199768066406,
      "end": 2257.3399658203125,
      "text": " with some crazy things in our world today. There's right and wrong. There's good and"
    },
    {
      "id": 71,
      "start": 2257.3399658203125,
      "end": 2264.419952392578,
      "text": " evil. When I begin to look at the life of Joseph and all the things that we're studying,"
    },
    {
      "id": 72,
      "start": 2264.419952392578,
      "end": 2269.2999572753906,
      "text": " all the events that God gives us, I see in just these first few verses of introduction"
    },
    {
      "id": 73,
      "start": 2269.2999572753906,
      "end": 2276.7799682617188,
      "text": " that Joseph was a man of character. At 17 years old, he had character. He stood for"
    },
    {
      "id": 74,
      "start": 2276.7799682617188,
      "end": 2286.979949951172,
      "text": " what was right. Listen, he could have, as some have developed today in our society,"
    },
    {
      "id": 75,
      "start": 2286.979949951172,
      "end": 2295.8199768066406,
      "text": " developed some kind of a victim mentality. Excused his not serving the Lord because of"
    },
    {
      "id": 76,
      "start": 2295.8199768066406,
      "end": 2301.0199584960938,
      "text": " his upbringing and all the things that he had to deal with. And I was hated of my brethren"
    },
    {
      "id": 77,
      "start": 2301.0199584960938,
      "end": 2307.739959716797,
      "text": " and I was this and I was that and so on and so forth. But Joseph, he wasn't going to let"
    },
    {
      "id": 78,
      "start": 2307.739959716797,
      "end": 2316.219970703125,
      "text": " his past define him. He was going to serve God. He was a man that did not have the whole"
    },
    {
      "id": 79,
      "start": 2316.219970703125,
      "end": 2322.8599853515625,
      "text": " Bible as we do, but so many biblical truths that God has given us, we can go back to the"
    },
    {
      "id": 80,
      "start": 2322.8599853515625,
      "end": 2327.6599731445312,
      "text": " life of Joseph and see them in his life. He was a man that set his affection on things"
    },
    {
      "id": 81,
      "start": 2327.6599731445312,
      "end": 2335.97998046875,
      "text": " above. He was a man that saw and knew the presence of God. He was a man that sought"
    },
    {
      "id": 82,
      "start": 2335.97998046875,
      "end": 2343.219970703125,
      "text": " to please the Lord. This evening, we see his childhood. We learn some things about what"
    },
    {
      "id": 83,
      "start": 2343.219970703125,
      "end": 2351.1799926757812,
      "text": " he dealt with, but I see his character. Character is important in a man. Character is important."
    },
    {
      "id": 84,
      "start": 2351.1799926757812,
      "end": 2360.1399536132812,
      "text": " Hard working. Not given place to the flesh. Having a moral compass and standing for what"
    },
    {
      "id": 85,
      "start": 2360.1399536132812,
      "end": 2367.0199584960938,
      "text": " is right. This evening, I hope that God would help us to have the kind of character in our"
    },
    {
      "id": 86,
      "start": 2367.0199584960938,
      "end": 2372.6599731445312,
      "text": " lives that Joseph had in his life. Let's pray together. Father, we love you. We thank you"
    },
    {
      "id": 87,
      "start": 2372.6599731445312,
      "end": 2378.8599853515625,
      "text": " for loving us. We thank you for the introduction of the life of Joseph and as we look at these"
    },
    {
      "id": 88,
      "start": 2378.8599853515625,
      "end": 2391.97998046875,
      "text": " few verses of Scripture, God, I pray that you'd help us to be individuals of character."
    },
    {
      "id": 89,
      "start": 2391.97998046875,
      "end": 2397.7799682617188,
      "text": " God that we would allow your word to have an impact and influence in our lives. We'd"
    },
    {
      "id": 90,
      "start": 2397.7799682617188,
      "end": 2400.8999633789062,
      "text": " have an encounter with you that we would daily enter into."
    },
    {
      "id": 0,
      "start": 2400.8999633789062,
      "end": 2408.039963245392,
      "text": " your presence. God, I pray that even as we have the entirety of your word, we have the"
    },
    {
      "id": 1,
      "start": 2408.039963245392,
      "end": 2414.1799631118774,
      "text": " instruction there in Ephesians 6 with putting on the whole armor of God, you'd help us"
    },
    {
      "id": 2,
      "start": 2414.1799631118774,
      "end": 2419.5199642181396,
      "text": " to stand, to stand for truth, to stand for right, to stand against the wiles of the devil,"
    },
    {
      "id": 3,
      "start": 2419.5199642181396,
      "end": 2431.9599628448486,
      "text": " the enemy. Lord, in this society in which we're living, where evil is called good, good"
    },
    {
      "id": 4,
      "start": 2431.9599628448486,
      "end": 2447.359962463379,
      "text": " is called evil, wickedness is celebrated. Wickedness is not just allowed or tolerated,"
    },
    {
      "id": 5,
      "start": 2447.359962463379,
      "end": 2458.7199630737305,
      "text": " it is celebrated. God, I pray that you'd help us to stand for truth. Help us, God, to be"
    },
    {
      "id": 6,
      "start": 2458.7199630737305,
      "end": 2473.359962463379,
      "text": " beacons and lights. Help us to remember that the light shines. God, help us to remember"
    },
    {
      "id": 7,
      "start": 2473.359962463379,
      "end": 2479.3199615478516,
      "text": " that if our gospel be hid, it is hid to them that are lost. I pray, God, that you'd give"
    },
    {
      "id": 8,
      "start": 2479.3199615478516,
      "end": 2487.859962463379,
      "text": " us this kind of character. Bless now as we have an opportunity for responding, a time"
    },
    {
      "id": 9,
      "start": 2487.859962463379,
      "end": 2494.1599655151367,
      "text": " of invitation. Lord, I pray that you'd have your will and way, work in hearts and lives."
    },
    {
      "id": 10,
      "start": 2494.1599655151367,
      "end": 2497.479965209961,
      "text": " I pray that you'd be glorified through every decision. For it's in Christ's name we pray."
    },
    {
      "id": 11,
      "start": 2497.479965209961,
      "end": 2498.87996673584,
      "text": " Would you stand with me, heads are bowed, eyes are closed."
    }
  ],
  "processed_at": "2025-04-16T08:37:15.146739"
}