{
  "video_id": "OL3xd5kHCD0",
  "text": "And all the way in the back of your Bible, just before the book of Revelation, and it's just a short chapter, but honestly, if you're to read through these 25 verses of this short letter, you could do it in just a matter of minutes, but the truth that is contained in this book is powerful and so important that we just understand the importance of all of God's Word. We're going to go near the end of this particular letter and look at verses 22 and 23 this evening. As you see there in your bulletin, the title comes from verse number 23, but look at these two verses here, Jude says in verse 22, and of some have compassion making a difference, and others save with fear, pulling them out of the fire, hating even the garment spotted by the flesh. I've titled the message, Pulling Them Out of the Fire. There are many hymns that we sing, of course, that remind us of the importance of preaching the gospel, and what a blessing to think about those hymns. We mentioned a couple of them this morning as we looked at that portion of scripture, the power of the gospel, and I mentioned to you this morning that I would be reading a couple of passages that are written from some individuals, some hymn stories, if you will, and this first one is with the familiar hymn. It's in our songbooks, number 671, Rescue the Perishing, and what a great song that is, rescue the perishing, care for the dying, Jesus is merciful, aren't you thankful for the mercy of our Lord, and we find that this particular hymn story comes from barryhymns.com, and he says this, in days when reaching the lost seemed to be more of a priority for most believers, many hymn writers and evangelists would use the sea to illustrate the sin in which the lost were drowning. I read that first statement to you this morning, and I wonder when it is and why it is that we have not placed as much of a priority on reaching the lost with the gospel, and you see that he makes that statement that in days when, days gone by when reaching the lost seemed to be more of a priority for most believers. He says this, they would then refer to things such as lighthouses and lifelines as the gospel which was needed to rescue drowning mankind. Such was the case with the prolific blind hymn writer, Fanny Crosby. We know much about Fanny Crosby, and she penned the words to this particular song, Rescue the Perishing. Of course, there are times in which we sing some of the hymns and we don't know the story behind the hymn, and this particular account is given from an individual that had firsthand knowledge that he received directly from Fanny Crosby with regard to the words of this great hymn. It was written in the year 1869 when I was 49 years old. Many of my hymns were written after experiences in New York Mission work. This one was thus written, I was addressing a large company of working men one hot summer evening when the thought kept forcing itself on my mind that some mother's boy must be rescued that night or not at all. So I made a pressing plea that if there was a boy present who had wandered from his mother's home and teaching, he would come to me at the close of the service. A young man of 18 years came forward and said, did you mean me? I promised my mother to meet her in heaven, but as I'm now living, that will be impossible. We prayed for him and he finally arose with a new light in his eyes and exclaimed in triumph, now I can meet my mother in heaven for I have found God. A few days before, Mr. Doan, the musical composer, had sent me the subject, Rescue the Perishing. While I sat there that evening, that line came to me, rescue the perishing, care for the dying. I could think of nothing else that night. When I arrived home, I went to work on the hymn at once. Before I retired, it was ready for the melody. The next day, my song was written out and forwarded to Mr. Doan, who wrote the beautiful and touching music as it now stands to my hymn. In November of 1903, I went to Lynn, Massachusetts to speak before the Young Men's Christian Association. I told them the incident that led to me writing Rescue the Perishing as I have just related it. After the meeting, a large number of men shook hands with me, and among them was a man who seemed to be deeply moved. You may imagine my surprise when he said, Ms. Crosby, I was the boy who told you more than 35 years ago that I had wandered from my mother's God. The evening that you spoke at the mission, I saw and found peace, and I have tried to live a consistent Christian life ever since. If we never meet again on earth, we will meet up yonder, he said to her. He raised my hand to his lips, and before I had recovered from my surprise, he had gone and remains to this day a nameless friend who touched a deep chord of sympathy in my heart. Times have changed, but mankind is still drowning in the sea of sin. The gospel has not changed, and it can still rescue and save mankind. Those who are drowning are headed for spiritual death. It must still be our desire and goal to share the gospel, which alone can rescue them. May we do our part to rescue the perishing with a renewed spirit and fervor. Another song that might not be as familiar, we do not sing it as often. It's number 669 in our hymnal, Throw Out the Lifeline. Throw out the lifeline. And this particular song, which points out that the gospel message should motivate us to help others by seeking and saving the lost, throw out the lifeline. This individual, Ufford, who wrote this particular hymn, he would visit Nantucket Beach, a particularly dangerous coastal area where many ships had been destroyed on the rocks. He was a Baptist preacher, and it is said that the local life-saving station at Point Allerton had a Lyle gun, and that Lyle gun would be used to shoot out a lifeline to ships that were in need. It was in 1886, while they were watching a life-saving drill and could see some of the previous wrecks, a friend of his recounted a scene, which was also reported in the Boston Globe, where a schooner was being tossed in a storm, which threatened to smash it. The lifeline was shot out several times, but fell short until finally it reached the vessel and enabled the men to haul the ship in. The title, Throw Out the Lifeline, stuck in Ufford's mind, so he went home, took out a pencil, and had the words in ten minutes. The song emphasized, of course, the importance of sharing the gospel, and I'm not going to take the time to read both of these particular hymns, but you can read them, you can look them up and find them quite easily. But I think about this, and this particular hymn story comes from hymnstudiesblog.com, and the author of this particular background of this hymn, Throw Out the Lifeline, concludes by saying this, if we were to see a person drowning in the sea, we would try to do something about it. I mean, it's pretty easy for us to relate to that and understand what this particular writer is saying. He then uses the analogy that if we were to see a person trapped in a burning building, we would try to do something about it. What is it? It's our compassion for fellow human beings that would motivate us to help them in some way or another. How much more important is a person's spiritual condition than his physical life? Therefore, when we see a person lost in sin, our compassion for his soul should motivate us to throw out the lifeline. You think about these two hymns, and of course we could mention a number of others this evening, but there are many hymns that we sing about send the light, about I love to tell the story, I mentioned that at the conclusion of the message this morning, and many others that we could note. But as we think about the responsibility that we have in really entering into our missions conference, and it starts on Saturday, and being in prayer for those that would be with us, I want us to focus, as we will be challenged no doubt during our missions conference, on how it is that we can have some part in reaching the world with the gospel. I'm so thankful for the privilege that is ours to give to missions. I'm thankful that God has called laborers and sent forth laborers to go into the mission field and to go and take the gospel, and what a unique privilege is ours to be engaged in and involved in helping them, assisting them complete that task that God has assigned them to. But the reality, as I've said often throughout the years, is that there is no light on our map, there is no picture on our map of Fellowship Baptist Church in Oakton, Virginia. Because we are the light. We are the ones that are responsible for reaching this region with the gospel of Jesus Christ. We find that God Almighty has divinely placed us here for such a time as this. I believe that. And it's a unique opportunity that we have, as we think about these verses of Scripture in the book of Jude, we find that He says, have compassion, making a difference. We're mindful of the compassion of our Lord and Savior, Jesus Christ, and even as he walked upon this earth during his earthly ministry, many times the scriptures would tell us that he was moved with compassion upon them or on them, and we find that that would result in some action being taken. We looked on Wednesday evening, this past Wednesday night, before we got to Acts 13, we examined Matthew 9 when the Bible says that Jesus, when he saw the multitudes, he was moved with compassion on them, and then of course he said that we're to pray to the Lord of the harvest that he would send forth laborers into his harvest. Why? Because he said that the harvest is plenteous, but the laborers, they are few, and no doubt we, as we would exercise a measure of compassion upon individuals, that we can make a difference in people's lives. Someone said, and I believe there's great truth to the statement, that people don't care how much you know until they know how much you care. I believe that that truth is best illustrated through the life and ministry of the Apostle Paul to the believers in Thessalonica. We find that as he would come to that city in Thessalonica, and then he would later write to them in the book of 1 Thessalonians, he makes specific statement with regard to his care for them, and he likens it to the care of a mother. He says, where we were gentle among you, even as a nurse cherisheth her children. And I find that this evening it is important that we would be compassionate, that we'd understand that man is blinded by the enemy, and that we too were once in that same condition. Amen? Of some have compassion making a difference. And we notice in verse number 23, and others save with fear pulling them out of the fire, hating even the garment spotted by the flesh. As I think about verse number 23, and I think about that phrase pulling them out of the fire, and I am mindful of that last hymn story that I read to you of throw out the lifeline, and just the the illustration of what was done, and how that particular man observed the drill taking place, and that Lyle gun that would shoot that lifeline out to those people that were stranded. When we were not long ago, we're there in the Outer Banks, we had the opportunity to see some of those life-saving stations, not only those, but of course the lighthouses, and I chatted with an individual that had a just a vast amount of knowledge about life there, and he was a little older and had lived there for a long time, and began sharing some things with me about these life-saving stations. And basically, as they would sit upon the shore, and they would see a ship that was just being tossed to and fro, and definitely coming to a place of shipwreck, that the only hope, he said, those people are going to die. And the only hope was to send out that lifeline from that Lyle gun, and that it would reach far enough so that some could be rescued. He said that they would practice, and they would go through this process, and they would seek to be as proficient as possible in getting that lifeline out. And the reality is that in some cases, it was not a safe thing for them to try to travel to the particular area of the wreckage, and if the particular sailors would stay with the wreckage, it was definite that they would die. And if that line would get there, they would tie it off, and they'd have to hand over hand make themselves safe, or bring themselves to safety, back to shore. And begin to think about this verse of Scripture pulling them out of fire, and just thinking about the reality of having the gospel, and being able to share the gospel with those that we come into contact with. And really just two simple thoughts this evening. Number one, the reality of eternity. I mentioned this briefly this morning, but when we understood the perspective of the Apostle Paul, and how that was born out of his understanding as to what was at stake, and that is the reality of eternity. Man is going to die, the Bible says, as it appointed unto man, once to die, and after this the judgment. And we find that each individual that we come into contact with, one day they are going to stand before God Almighty. It's just a certainty of the Bible. It's the reality of eternity. And as we would think about the reality of eternity, and we think about those judgments that God gives to us in His Word, we find that there's the bema seat of Christ, the judgment seat of Christ. And that's the judgment that if you've trusted Christ as your Savior, you'll stand there at that judgment. We'll give an account, and I'm thankful that the other judgment that is mentioned is the great white throne judgment. But I, because of being saved, and you, if you've trusted Christ as your Savior, we do not have to stand before God Almighty at the great white throne judgment. And for that I'm thankful. I'm thankful that the wrath of God Almighty was poured upon the Lord Jesus Christ on the cross of Calvary, and that He paid for my sin. And I don't have to stand at that great white throne judgment, but the reality is that every person that we meet is going to stand before God. They're going to stand before God, at either the judgment seat of Christ, or the great white throne. I would say this, that most of the individuals that we come into contact with are going to stand before God at the great white throne. They're going to stand before God at the great white throne. The books are going to be opened. The Bible says that death and hell were cast in the lake of fire. This is the second death. Prior to that, in Revelation 20, and that's verse 15, and prior to that, the Bible speaks about those that are redeemed, in which the second death has no power over us. I'm so thankful for that. But this evening, this thing of eternity is real. As we think about the reality of eternity, I think about the responsibility to evangelize, and how we must get involved, if you're taking notes number two, the responsibility to evangelize, we must get involved personally in reaching souls with the gospel. As we would begin to think about the responsibility that we have as individuals, and we begin to think about even as we preached last Sunday night about being the light, and let your light shine, and you're the light of the world, and what a blessing to understand the responsibility that we have. But we'd understand even as we study throughout the Word of God, and look at the the missionary journeys, and look at the particular churches that were established, you will find that from those local churches, those individuals went out and shared the gospel. I mentioned earlier about the church in Thessalonica, and what Paul commented with regard to his practice there, and the way in which he cared for those individuals, but you'll be mindful in the first chapter of the book of 1st Thessalonians, that the Word of God tells us that Paul really is commending them, in 1st Thessalonians 1 and verse 8, and he says, \"...from you sounded out the word of the Lord, not only in Macedonia and Achaia, but also in every place your faith to God were to spread abroad, so that we need not to speak to anything.\" And so what is he saying? He's saying from this church in Thessalonica, they understood their responsibility to evangelize. We studied this morning in Romans chapter number 1, and what great truth Paul gives us with regard to his own personal understanding, but you understand that the Bible says in verse number 8 of Romans 1, \"...first I thank my God through Jesus Christ for you all that your faith is spoken of throughout the whole world.\" We find that there are individuals that understand this responsibility, and we must get involved personally. It's a blessing to me when I have the opportunity, and I know we live in a very populated area, and so it's not very often that we bump into the same person in the same week. It's just so many people in our area, and I've spoken to some pastors that pastor in much smaller areas, and in fact, I spoke to a man on Tuesday at a pastor's meeting, and I asked him how many were in the place where he was ministering. I never even heard of the place here in Virginia where he's a pastor, and I said, I'm sorry, I've never heard of it. Where is it? You know, how many people are there? He said, well, in our entire county, there's about 5,000 people. I said, I think there were that many at Walmart yesterday. That's how I felt anyway, man. But the reality is that there are some places like that where the likelihood of coming into contact with the same person the same week is higher than it would be here. But there have been times over these last almost 10 years that I have taken out a gospel tract, and I've sought to give it to an individual, and they've said, I just got one of those from someone. And I find that someone from within our church gave them a gospel tract and invited them to read the truth of the gospel, and it encourages me. It's a blessing to me when we have the privilege of seeing that. I had someone call me from Office Depot a few years ago, and they said, hey, I just want to let you know that someone was in here and they gave me a gospel tract, and I just appreciate that there's a church that has a pastor that cares enough about reaching... people that not only does he encourage people to do it, but he supplies gospel tracts. That's what the person said to me on the phone. Now I thought they were going to complain about the fact that somebody had left a gospel tract at Office Depot, so I was getting all prepared for the conversation of, you know, you're not allowed to be bringing this stuff in and all this sort of thing, but then they thanked me, and it was refreshing, it was encouraging, and I was rejoicing at the end of that conversation. But what it is is that each individual has to understand that we have a responsibility personally to reach individuals with the gospel. And I want you to think about really three portions of Scripture this evening, and we're going to go back to 2 Kings chapter number 7 with this thought of our responsibility, pulling them out of the fire. I want you to go back to 2 Kings 7, we're going to look at a passage there, we're going to go to the book of Proverbs and then conclude in Acts chapter number 20, but I want you to look at 2 Kings chapter number 7, and just even as I stated that passage of Scripture, perhaps someone was already mindful of what takes place here in this particular passage. You find that it's here that Elisha makes that declaration with regard to all that was taking place with their lack of food and supply being taken care of, and that servant responds about even if the Lord would make windows in heaven, might this thing be, and so on and so forth. But we find that God is going to work and God is going to provide, but within the story there's another story, and it's the story of these leprous men. And in 2 Kings 7, the Bible says in verse 3, and there were four leprous men at the entering into the gate, and they said one to another, why sit we here until we die? So they go through this process of if we stay here we're going to die, if we stay here we're going to die, we don't have any food, and we're leprous, and if we go to the Syrians there's a possibility that we would have the opportunity to have grace in their eyes and we might live, and so on and so forth, and so they make the decision to go, and without them knowing, the Lord, according to verse number 6, had made the host of the Syrians to hear a noise of chariots and a noise of horses, even the noise of a great host, and they said one to another, lo, the king of Israel hath hired against us the king of the Hittites and the kings of the Egyptians to come upon us, wherefore they, that's the Syrians, they arose and fled in the twilight, they left their tents, their horses, their asses, even the camp as it was, and fled for their life. The same time that that's happening, these four leprous men are saying, hey, let's, you know, what's the point of staying here, let's go. Verse 8, and when these lepers came to the uttermost part of the camp, they went into one tent and did eat and drink and carried then silver and gold and raiment and went and hid it, and came again and entered into another tent and carried then also and went and hid it. They find great spoil. I mean, can you imagine? These four leprous men, they go to the place, the camp of the Syrians and they find that there's no one there, but all of the supplies are there. I mean, everything, they left it all. And they said, man, this is great, but I want you to notice what they say in verse number 9, then they said one to another, we do not well. Why was it that they reached this conclusion? We do not well, why? This day is a day of good tidings, and we hold our peace. If we tarry till the morning light, some mischief will come upon us. Now therefore come that we may go and tell the king's household. They said we do not well. See, they came upon a great amount of spoil. There were people that were dying of hunger. And they had found great substance. And they went into one tent, the Bible tells us in verse number 8, and they ate, they drank, they carried then silver and gold raiment, went and hid it, and then they came into another tent. There's only so much that these four men could eat and drink of themselves, there's only so much that they could hide. And they go into that next tent and together they say, we do not well. We do not well, why? This day is a day of good tidings, and notice, we hold our peace. We need to go back, and we need to go, notice where it says that we may go and tell the king's household. Now here's the amazing thing. They couldn't make anyone of the nation of Israel go to find the spoil. All they could do is go and tell them as to what they found, right? They couldn't make them go. In fact, the Bible tells us in verse number 10, so they came and called unto the porter of the city, and they told them, saying, We came to the camp of the Syrians, and, behold, there was no man there, neither voice of man, but horses tied and asses tied in the tents as they were. And he called the porters, and they told it to the king's house within. Notice what the king says in verse number 12. He arose in the night and said unto the servants, I will now show you what the Syrians have done to us. They know that we be hungry, therefore are they gone out of the camp to hide themselves in the field, saying, When they come out of the city, we shall catch them alive and get into the city. What's he doing? He's objecting to going to where the food is. Oh, they've set up a trap. I mean, they're going to, they've hid themselves. They know that we're hungry, and we come, and they've lured us in, and then they're going to come and conquer us. Well, you can believe what you want, but we just went into the tents, and we got food. Right? I mean, can you see these four leprous men? And as I look at this passage of Scripture, if I could draw an application to sharing the gospel, we have found the light. We have found the truth. And if our gospel be hid, Paul said as I mentioned this morning, it is hid to them that are lost, I would say this evening, then in a much more important fashion, even as the writer said of that last hymn that I read, that hymn story, if we found somebody that was drowning, if we found somebody in a burning building, but how much more important when we think about the souls of mankind, and I would say to you this evening that if we have found the truth, and we are not sharing it, we do not well. Period. End of story. We do not well. Why? Because we know the truth, and we know the Savior, and we know what He offers. They, these lepers, all they could do is go and tell. They couldn't make anyone come to any tent of Assyrian. That's all they could do is go and tell. And you know what? All the Lord requires of us is to go and tell. To go and tell. He gives us the truth, and then He entrusts us with that truth to go and tell others. I can't force anyone to be saved, and neither can you. But oh, that we would go and tell them. That we would make it known that we would not hold our peace. If you look at the remainder of this passage, and we're going to move on, but you find that they find it just as the four lepers said the people went out and spoiled the tents according to verse number 16, so that a measure of fine flour was sold for a shekel, and two measures of barley for a shekel, according to the word of the Lord, just as Elisha had prophesied in verse number 1. And I understand the physical aspect of this particular account, but I draw the spiritual application for us this evening. We do not well if we hold our peace. We need to go and tell. This is what's over in the book of Proverbs, if you will, in Proverbs chapter number 24. I believe in these couple of verses of Scripture in Proverbs 24, that there's an obvious application for us in these verses with regard to sharing the gospel. The Bible says in Proverbs 24, verse number 11, If thou forbear to deliver them that are drawn unto death, and those that are ready to be slain, if thou sayest, Behold, we knew it not, doth not he that pondereth the heart consider it? And he that keepeth thy soul, doth not he know it? And shall not he render to every man according to his works? I believe that there's a spiritual application here as well, just as there was in 2 Kings 7, that we'd understand this word forbear is used in verse number 11, if thou forbear to deliver them that are drawn unto death, it means to procrastinate or to refrain. And we understand that this evening, that it's easier for us to make excuses than for us to just do what we're supposed to do. Because notice what he says in verse number 12, if thou sayest, Behold, we knew it not. It's easy for us to make excuses, it really is. It's easy for me to make excuses. I sat in my office this afternoon, in fact, Holly and I have had a couple of conversations about this very thing in recent weeks, and this afternoon I read the first part of that hymn story about rescue the perishing, about the priority that it was at some point in days gone by amongst believers to reach the lost with the gospel. And I said to Holly as I was sitting at my desk, and she was sitting at the conference room table, I said, when and why did it stop becoming a priority? Is that not what I said to you this afternoon? It seems as if we've gotten so busy with so many other things. and there's so many other things going on in our world, and there's so many things vying for our attention that as preachers in days gone by used to make this statement over and over, keep the main thing the main thing. What they would refer to in saying that is the responsibility of sharing the Gospel with individuals that we come into contact with. This world is not my home. We sing that, don't we? We read about the patriarchs and those in Hebrews 11 that were strangers and pilgrims, and we speak about this world not being our home, but the reality is that there are some times in which we spend more time acting as if this is our forever home than heaven being our forever home. Who are we taking with us? Who am I taking with me? Who am I giving the Gospel to? Who are you giving the Gospel to? I'm not this evening, the Lord has worked on me longer than He's worked on you because I've been preparing these messages. And then I get to deliver them and get worked on again. I'm convicted, personally, about the need to prioritize once again reaching people with the Gospel. It's easy to make excuses. They don't want to hear. They're not interested. They're too busy. Did you see what they look like? They're going to bite my head off. We just make excuses. But the reality is that we need to go and tell if we forbear to deliver them that are drawn unto death. We know the end of all man and we know that there is an opportunity for us. I want you to consider finally this evening what Paul said in Acts 20. We referenced a few of these verses in Acts 20 this morning, but we skipped over these purposefully because I was going to be using them this evening. But as he's speaking here to these church leaders in Ephesus, I want you to notice what he says in v. 26-27. In v. 26-27, Paul says this, Wherefore I take you to record this day, that I am pure from the blood of all men. For I have not shunned to declare unto you all the counsel of God. That word shunned means to be timid or to draw back. It would be used to refer to those who because of timidity hesitate to avow what they believe. That they would be unwilling to utter truth due to fear. And Paul says, I have not shunned to declare unto you all the counsel of God. I notice in v. 26, and we don't have time this evening to develop the entirety of the thought, but Paul, of course, because of his background in studying at the feet of Gamaliel and all that he was with regard to his Jewish studies prior to his conversion, when he makes that statement, Wherefore I take you to record this day, that I am pure from the blood of all men, I would challenge you to go back to the book of Ezekiel and read v. 3 and v. 33 and see the way in which the Lord said to Ezekiel, Son of man, I have set thee to be a watchman. And he says if you do your job and you warn them, regardless of what their response is, you're free from their blood. But, if I've made you a watchman and you fail to warn them, then you're accountable for not telling them. Man, that's serious. And Paul, he had a deep knowledge of the Old Testament. And for him to say under the inspiration of the Holy Spirit of God in v. 26, that I am pure from the blood of all men. I can't help but see the connection from this statement to that truth in the book of Ezekiel. And I wonder this evening, as we think about this reality of eternity, but then the responsibility to evangelize, I wonder, to some, we need to have compassion making a difference. Others, with fear, pulling them out of the fire. Hating even the garments that are spotted by the world. And I wonder tonight, who is it that maybe we're working with? Who is it that we're praying for? Who is it that we're setting up opportunities to be able to share truth with? There's someone that I have been seeking to share the Gospel with, and something came up today, and I sent him a note. It was just one of those opportunities. Hey, here's something, and try to keep something going and give more truth. There's an app, and some of you don't have smart phones and you're saying, I don't want any app. I don't need any apps. I understand. I normally don't recommend a whole lot of things in that nature, but there's an app that I would encourage you to jot down if you have a smart phone. It's called Commission App. It's an app that was developed, I guess, for lack of better terms. It was probably developed by someone else, but its purpose was used by Lancaster Baptist Church, West Coast Baptist College out in California. And in that particular app, there are opportunities for you to go in there, and I have the app downloaded on my phone, and if you go into that particular app, it opens up and it gives you how to explain salvation, how to illustrate salvation, and how to explain baptism. You say, well, I've already prepared, as we mentioned this morning with the Apostle Paul, and you're ready and you may not need those helps, but what I really like about this particular app is there's a place where you can put in your prospects, the people that you're working with, the people that God has allowed you to come in contact with and share the gospel with, and you can enter someone within that prospect, and you can put different notes in there and how you're praying for them and what your last contact was with them, and so on and so forth. Why? Because we're serious about this thing of evangelizing, and we're taking a personal responsibility. And this, I believe, is a great tool that we could use. You say, I don't have a smartphone. Get a notebook. Get some index cards. Get something. I had the privilege of sharing the gospel with this person. Now pray for him. Somebody shared a story with me this morning about sharing a gospel tract, not even meeting the individual, but how that they left the gospel tract in a place in which they knew that the individual would receive it, and as the individual picked it up and received it, they stopped and they prayed for that individual. Praise the Lord. The Holy Spirit of God uses the word of God, and that's someone that's saying, I wanna get engaged, involved, personally. I'm so challenged in my own personal walk with the Lord with regard to this thing of missions, and this responsibility that we have to reach people with the gospel. Listen, the enemy wants us to get busy with all kinds of stuff. He really does. But souls are dying. Who will tell them? Amen? Who will tell them? God gives us unique privilege. I think about those four leprous men. We do not well. Why? Because today's a day of good tidings, and we hold our peace. Let us return. Go and tell. Wow, what a great challenge. From an Old Testament account, a situation in Israel, they had been besieged by the Syrians for a long time. It was terrible what was going on, but how we can make application for us with regard to the gospel. Oh, that God would help us to rescue the perishing, to care for the dying, to throw out the lifeline, to go and tell. Let's pray. Father, we love you. We thank you for loving us. We thank you for the opportunity that we've had today to just focus a little bit, a lot, upon our responsibility as your people. God, even as I prayed this morning, we're not looking for emotional responses. We're looking to be changed by the truth of thy Word. Help us to not be timid. Help us to not be fearful. Help us to not forbear. Help us to be able to say, as Paul said, I have not shunned to declare unto you all the counsel of God. Would you help us to have, embrace the responsibility that's been given to us and help us to get involved, engaged personally, whatever level it needs to be, that we just start somewhere, and that today would be a day of new beginnings with regard to this subject of sharing the gospel. Pray that you'd work in this time of invitation, and we'll thank you for it. In Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.960000038146973,
      "text": " And all the way in the back of your Bible, just before the book of Revelation, and it's"
    },
    {
      "id": 1,
      "start": 4.960000038146973,
      "end": 12.079999923706055,
      "text": " just a short chapter, but honestly, if you're to read through these 25 verses of this short"
    },
    {
      "id": 2,
      "start": 12.079999923706055,
      "end": 18.31999969482422,
      "text": " letter, you could do it in just a matter of minutes, but the truth that is contained in"
    },
    {
      "id": 3,
      "start": 18.31999969482422,
      "end": 26.31999969482422,
      "text": " this book is powerful and so important that we just understand the importance of all of"
    },
    {
      "id": 4,
      "start": 26.31999969482422,
      "end": 27.520000457763672,
      "text": " God's Word."
    },
    {
      "id": 5,
      "start": 27.520000457763672,
      "end": 33.65999984741211,
      "text": " We're going to go near the end of this particular letter and look at verses 22 and 23 this evening."
    },
    {
      "id": 6,
      "start": 33.65999984741211,
      "end": 38.29999923706055,
      "text": " As you see there in your bulletin, the title comes from verse number 23, but look at these"
    },
    {
      "id": 7,
      "start": 38.29999923706055,
      "end": 48.02000045776367,
      "text": " two verses here, Jude says in verse 22, and of some have compassion making a difference,"
    },
    {
      "id": 8,
      "start": 48.02000045776367,
      "end": 58.29999923706055,
      "text": " and others save with fear, pulling them out of the fire, hating even the garment spotted"
    },
    {
      "id": 9,
      "start": 58.29999923706055,
      "end": 59.29999923706055,
      "text": " by the flesh."
    },
    {
      "id": 10,
      "start": 59.29999923706055,
      "end": 64.13999938964844,
      "text": " I've titled the message, Pulling Them Out of the Fire."
    },
    {
      "id": 11,
      "start": 64.13999938964844,
      "end": 69.69999694824219,
      "text": " There are many hymns that we sing, of course, that remind us of the importance of preaching"
    },
    {
      "id": 12,
      "start": 69.69999694824219,
      "end": 74.0199966430664,
      "text": " the gospel, and what a blessing to think about those hymns."
    },
    {
      "id": 13,
      "start": 74.0199966430664,
      "end": 78.0199966430664,
      "text": " We mentioned a couple of them this morning as we looked at that portion of scripture,"
    },
    {
      "id": 14,
      "start": 78.0199966430664,
      "end": 82.0999984741211,
      "text": " the power of the gospel, and I mentioned to you this morning that I would be reading a"
    },
    {
      "id": 15,
      "start": 82.0999984741211,
      "end": 88.30000305175781,
      "text": " couple of passages that are written from some individuals, some hymn stories, if you will,"
    },
    {
      "id": 16,
      "start": 88.30000305175781,
      "end": 90.94000244140625,
      "text": " and this first one is with the familiar hymn."
    },
    {
      "id": 17,
      "start": 90.94000244140625,
      "end": 97.62000274658203,
      "text": " It's in our songbooks, number 671, Rescue the Perishing, and what a great song that"
    },
    {
      "id": 18,
      "start": 97.62000274658203,
      "end": 102.94000244140625,
      "text": " is, rescue the perishing, care for the dying, Jesus is merciful, aren't you thankful for"
    },
    {
      "id": 19,
      "start": 102.94000244140625,
      "end": 111.22000122070312,
      "text": " the mercy of our Lord, and we find that this particular hymn story comes from barryhymns.com,"
    },
    {
      "id": 20,
      "start": 111.22000122070312,
      "end": 116.77999877929688,
      "text": " and he says this, in days when reaching the lost seemed to be more of a priority for most"
    },
    {
      "id": 21,
      "start": 116.77999877929688,
      "end": 123.69999694824219,
      "text": " believers, many hymn writers and evangelists would use the sea to illustrate the sin in"
    },
    {
      "id": 22,
      "start": 123.69999694824219,
      "end": 125.62000274658203,
      "text": " which the lost were drowning."
    },
    {
      "id": 23,
      "start": 125.62000274658203,
      "end": 133.89999389648438,
      "text": " I read that first statement to you this morning, and I wonder when it is and why it is that"
    },
    {
      "id": 24,
      "start": 133.89999389648438,
      "end": 139.97999572753906,
      "text": " we have not placed as much of a priority on reaching the lost with the gospel, and you"
    },
    {
      "id": 25,
      "start": 139.97999572753906,
      "end": 146.17999267578125,
      "text": " see that he makes that statement that in days when, days gone by when reaching the lost"
    },
    {
      "id": 26,
      "start": 146.17999267578125,
      "end": 148.82000732421875,
      "text": " seemed to be more of a priority for most believers."
    },
    {
      "id": 27,
      "start": 148.82000732421875,
      "end": 154.13999938964844,
      "text": " He says this, they would then refer to things such as lighthouses and lifelines as the gospel"
    },
    {
      "id": 28,
      "start": 154.13999938964844,
      "end": 157.8000030517578,
      "text": " which was needed to rescue drowning mankind."
    },
    {
      "id": 29,
      "start": 157.8000030517578,
      "end": 161.5800018310547,
      "text": " Such was the case with the prolific blind hymn writer, Fanny Crosby."
    },
    {
      "id": 30,
      "start": 161.5800018310547,
      "end": 166.66000366210938,
      "text": " We know much about Fanny Crosby, and she penned the words to this particular song, Rescue"
    },
    {
      "id": 31,
      "start": 166.66000366210938,
      "end": 167.89999389648438,
      "text": " the Perishing."
    },
    {
      "id": 32,
      "start": 167.89999389648438,
      "end": 172.02000427246094,
      "text": " Of course, there are times in which we sing some of the hymns and we don't know the story"
    },
    {
      "id": 33,
      "start": 172.02000427246094,
      "end": 180.5800018310547,
      "text": " behind the hymn, and this particular account is given from an individual that had firsthand"
    },
    {
      "id": 34,
      "start": 180.5800018310547,
      "end": 186.3800048828125,
      "text": " knowledge that he received directly from Fanny Crosby with regard to the words of"
    },
    {
      "id": 35,
      "start": 186.3800048828125,
      "end": 187.94000244140625,
      "text": " this great hymn."
    },
    {
      "id": 36,
      "start": 187.94000244140625,
      "end": 191.6999969482422,
      "text": " It was written in the year 1869 when I was 49 years old."
    },
    {
      "id": 37,
      "start": 191.6999969482422,
      "end": 196.22000122070312,
      "text": " Many of my hymns were written after experiences in New York Mission work."
    },
    {
      "id": 38,
      "start": 196.22000122070312,
      "end": 200.86000061035156,
      "text": " This one was thus written, I was addressing a large company of working men one hot summer"
    },
    {
      "id": 39,
      "start": 200.86000061035156,
      "end": 206.86000061035156,
      "text": " evening when the thought kept forcing itself on my mind that some mother's boy must be"
    },
    {
      "id": 40,
      "start": 206.86000061035156,
      "end": 210.4600067138672,
      "text": " rescued that night or not at all."
    },
    {
      "id": 41,
      "start": 210.4600067138672,
      "end": 215.3000030517578,
      "text": " So I made a pressing plea that if there was a boy present who had wandered from his mother's"
    },
    {
      "id": 42,
      "start": 215.3000030517578,
      "end": 219.6199951171875,
      "text": " home and teaching, he would come to me at the close of the service."
    },
    {
      "id": 43,
      "start": 219.6199951171875,
      "end": 226.66000366210938,
      "text": " A young man of 18 years came forward and said, did you mean me?"
    },
    {
      "id": 44,
      "start": 226.66000366210938,
      "end": 233.66000366210938,
      "text": " I promised my mother to meet her in heaven, but as I'm now living, that will be impossible."
    },
    {
      "id": 45,
      "start": 233.66000366210938,
      "end": 239.10000610351562,
      "text": " We prayed for him and he finally arose with a new light in his eyes and exclaimed in triumph,"
    },
    {
      "id": 46,
      "start": 239.10000610351562,
      "end": 245.02000427246094,
      "text": " now I can meet my mother in heaven for I have found God."
    },
    {
      "id": 47,
      "start": 245.02000427246094,
      "end": 252.5800018310547,
      "text": " A few days before, Mr. Doan, the musical composer, had sent me the subject, Rescue the Perishing."
    },
    {
      "id": 48,
      "start": 252.5800018310547,
      "end": 257.7799987792969,
      "text": " While I sat there that evening, that line came to me, rescue the perishing, care for"
    },
    {
      "id": 49,
      "start": 257.7799987792969,
      "end": 258.7799987792969,
      "text": " the dying."
    },
    {
      "id": 50,
      "start": 258.7799987792969,
      "end": 260.5400085449219,
      "text": " I could think of nothing else that night."
    },
    {
      "id": 51,
      "start": 260.5400085449219,
      "end": 263.5799865722656,
      "text": " When I arrived home, I went to work on the hymn at once."
    },
    {
      "id": 52,
      "start": 263.5799865722656,
      "end": 266.2200012207031,
      "text": " Before I retired, it was ready for the melody."
    },
    {
      "id": 53,
      "start": 266.2200012207031,
      "end": 270.4599914550781,
      "text": " The next day, my song was written out and forwarded to Mr. Doan, who wrote the beautiful"
    },
    {
      "id": 54,
      "start": 270.4599914550781,
      "end": 273.0199890136719,
      "text": " and touching music as it now stands to my hymn."
    },
    {
      "id": 55,
      "start": 273.0199890136719,
      "end": 278.3800048828125,
      "text": " In November of 1903, I went to Lynn, Massachusetts to speak before the Young Men's Christian"
    },
    {
      "id": 56,
      "start": 278.3800048828125,
      "end": 279.3800048828125,
      "text": " Association."
    },
    {
      "id": 57,
      "start": 279.3800048828125,
      "end": 284.5,
      "text": " I told them the incident that led to me writing Rescue the Perishing as I have just related"
    },
    {
      "id": 58,
      "start": 284.5,
      "end": 285.5,
      "text": " it."
    },
    {
      "id": 59,
      "start": 285.5,
      "end": 289.5400085449219,
      "text": " After the meeting, a large number of men shook hands with me, and among them was a man who"
    },
    {
      "id": 60,
      "start": 289.5400085449219,
      "end": 291.94000244140625,
      "text": " seemed to be deeply moved."
    },
    {
      "id": 61,
      "start": 291.94000244140625,
      "end": 298.9800109863281,
      "text": " You may imagine my surprise when he said, Ms. Crosby, I was the boy who told you more"
    },
    {
      "id": 62,
      "start": 298.9800109863281,
      "end": 303.8599853515625,
      "text": " than 35 years ago that I had wandered from my mother's God."
    },
    {
      "id": 63,
      "start": 303.8599853515625,
      "end": 307.4599914550781,
      "text": " The evening that you spoke at the mission, I saw and found peace, and I have tried to"
    },
    {
      "id": 64,
      "start": 307.4599914550781,
      "end": 311.67999267578125,
      "text": " live a consistent Christian life ever since."
    },
    {
      "id": 65,
      "start": 311.67999267578125,
      "end": 318.6600036621094,
      "text": " If we never meet again on earth, we will meet up yonder, he said to her."
    },
    {
      "id": 66,
      "start": 318.6600036621094,
      "end": 324.0199890136719,
      "text": " He raised my hand to his lips, and before I had recovered from my surprise, he had gone"
    },
    {
      "id": 67,
      "start": 324.0199890136719,
      "end": 329.5799865722656,
      "text": " and remains to this day a nameless friend who touched a deep chord of sympathy in my"
    },
    {
      "id": 68,
      "start": 329.5799865722656,
      "end": 330.94000244140625,
      "text": " heart."
    },
    {
      "id": 69,
      "start": 330.94000244140625,
      "end": 336.0199890136719,
      "text": " Times have changed, but mankind is still drowning in the sea of sin."
    },
    {
      "id": 70,
      "start": 336.0199890136719,
      "end": 340.1000061035156,
      "text": " The gospel has not changed, and it can still rescue and save mankind."
    },
    {
      "id": 71,
      "start": 340.1000061035156,
      "end": 343.0799865722656,
      "text": " Those who are drowning are headed for spiritual death."
    },
    {
      "id": 72,
      "start": 343.0799865722656,
      "end": 348.260009765625,
      "text": " It must still be our desire and goal to share the gospel, which alone can rescue them."
    },
    {
      "id": 73,
      "start": 348.260009765625,
      "end": 355.739990234375,
      "text": " May we do our part to rescue the perishing with a renewed spirit and fervor."
    },
    {
      "id": 74,
      "start": 355.739990234375,
      "end": 360.8999938964844,
      "text": " Another song that might not be as familiar, we do not sing it as often."
    },
    {
      "id": 75,
      "start": 360.8999938964844,
      "end": 366.29998779296875,
      "text": " It's number 669 in our hymnal, Throw Out the Lifeline."
    },
    {
      "id": 76,
      "start": 366.29998779296875,
      "end": 368.5400085449219,
      "text": " Throw out the lifeline."
    },
    {
      "id": 77,
      "start": 368.5400085449219,
      "end": 373.6199951171875,
      "text": " And this particular song, which points out that the gospel message should motivate us"
    },
    {
      "id": 78,
      "start": 373.6199951171875,
      "end": 377.70001220703125,
      "text": " to help others by seeking and saving the lost, throw out the lifeline."
    },
    {
      "id": 79,
      "start": 377.70001220703125,
      "end": 384.7799987792969,
      "text": " This individual, Ufford, who wrote this particular hymn, he would visit Nantucket Beach, a particularly"
    },
    {
      "id": 80,
      "start": 384.7799987792969,
      "end": 389.0199890136719,
      "text": " dangerous coastal area where many ships had been destroyed on the rocks."
    },
    {
      "id": 81,
      "start": 389.0199890136719,
      "end": 395.0199890136719,
      "text": " He was a Baptist preacher, and it is said that the local life-saving station at Point"
    },
    {
      "id": 82,
      "start": 395.0199890136719,
      "end": 400.6199951171875,
      "text": " Allerton had a Lyle gun, and that Lyle gun would be used to shoot out a lifeline to ships"
    },
    {
      "id": 83,
      "start": 400.6199951171875,
      "end": 401.6199951171875,
      "text": " that were in need."
    },
    {
      "id": 84,
      "start": 401.6199951171875,
      "end": 406.3399963378906,
      "text": " It was in 1886, while they were watching a life-saving drill and could see some of"
    },
    {
      "id": 85,
      "start": 406.3399963378906,
      "end": 411.3399963378906,
      "text": " the previous wrecks, a friend of his recounted a scene, which was also reported in the Boston"
    },
    {
      "id": 86,
      "start": 411.3399963378906,
      "end": 416.5799865722656,
      "text": " Globe, where a schooner was being tossed in a storm, which threatened to smash it."
    },
    {
      "id": 87,
      "start": 416.5799865722656,
      "end": 423.0199890136719,
      "text": " The lifeline was shot out several times, but fell short until finally it reached the vessel"
    },
    {
      "id": 88,
      "start": 423.0199890136719,
      "end": 425.4599914550781,
      "text": " and enabled the men to haul the ship in."
    },
    {
      "id": 89,
      "start": 425.4599914550781,
      "end": 430.4599914550781,
      "text": " The title, Throw Out the Lifeline, stuck in Ufford's mind, so he went home, took out"
    },
    {
      "id": 90,
      "start": 430.4599914550781,
      "end": 435.3999938964844,
      "text": " a pencil, and had the words in ten minutes."
    },
    {
      "id": 91,
      "start": 435.3999938964844,
      "end": 439.29998779296875,
      "text": " The song emphasized, of course, the importance of sharing the gospel, and I'm not going to"
    },
    {
      "id": 92,
      "start": 439.29998779296875,
      "end": 443.5799865722656,
      "text": " take the time to read both of these particular hymns, but you can read them, you can look"
    },
    {
      "id": 93,
      "start": 443.5799865722656,
      "end": 446.2200012207031,
      "text": " them up and find them quite easily."
    },
    {
      "id": 94,
      "start": 446.2200012207031,
      "end": 453.29998779296875,
      "text": " But I think about this, and this particular hymn story comes from hymnstudiesblog.com,"
    },
    {
      "id": 95,
      "start": 453.29998779296875,
      "end": 459.260009765625,
      "text": " and the author of this particular background of this hymn, Throw Out the Lifeline, concludes"
    },
    {
      "id": 96,
      "start": 459.260009765625,
      "end": 465.6199951171875,
      "text": " by saying this, if we were to see a person drowning in the sea, we would try to do something"
    },
    {
      "id": 97,
      "start": 465.6199951171875,
      "end": 466.6199951171875,
      "text": " about it."
    },
    {
      "id": 98,
      "start": 466.6199951171875,
      "end": 471.739990234375,
      "text": " I mean, it's pretty easy for us to relate to that and understand what this particular"
    },
    {
      "id": 99,
      "start": 471.739990234375,
      "end": 473.0799865722656,
      "text": " writer is saying."
    },
    {
      "id": 100,
      "start": 473.0799865722656,
      "end": 478.5799865722656,
      "text": " He then uses the analogy that if we were to see a person trapped in a burning building,"
    },
    {
      "id": 101,
      "start": 478.5799865722656,
      "end": 480.9800109863281,
      "text": " we would try to do something about it."
    },
    {
      "id": 102,
      "start": 480.9800109863281,
      "end": 481.9800109863281,
      "text": " What is it?"
    },
    {
      "id": 103,
      "start": 481.9800109863281,
      "end": 486.0199890136719,
      "text": " It's our compassion for fellow human beings that would motivate us to help them in some"
    },
    {
      "id": 104,
      "start": 486.0199890136719,
      "end": 487.5199890136719,
      "text": " way or another."
    },
    {
      "id": 105,
      "start": 487.5199890136719,
      "end": 493.7200012207031,
      "text": " How much more important is a person's spiritual condition than his physical life?"
    },
    {
      "id": 106,
      "start": 493.7200012207031,
      "end": 500.32000732421875,
      "text": " Therefore, when we see a person lost in sin, our compassion for his soul should motivate"
    },
    {
      "id": 107,
      "start": 500.32000732421875,
      "end": 504.239990234375,
      "text": " us to throw out the lifeline."
    },
    {
      "id": 108,
      "start": 504.239990234375,
      "end": 510.32000732421875,
      "text": " You think about these two hymns, and of course we could mention a number of others this evening,"
    },
    {
      "id": 109,
      "start": 510.32000732421875,
      "end": 517.3599853515625,
      "text": " but there are many hymns that we sing about send the light, about I love to tell the story,"
    },
    {
      "id": 110,
      "start": 518.2000122070312,
      "end": 520.4400024414062,
      "text": " I mentioned that at the conclusion of the message this morning, and many others that"
    },
    {
      "id": 111,
      "start": 520.4400024414062,
      "end": 521.5999755859375,
      "text": " we could note."
    },
    {
      "id": 112,
      "start": 521.5999755859375,
      "end": 525.7999877929688,
      "text": " But as we think about the responsibility that we have in really entering into our missions"
    },
    {
      "id": 113,
      "start": 525.7999877929688,
      "end": 530.6400146484375,
      "text": " conference, and it starts on Saturday, and being in prayer for those that would be with"
    },
    {
      "id": 114,
      "start": 530.6400146484375,
      "end": 536.47998046875,
      "text": " us, I want us to focus, as we will be challenged no doubt during our missions conference, on"
    },
    {
      "id": 115,
      "start": 536.47998046875,
      "end": 541.6400146484375,
      "text": " how it is that we can have some part in reaching the world with the gospel."
    },
    {
      "id": 116,
      "start": 541.6400146484375,
      "end": 545.3200073242188,
      "text": " I'm so thankful for the privilege that is ours to give to missions."
    },
    {
      "id": 117,
      "start": 545.3200073242188,
      "end": 550.719970703125,
      "text": " I'm thankful that God has called laborers and sent forth laborers to go into the mission"
    },
    {
      "id": 118,
      "start": 550.719970703125,
      "end": 557.0800170898438,
      "text": " field and to go and take the gospel, and what a unique privilege is ours to be engaged in"
    },
    {
      "id": 119,
      "start": 557.0800170898438,
      "end": 563.2000122070312,
      "text": " and involved in helping them, assisting them complete that task that God has assigned them"
    },
    {
      "id": 120,
      "start": 563.2000122070312,
      "end": 564.4000244140625,
      "text": " to."
    },
    {
      "id": 121,
      "start": 564.4000244140625,
      "end": 569.760009765625,
      "text": " But the reality, as I've said often throughout the years, is that there is no light on our"
    },
    {
      "id": 122,
      "start": 569.760009765625,
      "end": 576.2000122070312,
      "text": " map, there is no picture on our map of Fellowship Baptist Church in Oakton, Virginia."
    },
    {
      "id": 123,
      "start": 576.2000122070312,
      "end": 577.8599853515625,
      "text": " Because we are the light."
    },
    {
      "id": 124,
      "start": 577.8599853515625,
      "end": 583.4000244140625,
      "text": " We are the ones that are responsible for reaching this region with the gospel of Jesus Christ."
    },
    {
      "id": 125,
      "start": 583.4000244140625,
      "end": 590.8400268554688,
      "text": " We find that God Almighty has divinely placed us here for such a time as this."
    },
    {
      "id": 126,
      "start": 590.8400268554688,
      "end": 592.3200073242188,
      "text": " I believe that."
    },
    {
      "id": 127,
      "start": 592.3200073242188,
      "end": 597.239990234375,
      "text": " And it's a unique opportunity that we have, as we think about these verses of Scripture"
    },
    {
      "id": 128,
      "start": 597.239990234375,
      "end": 599.5999755859375,
      "text": " in the book of Jude, we find that He says,"
    },
    {
      "id": 0,
      "start": 599.5999755859375,
      "end": 604.6399755477905,
      "text": " have compassion, making a difference. We're mindful of the compassion of our"
    },
    {
      "id": 1,
      "start": 604.6399755477905,
      "end": 609.0199756622314,
      "text": " Lord and Savior, Jesus Christ, and even as he walked upon this earth during his"
    },
    {
      "id": 2,
      "start": 609.0199756622314,
      "end": 612.1999759674072,
      "text": " earthly ministry, many times the scriptures would tell us that he was"
    },
    {
      "id": 3,
      "start": 612.1999759674072,
      "end": 617.6399765014648,
      "text": " moved with compassion upon them or on them, and we find that that would result"
    },
    {
      "id": 4,
      "start": 617.6399765014648,
      "end": 622.5399761199951,
      "text": " in some action being taken. We looked on Wednesday evening, this past Wednesday"
    },
    {
      "id": 5,
      "start": 622.5399761199951,
      "end": 627.879976272583,
      "text": " night, before we got to Acts 13, we examined Matthew 9 when the Bible says"
    },
    {
      "id": 6,
      "start": 627.879976272583,
      "end": 632.5199737548828,
      "text": " that Jesus, when he saw the multitudes, he was moved with compassion on them, and"
    },
    {
      "id": 7,
      "start": 632.5199737548828,
      "end": 636.1799774169922,
      "text": " then of course he said that we're to pray to the Lord of the harvest that he"
    },
    {
      "id": 8,
      "start": 636.1799774169922,
      "end": 640.8599739074707,
      "text": " would send forth laborers into his harvest. Why? Because he said that the"
    },
    {
      "id": 9,
      "start": 640.8599739074707,
      "end": 646.9599761962891,
      "text": " harvest is plenteous, but the laborers, they are few, and no doubt we, as we would"
    },
    {
      "id": 10,
      "start": 646.9599761962891,
      "end": 651.7399749755859,
      "text": " exercise a measure of compassion upon individuals, that we can make a"
    },
    {
      "id": 11,
      "start": 651.8799743652344,
      "end": 659.3199768066406,
      "text": " difference in people's lives. Someone said, and I believe there's great truth"
    },
    {
      "id": 12,
      "start": 659.3199768066406,
      "end": 663.7999725341797,
      "text": " to the statement, that people don't care how much you know until they know how"
    },
    {
      "id": 13,
      "start": 663.7999725341797,
      "end": 670.2399749755859,
      "text": " much you care. I believe that that truth is best illustrated through the life and"
    },
    {
      "id": 14,
      "start": 670.2399749755859,
      "end": 675.2399749755859,
      "text": " ministry of the Apostle Paul to the believers in Thessalonica. We find that"
    },
    {
      "id": 15,
      "start": 675.2399749755859,
      "end": 678.5599746704102,
      "text": " as he would come to that city in Thessalonica, and then he would later"
    },
    {
      "id": 16,
      "start": 678.5599746704102,
      "end": 682.7799758911133,
      "text": " write to them in the book of 1 Thessalonians, he makes specific"
    },
    {
      "id": 17,
      "start": 682.7799758911133,
      "end": 688.0399780273438,
      "text": " statement with regard to his care for them, and he likens it to the care of a"
    },
    {
      "id": 18,
      "start": 688.0399780273438,
      "end": 692.5799789428711,
      "text": " mother. He says, where we were gentle among you, even as a nurse cherisheth"
    },
    {
      "id": 19,
      "start": 692.5799789428711,
      "end": 698.1199722290039,
      "text": " her children. And I find that this evening it is important that we would be"
    },
    {
      "id": 20,
      "start": 698.1199722290039,
      "end": 706.5399780273438,
      "text": " compassionate, that we'd understand that man is blinded by the enemy, and that we"
    },
    {
      "id": 21,
      "start": 706.5999755859375,
      "end": 713.4799728393555,
      "text": " too were once in that same condition. Amen? Of some have compassion making a"
    },
    {
      "id": 22,
      "start": 713.4799728393555,
      "end": 722.7999725341797,
      "text": " difference. And we notice in verse number 23, and others save with fear pulling"
    },
    {
      "id": 23,
      "start": 722.7999725341797,
      "end": 729.6399688720703,
      "text": " them out of the fire, hating even the garment spotted by the flesh. As I think"
    },
    {
      "id": 24,
      "start": 729.6399688720703,
      "end": 733.719970703125,
      "text": " about verse number 23, and I think about that phrase pulling them out of the fire,"
    },
    {
      "id": 25,
      "start": 733.719970703125,
      "end": 737.8599700927734,
      "text": " and I am mindful of that last hymn story that I read to you of throw out"
    },
    {
      "id": 26,
      "start": 737.8599700927734,
      "end": 742.8999786376953,
      "text": " the lifeline, and just the the illustration of what was done, and how"
    },
    {
      "id": 27,
      "start": 742.8999786376953,
      "end": 748.2399749755859,
      "text": " that particular man observed the drill taking place, and that Lyle gun that"
    },
    {
      "id": 28,
      "start": 748.2399749755859,
      "end": 755.0199737548828,
      "text": " would shoot that lifeline out to those people that were stranded. When we were"
    },
    {
      "id": 29,
      "start": 755.0199737548828,
      "end": 759.2599792480469,
      "text": " not long ago, we're there in the Outer Banks, we had the opportunity to see some"
    },
    {
      "id": 30,
      "start": 759.2599792480469,
      "end": 764.1599731445312,
      "text": " of those life-saving stations, not only those, but of course the lighthouses, and"
    },
    {
      "id": 31,
      "start": 764.1599731445312,
      "end": 770.5999755859375,
      "text": " I chatted with an individual that had a just a vast amount of knowledge about"
    },
    {
      "id": 32,
      "start": 770.5999755859375,
      "end": 776.5999755859375,
      "text": " life there, and he was a little older and had lived there for a long time, and began"
    },
    {
      "id": 33,
      "start": 776.5999755859375,
      "end": 782.9599761962891,
      "text": " sharing some things with me about these life-saving stations. And basically, as"
    },
    {
      "id": 34,
      "start": 782.9599761962891,
      "end": 788.9599761962891,
      "text": " they would sit upon the shore, and they would see a ship that was just being"
    },
    {
      "id": 35,
      "start": 788.97998046875,
      "end": 794.0199737548828,
      "text": " tossed to and fro, and definitely coming to a place of shipwreck, that the only"
    },
    {
      "id": 36,
      "start": 794.0199737548828,
      "end": 799.4999694824219,
      "text": " hope, he said, those people are going to die. And the only hope was to send out"
    },
    {
      "id": 37,
      "start": 799.4999694824219,
      "end": 804.6599731445312,
      "text": " that lifeline from that Lyle gun, and that it would reach far enough so that"
    },
    {
      "id": 38,
      "start": 804.6599731445312,
      "end": 810.2999725341797,
      "text": " some could be rescued. He said that they would practice, and they would go through"
    },
    {
      "id": 39,
      "start": 810.2999725341797,
      "end": 814.97998046875,
      "text": " this process, and they would seek to be as proficient as possible in getting"
    },
    {
      "id": 40,
      "start": 815.0799713134766,
      "end": 820.5999755859375,
      "text": " that lifeline out. And the reality is that in some cases, it was not a safe"
    },
    {
      "id": 41,
      "start": 820.5999755859375,
      "end": 825.1599731445312,
      "text": " thing for them to try to travel to the particular area of the wreckage, and if"
    },
    {
      "id": 42,
      "start": 825.1599731445312,
      "end": 829.3199768066406,
      "text": " the particular sailors would stay with the wreckage, it was definite"
    },
    {
      "id": 43,
      "start": 829.3199768066406,
      "end": 832.9199829101562,
      "text": " that they would die. And if that line would get there, they would tie it off,"
    },
    {
      "id": 44,
      "start": 832.9199829101562,
      "end": 838.0799713134766,
      "text": " and they'd have to hand over hand make themselves safe, or bring themselves to"
    },
    {
      "id": 45,
      "start": 838.0799713134766,
      "end": 843.8399810791016,
      "text": " safety, back to shore. And begin to think about this verse of Scripture pulling"
    },
    {
      "id": 46,
      "start": 843.8399810791016,
      "end": 849.0199737548828,
      "text": " them out of fire, and just thinking about the reality of having the"
    },
    {
      "id": 47,
      "start": 849.0199737548828,
      "end": 852.4199829101562,
      "text": " gospel, and being able to share the gospel with those that we come into"
    },
    {
      "id": 48,
      "start": 852.4199829101562,
      "end": 856.0799865722656,
      "text": " contact with. And really just two simple thoughts this evening. Number one, the"
    },
    {
      "id": 49,
      "start": 856.0799865722656,
      "end": 860.2599792480469,
      "text": " reality of eternity. I mentioned this briefly this morning, but when we"
    },
    {
      "id": 50,
      "start": 860.2599792480469,
      "end": 865.0199890136719,
      "text": " understood the perspective of the Apostle Paul, and how that was born out"
    },
    {
      "id": 51,
      "start": 865.0199890136719,
      "end": 870.3399658203125,
      "text": " of his understanding as to what was at stake, and that is the reality of"
    },
    {
      "id": 52,
      "start": 870.3399658203125,
      "end": 875.8399658203125,
      "text": " eternity. Man is going to die, the Bible says, as it appointed unto man, once to"
    },
    {
      "id": 53,
      "start": 875.8399658203125,
      "end": 880.3599853515625,
      "text": " die, and after this the judgment. And we find that each individual that we come"
    },
    {
      "id": 54,
      "start": 880.3599853515625,
      "end": 888.0399780273438,
      "text": " into contact with, one day they are going to stand before God Almighty. It's just a"
    },
    {
      "id": 55,
      "start": 888.0399780273438,
      "end": 893.1399841308594,
      "text": " certainty of the Bible. It's the reality of eternity. And as we would think about"
    },
    {
      "id": 56,
      "start": 893.1399841308594,
      "end": 897.7599792480469,
      "text": " the reality of eternity, and we think about those judgments that God gives to"
    },
    {
      "id": 57,
      "start": 897.7599792480469,
      "end": 902.4999694824219,
      "text": " us in His Word, we find that there's the bema seat of Christ, the judgment seat"
    },
    {
      "id": 58,
      "start": 902.4999694824219,
      "end": 906.4999694824219,
      "text": " of Christ. And that's the judgment that if you've trusted Christ as your Savior,"
    },
    {
      "id": 59,
      "start": 906.4999694824219,
      "end": 911.6799621582031,
      "text": " you'll stand there at that judgment. We'll give an account, and I'm thankful"
    },
    {
      "id": 60,
      "start": 911.6799621582031,
      "end": 915.1399841308594,
      "text": " that the other judgment that is mentioned is the great white throne"
    },
    {
      "id": 61,
      "start": 915.1399841308594,
      "end": 921.219970703125,
      "text": " judgment. But I, because of being saved, and you, if you've trusted Christ as your"
    },
    {
      "id": 62,
      "start": 921.219970703125,
      "end": 926.1999816894531,
      "text": " Savior, we do not have to stand before God Almighty at the great white throne"
    },
    {
      "id": 63,
      "start": 926.1999816894531,
      "end": 931.4199829101562,
      "text": " judgment. And for that I'm thankful. I'm thankful that the wrath of God Almighty"
    },
    {
      "id": 64,
      "start": 931.4199829101562,
      "end": 936.3799743652344,
      "text": " was poured upon the Lord Jesus Christ on the cross of Calvary, and that He paid"
    },
    {
      "id": 65,
      "start": 936.3799743652344,
      "end": 942.2799682617188,
      "text": " for my sin. And I don't have to stand at that great white throne judgment, but the"
    },
    {
      "id": 66,
      "start": 942.2799682617188,
      "end": 948.6999816894531,
      "text": " reality is that every person that we meet is going to stand before God. They're"
    },
    {
      "id": 67,
      "start": 948.6999816894531,
      "end": 953.1999816894531,
      "text": " going to stand before God, at either the judgment seat of Christ, or the great"
    },
    {
      "id": 68,
      "start": 953.2599792480469,
      "end": 957.8199768066406,
      "text": " white throne. I would say this, that most of the individuals that we come into"
    },
    {
      "id": 69,
      "start": 957.8199768066406,
      "end": 962.97998046875,
      "text": " contact with are going to stand before God at the great white throne. They're going to"
    },
    {
      "id": 70,
      "start": 962.97998046875,
      "end": 967.4199829101562,
      "text": " stand before God at the great white throne. The books are going to be opened."
    },
    {
      "id": 71,
      "start": 967.4199829101562,
      "end": 972.8199768066406,
      "text": " The Bible says that death and hell were cast in the lake of fire. This is the"
    },
    {
      "id": 72,
      "start": 972.8199768066406,
      "end": 979.1799621582031,
      "text": " second death. Prior to that, in Revelation 20, and that's verse 15, and prior to that,"
    },
    {
      "id": 73,
      "start": 979.1799621582031,
      "end": 982.97998046875,
      "text": " the Bible speaks about those that are redeemed, in which the second death has"
    },
    {
      "id": 74,
      "start": 982.97998046875,
      "end": 990.6199645996094,
      "text": " no power over us. I'm so thankful for that. But this evening, this thing of"
    },
    {
      "id": 75,
      "start": 990.6199645996094,
      "end": 995.219970703125,
      "text": " eternity is real. As we think about the reality of eternity, I think about the"
    },
    {
      "id": 76,
      "start": 995.219970703125,
      "end": 1000.2599792480469,
      "text": " responsibility to evangelize, and how we must get involved, if you're taking notes"
    },
    {
      "id": 77,
      "start": 1000.2599792480469,
      "end": 1002.6199645996094,
      "text": " number two, the responsibility to evangelize, we must get involved"
    },
    {
      "id": 78,
      "start": 1002.6199645996094,
      "end": 1008.2599792480469,
      "text": " personally in reaching souls with the gospel. As we would begin to think about"
    },
    {
      "id": 79,
      "start": 1008.2599792480469,
      "end": 1011.8599853515625,
      "text": " the responsibility that we have as individuals, and we begin to think about"
    },
    {
      "id": 80,
      "start": 1011.9399719238281,
      "end": 1016.4999694824219,
      "text": " even as we preached last Sunday night about being the light, and let your light"
    },
    {
      "id": 81,
      "start": 1016.4999694824219,
      "end": 1020.8999633789062,
      "text": " shine, and you're the light of the world, and what a blessing to understand the"
    },
    {
      "id": 82,
      "start": 1020.8999633789062,
      "end": 1024.0999755859375,
      "text": " responsibility that we have. But we'd understand even as we study throughout"
    },
    {
      "id": 83,
      "start": 1024.0999755859375,
      "end": 1028.4599609375,
      "text": " the Word of God, and look at the the missionary journeys, and look at the"
    },
    {
      "id": 84,
      "start": 1028.4599609375,
      "end": 1031.6599731445312,
      "text": " particular churches that were established, you will find that from"
    },
    {
      "id": 85,
      "start": 1031.6599731445312,
      "end": 1037.0599670410156,
      "text": " those local churches, those individuals went out and shared the gospel. I"
    },
    {
      "id": 86,
      "start": 1037.0999755859375,
      "end": 1042.219970703125,
      "text": " mentioned earlier about the church in Thessalonica, and what Paul commented"
    },
    {
      "id": 87,
      "start": 1042.219970703125,
      "end": 1045.8999633789062,
      "text": " with regard to his practice there, and the way in which he cared for those"
    },
    {
      "id": 88,
      "start": 1045.8999633789062,
      "end": 1049.0999755859375,
      "text": " individuals, but you'll be mindful in the first chapter of the book of 1st"
    },
    {
      "id": 89,
      "start": 1049.0999755859375,
      "end": 1054.8199768066406,
      "text": " Thessalonians, that the Word of God tells us that Paul really is commending them,"
    },
    {
      "id": 90,
      "start": 1054.8199768066406,
      "end": 1057.3799743652344,
      "text": " in 1st Thessalonians 1 and verse 8, and he says,"
    },
    {
      "id": 91,
      "start": 1057.3799743652344,
      "end": 1062.1399841308594,
      "text": " \"...from you sounded out the word of the Lord, not only in Macedonia and Achaia, but"
    },
    {
      "id": 92,
      "start": 1062.1399841308594,
      "end": 1066.3399658203125,
      "text": " also in every place your faith to God were to spread abroad, so that we need"
    },
    {
      "id": 93,
      "start": 1066.3399658203125,
      "end": 1071.219970703125,
      "text": " not to speak to anything.\" And so what is he saying? He's saying from this church"
    },
    {
      "id": 94,
      "start": 1071.219970703125,
      "end": 1077.8999633789062,
      "text": " in Thessalonica, they understood their responsibility to evangelize. We studied"
    },
    {
      "id": 95,
      "start": 1077.8999633789062,
      "end": 1082.2599792480469,
      "text": " this morning in Romans chapter number 1, and what great truth Paul gives us with"
    },
    {
      "id": 96,
      "start": 1082.2599792480469,
      "end": 1086.4999694824219,
      "text": " regard to his own personal understanding, but you understand that the Bible says"
    },
    {
      "id": 97,
      "start": 1086.4999694824219,
      "end": 1090.8599853515625,
      "text": " in verse number 8 of Romans 1, \"...first I thank my God through Jesus Christ for you"
    },
    {
      "id": 98,
      "start": 1090.8599853515625,
      "end": 1097.97998046875,
      "text": " all that your faith is spoken of throughout the whole world.\" We find that"
    },
    {
      "id": 99,
      "start": 1097.97998046875,
      "end": 1104.1799621582031,
      "text": " there are individuals that understand this responsibility, and we must"
    },
    {
      "id": 100,
      "start": 1104.1799621582031,
      "end": 1108.2999877929688,
      "text": " get involved personally. It's a blessing to me when I have the opportunity, and I"
    },
    {
      "id": 101,
      "start": 1108.2999877929688,
      "end": 1113.4599609375,
      "text": " know we live in a very populated area, and so it's not very often that we"
    },
    {
      "id": 102,
      "start": 1113.4599609375,
      "end": 1118.1399536132812,
      "text": " bump into the same person in the same week. It's just so many people in our"
    },
    {
      "id": 103,
      "start": 1118.1399536132812,
      "end": 1124.3800048828125,
      "text": " area, and I've spoken to some pastors that pastor in much smaller areas, and in"
    },
    {
      "id": 104,
      "start": 1124.3800048828125,
      "end": 1127.6599731445312,
      "text": " fact, I spoke to a man on Tuesday at a pastor's meeting, and I asked him how"
    },
    {
      "id": 105,
      "start": 1127.6599731445312,
      "end": 1131.2599487304688,
      "text": " many were in the place where he was ministering. I never even heard of the"
    },
    {
      "id": 106,
      "start": 1131.2599487304688,
      "end": 1134.8199462890625,
      "text": " place here in Virginia where he's a pastor, and I said, I'm sorry, I've"
    },
    {
      "id": 107,
      "start": 1134.8199462890625,
      "end": 1137.8999633789062,
      "text": " never heard of it. Where is it? You know, how many people are there? He said, well,"
    },
    {
      "id": 108,
      "start": 1137.8999633789062,
      "end": 1144.8599853515625,
      "text": " in our entire county, there's about 5,000 people. I said, I think there"
    },
    {
      "id": 109,
      "start": 1144.8599853515625,
      "end": 1148.97998046875,
      "text": " were that many at Walmart yesterday. That's how I felt anyway, man. But the"
    },
    {
      "id": 110,
      "start": 1148.97998046875,
      "end": 1153.6199951171875,
      "text": " reality is that there are some places like that where the likelihood of coming"
    },
    {
      "id": 111,
      "start": 1153.6199951171875,
      "end": 1157.219970703125,
      "text": " into contact with the same person the same week is higher than it would be"
    },
    {
      "id": 112,
      "start": 1157.219970703125,
      "end": 1162.6199951171875,
      "text": " here. But there have been times over these last almost 10 years that I have taken"
    },
    {
      "id": 113,
      "start": 1162.6199951171875,
      "end": 1165.5399780273438,
      "text": " out a gospel tract, and I've sought to give it to an individual, and they've"
    },
    {
      "id": 114,
      "start": 1165.5399780273438,
      "end": 1171.3399658203125,
      "text": " said, I just got one of those from someone. And I find that someone from"
    },
    {
      "id": 115,
      "start": 1171.3399658203125,
      "end": 1177.2999877929688,
      "text": " within our church gave them a gospel tract and invited them to read the"
    },
    {
      "id": 116,
      "start": 1177.2999877929688,
      "end": 1183.3399658203125,
      "text": " truth of the gospel, and it encourages me. It's a blessing to me when we have"
    },
    {
      "id": 117,
      "start": 1183.3399658203125,
      "end": 1186.5399780273438,
      "text": " the privilege of seeing that. I had someone call me from Office Depot a few"
    },
    {
      "id": 118,
      "start": 1186.5399780273438,
      "end": 1191.5799560546875,
      "text": " years ago, and they said, hey, I just want to let you know that someone was in here"
    },
    {
      "id": 119,
      "start": 1191.5799560546875,
      "end": 1195.7799682617188,
      "text": " and they gave me a gospel tract, and I just appreciate that there's a church"
    },
    {
      "id": 120,
      "start": 1195.7799682617188,
      "end": 1201.6199951171875,
      "text": " that has a pastor that cares enough about reaching..."
    },
    {
      "id": 0,
      "start": 1201.6199951171875,
      "end": 1205.2999951839447,
      "text": " people that not only does he encourage people to do it, but he supplies gospel tracts."
    },
    {
      "id": 1,
      "start": 1205.2999951839447,
      "end": 1207.3799953460693,
      "text": " That's what the person said to me on the phone."
    },
    {
      "id": 2,
      "start": 1207.3799953460693,
      "end": 1210.5799951553345,
      "text": " Now I thought they were going to complain about the fact that somebody had left a gospel"
    },
    {
      "id": 3,
      "start": 1210.5799951553345,
      "end": 1214.8199949264526,
      "text": " tract at Office Depot, so I was getting all prepared for the conversation of, you know,"
    },
    {
      "id": 4,
      "start": 1214.8199949264526,
      "end": 1217.979995727539,
      "text": " you're not allowed to be bringing this stuff in and all this sort of thing, but then they"
    },
    {
      "id": 5,
      "start": 1217.979995727539,
      "end": 1223.0999946594238,
      "text": " thanked me, and it was refreshing, it was encouraging, and I was rejoicing at the end"
    },
    {
      "id": 6,
      "start": 1223.0999946594238,
      "end": 1225.4599952697754,
      "text": " of that conversation."
    },
    {
      "id": 7,
      "start": 1225.4599952697754,
      "end": 1231.1799945831299,
      "text": " But what it is is that each individual has to understand that we have a responsibility"
    },
    {
      "id": 8,
      "start": 1231.1799945831299,
      "end": 1236.0799942016602,
      "text": " personally to reach individuals with the gospel."
    },
    {
      "id": 9,
      "start": 1236.0799942016602,
      "end": 1240.7399940490723,
      "text": " And I want you to think about really three portions of Scripture this evening, and we're"
    },
    {
      "id": 10,
      "start": 1240.7399940490723,
      "end": 1247.8599967956543,
      "text": " going to go back to 2 Kings chapter number 7 with this thought of our responsibility,"
    },
    {
      "id": 11,
      "start": 1247.8599967956543,
      "end": 1248.8599967956543,
      "text": " pulling them out of the fire."
    },
    {
      "id": 12,
      "start": 1248.8599967956543,
      "end": 1252.2999954223633,
      "text": " I want you to go back to 2 Kings 7, we're going to look at a passage there, we're going"
    },
    {
      "id": 13,
      "start": 1252.2999954223633,
      "end": 1256.5799942016602,
      "text": " to go to the book of Proverbs and then conclude in Acts chapter number 20, but I want you"
    },
    {
      "id": 14,
      "start": 1256.5799942016602,
      "end": 1263.0599937438965,
      "text": " to look at 2 Kings chapter number 7, and just even as I stated that passage of Scripture,"
    },
    {
      "id": 15,
      "start": 1263.0599937438965,
      "end": 1269.3999938964844,
      "text": " perhaps someone was already mindful of what takes place here in this particular passage."
    },
    {
      "id": 16,
      "start": 1269.3999938964844,
      "end": 1275.979995727539,
      "text": " You find that it's here that Elisha makes that declaration with regard to all that was"
    },
    {
      "id": 17,
      "start": 1275.979995727539,
      "end": 1282.099998474121,
      "text": " taking place with their lack of food and supply being taken care of, and that servant responds"
    },
    {
      "id": 18,
      "start": 1282.099998474121,
      "end": 1286.5199966430664,
      "text": " about even if the Lord would make windows in heaven, might this thing be, and so on"
    },
    {
      "id": 19,
      "start": 1286.5199966430664,
      "end": 1287.5199966430664,
      "text": " and so forth."
    },
    {
      "id": 20,
      "start": 1287.5199966430664,
      "end": 1294.3399963378906,
      "text": " But we find that God is going to work and God is going to provide, but within the story"
    },
    {
      "id": 21,
      "start": 1294.3399963378906,
      "end": 1299.5799942016602,
      "text": " there's another story, and it's the story of these leprous men."
    },
    {
      "id": 22,
      "start": 1299.5799942016602,
      "end": 1304.8199920654297,
      "text": " And in 2 Kings 7, the Bible says in verse 3, and there were four leprous men at the"
    },
    {
      "id": 23,
      "start": 1304.8199920654297,
      "end": 1309.139991760254,
      "text": " entering into the gate, and they said one to another, why sit we here until we die?"
    },
    {
      "id": 24,
      "start": 1309.139991760254,
      "end": 1314.7799987792969,
      "text": " So they go through this process of if we stay here we're going to die, if we stay"
    },
    {
      "id": 25,
      "start": 1314.7799987792969,
      "end": 1318.4199981689453,
      "text": " here we're going to die, we don't have any food, and we're leprous, and if we go"
    },
    {
      "id": 26,
      "start": 1318.4199981689453,
      "end": 1322.979995727539,
      "text": " to the Syrians there's a possibility that we would have the opportunity to have grace"
    },
    {
      "id": 27,
      "start": 1322.979995727539,
      "end": 1326.5399932861328,
      "text": " in their eyes and we might live, and so on and so forth, and so they make the decision"
    },
    {
      "id": 28,
      "start": 1326.5399932861328,
      "end": 1332.2200012207031,
      "text": " to go, and without them knowing, the Lord, according to verse number 6, had made the"
    },
    {
      "id": 29,
      "start": 1332.2200012207031,
      "end": 1337.9400024414062,
      "text": " host of the Syrians to hear a noise of chariots and a noise of horses, even the noise of a"
    },
    {
      "id": 30,
      "start": 1337.9400024414062,
      "end": 1341.3399963378906,
      "text": " great host, and they said one to another, lo, the king of Israel hath hired against"
    },
    {
      "id": 31,
      "start": 1341.3399963378906,
      "end": 1346.3799896240234,
      "text": " us the king of the Hittites and the kings of the Egyptians to come upon us, wherefore"
    },
    {
      "id": 32,
      "start": 1346.3799896240234,
      "end": 1351.4199981689453,
      "text": " they, that's the Syrians, they arose and fled in the twilight, they left their tents,"
    },
    {
      "id": 33,
      "start": 1351.4199981689453,
      "end": 1355.5399932861328,
      "text": " their horses, their asses, even the camp as it was, and fled for their life."
    },
    {
      "id": 34,
      "start": 1355.5399932861328,
      "end": 1359.2200012207031,
      "text": " The same time that that's happening, these four leprous men are saying, hey, let's,"
    },
    {
      "id": 35,
      "start": 1359.2200012207031,
      "end": 1362.979995727539,
      "text": " you know, what's the point of staying here, let's go."
    },
    {
      "id": 36,
      "start": 1362.979995727539,
      "end": 1368.5,
      "text": " Verse 8, and when these lepers came to the uttermost part of the camp, they went into"
    },
    {
      "id": 37,
      "start": 1368.5,
      "end": 1372.3799896240234,
      "text": " one tent and did eat and drink and carried then silver and gold and raiment and went"
    },
    {
      "id": 38,
      "start": 1372.3799896240234,
      "end": 1376.7799987792969,
      "text": " and hid it, and came again and entered into another tent and carried then also and went"
    },
    {
      "id": 39,
      "start": 1376.7799987792969,
      "end": 1378.3399963378906,
      "text": " and hid it."
    },
    {
      "id": 40,
      "start": 1378.3399963378906,
      "end": 1381.0599975585938,
      "text": " They find great spoil."
    },
    {
      "id": 41,
      "start": 1381.0599975585938,
      "end": 1383.4599914550781,
      "text": " I mean, can you imagine?"
    },
    {
      "id": 42,
      "start": 1383.4599914550781,
      "end": 1390.3799896240234,
      "text": " These four leprous men, they go to the place, the camp of the Syrians and they find that"
    },
    {
      "id": 43,
      "start": 1390.6199951171875,
      "end": 1394.5,
      "text": " there's no one there, but all of the supplies are there."
    },
    {
      "id": 44,
      "start": 1394.5,
      "end": 1396.1399993896484,
      "text": " I mean, everything, they left it all."
    },
    {
      "id": 45,
      "start": 1396.1399993896484,
      "end": 1401.259994506836,
      "text": " And they said, man, this is great, but I want you to notice what they say in verse number"
    },
    {
      "id": 46,
      "start": 1401.259994506836,
      "end": 1411.0999908447266,
      "text": " 9, then they said one to another, we do not well."
    },
    {
      "id": 47,
      "start": 1411.0999908447266,
      "end": 1415.4199981689453,
      "text": " Why was it that they reached this conclusion?"
    },
    {
      "id": 48,
      "start": 1415.4199981689453,
      "end": 1417.2999877929688,
      "text": " We do not well, why?"
    },
    {
      "id": 49,
      "start": 1417.2999877929688,
      "end": 1426.0999908447266,
      "text": " This day is a day of good tidings, and we hold our peace."
    },
    {
      "id": 50,
      "start": 1426.0999908447266,
      "end": 1430.5399932861328,
      "text": " If we tarry till the morning light, some mischief will come upon us."
    },
    {
      "id": 51,
      "start": 1430.5399932861328,
      "end": 1437.0199890136719,
      "text": " Now therefore come that we may go and tell the king's household."
    },
    {
      "id": 52,
      "start": 1437.0199890136719,
      "end": 1438.0199890136719,
      "text": " They said we do not well."
    },
    {
      "id": 53,
      "start": 1438.0199890136719,
      "end": 1440.8199920654297,
      "text": " See, they came upon a great amount of spoil."
    },
    {
      "id": 54,
      "start": 1440.8199920654297,
      "end": 1445.6199951171875,
      "text": " There were people that were dying of hunger."
    },
    {
      "id": 55,
      "start": 1445.6199951171875,
      "end": 1449.2200012207031,
      "text": " And they had found great substance."
    },
    {
      "id": 56,
      "start": 1449.2200012207031,
      "end": 1453.7799987792969,
      "text": " And they went into one tent, the Bible tells us in verse number 8, and they ate, they drank,"
    },
    {
      "id": 57,
      "start": 1453.7799987792969,
      "end": 1457.8999938964844,
      "text": " they carried then silver and gold raiment, went and hid it, and then they came into another"
    },
    {
      "id": 58,
      "start": 1457.8999938964844,
      "end": 1458.8999938964844,
      "text": " tent."
    },
    {
      "id": 59,
      "start": 1458.8999938964844,
      "end": 1462.2200012207031,
      "text": " There's only so much that these four men could eat and drink of themselves, there's only"
    },
    {
      "id": 60,
      "start": 1462.2200012207031,
      "end": 1463.7799987792969,
      "text": " so much that they could hide."
    },
    {
      "id": 61,
      "start": 1463.7799987792969,
      "end": 1469.739990234375,
      "text": " And they go into that next tent and together they say, we do not well."
    },
    {
      "id": 62,
      "start": 1469.739990234375,
      "end": 1471.7799987792969,
      "text": " We do not well, why?"
    },
    {
      "id": 63,
      "start": 1471.7799987792969,
      "end": 1477.7799987792969,
      "text": " This day is a day of good tidings, and notice, we hold our peace."
    },
    {
      "id": 64,
      "start": 1477.7799987792969,
      "end": 1484.2200012207031,
      "text": " We need to go back, and we need to go, notice where it says that we may go and tell the"
    },
    {
      "id": 65,
      "start": 1484.2200012207031,
      "end": 1485.4199829101562,
      "text": " king's household."
    },
    {
      "id": 66,
      "start": 1485.4199829101562,
      "end": 1487.0599975585938,
      "text": " Now here's the amazing thing."
    },
    {
      "id": 67,
      "start": 1487.0599975585938,
      "end": 1494.1399841308594,
      "text": " They couldn't make anyone of the nation of Israel go to find the spoil."
    },
    {
      "id": 68,
      "start": 1494.1399841308594,
      "end": 1499.1399841308594,
      "text": " All they could do is go and tell them as to what they found, right?"
    },
    {
      "id": 69,
      "start": 1499.1399841308594,
      "end": 1500.1399841308594,
      "text": " They couldn't make them go."
    },
    {
      "id": 70,
      "start": 1500.1399841308594,
      "end": 1503.739990234375,
      "text": " In fact, the Bible tells us in verse number 10, so they came and called unto the porter"
    },
    {
      "id": 71,
      "start": 1503.739990234375,
      "end": 1507.1799926757812,
      "text": " of the city, and they told them, saying, We came to the camp of the Syrians, and, behold,"
    },
    {
      "id": 72,
      "start": 1507.1799926757812,
      "end": 1510.97998046875,
      "text": " there was no man there, neither voice of man, but horses tied and asses tied in the tents"
    },
    {
      "id": 73,
      "start": 1510.97998046875,
      "end": 1512.2200012207031,
      "text": " as they were."
    },
    {
      "id": 74,
      "start": 1512.2200012207031,
      "end": 1516.1399841308594,
      "text": " And he called the porters, and they told it to the king's house within."
    },
    {
      "id": 75,
      "start": 1516.1399841308594,
      "end": 1518.1799926757812,
      "text": " Notice what the king says in verse number 12."
    },
    {
      "id": 76,
      "start": 1518.1799926757812,
      "end": 1522.1399841308594,
      "text": " He arose in the night and said unto the servants, I will now show you what the Syrians have"
    },
    {
      "id": 77,
      "start": 1522.1399841308594,
      "end": 1523.3800048828125,
      "text": " done to us."
    },
    {
      "id": 78,
      "start": 1523.3800048828125,
      "end": 1527.5,
      "text": " They know that we be hungry, therefore are they gone out of the camp to hide themselves"
    },
    {
      "id": 79,
      "start": 1527.5,
      "end": 1530.6999816894531,
      "text": " in the field, saying, When they come out of the city, we shall catch them alive and"
    },
    {
      "id": 80,
      "start": 1530.6999816894531,
      "end": 1531.6999816894531,
      "text": " get into the city."
    },
    {
      "id": 81,
      "start": 1531.6999816894531,
      "end": 1532.6999816894531,
      "text": " What's he doing?"
    },
    {
      "id": 82,
      "start": 1532.6999816894531,
      "end": 1536.4599914550781,
      "text": " He's objecting to going to where the food is."
    },
    {
      "id": 83,
      "start": 1536.4599914550781,
      "end": 1538.1799926757812,
      "text": " Oh, they've set up a trap."
    },
    {
      "id": 84,
      "start": 1538.1799926757812,
      "end": 1540.739990234375,
      "text": " I mean, they're going to, they've hid themselves."
    },
    {
      "id": 85,
      "start": 1540.739990234375,
      "end": 1543.9400024414062,
      "text": " They know that we're hungry, and we come, and they've lured us in, and then they're"
    },
    {
      "id": 86,
      "start": 1543.9400024414062,
      "end": 1545.3399963378906,
      "text": " going to come and conquer us."
    },
    {
      "id": 87,
      "start": 1545.3399963378906,
      "end": 1548.8999938964844,
      "text": " Well, you can believe what you want, but we just went into the tents, and we got food."
    },
    {
      "id": 88,
      "start": 1548.8999938964844,
      "end": 1549.8999938964844,
      "text": " Right?"
    },
    {
      "id": 89,
      "start": 1549.8999938964844,
      "end": 1553.3800048828125,
      "text": " I mean, can you see these four leprous men?"
    },
    {
      "id": 90,
      "start": 1553.3800048828125,
      "end": 1559.3800048828125,
      "text": " And as I look at this passage of Scripture, if I could draw an application to sharing"
    },
    {
      "id": 91,
      "start": 1559.3800048828125,
      "end": 1563.2200012207031,
      "text": " the gospel, we have found the light."
    },
    {
      "id": 92,
      "start": 1563.2200012207031,
      "end": 1565.5400085449219,
      "text": " We have found the truth."
    },
    {
      "id": 93,
      "start": 1565.5400085449219,
      "end": 1570.6199951171875,
      "text": " And if our gospel be hid, Paul said as I mentioned this morning, it is hid to them that are lost,"
    },
    {
      "id": 94,
      "start": 1570.6199951171875,
      "end": 1576.2200012207031,
      "text": " I would say this evening, then in a much more important fashion, even as the writer said"
    },
    {
      "id": 95,
      "start": 1576.2200012207031,
      "end": 1582.0199890136719,
      "text": " of that last hymn that I read, that hymn story, if we found somebody that was drowning, if"
    },
    {
      "id": 96,
      "start": 1582.0199890136719,
      "end": 1586.260009765625,
      "text": " we found somebody in a burning building, but how much more important when we think"
    },
    {
      "id": 97,
      "start": 1586.260009765625,
      "end": 1591.4599914550781,
      "text": " about the souls of mankind, and I would say to you this evening that if we have found"
    },
    {
      "id": 98,
      "start": 1591.4599914550781,
      "end": 1598.0599975585938,
      "text": " the truth, and we are not sharing it, we do not well."
    },
    {
      "id": 99,
      "start": 1598.0599975585938,
      "end": 1599.6999816894531,
      "text": " Period."
    },
    {
      "id": 100,
      "start": 1599.6999816894531,
      "end": 1600.8599853515625,
      "text": " End of story."
    },
    {
      "id": 101,
      "start": 1600.8599853515625,
      "end": 1603.5,
      "text": " We do not well."
    },
    {
      "id": 102,
      "start": 1603.5,
      "end": 1606.3800048828125,
      "text": " Why?"
    },
    {
      "id": 103,
      "start": 1606.3800048828125,
      "end": 1612.6999816894531,
      "text": " Because we know the truth, and we know the Savior, and we know what He offers."
    },
    {
      "id": 104,
      "start": 1612.6999816894531,
      "end": 1619.4199829101562,
      "text": " They, these lepers, all they could do is go and tell."
    },
    {
      "id": 105,
      "start": 1619.4199829101562,
      "end": 1624.6999816894531,
      "text": " They couldn't make anyone come to any tent of Assyrian."
    },
    {
      "id": 106,
      "start": 1624.6999816894531,
      "end": 1625.6999816894531,
      "text": " That's all they could do is go and tell."
    },
    {
      "id": 107,
      "start": 1625.6999816894531,
      "end": 1626.6999816894531,
      "text": " And you know what?"
    },
    {
      "id": 108,
      "start": 1626.6999816894531,
      "end": 1630.8599853515625,
      "text": " All the Lord requires of us is to go and tell."
    },
    {
      "id": 109,
      "start": 1630.8599853515625,
      "end": 1632.97998046875,
      "text": " To go and tell."
    },
    {
      "id": 110,
      "start": 1632.97998046875,
      "end": 1639.6199951171875,
      "text": " He gives us the truth, and then He entrusts us with that truth to go and tell others."
    },
    {
      "id": 111,
      "start": 1639.6199951171875,
      "end": 1644.6199951171875,
      "text": " I can't force anyone to be saved, and neither can you."
    },
    {
      "id": 112,
      "start": 1644.6199951171875,
      "end": 1648.0199890136719,
      "text": " But oh, that we would go and tell them."
    },
    {
      "id": 113,
      "start": 1648.0199890136719,
      "end": 1652.8200073242188,
      "text": " That we would make it known that we would not hold our peace."
    },
    {
      "id": 114,
      "start": 1652.8200073242188,
      "end": 1658.1000061035156,
      "text": " If you look at the remainder of this passage, and we're going to move on, but you find that"
    },
    {
      "id": 115,
      "start": 1658.1000061035156,
      "end": 1663.3399963378906,
      "text": " they find it just as the four lepers said the people went out and spoiled the tents"
    },
    {
      "id": 116,
      "start": 1663.3399963378906,
      "end": 1667.2999877929688,
      "text": " according to verse number 16, so that a measure of fine flour was sold for a shekel, and two"
    },
    {
      "id": 117,
      "start": 1667.2999877929688,
      "end": 1671.8999938964844,
      "text": " measures of barley for a shekel, according to the word of the Lord, just as Elisha had"
    },
    {
      "id": 118,
      "start": 1671.8999938964844,
      "end": 1673.6999816894531,
      "text": " prophesied in verse number 1."
    },
    {
      "id": 119,
      "start": 1673.6999816894531,
      "end": 1678.6600036621094,
      "text": " And I understand the physical aspect of this particular account, but I draw the spiritual"
    },
    {
      "id": 120,
      "start": 1678.6600036621094,
      "end": 1681.260009765625,
      "text": " application for us this evening."
    },
    {
      "id": 121,
      "start": 1681.260009765625,
      "end": 1684.2200012207031,
      "text": " We do not well if we hold our peace."
    },
    {
      "id": 122,
      "start": 1684.2200012207031,
      "end": 1685.6600036621094,
      "text": " We need to go and tell."
    },
    {
      "id": 123,
      "start": 1685.6600036621094,
      "end": 1689.97998046875,
      "text": " This is what's over in the book of Proverbs, if you will, in Proverbs chapter number 24."
    },
    {
      "id": 124,
      "start": 1689.97998046875,
      "end": 1695.1399841308594,
      "text": " I believe in these couple of verses of Scripture in Proverbs 24, that there's an obvious application"
    },
    {
      "id": 125,
      "start": 1695.1399841308594,
      "end": 1700.260009765625,
      "text": " for us in these verses with regard to sharing the gospel."
    },
    {
      "id": 126,
      "start": 1700.260009765625,
      "end": 1706.0599975585938,
      "text": " The Bible says in Proverbs 24, verse number 11,"
    },
    {
      "id": 127,
      "start": 1706.0599975585938,
      "end": 1712.1000061035156,
      "text": " If thou forbear to deliver them that are drawn unto death, and those that are ready to be"
    },
    {
      "id": 128,
      "start": 1712.1000061035156,
      "end": 1718.8599853515625,
      "text": " slain, if thou sayest, Behold, we knew it not, doth not he that pondereth the heart"
    },
    {
      "id": 129,
      "start": 1718.8599853515625,
      "end": 1720.4600219726562,
      "text": " consider it?"
    },
    {
      "id": 130,
      "start": 1720.4600219726562,
      "end": 1725.219970703125,
      "text": " And he that keepeth thy soul, doth not he know it?"
    },
    {
      "id": 131,
      "start": 1725.219970703125,
      "end": 1730.6599731445312,
      "text": " And shall not he render to every man according to his works?"
    },
    {
      "id": 132,
      "start": 1730.6599731445312,
      "end": 1734.4600219726562,
      "text": " I believe that there's a spiritual application here as well, just as there was in 2 Kings"
    },
    {
      "id": 133,
      "start": 1734.4600219726562,
      "end": 1740.0599975585938,
      "text": " 7, that we'd understand this word forbear is used in verse number 11, if thou forbear"
    },
    {
      "id": 134,
      "start": 1740.0599975585938,
      "end": 1745.9400024414062,
      "text": " to deliver them that are drawn unto death, it means to procrastinate or to refrain."
    },
    {
      "id": 135,
      "start": 1745.9400024414062,
      "end": 1752.0599975585938,
      "text": " And we understand that this evening, that it's easier for us to make excuses than for"
    },
    {
      "id": 136,
      "start": 1752.0599975585938,
      "end": 1754.5399780273438,
      "text": " us to just do what we're supposed to do."
    },
    {
      "id": 137,
      "start": 1754.5399780273438,
      "end": 1760.8200073242188,
      "text": " Because notice what he says in verse number 12, if thou sayest, Behold, we knew it not."
    },
    {
      "id": 138,
      "start": 1760.8200073242188,
      "end": 1764.3800048828125,
      "text": " It's easy for us to make excuses, it really is."
    },
    {
      "id": 139,
      "start": 1764.3800048828125,
      "end": 1766.7799682617188,
      "text": " It's easy for me to make excuses."
    },
    {
      "id": 140,
      "start": 1766.8200073242188,
      "end": 1771.3800048828125,
      "text": " I sat in my office this afternoon, in fact, Holly and I have had a couple of conversations"
    },
    {
      "id": 141,
      "start": 1771.3800048828125,
      "end": 1776.7000122070312,
      "text": " about this very thing in recent weeks, and this afternoon I read the first part of that"
    },
    {
      "id": 142,
      "start": 1776.7000122070312,
      "end": 1782.4600219726562,
      "text": " hymn story about rescue the perishing, about the priority that it was at some point in"
    },
    {
      "id": 143,
      "start": 1782.4600219726562,
      "end": 1786.739990234375,
      "text": " days gone by amongst believers to reach the lost with the gospel."
    },
    {
      "id": 144,
      "start": 1786.739990234375,
      "end": 1790.6599731445312,
      "text": " And I said to Holly as I was sitting at my desk, and she was sitting at the conference"
    },
    {
      "id": 145,
      "start": 1790.6599731445312,
      "end": 1795.8200073242188,
      "text": " room table, I said, when and why did it stop becoming a priority?"
    },
    {
      "id": 146,
      "start": 1795.8200073242188,
      "end": 1798.2999877929688,
      "text": " Is that not what I said to you this afternoon?"
    },
    {
      "id": 147,
      "start": 1798.2999877929688,
      "end": 1801.6599731445312,
      "text": " It seems as if we've gotten so busy with so many other things."
    },
    {
      "id": 0,
      "start": 1801.6599731445312,
      "end": 1803.819973230362,
      "text": " and there's so many other things"
    },
    {
      "id": 1,
      "start": 1803.819973230362,
      "end": 1805.0799732208252,
      "text": " going on in our world,"
    },
    {
      "id": 2,
      "start": 1805.0799732208252,
      "end": 1807.7799730300903,
      "text": " and there's so many things vying for our attention"
    },
    {
      "id": 3,
      "start": 1807.7799730300903,
      "end": 1810.0799732208252,
      "text": " that as preachers in days gone by"
    },
    {
      "id": 4,
      "start": 1810.0799732208252,
      "end": 1812.7399730682373,
      "text": " used to make this statement over and over,"
    },
    {
      "id": 5,
      "start": 1812.7399730682373,
      "end": 1816.2399730682373,
      "text": " keep the main thing the main thing."
    },
    {
      "id": 6,
      "start": 1816.2399730682373,
      "end": 1818.3199729919434,
      "text": " What they would refer to in saying that"
    },
    {
      "id": 7,
      "start": 1818.3199729919434,
      "end": 1820.919973373413,
      "text": " is the responsibility of sharing the Gospel"
    },
    {
      "id": 8,
      "start": 1820.919973373413,
      "end": 1825.179973602295,
      "text": " with individuals that we come into contact with."
    },
    {
      "id": 9,
      "start": 1825.179973602295,
      "end": 1828.2799739837646,
      "text": " This world is not my home."
    },
    {
      "id": 10,
      "start": 1828.2799739837646,
      "end": 1830.179973602295,
      "text": " We sing that, don't we?"
    },
    {
      "id": 11,
      "start": 1830.179973602295,
      "end": 1832.8199729919434,
      "text": " We read about the patriarchs"
    },
    {
      "id": 12,
      "start": 1832.8199729919434,
      "end": 1835.2999725341797,
      "text": " and those in Hebrews 11"
    },
    {
      "id": 13,
      "start": 1835.2999725341797,
      "end": 1837.1599731445312,
      "text": " that were strangers and pilgrims,"
    },
    {
      "id": 14,
      "start": 1837.1599731445312,
      "end": 1839.4799728393555,
      "text": " and we speak about this world not being our home,"
    },
    {
      "id": 15,
      "start": 1839.4799728393555,
      "end": 1841.5999717712402,
      "text": " but the reality is that there are some times"
    },
    {
      "id": 16,
      "start": 1841.5999717712402,
      "end": 1843.5199737548828,
      "text": " in which we spend more time acting as if"
    },
    {
      "id": 17,
      "start": 1843.5199737548828,
      "end": 1845.0399742126465,
      "text": " this is our forever home"
    },
    {
      "id": 18,
      "start": 1845.0399742126465,
      "end": 1848.399974822998,
      "text": " than heaven being our forever home."
    },
    {
      "id": 19,
      "start": 1848.399974822998,
      "end": 1849.5799713134766,
      "text": " Who are we taking with us?"
    },
    {
      "id": 20,
      "start": 1849.5799713134766,
      "end": 1851.119972229004,
      "text": " Who am I taking with me?"
    },
    {
      "id": 21,
      "start": 1851.119972229004,
      "end": 1853.179973602295,
      "text": " Who am I giving the Gospel to?"
    },
    {
      "id": 22,
      "start": 1853.179973602295,
      "end": 1855.5999717712402,
      "text": " Who are you giving the Gospel to?"
    },
    {
      "id": 23,
      "start": 1855.5999717712402,
      "end": 1857.8599739074707,
      "text": " I'm not this evening,"
    },
    {
      "id": 24,
      "start": 1857.8599739074707,
      "end": 1859.9599723815918,
      "text": " the Lord has worked on me"
    },
    {
      "id": 25,
      "start": 1859.9599723815918,
      "end": 1861.1999740600586,
      "text": " longer than He's worked on you"
    },
    {
      "id": 26,
      "start": 1861.1999740600586,
      "end": 1863.6999740600586,
      "text": " because I've been preparing these messages."
    },
    {
      "id": 27,
      "start": 1863.6999740600586,
      "end": 1864.9599723815918,
      "text": " And then I get to deliver them"
    },
    {
      "id": 28,
      "start": 1864.9599723815918,
      "end": 1868.9999694824219,
      "text": " and get worked on again."
    },
    {
      "id": 29,
      "start": 1868.9999694824219,
      "end": 1872.839973449707,
      "text": " I'm convicted, personally,"
    },
    {
      "id": 30,
      "start": 1872.839973449707,
      "end": 1875.2799758911133,
      "text": " about the need to prioritize"
    },
    {
      "id": 31,
      "start": 1875.2799758911133,
      "end": 1877.7999725341797,
      "text": " once again reaching people with the Gospel."
    },
    {
      "id": 32,
      "start": 1877.7999725341797,
      "end": 1879.9199752807617,
      "text": " It's easy to make excuses."
    },
    {
      "id": 33,
      "start": 1879.9199752807617,
      "end": 1880.959976196289,
      "text": " They don't want to hear."
    },
    {
      "id": 34,
      "start": 1880.959976196289,
      "end": 1881.9199752807617,
      "text": " They're not interested."
    },
    {
      "id": 35,
      "start": 1881.9199752807617,
      "end": 1883.0599746704102,
      "text": " They're too busy."
    },
    {
      "id": 36,
      "start": 1883.0599746704102,
      "end": 1886.1599731445312,
      "text": " Did you see what they look like?"
    },
    {
      "id": 37,
      "start": 1886.1599731445312,
      "end": 1887.3599700927734,
      "text": " They're going to bite my head off."
    },
    {
      "id": 38,
      "start": 1887.5799713134766,
      "end": 1891.0999755859375,
      "text": " We just make excuses."
    },
    {
      "id": 39,
      "start": 1891.0999755859375,
      "end": 1894.5399703979492,
      "text": " But the reality is that we need to go and tell"
    },
    {
      "id": 40,
      "start": 1894.5399703979492,
      "end": 1896.339973449707,
      "text": " if we forbear to deliver them"
    },
    {
      "id": 41,
      "start": 1896.339973449707,
      "end": 1897.4399719238281,
      "text": " that are drawn unto death."
    },
    {
      "id": 42,
      "start": 1897.4399719238281,
      "end": 1899.7799758911133,
      "text": " We know the end of all man"
    },
    {
      "id": 43,
      "start": 1899.7799758911133,
      "end": 1902.2999725341797,
      "text": " and we know that there is an opportunity for us."
    },
    {
      "id": 44,
      "start": 1902.2999725341797,
      "end": 1904.8999710083008,
      "text": " I want you to consider finally this evening"
    },
    {
      "id": 45,
      "start": 1904.8999710083008,
      "end": 1906.0999755859375,
      "text": " what Paul said in Acts 20."
    },
    {
      "id": 46,
      "start": 1906.0999755859375,
      "end": 1908.1799697875977,
      "text": " We referenced a few of these verses"
    },
    {
      "id": 47,
      "start": 1908.1799697875977,
      "end": 1909.6599731445312,
      "text": " in Acts 20 this morning,"
    },
    {
      "id": 48,
      "start": 1909.6599731445312,
      "end": 1912.2599716186523,
      "text": " but we skipped over these purposefully"
    },
    {
      "id": 49,
      "start": 1912.2599716186523,
      "end": 1914.7799758911133,
      "text": " because I was going to be using them this evening."
    },
    {
      "id": 50,
      "start": 1914.7799758911133,
      "end": 1915.8999710083008,
      "text": " But as he's speaking here"
    },
    {
      "id": 51,
      "start": 1915.959976196289,
      "end": 1920.0399703979492,
      "text": " to these church leaders in Ephesus,"
    },
    {
      "id": 52,
      "start": 1920.0399703979492,
      "end": 1924.839973449707,
      "text": " I want you to notice what he says in v. 26-27."
    },
    {
      "id": 53,
      "start": 1924.839973449707,
      "end": 1927.0799713134766,
      "text": " In v. 26-27, Paul says this,"
    },
    {
      "id": 54,
      "start": 1927.0799713134766,
      "end": 1929.9999694824219,
      "text": " Wherefore I take you to record this day,"
    },
    {
      "id": 55,
      "start": 1929.9999694824219,
      "end": 1933.219970703125,
      "text": " that I am pure from the blood of all men."
    },
    {
      "id": 56,
      "start": 1933.219970703125,
      "end": 1937.3999786376953,
      "text": " For I have not shunned to declare unto you all"
    },
    {
      "id": 57,
      "start": 1937.3999786376953,
      "end": 1939.3999786376953,
      "text": " the counsel of God."
    },
    {
      "id": 58,
      "start": 1939.3999786376953,
      "end": 1942.0799713134766,
      "text": " That word shunned means to be timid or to draw back."
    },
    {
      "id": 59,
      "start": 1942.0799713134766,
      "end": 1944.0999755859375,
      "text": " It would be used to refer to those"
    },
    {
      "id": 60,
      "start": 1944.0999755859375,
      "end": 1946.8799743652344,
      "text": " who because of timidity hesitate to avow"
    },
    {
      "id": 61,
      "start": 1946.8799743652344,
      "end": 1948.3599700927734,
      "text": " what they believe."
    },
    {
      "id": 62,
      "start": 1948.3599700927734,
      "end": 1950.4399719238281,
      "text": " That they would be unwilling to utter truth"
    },
    {
      "id": 63,
      "start": 1950.4399719238281,
      "end": 1952.3199768066406,
      "text": " due to fear."
    },
    {
      "id": 64,
      "start": 1952.3199768066406,
      "end": 1954.9199676513672,
      "text": " And Paul says, I have not shunned"
    },
    {
      "id": 65,
      "start": 1954.9199676513672,
      "end": 1960.2999725341797,
      "text": " to declare unto you all the counsel of God."
    },
    {
      "id": 66,
      "start": 1960.2999725341797,
      "end": 1961.9999694824219,
      "text": " I notice in v. 26,"
    },
    {
      "id": 67,
      "start": 1961.9999694824219,
      "end": 1963.6399688720703,
      "text": " and we don't have time this evening"
    },
    {
      "id": 68,
      "start": 1963.6399688720703,
      "end": 1965.8599700927734,
      "text": " to develop the entirety of the thought,"
    },
    {
      "id": 69,
      "start": 1965.8599700927734,
      "end": 1968.3999786376953,
      "text": " but Paul, of course, because of his background"
    },
    {
      "id": 70,
      "start": 1968.3999786376953,
      "end": 1970.0799713134766,
      "text": " in studying at the feet of Gamaliel"
    },
    {
      "id": 71,
      "start": 1970.0799713134766,
      "end": 1972.7999725341797,
      "text": " and all that he was with regard"
    },
    {
      "id": 72,
      "start": 1972.7999725341797,
      "end": 1975.459976196289,
      "text": " to his Jewish studies prior to his conversion,"
    },
    {
      "id": 73,
      "start": 1975.459976196289,
      "end": 1976.97998046875,
      "text": " when he makes that statement,"
    },
    {
      "id": 74,
      "start": 1976.97998046875,
      "end": 1978.719970703125,
      "text": " Wherefore I take you to record this day,"
    },
    {
      "id": 75,
      "start": 1978.719970703125,
      "end": 1980.47998046875,
      "text": " that I am pure from the blood of all men,"
    },
    {
      "id": 76,
      "start": 1980.47998046875,
      "end": 1981.8199768066406,
      "text": " I would challenge you to go back"
    },
    {
      "id": 77,
      "start": 1981.8199768066406,
      "end": 1984.6199798583984,
      "text": " to the book of Ezekiel and read v. 3 and v. 33"
    },
    {
      "id": 78,
      "start": 1984.6199798583984,
      "end": 1987.8599700927734,
      "text": " and see the way in which the Lord said to Ezekiel,"
    },
    {
      "id": 79,
      "start": 1987.8599700927734,
      "end": 1992.3999786376953,
      "text": " Son of man, I have set thee to be a watchman."
    },
    {
      "id": 80,
      "start": 1992.3999786376953,
      "end": 1993.9999694824219,
      "text": " And he says if you do your job"
    },
    {
      "id": 81,
      "start": 1993.9999694824219,
      "end": 1995.4399719238281,
      "text": " and you warn them,"
    },
    {
      "id": 82,
      "start": 1995.4399719238281,
      "end": 1997.8799743652344,
      "text": " regardless of what their response is,"
    },
    {
      "id": 83,
      "start": 1997.8799743652344,
      "end": 2001.1599731445312,
      "text": " you're free from their blood."
    },
    {
      "id": 84,
      "start": 2001.1799774169922,
      "end": 2003.9199676513672,
      "text": " But, if I've made you a watchman"
    },
    {
      "id": 85,
      "start": 2003.9199676513672,
      "end": 2006.9999694824219,
      "text": " and you fail to warn them,"
    },
    {
      "id": 86,
      "start": 2006.9999694824219,
      "end": 2010.719970703125,
      "text": " then you're accountable for not telling them."
    },
    {
      "id": 87,
      "start": 2010.719970703125,
      "end": 2013.8799743652344,
      "text": " Man, that's serious."
    },
    {
      "id": 88,
      "start": 2013.8799743652344,
      "end": 2016.3799743652344,
      "text": " And Paul, he had a deep knowledge"
    },
    {
      "id": 89,
      "start": 2016.3799743652344,
      "end": 2018.6799774169922,
      "text": " of the Old Testament."
    },
    {
      "id": 90,
      "start": 2018.6799774169922,
      "end": 2020.4999694824219,
      "text": " And for him to say under the inspiration"
    },
    {
      "id": 91,
      "start": 2020.4999694824219,
      "end": 2022.4399719238281,
      "text": " of the Holy Spirit of God in v. 26,"
    },
    {
      "id": 92,
      "start": 2022.4399719238281,
      "end": 2026.1399688720703,
      "text": " that I am pure from the blood of all men."
    },
    {
      "id": 93,
      "start": 2026.1399688720703,
      "end": 2028.459976196289,
      "text": " I can't help but see the connection"
    },
    {
      "id": 94,
      "start": 2028.459976196289,
      "end": 2030.1399688720703,
      "text": " from this statement to that truth"
    },
    {
      "id": 95,
      "start": 2030.1399688720703,
      "end": 2032.0599670410156,
      "text": " in the book of Ezekiel."
    },
    {
      "id": 96,
      "start": 2032.0599670410156,
      "end": 2034.2799682617188,
      "text": " And I wonder this evening,"
    },
    {
      "id": 97,
      "start": 2034.2799682617188,
      "end": 2038.8799743652344,
      "text": " as we think about this reality of eternity,"
    },
    {
      "id": 98,
      "start": 2038.8799743652344,
      "end": 2041.9199676513672,
      "text": " but then the responsibility to evangelize,"
    },
    {
      "id": 99,
      "start": 2041.9199676513672,
      "end": 2043.9999694824219,
      "text": " I wonder, to some,"
    },
    {
      "id": 100,
      "start": 2043.9999694824219,
      "end": 2046.5599670410156,
      "text": " we need to have compassion making a difference."
    },
    {
      "id": 101,
      "start": 2046.5599670410156,
      "end": 2049.3599700927734,
      "text": " Others, with fear, pulling them out of the fire."
    },
    {
      "id": 102,
      "start": 2049.3599700927734,
      "end": 2051.679977416992,
      "text": " Hating even the garments that are spotted"
    },
    {
      "id": 103,
      "start": 2051.679977416992,
      "end": 2052.919967651367,
      "text": " by the world."
    },
    {
      "id": 104,
      "start": 2052.919967651367,
      "end": 2055.0799713134766,
      "text": " And I wonder tonight,"
    },
    {
      "id": 105,
      "start": 2055.0799713134766,
      "end": 2058.3599853515625,
      "text": " who is it that maybe we're working with?"
    },
    {
      "id": 106,
      "start": 2058.3799743652344,
      "end": 2060.6199645996094,
      "text": " Who is it that we're praying for?"
    },
    {
      "id": 107,
      "start": 2060.6199645996094,
      "end": 2062.6599731445312,
      "text": " Who is it that we're setting up opportunities"
    },
    {
      "id": 108,
      "start": 2062.6599731445312,
      "end": 2065.3799743652344,
      "text": " to be able to share truth with?"
    },
    {
      "id": 109,
      "start": 2065.3799743652344,
      "end": 2067.219970703125,
      "text": " There's someone that I have been seeking"
    },
    {
      "id": 110,
      "start": 2067.219970703125,
      "end": 2068.4199829101562,
      "text": " to share the Gospel with,"
    },
    {
      "id": 111,
      "start": 2068.4199829101562,
      "end": 2070.679962158203,
      "text": " and something came up today,"
    },
    {
      "id": 112,
      "start": 2070.679962158203,
      "end": 2072.0199584960938,
      "text": " and I sent him a note."
    },
    {
      "id": 113,
      "start": 2072.0199584960938,
      "end": 2074.4599609375,
      "text": " It was just one of those opportunities."
    },
    {
      "id": 114,
      "start": 2074.4599609375,
      "end": 2075.3799743652344,
      "text": " Hey, here's something,"
    },
    {
      "id": 115,
      "start": 2075.3799743652344,
      "end": 2076.8999633789062,
      "text": " and try to keep something going"
    },
    {
      "id": 116,
      "start": 2076.8999633789062,
      "end": 2079.3399658203125,
      "text": " and give more truth."
    },
    {
      "id": 117,
      "start": 2079.3399658203125,
      "end": 2080.3799743652344,
      "text": " There's an app,"
    },
    {
      "id": 118,
      "start": 2080.3799743652344,
      "end": 2082.1399841308594,
      "text": " and some of you don't have smart phones"
    },
    {
      "id": 119,
      "start": 2082.1399841308594,
      "end": 2083.679962158203,
      "text": " and you're saying, I don't want any app."
    },
    {
      "id": 120,
      "start": 2083.679962158203,
      "end": 2084.5999755859375,
      "text": " I don't need any apps."
    },
    {
      "id": 121,
      "start": 2084.5999755859375,
      "end": 2085.4199829101562,
      "text": " I understand."
    },
    {
      "id": 122,
      "start": 2085.4199829101562,
      "end": 2087.5799865722656,
      "text": " I normally don't recommend a whole lot of things"
    },
    {
      "id": 123,
      "start": 2087.6399841308594,
      "end": 2088.47998046875,
      "text": " in that nature,"
    },
    {
      "id": 124,
      "start": 2088.47998046875,
      "end": 2090.679962158203,
      "text": " but there's an app that I would encourage you"
    },
    {
      "id": 125,
      "start": 2090.679962158203,
      "end": 2092.2799682617188,
      "text": " to jot down if you have a smart phone."
    },
    {
      "id": 126,
      "start": 2092.2799682617188,
      "end": 2095.0199584960938,
      "text": " It's called Commission App."
    },
    {
      "id": 127,
      "start": 2095.0199584960938,
      "end": 2098.8199768066406,
      "text": " It's an app that was developed, I guess,"
    },
    {
      "id": 128,
      "start": 2098.8199768066406,
      "end": 2099.9599609375,
      "text": " for lack of better terms."
    },
    {
      "id": 129,
      "start": 2099.9599609375,
      "end": 2101.239959716797,
      "text": " It was probably developed by someone else,"
    },
    {
      "id": 130,
      "start": 2101.239959716797,
      "end": 2106.239959716797,
      "text": " but its purpose was used by Lancaster Baptist Church,"
    },
    {
      "id": 131,
      "start": 2106.8399658203125,
      "end": 2109.5199584960938,
      "text": " West Coast Baptist College out in California."
    },
    {
      "id": 132,
      "start": 2109.5199584960938,
      "end": 2111.0799865722656,
      "text": " And in that particular app,"
    },
    {
      "id": 133,
      "start": 2111.0799865722656,
      "end": 2113.5999755859375,
      "text": " there are opportunities for you to go in there,"
    },
    {
      "id": 134,
      "start": 2113.5999755859375,
      "end": 2116.6199645996094,
      "text": " and I have the app downloaded on my phone,"
    },
    {
      "id": 135,
      "start": 2116.6399841308594,
      "end": 2119.6399841308594,
      "text": " and if you go into that particular app,"
    },
    {
      "id": 136,
      "start": 2119.6399841308594,
      "end": 2123.6399841308594,
      "text": " it opens up and it gives you how to explain salvation,"
    },
    {
      "id": 137,
      "start": 2123.6399841308594,
      "end": 2125.239959716797,
      "text": " how to illustrate salvation,"
    },
    {
      "id": 138,
      "start": 2125.239959716797,
      "end": 2127.4199829101562,
      "text": " and how to explain baptism."
    },
    {
      "id": 139,
      "start": 2127.4199829101562,
      "end": 2129.199981689453,
      "text": " You say, well, I've already prepared,"
    },
    {
      "id": 140,
      "start": 2129.199981689453,
      "end": 2131.719970703125,
      "text": " as we mentioned this morning with the Apostle Paul,"
    },
    {
      "id": 141,
      "start": 2131.719970703125,
      "end": 2134.759979248047,
      "text": " and you're ready and you may not need those helps,"
    },
    {
      "id": 142,
      "start": 2134.759979248047,
      "end": 2136.9599609375,
      "text": " but what I really like about this particular app"
    },
    {
      "id": 143,
      "start": 2136.9599609375,
      "end": 2140.2799682617188,
      "text": " is there's a place where you can put in your prospects,"
    },
    {
      "id": 144,
      "start": 2140.2799682617188,
      "end": 2141.47998046875,
      "text": " the people that you're working with,"
    },
    {
      "id": 145,
      "start": 2141.47998046875,
      "end": 2145.3999633789062,
      "text": " the people that God has allowed you to come in contact with"
    },
    {
      "id": 146,
      "start": 2145.4199829101562,
      "end": 2147.0999755859375,
      "text": " and share the gospel with,"
    },
    {
      "id": 147,
      "start": 2147.0999755859375,
      "end": 2150.739959716797,
      "text": " and you can enter someone within that prospect,"
    },
    {
      "id": 148,
      "start": 2150.739959716797,
      "end": 2152.699981689453,
      "text": " and you can put different notes in there"
    },
    {
      "id": 149,
      "start": 2152.699981689453,
      "end": 2153.8199768066406,
      "text": " and how you're praying for them"
    },
    {
      "id": 150,
      "start": 2153.8199768066406,
      "end": 2155.939971923828,
      "text": " and what your last contact was with them,"
    },
    {
      "id": 151,
      "start": 2155.939971923828,
      "end": 2156.97998046875,
      "text": " and so on and so forth."
    },
    {
      "id": 152,
      "start": 2156.97998046875,
      "end": 2157.8199768066406,
      "text": " Why?"
    },
    {
      "id": 153,
      "start": 2157.8199768066406,
      "end": 2160.939971923828,
      "text": " Because we're serious about this thing of evangelizing,"
    },
    {
      "id": 154,
      "start": 2160.939971923828,
      "end": 2163.699981689453,
      "text": " and we're taking a personal responsibility."
    },
    {
      "id": 155,
      "start": 2163.699981689453,
      "end": 2166.97998046875,
      "text": " And this, I believe, is a great tool that we could use."
    },
    {
      "id": 156,
      "start": 2166.97998046875,
      "end": 2168.5799865722656,
      "text": " You say, I don't have a smartphone."
    },
    {
      "id": 157,
      "start": 2168.5799865722656,
      "end": 2170.2799682617188,
      "text": " Get a notebook."
    },
    {
      "id": 158,
      "start": 2170.2799682617188,
      "end": 2172.259979248047,
      "text": " Get some index cards."
    },
    {
      "id": 159,
      "start": 2172.259979248047,
      "end": 2174.3399658203125,
      "text": " Get something."
    },
    {
      "id": 160,
      "start": 2174.3399658203125,
      "end": 2176.239959716797,
      "text": " I had the privilege of sharing the gospel with this person."
    },
    {
      "id": 161,
      "start": 2176.239959716797,
      "end": 2178.0799865722656,
      "text": " Now pray for him."
    },
    {
      "id": 162,
      "start": 2178.0799865722656,
      "end": 2179.699981689453,
      "text": " Somebody shared a story with me this morning"
    },
    {
      "id": 163,
      "start": 2179.699981689453,
      "end": 2181.47998046875,
      "text": " about sharing a gospel tract,"
    },
    {
      "id": 164,
      "start": 2181.47998046875,
      "end": 2183.439971923828,
      "text": " not even meeting the individual,"
    },
    {
      "id": 165,
      "start": 2183.439971923828,
      "end": 2185.3199768066406,
      "text": " but how that they left the gospel tract"
    },
    {
      "id": 166,
      "start": 2185.3199768066406,
      "end": 2186.6199645996094,
      "text": " in a place in which they knew"
    },
    {
      "id": 167,
      "start": 2186.6199645996094,
      "end": 2188.239959716797,
      "text": " that the individual would receive it,"
    },
    {
      "id": 168,
      "start": 2188.239959716797,
      "end": 2190.6199645996094,
      "text": " and as the individual picked it up and received it,"
    },
    {
      "id": 169,
      "start": 2190.6199645996094,
      "end": 2193.47998046875,
      "text": " they stopped and they prayed for that individual."
    },
    {
      "id": 170,
      "start": 2193.47998046875,
      "end": 2194.999969482422,
      "text": " Praise the Lord."
    },
    {
      "id": 171,
      "start": 2194.999969482422,
      "end": 2198.199981689453,
      "text": " The Holy Spirit of God uses the word of God,"
    },
    {
      "id": 172,
      "start": 2198.199981689453,
      "end": 2199.47998046875,
      "text": " and that's someone that's saying,"
    },
    {
      "id": 173,
      "start": 2199.47998046875,
      "end": 2202.679962158203,
      "text": " I wanna get engaged, involved, personally."
    },
    {
      "id": 174,
      "start": 2203.499969482422,
      "end": 2208.499969482422,
      "text": " I'm so challenged in my own personal walk with the Lord"
    },
    {
      "id": 175,
      "start": 2209.179962158203,
      "end": 2212.0399780273438,
      "text": " with regard to this thing of missions,"
    },
    {
      "id": 176,
      "start": 2212.0399780273438,
      "end": 2213.739959716797,
      "text": " and this responsibility that we have"
    },
    {
      "id": 177,
      "start": 2213.739959716797,
      "end": 2216.0199584960938,
      "text": " to reach people with the gospel."
    },
    {
      "id": 178,
      "start": 2216.0199584960938,
      "end": 2217.7799682617188,
      "text": " Listen, the enemy wants us to get busy"
    },
    {
      "id": 179,
      "start": 2217.7799682617188,
      "end": 2219.4599609375,
      "text": " with all kinds of stuff."
    },
    {
      "id": 180,
      "start": 2220.999969482422,
      "end": 2222.199981689453,
      "text": " He really does."
    },
    {
      "id": 181,
      "start": 2223.8999633789062,
      "end": 2225.179962158203,
      "text": " But souls are dying."
    },
    {
      "id": 182,
      "start": 2226.0999755859375,
      "end": 2227.3799743652344,
      "text": " Who will tell them?"
    },
    {
      "id": 183,
      "start": 2228.4599609375,
      "end": 2229.2999877929688,
      "text": " Amen?"
    },
    {
      "id": 184,
      "start": 2229.2999877929688,
      "end": 2230.1399841308594,
      "text": " Who will tell them?"
    },
    {
      "id": 185,
      "start": 2230.999969482422,
      "end": 2234.239959716797,
      "text": " God gives us unique privilege."
    },
    {
      "id": 186,
      "start": 2235.199981689453,
      "end": 2237.3399658203125,
      "text": " I think about those four leprous men."
    },
    {
      "id": 187,
      "start": 2237.3399658203125,
      "end": 2239.1199645996094,
      "text": " We do not well."
    },
    {
      "id": 188,
      "start": 2239.1199645996094,
      "end": 2240.199981689453,
      "text": " Why?"
    },
    {
      "id": 189,
      "start": 2240.199981689453,
      "end": 2242.9599609375,
      "text": " Because today's a day of good tidings,"
    },
    {
      "id": 190,
      "start": 2242.9599609375,
      "end": 2246.0599670410156,
      "text": " and we hold our peace."
    },
    {
      "id": 191,
      "start": 2247.6399841308594,
      "end": 2249.3599853515625,
      "text": " Let us return."
    },
    {
      "id": 192,
      "start": 2249.3599853515625,
      "end": 2251.2799682617188,
      "text": " Go and tell."
    },
    {
      "id": 193,
      "start": 2251.2799682617188,
      "end": 2253.679962158203,
      "text": " Wow, what a great challenge."
    },
    {
      "id": 194,
      "start": 2253.679962158203,
      "end": 2255.1199645996094,
      "text": " From an Old Testament account,"
    },
    {
      "id": 195,
      "start": 2255.1199645996094,
      "end": 2257.439971923828,
      "text": " a situation in Israel,"
    },
    {
      "id": 196,
      "start": 2257.439971923828,
      "end": 2259.7999877929688,
      "text": " they had been besieged by the Syrians for a long time."
    },
    {
      "id": 197,
      "start": 2260.3399658203125,
      "end": 2262.0999755859375,
      "text": " It was terrible what was going on,"
    },
    {
      "id": 198,
      "start": 2262.0999755859375,
      "end": 2264.0999755859375,
      "text": " but how we can make application for us"
    },
    {
      "id": 199,
      "start": 2264.0999755859375,
      "end": 2266.0199584960938,
      "text": " with regard to the gospel."
    },
    {
      "id": 200,
      "start": 2266.0199584960938,
      "end": 2269.259979248047,
      "text": " Oh, that God would help us to rescue the perishing,"
    },
    {
      "id": 201,
      "start": 2269.259979248047,
      "end": 2270.6599731445312,
      "text": " to care for the dying,"
    },
    {
      "id": 202,
      "start": 2270.6599731445312,
      "end": 2272.8999633789062,
      "text": " to throw out the lifeline,"
    },
    {
      "id": 203,
      "start": 2272.8999633789062,
      "end": 2274.2799682617188,
      "text": " to go and tell."
    },
    {
      "id": 204,
      "start": 2274.2799682617188,
      "end": 2275.1199645996094,
      "text": " Let's pray."
    },
    {
      "id": 205,
      "start": 2275.1199645996094,
      "end": 2276.0599670410156,
      "text": " Father, we love you."
    },
    {
      "id": 206,
      "start": 2276.0599670410156,
      "end": 2277.219970703125,
      "text": " We thank you for loving us."
    },
    {
      "id": 207,
      "start": 2277.219970703125,
      "end": 2281.6599731445312,
      "text": " We thank you for the opportunity that we've had today"
    },
    {
      "id": 208,
      "start": 2281.6599731445312,
      "end": 2286.6599731445312,
      "text": " to just focus a little bit, a lot,"
    },
    {
      "id": 209,
      "start": 2286.759979248047,
      "end": 2290.0799865722656,
      "text": " upon our responsibility as your people."
    },
    {
      "id": 210,
      "start": 2292.2799682617188,
      "end": 2294.0799865722656,
      "text": " God, even as I prayed this morning,"
    },
    {
      "id": 211,
      "start": 2295.199981689453,
      "end": 2299.8599853515625,
      "text": " we're not looking for emotional responses."
    },
    {
      "id": 212,
      "start": 2303.199981689453,
      "end": 2306.1199645996094,
      "text": " We're looking to be changed by the truth of thy Word."
    },
    {
      "id": 213,
      "start": 2309.0399780273438,
      "end": 2310.3599853515625,
      "text": " Help us to not be timid."
    },
    {
      "id": 214,
      "start": 2310.3599853515625,
      "end": 2312.0399780273438,
      "text": " Help us to not be fearful."
    },
    {
      "id": 215,
      "start": 2312.8199768066406,
      "end": 2316.699951171875,
      "text": " Help us to not forbear."
    },
    {
      "id": 216,
      "start": 2318.3399658203125,
      "end": 2320.1799926757812,
      "text": " Help us to be able to say, as Paul said,"
    },
    {
      "id": 217,
      "start": 2320.1799926757812,
      "end": 2323.5999755859375,
      "text": " I have not shunned to declare unto you"
    },
    {
      "id": 218,
      "start": 2323.5999755859375,
      "end": 2325.0999755859375,
      "text": " all the counsel of God."
    },
    {
      "id": 219,
      "start": 2326.2999877929688,
      "end": 2327.6599731445312,
      "text": " Would you help us to have,"
    },
    {
      "id": 220,
      "start": 2331.3399658203125,
      "end": 2333.8199462890625,
      "text": " embrace the responsibility that's been given to us"
    },
    {
      "id": 221,
      "start": 2333.8199462890625,
      "end": 2336.5799560546875,
      "text": " and help us to get involved, engaged personally,"
    },
    {
      "id": 222,
      "start": 2337.5399780273438,
      "end": 2339.6599731445312,
      "text": " whatever level it needs to be,"
    },
    {
      "id": 223,
      "start": 2339.6599731445312,
      "end": 2340.7999877929688,
      "text": " that we just start somewhere,"
    },
    {
      "id": 224,
      "start": 2340.8199462890625,
      "end": 2345.1799926757812,
      "text": " and that today would be a day of new beginnings"
    },
    {
      "id": 225,
      "start": 2345.1799926757812,
      "end": 2347.8599853515625,
      "text": " with regard to this subject of sharing the gospel."
    },
    {
      "id": 226,
      "start": 2348.9400024414062,
      "end": 2350.6599731445312,
      "text": " Pray that you'd work in this time of invitation,"
    },
    {
      "id": 227,
      "start": 2350.6599731445312,
      "end": 2351.5799560546875,
      "text": " and we'll thank you for it."
    },
    {
      "id": 228,
      "start": 2351.5799560546875,
      "end": 2352.4199829101562,
      "text": " In Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-17T06:13:05.722515"
}