{
  "video_id": "P9IertNJ6kQ",
  "text": "And I'm just going to let you know at the very beginning I am not planning to read the entire chapter. You can go back and read it later if you'd like. And I'm not reading the entire chapter because there's about 400 names in this chapter. And I do my best to not get tongue-tied. But with this list of so many, repeated, repeated, repeated, I'll just avoid publicly reading the entirety of the text this evening. And I hope that you will be okay with that tonight. Genesis chapter number 10, if you're looking at verses 1 through 32, obviously, as we look at this passage of Scripture, we find that really it's going to provide us with a list of the descendants of Noah, really the generations of the sons of Noah. This often has been referred to, this text of Scripture has been referred to as the table of nations. And you'll recall, if you actually hold your place there in chapter number 10, turn back to chapter number 4, if you will. And as we studied through the book of Genesis, as we came to the fourth chapter, and really beginning in verse number 17, down through verse number 24, the Bible provided us with a list of the descendants of Cain. We find that as we enter into chapter number 5 of the book of Genesis and look at the entirety of this fifth chapter, that God provides us with the generations of Adam. And really, we find this list that is provided in Genesis chapter number 5, taking us from Adam to Noah through Seth. And now, as we study the 10th chapter of the book of Genesis, we come and we find that in verse number 1, the Bible says, Now these are the generations of the son of Noah, Shem, Ham, and Japheth. And unto them were sons born after the flood. And so we see here the generations of the sons of Noah. I want you to notice how that verse number 1 and verse number 32, the first and last verse of this chapter, really provide us with a level of insight as to the reason that this quote-unquote list is provided to us. We find, as I've read already in verse number 1, it says, Now these are the generations of the sons of Noah, Shem, Ham, and Japheth. And unto them were sons born after the flood. Notice in verse number 32, the Bible says, These are the families of the sons of Noah. After their generations in their nations. And by these were the nations divided in the earth after the flood. It's interesting, as we study the 10th chapter of the book of Genesis, and then, of course, we'll be getting into the 11th chapter in our next study and looking at the first nine verses of chapter number 11. And obviously, we're familiar with Genesis chapter number 11 being the account of the Tower of Babel and the disbursement and so on and so forth. And really, as we begin to look at what's happening between Genesis 10 and the first nine verses of Genesis chapter number 11, we find that Genesis 10 is providing us with an overview of the disbursement, while Genesis chapter number 11 is going to provide us with the details. The reason why, and all of that sort of thing, and we'll see that in the first nine verses as to how God gives us that information. As we're looking here in Genesis chapter number 10, and looking at the division, I'm going to make several comments. I'll give you an outline. The title is adopted from verse number 32, and I've simply titled the message this evening, The Nations Divided After the Flood. The Nations Divided After the Flood. In verses one through five, if you're taking notes, you'll see, first of all, the sons of Japheth. The Bible tells us, in verse number one, that these are the generations of the sons of Noah. And then it tells us, in verse number two, the sons of Japheth, and it begins to give us this list. I want you to pay attention and notice, in verse number five, pay attention to the wording that's used here. The Bible says, in verse number five, by these were the isles of the Gentiles divided in their lands. Everyone after his tongue, after their families, in their nations. Again, as we look at the 10th chapter, and then look at the truth of the 11th chapter, with the Tower of Babel and the disbursement, we find that chapter 10 is providing us with this overview, and then giving us more details in chapter number 11 as to the cause and what God did there in chapter number 11. But as we look here at the sons of Japheth, as it's given to us in verses one through five, we notice the terminology in verse number five, specifically when it talks about the isles of the Gentiles, and we would find that the descendants, if you will, of the sons of Japheth would primarily be those Gentile nations that were settled both north and west of Canaan. And these are the nations that are being referenced here in verses one through five as we look at the sons of Japheth. We then move into verses six through 20. Number two, if you're taking notes, you say you're going fast. I know. We're going to dig into some things as we get into the second and third point here. The second list that is provided to us are the sons of Ham. You'll notice in verse number six that the Bible begins, and the sons of Ham, Cush, Mizraim, Put, and Canaan, and then it ends in verse number 20 by telling us these are the sons of Ham after their families, after their tongues, in their countries, and in their nations. It's very interesting as we look at this portion of Genesis chapter number 10 and looking at verses six through 20 with the descendants, the sons of Ham, that there is one particular individual that is given reference in verses eight through 12, specifically highlighted as Nimrod. Notice with me in verse number eight, the Bible says, and Cush begat Nimrod. He began to be a mighty one in the earth. He was a mighty hunter before the Lord, wherefore it is said, even as Nimrod, the mighty hunter before the Lord. And the beginning of his kingdom was Babel, and Erech, and Eichad, and Calna, and the land of Shinar. And the land went forth Asher, and builded Nineveh, and the city of Rehoboth, and Calah, and Resen. Between Nineveh and Calah the same is a great city. As we look at those verses, and God gives us some specific reference to this one Nimrod, and him being specifically highlighted, we would understand a couple of things. Number one, he was a prominent figure, and he established a great empire. And as we would begin to think about the empire that was created, we find really that the Bible would give us in verse number ten, it says, and the beginning of his kingdom was Babel. We find that these four cities that are mentioned in verse number ten, that were cities in the land of Shinar, that this became really the center place for the Babylonian kingdom. And we understand as we study through the history of the Bible, and we look at Bible history and begin to trace the steps of Israel, and so on and so forth, we understand that Babylon played a very pivotal role in the world history events surrounding the nation of Israel, God's people. And so we find here that the Bible says that these four cities, according to verse number ten, that it was the beginning of his kingdom was Babel. Of course, when we enter into chapter number eleven, we begin to see the truth with regard to Babel there as well. Now it's interesting to note that the Bible mentions to us about this man Nimrod, and how that he would establish these great kingdoms. We notice in verse number four that of Babel, but notice in verse number eleven, excuse me, verse number ten, but then you look in verse number eleven to see the second of these four cities that set up really this next area. Notice it says this, out of that land went forth Asher. Now that's the same Hebrew word that we understand as being Assyria. And we understand that as we look at the text of Scripture and understanding really the generations and the timelines that would pass, how the places, maybe the names of the places would slightly deviate, and so on and so forth, but this is Assyria. The Bible says, builded Nineveh. We know that Nineveh was the capital of Assyria. And as we understand that as God would later use Jonah, remember he was going to go to Nineveh, right? He was the prophet of God that was being sent to Nineveh. And during that time, the Assyrians were really the world power. The Assyrians would soon conquer Israel, the ten tribes of the north, and we understand the Assyrian captivity that is recorded in the Scriptures. And Jonah was called to go to Nineveh, and of course we know that he didn't go immediately, right? He decided that he'd pay a fare and he'd get on a boat and go elsewhere. And yet God dealt with Jonah. Eventually Jonah goes to Nineveh, that great city, cries against it, they have revival. But we understand the wickedness of the people of Nineveh at that particular time in history and understand a little bit as to what's going on in the heart of Jonah there with regard to going to Nineveh. And so we see that Nineveh is mentioned in verse number 11, it then says the city of Rehoboth and Calah, and then it mentions the fourth city, Resin, there in verse number 12. And so we see that as we look at the sons of Ham that are outlined for us in verses 6 through 20, that the Bible tells us, specifically kind of hones in, if you will, on this man Nimrod as being this mighty one. The Bible uses the phrase in verse number 8 that he began to be a mighty one in the earth. Again in verse number 9, he was a mighty hunter before the Lord. And it says that even is Nimrod the mighty hunter before the Lord. This man, really the idea of verses 8 and 9 was the prominence that he had and the strength that he was establishing for himself and for his kingdom. And so we see the reference that is given here with regard to this one Nimrod. It's actually interesting, you don't need to turn there, but I'm gonna reference a passage of Scripture over in the book of Micah, and we find that in Micah chapter number 5 that the Bible is mentioning, we often reference chapter number 5 in verse number 2 with the prophecy that Jesus, the Messiah, would be born in Bethlehem, but it's an interesting reference in Micah 5 in verse number 6 where the Bible says, and they shall waste the land of Assyria with the sword and the land of Nimrod in the entrances thereof. Now I want you to understand something, when we're looking at this passage of Scripture in Genesis chapter number 10, this is obviously Moses the human penman to the Pentateuch and so on and so forth. Early history of mankind, we understand as we mentioned the death of Noah as it's recorded at the end of chapter number 9, that he lived 350 years after the flood, we noted that he died at 950 years old, that the earth at that time was about 2,000 years old, but then you go forward to the time of Micah when he's prophesying, it's somewhere around the 700 BC timeline when he's prophesying. The Bible tells us in the beginning of the book the kings that were ruling during his time, in fact it was during the time of King Ahaz when the Assyrians would take captive the nation of Israel, and it is still referred to by the prophet Micah as being the land of Nimrod in the entrances thereof. And once again as we've mentioned throughout our study so far of the book of Genesis, and really we've made mention many times about the foundational nature of the first 11 chapters of the book of Genesis and how important the foundation is and how many people are attacking the foundation of Genesis 1 through 11. They're seeking to undermine the teaching that we find here within the first 11 chapters of the book of Genesis for the purpose of then unraveling the whole of Scripture. But it's interesting to me that even while Micah is prophesying that he mentions about the land of Nimrod dealing with Assyria, and we come all the way back here to Genesis 10 and we see about this one Nimrod and we see that these two empires, if you will, the Babylonian Empire and the Assyrian Empire being mentioned in verses 10 and verse number 11. Also contained within the passage of Scripture in this second section with the sons of Ham are the descendants of Canaan. Now I made mention of this in our last study in Genesis chapter number 9 when we talked about the prophecy of Noah in verses 25 through 27 of Genesis chapter number 9, and we made note that there was a curse with regard to Canaan. In fact, if you look back in chapter number 9, you find that in verse number 25 that Noah said, \"...cursed be Canaan, a servant of servants shall he be unto his brethren.\" The Canaanites were known for their wickedness and their immorality, and we find that this list of the descendants of Canaan that is given, of course he is a son of Ham, which is a son of Noah, but we see here that the sons of Canaan, that list begins for us in verse number 15 and goes right down through verse number 19. When you begin to see what is said here in these verses of Scripture, some of these names will be familiar to you as to the people groups that you see inhabiting the land of Canaan at the time of the possession led by Joshua as the children of Israel went into the land of promise. Notice in verse 15, \"...and Canaan begat Sidon, his firstborn, and Heth, and the Jebusite.\" You heard about the Sidonians, you heard about the Jebusites, it says, \"...and the Amorite, the Gergesite, the Hivite, the Archite, the Sinite, and the Arvidite, and the Zemurite, and the Hamathite, and afterward were the families of the Canaanites spread abroad. And the border of the Canaanites was from Sidon, as thou comest to Gerir, unto Gaza, as thou goest unto Sodom and Gomorrah, and Adma and Zeboiom, even unto Lashon.\" And so we find that here in the section, the second section here of Genesis chapter number 10, in giving us the generations of the sons of Noah, we see first of all the sons of Japheth, we then see the sons of Ham. Within the context of these verses with regard to the sons of Ham, we're given specific mention to that of Nimrod, and we also are reminded about the Canaanite nations or peoples that had been referenced back in chapter number 9. Now as we move into the latter section of Genesis chapter number 10, number 3 this evening, the sons of Shem. In verses 21 down through verse number 31, God gives us the record of the sons of Shem. It tells us in verse number 21, unto Shem also, and then we find that all of these are going to be referenced, the father of all the children of Eber, the brother of Japheth, the elder, even to him were children born. Notice verse 31, these are the sons of Shem, after their families, after their tongues, in their lands, after their nations. And so we find here the sons of Shem that are listed, and again it's interesting to know, as we look at verse number 25 within the context of the sons of Shem that are listed, notice what the Bible says, and unto Eber were born two sons, the name of the one was Peleg, for in his days was the earth divided, and his brother's name was Joktan. And as we look at verse number 25 and we see that phrase, for in his days was the earth divided, we certainly believe that what is referenced in chapter 11, in verse number 9 specifically, when it says therefore is the name of it called Babel, because the Lord did there confound the language of all the earth, and from thence did the Lord scatter them abroad upon the face of all the earth. And it's interesting as we look at this table of nations that it's often been referred to in chapter number 10 of the book of Genesis, and we understand that here in verses 21 through 31 that the sons of Shem are listed for us. The thing that is interesting about that is that if you look over, and I'm not going to read it in its entirety, but if you look over to chapter number 11 and you look at verses 10 through 26, the Bible begins in verse number 10 by saying this, these are the generations of Shem. Now we just read in chapter number 10 in verses 21 through 31 unto Shem also, and the list is provided of the descendants, and it tells us in verse number 31, these are the sons of Shem. I want you to notice the importance of what is given to us as we will move into chapter number 11 and deal with it in more detail in an upcoming message, but we find that in chapter number 11 in verses 10 through 26 that what's happening is we then see how that the descendants of Shem are again found, the generations of Shem given to us in this passage of Scripture, and as we end the section in verse number 26, notice the Bible says and Terah lived 70 years and begat who? Abram, Nahor, and Haran. And so what's going to happen as we look at this passage of Scripture in Genesis chapter 11 and verses 10 through 26, what we see is going to happen is that really this then becomes the lineage of Christ and what is now in view and becomes the focal point of the historical record of the Bible. In Genesis chapter number 10 we're given this broad overview of all of the descendants, the generations of Noah. It says this, now these are the generations of the sons of Noah, and there's 70 of them in the text, and you look at these 70 different references that are given and you see the overall dividing and the people groups, right, of all of the world, but you find that as we come to chapter number 11 that God is going to, on purpose, He's going to zero in and focus upon the line of Shem as we mentioned in our previous study, that we mentioned how that the Noah, during that prophecy of Noah, that He blessed the Lord God of Shem, and we mentioned how that the Jews are Semitic, they're from the line of Shem, and it's the Messianic line, and we would find that in chapter number 11 that God takes the focus, if you will, all the way down to Abram, and of course Abram becomes who? Abraham, right, the father of the nation of Israel, right, the Hebrew nation. And we see that from Genesis, really the end of chapter 11, as it gives us a few overview statements about the heritage, the family of Abram, if you will, but then starting in chapter number 12, you find that what God is doing is He's giving us that truth with regard to the lineage of Christ and the way in which God would fulfill, by the way, the prophecy that was given in Genesis chapter number 3. And you'll be reminded of that prophecy, I referenced it this morning as well, but in Genesis 3 and verse number 15, God said this, I will put enmity between thee and the woman, and between thy seed and her seed, it shall bruise thy head, and thou shalt bruise his heel. Who is the seed? It's Jesus, Messiah. we understand that Abraham is given a promise of a seed and a land, we understand both of those, but we understand that as we interpret the promise of a seed that is given to Abraham, and we rightly interpret that with the book of Galatians, that he said he didn't say seeds as of many, he said seed as in one, that is Christ. And what a blessing to see how that the Bible will give us and zero in, focus upon the truths, the historical record that God would give us with regard to His people, Israel, and then of course the Messianic line. Throughout the remaining history that is recorded in the Bible, of course the Old Testament provides with us much historical content, we find that really as we look at all of the history that's given, it's how other people groups will interact with God's people. You will read of other nations and other groups of people and you'll read of them, but you're really reading of them as how they interact with the people of God. And of course the line going down through all the way through the Old Testament, of course leading to Messiah, we understand even as we've mentioned in some books like the book of Esther how that Haman had such hatred for the people of God, the Israelites, he wanted to kill them. It wasn't so much that it was just Mordecai, he wanted to get rid of Mordecai, but also the entire nation of Israel. We see the enemy at work, right? The enemy is trying to destroy the line by which Messiah would come. We know that he did not succeed, we know that Messiah came, amen, and what a blessing that is. So as we look at Genesis chapter number 10 and we look at this passage and we see the breakdown that is given to us, I want to focus back as we kind of conclude this evening verses 1 and 32 of Genesis chapter number 10, and I want to take a couple of takeaways. Let me read the two verses to you again and give some takeaways from this passage. Verse number one of Genesis 10, now these are the generations of the sons of Noah, Shem, Ham, and Japheth, and unto them were sons born after the flood. Notice verse 32, these are the families of the sons of Noah after their generations and their nations, and by these were the nations divided in the earth after the flood. Number one takeaway that I want you to see is in both verse number one and verse number 32, there's a phrase that is used that says, after the flood. What is it that God is reminding us of that there was a global flood? We understand that as we looked at these previous passages of scripture in Genesis chapter number 4, in Genesis chapter number 5, about the generations that were provided to us, we find that we come to the time of Noah. Genesis 5 ends with the line of Noah, Noah being 500 years old at that particular time, and then we find that Genesis 6, 7, and 8 deal with the global flood. Chapter number 9, of course, the Noahic Covenant, we dealt with that, but we come to chapter number 10, and on both the first and last verse of this passage of scripture, the Bible uses after the flood. You understand that there are many people today that deny the global flood. There are people today that would deny the fact that there was a Noah's flood. In fact, depending on the company that you are with, if you were to mention something about the flood of Noah's day, there would be some that would mock you for even believing such a thing. It's just reality. That's what we live in today. There have been mockers and scoffers, but we understand that this is nothing new. Amen? Because here, let me remind you of what Peter said in 2 Peter chapter 3, and this is exactly what was happening during that particular time. In 2 Peter chapter number 3, we find that Peter specifically is going to make mention about those scoffers that would come in the last days. It says this in verse number 3 of 2 Peter chapter number 3, knowing this first, that there shall come in the last days scoffers walking after their own lust. And here's what they're going to say. Where is the promise of his coming? It's interesting that they understand, as far as the truth that Peter is giving us, that they understand that Jesus said that he was coming again. It says this in verse number 4, for since the fathers fell asleep, all things continue as they were from the beginning of the creation. But what does Peter do? He says in verse number 5, for this, they willingly are ignorant of that by the word of God, the heavens were of old, and the earth standing out of the water and in the water, verse 6, whereby the world that then was being overflowed with water perished. What is Peter talking about? He's talking about the global flood. He's talking about the flood of Noah's day, Genesis 6 through 8. And we find here, Peter will make mention of this as well in his first epistle, and we'll look at that in just a moment, but it is interesting that as you study the 10th chapter of the book of Genesis, and you think about this that is given to us here in this passage, by these were the nations divided, and we see that they were divided after the flood. These are the sons that were born after the flood. What did God tell Noah and his sons as soon as they got off the ark? Remember, as soon as they got off the ark, the first thing they did was what? They made an offering. We mentioned about the importance of understanding first things first. There was a matter of priority, and that was worship. That's exactly what they did. But as you come into the ninth chapter of the book of Genesis, you find that God gives them instruction. It says, God blessed Noah and his sons and said unto them, be fruitful and multiply and replenish the earth. So not only do we find in Genesis chapter number 10 that there is the truth of a global flood, we find that Noah and his sons, they obeyed the instruction of the Lord. He said, be fruitful and multiply, and we find that God blessed them. No doubt he is the giver of life, and we find that he blessed them, and they did in fact replenish the earth. And it is interesting as we understand that at the time in which we're looking at this particular era, and we look at the phrases again in verse one and verse number 32, it says the sons of Noah after their generations. It says in verse number one, it lists the sons of Noah specifically Shem, Ham, and Japheth. You understand at the end of the flood, there were only eight human beings who survived. That's it. Noah, Mrs. Noah. Everyone says, what was Noah's wife's name? I don't know. No idea. The people out at Answers in Genesis, if you go to the Ark out there, the Ark Encounter, they have given Noah's wife a name. What is it? Emzara. And we first walked in, and I said, Emzara? I'm like, man, I never knew what her name was. I'm trying to find out where it is in the Bible, you know? And then they said, right underneath of it, they said, we really don't know what her name is, but we've just given her a name. So Noah and Mrs. Noah, right? Japheth and Mrs. Japheth, Ham, Mrs. Ham, Shem, and Mrs. Shem. There are eight people that come off of the Ark. Not only do we know that from the account in Genesis, but I want you to look at 1 Peter, chapter number three. We looked at 2 Peter, chapter number three a moment ago to see how that Peter referenced the truth of a global flood. He references that in 1 Peter, chapter number three as well, but he gives us this additional truth with regard to the fact that there are only eight human beings that survived. In 1 Peter, chapter number three, in verse number 20, the Bible says this, which sometime were disobedient when once the long-suffering of God waited in the days of Noah, while the Ark was a preparing wherein few, that is, eight souls were saved by water. There were eight human beings, Noah and his wife, his three sons, and their wives. We made mention, and we find that in Genesis, as we look in chapters six, seven, and eight, the Bible tells us how that all man died. In fact, in Genesis, chapter number seven, in verse number 21, the Bible says, and all flesh died that moved upon the earth, both of fowl and of cattle and of beasts and of every creeping thing that creepeth upon the earth, and every man. Noah was a preacher of righteousness. He didn't have very many people that followed the message that he gave, correct? We find that the Bible tells us, as we look in Genesis, chapter number seven, how that God shut them in. It tells us in Genesis seven, in verse number 16, and they that went in went in, male and female of all flesh, but who went in from a human perspective? It was only Noah, his wife, his three sons, and their wives, and only human beings to enter the Ark. And it was God that shut them in. And we find that the Bible tells us that every man died during the flood. And then we come to Genesis, chapter number 10, and we see that the Bible tells us not only that there was a global flood, but we see once again that there were only eight human beings that survived. you say pastor we know this why are we why are we dealing with this I've had people ask me questions such as this couldn't there have been another group of people somewhere else on the earth no if there were God would have told us if you want to go back even further than that from Noah I've had people ask me this question and they've said it this way how many Adams do you think there were like say this again I mean if you look at the New Testament truth of the second Adam speaking of Christ you know I understand what you're speaking of but they were asking in the in the sense of how many Adams Genesis did God create did he create multitudes of atoms and scatter them all over the earth and no he created one there was one Adam and he saw that he needed a help mate so what did he do made Eve and he brought Eve to her right we understand that and it's important because what's happening is there are so many people that are attacking the foundation of our Bible and here's what they try to do if this can't be trusted if Genesis 1 through 11 can't be trusted then how can you know that John 316 can be trusted now you say wow we we fast-forwarded a lot that's what they want to do okay they don't do it that quickly but that's exactly what they want to do they want to systematically break down the Scriptures they want to undermine what God says they want to provide whatever types of quote-unquote evidences they might have and they try to break down undermine the truth of God's Word so that they eventually can get to the point of Romans 1 where there really is no God so we see that it's important that we understand and really at the the the book ends of this chapter verse 1 and verse 32 that were reminded that there was a flood reminded there are only eight human beings that survived that flood and they only survived because they got on the ark and God protected them reminded of one final truth as we look in Genesis 10 verse 1 and verse 32 notice the Bible says in verse number one now these are the generations of the sons of Noah Shem and Ham a Shem Ham and Japheth excuse me and unto them were sons born after the flood verse 32 these are the families of the sons of Noah after their generations in their nations notice by these who is these that's the eight human being the sons right specifically the six Shem Ham Japheth and their wives it says by these were the nations divided in the earth after the flood and so we find that the Bible teaching that we see in Genesis chapter 10 verses 1 and 32 obviously the details are provided to us as with regard to the the generations and the descendants of these sons the Bible tells us not only that there was a global flood not only that they were obedient not only that there were just simply eight human beings that survived we find that there's only one human race there's only one human race I mentioned this last week actually I didn't preach from Genesis last week so it was a couple of weeks ago when I preached in chapter number nine but we find that in chapter number nine look back if you will it might be on the same page for you it's on a previous page for me but look back at Genesis 9 in verse number 19 it's very similar to what we read in chapter number 32 of chapter 10 where the Bible says these are the three sons of Noah and of them was the whole earth overspread so it's important that we understand there's only one human race we find that all people every human being trace we trace our heritage to the same family we understand that here in the passage of Scripture that God would give us that truth and speak to us about that but I want you to notice the truth that Paul would share that is consistent with what we find in the book of Genesis here in the 10th chapter and even if you would drill back further to Adam and Eve obviously by them you eventually get to Noah and then of course everyone's killed during the flood and so we retrace back to just Noah at that particular point in Acts chapter number 17 now understand in Acts chapter number 17 the Apostle Paul had been faithful preaching he had been in various cities preaching the Word of God and dealing with great levels of persecution and opposition the Bible tells us that they were to leave Berea and they took Paul and they were going to send him to Athens and they were gonna send him there for the purpose of kind of getting some rest if you will and the Apostle Paul is there in Athens and the Bible tells us in verse number 16 of Acts 17 that now while Paul waited for them in Athens his spirit was stirred in him when he saw the city wholly given to idolatry therefore disputed he in the synagogue with the Jews and with the devout persons and in the market daily with them that met with him we don't read the entirety of the passage but we find that the Apostle Paul he sees that Athens is a city that is wholly given to idolatry he mentions as he's preaching he stood in the midst of Mars Hill if you skip down to verse 22 you can see the reference there and he says of them he says I perceive that in all things you're too superstitious he tells him in verse number 23 he says I pass by and behold beheld excuse me your devotions I found an altar with this inscription to the unknown God whom therefore ye ignorantly worship him declare I unto you so God is using the Apostle Paul in the city of Athens a city that was wholly given to idolatry a city that had all of these these false gods these idols they had all of these these altars if you will and they had this altar with the inscription to the unknown God and Paul says I'm gonna declare him unto you and I want you to understand where Paul begins in verse number 24 he says God that made the world and all things therein what does Paul go back to Genesis 1 right God's the Creator so let me go all the way back to Genesis chapter 1 because I'm gonna declare this God Jehovah I'm gonna declare him unto you I'm gonna reveal to you who he is I'm gonna make him known make Christ known we find that this this passage would record for us the way in which Paul deals with it he says seeing that he is Lord of heaven and earth dwelleth not in temples made with hands neither is worshipped with men's hands as though he needed anything saying he giveth to all life and breath and all things verse 26 and that's made of one blood all nations of men for to dwell on all the face of the earth and hath determined the times before appointed and the bounds of their habitation we really look here in in Acts chapter 17 and we see how that the truth of what we find back in the book of Genesis with regard to the overspreading of the earth the population after the flood that which is recorded for us in Genesis chapter number 10 we see that the Apostle Paul as he's preaching to the people in Athens he absolutely without any doubt whatsoever is really confirming for us the truth that we find the book of Genesis he's going all the way back and he's saying listen there's he's made of all nations one blood and so we find that as we look here in Genesis chapter number 10 that yes we find this record of the generations of the sons of Noah and we find that we can go through and we can begin to look at all of the names and try to determine the particular people groups throughout history and kind of see the areas in which they were divided and moved to according to that which took place in Genesis chapter 11 we see some of the highlights that are given with regard to some of the individuals that are mentioned but we find that as we would take away from this passage of scripture that we must be reminded there was indeed a global flood don't let the scoffers cause you to doubt what God has given us in his word you give an inch and they're gonna take a mile just the way it's gonna work and so we must stand on the truth of the fact that yes there was a flood it's recorded in six through eight but we find it referenced here in verse 1 and 32 of our text not only that there are eight human beings that survived they were obedient to the command that God gave in Genesis chapter 9 and there is one human race and all of us every single one of us trace our heritage to the same family if we take a biblical approach it solves a lot of the world's problems amen all of them thank you because Jesus is the answer right what is our God is a God of order I believe that he's not the author of confusion right he's a God of order and we find that as a God of orders you begin to study here in Genesis and other portions of scripture you find that there's order in creation you find that there's order in the institutions that he established there's order in the home God established order there's order in government by the way God ordained government and he gave instruction in order for government and we find that there is order for the church God ordained the church and he gave instruction yeah Paul says to Timothy that thou oughtest that thou knowest how thou oughtest to behave thyself in the church of God which is the the ground and pillar of the truth. And so we find that God is a God of order. The enemy, Satan, is the author of confusion, chaos, right? And so we see the chaos and confusion that exists in our world today, and we find that it can only be perpetuated at the rate in which it's perpetuated because there's an ignorance to the truth of the author of this book. And when we understand the author of this book, that he is a God of order, and we understand that Jesus is the answer and that every one of man's problems are solved by the truth of the Word of God, we can come to an agreement that all of that chaos and confusion can only be dealt with with turning to the Word of God. What's happening in the midst of great levels of chaos and confusion are people trying to perpetuate their solutions, man's solutions. Man's solutions, carnal solutions, cannot solve a heart problem. It's just not possible. You cannot, we find as we look throughout the time of Israel and Judah, and we see the indictments that are laid against them by the prophets and God speaking to them betimes and telling them how that they called evil good and good evil, and you see all of the things that were going on in the nation of Israel and Judah and all of the wickedness, and we find that the answer is a heart issue. Last week I preached a message, the heart of the matter is a matter of the heart. As we look here in Genesis chapter number 10, we find that God gives us important truth. See, when we walk away from the Bible, we cause ourselves more problems. And when we try to then solve those problems apart from the Bible, we just continue to flounder around. And so we must have an agreement. I've often said this, that as Baptist people, we would say if someone were to ask us what our distinctives are, that we would say first and foremost that the Bible is our sole authority for faith and practice. Let's meet at the Word of God. Right? What's the problem? What's the issue? What are we trying to deal with? Okay, let's see what God says. And we take what God says and we just follow it. Well, that doesn't work. Wrong. Why? The Bible transcends time, right? It's an eternal book. It's cross-cultural. Can I tell you that the Bible is not an American book? I shared this with somebody yesterday. I was having a conversation with someone and I said, you know, the Bible wasn't written after the United States of America was set up as a nation. The Bible wasn't the result of having a constitution, a bill of rights, amendments, so on and so forth. The Bible was written well, well, well before that. Amen? And so therefore, the truth of this book works anywhere because it's cross-cultural, it's eternal. And so we must determine that we say, okay, what are the problems in our world today? Are there some problems in our nation today with regard to partiality? Absolutely. The Bible tells us we're all of one blood. It solves it. Amen? It solves it that fast. But man has taken a different approach. And we understand that it is important that we agree with God, that we agree with God. God said it, that settles it. Right? Somebody interjected in between there, God said it, I believe it, that settles it. That's a problem because whether you believe it or not, if God said it, that settles it. You can say, well, I'll tell you what my experience was. I don't care. God said it, that settles it. You say, man, I'm not being unkind, I'm just saying the Bible is the Bible. Amen? And what God said is what God said, and He said what He meant to say. Amen? You ever say something and say, man, that didn't come out right? If you've never said anything that didn't come out the way that you meant to do it, try preaching. Amen? Because you say a whole lot of things. But the reality is that God is perfect. Every word of God is pure. Amen? And so God gives us the answers, and I'm so thankful for that. Genesis chapter number 10, we'll get into chapter number 11 next week looking at the Tower of Babel. Let's pray. Father, we love you. We thank you for loving us. We thank you for the Word of God. We thank you for the truth that's contained therein. We thank you for the table of nations, if you will, that is provided to us here in chapter number 10 that gives us the generations of the sons of Noah. We thank you for how you've provided us with this detail, and we thank you for the reminders, the principles that we find there in verse number 1 and verse number 32. God, I pray that you'd help us to believe your Word, to practice your Word, to live by your Word. We know that the Bible has the answer for man's problems. The problems in our nation, in our world, are many. God, I pray that you would help us as your people to take the approach of answering those questions with what thus saith the Lord. We thank you for giving us the Bible. We thank you for allowing us to have it. It's been perfectly preserved for us, and what a joy that is. I pray that you'd help us to be, as we've often been referred to in years gone by, people of the book. Pray that you'd have your will and way in our hearts this night, and we'll thank you for it. In Christ's name we pray, amen. Would you stand with me? Heads are bowed, eyes are closed. We'll have a brief invitation.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.0,
      "text": " And I'm just going to let you know at the very beginning I am not planning to read the entire chapter."
    },
    {
      "id": 1,
      "start": 5.0,
      "end": 8.0,
      "text": " You can go back and read it later if you'd like."
    },
    {
      "id": 2,
      "start": 8.0,
      "end": 13.0,
      "text": " And I'm not reading the entire chapter because there's about 400 names in this chapter."
    },
    {
      "id": 3,
      "start": 13.0,
      "end": 16.0,
      "text": " And I do my best to not get tongue-tied."
    },
    {
      "id": 4,
      "start": 16.0,
      "end": 20.0,
      "text": " But with this list of so many, repeated, repeated, repeated,"
    },
    {
      "id": 5,
      "start": 20.0,
      "end": 25.0,
      "text": " I'll just avoid publicly reading the entirety of the text this evening."
    },
    {
      "id": 6,
      "start": 25.0,
      "end": 28.0,
      "text": " And I hope that you will be okay with that tonight."
    },
    {
      "id": 7,
      "start": 28.0,
      "end": 31.0,
      "text": " Genesis chapter number 10, if you're looking at verses 1 through 32,"
    },
    {
      "id": 8,
      "start": 31.0,
      "end": 35.0,
      "text": " obviously, as we look at this passage of Scripture,"
    },
    {
      "id": 9,
      "start": 35.0,
      "end": 41.0,
      "text": " we find that really it's going to provide us with a list of the descendants of Noah,"
    },
    {
      "id": 10,
      "start": 41.0,
      "end": 44.0,
      "text": " really the generations of the sons of Noah."
    },
    {
      "id": 11,
      "start": 44.0,
      "end": 49.0,
      "text": " This often has been referred to, this text of Scripture has been referred to as the table of nations."
    },
    {
      "id": 12,
      "start": 49.0,
      "end": 53.0,
      "text": " And you'll recall, if you actually hold your place there in chapter number 10,"
    },
    {
      "id": 13,
      "start": 53.0,
      "end": 55.0,
      "text": " turn back to chapter number 4, if you will."
    },
    {
      "id": 14,
      "start": 56.0,
      "end": 60.0,
      "text": " And as we studied through the book of Genesis, as we came to the fourth chapter,"
    },
    {
      "id": 15,
      "start": 60.0,
      "end": 64.0,
      "text": " and really beginning in verse number 17, down through verse number 24,"
    },
    {
      "id": 16,
      "start": 64.0,
      "end": 69.0,
      "text": " the Bible provided us with a list of the descendants of Cain."
    },
    {
      "id": 17,
      "start": 69.0,
      "end": 73.0,
      "text": " We find that as we enter into chapter number 5 of the book of Genesis"
    },
    {
      "id": 18,
      "start": 73.0,
      "end": 76.0,
      "text": " and look at the entirety of this fifth chapter,"
    },
    {
      "id": 19,
      "start": 76.0,
      "end": 79.0,
      "text": " that God provides us with the generations of Adam."
    },
    {
      "id": 20,
      "start": 79.0,
      "end": 83.0,
      "text": " And really, we find this list that is provided in Genesis chapter number 5,"
    },
    {
      "id": 21,
      "start": 83.0,
      "end": 87.0,
      "text": " taking us from Adam to Noah through Seth."
    },
    {
      "id": 22,
      "start": 87.0,
      "end": 91.0,
      "text": " And now, as we study the 10th chapter of the book of Genesis,"
    },
    {
      "id": 23,
      "start": 91.0,
      "end": 95.0,
      "text": " we come and we find that in verse number 1, the Bible says,"
    },
    {
      "id": 24,
      "start": 95.0,
      "end": 100.0,
      "text": " Now these are the generations of the son of Noah, Shem, Ham, and Japheth."
    },
    {
      "id": 25,
      "start": 100.0,
      "end": 104.0,
      "text": " And unto them were sons born after the flood."
    },
    {
      "id": 26,
      "start": 104.0,
      "end": 108.0,
      "text": " And so we see here the generations of the sons of Noah."
    },
    {
      "id": 27,
      "start": 108.0,
      "end": 112.0,
      "text": " I want you to notice how that verse number 1 and verse number 32,"
    },
    {
      "id": 28,
      "start": 112.0,
      "end": 115.0,
      "text": " the first and last verse of this chapter,"
    },
    {
      "id": 29,
      "start": 115.0,
      "end": 119.0,
      "text": " really provide us with a level of insight as to the reason"
    },
    {
      "id": 30,
      "start": 119.0,
      "end": 122.0,
      "text": " that this quote-unquote list is provided to us."
    },
    {
      "id": 31,
      "start": 122.0,
      "end": 125.0,
      "text": " We find, as I've read already in verse number 1, it says,"
    },
    {
      "id": 32,
      "start": 125.0,
      "end": 129.0,
      "text": " Now these are the generations of the sons of Noah, Shem, Ham, and Japheth."
    },
    {
      "id": 33,
      "start": 129.0,
      "end": 133.0,
      "text": " And unto them were sons born after the flood."
    },
    {
      "id": 34,
      "start": 133.0,
      "end": 136.0,
      "text": " Notice in verse number 32, the Bible says,"
    },
    {
      "id": 35,
      "start": 136.0,
      "end": 139.0,
      "text": " These are the families of the sons of Noah."
    },
    {
      "id": 36,
      "start": 140.0,
      "end": 143.0,
      "text": " After their generations in their nations."
    },
    {
      "id": 37,
      "start": 143.0,
      "end": 149.0,
      "text": " And by these were the nations divided in the earth after the flood."
    },
    {
      "id": 38,
      "start": 149.0,
      "end": 152.0,
      "text": " It's interesting, as we study the 10th chapter of the book of Genesis,"
    },
    {
      "id": 39,
      "start": 152.0,
      "end": 155.0,
      "text": " and then, of course, we'll be getting into the 11th chapter in our next study"
    },
    {
      "id": 40,
      "start": 155.0,
      "end": 158.0,
      "text": " and looking at the first nine verses of chapter number 11."
    },
    {
      "id": 41,
      "start": 158.0,
      "end": 161.0,
      "text": " And obviously, we're familiar with Genesis chapter number 11"
    },
    {
      "id": 42,
      "start": 161.0,
      "end": 166.0,
      "text": " being the account of the Tower of Babel and the disbursement and so on and so forth."
    },
    {
      "id": 43,
      "start": 166.0,
      "end": 169.0,
      "text": " And really, as we begin to look at what's happening between Genesis 10"
    },
    {
      "id": 44,
      "start": 169.0,
      "end": 173.0,
      "text": " and the first nine verses of Genesis chapter number 11,"
    },
    {
      "id": 45,
      "start": 173.0,
      "end": 178.0,
      "text": " we find that Genesis 10 is providing us with an overview of the disbursement,"
    },
    {
      "id": 46,
      "start": 178.0,
      "end": 182.0,
      "text": " while Genesis chapter number 11 is going to provide us with the details."
    },
    {
      "id": 47,
      "start": 182.0,
      "end": 185.0,
      "text": " The reason why, and all of that sort of thing,"
    },
    {
      "id": 48,
      "start": 185.0,
      "end": 190.0,
      "text": " and we'll see that in the first nine verses as to how God gives us that information."
    },
    {
      "id": 49,
      "start": 190.0,
      "end": 193.0,
      "text": " As we're looking here in Genesis chapter number 10,"
    },
    {
      "id": 50,
      "start": 193.0,
      "end": 196.0,
      "text": " and looking at the division, I'm going to make several comments."
    },
    {
      "id": 51,
      "start": 196.0,
      "end": 200.0,
      "text": " I'll give you an outline. The title is adopted from verse number 32,"
    },
    {
      "id": 52,
      "start": 200.0,
      "end": 202.0,
      "text": " and I've simply titled the message this evening,"
    },
    {
      "id": 53,
      "start": 202.0,
      "end": 206.0,
      "text": " The Nations Divided After the Flood."
    },
    {
      "id": 54,
      "start": 206.0,
      "end": 209.0,
      "text": " The Nations Divided After the Flood."
    },
    {
      "id": 55,
      "start": 209.0,
      "end": 212.0,
      "text": " In verses one through five, if you're taking notes,"
    },
    {
      "id": 56,
      "start": 212.0,
      "end": 214.0,
      "text": " you'll see, first of all, the sons of Japheth."
    },
    {
      "id": 57,
      "start": 214.0,
      "end": 217.0,
      "text": " The Bible tells us, in verse number one,"
    },
    {
      "id": 58,
      "start": 217.0,
      "end": 220.0,
      "text": " that these are the generations of the sons of Noah."
    },
    {
      "id": 59,
      "start": 220.0,
      "end": 222.0,
      "text": " And then it tells us, in verse number two,"
    },
    {
      "id": 60,
      "start": 222.0,
      "end": 225.0,
      "text": " the sons of Japheth, and it begins to give us this list."
    },
    {
      "id": 61,
      "start": 225.0,
      "end": 229.0,
      "text": " I want you to pay attention and notice, in verse number five,"
    },
    {
      "id": 62,
      "start": 229.0,
      "end": 231.0,
      "text": " pay attention to the wording that's used here."
    },
    {
      "id": 63,
      "start": 231.0,
      "end": 233.0,
      "text": " The Bible says, in verse number five,"
    },
    {
      "id": 64,
      "start": 233.0,
      "end": 239.0,
      "text": " by these were the isles of the Gentiles divided in their lands."
    },
    {
      "id": 65,
      "start": 239.0,
      "end": 244.0,
      "text": " Everyone after his tongue, after their families, in their nations."
    },
    {
      "id": 66,
      "start": 244.0,
      "end": 246.0,
      "text": " Again, as we look at the 10th chapter,"
    },
    {
      "id": 67,
      "start": 246.0,
      "end": 249.0,
      "text": " and then look at the truth of the 11th chapter,"
    },
    {
      "id": 68,
      "start": 249.0,
      "end": 252.0,
      "text": " with the Tower of Babel and the disbursement,"
    },
    {
      "id": 69,
      "start": 252.0,
      "end": 255.0,
      "text": " we find that chapter 10 is providing us with this overview,"
    },
    {
      "id": 70,
      "start": 255.0,
      "end": 258.0,
      "text": " and then giving us more details in chapter number 11"
    },
    {
      "id": 71,
      "start": 258.0,
      "end": 262.0,
      "text": " as to the cause and what God did there in chapter number 11."
    },
    {
      "id": 72,
      "start": 262.0,
      "end": 264.0,
      "text": " But as we look here at the sons of Japheth,"
    },
    {
      "id": 73,
      "start": 264.0,
      "end": 266.0,
      "text": " as it's given to us in verses one through five,"
    },
    {
      "id": 74,
      "start": 266.0,
      "end": 269.0,
      "text": " we notice the terminology in verse number five,"
    },
    {
      "id": 75,
      "start": 269.0,
      "end": 272.0,
      "text": " specifically when it talks about the isles of the Gentiles,"
    },
    {
      "id": 76,
      "start": 272.0,
      "end": 275.0,
      "text": " and we would find that the descendants, if you will,"
    },
    {
      "id": 77,
      "start": 275.0,
      "end": 278.0,
      "text": " of the sons of Japheth would primarily be those Gentile nations"
    },
    {
      "id": 78,
      "start": 278.0,
      "end": 281.0,
      "text": " that were settled both north and west of Canaan."
    },
    {
      "id": 79,
      "start": 281.0,
      "end": 285.0,
      "text": " And these are the nations that are being referenced here"
    },
    {
      "id": 80,
      "start": 285.0,
      "end": 288.0,
      "text": " in verses one through five as we look at the sons of Japheth."
    },
    {
      "id": 81,
      "start": 288.0,
      "end": 291.0,
      "text": " We then move into verses six through 20."
    },
    {
      "id": 82,
      "start": 291.0,
      "end": 294.0,
      "text": " Number two, if you're taking notes, you say you're going fast."
    },
    {
      "id": 83,
      "start": 294.0,
      "end": 296.0,
      "text": " I know. We're going to dig into some things"
    },
    {
      "id": 84,
      "start": 296.0,
      "end": 299.0,
      "text": " as we get into the second and third point here."
    },
    {
      "id": 85,
      "start": 299.0,
      "end": 303.0,
      "text": " The second list that is provided to us are the sons of Ham."
    },
    {
      "id": 86,
      "start": 303.0,
      "end": 307.0,
      "text": " You'll notice in verse number six that the Bible begins,"
    },
    {
      "id": 87,
      "start": 307.0,
      "end": 311.0,
      "text": " and the sons of Ham, Cush, Mizraim, Put, and Canaan,"
    },
    {
      "id": 88,
      "start": 311.0,
      "end": 314.0,
      "text": " and then it ends in verse number 20 by telling us"
    },
    {
      "id": 89,
      "start": 314.0,
      "end": 317.0,
      "text": " these are the sons of Ham after their families,"
    },
    {
      "id": 90,
      "start": 317.0,
      "end": 322.0,
      "text": " after their tongues, in their countries, and in their nations."
    },
    {
      "id": 91,
      "start": 322.0,
      "end": 327.0,
      "text": " It's very interesting as we look at this portion of Genesis chapter number 10"
    },
    {
      "id": 92,
      "start": 327.0,
      "end": 330.0,
      "text": " and looking at verses six through 20 with the descendants,"
    },
    {
      "id": 93,
      "start": 330.0,
      "end": 334.0,
      "text": " the sons of Ham, that there is one particular individual"
    },
    {
      "id": 94,
      "start": 334.0,
      "end": 337.0,
      "text": " that is given reference in verses eight through 12,"
    },
    {
      "id": 95,
      "start": 337.0,
      "end": 340.0,
      "text": " specifically highlighted as Nimrod."
    },
    {
      "id": 96,
      "start": 340.0,
      "end": 343.0,
      "text": " Notice with me in verse number eight, the Bible says,"
    },
    {
      "id": 97,
      "start": 343.0,
      "end": 345.0,
      "text": " and Cush begat Nimrod."
    },
    {
      "id": 98,
      "start": 345.0,
      "end": 348.0,
      "text": " He began to be a mighty one in the earth."
    },
    {
      "id": 99,
      "start": 348.0,
      "end": 350.0,
      "text": " He was a mighty hunter before the Lord,"
    },
    {
      "id": 100,
      "start": 350.0,
      "end": 355.0,
      "text": " wherefore it is said, even as Nimrod, the mighty hunter before the Lord."
    },
    {
      "id": 101,
      "start": 355.0,
      "end": 357.0,
      "text": " And the beginning of his kingdom was Babel,"
    },
    {
      "id": 102,
      "start": 357.0,
      "end": 361.0,
      "text": " and Erech, and Eichad, and Calna, and the land of Shinar."
    },
    {
      "id": 103,
      "start": 361.0,
      "end": 364.0,
      "text": " And the land went forth Asher, and builded Nineveh,"
    },
    {
      "id": 104,
      "start": 364.0,
      "end": 367.0,
      "text": " and the city of Rehoboth, and Calah, and Resen."
    },
    {
      "id": 105,
      "start": 367.0,
      "end": 371.0,
      "text": " Between Nineveh and Calah the same is a great city."
    },
    {
      "id": 106,
      "start": 371.0,
      "end": 376.0,
      "text": " As we look at those verses, and God gives us some specific reference"
    },
    {
      "id": 107,
      "start": 376.0,
      "end": 380.0,
      "text": " to this one Nimrod, and him being specifically highlighted,"
    },
    {
      "id": 108,
      "start": 380.0,
      "end": 382.0,
      "text": " we would understand a couple of things."
    },
    {
      "id": 109,
      "start": 382.0,
      "end": 387.0,
      "text": " Number one, he was a prominent figure, and he established a great empire."
    },
    {
      "id": 110,
      "start": 388.0,
      "end": 391.0,
      "text": " And as we would begin to think about the empire that was created,"
    },
    {
      "id": 111,
      "start": 391.0,
      "end": 395.0,
      "text": " we find really that the Bible would give us in verse number ten,"
    },
    {
      "id": 112,
      "start": 395.0,
      "end": 400.0,
      "text": " it says, and the beginning of his kingdom was Babel."
    },
    {
      "id": 113,
      "start": 400.0,
      "end": 405.0,
      "text": " We find that these four cities that are mentioned in verse number ten,"
    },
    {
      "id": 114,
      "start": 405.0,
      "end": 408.0,
      "text": " that were cities in the land of Shinar,"
    },
    {
      "id": 115,
      "start": 408.0,
      "end": 413.0,
      "text": " that this became really the center place for the Babylonian kingdom."
    },
    {
      "id": 116,
      "start": 413.0,
      "end": 417.0,
      "text": " And we understand as we study through the history of the Bible,"
    },
    {
      "id": 117,
      "start": 417.0,
      "end": 422.0,
      "text": " and we look at Bible history and begin to trace the steps of Israel,"
    },
    {
      "id": 118,
      "start": 422.0,
      "end": 427.0,
      "text": " and so on and so forth, we understand that Babylon played a very pivotal role"
    },
    {
      "id": 119,
      "start": 427.0,
      "end": 432.0,
      "text": " in the world history events surrounding the nation of Israel, God's people."
    },
    {
      "id": 120,
      "start": 432.0,
      "end": 436.0,
      "text": " And so we find here that the Bible says that these four cities,"
    },
    {
      "id": 121,
      "start": 436.0,
      "end": 441.0,
      "text": " according to verse number ten, that it was the beginning of his kingdom was Babel."
    },
    {
      "id": 122,
      "start": 441.0,
      "end": 444.0,
      "text": " Of course, when we enter into chapter number eleven,"
    },
    {
      "id": 123,
      "start": 444.0,
      "end": 448.0,
      "text": " we begin to see the truth with regard to Babel there as well."
    },
    {
      "id": 124,
      "start": 448.0,
      "end": 453.0,
      "text": " Now it's interesting to note that the Bible mentions to us about this man Nimrod,"
    },
    {
      "id": 125,
      "start": 453.0,
      "end": 457.0,
      "text": " and how that he would establish these great kingdoms."
    },
    {
      "id": 126,
      "start": 457.0,
      "end": 459.0,
      "text": " We notice in verse number four that of Babel,"
    },
    {
      "id": 127,
      "start": 459.0,
      "end": 462.0,
      "text": " but notice in verse number eleven, excuse me, verse number ten,"
    },
    {
      "id": 128,
      "start": 462.0,
      "end": 466.0,
      "text": " but then you look in verse number eleven to see the second of these four cities"
    },
    {
      "id": 129,
      "start": 466.0,
      "end": 469.0,
      "text": " that set up really this next area."
    },
    {
      "id": 130,
      "start": 469.0,
      "end": 473.0,
      "text": " Notice it says this, out of that land went forth Asher."
    },
    {
      "id": 131,
      "start": 473.0,
      "end": 477.0,
      "text": " Now that's the same Hebrew word that we understand as being Assyria."
    },
    {
      "id": 132,
      "start": 477.0,
      "end": 480.0,
      "text": " And we understand that as we look at the text of Scripture"
    },
    {
      "id": 133,
      "start": 480.0,
      "end": 485.0,
      "text": " and understanding really the generations and the timelines that would pass,"
    },
    {
      "id": 134,
      "start": 485.0,
      "end": 490.0,
      "text": " how the places, maybe the names of the places would slightly deviate,"
    },
    {
      "id": 135,
      "start": 490.0,
      "end": 493.0,
      "text": " and so on and so forth, but this is Assyria."
    },
    {
      "id": 136,
      "start": 493.0,
      "end": 495.0,
      "text": " The Bible says, builded Nineveh."
    },
    {
      "id": 137,
      "start": 495.0,
      "end": 498.0,
      "text": " We know that Nineveh was the capital of Assyria."
    },
    {
      "id": 138,
      "start": 498.0,
      "end": 502.0,
      "text": " And as we understand that as God would later use Jonah,"
    },
    {
      "id": 139,
      "start": 502.0,
      "end": 505.0,
      "text": " remember he was going to go to Nineveh, right?"
    },
    {
      "id": 140,
      "start": 505.0,
      "end": 508.0,
      "text": " He was the prophet of God that was being sent to Nineveh."
    },
    {
      "id": 141,
      "start": 508.0,
      "end": 513.0,
      "text": " And during that time, the Assyrians were really the world power."
    },
    {
      "id": 142,
      "start": 513.0,
      "end": 518.0,
      "text": " The Assyrians would soon conquer Israel, the ten tribes of the north,"
    },
    {
      "id": 143,
      "start": 518.0,
      "end": 522.0,
      "text": " and we understand the Assyrian captivity that is recorded in the Scriptures."
    },
    {
      "id": 144,
      "start": 522.0,
      "end": 525.0,
      "text": " And Jonah was called to go to Nineveh,"
    },
    {
      "id": 145,
      "start": 525.0,
      "end": 528.0,
      "text": " and of course we know that he didn't go immediately, right?"
    },
    {
      "id": 146,
      "start": 528.0,
      "end": 532.0,
      "text": " He decided that he'd pay a fare and he'd get on a boat and go elsewhere."
    },
    {
      "id": 147,
      "start": 532.0,
      "end": 535.0,
      "text": " And yet God dealt with Jonah."
    },
    {
      "id": 148,
      "start": 535.0,
      "end": 538.0,
      "text": " Eventually Jonah goes to Nineveh, that great city,"
    },
    {
      "id": 149,
      "start": 538.0,
      "end": 541.0,
      "text": " cries against it, they have revival."
    },
    {
      "id": 150,
      "start": 541.0,
      "end": 544.0,
      "text": " But we understand the wickedness of the people of Nineveh"
    },
    {
      "id": 151,
      "start": 544.0,
      "end": 548.0,
      "text": " at that particular time in history and understand a little bit"
    },
    {
      "id": 152,
      "start": 548.0,
      "end": 551.0,
      "text": " as to what's going on in the heart of Jonah"
    },
    {
      "id": 153,
      "start": 551.0,
      "end": 554.0,
      "text": " there with regard to going to Nineveh."
    },
    {
      "id": 154,
      "start": 554.0,
      "end": 556.0,
      "text": " And so we see that Nineveh is mentioned in verse number 11,"
    },
    {
      "id": 155,
      "start": 556.0,
      "end": 558.0,
      "text": " it then says the city of Rehoboth and Calah,"
    },
    {
      "id": 156,
      "start": 558.0,
      "end": 562.0,
      "text": " and then it mentions the fourth city, Resin, there in verse number 12."
    },
    {
      "id": 157,
      "start": 562.0,
      "end": 565.0,
      "text": " And so we see that as we look at the sons of Ham"
    },
    {
      "id": 158,
      "start": 565.0,
      "end": 568.0,
      "text": " that are outlined for us in verses 6 through 20,"
    },
    {
      "id": 159,
      "start": 568.0,
      "end": 573.0,
      "text": " that the Bible tells us, specifically kind of hones in, if you will,"
    },
    {
      "id": 160,
      "start": 573.0,
      "end": 577.0,
      "text": " on this man Nimrod as being this mighty one."
    },
    {
      "id": 161,
      "start": 577.0,
      "end": 579.0,
      "text": " The Bible uses the phrase in verse number 8"
    },
    {
      "id": 162,
      "start": 579.0,
      "end": 581.0,
      "text": " that he began to be a mighty one in the earth."
    },
    {
      "id": 163,
      "start": 581.0,
      "end": 585.0,
      "text": " Again in verse number 9, he was a mighty hunter before the Lord."
    },
    {
      "id": 164,
      "start": 585.0,
      "end": 589.0,
      "text": " And it says that even is Nimrod the mighty hunter before the Lord."
    },
    {
      "id": 165,
      "start": 589.0,
      "end": 592.0,
      "text": " This man, really the idea of verses 8 and 9"
    },
    {
      "id": 166,
      "start": 592.0,
      "end": 595.0,
      "text": " was the prominence that he had"
    },
    {
      "id": 167,
      "start": 595.0,
      "end": 600.0,
      "text": " and the strength that he was establishing for himself and for his kingdom."
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 605.1199998855591,
      "text": " And so we see the reference that is given here with regard to this one"
    },
    {
      "id": 1,
      "start": 605.1199998855591,
      "end": 608.6400003433228,
      "text": " Nimrod. It's actually interesting, you don't need to turn there, but I'm gonna"
    },
    {
      "id": 2,
      "start": 608.6400003433228,
      "end": 614.079999923706,
      "text": " reference a passage of Scripture over in the book of Micah, and we find that in"
    },
    {
      "id": 3,
      "start": 614.079999923706,
      "end": 619.6000003814697,
      "text": " Micah chapter number 5 that the Bible is mentioning, we often reference chapter"
    },
    {
      "id": 4,
      "start": 619.6000003814697,
      "end": 624.6000003814697,
      "text": " number 5 in verse number 2 with the prophecy that Jesus, the Messiah, would be"
    },
    {
      "id": 5,
      "start": 624.6000003814697,
      "end": 628.6399993896484,
      "text": " born in Bethlehem, but it's an interesting reference in Micah 5 in"
    },
    {
      "id": 6,
      "start": 628.6399993896484,
      "end": 632.7999992370605,
      "text": " verse number 6 where the Bible says, and they shall waste the land of Assyria"
    },
    {
      "id": 7,
      "start": 632.7999992370605,
      "end": 639.1599998474121,
      "text": " with the sword and the land of Nimrod in the entrances thereof. Now I want you to"
    },
    {
      "id": 8,
      "start": 639.1599998474121,
      "end": 643.0800018310547,
      "text": " understand something, when we're looking at this passage of Scripture in Genesis"
    },
    {
      "id": 9,
      "start": 643.0800018310547,
      "end": 648.5999984741211,
      "text": " chapter number 10, this is obviously Moses the human penman to the Pentateuch"
    },
    {
      "id": 10,
      "start": 648.5999984741211,
      "end": 653.3199996948242,
      "text": " and so on and so forth. Early history of mankind, we understand as we mentioned"
    },
    {
      "id": 11,
      "start": 653.3199996948242,
      "end": 658.4000015258789,
      "text": " the death of Noah as it's recorded at the end of chapter number 9, that he"
    },
    {
      "id": 12,
      "start": 658.4000015258789,
      "end": 664.5599975585938,
      "text": " lived 350 years after the flood, we noted that he died at 950 years old, that"
    },
    {
      "id": 13,
      "start": 664.5599975585938,
      "end": 669.2399978637695,
      "text": " the earth at that time was about 2,000 years old, but then you go forward to the"
    },
    {
      "id": 14,
      "start": 669.2399978637695,
      "end": 676.4000015258789,
      "text": " time of Micah when he's prophesying, it's somewhere around the 700 BC timeline"
    },
    {
      "id": 15,
      "start": 676.4000015258789,
      "end": 680.7200012207031,
      "text": " when he's prophesying. The Bible tells us in the beginning of the book the kings"
    },
    {
      "id": 16,
      "start": 680.7200012207031,
      "end": 686.2399978637695,
      "text": " that were ruling during his time, in fact it was during the time of King Ahaz when"
    },
    {
      "id": 17,
      "start": 686.2399978637695,
      "end": 691.3600006103516,
      "text": " the Assyrians would take captive the nation of Israel, and it is still"
    },
    {
      "id": 18,
      "start": 691.3600006103516,
      "end": 697.7200012207031,
      "text": " referred to by the prophet Micah as being the land of Nimrod in the"
    },
    {
      "id": 19,
      "start": 697.7200012207031,
      "end": 703.879997253418,
      "text": " entrances thereof. And once again as we've mentioned throughout our study so"
    },
    {
      "id": 20,
      "start": 703.879997253418,
      "end": 708.2799987792969,
      "text": " far of the book of Genesis, and really we've made mention many times about the"
    },
    {
      "id": 21,
      "start": 708.2799987792969,
      "end": 713.5599975585938,
      "text": " foundational nature of the first 11 chapters of the book of Genesis and how"
    },
    {
      "id": 22,
      "start": 713.5599975585938,
      "end": 719.9199981689453,
      "text": " important the foundation is and how many people are attacking the foundation"
    },
    {
      "id": 23,
      "start": 719.9199981689453,
      "end": 725.5999984741211,
      "text": " of Genesis 1 through 11. They're seeking to undermine the teaching that we find"
    },
    {
      "id": 24,
      "start": 725.5999984741211,
      "end": 730.6799926757812,
      "text": " here within the first 11 chapters of the book of Genesis for the purpose of then"
    },
    {
      "id": 25,
      "start": 730.6799926757812,
      "end": 735.4400024414062,
      "text": " unraveling the whole of Scripture. But it's interesting to me that even while"
    },
    {
      "id": 26,
      "start": 735.4400024414062,
      "end": 741.2400054931641,
      "text": " Micah is prophesying that he mentions about the land of Nimrod dealing with"
    },
    {
      "id": 27,
      "start": 741.2400054931641,
      "end": 745.8399963378906,
      "text": " Assyria, and we come all the way back here to Genesis 10 and we see about this"
    },
    {
      "id": 28,
      "start": 745.8399963378906,
      "end": 751.6399993896484,
      "text": " one Nimrod and we see that these two empires, if you will, the Babylonian"
    },
    {
      "id": 29,
      "start": 751.6399993896484,
      "end": 756.4400024414062,
      "text": " Empire and the Assyrian Empire being mentioned in verses 10 and verse number"
    },
    {
      "id": 30,
      "start": 756.4400024414062,
      "end": 762.3600006103516,
      "text": " 11. Also contained within the passage of Scripture in this second section with"
    },
    {
      "id": 31,
      "start": 762.3600006103516,
      "end": 768.2400054931641,
      "text": " the sons of Ham are the descendants of Canaan. Now I made mention of this in our"
    },
    {
      "id": 32,
      "start": 768.2400054931641,
      "end": 773.0399932861328,
      "text": " last study in Genesis chapter number 9 when we talked about the prophecy of"
    },
    {
      "id": 33,
      "start": 773.0399932861328,
      "end": 779.1999969482422,
      "text": " Noah in verses 25 through 27 of Genesis chapter number 9, and we made note that"
    },
    {
      "id": 34,
      "start": 779.1999969482422,
      "end": 783.5200042724609,
      "text": " there was a curse with regard to Canaan. In fact, if you look back in chapter"
    },
    {
      "id": 35,
      "start": 783.5200042724609,
      "end": 787.3600006103516,
      "text": " number 9, you find that in verse number 25 that Noah said,"
    },
    {
      "id": 36,
      "start": 787.3600006103516,
      "end": 793.8000030517578,
      "text": " \"...cursed be Canaan, a servant of servants shall he be unto his brethren.\" The"
    },
    {
      "id": 37,
      "start": 793.8000030517578,
      "end": 797.6000061035156,
      "text": " Canaanites were known for their wickedness and their immorality, and we"
    },
    {
      "id": 38,
      "start": 797.6000061035156,
      "end": 803.2799987792969,
      "text": " find that this list of the descendants of Canaan that is given, of course he is"
    },
    {
      "id": 39,
      "start": 803.2799987792969,
      "end": 809.6000061035156,
      "text": " a son of Ham, which is a son of Noah, but we see here that the sons of Canaan, that"
    },
    {
      "id": 40,
      "start": 809.6000061035156,
      "end": 814.4400024414062,
      "text": " list begins for us in verse number 15 and goes right down through verse number"
    },
    {
      "id": 41,
      "start": 814.4400024414062,
      "end": 819.2400054931641,
      "text": " 19. When you begin to see what is said here in these verses of Scripture, some"
    },
    {
      "id": 42,
      "start": 819.2400054931641,
      "end": 825.3200073242188,
      "text": " of these names will be familiar to you as to the people groups that you see"
    },
    {
      "id": 43,
      "start": 825.5599975585938,
      "end": 831.6000061035156,
      "text": " inhabiting the land of Canaan at the time of the possession led by"
    },
    {
      "id": 44,
      "start": 831.6000061035156,
      "end": 835.3200073242188,
      "text": " Joshua as the children of Israel went into the land of promise. Notice in verse"
    },
    {
      "id": 45,
      "start": 835.3200073242188,
      "end": 840.2400054931641,
      "text": " 15, \"...and Canaan begat Sidon, his firstborn, and Heth, and the Jebusite.\" You heard"
    },
    {
      "id": 46,
      "start": 840.2400054931641,
      "end": 844.6000061035156,
      "text": " about the Sidonians, you heard about the Jebusites, it says, \"...and the Amorite, the"
    },
    {
      "id": 47,
      "start": 844.6000061035156,
      "end": 849.7200012207031,
      "text": " Gergesite, the Hivite, the Archite, the Sinite, and the Arvidite, and the"
    },
    {
      "id": 48,
      "start": 849.7200012207031,
      "end": 853.6000061035156,
      "text": " Zemurite, and the Hamathite, and afterward were the families of the Canaanites"
    },
    {
      "id": 49,
      "start": 853.6000061035156,
      "end": 857.9800109863281,
      "text": " spread abroad. And the border of the Canaanites was from Sidon, as thou"
    },
    {
      "id": 50,
      "start": 857.9800109863281,
      "end": 863.3200073242188,
      "text": " comest to Gerir, unto Gaza, as thou goest unto Sodom and Gomorrah, and Adma and"
    },
    {
      "id": 51,
      "start": 863.3200073242188,
      "end": 869.760009765625,
      "text": " Zeboiom, even unto Lashon.\" And so we find that here in the section, the second"
    },
    {
      "id": 52,
      "start": 869.760009765625,
      "end": 873.8399963378906,
      "text": " section here of Genesis chapter number 10, in giving us the generations of the"
    },
    {
      "id": 53,
      "start": 873.8399963378906,
      "end": 877.9200134277344,
      "text": " sons of Noah, we see first of all the sons of Japheth, we then see the sons of"
    },
    {
      "id": 54,
      "start": 877.9200134277344,
      "end": 883.0,
      "text": " Ham. Within the context of these verses with regard to the sons of Ham, we're"
    },
    {
      "id": 55,
      "start": 883.0400085449219,
      "end": 888.760009765625,
      "text": " given specific mention to that of Nimrod, and we also are reminded about the"
    },
    {
      "id": 56,
      "start": 888.760009765625,
      "end": 894.0799865722656,
      "text": " Canaanite nations or peoples that had been referenced back in chapter number"
    },
    {
      "id": 57,
      "start": 894.0799865722656,
      "end": 900.8399963378906,
      "text": " 9. Now as we move into the latter section of Genesis chapter number 10, number 3"
    },
    {
      "id": 58,
      "start": 900.8399963378906,
      "end": 905.5599975585938,
      "text": " this evening, the sons of Shem. In verses 21 down through verse number 31, God"
    },
    {
      "id": 59,
      "start": 905.5599975585938,
      "end": 910.0400085449219,
      "text": " gives us the record of the sons of Shem. It tells us in verse number 21,"
    },
    {
      "id": 60,
      "start": 910.2000122070312,
      "end": 914.7200012207031,
      "text": " unto Shem also, and then we find that all of these are going to be referenced, the"
    },
    {
      "id": 61,
      "start": 914.7200012207031,
      "end": 918.7200012207031,
      "text": " father of all the children of Eber, the brother of Japheth, the elder, even to him"
    },
    {
      "id": 62,
      "start": 918.7200012207031,
      "end": 924.3599853515625,
      "text": " were children born. Notice verse 31, these are the sons of Shem, after their"
    },
    {
      "id": 63,
      "start": 924.3599853515625,
      "end": 930.2799987792969,
      "text": " families, after their tongues, in their lands, after their nations. And so we find"
    },
    {
      "id": 64,
      "start": 930.2799987792969,
      "end": 936.2799987792969,
      "text": " here the sons of Shem that are listed, and again it's interesting to know, as we"
    },
    {
      "id": 65,
      "start": 936.3599853515625,
      "end": 940.4400024414062,
      "text": " look at verse number 25 within the context of the sons of Shem that are"
    },
    {
      "id": 66,
      "start": 940.4400024414062,
      "end": 944.8800048828125,
      "text": " listed, notice what the Bible says, and unto Eber were born two sons, the name of"
    },
    {
      "id": 67,
      "start": 944.8800048828125,
      "end": 950.6400146484375,
      "text": " the one was Peleg, for in his days was the earth divided, and his brother's name"
    },
    {
      "id": 68,
      "start": 950.6400146484375,
      "end": 954.7999877929688,
      "text": " was Joktan. And as we look at verse number 25 and we see that phrase, for in"
    },
    {
      "id": 69,
      "start": 954.7999877929688,
      "end": 958.9599914550781,
      "text": " his days was the earth divided, we certainly believe that what is"
    },
    {
      "id": 70,
      "start": 958.9599914550781,
      "end": 963.0400085449219,
      "text": " referenced in chapter 11, in verse number 9 specifically, when it says"
    },
    {
      "id": 71,
      "start": 963.0400085449219,
      "end": 966.4800109863281,
      "text": " therefore is the name of it called Babel, because the Lord did there"
    },
    {
      "id": 72,
      "start": 966.4800109863281,
      "end": 972.6799926757812,
      "text": " confound the language of all the earth, and from thence did the Lord scatter"
    },
    {
      "id": 73,
      "start": 972.6799926757812,
      "end": 978.6799926757812,
      "text": " them abroad upon the face of all the earth. And it's interesting as we look at"
    },
    {
      "id": 74,
      "start": 978.6799926757812,
      "end": 983.9200134277344,
      "text": " this table of nations that it's often been referred to in chapter number 10 of"
    },
    {
      "id": 75,
      "start": 983.9200134277344,
      "end": 989.8800048828125,
      "text": " the book of Genesis, and we understand that here in verses 21 through 31 that"
    },
    {
      "id": 76,
      "start": 989.9200134277344,
      "end": 994.7999877929688,
      "text": " the sons of Shem are listed for us. The thing that is interesting about that is"
    },
    {
      "id": 77,
      "start": 994.7999877929688,
      "end": 998.8399963378906,
      "text": " that if you look over, and I'm not going to read it in its entirety, but if you"
    },
    {
      "id": 78,
      "start": 998.8399963378906,
      "end": 1004.3999938964844,
      "text": " look over to chapter number 11 and you look at verses 10 through 26, the Bible"
    },
    {
      "id": 79,
      "start": 1004.3999938964844,
      "end": 1011.6000061035156,
      "text": " begins in verse number 10 by saying this, these are the generations of Shem. Now we"
    },
    {
      "id": 80,
      "start": 1011.6000061035156,
      "end": 1017.6000061035156,
      "text": " just read in chapter number 10 in verses 21 through 31 unto Shem also, and the"
    },
    {
      "id": 81,
      "start": 1017.6000061035156,
      "end": 1022.760009765625,
      "text": " list is provided of the descendants, and it tells us in verse number 31, these"
    },
    {
      "id": 82,
      "start": 1022.760009765625,
      "end": 1028.7200012207031,
      "text": " are the sons of Shem. I want you to notice the importance of what is given"
    },
    {
      "id": 83,
      "start": 1028.7200012207031,
      "end": 1031.9599914550781,
      "text": " to us as we will move into chapter number 11 and deal with it in more"
    },
    {
      "id": 84,
      "start": 1031.9599914550781,
      "end": 1036.5199890136719,
      "text": " detail in an upcoming message, but we find that in chapter number 11 in verses"
    },
    {
      "id": 85,
      "start": 1036.5199890136719,
      "end": 1042.0799865722656,
      "text": " 10 through 26 that what's happening is we then see how that the descendants of"
    },
    {
      "id": 86,
      "start": 1042.0799865722656,
      "end": 1047.3200073242188,
      "text": " Shem are again found, the generations of Shem given to us in this passage of"
    },
    {
      "id": 87,
      "start": 1047.3200073242188,
      "end": 1052.2000122070312,
      "text": " Scripture, and as we end the section in verse number 26, notice the Bible says"
    },
    {
      "id": 88,
      "start": 1052.2000122070312,
      "end": 1060.9599914550781,
      "text": " and Terah lived 70 years and begat who? Abram, Nahor, and Haran. And so what's"
    },
    {
      "id": 89,
      "start": 1060.9599914550781,
      "end": 1066.2799987792969,
      "text": " going to happen as we look at this passage of Scripture in Genesis"
    },
    {
      "id": 90,
      "start": 1066.2799987792969,
      "end": 1070.6799926757812,
      "text": " chapter 11 and verses 10 through 26, what we see is going to happen is that"
    },
    {
      "id": 91,
      "start": 1070.6799926757812,
      "end": 1076.1600036621094,
      "text": " really this then becomes the lineage of Christ and what is now in view and"
    },
    {
      "id": 92,
      "start": 1076.2000122070312,
      "end": 1081.2000122070312,
      "text": " becomes the focal point of the historical record of the Bible. In"
    },
    {
      "id": 93,
      "start": 1081.2000122070312,
      "end": 1086.2799987792969,
      "text": " Genesis chapter number 10 we're given this broad overview of all of the"
    },
    {
      "id": 94,
      "start": 1086.2799987792969,
      "end": 1092.3200073242188,
      "text": " descendants, the generations of Noah. It says this, now these are the"
    },
    {
      "id": 95,
      "start": 1092.3200073242188,
      "end": 1096.6400146484375,
      "text": " generations of the sons of Noah, and there's 70 of them in"
    },
    {
      "id": 96,
      "start": 1096.6400146484375,
      "end": 1100.4800109863281,
      "text": " the text, and you look at these 70 different references that are given and"
    },
    {
      "id": 97,
      "start": 1100.7999877929688,
      "end": 1106.2799987792969,
      "text": " you see the overall dividing and the people groups, right, of all of the"
    },
    {
      "id": 98,
      "start": 1106.2799987792969,
      "end": 1112.52001953125,
      "text": " world, but you find that as we come to chapter number 11 that God is going to, on"
    },
    {
      "id": 99,
      "start": 1112.52001953125,
      "end": 1119.1599731445312,
      "text": " purpose, He's going to zero in and focus upon the line of Shem as we mentioned in"
    },
    {
      "id": 100,
      "start": 1119.1599731445312,
      "end": 1125.5999755859375,
      "text": " our previous study, that we mentioned how that the Noah, during that prophecy of"
    },
    {
      "id": 101,
      "start": 1125.719970703125,
      "end": 1131.1199951171875,
      "text": " Noah, that He blessed the Lord God of Shem, and we mentioned how that the Jews"
    },
    {
      "id": 102,
      "start": 1131.1199951171875,
      "end": 1135.6400146484375,
      "text": " are Semitic, they're from the line of Shem, and it's the Messianic line, and we"
    },
    {
      "id": 103,
      "start": 1135.6400146484375,
      "end": 1141.3200073242188,
      "text": " would find that in chapter number 11 that God takes the focus, if you will,"
    },
    {
      "id": 104,
      "start": 1141.3200073242188,
      "end": 1147.9199829101562,
      "text": " all the way down to Abram, and of course Abram becomes who? Abraham, right, the"
    },
    {
      "id": 105,
      "start": 1147.9199829101562,
      "end": 1153.280029296875,
      "text": " father of the nation of Israel, right, the Hebrew nation. And we see that from"
    },
    {
      "id": 106,
      "start": 1153.3599853515625,
      "end": 1157.9199829101562,
      "text": " Genesis, really the end of chapter 11, as it gives us a few overview"
    },
    {
      "id": 107,
      "start": 1157.9199829101562,
      "end": 1162.52001953125,
      "text": " statements about the heritage, the family of Abram, if you will, but then starting"
    },
    {
      "id": 108,
      "start": 1162.52001953125,
      "end": 1167.9600219726562,
      "text": " in chapter number 12, you find that what God is doing is He's giving us that"
    },
    {
      "id": 109,
      "start": 1167.9600219726562,
      "end": 1174.7999877929688,
      "text": " truth with regard to the lineage of Christ and the way in which God"
    },
    {
      "id": 110,
      "start": 1174.7999877929688,
      "end": 1180.239990234375,
      "text": " would fulfill, by the way, the prophecy that was given in Genesis chapter number"
    },
    {
      "id": 111,
      "start": 1180.5999755859375,
      "end": 1185.1599731445312,
      "text": " 3. And you'll be reminded of that prophecy, I referenced it this morning as"
    },
    {
      "id": 112,
      "start": 1185.1599731445312,
      "end": 1188.719970703125,
      "text": " well, but in Genesis 3 and verse number 15, God said this,"
    },
    {
      "id": 113,
      "start": 1188.719970703125,
      "end": 1192.6400146484375,
      "text": " I will put enmity between thee and the woman, and between thy seed and her seed,"
    },
    {
      "id": 114,
      "start": 1192.6400146484375,
      "end": 1198.0399780273438,
      "text": " it shall bruise thy head, and thou shalt bruise his heel. Who is the seed? It's"
    },
    {
      "id": 115,
      "start": 1198.0399780273438,
      "end": 1201.3599853515625,
      "text": " Jesus, Messiah."
    },
    {
      "id": 0,
      "start": 1201.3599853515625,
      "end": 1208.799985408783,
      "text": " we understand that Abraham is given a promise of a seed and a land, we understand both of those,"
    },
    {
      "id": 1,
      "start": 1208.799985408783,
      "end": 1214.7999849319458,
      "text": " but we understand that as we interpret the promise of a seed that is given to Abraham,"
    },
    {
      "id": 2,
      "start": 1214.7999849319458,
      "end": 1219.3599853515625,
      "text": " and we rightly interpret that with the book of Galatians, that he said he didn't say"
    },
    {
      "id": 3,
      "start": 1219.3599853515625,
      "end": 1226.239984512329,
      "text": " seeds as of many, he said seed as in one, that is Christ. And what a blessing to see how that"
    },
    {
      "id": 4,
      "start": 1226.239984512329,
      "end": 1233.4399871826172,
      "text": " the Bible will give us and zero in, focus upon the truths, the historical record that God would"
    },
    {
      "id": 5,
      "start": 1233.4399871826172,
      "end": 1240.7999839782715,
      "text": " give us with regard to His people, Israel, and then of course the Messianic line. Throughout"
    },
    {
      "id": 6,
      "start": 1240.7999839782715,
      "end": 1246.0799865722656,
      "text": " the remaining history that is recorded in the Bible, of course the Old Testament provides with"
    },
    {
      "id": 7,
      "start": 1246.0799865722656,
      "end": 1252.719985961914,
      "text": " us much historical content, we find that really as we look at all of the history that's given,"
    },
    {
      "id": 8,
      "start": 1252.719985961914,
      "end": 1259.6799850463867,
      "text": " it's how other people groups will interact with God's people. You will read of other nations and"
    },
    {
      "id": 9,
      "start": 1259.6799850463867,
      "end": 1264.6399841308594,
      "text": " other groups of people and you'll read of them, but you're really reading of them as how they"
    },
    {
      "id": 10,
      "start": 1264.6399841308594,
      "end": 1271.119987487793,
      "text": " interact with the people of God. And of course the line going down through all the way through"
    },
    {
      "id": 11,
      "start": 1271.119987487793,
      "end": 1276.5599822998047,
      "text": " the Old Testament, of course leading to Messiah, we understand even as we've mentioned in some"
    },
    {
      "id": 12,
      "start": 1276.5599822998047,
      "end": 1283.3599853515625,
      "text": " books like the book of Esther how that Haman had such hatred for the people of God, the Israelites,"
    },
    {
      "id": 13,
      "start": 1283.3599853515625,
      "end": 1288.879981994629,
      "text": " he wanted to kill them. It wasn't so much that it was just Mordecai, he wanted to get rid of"
    },
    {
      "id": 14,
      "start": 1288.879981994629,
      "end": 1295.839988708496,
      "text": " Mordecai, but also the entire nation of Israel. We see the enemy at work, right? The enemy is trying"
    },
    {
      "id": 15,
      "start": 1295.839988708496,
      "end": 1301.9199829101562,
      "text": " to destroy the line by which Messiah would come. We know that he did not succeed, we know that"
    },
    {
      "id": 16,
      "start": 1301.9199829101562,
      "end": 1307.1999816894531,
      "text": " Messiah came, amen, and what a blessing that is. So as we look at Genesis chapter number 10 and we"
    },
    {
      "id": 17,
      "start": 1307.1999816894531,
      "end": 1312.6399841308594,
      "text": " look at this passage and we see the breakdown that is given to us, I want to focus back as we kind of"
    },
    {
      "id": 18,
      "start": 1312.6399841308594,
      "end": 1317.839988708496,
      "text": " conclude this evening verses 1 and 32 of Genesis chapter number 10, and I want to take a couple of"
    },
    {
      "id": 19,
      "start": 1317.839988708496,
      "end": 1324.7999877929688,
      "text": " takeaways. Let me read the two verses to you again and give some takeaways from this passage. Verse"
    },
    {
      "id": 20,
      "start": 1324.7999877929688,
      "end": 1331.2799835205078,
      "text": " number one of Genesis 10, now these are the generations of the sons of Noah, Shem, Ham, and"
    },
    {
      "id": 21,
      "start": 1331.2799835205078,
      "end": 1338.3999786376953,
      "text": " Japheth, and unto them were sons born after the flood. Notice verse 32, these are the families of the"
    },
    {
      "id": 22,
      "start": 1338.3999786376953,
      "end": 1344.9599914550781,
      "text": " sons of Noah after their generations and their nations, and by these were the nations divided"
    },
    {
      "id": 23,
      "start": 1344.9599914550781,
      "end": 1351.999984741211,
      "text": " in the earth after the flood. Number one takeaway that I want you to see is in both verse number one"
    },
    {
      "id": 24,
      "start": 1351.999984741211,
      "end": 1359.7599792480469,
      "text": " and verse number 32, there's a phrase that is used that says, after the flood. What is it that God is"
    },
    {
      "id": 25,
      "start": 1359.7599792480469,
      "end": 1366.6399841308594,
      "text": " reminding us of that there was a global flood? We understand that as we looked at these previous"
    },
    {
      "id": 26,
      "start": 1366.6399841308594,
      "end": 1373.4399871826172,
      "text": " passages of scripture in Genesis chapter number 4, in Genesis chapter number 5, about the"
    },
    {
      "id": 27,
      "start": 1373.4399871826172,
      "end": 1380.5599822998047,
      "text": " generations that were provided to us, we find that we come to the time of Noah. Genesis 5"
    },
    {
      "id": 28,
      "start": 1380.5599822998047,
      "end": 1387.1999816894531,
      "text": " ends with the line of Noah, Noah being 500 years old at that particular time, and then we find that"
    },
    {
      "id": 29,
      "start": 1387.1999816894531,
      "end": 1393.7599792480469,
      "text": " Genesis 6, 7, and 8 deal with the global flood. Chapter number 9, of course, the Noahic Covenant, we"
    },
    {
      "id": 30,
      "start": 1393.7599792480469,
      "end": 1399.1999816894531,
      "text": " dealt with that, but we come to chapter number 10, and on both the first and last verse of this passage"
    },
    {
      "id": 31,
      "start": 1399.1999816894531,
      "end": 1406.47998046875,
      "text": " of scripture, the Bible uses after the flood. You understand that there are many people today that"
    },
    {
      "id": 32,
      "start": 1406.47998046875,
      "end": 1413.1999816894531,
      "text": " deny the global flood. There are people today that would deny the fact that there was a Noah's"
    },
    {
      "id": 33,
      "start": 1413.1999816894531,
      "end": 1420.8799896240234,
      "text": " flood. In fact, depending on the company that you are with, if you were to mention something about"
    },
    {
      "id": 34,
      "start": 1420.8799896240234,
      "end": 1426.47998046875,
      "text": " the flood of Noah's day, there would be some that would mock you for even believing such a thing."
    },
    {
      "id": 35,
      "start": 1427.3599853515625,
      "end": 1432.6399841308594,
      "text": " It's just reality. That's what we live in today. There have been mockers and scoffers, but we"
    },
    {
      "id": 36,
      "start": 1432.6399841308594,
      "end": 1439.1199798583984,
      "text": " understand that this is nothing new. Amen? Because here, let me remind you of what Peter said in"
    },
    {
      "id": 37,
      "start": 1439.1199798583984,
      "end": 1445.5999908447266,
      "text": " 2 Peter chapter 3, and this is exactly what was happening during that particular time. In 2 Peter"
    },
    {
      "id": 38,
      "start": 1445.5999908447266,
      "end": 1453.7599792480469,
      "text": " chapter number 3, we find that Peter specifically is going to make mention about those scoffers that"
    },
    {
      "id": 39,
      "start": 1453.7599792480469,
      "end": 1458.9599914550781,
      "text": " would come in the last days. It says this in verse number 3 of 2 Peter chapter number 3,"
    },
    {
      "id": 40,
      "start": 1458.9599914550781,
      "end": 1466.3999938964844,
      "text": " knowing this first, that there shall come in the last days scoffers walking after their own lust."
    },
    {
      "id": 41,
      "start": 1467.0399780273438,
      "end": 1474.8799743652344,
      "text": " And here's what they're going to say. Where is the promise of his coming? It's interesting that they"
    },
    {
      "id": 42,
      "start": 1474.8799743652344,
      "end": 1481.8399963378906,
      "text": " understand, as far as the truth that Peter is giving us, that they understand that Jesus"
    },
    {
      "id": 43,
      "start": 1481.8399963378906,
      "end": 1483.5999755859375,
      "text": " said that he was coming again."
    },
    {
      "id": 44,
      "start": 1486.0,
      "end": 1490.47998046875,
      "text": " It says this in verse number 4, for since the fathers fell asleep, all things continue as they"
    },
    {
      "id": 45,
      "start": 1490.47998046875,
      "end": 1497.6799926757812,
      "text": " were from the beginning of the creation. But what does Peter do? He says in verse number 5, for this,"
    },
    {
      "id": 46,
      "start": 1497.6799926757812,
      "end": 1506.0,
      "text": " they willingly are ignorant of that by the word of God, the heavens were of old, and the earth"
    },
    {
      "id": 47,
      "start": 1506.0799865722656,
      "end": 1512.719970703125,
      "text": " standing out of the water and in the water, verse 6, whereby the world that then was being"
    },
    {
      "id": 48,
      "start": 1512.719970703125,
      "end": 1519.0399780273438,
      "text": " overflowed with water perished. What is Peter talking about? He's talking about the global flood."
    },
    {
      "id": 49,
      "start": 1519.8399963378906,
      "end": 1526.5599975585938,
      "text": " He's talking about the flood of Noah's day, Genesis 6 through 8. And we find here, Peter will make"
    },
    {
      "id": 50,
      "start": 1526.5599975585938,
      "end": 1531.3599853515625,
      "text": " mention of this as well in his first epistle, and we'll look at that in just a moment, but it is"
    },
    {
      "id": 51,
      "start": 1531.3599853515625,
      "end": 1536.0,
      "text": " interesting that as you study the 10th chapter of the book of Genesis, and you think about this"
    },
    {
      "id": 52,
      "start": 1536.0,
      "end": 1544.0799865722656,
      "text": " that is given to us here in this passage, by these were the nations divided, and we see that they"
    },
    {
      "id": 53,
      "start": 1544.0799865722656,
      "end": 1551.3599853515625,
      "text": " were divided after the flood. These are the sons that were born after the flood. What did God tell"
    },
    {
      "id": 54,
      "start": 1551.3599853515625,
      "end": 1555.7599792480469,
      "text": " Noah and his sons as soon as they got off the ark? Remember, as soon as they got off the ark,"
    },
    {
      "id": 55,
      "start": 1555.7599792480469,
      "end": 1560.3999938964844,
      "text": " the first thing they did was what? They made an offering. We mentioned about the importance of"
    },
    {
      "id": 56,
      "start": 1560.3999938964844,
      "end": 1565.9199829101562,
      "text": " understanding first things first. There was a matter of priority, and that was worship. That's"
    },
    {
      "id": 57,
      "start": 1565.9199829101562,
      "end": 1570.3999938964844,
      "text": " exactly what they did. But as you come into the ninth chapter of the book of Genesis, you find that"
    },
    {
      "id": 58,
      "start": 1570.3999938964844,
      "end": 1576.6399841308594,
      "text": " God gives them instruction. It says, God blessed Noah and his sons and said unto them, be fruitful"
    },
    {
      "id": 59,
      "start": 1576.6399841308594,
      "end": 1583.6799926757812,
      "text": " and multiply and replenish the earth. So not only do we find in Genesis chapter number 10 that there"
    },
    {
      "id": 60,
      "start": 1583.7599792480469,
      "end": 1590.6399841308594,
      "text": " is the truth of a global flood, we find that Noah and his sons, they obeyed the instruction of the"
    },
    {
      "id": 61,
      "start": 1590.6399841308594,
      "end": 1597.9199829101562,
      "text": " Lord. He said, be fruitful and multiply, and we find that God blessed them. No doubt he is the"
    },
    {
      "id": 62,
      "start": 1597.9199829101562,
      "end": 1604.0,
      "text": " giver of life, and we find that he blessed them, and they did in fact replenish the earth. And it"
    },
    {
      "id": 63,
      "start": 1604.0,
      "end": 1610.3199768066406,
      "text": " is interesting as we understand that at the time in which we're looking at this particular era,"
    },
    {
      "id": 64,
      "start": 1610.3199768066406,
      "end": 1617.5199890136719,
      "text": " and we look at the phrases again in verse one and verse number 32, it says the sons of Noah"
    },
    {
      "id": 65,
      "start": 1617.5199890136719,
      "end": 1623.2799987792969,
      "text": " after their generations. It says in verse number one, it lists the sons of Noah specifically Shem,"
    },
    {
      "id": 66,
      "start": 1623.2799987792969,
      "end": 1627.8399963378906,
      "text": " Ham, and Japheth. You understand at the end of the flood, there were only eight human beings"
    },
    {
      "id": 67,
      "start": 1627.8399963378906,
      "end": 1635.7599792480469,
      "text": " who survived. That's it. Noah, Mrs. Noah. Everyone says, what was Noah's wife's name? I don't know."
    },
    {
      "id": 68,
      "start": 1636.3999938964844,
      "end": 1645.0399780273438,
      "text": " No idea. The people out at Answers in Genesis, if you go to the Ark out there, the Ark Encounter,"
    },
    {
      "id": 69,
      "start": 1645.0399780273438,
      "end": 1652.9599914550781,
      "text": " they have given Noah's wife a name. What is it? Emzara. And we first walked in, and I said,"
    },
    {
      "id": 70,
      "start": 1652.9599914550781,
      "end": 1656.8799743652344,
      "text": " Emzara? I'm like, man, I never knew what her name was. I'm trying to find out where it is in the"
    },
    {
      "id": 71,
      "start": 1656.8799743652344,
      "end": 1661.8399963378906,
      "text": " Bible, you know? And then they said, right underneath of it, they said, we really don't"
    },
    {
      "id": 72,
      "start": 1661.8399963378906,
      "end": 1669.1999816894531,
      "text": " know what her name is, but we've just given her a name. So Noah and Mrs. Noah, right? Japheth and"
    },
    {
      "id": 73,
      "start": 1669.1999816894531,
      "end": 1675.4399719238281,
      "text": " Mrs. Japheth, Ham, Mrs. Ham, Shem, and Mrs. Shem. There are eight people that come off of the Ark."
    },
    {
      "id": 74,
      "start": 1676.3999938964844,
      "end": 1681.6799926757812,
      "text": " Not only do we know that from the account in Genesis, but I want you to look at 1 Peter,"
    },
    {
      "id": 75,
      "start": 1681.6799926757812,
      "end": 1685.5199890136719,
      "text": " chapter number three. We looked at 2 Peter, chapter number three a moment ago to see how"
    },
    {
      "id": 76,
      "start": 1685.5199890136719,
      "end": 1690.47998046875,
      "text": " that Peter referenced the truth of a global flood. He references that in 1 Peter, chapter number three"
    },
    {
      "id": 77,
      "start": 1690.47998046875,
      "end": 1695.3599853515625,
      "text": " as well, but he gives us this additional truth with regard to the fact that there are only eight"
    },
    {
      "id": 78,
      "start": 1695.3599853515625,
      "end": 1701.6799926757812,
      "text": " human beings that survived. In 1 Peter, chapter number three, in verse number 20, the Bible says"
    },
    {
      "id": 79,
      "start": 1701.6799926757812,
      "end": 1708.719970703125,
      "text": " this, which sometime were disobedient when once the long-suffering of God waited in the days of Noah,"
    },
    {
      "id": 80,
      "start": 1708.719970703125,
      "end": 1718.1599731445312,
      "text": " while the Ark was a preparing wherein few, that is, eight souls were saved by water."
    },
    {
      "id": 81,
      "start": 1718.1599731445312,
      "end": 1725.2799682617188,
      "text": " There were eight human beings, Noah and his wife, his three sons, and their wives. We made mention,"
    },
    {
      "id": 82,
      "start": 1725.2799682617188,
      "end": 1729.760009765625,
      "text": " and we find that in Genesis, as we look in chapters six, seven, and eight,"
    },
    {
      "id": 83,
      "start": 1730.6400146484375,
      "end": 1737.5999755859375,
      "text": " the Bible tells us how that all man died. In fact, in Genesis, chapter number seven, in verse number"
    },
    {
      "id": 84,
      "start": 1737.5999755859375,
      "end": 1742.6400146484375,
      "text": " 21, the Bible says, and all flesh died that moved upon the earth, both of fowl and of cattle and of"
    },
    {
      "id": 85,
      "start": 1742.6400146484375,
      "end": 1750.5599975585938,
      "text": " beasts and of every creeping thing that creepeth upon the earth, and every man. Noah was a preacher"
    },
    {
      "id": 86,
      "start": 1750.5599975585938,
      "end": 1757.5999755859375,
      "text": " of righteousness. He didn't have very many people that followed the message that he gave, correct?"
    },
    {
      "id": 87,
      "start": 1758.719970703125,
      "end": 1764.7999877929688,
      "text": " We find that the Bible tells us, as we look in Genesis, chapter number seven, how that God"
    },
    {
      "id": 88,
      "start": 1764.7999877929688,
      "end": 1770.3200073242188,
      "text": " shut them in. It tells us in Genesis seven, in verse number 16, and they that went in went in,"
    },
    {
      "id": 89,
      "start": 1770.3200073242188,
      "end": 1776.3200073242188,
      "text": " male and female of all flesh, but who went in from a human perspective? It was only Noah, his wife,"
    },
    {
      "id": 90,
      "start": 1776.3200073242188,
      "end": 1783.0399780273438,
      "text": " his three sons, and their wives, and only human beings to enter the Ark. And it was God that shut them in."
    },
    {
      "id": 91,
      "start": 1784.1599731445312,
      "end": 1791.4400024414062,
      "text": " And we find that the Bible tells us that every man died during the flood. And then we come to"
    },
    {
      "id": 92,
      "start": 1791.4400024414062,
      "end": 1797.4400024414062,
      "text": " Genesis, chapter number 10, and we see that the Bible tells us not only that there was a global flood,"
    },
    {
      "id": 93,
      "start": 1797.4400024414062,
      "end": 1801.2799682617188,
      "text": " but we see once again that there were only eight human beings that survived."
    },
    {
      "id": 0,
      "start": 1801.2799682617188,
      "end": 1804.999968290329,
      "text": " you say pastor we know this why are we why are we dealing with this I've had"
    },
    {
      "id": 1,
      "start": 1804.999968290329,
      "end": 1809.9199686050415,
      "text": " people ask me questions such as this couldn't there have been another group"
    },
    {
      "id": 2,
      "start": 1809.9199686050415,
      "end": 1816.8799686431885,
      "text": " of people somewhere else on the earth no if there were God would have told us if"
    },
    {
      "id": 3,
      "start": 1816.8799686431885,
      "end": 1821.519968032837,
      "text": " you want to go back even further than that from Noah I've had people ask me"
    },
    {
      "id": 4,
      "start": 1821.519968032837,
      "end": 1826.099967956543,
      "text": " this question and they've said it this way how many Adams do you think there"
    },
    {
      "id": 5,
      "start": 1826.099967956543,
      "end": 1831.4999675750732,
      "text": " were like say this again I mean if you look at the New Testament truth of the"
    },
    {
      "id": 6,
      "start": 1831.4999675750732,
      "end": 1834.7399673461914,
      "text": " second Adam speaking of Christ you know I understand what you're speaking of"
    },
    {
      "id": 7,
      "start": 1834.7399673461914,
      "end": 1842.4599685668945,
      "text": " but they were asking in the in the sense of how many Adams Genesis did God create"
    },
    {
      "id": 8,
      "start": 1842.4599685668945,
      "end": 1847.9799690246582,
      "text": " did he create multitudes of atoms and scatter them all over the earth and no"
    },
    {
      "id": 9,
      "start": 1847.9799690246582,
      "end": 1854.539966583252,
      "text": " he created one there was one Adam and he saw that he needed a help mate so what"
    },
    {
      "id": 10,
      "start": 1854.539966583252,
      "end": 1859.4599685668945,
      "text": " did he do made Eve and he brought Eve to her right we understand that and it's"
    },
    {
      "id": 11,
      "start": 1859.4599685668945,
      "end": 1862.4599685668945,
      "text": " important because what's happening is there are so many people that are"
    },
    {
      "id": 12,
      "start": 1862.4599685668945,
      "end": 1867.2999649047852,
      "text": " attacking the foundation of our Bible and here's what they try to do if this"
    },
    {
      "id": 13,
      "start": 1867.2999649047852,
      "end": 1873.2599716186523,
      "text": " can't be trusted if Genesis 1 through 11 can't be trusted then how can you know"
    },
    {
      "id": 14,
      "start": 1873.2599716186523,
      "end": 1879.7399673461914,
      "text": " that John 316 can be trusted now you say wow we we fast-forwarded a lot that's"
    },
    {
      "id": 15,
      "start": 1879.7399673461914,
      "end": 1885.219970703125,
      "text": " what they want to do okay they don't do it that quickly but that's exactly what"
    },
    {
      "id": 16,
      "start": 1885.219970703125,
      "end": 1889.219970703125,
      "text": " they want to do they want to systematically break down the"
    },
    {
      "id": 17,
      "start": 1889.219970703125,
      "end": 1893.699966430664,
      "text": " Scriptures they want to undermine what God says they want to provide whatever"
    },
    {
      "id": 18,
      "start": 1893.699966430664,
      "end": 1898.3799667358398,
      "text": " types of quote-unquote evidences they might have and they try to break down"
    },
    {
      "id": 19,
      "start": 1898.3799667358398,
      "end": 1902.979965209961,
      "text": " undermine the truth of God's Word so that they eventually can get to the"
    },
    {
      "id": 20,
      "start": 1902.979965209961,
      "end": 1909.6599655151367,
      "text": " point of Romans 1 where there really is no God so we see that it's important"
    },
    {
      "id": 21,
      "start": 1909.6599655151367,
      "end": 1914.219970703125,
      "text": " that we understand and really at the the the book ends of this chapter verse"
    },
    {
      "id": 22,
      "start": 1914.219970703125,
      "end": 1920.0199661254883,
      "text": " 1 and verse 32 that were reminded that there was a flood reminded there are"
    },
    {
      "id": 23,
      "start": 1920.0199661254883,
      "end": 1924.2599716186523,
      "text": " only eight human beings that survived that flood and they only survived"
    },
    {
      "id": 24,
      "start": 1924.2599716186523,
      "end": 1930.3799743652344,
      "text": " because they got on the ark and God protected them reminded of one final"
    },
    {
      "id": 25,
      "start": 1930.3799743652344,
      "end": 1935.6199645996094,
      "text": " truth as we look in Genesis 10 verse 1 and verse 32 notice the Bible says in"
    },
    {
      "id": 26,
      "start": 1935.6199645996094,
      "end": 1939.1399688720703,
      "text": " verse number one now these are the generations of the sons of Noah Shem and"
    },
    {
      "id": 27,
      "start": 1939.1399688720703,
      "end": 1943.4599609375,
      "text": " Ham a Shem Ham and Japheth excuse me and unto them were sons born after the"
    },
    {
      "id": 28,
      "start": 1943.4599609375,
      "end": 1947.6199645996094,
      "text": " flood verse 32 these are the families of the sons of Noah after their generations"
    },
    {
      "id": 29,
      "start": 1947.6199645996094,
      "end": 1954.9399719238281,
      "text": " in their nations notice by these who is these that's the eight human being the"
    },
    {
      "id": 30,
      "start": 1954.9399719238281,
      "end": 1961.9399719238281,
      "text": " sons right specifically the six Shem Ham Japheth and their wives it says by these"
    },
    {
      "id": 31,
      "start": 1961.9399719238281,
      "end": 1967.5799713134766,
      "text": " were the nations divided in the earth after the flood and so we find that the"
    },
    {
      "id": 32,
      "start": 1967.5799713134766,
      "end": 1973.0999755859375,
      "text": " Bible teaching that we see in Genesis chapter 10 verses 1 and 32 obviously the"
    },
    {
      "id": 33,
      "start": 1973.0999755859375,
      "end": 1977.5399627685547,
      "text": " details are provided to us as with regard to the the generations and the"
    },
    {
      "id": 34,
      "start": 1977.5399627685547,
      "end": 1982.1799621582031,
      "text": " descendants of these sons the Bible tells us not only that there was a"
    },
    {
      "id": 35,
      "start": 1982.1799621582031,
      "end": 1985.739974975586,
      "text": " global flood not only that they were obedient not only that there were just"
    },
    {
      "id": 36,
      "start": 1985.739974975586,
      "end": 1990.0999755859375,
      "text": " simply eight human beings that survived we find that there's only one human race"
    },
    {
      "id": 37,
      "start": 1990.1399688720703,
      "end": 1995.0999755859375,
      "text": " there's only one human race I mentioned this last week actually I didn't preach"
    },
    {
      "id": 38,
      "start": 1995.0999755859375,
      "end": 1999.2599639892578,
      "text": " from Genesis last week so it was a couple of weeks ago when I preached in"
    },
    {
      "id": 39,
      "start": 1999.2599639892578,
      "end": 2003.5399627685547,
      "text": " chapter number nine but we find that in chapter number nine look back if you"
    },
    {
      "id": 40,
      "start": 2003.5399627685547,
      "end": 2006.699966430664,
      "text": " will it might be on the same page for you it's on a previous page for me but"
    },
    {
      "id": 41,
      "start": 2006.699966430664,
      "end": 2011.4599609375,
      "text": " look back at Genesis 9 in verse number 19 it's very similar to what we read in"
    },
    {
      "id": 42,
      "start": 2011.4599609375,
      "end": 2015.0599670410156,
      "text": " chapter number 32 of chapter 10 where the Bible says these are the three sons"
    },
    {
      "id": 43,
      "start": 2015.0599670410156,
      "end": 2021.7799682617188,
      "text": " of Noah and of them was the whole earth overspread so it's important that we"
    },
    {
      "id": 44,
      "start": 2021.7799682617188,
      "end": 2027.4199676513672,
      "text": " understand there's only one human race we find that all people every human"
    },
    {
      "id": 45,
      "start": 2027.4199676513672,
      "end": 2033.6199645996094,
      "text": " being trace we trace our heritage to the same family we understand that here in"
    },
    {
      "id": 46,
      "start": 2033.6199645996094,
      "end": 2037.219970703125,
      "text": " the passage of Scripture that God would give us that truth and speak to us about"
    },
    {
      "id": 47,
      "start": 2037.219970703125,
      "end": 2042.0599670410156,
      "text": " that but I want you to notice the truth that Paul would share that is consistent"
    },
    {
      "id": 48,
      "start": 2042.0599670410156,
      "end": 2045.1799621582031,
      "text": " with what we find in the book of Genesis here in the 10th chapter and"
    },
    {
      "id": 49,
      "start": 2045.1799621582031,
      "end": 2050.219970703125,
      "text": " even if you would drill back further to Adam and Eve obviously by them you"
    },
    {
      "id": 50,
      "start": 2050.219970703125,
      "end": 2053.8999633789062,
      "text": " eventually get to Noah and then of course everyone's killed during the"
    },
    {
      "id": 51,
      "start": 2053.8999633789062,
      "end": 2059.179962158203,
      "text": " flood and so we retrace back to just Noah at that particular point in Acts"
    },
    {
      "id": 52,
      "start": 2059.179962158203,
      "end": 2064.6199645996094,
      "text": " chapter number 17 now understand in Acts chapter number 17 the Apostle Paul had"
    },
    {
      "id": 53,
      "start": 2064.6199645996094,
      "end": 2069.6199645996094,
      "text": " been faithful preaching he had been in various cities preaching the Word of God"
    },
    {
      "id": 54,
      "start": 2069.6199645996094,
      "end": 2074.7799682617188,
      "text": " and dealing with great levels of persecution and opposition the Bible"
    },
    {
      "id": 55,
      "start": 2074.7799682617188,
      "end": 2078.4599609375,
      "text": " tells us that they were to leave Berea and they took Paul and they were going"
    },
    {
      "id": 56,
      "start": 2078.4599609375,
      "end": 2082.3799743652344,
      "text": " to send him to Athens and they were gonna send him there for the purpose of"
    },
    {
      "id": 57,
      "start": 2082.3799743652344,
      "end": 2086.97998046875,
      "text": " kind of getting some rest if you will and the Apostle Paul is there in Athens"
    },
    {
      "id": 58,
      "start": 2086.97998046875,
      "end": 2091.6599731445312,
      "text": " and the Bible tells us in verse number 16 of Acts 17 that now while Paul waited"
    },
    {
      "id": 59,
      "start": 2091.6599731445312,
      "end": 2095.8599548339844,
      "text": " for them in Athens his spirit was stirred in him when he saw the city"
    },
    {
      "id": 60,
      "start": 2095.8599548339844,
      "end": 2101.2999572753906,
      "text": " wholly given to idolatry therefore disputed he in the synagogue with the"
    },
    {
      "id": 61,
      "start": 2101.2999572753906,
      "end": 2105.739959716797,
      "text": " Jews and with the devout persons and in the market daily with them that met with"
    },
    {
      "id": 62,
      "start": 2105.739959716797,
      "end": 2109.5399780273438,
      "text": " him we don't read the entirety of the passage but we find that the Apostle"
    },
    {
      "id": 63,
      "start": 2109.5399780273438,
      "end": 2115.499969482422,
      "text": " Paul he sees that Athens is a city that is wholly given to idolatry he mentions"
    },
    {
      "id": 64,
      "start": 2115.499969482422,
      "end": 2118.8599548339844,
      "text": " as he's preaching he stood in the midst of Mars Hill if you skip down to verse"
    },
    {
      "id": 65,
      "start": 2118.8599548339844,
      "end": 2122.97998046875,
      "text": " 22 you can see the reference there and he says of them he says I perceive that"
    },
    {
      "id": 66,
      "start": 2122.97998046875,
      "end": 2127.4199829101562,
      "text": " in all things you're too superstitious he tells him in verse number 23 he says"
    },
    {
      "id": 67,
      "start": 2127.4199829101562,
      "end": 2133.0599670410156,
      "text": " I pass by and behold beheld excuse me your devotions I found an altar with"
    },
    {
      "id": 68,
      "start": 2133.0599670410156,
      "end": 2139.259979248047,
      "text": " this inscription to the unknown God whom therefore ye ignorantly worship him"
    },
    {
      "id": 69,
      "start": 2139.259979248047,
      "end": 2147.8599548339844,
      "text": " declare I unto you so God is using the Apostle Paul in the city of Athens a"
    },
    {
      "id": 70,
      "start": 2147.8599548339844,
      "end": 2154.219970703125,
      "text": " city that was wholly given to idolatry a city that had all of these these false"
    },
    {
      "id": 71,
      "start": 2154.219970703125,
      "end": 2159.8199768066406,
      "text": " gods these idols they had all of these these altars if you will and they had"
    },
    {
      "id": 72,
      "start": 2159.8199768066406,
      "end": 2164.6599731445312,
      "text": " this altar with the inscription to the unknown God and Paul says I'm gonna"
    },
    {
      "id": 73,
      "start": 2164.6599731445312,
      "end": 2169.179962158203,
      "text": " declare him unto you and I want you to understand where Paul begins in verse"
    },
    {
      "id": 74,
      "start": 2169.179962158203,
      "end": 2176.3799743652344,
      "text": " number 24 he says God that made the world and all things therein what does"
    },
    {
      "id": 75,
      "start": 2176.3799743652344,
      "end": 2183.2999572753906,
      "text": " Paul go back to Genesis 1 right God's the Creator so let me go all the way"
    },
    {
      "id": 76,
      "start": 2183.2999572753906,
      "end": 2188.6199645996094,
      "text": " back to Genesis chapter 1 because I'm gonna declare this God Jehovah I'm gonna"
    },
    {
      "id": 77,
      "start": 2188.6199645996094,
      "end": 2193.0199584960938,
      "text": " declare him unto you I'm gonna reveal to you who he is I'm gonna make him known"
    },
    {
      "id": 78,
      "start": 2193.0199584960938,
      "end": 2200.8999633789062,
      "text": " make Christ known we find that this this passage would record for us the way in"
    },
    {
      "id": 79,
      "start": 2200.8999633789062,
      "end": 2204.739959716797,
      "text": " which Paul deals with it he says seeing that he is Lord of heaven and earth"
    },
    {
      "id": 80,
      "start": 2204.739959716797,
      "end": 2209.5799560546875,
      "text": " dwelleth not in temples made with hands neither is worshipped with men's hands"
    },
    {
      "id": 81,
      "start": 2209.5799560546875,
      "end": 2213.939971923828,
      "text": " as though he needed anything saying he giveth to all life and breath and all"
    },
    {
      "id": 82,
      "start": 2213.939971923828,
      "end": 2221.259979248047,
      "text": " things verse 26 and that's made of one blood all nations of men for to dwell on"
    },
    {
      "id": 83,
      "start": 2221.259979248047,
      "end": 2224.6199645996094,
      "text": " all the face of the earth and hath determined the times before appointed"
    },
    {
      "id": 84,
      "start": 2224.6199645996094,
      "end": 2231.8999633789062,
      "text": " and the bounds of their habitation we really look here in in Acts chapter 17"
    },
    {
      "id": 85,
      "start": 2231.8999633789062,
      "end": 2237.739959716797,
      "text": " and we see how that the truth of what we find back in the book of Genesis with"
    },
    {
      "id": 86,
      "start": 2237.739959716797,
      "end": 2244.499969482422,
      "text": " regard to the overspreading of the earth the population after the flood that"
    },
    {
      "id": 87,
      "start": 2244.499969482422,
      "end": 2247.8199768066406,
      "text": " which is recorded for us in Genesis chapter number 10 we see that the"
    },
    {
      "id": 88,
      "start": 2247.8199768066406,
      "end": 2253.4199829101562,
      "text": " Apostle Paul as he's preaching to the people in Athens he absolutely without"
    },
    {
      "id": 89,
      "start": 2253.4199829101562,
      "end": 2258.97998046875,
      "text": " any doubt whatsoever is really confirming for us the truth that we find"
    },
    {
      "id": 90,
      "start": 2258.97998046875,
      "end": 2262.3799743652344,
      "text": " the book of Genesis he's going all the way back and he's saying listen there's"
    },
    {
      "id": 91,
      "start": 2262.3799743652344,
      "end": 2267.3399658203125,
      "text": " he's made of all nations one blood and so we find that as we look here in"
    },
    {
      "id": 92,
      "start": 2267.3399658203125,
      "end": 2272.3799743652344,
      "text": " Genesis chapter number 10 that yes we find this record of the generations of"
    },
    {
      "id": 93,
      "start": 2272.3799743652344,
      "end": 2277.0599670410156,
      "text": " the sons of Noah and we find that we can go through and we can begin to look at"
    },
    {
      "id": 94,
      "start": 2277.0599670410156,
      "end": 2281.259979248047,
      "text": " all of the names and try to determine the particular people groups throughout"
    },
    {
      "id": 95,
      "start": 2281.259979248047,
      "end": 2286.259979248047,
      "text": " history and kind of see the areas in which they were divided and moved to"
    },
    {
      "id": 96,
      "start": 2286.259979248047,
      "end": 2290.3399658203125,
      "text": " according to that which took place in Genesis chapter 11 we see some of the"
    },
    {
      "id": 97,
      "start": 2290.3399658203125,
      "end": 2294.4599609375,
      "text": " highlights that are given with regard to some of the individuals that are"
    },
    {
      "id": 98,
      "start": 2294.4599609375,
      "end": 2298.97998046875,
      "text": " mentioned but we find that as we would take away from this passage of scripture"
    },
    {
      "id": 99,
      "start": 2298.97998046875,
      "end": 2304.6199645996094,
      "text": " that we must be reminded there was indeed a global flood don't let the"
    },
    {
      "id": 100,
      "start": 2304.6199645996094,
      "end": 2313.259979248047,
      "text": " scoffers cause you to doubt what God has given us in his word you give an inch"
    },
    {
      "id": 101,
      "start": 2313.259979248047,
      "end": 2318.1799926757812,
      "text": " and they're gonna take a mile just the way it's gonna work and so we must"
    },
    {
      "id": 102,
      "start": 2318.1799926757812,
      "end": 2322.6599731445312,
      "text": " stand on the truth of the fact that yes there was a flood it's recorded in six"
    },
    {
      "id": 103,
      "start": 2322.6599731445312,
      "end": 2326.2599487304688,
      "text": " through eight but we find it referenced here in verse 1 and 32 of our text not"
    },
    {
      "id": 104,
      "start": 2326.2599487304688,
      "end": 2329.4599609375,
      "text": " only that there are eight human beings that survived they were obedient to the"
    },
    {
      "id": 105,
      "start": 2329.4599609375,
      "end": 2333.699951171875,
      "text": " command that God gave in Genesis chapter 9 and there is one human race and all of"
    },
    {
      "id": 106,
      "start": 2333.699951171875,
      "end": 2339.4199829101562,
      "text": " us every single one of us trace our heritage to the same family if we take a"
    },
    {
      "id": 107,
      "start": 2339.4999389648438,
      "end": 2345.6199951171875,
      "text": " biblical approach it solves a lot of the world's problems amen all of them thank"
    },
    {
      "id": 108,
      "start": 2345.6199951171875,
      "end": 2352.6199951171875,
      "text": " you because Jesus is the answer right what is our God is a God of order I"
    },
    {
      "id": 109,
      "start": 2352.6199951171875,
      "end": 2359.2599487304688,
      "text": " believe that he's not the author of confusion right he's a God of order and"
    },
    {
      "id": 110,
      "start": 2359.2599487304688,
      "end": 2364.2599487304688,
      "text": " we find that as a God of orders you begin to study here in Genesis and other"
    },
    {
      "id": 111,
      "start": 2364.2599487304688,
      "end": 2369.3399658203125,
      "text": " portions of scripture you find that there's order in creation you find that"
    },
    {
      "id": 112,
      "start": 2369.3399658203125,
      "end": 2375.4599609375,
      "text": " there's order in the institutions that he established there's order in the"
    },
    {
      "id": 113,
      "start": 2375.4599609375,
      "end": 2381.6599731445312,
      "text": " home God established order there's order in government by the way God ordained"
    },
    {
      "id": 114,
      "start": 2381.6599731445312,
      "end": 2387.2999877929688,
      "text": " government and he gave instruction in order for government and we find that"
    },
    {
      "id": 115,
      "start": 2387.2999877929688,
      "end": 2392.5399780273438,
      "text": " there is order for the church God ordained the church and he gave"
    },
    {
      "id": 116,
      "start": 2392.5399780273438,
      "end": 2396.5399780273438,
      "text": " instruction yeah Paul says to Timothy that thou oughtest that thou knowest how"
    },
    {
      "id": 117,
      "start": 2396.5399780273438,
      "end": 2403.1799926757812,
      "text": " thou oughtest to behave thyself in the church of God which is the the ground"
    },
    {
      "id": 0,
      "start": 2403.1799926757812,
      "end": 2404.9799926280975,
      "text": " and pillar of the truth."
    },
    {
      "id": 1,
      "start": 2404.9799926280975,
      "end": 2407.979992866516,
      "text": " And so we find that God is a God of order."
    },
    {
      "id": 2,
      "start": 2407.979992866516,
      "end": 2415.5799922943115,
      "text": " The enemy, Satan, is the author of confusion, chaos, right?"
    },
    {
      "id": 3,
      "start": 2415.5799922943115,
      "end": 2420.199993133545,
      "text": " And so we see the chaos and confusion that exists in our world today,"
    },
    {
      "id": 4,
      "start": 2420.199993133545,
      "end": 2425.059991836548,
      "text": " and we find that it can only be perpetuated at the rate in which it's perpetuated"
    },
    {
      "id": 5,
      "start": 2425.059991836548,
      "end": 2430.939992904663,
      "text": " because there's an ignorance to the truth of the author of this book."
    },
    {
      "id": 6,
      "start": 2430.939992904663,
      "end": 2435.57999420166,
      "text": " And when we understand the author of this book, that he is a God of order,"
    },
    {
      "id": 7,
      "start": 2435.57999420166,
      "end": 2438.419994354248,
      "text": " and we understand that Jesus is the answer"
    },
    {
      "id": 8,
      "start": 2438.419994354248,
      "end": 2443.8199920654297,
      "text": " and that every one of man's problems are solved by the truth of the Word of God,"
    },
    {
      "id": 9,
      "start": 2443.8199920654297,
      "end": 2448.2199935913086,
      "text": " we can come to an agreement that all of that chaos and confusion"
    },
    {
      "id": 10,
      "start": 2448.2199935913086,
      "end": 2452.4999923706055,
      "text": " can only be dealt with with turning to the Word of God."
    },
    {
      "id": 11,
      "start": 2452.4999923706055,
      "end": 2457.419994354248,
      "text": " What's happening in the midst of great levels of chaos and confusion"
    },
    {
      "id": 12,
      "start": 2457.419994354248,
      "end": 2464.6599922180176,
      "text": " are people trying to perpetuate their solutions, man's solutions."
    },
    {
      "id": 13,
      "start": 2464.6599922180176,
      "end": 2470.3799896240234,
      "text": " Man's solutions, carnal solutions, cannot solve a heart problem."
    },
    {
      "id": 14,
      "start": 2470.3799896240234,
      "end": 2472.459991455078,
      "text": " It's just not possible."
    },
    {
      "id": 15,
      "start": 2472.459991455078,
      "end": 2478.859992980957,
      "text": " You cannot, we find as we look throughout the time of Israel and Judah,"
    },
    {
      "id": 16,
      "start": 2478.859992980957,
      "end": 2482.259994506836,
      "text": " and we see the indictments that are laid against them by the prophets"
    },
    {
      "id": 17,
      "start": 2482.259994506836,
      "end": 2488.3399963378906,
      "text": " and God speaking to them betimes and telling them how that they called evil good and good evil,"
    },
    {
      "id": 18,
      "start": 2488.3399963378906,
      "end": 2493.459991455078,
      "text": " and you see all of the things that were going on in the nation of Israel and Judah"
    },
    {
      "id": 19,
      "start": 2493.459991455078,
      "end": 2498.2199935913086,
      "text": " and all of the wickedness, and we find that the answer is a heart issue."
    },
    {
      "id": 20,
      "start": 2498.2199935913086,
      "end": 2502.6999893188477,
      "text": " Last week I preached a message, the heart of the matter is a matter of the heart."
    },
    {
      "id": 21,
      "start": 2502.6999893188477,
      "end": 2505.3399963378906,
      "text": " As we look here in Genesis chapter number 10,"
    },
    {
      "id": 22,
      "start": 2505.3399963378906,
      "end": 2512.1799926757812,
      "text": " we find that God gives us important truth."
    },
    {
      "id": 23,
      "start": 2512.1799926757812,
      "end": 2518.4999923706055,
      "text": " See, when we walk away from the Bible, we cause ourselves more problems."
    },
    {
      "id": 24,
      "start": 2518.4999923706055,
      "end": 2523.57999420166,
      "text": " And when we try to then solve those problems apart from the Bible,"
    },
    {
      "id": 25,
      "start": 2523.57999420166,
      "end": 2528.2199935913086,
      "text": " we just continue to flounder around."
    },
    {
      "id": 26,
      "start": 2528.2199935913086,
      "end": 2529.8199920654297,
      "text": " And so we must have an agreement."
    },
    {
      "id": 27,
      "start": 2529.8199920654297,
      "end": 2532.699996948242,
      "text": " I've often said this, that as Baptist people,"
    },
    {
      "id": 28,
      "start": 2532.699996948242,
      "end": 2536.219985961914,
      "text": " we would say if someone were to ask us what our distinctives are,"
    },
    {
      "id": 29,
      "start": 2536.219985961914,
      "end": 2542.019989013672,
      "text": " that we would say first and foremost that the Bible is our sole authority for faith and practice."
    },
    {
      "id": 30,
      "start": 2542.019989013672,
      "end": 2546.8199920654297,
      "text": " Let's meet at the Word of God."
    },
    {
      "id": 31,
      "start": 2546.8199920654297,
      "end": 2550.0999908447266,
      "text": " Right? What's the problem? What's the issue? What are we trying to deal with?"
    },
    {
      "id": 32,
      "start": 2550.0999908447266,
      "end": 2552.539993286133,
      "text": " Okay, let's see what God says."
    },
    {
      "id": 33,
      "start": 2552.539993286133,
      "end": 2556.219985961914,
      "text": " And we take what God says and we just follow it."
    },
    {
      "id": 34,
      "start": 2556.219985961914,
      "end": 2558.0599975585938,
      "text": " Well, that doesn't work. Wrong."
    },
    {
      "id": 35,
      "start": 2558.0599975585938,
      "end": 2561.699996948242,
      "text": " Why? The Bible transcends time, right?"
    },
    {
      "id": 36,
      "start": 2561.699996948242,
      "end": 2563.979995727539,
      "text": " It's an eternal book."
    },
    {
      "id": 37,
      "start": 2563.979995727539,
      "end": 2565.739990234375,
      "text": " It's cross-cultural."
    },
    {
      "id": 38,
      "start": 2565.739990234375,
      "end": 2569.019989013672,
      "text": " Can I tell you that the Bible is not an American book?"
    },
    {
      "id": 39,
      "start": 2569.019989013672,
      "end": 2571.1799926757812,
      "text": " I shared this with somebody yesterday."
    },
    {
      "id": 40,
      "start": 2571.1799926757812,
      "end": 2574.5799865722656,
      "text": " I was having a conversation with someone and I said,"
    },
    {
      "id": 41,
      "start": 2574.5799865722656,
      "end": 2581.779998779297,
      "text": " you know, the Bible wasn't written after the United States of America was set up as a nation."
    },
    {
      "id": 42,
      "start": 2581.779998779297,
      "end": 2588.8599853515625,
      "text": " The Bible wasn't the result of having a constitution, a bill of rights, amendments, so on and so forth."
    },
    {
      "id": 43,
      "start": 2588.8599853515625,
      "end": 2593.739990234375,
      "text": " The Bible was written well, well, well before that. Amen?"
    },
    {
      "id": 44,
      "start": 2593.739990234375,
      "end": 2598.6199951171875,
      "text": " And so therefore, the truth of this book works anywhere"
    },
    {
      "id": 45,
      "start": 2598.6199951171875,
      "end": 2601.3799896240234,
      "text": " because it's cross-cultural, it's eternal."
    },
    {
      "id": 46,
      "start": 2601.3799896240234,
      "end": 2606.8199920654297,
      "text": " And so we must determine that we say, okay, what are the problems in our world today?"
    },
    {
      "id": 47,
      "start": 2606.8199920654297,
      "end": 2611.019989013672,
      "text": " Are there some problems in our nation today with regard to partiality?"
    },
    {
      "id": 48,
      "start": 2611.019989013672,
      "end": 2613.8199920654297,
      "text": " Absolutely."
    },
    {
      "id": 49,
      "start": 2613.8199920654297,
      "end": 2617.3399963378906,
      "text": " The Bible tells us we're all of one blood."
    },
    {
      "id": 50,
      "start": 2617.3399963378906,
      "end": 2620.739990234375,
      "text": " It solves it. Amen?"
    },
    {
      "id": 51,
      "start": 2620.739990234375,
      "end": 2623.8599853515625,
      "text": " It solves it that fast."
    },
    {
      "id": 52,
      "start": 2623.8599853515625,
      "end": 2627.1399993896484,
      "text": " But man has taken a different approach."
    },
    {
      "id": 53,
      "start": 2627.1399993896484,
      "end": 2633.8599853515625,
      "text": " And we understand that it is important that we agree with God, that we agree with God."
    },
    {
      "id": 54,
      "start": 2633.8599853515625,
      "end": 2638.1399993896484,
      "text": " God said it, that settles it. Right?"
    },
    {
      "id": 55,
      "start": 2638.1399993896484,
      "end": 2643.0599975585938,
      "text": " Somebody interjected in between there, God said it, I believe it, that settles it."
    },
    {
      "id": 56,
      "start": 2643.0599975585938,
      "end": 2649.1799926757812,
      "text": " That's a problem because whether you believe it or not, if God said it, that settles it."
    },
    {
      "id": 57,
      "start": 2649.1799926757812,
      "end": 2653.219985961914,
      "text": " You can say, well, I'll tell you what my experience was. I don't care."
    },
    {
      "id": 58,
      "start": 2653.219985961914,
      "end": 2655.3399963378906,
      "text": " God said it, that settles it."
    },
    {
      "id": 59,
      "start": 2655.3399963378906,
      "end": 2661.8999938964844,
      "text": " You say, man, I'm not being unkind, I'm just saying the Bible is the Bible. Amen?"
    },
    {
      "id": 60,
      "start": 2661.8999938964844,
      "end": 2667.8999938964844,
      "text": " And what God said is what God said, and He said what He meant to say. Amen?"
    },
    {
      "id": 61,
      "start": 2667.8999938964844,
      "end": 2670.9400024414062,
      "text": " You ever say something and say, man, that didn't come out right?"
    },
    {
      "id": 62,
      "start": 2670.9400024414062,
      "end": 2676.6199951171875,
      "text": " If you've never said anything that didn't come out the way that you meant to do it, try preaching."
    },
    {
      "id": 63,
      "start": 2676.6199951171875,
      "end": 2679.739990234375,
      "text": " Amen? Because you say a whole lot of things."
    },
    {
      "id": 64,
      "start": 2679.739990234375,
      "end": 2683.8999938964844,
      "text": " But the reality is that God is perfect."
    },
    {
      "id": 65,
      "start": 2683.97998046875,
      "end": 2688.0599975585938,
      "text": " Every word of God is pure. Amen?"
    },
    {
      "id": 66,
      "start": 2688.0599975585938,
      "end": 2692.459991455078,
      "text": " And so God gives us the answers, and I'm so thankful for that."
    },
    {
      "id": 67,
      "start": 2692.459991455078,
      "end": 2696.8599853515625,
      "text": " Genesis chapter number 10, we'll get into chapter number 11 next week looking at the Tower of Babel."
    },
    {
      "id": 68,
      "start": 2696.8599853515625,
      "end": 2699.8999938964844,
      "text": " Let's pray. Father, we love you. We thank you for loving us."
    },
    {
      "id": 69,
      "start": 2699.8999938964844,
      "end": 2703.4199829101562,
      "text": " We thank you for the Word of God. We thank you for the truth that's contained therein."
    },
    {
      "id": 70,
      "start": 2703.4199829101562,
      "end": 2708.8599853515625,
      "text": " We thank you for the table of nations, if you will, that is provided to us here in chapter number 10"
    },
    {
      "id": 71,
      "start": 2708.8599853515625,
      "end": 2711.8200073242188,
      "text": " that gives us the generations of the sons of Noah."
    },
    {
      "id": 72,
      "start": 2711.8200073242188,
      "end": 2716.779998779297,
      "text": " We thank you for how you've provided us with this detail, and we thank you for the reminders,"
    },
    {
      "id": 73,
      "start": 2716.779998779297,
      "end": 2722.6199951171875,
      "text": " the principles that we find there in verse number 1 and verse number 32."
    },
    {
      "id": 74,
      "start": 2722.6199951171875,
      "end": 2730.6199951171875,
      "text": " God, I pray that you'd help us to believe your Word, to practice your Word, to live by your Word."
    },
    {
      "id": 75,
      "start": 2730.6199951171875,
      "end": 2735.1000061035156,
      "text": " We know that the Bible has the answer for man's problems."
    },
    {
      "id": 76,
      "start": 2735.1000061035156,
      "end": 2741.4199829101562,
      "text": " The problems in our nation, in our world, are many."
    },
    {
      "id": 77,
      "start": 2741.4199829101562,
      "end": 2744.779998779297,
      "text": " God, I pray that you would help us as your people"
    },
    {
      "id": 78,
      "start": 2744.779998779297,
      "end": 2752.220001220703,
      "text": " to take the approach of answering those questions with what thus saith the Lord."
    },
    {
      "id": 79,
      "start": 2752.220001220703,
      "end": 2757.6600036621094,
      "text": " We thank you for giving us the Bible. We thank you for allowing us to have it."
    },
    {
      "id": 80,
      "start": 2757.6600036621094,
      "end": 2761.6600036621094,
      "text": " It's been perfectly preserved for us, and what a joy that is."
    },
    {
      "id": 81,
      "start": 2761.6600036621094,
      "end": 2769.6600036621094,
      "text": " I pray that you'd help us to be, as we've often been referred to in years gone by, people of the book."
    },
    {
      "id": 82,
      "start": 2769.6600036621094,
      "end": 2772.779998779297,
      "text": " Pray that you'd have your will and way in our hearts this night, and we'll thank you for it."
    },
    {
      "id": 83,
      "start": 2772.779998779297,
      "end": 2774.779998779297,
      "text": " In Christ's name we pray, amen."
    },
    {
      "id": 84,
      "start": 2774.779998779297,
      "end": 2776.6199951171875,
      "text": " Would you stand with me? Heads are bowed, eyes are closed."
    },
    {
      "id": 85,
      "start": 2776.6199951171875,
      "end": 2777.6600036621094,
      "text": " We'll have a brief invitation."
    }
  ],
  "processed_at": "2025-04-17T15:48:22.713230"
}