{
  "video_id": "Pekao7m8BpQ",
  "text": "Galatians chapter number four, and thankful to have some folks visiting with us this morning. We do certainly hope and pray the service will be a blessing to you. Galatians chapter number four, we'll focus on verses four through seven. I'm going to begin reading in verse number one, and read down through our text this morning. Galatians chapter number four, and then we will dig into the message this morning. Beginning in verse number one, Galatians four, the Bible says, Now I say that the heir, as long as he is a child, differeth nothing from a servant, though he be lord of all, but is under tutors and governors until the time appointed of the father. Even so we, when we were children, notice, were in bondage under the elements of the world. But, I'm so thankful for that little word, a conjunction, and we find that here in this particular passage of Scripture, the truth that will be revealed to us in these next few verses is so powerful and so beautiful. It says, But, in verse number four, when the fullness of the time was come, God sent forth his Son, made of a woman, made under the law, to redeem them that were under the law, that we might receive the adoption of sons. And because you are sons, God hath sent forth the Spirit of his Son into your hearts, crying, Abba, Father, wherefore thou art no more a servant, but a son. And if a son, then an heir of God through Christ. It's a beautiful passage of Scripture that reminds us of our position in Christ, but also reminds us of the purpose of the incarnation in which we celebrate here at this particular time of year. For many, Christmas is their favorite time of year. No doubt you've heard people mention that they love this time of year and what have you. And really, it's easy for us to understand why someone would have that perspective. As believers, however, our perspective of Christmas should be different than those that do not know the Lord Jesus Christ as their personal Savior. There are some this morning that you could speak to that would say that this time of year, that the Christmas season is their favorite time of year, and yet they do not know the true purpose for which we celebrate this season, this holiday, if you will, this holy day, in which we celebrate the birth of our Lord and Savior, Jesus Christ. We understand this morning that we're not sure of the exact timing, the date in which Christ was born. We do not believe that it was December 25th, but we do find that on our calendar each year, we have an opportunity to be mindful of, to remember the truth that Jesus, God, became man. That He was born in a lowly manger, that He was born with a specific purpose. I know this morning that we've heard people say, and perhaps you've even read the bumper sticker, I've seen it from time to time, that would say this, So many today are walking around in our society as we see this cultural shift, and understand with me this morning, there's always going to be cultural wars, and really they're not cultural wars, they're spiritual wars. We call them, we sometimes hear people refer to them as being cultural wars, but really all they are is spiritual wars. There's been a spiritual warfare that's been brewing and battling from the time of the account in Genesis of the creation of man, and we understand that we are engaged in spiritual battle in this particular time and era. In fact, for a number of years now, you've seen a shift in our nation, away from people using the phrase, Merry Christmas, and replacing it with Happy Holidays. I'm not sure about you, but I insist, I am absolutely adamant on saying Merry Christmas. And when someone doesn't respond, I make sure that they hear me again, and I'm not trying to be rude or unkind, but I want to make sure that they hear me. I'm not necessarily demanding that they respond to me in like fashion, but I want to make sure that they've heard that I've said Merry Christmas, and we understand this morning. I mentioned it in Sunday School, listen, I even knew as a child that was lost, that did not go to church, we didn't even go to church on Christmas. And I knew, however, that Christmas was about the birth of Jesus. I didn't know why Jesus was born, I didn't understand all of the reason, but I knew that Christmas was about the birth of Jesus. We sang songs as a family. My dad, those young people don't even know what records are, but we had record players, and there was a time, and I remember I was about seven or eight years old, that my dad took all the records and copied them onto cassette tapes, and we were in business at that point because we had all the Christmas songs on cassette tapes, and we'd listen to the Christmas songs, and many of them, I said this again in Sunday School, many of those Christmas songs, even that you'll hear on worldly music stations, they sing about the birth of Christ. They sing about the glory, the joy of that moment in history when God became man. We refer to it as the incarnation. And I knew as a lost young boy that Christmas was about the birth of Jesus. I didn't understand all the reason, but I understood that. Now as a believer, oh, how overwhelmed and joyful I am to know that as we celebrate this time of year, though it's full of traditions, though it has been commercialized by our society, that you and I this morning, that we are blessed to know the true meaning by which we celebrate this holiday. I've titled the message here from Galatians 4 this morning, The Miracle of Christmas. The Miracle of Christmas. What is it about Christmas that would lead me, would lead you, would lead us to say that it's miraculous? As we look at our text of Scripture, I want you to see just a few thoughts, and I hope that this morning we would understand the miracle of Christmas. First, if you're taking notes, notice with me what God did. In verse number four, the Bible tells us what God did. It says this, but when the fullness of the time was come, God sent forth his Son. I want you to think about that phraseology, and we'll continue to dig through the portion of Scripture here in just a few moments as we make our way through it this morning. But notice with me that the Bible tells us that what God did was God sent forth his Son. That word sent forth carries with it the idea to dispatch. It really has this commentation, to send off to a destination for a purpose. Now, we sometimes hear of in some of the world today, you think about the police and law enforcement, first responders. They have dispatchers, and they dispatch someone to a position, a destination, for, with a purpose. Begin to think about this verse of Scripture when the Bible says God sent forth his Son. We find that this happened, according to verse number four, when the fullness of the time was come. We often speak about God's timing, and God's timing being perfect. And it is, it's impeccable, it's always right on time. And the Bible says that when the fullness of the time was come, God sent forth his Son. He sent him to a destination, this sin-cursed world, with a specific purpose. It really, not only was it a specific purpose, it was a singular purpose. And we find that we could look at some secondary, we could look at some things, and how, obviously, Peter mentions that he left us an example that we should follow his steps. But singularly, specifically, Jesus was sent to redeem mankind. He came to this sin-cursed world, the world that he created, the world that he created in perfect shape. And we find that he, in perfection, created the world, he created man. In that state of innocency, we understand that the enemy, Satan himself, came into that garden and he tempted Eve. And at that moment, according to Genesis chapter number three, sin entered into the world. But I want us to understand this morning, that it wasn't at that time, in Genesis three, that God determined, I'm going to send forth my Son. No, it was determined even before the foundation of the world. Why do we say that? Well, because the Bible says that. And God tells us that he is eternal. And the Bible tells us that Jesus is eternal and that he is the Lamb of God that was slain before the foundation of the world. We begin to think about what God did and God sent forth his Son. When did it happen? When the fullness of the time was come. And we find that Jesus is eternal. He has no beginning and no ending. He is Alpha and Omega. If you read Revelation chapter number one, we won't take the time this morning, but it's a beautiful passage of scripture that reveals to us the person and nature of the Lord Jesus Christ and reveals to us his deity, that he is God. And we find here that as we look at this truth, that God sent forth his Son again to dispatch, to send off to a destination for a purpose, reminds us even in the verbiage here that God is, Jesus is eternal. He's God. Notice in John chapter number one. Take just a moment and turn back to the gospel of John, if you will. And I want you to see that the Bible reveals to us that Jesus, He is God and He is eternal. The Bible tells us here in John chapter number 1, again a very familiar passage of scripture for many of us this morning. And the Bible says in John chapter number 1, in the beginning was the Word. And the Word was with God and the Word was God. Isn't that beautiful? There's some modern translations that change that to say that He was a God. No, no, understand that He is God. He is God. The same was in the beginning with God. Notice all things were made by Him and without Him was not anything made that was made. In Him was life and the life was the light of men. Verse 14 says it this way. It says that in the Word, that same Word that we see in verses 1, in the beginning was the Word and the Word was with God and the Word was God. The Word was made flesh. That's what we're talking about in Galatians chapter number 4. When the fullness of the time was come, God sent forth His Son. He was made flesh, notice, and dwelt among us. And we beheld His glory. John is writing under the inspiration of the Holy Spirit of God. John is one of the disciples and he's saying we plural because the other disciples, we beheld His glory. Notice the glory is of the only begotten of the Father, full of grace and truth. John bear witness of Him. Now understand this is not the writer of the Gospel of John. No, this John that's referred to in verse number 15, this is John the Baptist. And the Bible says John bear witness of Him. John was the one that was a voice crying in the wilderness. He's the one that said behold the Lamb of God which taketh away the sin of the world. And the Bible says that John bear witness of Him and cried saying this was He of whom I spake, He that cometh after me. He's referring to a position of time in the fact that John the Baptist was born first. He's a cousin of Jesus Christ, fleshly speaking of the flesh, and he says that He that cometh after me, notice, is preferred before me. Why? For He was before me. In one verse of Scripture, John the Baptist as he's testifying of the Lord Jesus Christ, he's speaking of His birth after me, I am older physically, but He's preferred before me. Why? Because He is eternal. It's an amazing truth. And the Bible says that God, what He did was He sent forth His Son and Jesus is eternal. Jesus in fact in John 17, you don't need to turn there, I'll read the verse for you, but in verse number 5 of John 17, Jesus is praying, this is right before He goes to the cross of Calvary, and He says this in verse number 5, and now O Father, glorify Thou me with Thine own self, with the glory which I had with Thee before the world was. Now if He's not God, He could never make that statement. You can't make that statement, I can't make that statement, but because Jesus is God and He's eternal, He's able to say with the glory, notice that it says here, which I had with Thee before the world was. God sent forth His Son. That's what God did. That's miraculous. We find that this event that we look to, this truth of the incarnation, this moment in history that we celebrate here at the Christmas season, this was something that had been prophesied in the Old Testament. You could look in the book of Genesis, even in the third chapter, at the time in which God is speaking with Adam and Eve after sin entered, and you find that God there gives the first promise of the Messiah who would come. In Genesis 3 and verse 15, you can read in the book of Numbers, you think about the wise men with the star, and they see about that truth really from Numbers chapter 24. You can find throughout the Old Testament prophecy after prophecy with regard to the birth of Christ, the incarnation, the miracle of Christmas, that God sent forth His Son. When? When the fullness of time was come. We look at these prophecies and we can rejoice in the prophecies that God gave us, and notice as you consider the prophecies that God spoke, not only of the truth that He would send forth His Son that Messiah would be born, He reveals to us in the prophecies not only the truth that He would be born, but where He would be born and how He would be born. It's amazing when you consider the prophecies with regard to the first coming of the Lord Jesus Christ. And all of those prophecies were fulfilled on that night. As you read the accounts, we'll read them tonight in the book of Luke and in the book of Matthew, and you read those accounts and the angel that comes and announces the birth of Christ, I mean what joy! And even the angel that announced to Mary about the truth of the birth and how miraculous this is, and we find it was prophesied. In Micah 5 it prophesies of the place in which Jesus would be born. In Daniel 9 it prophesies of the timing in which Jesus would be born. It's interesting to me that even the Jewish people that had the scriptures, that should have known not only the timing and the place, that they weren't really looking for the birth of the Messiah. When those wise men come, they say, where is He that is born, King of the Jews? Herod's paranoid, he's always paranoid anyway if you study his life and all the things about him, he's a paranoid individual, and he's paranoid because the greeting is, where is He that is born, King of the Jews? So what does he do? He inquires with the scribes and they say, oh, in Bethlehem, Ephrathah. For thus it is prophesied. They knew the prophecy, but they weren't looking for the Messiah. Isaiah 9 in verse number 6 tells us that His name shall be called wonderful. Let's actually look at it. Isaiah 9 in verse number 6, oh, it's beautiful to consider the promise here in Isaiah 9 with regard to the truth of this, what God did. He sent forth His Son. In Isaiah 9 in verse number 6, notice the Bible says, for unto us a child is born. But then notice it says this, unto us a son is given. A child is born, a son is given. God sent forth His Son. We see that in Galatians 4 and verse number 4, that what did God do? He sent forth His Son. When the fullness of the time was come, God sent forth His Son. And it says here in Isaiah 9 in verse number 6, for unto us a child is born, unto us a son is given. And the government shall be upon His shoulder, and His name shall be called wonderful, Counselor, the mighty God, the everlasting Father, the Prince of Peace. Wow, that's our Savior. What did God do? Well, God sent forth His Son. Notice back in Galatians chapter 4, notice how God did it, number 2. We notice what God did, but notice how God did it. The Bible tells us this in verse number 4, but when the fullness of the time was come, God sent forth His Son, then notice, made of a woman, made under the law. We see here in Galatians 4 and verse number 4, when we consider not only what God did, but how God did it, we see the truth of the virgin birth. Miraculous in every sense of the word. The truth that God would send forth His Son, but it says that Jesus, made of a woman, made under the law. We understand this truth of the virgin birth of Christ, and we understand that because of this truth, and because of the way in which God did this, He sent forth His Son, but He sent Him forth made of a woman, and we find the truth of the virgin birth, it's miraculous in every sense of the word, and we find that He would have no human, earthly Father, there'd be no sin nature. He's sinless. He's without sin. He's God. And you begin to think about this, turn back again, I just had you in Isaiah 9, but look at Isaiah 7 if you will, and then we'll go over to the book of Luke just for a moment, but look in Isaiah chapter number 7, and again, one of these prophecies with regard to the coming of Messiah and understanding the truth that God gives us here, even in the Old Testament about this day, this day of Christmas that we celebrate, the birth of our Messiah, the birth of the Lord Jesus Christ, the Bible says in Isaiah 7 in verse 14, it says, This therefore the Lord Himself shall give you a sign, what is this sign? Notice, behold, a virgin. The virgin shall conceive and bear a son and shall call his name Immanuel. Again I mentioned about some of the modern translations they say in John 1 that he was a God instead of he is God and then we find here in Isaiah 7 14 that some change the word virgin to a young maid. Can I tell you this morning that's not the same. Amen? It is not the same. And here the Bible says that the sign that God would give is that a virgin shall conceive and bear a son and shall call his name Immanuel. Now look at what the Bible says in Luke chapter number 1 and think about for generations of people from this announcement in Isaiah chapter number 7 this prophecy with regard to the manner in which God would send forth his son the Messiah that he would be born of a woman, born of a virgin. In Luke chapter number 1 in verse number 26 the Bible says in the sixth month the angel Gabriel was sent from God unto a city of Galilee named Nazareth. Notice what the Bible says to a virgin espoused to a man whose name was Joseph to the house of David and the virgin's name was Mary. Was Mary. You see that the Bible references twice in verse number 27 that she was a virgin. Yes she was espoused to a man whose name was Joseph but understand that even as this announcement comes in verse number 28 the Bible says that the angel came in unto her and said hail thou that are highly favored the Lord is with thee blessed art thou among women. And when she saw him she was troubled at this saying and cast in her mind what manner of salutation this should be and the angels said unto her fear not Mary for thou has found favor with God and behold thou shalt conceive in thy womb and bring forth a son and shalt call his name Jesus. The Bible says in verse 32 and he shall be great and shall be called the son of the highest and the Lord God shall give unto him the throne of his father David and he shall reign over the house of Jacob forever and of his kingdom there shall be no end and we won't take the time this morning but you can see in verse 32 and 33 the fulfillment of the Davidic covenant through the Lord Jesus Christ but then notice verse 34 notice the response of Mary then said Mary unto the angel how shall this be seeing I know not a man. What's she referring to here? She's referring to her chaste her purity that we find as it's mentioned in verse 27 that she's a virgin remember in Isaiah 7 in verse number 14 the sign is going to be that a virgin would bring forth a son and shall call his name Emmanuel and here she says how can this thing be she understood just like most of us understand this morning the process in which birth is conception is given by God and she says how shall this be seeing I know not a man and the angel answered and said unto her the Holy Ghost shall come upon thee and the power of the highest shall overshadow thee therefore also that holy thing which shall be born of thee shall be called the son of God. Wow miraculous in every sense of the word. The Bible says in verse 36 and behold thy cousin Elizabeth she hath also conceived a son in her old age and this is the sixth month with her who was called barren. That's another miracle in of itself but a miracle of conception between Elizabeth and Zacharias and God allowed them to have a son John the Baptist it's mentioned here of that truth that she had conceived in her old age but then notice this phrase in verse 37 for with God nothing shall be impossible. You say explain to me the virgin birth it's miraculous it's miraculous it is God sending forth his son made of a woman made under the law see Jesus had to come in the form of a man he's the God man he never stopped being God but he had to come as a man so that he could die for you and for me. He could not come as an angel he could not come as any other no he had to come as a man made under the law and notice with me that as we look at this portion of scripture in Galatians 4 we notice not only what God did and how God did it but number three we consider this morning why God did it why did God do it well in Galatians chapter number four and verse number five the Bible says to redeem them that were under the law that we might receive the adoption of sons you know who them and we you know that is that's us that's humanity that's humanity to redeem them that were under the law you know every human being that's been born upon this earth outside of the Lord Jesus Christ God and flesh the God man has been born under the law sinners with a sinful nature and here the Bible says that not only as we consider the truth of verse four and verse number five of Galatians 4 not only was the birth of Christ prophesied but we find that it had a specific purpose remember when the Bible said in verse number four that God sent forth his son that word means to dispatch it means to send off to a destination remember this for a purpose the purpose is given to us in verse number five to redeem them that were under the law that we might receive the adoption of sons and that word redeem means to ransom Christ freeing from the dominion of the law through his vicarious death and subsequent resurrection you know there's only one way to be redeemed only one way to be redeemed we sing about redemption we sing redeemed redeemed redeemed by the blood of the lamb and that's the only way to be redeemed there's no other way to be redeemed redemption is only through the Lord Jesus Christ and we find in the passage of scripture here when we consider this truth of redemption we are aware of the fact that it's motivated by love that mankind can only be redeemed and needed to be redeemed because of our sin our sin separated us from a holy God and we needed redemption it's only possible through the Lord Jesus Christ through his blood that would be shed and then his resurrection we find that it's motivated by love why would we say such a thing for John 3 16 says for God so loved the world that he gave his only begotten Son that whosoever believeth in him should not perish but have everlasting life it's motivated by love for God so loved the world so what did he do he he gave his only begotten Son right here in Galatians 4 we see that the Bible says that God when the fullness of the time was come that God sent forth his Son and we find that the purpose is so that we could be redeemed the Bible tells us in the book of 1st Peter in verse in chapter number 1 and verses 18 through 21 the Bible teaches us about redemption here and the the only way by which mankind can be redeemed see for most people it's obvious and quite easy for us to acknowledge that we're sinners that we have violated God's law God's law by the way is a whole lot more than just the Ten Commandments but just by looking quickly at the Ten Commandments it's very easy for us to acknowledge that we are guilty the book of James says that if we've offended in one point we're guilty of all you say well I lined up pretty good I've kept most of them but you're guilty of all I would argue this morning that all of us have broken all of the Ten Commandments at some point in our lives and that reveals to us that we're guilty in just a chapter before in the book of Galatians you know what the Bible tells us about the law it cannot give life you know what the law does the law simply reveals to us that we're lost and the law points us to the one the only one that can redeem us the Lord Jesus Christ Galatians 3 refers to it as being a schoolmaster and you begin to think about the truth that God gives us there in that portion of Scripture he says that that that righteousness listen cannot come by the law Paul says it this way I do not frustrate the grace of God if righteousness came by the law then Christ is dead in vain but we know and we agree this morning that Christ's death on the cross of Calvary was not in vain it was very purposed in 1st Peter chapter 1 in verse 18 the Bible says this for as much as you know now understand this morning that in 1st Peter the book of 1st Peter Peter is writing to believers he's writing to those that have been saved those that have trusted the Lord Jesus Christ as their personal Savior how do we know that well you read the first chapter the first few verses and you understand that he's writing to believers. He's not writing to those that have not yet trusted Christ. He's writing to those that have been scattered abroad that have trusted Christ as their Savior. And as he's talking to that audience, he says that you know, for as much as ye know. Now, some, and maybe even some here this morning under the sound of my voice, whether they're here locally or tuned in via live stream, they do not know the truth of redemption. For many of us here this morning, we do know the truth of redemption, and we know that we've been redeemed with the precious blood of Christ, but maybe some would not be able to say that they know, and it says here that you were not redeemed with corruptible things, as silver and gold from your vain conversation received by tradition from your fathers. But notice verse 19, but with the precious blood of Christ, as of a lamb without blemish and without spot, who verily was for ordained before the foundation of the world, but was manifest in these last times for you. How was he manifest? The incarnation. This truth that we're speaking about in Galatians chapter number four, when the fullness of time was come, God sent forth his son. This is how he was made manifest. Notice in verse 21, who by him do believe in God that raised him up from the dead and gave him glory that your faith and hope might be in God. The truth that we find here this morning, we find in Galatians chapter number four, what God did, God sent forth his son. We notice and we understand this morning how God did it. He sent forth his son made of a woman, made under the law. We find that the virgin birth is miraculous. We find that the reason that God did it, why did God do this? Why did God send forth his son? To redeem. Miraculous. The miracle of Christmas. And we find again, that as we look at this portion of scripture, that God gives us some wonderful truth with regard to the purpose and the fulfillment of this purpose. Notice it says in verse number five, again and back in Galatians four, to redeem them that were under the law that we might receive the adoption of sons. Now this begins to really help us understand our position in Christ. Someone that's here this morning, if you've been saved, if you've been born again, if you've recognized that you're a guilty sinner, that Jesus Christ is the only savior and that there's no other way to heaven, it's only through the blood of Christ, the encouragement to you this morning would be trust Christ as your savior. Today is the day of salvation. For every child of God that's here this morning, I want us to rejoice in our position in Christ. And if you've not been saved, if you get saved, if you trust Christ as your savior, this too would be your position in Christ. Notice it says that we receive the adoption of sons. This truth of adoption that God reveals to us here in this portion of scripture. He then says this in verse six, and because your sons, God had sent forth the spirit of his son into your hearts. What does it say? Crying, Abba, father. Now, all of a sudden, I have a relationship with God that I did not have prior to trusting Christ as my savior. I was an enemy of Christ. I was at enmity. I needed to be reconciled. And the only way for me to be reconciled, the only way for me to be redeemed was through the work of Christ, God in flesh, the miracle of Christmas, the incarnation. And that was the only way that I could be, that you could be reconciled and redeemed. We find that He then tells us that we have this relationship with God wherein we cry, Abba, father. I'm so thankful that God is my father. The idea of the word Abba is a very intimate word, a word that maybe we would use in our culture and our society today of daddy. It's an intimate... Listen, I'm thankful that God is a personal God. I'm thankful this morning that He's my father and I can go to Him on the basis of my sonship, that I can go to Him and understanding that He's my father and I'm His son. I have this relationship. I've been adopted into the family of God. We sing the song, hallelujah, I'm adopted. I'm a child of the King. And it's a wonderful truth. And it's a truth that's based on biblical truth as we would sing that song. And we find here this morning that we, if you've trusted Christ, that you now, you've been adopted, you're a son, you have that sonship, that relationship. You know something that's beautiful about relationship is it doesn't change. Relationship doesn't change. I'm a son. You're either a son or a daughter here this morning. Everyone that's here this morning has parents. Now your parents may still be living, your parents may not be living any longer, but every one of us have parents. Do you agree? This is real basic, kindergarten, amen. We all have parents. In your relationship with your parents, you're their child. You're their son or their daughter. No matter what circumstances happen, no matter what events would transpire in your life, they are always your parents and you're always their child. Do we agree? I know that in our society today, you have this thing where there are children that are divorcing their parents. It's wild, it's unbelievable that this concept could even take place. But even if you get a paper that says that you're divorced from your parents, the truth, the reality is that you're still their child. There's nothing that can change that relationship. And I love the fact that God uses the terminology that we are sons. This legal transaction of adoption that he refers to here, this sonship that we receive at the moment of salvation, I have a relationship with God. Oh yes, the truth is that my fellowship with God may vary from day to day. But one thing that's constant, one thing that will never change is my relationship with God, that he's my father and I'm his son. How is this made possible? The miracle of Christmas. The fact that God sent forth his son. The fact that he came with a purpose to redeem them that were under the law. And I now have this newfound relationship. And again, though my fellowship may change, just like your fellowship and my fellowship with my earthly parents would change from time to time. You go through that season, many go through that season of teenagers and there's some difficult years perhaps that are experienced between some parents and some children. But at the end of the day, you have a constant relationship. Your fellowship might be strained, but your relationship is, it remains. And this morning, we find that the miracle of Christmas is that we can become the sons of God. It says in verse number seven, as we continue reading here in this portion of scripture, wherefore thou art no more a servant, but a son. And if a son, notice what it says, then an heir of God through Christ. This is amazing. This is absolutely miraculous. As you begin to understand here this morning, the truth of Christmas, the miracle of Christmas, and how the Bible tells us that God, what he did is he sent forth his son. He dispatched the Lord Jesus Christ, God in flesh came to this earth with a purpose, the purpose to redeem, and we find that he offers to us sonship. But it's only through the Lord Jesus Christ. You can't become a son any other way. You can't work to become a son. You can't labor. You can't toil. There's nothing you can do. You have to simply receive his gift that he offers. The Bible says it this way in John one in verse number 12, but as many as received him, to them gave he power to become the sons of God, even to them that believe on his name. It's interesting in John one in verse 12, how it uses the word received and believe. We must believe that Jesus is God. We must recognize that he is who he says he is. He declared to be God in flesh and he is. We understand this morning that he's sinless. He's pure and he's holy. He went to a cruel cross and he was buried in a borrowed tomb. He rose conquering sin, death, and the grave. We must believe that truth. We must believe that there's no other way to get to heaven. Today, people are running around thinking they can get to heaven through some merit of their own. On the authority of God's word, there is no other way. Jesus said this, I am the way, the truth, and the life. It says this, no man cometh unto the father but by me. Peter would declare in the book of Acts as he's standing before the religious leaders, being questioned for the miracle that took place with the healing of a lame man. He says, neither is there salvation in any other. There's no other name under heaven given among men whereby we must be saved. What name was Peter referring to? Jesus, Jesus of Nazareth. God in flesh, and we find here this morning that we must believe those things, but then we must receive that gift that God offers. But as many as received Him, John 1 and verse number 12, to them gave He power to become the sons of God, even to them that believe on His name. And we receive that gift. See, believing is not simply an intellectual exercise. There's repentance that's involved. There's a turning away from our sin and from our own ideas about how we can approach God. There's a turn to God and a receiving of this truth that we've preached this morning and we've believed and then we receive. And the Bible says that He makes us sons. It says that we are no longer a servant but a son, and if a son, then an heir of God through Christ. It's absolutely amazing. It's miraculous. The Bible would tell us this in 1 John chapter 3 and verse number 1. It's a verse of Scripture that I've come to greatly appreciate. In 1 John 3 and verse number 1, when the Bible would say this, behold, what manner of love the Father hath bestowed upon us that we should be called the sons of God. For the world knoweth us not because it knew Him not. You notice the phrase there, behold, what manner of love the Father hath bestowed upon us that we should be called the sons of God. The miracle of Christmas, why is it this morning, I ask this question by way of introduction, why would we say that Christmas is miraculous? What is it about Christmas that would lead me or lead anyone else to say it's miraculous? Why would I title a message and spend a time preaching on the miracle of Christmas? Because truly when we understand the incarnation, it's miraculous. Every single aspect. The fact that God loved me so much, that God loved you so much that He sent forth His Son. He gave His only begotten Son. The virgin birth but then the purpose to redeem. I can't even imagine this morning going through life not knowing this truth. For years of my life we celebrated Christmas. I knew that we celebrated Christmas because of the birth of Jesus but it stopped there. I didn't understand why He was born. I didn't understand for what purpose He was born. I didn't even really understand how He was born. I just knew that we sang songs and we talked about Christmas was about Jesus being born. But you know really what it was most about for me was all the gifts and all of the family and traditions and all that sort of thing. But there was a day in my life when I was 17 years old that I recognized that I was a sinner in need of the only Savior. The one for whose birth, quote unquote, we had celebrated for 17 years. But never really knowing why and all of a sudden I understood the real miracle of Christmas. That God sent forth His Son so that I could be redeemed and I placed my faith and trust in Jesus Christ as my personal Savior. Just a few months later, it was in August when I got saved and the year was 97. Some of you weren't even alive. That first Christmas, Christmas of 97, was a Christmas unlike any other Christmas. Why? Because I had a clear understanding of what Christmas was really all about. And this morning, I hope that as we celebrate, it's Christmas Eve, tomorrow is Christmas. I hope that as we celebrate that we rejoice in knowing the true meaning of Christmas, the miracle of Christmas. I hope that today, this week, tomorrow as we gather with family and friends that perhaps God would give us an opportunity to speak of the miracle of Christmas. Because it's nothing short of miraculous. This morning, if you're saved, if you know the Lord Jesus Christ, I think you'd agree. Nothing short of miraculous. Let us rejoice in the miracle of Christmas. But this morning, if you're not saved, if you don't know for sure if heaven's your home, you say, I knew we celebrated Christmas, I've celebrated Christmas for years, but I never truly understood why. I didn't understand the implication. I didn't understand that Jesus, God in flesh, came so that I could be saved because I needed a savior because I was lost and because of my sin and because that I'm guilty, I was headed to a Christless eternity. Maybe this Christmas could be like that first Christmas for me back in 97 when you truly realize and recognize the miracle of Christmas. And you can accept that wonderful gift that God has for you, the gift of God which is eternal life through Jesus Christ our Lord. This morning, if you're not sure of heaven, oh, we would beg you to trust Christ this morning. Do not leave this place without knowing for sure. I mean 100% absolute certainty that heaven is your home, that you are a son of God, that you've been adopted into the family of God, the miracle of Christmas. We notice in our text of scripture what God did. We notice how He did it and we notice why He did it. Thank God for the miracle of the incarnation. Let's pray together. We love you this morning. We thank you for loving us. Lord, perhaps this morning there are many that are rejoicing in their salvation. They know that they've been adopted in the family of God. They're a child of yours, an heir of God through Christ. Lord, I pray that you'd help us to rejoice. Help us, Lord, to be vocal about the miracle of Christmas. Lord, perhaps there's one, maybe many, under the sound of my voice this morning that do not know the Lord Jesus Christ as their personal Savior. They've never been saved or born again. God, I pray the Holy Spirit in this moment would convict them of their sin of Christ's righteousness, of judgment to come. I pray, God, that they would not leave this place without knowing for sure that heaven is their home, that this Christmas would be like no other Christmas they've ever celebrated because they would have the knowledge of the true meaning, the miracle of Christmas. We pray that you'd have free reign, that you'd move and work as only you can. We'll thank you for what you'll do, for it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.0,
      "text": " Galatians chapter number four, and thankful to have some folks visiting with us this morning."
    },
    {
      "id": 1,
      "start": 5.0,
      "end": 9.0,
      "text": " We do certainly hope and pray the service will be a blessing to you."
    },
    {
      "id": 2,
      "start": 9.0,
      "end": 12.0,
      "text": " Galatians chapter number four, we'll focus on verses four through seven."
    },
    {
      "id": 3,
      "start": 12.0,
      "end": 16.0,
      "text": " I'm going to begin reading in verse number one, and read down through our text this morning."
    },
    {
      "id": 4,
      "start": 16.0,
      "end": 21.0,
      "text": " Galatians chapter number four, and then we will dig into the message this morning."
    },
    {
      "id": 5,
      "start": 21.0,
      "end": 23.0,
      "text": " Beginning in verse number one, Galatians four, the Bible says,"
    },
    {
      "id": 6,
      "start": 23.0,
      "end": 28.0,
      "text": " Now I say that the heir, as long as he is a child, differeth nothing from a servant,"
    },
    {
      "id": 7,
      "start": 28.0,
      "end": 33.0,
      "text": " though he be lord of all, but is under tutors and governors until the time appointed of the father."
    },
    {
      "id": 8,
      "start": 33.0,
      "end": 40.0,
      "text": " Even so we, when we were children, notice, were in bondage under the elements of the world."
    },
    {
      "id": 9,
      "start": 40.0,
      "end": 44.0,
      "text": " But, I'm so thankful for that little word, a conjunction,"
    },
    {
      "id": 10,
      "start": 44.0,
      "end": 49.0,
      "text": " and we find that here in this particular passage of Scripture,"
    },
    {
      "id": 11,
      "start": 49.0,
      "end": 55.0,
      "text": " the truth that will be revealed to us in these next few verses is so powerful and so beautiful."
    },
    {
      "id": 12,
      "start": 55.0,
      "end": 56.0,
      "text": " It says,"
    },
    {
      "id": 13,
      "start": 56.0,
      "end": 61.0,
      "text": " But, in verse number four, when the fullness of the time was come,"
    },
    {
      "id": 14,
      "start": 61.0,
      "end": 67.0,
      "text": " God sent forth his Son, made of a woman, made under the law,"
    },
    {
      "id": 15,
      "start": 67.0,
      "end": 73.0,
      "text": " to redeem them that were under the law, that we might receive the adoption of sons."
    },
    {
      "id": 16,
      "start": 74.0,
      "end": 80.0,
      "text": " And because you are sons, God hath sent forth the Spirit of his Son into your hearts, crying,"
    },
    {
      "id": 17,
      "start": 80.0,
      "end": 87.0,
      "text": " Abba, Father, wherefore thou art no more a servant, but a son."
    },
    {
      "id": 18,
      "start": 87.0,
      "end": 92.0,
      "text": " And if a son, then an heir of God through Christ."
    },
    {
      "id": 19,
      "start": 92.0,
      "end": 96.0,
      "text": " It's a beautiful passage of Scripture that reminds us of our position in Christ,"
    },
    {
      "id": 20,
      "start": 96.0,
      "end": 102.0,
      "text": " but also reminds us of the purpose of the incarnation in which we celebrate here"
    },
    {
      "id": 21,
      "start": 102.0,
      "end": 103.0,
      "text": " at this particular time of year."
    },
    {
      "id": 22,
      "start": 103.0,
      "end": 107.0,
      "text": " For many, Christmas is their favorite time of year."
    },
    {
      "id": 23,
      "start": 107.0,
      "end": 113.0,
      "text": " No doubt you've heard people mention that they love this time of year and what have you."
    },
    {
      "id": 24,
      "start": 113.0,
      "end": 118.0,
      "text": " And really, it's easy for us to understand why someone would have that perspective."
    },
    {
      "id": 25,
      "start": 118.0,
      "end": 122.0,
      "text": " As believers, however, our perspective of Christmas should be different"
    },
    {
      "id": 26,
      "start": 122.0,
      "end": 127.0,
      "text": " than those that do not know the Lord Jesus Christ as their personal Savior."
    },
    {
      "id": 27,
      "start": 127.0,
      "end": 132.0,
      "text": " There are some this morning that you could speak to that would say that this time of year,"
    },
    {
      "id": 28,
      "start": 132.0,
      "end": 136.0,
      "text": " that the Christmas season is their favorite time of year,"
    },
    {
      "id": 29,
      "start": 136.0,
      "end": 141.0,
      "text": " and yet they do not know the true purpose for which we celebrate this season,"
    },
    {
      "id": 30,
      "start": 141.0,
      "end": 144.0,
      "text": " this holiday, if you will, this holy day,"
    },
    {
      "id": 31,
      "start": 144.0,
      "end": 148.0,
      "text": " in which we celebrate the birth of our Lord and Savior, Jesus Christ."
    },
    {
      "id": 32,
      "start": 148.0,
      "end": 154.0,
      "text": " We understand this morning that we're not sure of the exact timing, the date in which Christ was born."
    },
    {
      "id": 33,
      "start": 154.0,
      "end": 159.0,
      "text": " We do not believe that it was December 25th, but we do find that on our calendar each year,"
    },
    {
      "id": 34,
      "start": 159.0,
      "end": 167.0,
      "text": " we have an opportunity to be mindful of, to remember the truth that Jesus, God, became man."
    },
    {
      "id": 35,
      "start": 167.0,
      "end": 173.0,
      "text": " That He was born in a lowly manger, that He was born with a specific purpose."
    },
    {
      "id": 36,
      "start": 173.0,
      "end": 178.0,
      "text": " I know this morning that we've heard people say, and perhaps you've even read the bumper sticker,"
    },
    {
      "id": 37,
      "start": 178.0,
      "end": 181.0,
      "text": " I've seen it from time to time, that would say this,"
    },
    {
      "id": 38,
      "start": 182.0,
      "end": 187.0,
      "text": " So many today are walking around in our society as we see this cultural shift,"
    },
    {
      "id": 39,
      "start": 187.0,
      "end": 192.0,
      "text": " and understand with me this morning, there's always going to be cultural wars,"
    },
    {
      "id": 40,
      "start": 192.0,
      "end": 196.0,
      "text": " and really they're not cultural wars, they're spiritual wars."
    },
    {
      "id": 41,
      "start": 196.0,
      "end": 201.0,
      "text": " We call them, we sometimes hear people refer to them as being cultural wars,"
    },
    {
      "id": 42,
      "start": 201.0,
      "end": 204.0,
      "text": " but really all they are is spiritual wars."
    },
    {
      "id": 43,
      "start": 204.0,
      "end": 208.0,
      "text": " There's been a spiritual warfare that's been brewing and battling"
    },
    {
      "id": 44,
      "start": 208.0,
      "end": 214.0,
      "text": " from the time of the account in Genesis of the creation of man,"
    },
    {
      "id": 45,
      "start": 214.0,
      "end": 219.0,
      "text": " and we understand that we are engaged in spiritual battle in this particular time and era."
    },
    {
      "id": 46,
      "start": 219.0,
      "end": 223.0,
      "text": " In fact, for a number of years now, you've seen a shift in our nation,"
    },
    {
      "id": 47,
      "start": 223.0,
      "end": 230.0,
      "text": " away from people using the phrase, Merry Christmas, and replacing it with Happy Holidays."
    },
    {
      "id": 48,
      "start": 230.0,
      "end": 237.0,
      "text": " I'm not sure about you, but I insist, I am absolutely adamant on saying Merry Christmas."
    },
    {
      "id": 49,
      "start": 237.0,
      "end": 240.0,
      "text": " And when someone doesn't respond, I make sure that they hear me again,"
    },
    {
      "id": 50,
      "start": 240.0,
      "end": 244.0,
      "text": " and I'm not trying to be rude or unkind, but I want to make sure that they hear me."
    },
    {
      "id": 51,
      "start": 244.0,
      "end": 248.0,
      "text": " I'm not necessarily demanding that they respond to me in like fashion,"
    },
    {
      "id": 52,
      "start": 248.0,
      "end": 252.0,
      "text": " but I want to make sure that they've heard that I've said Merry Christmas,"
    },
    {
      "id": 53,
      "start": 252.0,
      "end": 254.0,
      "text": " and we understand this morning."
    },
    {
      "id": 54,
      "start": 254.0,
      "end": 258.0,
      "text": " I mentioned it in Sunday School, listen, I even knew as a child that was lost,"
    },
    {
      "id": 55,
      "start": 258.0,
      "end": 262.0,
      "text": " that did not go to church, we didn't even go to church on Christmas."
    },
    {
      "id": 56,
      "start": 262.0,
      "end": 268.0,
      "text": " And I knew, however, that Christmas was about the birth of Jesus."
    },
    {
      "id": 57,
      "start": 268.0,
      "end": 273.0,
      "text": " I didn't know why Jesus was born, I didn't understand all of the reason,"
    },
    {
      "id": 58,
      "start": 273.0,
      "end": 277.0,
      "text": " but I knew that Christmas was about the birth of Jesus."
    },
    {
      "id": 59,
      "start": 277.0,
      "end": 279.0,
      "text": " We sang songs as a family."
    },
    {
      "id": 60,
      "start": 279.0,
      "end": 284.0,
      "text": " My dad, those young people don't even know what records are, but we had record players,"
    },
    {
      "id": 61,
      "start": 284.0,
      "end": 287.0,
      "text": " and there was a time, and I remember I was about seven or eight years old,"
    },
    {
      "id": 62,
      "start": 287.0,
      "end": 291.0,
      "text": " that my dad took all the records and copied them onto cassette tapes,"
    },
    {
      "id": 63,
      "start": 291.0,
      "end": 296.0,
      "text": " and we were in business at that point because we had all the Christmas songs on cassette tapes,"
    },
    {
      "id": 64,
      "start": 296.0,
      "end": 301.0,
      "text": " and we'd listen to the Christmas songs, and many of them, I said this again in Sunday School,"
    },
    {
      "id": 65,
      "start": 301.0,
      "end": 307.0,
      "text": " many of those Christmas songs, even that you'll hear on worldly music stations,"
    },
    {
      "id": 66,
      "start": 307.0,
      "end": 311.0,
      "text": " they sing about the birth of Christ."
    },
    {
      "id": 67,
      "start": 311.0,
      "end": 320.0,
      "text": " They sing about the glory, the joy of that moment in history when God became man."
    },
    {
      "id": 68,
      "start": 320.0,
      "end": 323.0,
      "text": " We refer to it as the incarnation."
    },
    {
      "id": 69,
      "start": 323.0,
      "end": 329.0,
      "text": " And I knew as a lost young boy that Christmas was about the birth of Jesus."
    },
    {
      "id": 70,
      "start": 329.0,
      "end": 332.0,
      "text": " I didn't understand all the reason, but I understood that."
    },
    {
      "id": 71,
      "start": 332.0,
      "end": 340.0,
      "text": " Now as a believer, oh, how overwhelmed and joyful I am to know that as we celebrate this time of year,"
    },
    {
      "id": 72,
      "start": 340.0,
      "end": 345.0,
      "text": " though it's full of traditions, though it has been commercialized by our society,"
    },
    {
      "id": 73,
      "start": 345.0,
      "end": 353.0,
      "text": " that you and I this morning, that we are blessed to know the true meaning by which we celebrate this holiday."
    },
    {
      "id": 74,
      "start": 353.0,
      "end": 356.0,
      "text": " I've titled the message here from Galatians 4 this morning,"
    },
    {
      "id": 75,
      "start": 356.0,
      "end": 359.0,
      "text": " The Miracle of Christmas."
    },
    {
      "id": 76,
      "start": 359.0,
      "end": 361.0,
      "text": " The Miracle of Christmas."
    },
    {
      "id": 77,
      "start": 361.0,
      "end": 368.0,
      "text": " What is it about Christmas that would lead me, would lead you, would lead us to say that it's miraculous?"
    },
    {
      "id": 78,
      "start": 368.0,
      "end": 372.0,
      "text": " As we look at our text of Scripture, I want you to see just a few thoughts,"
    },
    {
      "id": 79,
      "start": 372.0,
      "end": 377.0,
      "text": " and I hope that this morning we would understand the miracle of Christmas."
    },
    {
      "id": 80,
      "start": 377.0,
      "end": 381.0,
      "text": " First, if you're taking notes, notice with me what God did."
    },
    {
      "id": 81,
      "start": 381.0,
      "end": 384.0,
      "text": " In verse number four, the Bible tells us what God did."
    },
    {
      "id": 82,
      "start": 384.0,
      "end": 393.0,
      "text": " It says this, but when the fullness of the time was come, God sent forth his Son."
    },
    {
      "id": 83,
      "start": 393.0,
      "end": 398.0,
      "text": " I want you to think about that phraseology, and we'll continue to dig through the portion of Scripture"
    },
    {
      "id": 84,
      "start": 398.0,
      "end": 401.0,
      "text": " here in just a few moments as we make our way through it this morning."
    },
    {
      "id": 85,
      "start": 401.0,
      "end": 408.0,
      "text": " But notice with me that the Bible tells us that what God did was God sent forth his Son."
    },
    {
      "id": 86,
      "start": 408.0,
      "end": 412.0,
      "text": " That word sent forth carries with it the idea to dispatch."
    },
    {
      "id": 87,
      "start": 412.0,
      "end": 419.0,
      "text": " It really has this commentation, to send off to a destination for a purpose."
    },
    {
      "id": 88,
      "start": 419.0,
      "end": 428.0,
      "text": " Now, we sometimes hear of in some of the world today, you think about the police and law enforcement, first responders."
    },
    {
      "id": 89,
      "start": 429.0,
      "end": 438.0,
      "text": " They have dispatchers, and they dispatch someone to a position, a destination, for, with a purpose."
    },
    {
      "id": 90,
      "start": 438.0,
      "end": 445.0,
      "text": " Begin to think about this verse of Scripture when the Bible says God sent forth his Son."
    },
    {
      "id": 91,
      "start": 445.0,
      "end": 452.0,
      "text": " We find that this happened, according to verse number four, when the fullness of the time was come."
    },
    {
      "id": 92,
      "start": 452.0,
      "end": 456.0,
      "text": " We often speak about God's timing, and God's timing being perfect."
    },
    {
      "id": 93,
      "start": 456.0,
      "end": 459.0,
      "text": " And it is, it's impeccable, it's always right on time."
    },
    {
      "id": 94,
      "start": 459.0,
      "end": 465.0,
      "text": " And the Bible says that when the fullness of the time was come, God sent forth his Son."
    },
    {
      "id": 95,
      "start": 465.0,
      "end": 472.0,
      "text": " He sent him to a destination, this sin-cursed world, with a specific purpose."
    },
    {
      "id": 96,
      "start": 472.0,
      "end": 476.0,
      "text": " It really, not only was it a specific purpose, it was a singular purpose."
    },
    {
      "id": 97,
      "start": 476.0,
      "end": 481.0,
      "text": " And we find that we could look at some secondary, we could look at some things,"
    },
    {
      "id": 98,
      "start": 481.0,
      "end": 486.0,
      "text": " and how, obviously, Peter mentions that he left us an example that we should follow his steps."
    },
    {
      "id": 99,
      "start": 486.0,
      "end": 493.0,
      "text": " But singularly, specifically, Jesus was sent to redeem mankind."
    },
    {
      "id": 100,
      "start": 493.0,
      "end": 500.0,
      "text": " He came to this sin-cursed world, the world that he created, the world that he created in perfect shape."
    },
    {
      "id": 101,
      "start": 500.0,
      "end": 505.0,
      "text": " And we find that he, in perfection, created the world, he created man."
    },
    {
      "id": 102,
      "start": 505.0,
      "end": 513.0,
      "text": " In that state of innocency, we understand that the enemy, Satan himself, came into that garden and he tempted Eve."
    },
    {
      "id": 103,
      "start": 513.0,
      "end": 520.0,
      "text": " And at that moment, according to Genesis chapter number three, sin entered into the world."
    },
    {
      "id": 104,
      "start": 520.0,
      "end": 526.0,
      "text": " But I want us to understand this morning, that it wasn't at that time, in Genesis three,"
    },
    {
      "id": 105,
      "start": 526.0,
      "end": 530.0,
      "text": " that God determined, I'm going to send forth my Son."
    },
    {
      "id": 106,
      "start": 530.0,
      "end": 535.0,
      "text": " No, it was determined even before the foundation of the world."
    },
    {
      "id": 107,
      "start": 535.0,
      "end": 538.0,
      "text": " Why do we say that? Well, because the Bible says that."
    },
    {
      "id": 108,
      "start": 538.0,
      "end": 541.0,
      "text": " And God tells us that he is eternal."
    },
    {
      "id": 109,
      "start": 541.0,
      "end": 546.0,
      "text": " And the Bible tells us that Jesus is eternal and that he is the Lamb of God"
    },
    {
      "id": 110,
      "start": 546.0,
      "end": 550.0,
      "text": " that was slain before the foundation of the world."
    },
    {
      "id": 111,
      "start": 550.0,
      "end": 554.0,
      "text": " We begin to think about what God did and God sent forth his Son."
    },
    {
      "id": 112,
      "start": 554.0,
      "end": 557.0,
      "text": " When did it happen? When the fullness of the time was come."
    },
    {
      "id": 113,
      "start": 557.0,
      "end": 561.0,
      "text": " And we find that Jesus is eternal."
    },
    {
      "id": 114,
      "start": 561.0,
      "end": 564.0,
      "text": " He has no beginning and no ending. He is Alpha and Omega."
    },
    {
      "id": 115,
      "start": 564.0,
      "end": 568.0,
      "text": " If you read Revelation chapter number one, we won't take the time this morning,"
    },
    {
      "id": 116,
      "start": 568.0,
      "end": 574.0,
      "text": " but it's a beautiful passage of scripture that reveals to us the person and nature of the Lord Jesus Christ"
    },
    {
      "id": 117,
      "start": 574.0,
      "end": 578.0,
      "text": " and reveals to us his deity, that he is God."
    },
    {
      "id": 118,
      "start": 578.0,
      "end": 584.0,
      "text": " And we find here that as we look at this truth, that God sent forth his Son again to dispatch,"
    },
    {
      "id": 119,
      "start": 584.0,
      "end": 588.0,
      "text": " to send off to a destination for a purpose,"
    },
    {
      "id": 120,
      "start": 588.0,
      "end": 594.0,
      "text": " reminds us even in the verbiage here that God is, Jesus is eternal."
    },
    {
      "id": 121,
      "start": 594.0,
      "end": 597.0,
      "text": " He's God. Notice in John chapter number one."
    },
    {
      "id": 122,
      "start": 597.0,
      "end": 600.0,
      "text": " Take just a moment and turn back to the gospel of John, if you will."
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 607.4000000953674,
      "text": " And I want you to see that the Bible reveals to us that Jesus, He is God and He is eternal."
    },
    {
      "id": 1,
      "start": 607.4000000953674,
      "end": 612.7200002670288,
      "text": " The Bible tells us here in John chapter number 1, again a very familiar passage of scripture"
    },
    {
      "id": 2,
      "start": 612.7200002670288,
      "end": 614.6599998474121,
      "text": " for many of us this morning."
    },
    {
      "id": 3,
      "start": 614.6599998474121,
      "end": 619.9599990844727,
      "text": " And the Bible says in John chapter number 1, in the beginning was the Word."
    },
    {
      "id": 4,
      "start": 619.9599990844727,
      "end": 624.6000003814697,
      "text": " And the Word was with God and the Word was God."
    },
    {
      "id": 5,
      "start": 624.6000003814697,
      "end": 627.4400005340576,
      "text": " Isn't that beautiful?"
    },
    {
      "id": 6,
      "start": 627.4400005340576,
      "end": 632.1199989318848,
      "text": " There's some modern translations that change that to say that He was a God."
    },
    {
      "id": 7,
      "start": 632.1199989318848,
      "end": 635.439998626709,
      "text": " No, no, understand that He is God."
    },
    {
      "id": 8,
      "start": 635.439998626709,
      "end": 636.9199981689453,
      "text": " He is God."
    },
    {
      "id": 9,
      "start": 636.9199981689453,
      "end": 640.2000007629395,
      "text": " The same was in the beginning with God."
    },
    {
      "id": 10,
      "start": 640.2000007629395,
      "end": 647.1199989318848,
      "text": " Notice all things were made by Him and without Him was not anything made that was made."
    },
    {
      "id": 11,
      "start": 647.1199989318848,
      "end": 652.8400001525879,
      "text": " In Him was life and the life was the light of men."
    },
    {
      "id": 12,
      "start": 652.8400001525879,
      "end": 655.1599998474121,
      "text": " Verse 14 says it this way."
    },
    {
      "id": 13,
      "start": 655.1599998474121,
      "end": 660.2799987792969,
      "text": " It says that in the Word, that same Word that we see in verses 1, in the beginning"
    },
    {
      "id": 14,
      "start": 660.2799987792969,
      "end": 662.8400001525879,
      "text": " was the Word and the Word was with God and the Word was God."
    },
    {
      "id": 15,
      "start": 662.8400001525879,
      "end": 667.4400024414062,
      "text": " The Word was made flesh."
    },
    {
      "id": 16,
      "start": 667.4400024414062,
      "end": 670.0800018310547,
      "text": " That's what we're talking about in Galatians chapter number 4."
    },
    {
      "id": 17,
      "start": 670.0800018310547,
      "end": 674.5999984741211,
      "text": " When the fullness of the time was come, God sent forth His Son."
    },
    {
      "id": 18,
      "start": 674.5999984741211,
      "end": 680.2799987792969,
      "text": " He was made flesh, notice, and dwelt among us."
    },
    {
      "id": 19,
      "start": 680.2799987792969,
      "end": 683.3600006103516,
      "text": " And we beheld His glory."
    },
    {
      "id": 20,
      "start": 683.3600006103516,
      "end": 686.6399993896484,
      "text": " John is writing under the inspiration of the Holy Spirit of God."
    },
    {
      "id": 21,
      "start": 686.6399993896484,
      "end": 690.7600021362305,
      "text": " John is one of the disciples and he's saying we plural because the other disciples, we"
    },
    {
      "id": 22,
      "start": 690.7600021362305,
      "end": 694.1600036621094,
      "text": " beheld His glory."
    },
    {
      "id": 23,
      "start": 694.1600036621094,
      "end": 701.2799987792969,
      "text": " Notice the glory is of the only begotten of the Father, full of grace and truth."
    },
    {
      "id": 24,
      "start": 701.2799987792969,
      "end": 702.7200012207031,
      "text": " John bear witness of Him."
    },
    {
      "id": 25,
      "start": 702.7200012207031,
      "end": 706.120002746582,
      "text": " Now understand this is not the writer of the Gospel of John."
    },
    {
      "id": 26,
      "start": 706.120002746582,
      "end": 710.8399963378906,
      "text": " No, this John that's referred to in verse number 15, this is John the Baptist."
    },
    {
      "id": 27,
      "start": 710.8399963378906,
      "end": 713.6399993896484,
      "text": " And the Bible says John bear witness of Him."
    },
    {
      "id": 28,
      "start": 713.6399993896484,
      "end": 717.4800033569336,
      "text": " John was the one that was a voice crying in the wilderness."
    },
    {
      "id": 29,
      "start": 717.4800033569336,
      "end": 722.5599975585938,
      "text": " He's the one that said behold the Lamb of God which taketh away the sin of the world."
    },
    {
      "id": 30,
      "start": 722.5599975585938,
      "end": 728.0399932861328,
      "text": " And the Bible says that John bear witness of Him and cried saying this was He of whom"
    },
    {
      "id": 31,
      "start": 728.0399932861328,
      "end": 731.8000030517578,
      "text": " I spake, He that cometh after me."
    },
    {
      "id": 32,
      "start": 731.8000030517578,
      "end": 739.6399993896484,
      "text": " He's referring to a position of time in the fact that John the Baptist was born first."
    },
    {
      "id": 33,
      "start": 739.6399993896484,
      "end": 747.1999969482422,
      "text": " He's a cousin of Jesus Christ, fleshly speaking of the flesh, and he says that He that cometh"
    },
    {
      "id": 34,
      "start": 747.1999969482422,
      "end": 750.1999969482422,
      "text": " after me, notice, is preferred before me."
    },
    {
      "id": 35,
      "start": 750.1999969482422,
      "end": 751.1999969482422,
      "text": " Why?"
    },
    {
      "id": 36,
      "start": 751.1999969482422,
      "end": 755.2799987792969,
      "text": " For He was before me."
    },
    {
      "id": 37,
      "start": 755.2799987792969,
      "end": 760.7200012207031,
      "text": " In one verse of Scripture, John the Baptist as he's testifying of the Lord Jesus Christ,"
    },
    {
      "id": 38,
      "start": 760.7200012207031,
      "end": 767.1600036621094,
      "text": " he's speaking of His birth after me, I am older physically, but He's preferred before"
    },
    {
      "id": 39,
      "start": 767.1600036621094,
      "end": 768.1600036621094,
      "text": " me."
    },
    {
      "id": 40,
      "start": 768.1600036621094,
      "end": 769.1600036621094,
      "text": " Why?"
    },
    {
      "id": 41,
      "start": 769.6799926757812,
      "end": 770.6799926757812,
      "text": " Because He is eternal."
    },
    {
      "id": 42,
      "start": 770.6799926757812,
      "end": 772.5599975585938,
      "text": " It's an amazing truth."
    },
    {
      "id": 43,
      "start": 772.5599975585938,
      "end": 780.4400024414062,
      "text": " And the Bible says that God, what He did was He sent forth His Son and Jesus is eternal."
    },
    {
      "id": 44,
      "start": 780.4400024414062,
      "end": 785.0399932861328,
      "text": " Jesus in fact in John 17, you don't need to turn there, I'll read the verse for you, but"
    },
    {
      "id": 45,
      "start": 785.0399932861328,
      "end": 790.5599975585938,
      "text": " in verse number 5 of John 17, Jesus is praying, this is right before He goes to the cross"
    },
    {
      "id": 46,
      "start": 790.5599975585938,
      "end": 796.8800048828125,
      "text": " of Calvary, and He says this in verse number 5, and now O Father, glorify Thou me with"
    },
    {
      "id": 47,
      "start": 796.8800048828125,
      "end": 805.4799957275391,
      "text": " Thine own self, with the glory which I had with Thee before the world was."
    },
    {
      "id": 48,
      "start": 805.4799957275391,
      "end": 810.6000061035156,
      "text": " Now if He's not God, He could never make that statement."
    },
    {
      "id": 49,
      "start": 810.6000061035156,
      "end": 816.3600006103516,
      "text": " You can't make that statement, I can't make that statement, but because Jesus is God and"
    },
    {
      "id": 50,
      "start": 816.3600006103516,
      "end": 822.8399963378906,
      "text": " He's eternal, He's able to say with the glory, notice that it says here, which I had with"
    },
    {
      "id": 51,
      "start": 822.8399963378906,
      "end": 827.7599945068359,
      "text": " Thee before the world was."
    },
    {
      "id": 52,
      "start": 827.7599945068359,
      "end": 831.0800018310547,
      "text": " God sent forth His Son."
    },
    {
      "id": 53,
      "start": 831.0800018310547,
      "end": 833.6399993896484,
      "text": " That's what God did."
    },
    {
      "id": 54,
      "start": 833.6399993896484,
      "end": 836.0599975585938,
      "text": " That's miraculous."
    },
    {
      "id": 55,
      "start": 836.0599975585938,
      "end": 843.5599975585938,
      "text": " We find that this event that we look to, this truth of the incarnation, this moment in history"
    },
    {
      "id": 56,
      "start": 843.5599975585938,
      "end": 848.1199951171875,
      "text": " that we celebrate here at the Christmas season, this was something that had been prophesied"
    },
    {
      "id": 57,
      "start": 848.1199951171875,
      "end": 849.1199951171875,
      "text": " in the Old Testament."
    },
    {
      "id": 58,
      "start": 849.1199951171875,
      "end": 854.1600036621094,
      "text": " You could look in the book of Genesis, even in the third chapter, at the time in which"
    },
    {
      "id": 59,
      "start": 854.1600036621094,
      "end": 861.0400085449219,
      "text": " God is speaking with Adam and Eve after sin entered, and you find that God there gives"
    },
    {
      "id": 60,
      "start": 861.0400085449219,
      "end": 865.3999938964844,
      "text": " the first promise of the Messiah who would come."
    },
    {
      "id": 61,
      "start": 865.3999938964844,
      "end": 869.9599914550781,
      "text": " In Genesis 3 and verse 15, you can read in the book of Numbers, you think about the wise"
    },
    {
      "id": 62,
      "start": 869.9599914550781,
      "end": 876.1199951171875,
      "text": " men with the star, and they see about that truth really from Numbers chapter 24."
    },
    {
      "id": 63,
      "start": 876.1199951171875,
      "end": 881.4400024414062,
      "text": " You can find throughout the Old Testament prophecy after prophecy with regard to the"
    },
    {
      "id": 64,
      "start": 881.4400024414062,
      "end": 889.9599914550781,
      "text": " birth of Christ, the incarnation, the miracle of Christmas, that God sent forth His Son."
    },
    {
      "id": 65,
      "start": 889.9599914550781,
      "end": 890.9599914550781,
      "text": " When?"
    },
    {
      "id": 66,
      "start": 890.9599914550781,
      "end": 893.0400085449219,
      "text": " When the fullness of time was come."
    },
    {
      "id": 67,
      "start": 893.0400085449219,
      "end": 898.3399963378906,
      "text": " We look at these prophecies and we can rejoice in the prophecies that God gave us, and notice"
    },
    {
      "id": 68,
      "start": 898.3399963378906,
      "end": 904.2000122070312,
      "text": " as you consider the prophecies that God spoke, not only of the truth that He would send forth"
    },
    {
      "id": 69,
      "start": 904.2000122070312,
      "end": 910.0799865722656,
      "text": " His Son that Messiah would be born, He reveals to us in the prophecies not only the truth"
    },
    {
      "id": 70,
      "start": 910.0799865722656,
      "end": 914.8800048828125,
      "text": " that He would be born, but where He would be born and how He would be born."
    },
    {
      "id": 71,
      "start": 914.8800048828125,
      "end": 920.0,
      "text": " It's amazing when you consider the prophecies with regard to the first coming of the Lord"
    },
    {
      "id": 72,
      "start": 920.0,
      "end": 922.0,
      "text": " Jesus Christ."
    },
    {
      "id": 73,
      "start": 922.0,
      "end": 926.8399963378906,
      "text": " And all of those prophecies were fulfilled on that night."
    },
    {
      "id": 74,
      "start": 926.8399963378906,
      "end": 931.3999938964844,
      "text": " As you read the accounts, we'll read them tonight in the book of Luke and in the book"
    },
    {
      "id": 75,
      "start": 931.3999938964844,
      "end": 936.8800048828125,
      "text": " of Matthew, and you read those accounts and the angel that comes and announces the birth"
    },
    {
      "id": 76,
      "start": 936.8800048828125,
      "end": 939.5599975585938,
      "text": " of Christ, I mean what joy!"
    },
    {
      "id": 77,
      "start": 939.5599975585938,
      "end": 945.9400024414062,
      "text": " And even the angel that announced to Mary about the truth of the birth and how miraculous"
    },
    {
      "id": 78,
      "start": 945.9400024414062,
      "end": 948.9599914550781,
      "text": " this is, and we find it was prophesied."
    },
    {
      "id": 79,
      "start": 948.9599914550781,
      "end": 954.0400085449219,
      "text": " In Micah 5 it prophesies of the place in which Jesus would be born."
    },
    {
      "id": 80,
      "start": 954.0400085449219,
      "end": 959.9200134277344,
      "text": " In Daniel 9 it prophesies of the timing in which Jesus would be born."
    },
    {
      "id": 81,
      "start": 959.9200134277344,
      "end": 965.1600036621094,
      "text": " It's interesting to me that even the Jewish people that had the scriptures, that should"
    },
    {
      "id": 82,
      "start": 965.1600036621094,
      "end": 970.0,
      "text": " have known not only the timing and the place, that they weren't really looking for the birth"
    },
    {
      "id": 83,
      "start": 970.0,
      "end": 972.4400024414062,
      "text": " of the Messiah."
    },
    {
      "id": 84,
      "start": 972.4400024414062,
      "end": 978.6799926757812,
      "text": " When those wise men come, they say, where is He that is born, King of the Jews?"
    },
    {
      "id": 85,
      "start": 978.6799926757812,
      "end": 983.6400146484375,
      "text": " Herod's paranoid, he's always paranoid anyway if you study his life and all the things about"
    },
    {
      "id": 86,
      "start": 983.6400146484375,
      "end": 988.5199890136719,
      "text": " him, he's a paranoid individual, and he's paranoid because the greeting is, where is"
    },
    {
      "id": 87,
      "start": 988.5199890136719,
      "end": 993.239990234375,
      "text": " He that is born, King of the Jews?"
    },
    {
      "id": 88,
      "start": 993.239990234375,
      "end": 994.239990234375,
      "text": " So what does he do?"
    },
    {
      "id": 89,
      "start": 994.239990234375,
      "end": 998.9200134277344,
      "text": " He inquires with the scribes and they say, oh, in Bethlehem, Ephrathah."
    },
    {
      "id": 90,
      "start": 998.9200134277344,
      "end": 1001.2000122070312,
      "text": " For thus it is prophesied."
    },
    {
      "id": 91,
      "start": 1001.2000122070312,
      "end": 1005.5199890136719,
      "text": " They knew the prophecy, but they weren't looking for the Messiah."
    },
    {
      "id": 92,
      "start": 1005.5199890136719,
      "end": 1009.6400146484375,
      "text": " Isaiah 9 in verse number 6 tells us that His name shall be called wonderful."
    },
    {
      "id": 93,
      "start": 1009.6400146484375,
      "end": 1010.6400146484375,
      "text": " Let's actually look at it."
    },
    {
      "id": 94,
      "start": 1010.6400146484375,
      "end": 1016.3399963378906,
      "text": " Isaiah 9 in verse number 6, oh, it's beautiful to consider the promise here in Isaiah 9 with"
    },
    {
      "id": 95,
      "start": 1016.3399963378906,
      "end": 1021.2999877929688,
      "text": " regard to the truth of this, what God did."
    },
    {
      "id": 96,
      "start": 1021.2999877929688,
      "end": 1024.1000061035156,
      "text": " He sent forth His Son."
    },
    {
      "id": 97,
      "start": 1024.1000061035156,
      "end": 1030.8999938964844,
      "text": " In Isaiah 9 in verse number 6, notice the Bible says, for unto us a child is born."
    },
    {
      "id": 98,
      "start": 1030.8999938964844,
      "end": 1038.6199951171875,
      "text": " But then notice it says this, unto us a son is given."
    },
    {
      "id": 99,
      "start": 1038.6199951171875,
      "end": 1043.0599975585938,
      "text": " A child is born, a son is given."
    },
    {
      "id": 100,
      "start": 1043.0599975585938,
      "end": 1046.1799926757812,
      "text": " God sent forth His Son."
    },
    {
      "id": 101,
      "start": 1046.1799926757812,
      "end": 1050.3399963378906,
      "text": " We see that in Galatians 4 and verse number 4, that what did God do?"
    },
    {
      "id": 102,
      "start": 1050.3399963378906,
      "end": 1051.5,
      "text": " He sent forth His Son."
    },
    {
      "id": 103,
      "start": 1051.5,
      "end": 1055.5799865722656,
      "text": " When the fullness of the time was come, God sent forth His Son."
    },
    {
      "id": 104,
      "start": 1055.5799865722656,
      "end": 1059.2999877929688,
      "text": " And it says here in Isaiah 9 in verse number 6, for unto us a child is born, unto us a"
    },
    {
      "id": 105,
      "start": 1059.2999877929688,
      "end": 1062.5199890136719,
      "text": " son is given."
    },
    {
      "id": 106,
      "start": 1062.5199890136719,
      "end": 1068.4200134277344,
      "text": " And the government shall be upon His shoulder, and His name shall be called wonderful, Counselor,"
    },
    {
      "id": 107,
      "start": 1068.4200134277344,
      "end": 1073.7799987792969,
      "text": " the mighty God, the everlasting Father, the Prince of Peace."
    },
    {
      "id": 108,
      "start": 1074.3800048828125,
      "end": 1077.8200073242188,
      "text": " Wow, that's our Savior."
    },
    {
      "id": 109,
      "start": 1077.8200073242188,
      "end": 1078.8200073242188,
      "text": " What did God do?"
    },
    {
      "id": 110,
      "start": 1078.8200073242188,
      "end": 1081.260009765625,
      "text": " Well, God sent forth His Son."
    },
    {
      "id": 111,
      "start": 1081.260009765625,
      "end": 1086.260009765625,
      "text": " Notice back in Galatians chapter 4, notice how God did it, number 2."
    },
    {
      "id": 112,
      "start": 1086.260009765625,
      "end": 1090.7799987792969,
      "text": " We notice what God did, but notice how God did it."
    },
    {
      "id": 113,
      "start": 1090.7799987792969,
      "end": 1097.5799865722656,
      "text": " The Bible tells us this in verse number 4, but when the fullness of the time was come,"
    },
    {
      "id": 114,
      "start": 1097.5799865722656,
      "end": 1108.3200073242188,
      "text": " God sent forth His Son, then notice, made of a woman, made under the law."
    },
    {
      "id": 115,
      "start": 1108.3200073242188,
      "end": 1112.6599731445312,
      "text": " We see here in Galatians 4 and verse number 4, when we consider not only what God did,"
    },
    {
      "id": 116,
      "start": 1112.6599731445312,
      "end": 1117.6599731445312,
      "text": " but how God did it, we see the truth of the virgin birth."
    },
    {
      "id": 117,
      "start": 1117.6599731445312,
      "end": 1121.1199951171875,
      "text": " Miraculous in every sense of the word."
    },
    {
      "id": 118,
      "start": 1121.1199951171875,
      "end": 1127.5599975585938,
      "text": " The truth that God would send forth His Son, but it says that Jesus, made of a woman, made"
    },
    {
      "id": 119,
      "start": 1127.5599975585938,
      "end": 1128.719970703125,
      "text": " under the law."
    },
    {
      "id": 120,
      "start": 1128.719970703125,
      "end": 1133.9600219726562,
      "text": " We understand this truth of the virgin birth of Christ, and we understand that because"
    },
    {
      "id": 121,
      "start": 1133.9600219726562,
      "end": 1140.7999877929688,
      "text": " of this truth, and because of the way in which God did this, He sent forth His Son, but He"
    },
    {
      "id": 122,
      "start": 1140.7999877929688,
      "end": 1145.719970703125,
      "text": " sent Him forth made of a woman, and we find the truth of the virgin birth, it's miraculous"
    },
    {
      "id": 123,
      "start": 1145.719970703125,
      "end": 1151.7999877929688,
      "text": " in every sense of the word, and we find that He would have no human, earthly Father, there'd"
    },
    {
      "id": 124,
      "start": 1151.7999877929688,
      "end": 1155.1199951171875,
      "text": " be no sin nature."
    },
    {
      "id": 125,
      "start": 1155.1199951171875,
      "end": 1156.1199951171875,
      "text": " He's sinless."
    },
    {
      "id": 126,
      "start": 1156.6799926757812,
      "end": 1158.52001953125,
      "text": " He's without sin."
    },
    {
      "id": 127,
      "start": 1158.52001953125,
      "end": 1159.52001953125,
      "text": " He's God."
    },
    {
      "id": 128,
      "start": 1159.52001953125,
      "end": 1164.760009765625,
      "text": " And you begin to think about this, turn back again, I just had you in Isaiah 9, but look"
    },
    {
      "id": 129,
      "start": 1164.760009765625,
      "end": 1168.9600219726562,
      "text": " at Isaiah 7 if you will, and then we'll go over to the book of Luke just for a moment,"
    },
    {
      "id": 130,
      "start": 1168.9600219726562,
      "end": 1174.4000244140625,
      "text": " but look in Isaiah chapter number 7, and again, one of these prophecies with regard to the"
    },
    {
      "id": 131,
      "start": 1174.4000244140625,
      "end": 1181.0,
      "text": " coming of Messiah and understanding the truth that God gives us here, even in the Old Testament"
    },
    {
      "id": 132,
      "start": 1181.0,
      "end": 1186.3599853515625,
      "text": " about this day, this day of Christmas that we celebrate, the birth of our Messiah, the"
    },
    {
      "id": 133,
      "start": 1186.3599853515625,
      "end": 1193.0800170898438,
      "text": " birth of the Lord Jesus Christ, the Bible says in Isaiah 7 in verse 14, it says, This"
    },
    {
      "id": 134,
      "start": 1193.0800170898438,
      "end": 1198.1599731445312,
      "text": " therefore the Lord Himself shall give you a sign, what is this sign?"
    },
    {
      "id": 135,
      "start": 1198.1599731445312,
      "end": 1200.0399780273438,
      "text": " Notice, behold, a virgin."
    },
    {
      "id": 0,
      "start": 1200.0399780273438,
      "end": 1209.4599781036377,
      "text": " The virgin shall conceive and bear a son and shall call his name Immanuel."
    },
    {
      "id": 1,
      "start": 1209.4599781036377,
      "end": 1214.2599782943726,
      "text": " Again I mentioned about some of the modern translations they say in John 1 that he was"
    },
    {
      "id": 2,
      "start": 1214.2599782943726,
      "end": 1219.8999786376953,
      "text": " a God instead of he is God and then we find here in Isaiah 7 14 that some change the word"
    },
    {
      "id": 3,
      "start": 1219.8999786376953,
      "end": 1222.6599788665771,
      "text": " virgin to a young maid."
    },
    {
      "id": 4,
      "start": 1222.6599788665771,
      "end": 1225.4599781036377,
      "text": " Can I tell you this morning that's not the same."
    },
    {
      "id": 5,
      "start": 1225.4599781036377,
      "end": 1227.1399784088135,
      "text": " Amen?"
    },
    {
      "id": 6,
      "start": 1227.1399784088135,
      "end": 1229.5999774932861,
      "text": " It is not the same."
    },
    {
      "id": 7,
      "start": 1229.5999774932861,
      "end": 1237.0399780273438,
      "text": " And here the Bible says that the sign that God would give is that a virgin shall conceive"
    },
    {
      "id": 8,
      "start": 1237.0399780273438,
      "end": 1242.799976348877,
      "text": " and bear a son and shall call his name Immanuel."
    },
    {
      "id": 9,
      "start": 1242.799976348877,
      "end": 1250.1599769592285,
      "text": " Now look at what the Bible says in Luke chapter number 1 and think about for generations of"
    },
    {
      "id": 10,
      "start": 1250.1599769592285,
      "end": 1257.7199783325195,
      "text": " people from this announcement in Isaiah chapter number 7 this prophecy with regard to the"
    },
    {
      "id": 11,
      "start": 1257.7199783325195,
      "end": 1263.1999778747559,
      "text": " manner in which God would send forth his son the Messiah that he would be born of"
    },
    {
      "id": 12,
      "start": 1263.1999778747559,
      "end": 1265.8799743652344,
      "text": " a woman, born of a virgin."
    },
    {
      "id": 13,
      "start": 1265.8799743652344,
      "end": 1272.1799774169922,
      "text": " In Luke chapter number 1 in verse number 26 the Bible says in the sixth month the angel"
    },
    {
      "id": 14,
      "start": 1272.1799774169922,
      "end": 1277.7599792480469,
      "text": " Gabriel was sent from God unto a city of Galilee named Nazareth."
    },
    {
      "id": 15,
      "start": 1277.7599792480469,
      "end": 1285.6399765014648,
      "text": " Notice what the Bible says to a virgin espoused to a man whose name was Joseph to the house"
    },
    {
      "id": 16,
      "start": 1285.6799774169922,
      "end": 1290.9199752807617,
      "text": " of David and the virgin's name was Mary."
    },
    {
      "id": 17,
      "start": 1290.9199752807617,
      "end": 1292.6399765014648,
      "text": " Was Mary."
    },
    {
      "id": 18,
      "start": 1292.6399765014648,
      "end": 1296.9999771118164,
      "text": " You see that the Bible references twice in verse number 27 that she was a virgin."
    },
    {
      "id": 19,
      "start": 1296.9999771118164,
      "end": 1302.3199768066406,
      "text": " Yes she was espoused to a man whose name was Joseph but understand that even as this announcement"
    },
    {
      "id": 20,
      "start": 1302.3199768066406,
      "end": 1308.079978942871,
      "text": " comes in verse number 28 the Bible says that the angel came in unto her and said hail thou"
    },
    {
      "id": 21,
      "start": 1308.079978942871,
      "end": 1314.5399780273438,
      "text": " that are highly favored the Lord is with thee blessed art thou among women."
    },
    {
      "id": 22,
      "start": 1314.5399780273438,
      "end": 1318.459976196289,
      "text": " And when she saw him she was troubled at this saying and cast in her mind what manner"
    },
    {
      "id": 23,
      "start": 1318.459976196289,
      "end": 1323.8199768066406,
      "text": " of salutation this should be and the angels said unto her fear not Mary for thou has found"
    },
    {
      "id": 24,
      "start": 1323.8199768066406,
      "end": 1332.0199737548828,
      "text": " favor with God and behold thou shalt conceive in thy womb and bring forth a son and shalt"
    },
    {
      "id": 25,
      "start": 1332.0199737548828,
      "end": 1335.8599853515625,
      "text": " call his name Jesus."
    },
    {
      "id": 26,
      "start": 1335.8599853515625,
      "end": 1340.459976196289,
      "text": " The Bible says in verse 32 and he shall be great and shall be called the son of the highest"
    },
    {
      "id": 27,
      "start": 1340.459976196289,
      "end": 1344.3399810791016,
      "text": " and the Lord God shall give unto him the throne of his father David and he shall reign"
    },
    {
      "id": 28,
      "start": 1344.3399810791016,
      "end": 1348.3799743652344,
      "text": " over the house of Jacob forever and of his kingdom there shall be no end and we won't"
    },
    {
      "id": 29,
      "start": 1348.3799743652344,
      "end": 1352.4199829101562,
      "text": " take the time this morning but you can see in verse 32 and 33 the fulfillment of the"
    },
    {
      "id": 30,
      "start": 1352.4199829101562,
      "end": 1357.499984741211,
      "text": " Davidic covenant through the Lord Jesus Christ but then notice verse 34 notice the response"
    },
    {
      "id": 31,
      "start": 1357.499984741211,
      "end": 1367.1799774169922,
      "text": " of Mary then said Mary unto the angel how shall this be seeing I know not a man."
    },
    {
      "id": 32,
      "start": 1367.1799774169922,
      "end": 1368.5799713134766,
      "text": " What's she referring to here?"
    },
    {
      "id": 33,
      "start": 1368.6999816894531,
      "end": 1375.459976196289,
      "text": " She's referring to her chaste her purity that we find as it's mentioned in verse 27 that"
    },
    {
      "id": 34,
      "start": 1375.459976196289,
      "end": 1382.97998046875,
      "text": " she's a virgin remember in Isaiah 7 in verse number 14 the sign is going to be that a virgin"
    },
    {
      "id": 35,
      "start": 1382.97998046875,
      "end": 1388.739974975586,
      "text": " would bring forth a son and shall call his name Emmanuel and here she says how can this"
    },
    {
      "id": 36,
      "start": 1388.739974975586,
      "end": 1394.2599792480469,
      "text": " thing be she understood just like most of us understand this morning the process in"
    },
    {
      "id": 37,
      "start": 1394.2599792480469,
      "end": 1401.1399841308594,
      "text": " which birth is conception is given by God and she says how shall this be seeing I know"
    },
    {
      "id": 38,
      "start": 1401.1399841308594,
      "end": 1406.1799774169922,
      "text": " not a man and the angel answered and said unto her the Holy Ghost shall come upon thee"
    },
    {
      "id": 39,
      "start": 1406.1799774169922,
      "end": 1411.1799774169922,
      "text": " and the power of the highest shall overshadow thee therefore also that holy thing which"
    },
    {
      "id": 40,
      "start": 1411.1799774169922,
      "end": 1415.8599853515625,
      "text": " shall be born of thee shall be called the son of God."
    },
    {
      "id": 41,
      "start": 1415.8599853515625,
      "end": 1422.3799743652344,
      "text": " Wow miraculous in every sense of the word."
    },
    {
      "id": 42,
      "start": 1422.3799743652344,
      "end": 1426.739974975586,
      "text": " The Bible says in verse 36 and behold thy cousin Elizabeth she hath also conceived a"
    },
    {
      "id": 43,
      "start": 1426.739974975586,
      "end": 1431.459976196289,
      "text": " son in her old age and this is the sixth month with her who was called barren."
    },
    {
      "id": 44,
      "start": 1431.459976196289,
      "end": 1436.499984741211,
      "text": " That's another miracle in of itself but a miracle of conception between Elizabeth and"
    },
    {
      "id": 45,
      "start": 1436.499984741211,
      "end": 1442.7799835205078,
      "text": " Zacharias and God allowed them to have a son John the Baptist it's mentioned here of that"
    },
    {
      "id": 46,
      "start": 1442.7799835205078,
      "end": 1447.8199768066406,
      "text": " truth that she had conceived in her old age but then notice this phrase in verse 37 for"
    },
    {
      "id": 47,
      "start": 1447.8199768066406,
      "end": 1455.2599792480469,
      "text": " with God nothing shall be impossible."
    },
    {
      "id": 48,
      "start": 1455.2599792480469,
      "end": 1463.4599914550781,
      "text": " You say explain to me the virgin birth it's miraculous it's miraculous it is God sending"
    },
    {
      "id": 49,
      "start": 1463.4599914550781,
      "end": 1471.1399841308594,
      "text": " forth his son made of a woman made under the law see Jesus had to come in the form of a"
    },
    {
      "id": 50,
      "start": 1471.1399841308594,
      "end": 1480.5799865722656,
      "text": " man he's the God man he never stopped being God but he had to come as a man so that he"
    },
    {
      "id": 51,
      "start": 1480.5799865722656,
      "end": 1483.2599792480469,
      "text": " could die for you and for me."
    },
    {
      "id": 52,
      "start": 1483.2599792480469,
      "end": 1488.739990234375,
      "text": " He could not come as an angel he could not come as any other no he had to come as a man"
    },
    {
      "id": 53,
      "start": 1488.739990234375,
      "end": 1493.8999633789062,
      "text": " made under the law and notice with me that as we look at this portion of scripture in"
    },
    {
      "id": 54,
      "start": 1493.8999633789062,
      "end": 1499.219970703125,
      "text": " Galatians 4 we notice not only what God did and how God did it but number three we consider"
    },
    {
      "id": 55,
      "start": 1499.2999877929688,
      "end": 1507.739990234375,
      "text": " this morning why God did it why did God do it well in Galatians chapter number four and"
    },
    {
      "id": 56,
      "start": 1507.739990234375,
      "end": 1516.1399841308594,
      "text": " verse number five the Bible says to redeem them that were under the law that we might"
    },
    {
      "id": 57,
      "start": 1516.1399841308594,
      "end": 1523.3399658203125,
      "text": " receive the adoption of sons you know who them and we you know that is that's us that's"
    },
    {
      "id": 58,
      "start": 1523.3399658203125,
      "end": 1531.4199829101562,
      "text": " humanity that's humanity to redeem them that were under the law you know every human being"
    },
    {
      "id": 59,
      "start": 1531.4199829101562,
      "end": 1535.4599914550781,
      "text": " that's been born upon this earth outside of the Lord Jesus Christ God and flesh the God"
    },
    {
      "id": 60,
      "start": 1535.4599914550781,
      "end": 1545.4599914550781,
      "text": " man has been born under the law sinners with a sinful nature and here the Bible says that"
    },
    {
      "id": 61,
      "start": 1545.4599914550781,
      "end": 1550.7799682617188,
      "text": " not only as we consider the truth of verse four and verse number five of Galatians 4"
    },
    {
      "id": 62,
      "start": 1550.97998046875,
      "end": 1555.4999694824219,
      "text": " not only was the birth of Christ prophesied but we find that it had a specific purpose"
    },
    {
      "id": 63,
      "start": 1555.4999694824219,
      "end": 1560.5399780273438,
      "text": " remember when the Bible said in verse number four that God sent forth his son that word"
    },
    {
      "id": 64,
      "start": 1560.5399780273438,
      "end": 1568.8999633789062,
      "text": " means to dispatch it means to send off to a destination remember this for a purpose"
    },
    {
      "id": 65,
      "start": 1568.8999633789062,
      "end": 1575.0999755859375,
      "text": " the purpose is given to us in verse number five to redeem them that were under the law"
    },
    {
      "id": 66,
      "start": 1575.0999755859375,
      "end": 1581.9399719238281,
      "text": " that we might receive the adoption of sons and that word redeem means to ransom Christ"
    },
    {
      "id": 67,
      "start": 1581.9399719238281,
      "end": 1588.5799865722656,
      "text": " freeing from the dominion of the law through his vicarious death and subsequent resurrection"
    },
    {
      "id": 68,
      "start": 1588.5799865722656,
      "end": 1593.0599670410156,
      "text": " you know there's only one way to be redeemed only one way to be redeemed we sing about"
    },
    {
      "id": 69,
      "start": 1593.0599670410156,
      "end": 1605.3799743652344,
      "text": " redemption we sing redeemed redeemed redeemed by the blood of the lamb and that's the only"
    },
    {
      "id": 70,
      "start": 1605.3799743652344,
      "end": 1611.2799682617188,
      "text": " way to be redeemed there's no other way to be redeemed redemption is only through the"
    },
    {
      "id": 71,
      "start": 1611.2799682617188,
      "end": 1616.739990234375,
      "text": " Lord Jesus Christ and we find in the passage of scripture here when we consider this truth"
    },
    {
      "id": 72,
      "start": 1616.739990234375,
      "end": 1622.6599731445312,
      "text": " of redemption we are aware of the fact that it's motivated by love that mankind can only"
    },
    {
      "id": 73,
      "start": 1622.6599731445312,
      "end": 1629.6199645996094,
      "text": " be redeemed and needed to be redeemed because of our sin our sin separated us from a holy"
    },
    {
      "id": 74,
      "start": 1629.6199645996094,
      "end": 1635.219970703125,
      "text": " God and we needed redemption it's only possible through the Lord Jesus Christ through his"
    },
    {
      "id": 75,
      "start": 1635.219970703125,
      "end": 1641.739990234375,
      "text": " blood that would be shed and then his resurrection we find that it's motivated by love why would"
    },
    {
      "id": 76,
      "start": 1641.739990234375,
      "end": 1651.7799682617188,
      "text": " we say such a thing for John 3 16 says for God so loved the world that he gave his only"
    },
    {
      "id": 77,
      "start": 1651.7799682617188,
      "end": 1657.8199768066406,
      "text": " begotten Son that whosoever believeth in him should not perish but have everlasting"
    },
    {
      "id": 78,
      "start": 1657.8199768066406,
      "end": 1664.3799743652344,
      "text": " life it's motivated by love for God so loved the world so what did he do he he gave his"
    },
    {
      "id": 79,
      "start": 1664.3799743652344,
      "end": 1668.7799682617188,
      "text": " only begotten Son right here in Galatians 4 we see that the Bible says that God when"
    },
    {
      "id": 80,
      "start": 1668.7799682617188,
      "end": 1674.9399719238281,
      "text": " the fullness of the time was come that God sent forth his Son and we find that the purpose"
    },
    {
      "id": 81,
      "start": 1674.9399719238281,
      "end": 1679.2999877929688,
      "text": " is so that we could be redeemed the Bible tells us in the book of 1st Peter in verse"
    },
    {
      "id": 82,
      "start": 1679.2999877929688,
      "end": 1685.0999755859375,
      "text": " in chapter number 1 and verses 18 through 21 the Bible teaches us about redemption here"
    },
    {
      "id": 83,
      "start": 1685.0999755859375,
      "end": 1692.1599731445312,
      "text": " and the the only way by which mankind can be redeemed see for most people it's obvious"
    },
    {
      "id": 84,
      "start": 1692.1599731445312,
      "end": 1699.0599670410156,
      "text": " and quite easy for us to acknowledge that we're sinners that we have violated God's"
    },
    {
      "id": 85,
      "start": 1699.0599670410156,
      "end": 1706.2799682617188,
      "text": " law God's law by the way is a whole lot more than just the Ten Commandments but just by"
    },
    {
      "id": 86,
      "start": 1706.2799682617188,
      "end": 1711.8399658203125,
      "text": " looking quickly at the Ten Commandments it's very easy for us to acknowledge that we are"
    },
    {
      "id": 87,
      "start": 1711.8399658203125,
      "end": 1717.6399536132812,
      "text": " guilty the book of James says that if we've offended in one point we're guilty of all"
    },
    {
      "id": 88,
      "start": 1717.6399536132812,
      "end": 1723.239990234375,
      "text": " you say well I lined up pretty good I've kept most of them but you're guilty of all I would"
    },
    {
      "id": 89,
      "start": 1723.239990234375,
      "end": 1728.199951171875,
      "text": " argue this morning that all of us have broken all of the Ten Commandments at some point"
    },
    {
      "id": 90,
      "start": 1728.199951171875,
      "end": 1734.0599975585938,
      "text": " in our lives and that reveals to us that we're guilty in just a chapter before in the book"
    },
    {
      "id": 91,
      "start": 1734.0599975585938,
      "end": 1739.739990234375,
      "text": " of Galatians you know what the Bible tells us about the law it cannot give life you know"
    },
    {
      "id": 92,
      "start": 1739.739990234375,
      "end": 1745.1799926757812,
      "text": " what the law does the law simply reveals to us that we're lost and the law points us to"
    },
    {
      "id": 93,
      "start": 1745.1799926757812,
      "end": 1750.8599853515625,
      "text": " the one the only one that can redeem us the Lord Jesus Christ Galatians 3 refers to it"
    },
    {
      "id": 94,
      "start": 1750.8599853515625,
      "end": 1758.0999755859375,
      "text": " as being a schoolmaster and you begin to think about the truth that God gives us there in"
    },
    {
      "id": 95,
      "start": 1758.0999755859375,
      "end": 1765.6599731445312,
      "text": " that portion of Scripture he says that that that righteousness listen cannot come by the law Paul"
    },
    {
      "id": 96,
      "start": 1765.6599731445312,
      "end": 1770.4400024414062,
      "text": " says it this way I do not frustrate the grace of God if righteousness came by the law then"
    },
    {
      "id": 97,
      "start": 1770.4400024414062,
      "end": 1775.8200073242188,
      "text": " Christ is dead in vain but we know and we agree this morning that Christ's death on the cross of"
    },
    {
      "id": 98,
      "start": 1775.8200073242188,
      "end": 1782.739990234375,
      "text": " Calvary was not in vain it was very purposed in 1st Peter chapter 1 in verse 18 the Bible says"
    },
    {
      "id": 99,
      "start": 1782.7799682617188,
      "end": 1788.97998046875,
      "text": " this for as much as you know now understand this morning that in 1st Peter the book of 1st Peter"
    },
    {
      "id": 100,
      "start": 1788.97998046875,
      "end": 1794.8599853515625,
      "text": " Peter is writing to believers he's writing to those that have been saved those that have trusted the"
    },
    {
      "id": 101,
      "start": 1794.8599853515625,
      "end": 1799.4199829101562,
      "text": " Lord Jesus Christ as their personal Savior how do we know that well you read the first chapter the"
    },
    {
      "id": 102,
      "start": 1799.4199829101562,
      "end": 1800.0199584960938,
      "text": " first few verses"
    },
    {
      "id": 0,
      "start": 1800.0199584960938,
      "end": 1802.4399585723877,
      "text": " and you understand that he's writing to believers."
    },
    {
      "id": 1,
      "start": 1802.4399585723877,
      "end": 1805.6199584007263,
      "text": " He's not writing to those that have not yet trusted Christ."
    },
    {
      "id": 2,
      "start": 1805.6199584007263,
      "end": 1807.6599583625793,
      "text": " He's writing to those that have been scattered abroad"
    },
    {
      "id": 3,
      "start": 1807.6599583625793,
      "end": 1809.8199586868286,
      "text": " that have trusted Christ as their Savior."
    },
    {
      "id": 4,
      "start": 1809.8199586868286,
      "end": 1812.2399587631226,
      "text": " And as he's talking to that audience,"
    },
    {
      "id": 5,
      "start": 1812.2399587631226,
      "end": 1815.379958152771,
      "text": " he says that you know, for as much as ye know."
    },
    {
      "id": 6,
      "start": 1815.379958152771,
      "end": 1818.49995803833,
      "text": " Now, some, and maybe even some here this morning"
    },
    {
      "id": 7,
      "start": 1818.49995803833,
      "end": 1819.5399589538574,
      "text": " under the sound of my voice,"
    },
    {
      "id": 8,
      "start": 1819.5399589538574,
      "end": 1822.1399593353271,
      "text": " whether they're here locally or tuned in via live stream,"
    },
    {
      "id": 9,
      "start": 1822.1399593353271,
      "end": 1826.3799591064453,
      "text": " they do not know the truth of redemption."
    },
    {
      "id": 10,
      "start": 1826.3799591064453,
      "end": 1827.6799583435059,
      "text": " For many of us here this morning,"
    },
    {
      "id": 11,
      "start": 1827.6799583435059,
      "end": 1829.3799591064453,
      "text": " we do know the truth of redemption,"
    },
    {
      "id": 12,
      "start": 1829.6199588775635,
      "end": 1830.7799587249756,
      "text": " and we know that we've been redeemed"
    },
    {
      "id": 13,
      "start": 1830.7799587249756,
      "end": 1832.2599601745605,
      "text": " with the precious blood of Christ,"
    },
    {
      "id": 14,
      "start": 1832.2599601745605,
      "end": 1835.2999572753906,
      "text": " but maybe some would not be able to say that they know,"
    },
    {
      "id": 15,
      "start": 1835.2999572753906,
      "end": 1837.49995803833,
      "text": " and it says here that you were not redeemed"
    },
    {
      "id": 16,
      "start": 1837.49995803833,
      "end": 1840.059959411621,
      "text": " with corruptible things,"
    },
    {
      "id": 17,
      "start": 1840.059959411621,
      "end": 1842.6199569702148,
      "text": " as silver and gold from your vain conversation"
    },
    {
      "id": 18,
      "start": 1842.6199569702148,
      "end": 1844.9799575805664,
      "text": " received by tradition from your fathers."
    },
    {
      "id": 19,
      "start": 1844.9799575805664,
      "end": 1846.8599586486816,
      "text": " But notice verse 19,"
    },
    {
      "id": 20,
      "start": 1846.8599586486816,
      "end": 1850.6799583435059,
      "text": " but with the precious blood of Christ,"
    },
    {
      "id": 21,
      "start": 1850.6799583435059,
      "end": 1853.7599601745605,
      "text": " as of a lamb without blemish and without spot,"
    },
    {
      "id": 22,
      "start": 1853.7599601745605,
      "end": 1855.3799591064453,
      "text": " who verily was for ordained"
    },
    {
      "id": 23,
      "start": 1855.3799591064453,
      "end": 1857.1799583435059,
      "text": " before the foundation of the world,"
    },
    {
      "id": 24,
      "start": 1857.1799583435059,
      "end": 1859.899959564209,
      "text": " but was manifest in these last times for you."
    },
    {
      "id": 25,
      "start": 1859.899959564209,
      "end": 1861.6599578857422,
      "text": " How was he manifest?"
    },
    {
      "id": 26,
      "start": 1861.6599578857422,
      "end": 1863.4599571228027,
      "text": " The incarnation."
    },
    {
      "id": 27,
      "start": 1863.4599571228027,
      "end": 1865.0399551391602,
      "text": " This truth that we're speaking about"
    },
    {
      "id": 28,
      "start": 1865.0399551391602,
      "end": 1866.8599548339844,
      "text": " in Galatians chapter number four,"
    },
    {
      "id": 29,
      "start": 1866.8599548339844,
      "end": 1868.1799621582031,
      "text": " when the fullness of time was come,"
    },
    {
      "id": 30,
      "start": 1868.1799621582031,
      "end": 1870.2599563598633,
      "text": " God sent forth his son."
    },
    {
      "id": 31,
      "start": 1870.2599563598633,
      "end": 1872.0199584960938,
      "text": " This is how he was made manifest."
    },
    {
      "id": 32,
      "start": 1872.0199584960938,
      "end": 1873.7799606323242,
      "text": " Notice in verse 21,"
    },
    {
      "id": 33,
      "start": 1873.7799606323242,
      "end": 1875.8799591064453,
      "text": " who by him do believe in God"
    },
    {
      "id": 34,
      "start": 1875.8799591064453,
      "end": 1877.9799575805664,
      "text": " that raised him up from the dead"
    },
    {
      "id": 35,
      "start": 1877.9799575805664,
      "end": 1880.7799606323242,
      "text": " and gave him glory that your faith and hope"
    },
    {
      "id": 36,
      "start": 1880.7799606323242,
      "end": 1883.1799621582031,
      "text": " might be in God."
    },
    {
      "id": 37,
      "start": 1884.5999603271484,
      "end": 1887.059959411621,
      "text": " The truth that we find here this morning,"
    },
    {
      "id": 38,
      "start": 1887.8999557495117,
      "end": 1889.5399551391602,
      "text": " we find in Galatians chapter number four,"
    },
    {
      "id": 39,
      "start": 1889.5399551391602,
      "end": 1891.9799575805664,
      "text": " what God did, God sent forth his son."
    },
    {
      "id": 40,
      "start": 1891.9799575805664,
      "end": 1894.1999588012695,
      "text": " We notice and we understand this morning"
    },
    {
      "id": 41,
      "start": 1894.1999588012695,
      "end": 1895.2999572753906,
      "text": " how God did it."
    },
    {
      "id": 42,
      "start": 1895.2999572753906,
      "end": 1898.9799575805664,
      "text": " He sent forth his son made of a woman,"
    },
    {
      "id": 43,
      "start": 1898.9799575805664,
      "end": 1900.059959411621,
      "text": " made under the law."
    },
    {
      "id": 44,
      "start": 1900.059959411621,
      "end": 1903.2599563598633,
      "text": " We find that the virgin birth is miraculous."
    },
    {
      "id": 45,
      "start": 1903.2599563598633,
      "end": 1906.3599548339844,
      "text": " We find that the reason that God did it,"
    },
    {
      "id": 46,
      "start": 1906.3599548339844,
      "end": 1907.7399597167969,
      "text": " why did God do this?"
    },
    {
      "id": 47,
      "start": 1907.7399597167969,
      "end": 1909.939956665039,
      "text": " Why did God send forth his son?"
    },
    {
      "id": 48,
      "start": 1909.939956665039,
      "end": 1911.2599563598633,
      "text": " To redeem."
    },
    {
      "id": 49,
      "start": 1912.4999618530273,
      "end": 1913.939956665039,
      "text": " Miraculous."
    },
    {
      "id": 50,
      "start": 1913.939956665039,
      "end": 1916.4199600219727,
      "text": " The miracle of Christmas."
    },
    {
      "id": 51,
      "start": 1916.4999618530273,
      "end": 1918.0999603271484,
      "text": " And we find again,"
    },
    {
      "id": 52,
      "start": 1918.0999603271484,
      "end": 1920.1199569702148,
      "text": " that as we look at this portion of scripture,"
    },
    {
      "id": 53,
      "start": 1920.1199569702148,
      "end": 1922.6599578857422,
      "text": " that God gives us some wonderful truth"
    },
    {
      "id": 54,
      "start": 1922.6599578857422,
      "end": 1924.8999557495117,
      "text": " with regard to the purpose"
    },
    {
      "id": 55,
      "start": 1924.8999557495117,
      "end": 1926.4999618530273,
      "text": " and the fulfillment of this purpose."
    },
    {
      "id": 56,
      "start": 1926.4999618530273,
      "end": 1927.9799575805664,
      "text": " Notice it says in verse number five,"
    },
    {
      "id": 57,
      "start": 1927.9799575805664,
      "end": 1929.7399597167969,
      "text": " again and back in Galatians four,"
    },
    {
      "id": 58,
      "start": 1929.7399597167969,
      "end": 1931.4599609375,
      "text": " to redeem them that were under the law"
    },
    {
      "id": 59,
      "start": 1931.4599609375,
      "end": 1936.4599609375,
      "text": " that we might receive the adoption of sons."
    },
    {
      "id": 60,
      "start": 1936.8599548339844,
      "end": 1939.3399658203125,
      "text": " Now this begins to really help us"
    },
    {
      "id": 61,
      "start": 1939.3399658203125,
      "end": 1942.3799591064453,
      "text": " understand our position in Christ."
    },
    {
      "id": 62,
      "start": 1942.3799591064453,
      "end": 1943.8799591064453,
      "text": " Someone that's here this morning,"
    },
    {
      "id": 63,
      "start": 1943.8799591064453,
      "end": 1944.979965209961,
      "text": " if you've been saved,"
    },
    {
      "id": 64,
      "start": 1944.979965209961,
      "end": 1946.0199584960938,
      "text": " if you've been born again,"
    },
    {
      "id": 65,
      "start": 1946.6599578857422,
      "end": 1948.3399658203125,
      "text": " if you've recognized that you're a guilty sinner,"
    },
    {
      "id": 66,
      "start": 1948.3399658203125,
      "end": 1950.939956665039,
      "text": " that Jesus Christ is the only savior"
    },
    {
      "id": 67,
      "start": 1950.939956665039,
      "end": 1952.939956665039,
      "text": " and that there's no other way to heaven,"
    },
    {
      "id": 68,
      "start": 1952.939956665039,
      "end": 1956.2999572753906,
      "text": " it's only through the blood of Christ,"
    },
    {
      "id": 69,
      "start": 1956.2999572753906,
      "end": 1958.0399627685547,
      "text": " the encouragement to you this morning"
    },
    {
      "id": 70,
      "start": 1958.0399627685547,
      "end": 1959.8999633789062,
      "text": " would be trust Christ as your savior."
    },
    {
      "id": 71,
      "start": 1959.8999633789062,
      "end": 1963.0799560546875,
      "text": " Today is the day of salvation."
    },
    {
      "id": 72,
      "start": 1964.3399658203125,
      "end": 1967.0599517822266,
      "text": " For every child of God that's here this morning,"
    },
    {
      "id": 73,
      "start": 1967.0599517822266,
      "end": 1970.0599517822266,
      "text": " I want us to rejoice in our position in Christ."
    },
    {
      "id": 74,
      "start": 1970.0599517822266,
      "end": 1971.4199523925781,
      "text": " And if you've not been saved,"
    },
    {
      "id": 75,
      "start": 1971.4199523925781,
      "end": 1972.4199523925781,
      "text": " if you get saved,"
    },
    {
      "id": 76,
      "start": 1972.4199523925781,
      "end": 1973.8599548339844,
      "text": " if you trust Christ as your savior,"
    },
    {
      "id": 77,
      "start": 1973.8599548339844,
      "end": 1976.2599639892578,
      "text": " this too would be your position in Christ."
    },
    {
      "id": 78,
      "start": 1976.2599639892578,
      "end": 1978.219955444336,
      "text": " Notice it says that we receive"
    },
    {
      "id": 79,
      "start": 1978.219955444336,
      "end": 1981.8199615478516,
      "text": " the adoption of sons."
    },
    {
      "id": 80,
      "start": 1981.8199615478516,
      "end": 1983.979965209961,
      "text": " This truth of adoption"
    },
    {
      "id": 81,
      "start": 1983.979965209961,
      "end": 1985.7399597167969,
      "text": " that God reveals to us here"
    },
    {
      "id": 82,
      "start": 1985.7399597167969,
      "end": 1987.1399536132812,
      "text": " in this portion of scripture."
    },
    {
      "id": 83,
      "start": 1987.1399536132812,
      "end": 1988.979965209961,
      "text": " He then says this in verse six,"
    },
    {
      "id": 84,
      "start": 1988.979965209961,
      "end": 1992.699951171875,
      "text": " and because your sons,"
    },
    {
      "id": 85,
      "start": 1992.699951171875,
      "end": 1995.979965209961,
      "text": " God had sent forth the spirit of his son"
    },
    {
      "id": 86,
      "start": 1995.979965209961,
      "end": 1997.939956665039,
      "text": " into your hearts."
    },
    {
      "id": 87,
      "start": 1997.939956665039,
      "end": 1999.4599609375,
      "text": " What does it say?"
    },
    {
      "id": 88,
      "start": 1999.4599609375,
      "end": 2002.979965209961,
      "text": " Crying, Abba, father."
    },
    {
      "id": 89,
      "start": 2002.979965209961,
      "end": 2004.2999572753906,
      "text": " Now, all of a sudden,"
    },
    {
      "id": 90,
      "start": 2004.2999572753906,
      "end": 2006.3399658203125,
      "text": " I have a relationship with God"
    },
    {
      "id": 91,
      "start": 2006.3399658203125,
      "end": 2008.4999542236328,
      "text": " that I did not have prior"
    },
    {
      "id": 92,
      "start": 2008.4999542236328,
      "end": 2011.0999603271484,
      "text": " to trusting Christ as my savior."
    },
    {
      "id": 93,
      "start": 2011.0999603271484,
      "end": 2013.4599609375,
      "text": " I was an enemy of Christ."
    },
    {
      "id": 94,
      "start": 2013.4599609375,
      "end": 2015.219955444336,
      "text": " I was at enmity."
    },
    {
      "id": 95,
      "start": 2015.219955444336,
      "end": 2018.0199584960938,
      "text": " I needed to be reconciled."
    },
    {
      "id": 96,
      "start": 2018.0199584960938,
      "end": 2019.8599548339844,
      "text": " And the only way for me to be reconciled,"
    },
    {
      "id": 97,
      "start": 2019.8599548339844,
      "end": 2021.2999572753906,
      "text": " the only way for me to be redeemed"
    },
    {
      "id": 98,
      "start": 2021.2999572753906,
      "end": 2022.9199523925781,
      "text": " was through the work of Christ,"
    },
    {
      "id": 99,
      "start": 2022.9199523925781,
      "end": 2024.2599639892578,
      "text": " God in flesh,"
    },
    {
      "id": 100,
      "start": 2024.2599639892578,
      "end": 2025.8599548339844,
      "text": " the miracle of Christmas,"
    },
    {
      "id": 101,
      "start": 2025.8599548339844,
      "end": 2027.219955444336,
      "text": " the incarnation."
    },
    {
      "id": 102,
      "start": 2027.219955444336,
      "end": 2029.1399536132812,
      "text": " And that was the only way"
    },
    {
      "id": 103,
      "start": 2029.1399536132812,
      "end": 2029.979965209961,
      "text": " that I could be,"
    },
    {
      "id": 104,
      "start": 2029.979965209961,
      "end": 2032.5799560546875,
      "text": " that you could be reconciled and redeemed."
    },
    {
      "id": 105,
      "start": 2032.8999633789062,
      "end": 2034.7399597167969,
      "text": " We find that He then tells us"
    },
    {
      "id": 106,
      "start": 2034.7399597167969,
      "end": 2037.4599609375,
      "text": " that we have this relationship with God"
    },
    {
      "id": 107,
      "start": 2037.4599609375,
      "end": 2040.8999633789062,
      "text": " wherein we cry, Abba, father."
    },
    {
      "id": 108,
      "start": 2041.7399597167969,
      "end": 2043.8999633789062,
      "text": " I'm so thankful that God is my father."
    },
    {
      "id": 109,
      "start": 2045.2599639892578,
      "end": 2047.4999542236328,
      "text": " The idea of the word Abba"
    },
    {
      "id": 110,
      "start": 2047.4999542236328,
      "end": 2049.5399627685547,
      "text": " is a very intimate word,"
    },
    {
      "id": 111,
      "start": 2049.5399627685547,
      "end": 2052.0999603271484,
      "text": " a word that maybe we would use"
    },
    {
      "id": 112,
      "start": 2052.0999603271484,
      "end": 2053.979965209961,
      "text": " in our culture and our society today"
    },
    {
      "id": 113,
      "start": 2053.979965209961,
      "end": 2055.2999572753906,
      "text": " of daddy."
    },
    {
      "id": 114,
      "start": 2056.8999633789062,
      "end": 2059.0599670410156,
      "text": " It's an intimate..."
    },
    {
      "id": 115,
      "start": 2059.0599670410156,
      "end": 2060.6199645996094,
      "text": " Listen, I'm thankful that God"
    },
    {
      "id": 116,
      "start": 2060.6199645996094,
      "end": 2062.7799682617188,
      "text": " is a personal God."
    },
    {
      "id": 117,
      "start": 2062.7799682617188,
      "end": 2063.8599548339844,
      "text": " I'm thankful this morning"
    },
    {
      "id": 118,
      "start": 2063.8599548339844,
      "end": 2065.739959716797,
      "text": " that He's my father"
    },
    {
      "id": 119,
      "start": 2065.739959716797,
      "end": 2066.979949951172,
      "text": " and I can go to Him"
    },
    {
      "id": 120,
      "start": 2066.979949951172,
      "end": 2069.2599487304688,
      "text": " on the basis of my sonship,"
    },
    {
      "id": 121,
      "start": 2069.2599487304688,
      "end": 2070.699951171875,
      "text": " that I can go to Him"
    },
    {
      "id": 122,
      "start": 2070.699951171875,
      "end": 2072.6599731445312,
      "text": " and understanding that He's my father"
    },
    {
      "id": 123,
      "start": 2072.6599731445312,
      "end": 2073.699951171875,
      "text": " and I'm His son."
    },
    {
      "id": 124,
      "start": 2073.699951171875,
      "end": 2075.8999633789062,
      "text": " I have this relationship."
    },
    {
      "id": 125,
      "start": 2075.8999633789062,
      "end": 2079.6599731445312,
      "text": " I've been adopted into the family of God."
    },
    {
      "id": 126,
      "start": 2079.6599731445312,
      "end": 2081.219970703125,
      "text": " We sing the song, hallelujah,"
    },
    {
      "id": 127,
      "start": 2081.219970703125,
      "end": 2082.499969482422,
      "text": " I'm adopted."
    },
    {
      "id": 128,
      "start": 2082.499969482422,
      "end": 2084.8599548339844,
      "text": " I'm a child of the King."
    },
    {
      "id": 129,
      "start": 2084.8599548339844,
      "end": 2086.8199462890625,
      "text": " And it's a wonderful truth."
    },
    {
      "id": 130,
      "start": 2086.8199462890625,
      "end": 2087.6599731445312,
      "text": " And it's a truth"
    },
    {
      "id": 131,
      "start": 2087.6599731445312,
      "end": 2089.739959716797,
      "text": " that's based on biblical truth"
    },
    {
      "id": 132,
      "start": 2089.739959716797,
      "end": 2091.4599609375,
      "text": " as we would sing that song."
    },
    {
      "id": 133,
      "start": 2091.4599609375,
      "end": 2093.0199584960938,
      "text": " And we find here this morning"
    },
    {
      "id": 134,
      "start": 2093.0199584960938,
      "end": 2095.419952392578,
      "text": " that we, if you've trusted Christ,"
    },
    {
      "id": 135,
      "start": 2095.419952392578,
      "end": 2097.3799438476562,
      "text": " that you now, you've been adopted,"
    },
    {
      "id": 136,
      "start": 2097.3799438476562,
      "end": 2098.219970703125,
      "text": " you're a son,"
    },
    {
      "id": 137,
      "start": 2098.219970703125,
      "end": 2099.5799560546875,
      "text": " you have that sonship,"
    },
    {
      "id": 138,
      "start": 2099.5799560546875,
      "end": 2101.219970703125,
      "text": " that relationship."
    },
    {
      "id": 139,
      "start": 2101.219970703125,
      "end": 2102.0599670410156,
      "text": " You know something"
    },
    {
      "id": 140,
      "start": 2102.0599670410156,
      "end": 2103.2599487304688,
      "text": " that's beautiful about relationship"
    },
    {
      "id": 141,
      "start": 2103.2599487304688,
      "end": 2104.5399475097656,
      "text": " is it doesn't change."
    },
    {
      "id": 142,
      "start": 2106.3399658203125,
      "end": 2108.219970703125,
      "text": " Relationship doesn't change."
    },
    {
      "id": 143,
      "start": 2108.219970703125,
      "end": 2109.0599670410156,
      "text": " I'm a son."
    },
    {
      "id": 144,
      "start": 2109.8999633789062,
      "end": 2110.739959716797,
      "text": " You're either a son"
    },
    {
      "id": 145,
      "start": 2110.739959716797,
      "end": 2112.3399658203125,
      "text": " or a daughter here this morning."
    },
    {
      "id": 146,
      "start": 2113.699951171875,
      "end": 2116.179962158203,
      "text": " Everyone that's here this morning has parents."
    },
    {
      "id": 147,
      "start": 2116.179962158203,
      "end": 2117.699951171875,
      "text": " Now your parents may still be living,"
    },
    {
      "id": 148,
      "start": 2117.699951171875,
      "end": 2120.3399658203125,
      "text": " your parents may not be living any longer,"
    },
    {
      "id": 149,
      "start": 2120.3399658203125,
      "end": 2122.2599487304688,
      "text": " but every one of us have parents."
    },
    {
      "id": 150,
      "start": 2122.2599487304688,
      "end": 2123.499969482422,
      "text": " Do you agree?"
    },
    {
      "id": 151,
      "start": 2123.499969482422,
      "end": 2126.4599609375,
      "text": " This is real basic, kindergarten, amen."
    },
    {
      "id": 152,
      "start": 2126.4599609375,
      "end": 2128.3799438476562,
      "text": " We all have parents."
    },
    {
      "id": 153,
      "start": 2129.4599609375,
      "end": 2130.8199462890625,
      "text": " In your relationship with your parents,"
    },
    {
      "id": 154,
      "start": 2130.8199462890625,
      "end": 2132.4599609375,
      "text": " you're their child."
    },
    {
      "id": 155,
      "start": 2132.4599609375,
      "end": 2134.0999450683594,
      "text": " You're their son or their daughter."
    },
    {
      "id": 156,
      "start": 2134.0999450683594,
      "end": 2136.1399536132812,
      "text": " No matter what circumstances happen,"
    },
    {
      "id": 157,
      "start": 2136.1399536132812,
      "end": 2139.0999450683594,
      "text": " no matter what events would transpire in your life,"
    },
    {
      "id": 158,
      "start": 2139.0999450683594,
      "end": 2140.8199462890625,
      "text": " they are always your parents"
    },
    {
      "id": 159,
      "start": 2140.8199462890625,
      "end": 2142.6599731445312,
      "text": " and you're always their child."
    },
    {
      "id": 160,
      "start": 2142.6599731445312,
      "end": 2143.499969482422,
      "text": " Do we agree?"
    },
    {
      "id": 161,
      "start": 2144.4599609375,
      "end": 2146.4599609375,
      "text": " I know that in our society today,"
    },
    {
      "id": 162,
      "start": 2146.4599609375,
      "end": 2147.3799438476562,
      "text": " you have this thing"
    },
    {
      "id": 163,
      "start": 2148.0599670410156,
      "end": 2148.8999633789062,
      "text": " where there are children"
    },
    {
      "id": 164,
      "start": 2148.8999633789062,
      "end": 2149.739959716797,
      "text": " that are divorcing their parents."
    },
    {
      "id": 165,
      "start": 2149.739959716797,
      "end": 2151.1399536132812,
      "text": " It's wild, it's unbelievable"
    },
    {
      "id": 166,
      "start": 2151.1399536132812,
      "end": 2153.4599609375,
      "text": " that this concept could even take place."
    },
    {
      "id": 167,
      "start": 2153.4599609375,
      "end": 2155.6599731445312,
      "text": " But even if you get a paper"
    },
    {
      "id": 168,
      "start": 2155.6599731445312,
      "end": 2157.739959716797,
      "text": " that says that you're divorced from your parents,"
    },
    {
      "id": 169,
      "start": 2157.739959716797,
      "end": 2160.3399658203125,
      "text": " the truth, the reality"
    },
    {
      "id": 170,
      "start": 2160.3399658203125,
      "end": 2161.979949951172,
      "text": " is that you're still their child."
    },
    {
      "id": 171,
      "start": 2163.8199462890625,
      "end": 2167.5399475097656,
      "text": " There's nothing that can change that relationship."
    },
    {
      "id": 172,
      "start": 2168.699951171875,
      "end": 2171.419952392578,
      "text": " And I love the fact that God uses the terminology"
    },
    {
      "id": 173,
      "start": 2171.419952392578,
      "end": 2173.4599609375,
      "text": " that we are sons."
    },
    {
      "id": 174,
      "start": 2173.4599609375,
      "end": 2175.8999633789062,
      "text": " This legal transaction of adoption"
    },
    {
      "id": 175,
      "start": 2175.8999633789062,
      "end": 2177.179962158203,
      "text": " that he refers to here,"
    },
    {
      "id": 176,
      "start": 2177.979949951172,
      "end": 2179.699951171875,
      "text": " this sonship that we receive"
    },
    {
      "id": 177,
      "start": 2179.699951171875,
      "end": 2181.2999572753906,
      "text": " at the moment of salvation,"
    },
    {
      "id": 178,
      "start": 2181.2999572753906,
      "end": 2182.979949951172,
      "text": " I have a relationship with God."
    },
    {
      "id": 179,
      "start": 2182.979949951172,
      "end": 2186.0199584960938,
      "text": " Oh yes, the truth is that my fellowship with God"
    },
    {
      "id": 180,
      "start": 2186.0199584960938,
      "end": 2188.739959716797,
      "text": " may vary from day to day."
    },
    {
      "id": 181,
      "start": 2188.739959716797,
      "end": 2190.4599609375,
      "text": " But one thing that's constant,"
    },
    {
      "id": 182,
      "start": 2190.4599609375,
      "end": 2192.739959716797,
      "text": " one thing that will never change"
    },
    {
      "id": 183,
      "start": 2192.739959716797,
      "end": 2195.0199584960938,
      "text": " is my relationship with God,"
    },
    {
      "id": 184,
      "start": 2195.0199584960938,
      "end": 2197.8999633789062,
      "text": " that he's my father and I'm his son."
    },
    {
      "id": 185,
      "start": 2197.8999633789062,
      "end": 2200.1399536132812,
      "text": " How is this made possible?"
    },
    {
      "id": 186,
      "start": 2200.1399536132812,
      "end": 2202.179962158203,
      "text": " The miracle of Christmas."
    },
    {
      "id": 187,
      "start": 2202.179962158203,
      "end": 2205.2999572753906,
      "text": " The fact that God sent forth his son."
    },
    {
      "id": 188,
      "start": 2205.3399658203125,
      "end": 2209.0599670410156,
      "text": " The fact that he came with a purpose"
    },
    {
      "id": 189,
      "start": 2209.0599670410156,
      "end": 2211.8999633789062,
      "text": " to redeem them that were under the law."
    },
    {
      "id": 190,
      "start": 2211.8999633789062,
      "end": 2215.6599731445312,
      "text": " And I now have this newfound relationship."
    },
    {
      "id": 191,
      "start": 2215.6599731445312,
      "end": 2218.0999450683594,
      "text": " And again, though my fellowship may change,"
    },
    {
      "id": 192,
      "start": 2218.0999450683594,
      "end": 2220.4599609375,
      "text": " just like your fellowship and my fellowship"
    },
    {
      "id": 193,
      "start": 2220.4599609375,
      "end": 2223.499969482422,
      "text": " with my earthly parents would change from time to time."
    },
    {
      "id": 194,
      "start": 2224.3399658203125,
      "end": 2225.8999633789062,
      "text": " You go through that season,"
    },
    {
      "id": 195,
      "start": 2225.8999633789062,
      "end": 2228.939971923828,
      "text": " many go through that season of teenagers"
    },
    {
      "id": 196,
      "start": 2228.939971923828,
      "end": 2231.8199462890625,
      "text": " and there's some difficult years perhaps"
    },
    {
      "id": 197,
      "start": 2231.8199462890625,
      "end": 2234.8199462890625,
      "text": " that are experienced between some parents"
    },
    {
      "id": 198,
      "start": 2234.8199462890625,
      "end": 2236.8999633789062,
      "text": " and some children."
    },
    {
      "id": 199,
      "start": 2236.8999633789062,
      "end": 2238.2599487304688,
      "text": " But at the end of the day,"
    },
    {
      "id": 200,
      "start": 2239.3399658203125,
      "end": 2241.979949951172,
      "text": " you have a constant relationship."
    },
    {
      "id": 201,
      "start": 2241.979949951172,
      "end": 2244.3399658203125,
      "text": " Your fellowship might be strained,"
    },
    {
      "id": 202,
      "start": 2245.3799438476562,
      "end": 2249.179962158203,
      "text": " but your relationship is, it remains."
    },
    {
      "id": 203,
      "start": 2251.179962158203,
      "end": 2252.2599487304688,
      "text": " And this morning,"
    },
    {
      "id": 204,
      "start": 2253.179962158203,
      "end": 2255.3799438476562,
      "text": " we find that the miracle of Christmas"
    },
    {
      "id": 205,
      "start": 2255.3799438476562,
      "end": 2259.0199584960938,
      "text": " is that we can become the sons of God."
    },
    {
      "id": 206,
      "start": 2259.0199584960938,
      "end": 2260.4599609375,
      "text": " It says in verse number seven,"
    },
    {
      "id": 207,
      "start": 2260.4599609375,
      "end": 2262.8199462890625,
      "text": " as we continue reading here in this portion of scripture,"
    },
    {
      "id": 208,
      "start": 2262.8599548339844,
      "end": 2266.7799682617188,
      "text": " wherefore thou art no more a servant, but a son."
    },
    {
      "id": 209,
      "start": 2267.8199462890625,
      "end": 2270.499969482422,
      "text": " And if a son, notice what it says,"
    },
    {
      "id": 210,
      "start": 2270.499969482422,
      "end": 2275.0199584960938,
      "text": " then an heir of God through Christ."
    },
    {
      "id": 211,
      "start": 2275.0199584960938,
      "end": 2276.419952392578,
      "text": " This is amazing."
    },
    {
      "id": 212,
      "start": 2276.419952392578,
      "end": 2278.1399536132812,
      "text": " This is absolutely miraculous."
    },
    {
      "id": 213,
      "start": 2278.1399536132812,
      "end": 2280.3799438476562,
      "text": " As you begin to understand here this morning,"
    },
    {
      "id": 214,
      "start": 2280.3799438476562,
      "end": 2283.0199584960938,
      "text": " the truth of Christmas, the miracle of Christmas,"
    },
    {
      "id": 215,
      "start": 2283.0199584960938,
      "end": 2286.6199645996094,
      "text": " and how the Bible tells us that God,"
    },
    {
      "id": 216,
      "start": 2286.6199645996094,
      "end": 2288.7799682617188,
      "text": " what he did is he sent forth his son."
    },
    {
      "id": 217,
      "start": 2288.7799682617188,
      "end": 2291.499969482422,
      "text": " He dispatched the Lord Jesus Christ,"
    },
    {
      "id": 218,
      "start": 2291.5399475097656,
      "end": 2295.499969482422,
      "text": " God in flesh came to this earth with a purpose,"
    },
    {
      "id": 219,
      "start": 2295.499969482422,
      "end": 2297.0199584960938,
      "text": " the purpose to redeem,"
    },
    {
      "id": 220,
      "start": 2297.0199584960938,
      "end": 2301.6199645996094,
      "text": " and we find that he offers to us sonship."
    },
    {
      "id": 221,
      "start": 2302.8599548339844,
      "end": 2305.3799438476562,
      "text": " But it's only through the Lord Jesus Christ."
    },
    {
      "id": 222,
      "start": 2305.3799438476562,
      "end": 2306.8199462890625,
      "text": " You can't become a son any other way."
    },
    {
      "id": 223,
      "start": 2306.8199462890625,
      "end": 2309.3399658203125,
      "text": " You can't work to become a son."
    },
    {
      "id": 224,
      "start": 2309.3399658203125,
      "end": 2310.419952392578,
      "text": " You can't labor."
    },
    {
      "id": 225,
      "start": 2310.419952392578,
      "end": 2311.2999572753906,
      "text": " You can't toil."
    },
    {
      "id": 226,
      "start": 2311.2999572753906,
      "end": 2312.97998046875,
      "text": " There's nothing you can do."
    },
    {
      "id": 227,
      "start": 2312.97998046875,
      "end": 2316.4999389648438,
      "text": " You have to simply receive his gift that he offers."
    },
    {
      "id": 228,
      "start": 2316.4999389648438,
      "end": 2319.6199340820312,
      "text": " The Bible says it this way in John one in verse number 12,"
    },
    {
      "id": 229,
      "start": 2319.6199340820312,
      "end": 2321.5399780273438,
      "text": " but as many as received him,"
    },
    {
      "id": 230,
      "start": 2321.5399780273438,
      "end": 2324.5799560546875,
      "text": " to them gave he power to become the sons of God,"
    },
    {
      "id": 231,
      "start": 2324.5799560546875,
      "end": 2327.93994140625,
      "text": " even to them that believe on his name."
    },
    {
      "id": 232,
      "start": 2329.3399658203125,
      "end": 2331.219970703125,
      "text": " It's interesting in John one in verse 12,"
    },
    {
      "id": 233,
      "start": 2331.219970703125,
      "end": 2335.0999755859375,
      "text": " how it uses the word received and believe."
    },
    {
      "id": 234,
      "start": 2335.0999755859375,
      "end": 2336.8999633789062,
      "text": " We must believe that Jesus is God."
    },
    {
      "id": 235,
      "start": 2336.8999633789062,
      "end": 2340.0599365234375,
      "text": " We must recognize that he is who he says he is."
    },
    {
      "id": 236,
      "start": 2340.0599365234375,
      "end": 2342.699951171875,
      "text": " He declared to be God in flesh and he is."
    },
    {
      "id": 237,
      "start": 2342.699951171875,
      "end": 2345.3399658203125,
      "text": " We understand this morning that he's sinless."
    },
    {
      "id": 238,
      "start": 2345.3399658203125,
      "end": 2346.7399291992188,
      "text": " He's pure and he's holy."
    },
    {
      "id": 239,
      "start": 2346.7399291992188,
      "end": 2348.0999755859375,
      "text": " He went to a cruel cross"
    },
    {
      "id": 240,
      "start": 2348.0999755859375,
      "end": 2351.0999755859375,
      "text": " and he was buried in a borrowed tomb."
    },
    {
      "id": 241,
      "start": 2351.0999755859375,
      "end": 2353.2599487304688,
      "text": " He rose conquering sin, death, and the grave."
    },
    {
      "id": 242,
      "start": 2353.2599487304688,
      "end": 2354.8599853515625,
      "text": " We must believe that truth."
    },
    {
      "id": 243,
      "start": 2354.8599853515625,
      "end": 2358.3399658203125,
      "text": " We must believe that there's no other way to get to heaven."
    },
    {
      "id": 244,
      "start": 2358.3399658203125,
      "end": 2359.699951171875,
      "text": " Today, people are running around"
    },
    {
      "id": 245,
      "start": 2359.699951171875,
      "end": 2361.1399536132812,
      "text": " thinking they can get to heaven"
    },
    {
      "id": 246,
      "start": 2361.1399536132812,
      "end": 2363.219970703125,
      "text": " through some merit of their own."
    },
    {
      "id": 247,
      "start": 2363.219970703125,
      "end": 2365.97998046875,
      "text": " On the authority of God's word, there is no other way."
    },
    {
      "id": 248,
      "start": 2365.97998046875,
      "end": 2369.6199340820312,
      "text": " Jesus said this, I am the way, the truth, and the life."
    },
    {
      "id": 249,
      "start": 2369.6199340820312,
      "end": 2374.6199340820312,
      "text": " It says this, no man cometh unto the father but by me."
    },
    {
      "id": 250,
      "start": 2375.6199340820312,
      "end": 2378.93994140625,
      "text": " Peter would declare in the book of Acts"
    },
    {
      "id": 251,
      "start": 2378.93994140625,
      "end": 2383.0599365234375,
      "text": " as he's standing before the religious leaders,"
    },
    {
      "id": 252,
      "start": 2383.0599365234375,
      "end": 2385.2599487304688,
      "text": " being questioned for the miracle that took place"
    },
    {
      "id": 253,
      "start": 2385.2599487304688,
      "end": 2387.699951171875,
      "text": " with the healing of a lame man."
    },
    {
      "id": 254,
      "start": 2387.699951171875,
      "end": 2390.4999389648438,
      "text": " He says, neither is there salvation in any other."
    },
    {
      "id": 255,
      "start": 2390.4999389648438,
      "end": 2392.6199340820312,
      "text": " There's no other name under heaven given among men"
    },
    {
      "id": 256,
      "start": 2392.6199340820312,
      "end": 2395.5799560546875,
      "text": " whereby we must be saved."
    },
    {
      "id": 257,
      "start": 2395.5799560546875,
      "end": 2397.4199829101562,
      "text": " What name was Peter referring to?"
    },
    {
      "id": 258,
      "start": 2397.4199829101562,
      "end": 2399.6599731445312,
      "text": " Jesus, Jesus of Nazareth."
    },
    {
      "id": 0,
      "start": 2399.6599731445312,
      "end": 2405.6599731445312,
      "text": " God in flesh, and we find here this morning that we must believe those things, but then"
    },
    {
      "id": 1,
      "start": 2405.6599731445312,
      "end": 2410.339973449707,
      "text": " we must receive that gift that God offers."
    },
    {
      "id": 2,
      "start": 2410.339973449707,
      "end": 2415.7199726104736,
      "text": " But as many as received Him, John 1 and verse number 12, to them gave He power to become"
    },
    {
      "id": 3,
      "start": 2415.7199726104736,
      "end": 2418.619972229004,
      "text": " the sons of God, even to them that believe on His name."
    },
    {
      "id": 4,
      "start": 2418.619972229004,
      "end": 2420.499973297119,
      "text": " And we receive that gift."
    },
    {
      "id": 5,
      "start": 2420.499973297119,
      "end": 2427.619972229004,
      "text": " See, believing is not simply an intellectual exercise."
    },
    {
      "id": 6,
      "start": 2427.619972229004,
      "end": 2429.3999729156494,
      "text": " There's repentance that's involved."
    },
    {
      "id": 7,
      "start": 2429.3999729156494,
      "end": 2434.8799743652344,
      "text": " There's a turning away from our sin and from our own ideas about how we can approach God."
    },
    {
      "id": 8,
      "start": 2434.8799743652344,
      "end": 2441.519973754883,
      "text": " There's a turn to God and a receiving of this truth that we've preached this morning and"
    },
    {
      "id": 9,
      "start": 2441.519973754883,
      "end": 2443.7999725341797,
      "text": " we've believed and then we receive."
    },
    {
      "id": 10,
      "start": 2443.7999725341797,
      "end": 2446.999973297119,
      "text": " And the Bible says that He makes us sons."
    },
    {
      "id": 11,
      "start": 2446.999973297119,
      "end": 2453.0799713134766,
      "text": " It says that we are no longer a servant but a son, and if a son, then an heir of God through"
    },
    {
      "id": 12,
      "start": 2453.0799713134766,
      "end": 2454.0799713134766,
      "text": " Christ."
    },
    {
      "id": 13,
      "start": 2454.0799713134766,
      "end": 2456.8799743652344,
      "text": " It's absolutely amazing."
    },
    {
      "id": 14,
      "start": 2456.8799743652344,
      "end": 2459.679973602295,
      "text": " It's miraculous."
    },
    {
      "id": 15,
      "start": 2459.679973602295,
      "end": 2464.8799743652344,
      "text": " The Bible would tell us this in 1 John chapter 3 and verse number 1."
    },
    {
      "id": 16,
      "start": 2464.8799743652344,
      "end": 2471.959976196289,
      "text": " It's a verse of Scripture that I've come to greatly appreciate."
    },
    {
      "id": 17,
      "start": 2471.959976196289,
      "end": 2487.999969482422,
      "text": " In 1 John 3 and verse number 1, when the Bible would say this, behold, what manner"
    },
    {
      "id": 18,
      "start": 2487.999969482422,
      "end": 2499.039970397949,
      "text": " of love the Father hath bestowed upon us that we should be called the sons of God."
    },
    {
      "id": 19,
      "start": 2499.039970397949,
      "end": 2503.959976196289,
      "text": " For the world knoweth us not because it knew Him not."
    },
    {
      "id": 20,
      "start": 2503.959976196289,
      "end": 2509.9199752807617,
      "text": " You notice the phrase there, behold, what manner of love the Father hath bestowed upon"
    },
    {
      "id": 21,
      "start": 2509.9199752807617,
      "end": 2515.2799758911133,
      "text": " us that we should be called the sons of God."
    },
    {
      "id": 22,
      "start": 2515.2799758911133,
      "end": 2520.399971008301,
      "text": " The miracle of Christmas, why is it this morning, I ask this question by way of introduction,"
    },
    {
      "id": 23,
      "start": 2520.399971008301,
      "end": 2526.1999740600586,
      "text": " why would we say that Christmas is miraculous?"
    },
    {
      "id": 24,
      "start": 2526.1999740600586,
      "end": 2532.3599700927734,
      "text": " What is it about Christmas that would lead me or lead anyone else to say it's miraculous?"
    },
    {
      "id": 25,
      "start": 2532.3599700927734,
      "end": 2539.5599670410156,
      "text": " Why would I title a message and spend a time preaching on the miracle of Christmas?"
    },
    {
      "id": 26,
      "start": 2539.5599670410156,
      "end": 2545.199966430664,
      "text": " Because truly when we understand the incarnation, it's miraculous."
    },
    {
      "id": 27,
      "start": 2545.199966430664,
      "end": 2548.3599700927734,
      "text": " Every single aspect."
    },
    {
      "id": 28,
      "start": 2548.3599700927734,
      "end": 2557.759979248047,
      "text": " The fact that God loved me so much, that God loved you so much that He sent forth His Son."
    },
    {
      "id": 29,
      "start": 2557.759979248047,
      "end": 2563.679977416992,
      "text": " He gave His only begotten Son."
    },
    {
      "id": 30,
      "start": 2563.679977416992,
      "end": 2570.759979248047,
      "text": " The virgin birth but then the purpose to redeem."
    },
    {
      "id": 31,
      "start": 2570.759979248047,
      "end": 2578.1199798583984,
      "text": " I can't even imagine this morning going through life not knowing this truth."
    },
    {
      "id": 32,
      "start": 2578.1199798583984,
      "end": 2584.8399658203125,
      "text": " For years of my life we celebrated Christmas."
    },
    {
      "id": 33,
      "start": 2584.8399658203125,
      "end": 2593.5999755859375,
      "text": " I knew that we celebrated Christmas because of the birth of Jesus but it stopped there."
    },
    {
      "id": 34,
      "start": 2593.5999755859375,
      "end": 2596.759979248047,
      "text": " I didn't understand why He was born."
    },
    {
      "id": 35,
      "start": 2596.759979248047,
      "end": 2598.6399688720703,
      "text": " I didn't understand for what purpose He was born."
    },
    {
      "id": 36,
      "start": 2598.6399688720703,
      "end": 2601.519973754883,
      "text": " I didn't even really understand how He was born."
    },
    {
      "id": 37,
      "start": 2601.519973754883,
      "end": 2607.3199768066406,
      "text": " I just knew that we sang songs and we talked about Christmas was about Jesus being born."
    },
    {
      "id": 38,
      "start": 2607.3199768066406,
      "end": 2614.1599731445312,
      "text": " But you know really what it was most about for me was all the gifts and all of the family"
    },
    {
      "id": 39,
      "start": 2614.1599731445312,
      "end": 2616.519973754883,
      "text": " and traditions and all that sort of thing."
    },
    {
      "id": 40,
      "start": 2616.519973754883,
      "end": 2623.719970703125,
      "text": " But there was a day in my life when I was 17 years old that I recognized that I was"
    },
    {
      "id": 41,
      "start": 2623.719970703125,
      "end": 2629.47998046875,
      "text": " a sinner in need of the only Savior."
    },
    {
      "id": 42,
      "start": 2629.47998046875,
      "end": 2636.5599670410156,
      "text": " The one for whose birth, quote unquote, we had celebrated for 17 years."
    },
    {
      "id": 43,
      "start": 2636.5599670410156,
      "end": 2645.3999786376953,
      "text": " But never really knowing why and all of a sudden I understood the real miracle of Christmas."
    },
    {
      "id": 44,
      "start": 2645.3999786376953,
      "end": 2651.999969482422,
      "text": " That God sent forth His Son so that I could be redeemed and I placed my faith and trust"
    },
    {
      "id": 45,
      "start": 2651.999969482422,
      "end": 2655.0399780273438,
      "text": " in Jesus Christ as my personal Savior."
    },
    {
      "id": 46,
      "start": 2655.0399780273438,
      "end": 2661.6399841308594,
      "text": " Just a few months later, it was in August when I got saved and the year was 97."
    },
    {
      "id": 47,
      "start": 2661.6399841308594,
      "end": 2665.5599670410156,
      "text": " Some of you weren't even alive."
    },
    {
      "id": 48,
      "start": 2665.5599670410156,
      "end": 2671.999969482422,
      "text": " That first Christmas, Christmas of 97, was a Christmas unlike any other Christmas."
    },
    {
      "id": 49,
      "start": 2671.999969482422,
      "end": 2673.5599670410156,
      "text": " Why?"
    },
    {
      "id": 50,
      "start": 2673.5599670410156,
      "end": 2680.999969482422,
      "text": " Because I had a clear understanding of what Christmas was really all about."
    },
    {
      "id": 51,
      "start": 2680.999969482422,
      "end": 2688.679962158203,
      "text": " And this morning, I hope that as we celebrate, it's Christmas Eve, tomorrow is Christmas."
    },
    {
      "id": 52,
      "start": 2688.679962158203,
      "end": 2695.5599670410156,
      "text": " I hope that as we celebrate that we rejoice in knowing the true meaning of Christmas,"
    },
    {
      "id": 53,
      "start": 2695.5599670410156,
      "end": 2698.239959716797,
      "text": " the miracle of Christmas."
    },
    {
      "id": 54,
      "start": 2698.239959716797,
      "end": 2708.6399841308594,
      "text": " I hope that today, this week, tomorrow as we gather with family and friends that perhaps"
    },
    {
      "id": 55,
      "start": 2708.679962158203,
      "end": 2715.0799865722656,
      "text": " God would give us an opportunity to speak of the miracle of Christmas."
    },
    {
      "id": 56,
      "start": 2715.0799865722656,
      "end": 2718.7999877929688,
      "text": " Because it's nothing short of miraculous."
    },
    {
      "id": 57,
      "start": 2718.7999877929688,
      "end": 2723.259979248047,
      "text": " This morning, if you're saved, if you know the Lord Jesus Christ, I think you'd agree."
    },
    {
      "id": 58,
      "start": 2723.259979248047,
      "end": 2725.47998046875,
      "text": " Nothing short of miraculous."
    },
    {
      "id": 59,
      "start": 2725.47998046875,
      "end": 2730.2799682617188,
      "text": " Let us rejoice in the miracle of Christmas."
    },
    {
      "id": 60,
      "start": 2730.2799682617188,
      "end": 2736.1199645996094,
      "text": " But this morning, if you're not saved, if you don't know for sure if heaven's your home,"
    },
    {
      "id": 61,
      "start": 2736.1199645996094,
      "end": 2741.2799682617188,
      "text": " you say, I knew we celebrated Christmas, I've celebrated Christmas for years, but I never"
    },
    {
      "id": 62,
      "start": 2741.2799682617188,
      "end": 2743.759979248047,
      "text": " truly understood why."
    },
    {
      "id": 63,
      "start": 2743.759979248047,
      "end": 2745.999969482422,
      "text": " I didn't understand the implication."
    },
    {
      "id": 64,
      "start": 2745.999969482422,
      "end": 2752.679962158203,
      "text": " I didn't understand that Jesus, God in flesh, came so that I could be saved because I needed"
    },
    {
      "id": 65,
      "start": 2752.679962158203,
      "end": 2758.0399780273438,
      "text": " a savior because I was lost and because of my sin and because that I'm guilty, I was"
    },
    {
      "id": 66,
      "start": 2758.0399780273438,
      "end": 2761.5999755859375,
      "text": " headed to a Christless eternity."
    },
    {
      "id": 67,
      "start": 2761.5999755859375,
      "end": 2768.239959716797,
      "text": " Maybe this Christmas could be like that first Christmas for me back in 97 when you truly"
    },
    {
      "id": 68,
      "start": 2768.239959716797,
      "end": 2772.999969482422,
      "text": " realize and recognize the miracle of Christmas."
    },
    {
      "id": 69,
      "start": 2772.999969482422,
      "end": 2776.8799743652344,
      "text": " And you can accept that wonderful gift that God has for you, the gift of God which is"
    },
    {
      "id": 70,
      "start": 2776.8799743652344,
      "end": 2780.9599609375,
      "text": " eternal life through Jesus Christ our Lord."
    },
    {
      "id": 71,
      "start": 2780.9599609375,
      "end": 2786.7999877929688,
      "text": " This morning, if you're not sure of heaven, oh, we would beg you to trust Christ this"
    },
    {
      "id": 72,
      "start": 2786.7999877929688,
      "end": 2787.7999877929688,
      "text": " morning."
    },
    {
      "id": 73,
      "start": 2787.7999877929688,
      "end": 2789.9199829101562,
      "text": " Do not leave this place without knowing for sure."
    },
    {
      "id": 74,
      "start": 2789.9199829101562,
      "end": 2799.199981689453,
      "text": " I mean 100% absolute certainty that heaven is your home, that you are a son of God, that"
    },
    {
      "id": 75,
      "start": 2799.199981689453,
      "end": 2803.1199645996094,
      "text": " you've been adopted into the family of God, the miracle of Christmas."
    },
    {
      "id": 76,
      "start": 2803.1199645996094,
      "end": 2806.5599670410156,
      "text": " We notice in our text of scripture what God did."
    },
    {
      "id": 77,
      "start": 2806.5599670410156,
      "end": 2811.1599731445312,
      "text": " We notice how He did it and we notice why He did it."
    },
    {
      "id": 78,
      "start": 2811.1599731445312,
      "end": 2814.1199645996094,
      "text": " Thank God for the miracle of the incarnation."
    },
    {
      "id": 79,
      "start": 2814.1199645996094,
      "end": 2815.6399841308594,
      "text": " Let's pray together."
    },
    {
      "id": 80,
      "start": 2816.439971923828,
      "end": 2818.3199768066406,
      "text": " We love you this morning."
    },
    {
      "id": 81,
      "start": 2818.3199768066406,
      "end": 2820.3999633789062,
      "text": " We thank you for loving us."
    },
    {
      "id": 82,
      "start": 2820.3999633789062,
      "end": 2830.0799865722656,
      "text": " Lord, perhaps this morning there are many that are rejoicing in their salvation."
    },
    {
      "id": 83,
      "start": 2830.0799865722656,
      "end": 2832.47998046875,
      "text": " They know that they've been adopted in the family of God."
    },
    {
      "id": 84,
      "start": 2832.47998046875,
      "end": 2839.1199645996094,
      "text": " They're a child of yours, an heir of God through Christ."
    },
    {
      "id": 85,
      "start": 2839.1199645996094,
      "end": 2843.3599853515625,
      "text": " Lord, I pray that you'd help us to rejoice."
    },
    {
      "id": 86,
      "start": 2843.3599853515625,
      "end": 2848.8399658203125,
      "text": " Help us, Lord, to be vocal about the miracle of Christmas."
    },
    {
      "id": 87,
      "start": 2848.8399658203125,
      "end": 2858.439971923828,
      "text": " Lord, perhaps there's one, maybe many, under the sound of my voice this morning that do"
    },
    {
      "id": 88,
      "start": 2858.439971923828,
      "end": 2862.759979248047,
      "text": " not know the Lord Jesus Christ as their personal Savior."
    },
    {
      "id": 89,
      "start": 2862.759979248047,
      "end": 2865.3199768066406,
      "text": " They've never been saved or born again."
    },
    {
      "id": 90,
      "start": 2865.3199768066406,
      "end": 2871.679962158203,
      "text": " God, I pray the Holy Spirit in this moment would convict them of their sin of Christ's"
    },
    {
      "id": 91,
      "start": 2871.679962158203,
      "end": 2875.2799682617188,
      "text": " righteousness, of judgment to come."
    },
    {
      "id": 92,
      "start": 2875.2799682617188,
      "end": 2880.8799743652344,
      "text": " I pray, God, that they would not leave this place without knowing for sure that heaven"
    },
    {
      "id": 93,
      "start": 2880.8799743652344,
      "end": 2887.3999633789062,
      "text": " is their home, that this Christmas would be like no other Christmas they've ever celebrated"
    },
    {
      "id": 94,
      "start": 2887.3999633789062,
      "end": 2893.0399780273438,
      "text": " because they would have the knowledge of the true meaning, the miracle of Christmas."
    },
    {
      "id": 95,
      "start": 2893.0399780273438,
      "end": 2898.999969482422,
      "text": " We pray that you'd have free reign, that you'd move and work as only you can."
    },
    {
      "id": 96,
      "start": 2898.999969482422,
      "end": 2903.5599670410156,
      "text": " We'll thank you for what you'll do, for it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-15T10:20:04.385579"
}