{
  "video_id": "PgcjaAnGexU",
  "text": "Turn the book of Exodus if you will Exodus chapter number 14 Exodus chapter number 14. It's a familiar passage of Scripture I trust to be a blessing to you today as I mentioned just a little while ago by during the announcements we finished up the book of Colossians and I thoroughly enjoyed the opportunity of preaching and teaching through the book of Colossians on Sunday mornings here in 2021 and we finished two weeks ago and I believe the Lord taught us much through our study the book of Colossians and Next week. We'll begin a brand new study for a new theme for 2022 and looking forward to the opportunity last week Of course, we looked at that passage in John chapter number four when the Lord Jesus Christ went through Samaria He met that woman at the well and he said to her if thou knewest the gift of God And I know that we had the opportunity to study that passage. I trust that the Lord has Encouraged you by Understanding and being a recipient of the greatest gift that's ever been given the gift of God Which is eternal life this morning as we look at this passage in Exodus chapter number 14 and really think about the closing of one Year and entering into another year. I trust that we'd be encouraged that we'd be strengthened We'd be challenged as we look forward to what God has for us. I'm thankful then in the midst of all of the chaos and Confusion that our God remains seated upon his throne and he has a plan and I believe that as we look throughout the whole of Scripture that God's instruction to us As the people of God is that we are to continue and we'll use a phrase throughout the service this morning that we find here in Exodus chapter number 14 that we are to go forward and There's no room for retreat. There's no room for compromise. We can't stay where we are. We can't go back We must go forward as we look at Exodus chapter number 14 again. It's a very familiar passage of Scripture In fact, it's here that God tells us about that great miracle of the crossing of the Red Sea It's interesting to me that as you read the Scriptures you read the entirety of the Bible that this miracle above any other miracle is mentioned Over and over throughout the Word of God In fact, you read in the book of Psalms many References to this period of time when God delivered his people from Egyptian bondage and they crossed over the Red Sea on dry ground What a great miracle as we think about the many times in which this particular Passage in this event is recorded and repeated in the Word of God We find really that it serves two purposes number one to remind us of God's power to remind us of what our God is able to do to remind us of what he has done and encourage us with what he's able to do we find also that it certainly serves as a As a faith builder we often speak about the importance of our faith being increased and you look throughout the Word of God and you find that the Disciples prayed they asked the Lord to increase their faith. We understand that there are Representations throughout the Word of God of those that have had their faith increased and we know that faith cometh by hearing and hearing From this precious book the Bible the Word of God and I'm so thankful that God has given it to us beginning in verse number 1 of Exodus 14 the Bible says this and the Lord spake unto Moses saying Speak unto the children of Israel that they turn and encamp before pie Hi Roth between Migdol and the scene over against Baal Zephon before it shall ye Encamp by the sea and so we find here in verse number two that God gave specific Instruction with regard to the place in which the children of Israel were to go The Bible says in verse number three for Pharaoh will say of the children of Israel They are entangled in the land The wilderness hath shut them in and I will harden Pharaoh's heart that he shall follow after them and I will be honored upon Pharaoh and upon all his host that the Egyptians may know that I am the Lord and they did so and it was told the king of Egypt that the people fled and the heart of Pharaoh and of his servants was turned against the People and they said why have we done this that we have let Israel go from serving us? And he made ready his chariots and took his people with him and he took 600 chosen chariots and all the chariots of Egypt and captains over every one of them and the Lord hardened the heart of Pharaoh king of Egypt and he pursued after the children of Israel and the children of Israel went out with a high hand notice in verse number nine the Bible says the Egyptians pursued after them all the horses and chariots of Pharaoh and his horsemen in his army and Overtook them in camping by the sea beside Piah a high wrath before Baal Zephon That's exactly where they were to be according to verse number two the Bible says that when Pharaoh drew nigh the children of Israel lifted up their eyes and behold the Egyptians marched after them and they were sore afraid and the children of Israel cried out unto the Lord Verse number 11 records for us what they say to Moses It says this and they said unto Moses because there were no graves in Egypt that has now taken us away To die in the wilderness Wherefore hast thou dealt thus with us to carry us forth out of Egypt Is not this the word that we did tell thee in Egypt saying let us alone that we may serve the Egyptians For it had been better for us to serve the Egyptians than that We should die in the wilderness and we find first of all here the people speak in verses 11 and 12 We read of the people speaking and really they're speaking against Moses and they are certain that death is imminent They of course are in this particular location where God has led them We understand that before them is the Red Sea, but they see according to verse number 10 They lifted up their eyes and they beheld the Egyptians marched after them and the Bible says that they were sore afraid Their circumstances led them to a place of fear and they speak and they say that it would be better for them Had they stayed in Egypt? We find that Moses speaks in verse number 13 and 14 and the Bible says and Moses said unto the people Fear ye not Stand still and see the salvation of the lord which he will show to you today For the egyptians whom ye have seen today ye shall see them again no more forever Notice this the lord shall fight for you and ye shall hold your peace And so moses the human leader the man that god had chosen to lead the children of israel out of egyptian bondage God is now using his man to encourage the people He tells them to fear not to stand still to see the salvation of the lord He tells them the lord shall fight for you and ye shall hold your peace But I want to draw your attention to what god says in verse number 15 We find that the people spoke we find that moses spoke and now the lord speaks And notice the bible tells us in verse number 15 and the lord said unto moses Wherefore cryest thou unto me? Notice what he says speak unto the children of israel that they go forward But lift thou up thy rod and stretch out thine hand over the sea And divide it the children of israel shall go on dry ground through the midst of the sea He said this go forward Go forward. We think about this truth and we understand for the children of israel Contextually speaking in exodus 14 that they were to go forward. They were to cross this red sea We find that for us as the people of god today, I mentioned already there's no room for retreat There's no room for compromise We must go forward in fact in hebrews chapter number 10 the word of god teaches us this truth with regard to going forward to making progress to Continuing to understand the direction in which we're to go in hebrews chapter number 10 As that chapter ends and before we get to the great hall of faith chapter I want you to see what is said in verses 37 through 39 of hebrews chapter number 10 The bible says this for yet a little while and he that shall come will come and will not tarry He's speaking about the return of our great god and savior the lord. Jesus christ the blessed hope and we have great confidence that One day one glorious day. We will hear the trumpet of the lord and we will be here No longer we'll be caught up to meet the lord in the air and I look forward to that day Of course, we do not know the hour the day nor the hour of that particular Event that will take place but we have great confidence that we know that he will come Now notice what the bible says in verse number 38 now the just shall live by faith We don't live by sight. We live by faith But if any man what does it say draw back If any man draw back my soul shall have no pleasure in him notice in verse number 39 But we are not of them who draw back unto perdition but to them that believe to the saving of the soul and then we enter into The 11th chapter of the book of hebrews the great hall of faith chapter where the bible tells us of all those great Victories that were wrought through faith and we understand and we often reference verse number six But without faith it is impossible to please him For he that cometh to god must believe that he is and that he is a rewarder to them that diligently Seek him Oh that we as the people of god would go forward for a few minutes this morning from the 14th chapter of the book of Exodus. I want to preach a message that I've simply entitled from that 15th verse, Go Forward. Go forward. Four questions that we'll use by way of points this morning. The first question is this, why do we go forward? Why is it that we should go forward? Why is it that the children of Israel, given the circumstances, the situation in which they face, why do we go forward? Why do they go forward? Why today in 2021, why is it that I would preach this message? Why is it that we should have this thought that we are to go forward? In one word, the answer is this, obedience. Obedience. Why do we go forward? We go forward because we obey the Lord Jesus Christ. We go forward, the children of Israel are to go forward. Why? Because God spoke. We find that the people said, in verses 11 and 12, we've mentioned it by way of introduction, to understand the fear and the trembling of the people of God, the children of Israel. They said it had been better had they stayed in Egypt than that they should die in the wilderness. And Moses speaks, and I'm thankful for the leadership of Moses and the faith of Moses when he says stand still. Fear ye not, stand still, and see the salvation of the Lord. For the Lord shall fight for you. And ye shall hold your peace. I'm thankful for his faith. But we go forward because God speaks. I'm thankful for the leadership of Moses. I'm thankful for what Moses said. But you understand that Moses said stand still and see the salvation of the Lord. And I believe he had great faith that God was going to work, but they went forward as a matter of obedience because of what God said. Because in verse number 15, the Bible says, the Lord said unto Moses, wherefore, cryest thou unto Me, speak unto the children of Israel that they go forward. It's a matter of obedience. We so often speak about obedience, we sing songs about obedience, trust and obey, for there's no other way to be happy in Jesus but to trust and obey. Obedience is the very best way to show what? That you believe. Doing exactly what the Lord commands, doing it happily. And we find that often as we think about the Word of God and we understand throughout the Scriptures that God has placed a premium on obedience, we see it here in Exodus chapter number 14, why is it that they should go forward? Was it because collectively they got together and they devised a plan? Was it because of some other event or some circumstance or some great idea? No, it was because of obedience. It's a matter of obedience. Turn to the New Testament and think about us for New Testament believers, the book of Matthew. Matthew chapter number 28, it's a familiar passage of Scripture, but I want to remind you this morning that we read and look to this passage of Scripture because we as a church, and I speak not just of Fellowship Baptist Church, but as the people of God, the church of God, we've not yet fulfilled all that this passage of Scripture has commanded us to do when we think about the importance of missions and preaching the Gospel and taking it to all the world. The Bible says this in Matthew chapter 28, before the Lord Jesus Christ ascended to heaven in verse number 18, and Jesus came and spake unto them saying, all power is given unto me in heaven and in earth. Go ye therefore and teach all nations, baptizing them in the name of the Father and of the Son and of the Holy Ghost, teaching them to observe all things whatsoever I have commanded you. And lo, I am with you all way, even unto the end of the world. Amen. The reality is that oftentimes as we look at this passage of Scripture, we mentioned the Great Commission and how important the Great Commission is. And we understand that the Lord Jesus Christ, His last commandment that He gave us before He ascended to heaven continues, remains to be the mission of the church today. If we lose our focus, if we lose our mission, if we lose our purpose, yes, it's to exalt and to glorify the Lord Jesus Christ, but we find it in John, the Bible says, herein is my Father glorified that ye bear much fruit. And we must be about the Father's business. We must be about obedience to this command. Why is it that we go forward with carrying the gospel to a lost and dying world? It's a matter of obedience. It's not because we've received some phone call from some city council member that has said, would you please go into the community and give them the truth of the gospel? That'd be very interesting if we received a phone call such as that, would it not? But the reality is that we do not go forward because of the request of some elected official, some politician, we go forward because of the command of our Lord Jesus Christ. It's a matter of obedience. We find it in Philippians, turn over to the book of Philippians, if you will, in chapter number three, Philippians chapter number three, and you look in these verses of scripture here in verses 12 through 14, and I want you to consider the thought and the perspective of the apostle Paul as he gives it here in this passage of scripture. We find that he says this in Philippians three in verse number 12, not as though I had already attained, either were already perfect, but I follow after, if that I may apprehend that for which also I am apprehended of Christ Jesus. Brethren, I count not myself to have apprehended, but this one thing I do, forgetting those things which are behind and reaching forth unto those things which are before. Notice what he says in verse number 14, I press toward the mark for the prize of the high calling of God in Christ Jesus. This is a testimony of a man who desires to go forward for the Lord Jesus Christ, a man that recognizes that I've not yet apprehended, that I have a desire that I may apprehend that for which also I am apprehended according to verse number 12, but he says I've not yet apprehended, and so what do I do? He says this at the end of verse number 13, reaching forth unto those things which are before, and how does he do it? I press toward the mark for the prize of the high calling of God in Christ Jesus. Often as we read the examples of the apostle Paul as God would use him to write scripture, we find that there are two really analogies that he uses of the Christian life regularly throughout the pages of scripture that God would use him to pen. One is that of a soldier and the importance of being a good soldier of Jesus Christ, but another analogy that he uses is that of a really an athlete, and he speaks of some athletic terms, and here no doubt there's a perspective of athletics and pressing toward the mark for the prize and thinking about reaching for that finish line, if you will, that goal to get to that place, and we find that as the people of God, we must go forward. What was it that compelled Paul to have this perspective? Why is it that he had this desire to go forward? No doubt it was out of obedience. God had placed a call upon his life. God had given him a purpose and a vision and a reason for living, and we find that he wanted to go forward. In 2 Timothy chapter number three, it's a familiar verse of scripture, and we find that it's in this passage, really in the book of 2 Timothy, where Paul is writing and he's about to be martyred for his faith. He speaks of that specifically in the fourth chapter, but in the third chapter of the book of 2 Timothy, he's speaking about these last days, and he's giving a glimpse into the time in which the last days and how they'll be described, and we find that no doubt, as you read the beginning of 2 Timothy chapter number three, many of these descriptive terms that are used to describe the last days and the perilous times that shall come are prevalent in our day in which we live. And Paul says to Timothy in verse number 14, but continue thou. Continue thou in the things which thou hast learned and hast been assured of, knowing of whom thou hast learned them. I understand that the phrase go forward is not found in that verse of scripture, but I feel as we think about this truth of continue, he's not telling him to just kind of hole up and mount up and get ready and just stay where you are or to retreat. No, he tells him to continue. The idea of going forward, making progress. There's a work to be done. And so why is it that we go forward? Why should the children of Israel respond? And here in Exodus chapter number 14, it's a matter of obedience. Let me ask this question, number two, if you're taking notes. Not only why. do we go forward? But number two, how? How do we go forward? How do we go forward? You say, well that's easy, you put one foot in front of the other. I want you to think about the situation, the circumstances of the children of Israel back in Exodus chapter number 14. Again, it's a familiar passage of Scripture. I've preached from Exodus 14 in the past and no doubt you've read it, you've heard people preach from it. It's a great passage of Scripture, a great victory that was wrought for the children of Israel, but I want you to consider their circumstances. And they're there in that place, Pi-hahiroth, as the Bible tells us, and they were led to that place. And the Egyptians were gonna have the perspective that they were entangled in the land, that there was no way for them to get out, they were trapped, and thus the the Egyptians would be able to to be victorious. But we find that as we look at the circumstances, that before them is the Red Sea. Behind them they've seen, they lifted up their eyes according to verse number 10, and they saw the Egyptians coming. All the host of the Egyptians. So you got the Red Sea and you have the Egyptians. Go forward. Go forward. It's a matter of obedience. Why do we go forward? We go forward because of obedience. But how do we go forward? We go forward by faith. We go forward by faith. We find that here, as we look at this passage of Scripture in Exodus chapter number 14, they had to believe God. They had to believe that it would happen just as He said it would happen. Notice in Exodus chapter number 14, the Bible says in verse number 15, that the Lord said unto Moses, wherefore criest thou unto me? Speak unto the children of Israel that they go forward. Lift thou up thy rod and stretch out thine hand over the sea, and divide it. And the children of Israel shall go on dry ground through the midst of the sea. I've heard people say that it didn't require much faith on the part of the children of Israel because God parted the Red Sea before they walked into the dry ground and to pass over the Red Sea. And they've peddled the idea that it took more faith for the children of Israel to cross over the Jordan because they had to take a step in before the waters were parted. I would submit to you that it's really the same level of faith because when they saw the walls of water on either side of them when they were going to enter into the Red Sea, it required a great deal of faith to believe that God would continue to hold those walls of water back for them to cross to the other side. It's a matter of faith. Believing God, believing that not only could God do it but that God would provide them safety for the entirety of the passage, that until they reached the other side that they would have the the safety and the ability to cross over. The Bible tells us as we move forward further through here in Exodus chapter 14 that they passed over on dry ground. It's amazing, phenomenal, but it's by faith. It's by faith. We go forward. Why? Because of obedience. How? By faith. In Matthew chapter number 16 and verse number 18 we find that Jesus gives this great promise to Peter and he says, upon this rock I will build my church. He tells him that the gates of hell shall not prevail against it. When we think about the the importance of us as New Testament believers going forward, we understand that it's a matter of obedience but we also understand that it's a matter of faith that God has given us the marching orders and we are going in obedience but we're trusting him to do what only he can do. We go by faith. The just shall live by faith. We go by faith believing that God will use his Word. Believing that the truth that God has given us within the Word of God is effective on reaching the generation that God has given us the responsibility to minister to. Our God is eternal. He is all-knowing and we find that he's given us a book and he's given us a plan and we're to simply follow the plan that he's given us and by faith we trust him to do what only he can do. So often today we find and I would not suggest this morning that there's absolutely no use in any of these types of sessions or seminars for no doubt I've gained some some good ideas and insight but so often it seems as if we sit around and we try to scheme and device plans on how it is that we're going to reach the current generation that God has given us to minister to and all the while that we sit around and we come up with ideas and we seek to figure out how to do it we simply never actually do it and the importance is to follow what God has said we can spend days and weeks and hours upon hours upon hours trying to come up with ideas but God said that we're to go we're to preach the gospel we believe as Paul said in Romans chapter number one I'm not ashamed of the gospel of Christ why for it is the power of God unto salvation to everyone that believeth to the Jew first and also to the Greek we believe that the Bible tells us in Hebrews chapter 7 in verse number 25 that he is able to save them to the uttermost the gospel still works we don't need to change the methodology we don't need to change the message we find that as we take the message of God in the power of God first Corinthians tells us that he's chosen the foolishness of preaching why so that no flesh would glory in his sight and we find that we live in this time in this age in which we must have faith as we go forward in in obedience that we have faith that God is going to work and God is going to move that he is able to do what only he can do and he'll use us familiar passage of Scripture in 1st Corinthians 15 as we look at this passage in 1st Corinthians 15 we're reminded of the great truth of the resurrection of our Lord and Savior Jesus Christ how he conquered sin death in the grave it is the cornerstone of our faith and it's in this 15th chapter of the book of 1st Corinthians that you find that really the the greatest information given to us in one place of Scripture with regard to the resurrection and the hope that we have as the people of God that we too will be resurrected why because he is the firstfruits we find that that he is the firstfruits and we too will rise this mortal shall put on immortality this corruption shall put on incorruption and how we rejoice in that but because we serve a risen Savior we go in faith believing that he is able to do and able to work as only he can notice as the passage of Scripture concludes in verse number 58 in 1st Corinthians 15 and 58 the Bible says this therefore my beloved brethren be steadfast unmovable always abounding in the work of the Lord for as much as you know that your labor is not in vain in the Lord there are times in which we examine the circumstance of the situation we say is God working the truth of the matter is that if we continue to sow the seeds of the Word of God and we continue to give the gospel we continue to go forth and and and do what God has called us to do the answer is yes God is working we may not see how God is working we may not see it today but we can have great hope and we can have great confidence because why we go in faith sowing our seeds the seeds of the gospel the Word of God believing that God is able to work in the hearts and the minds of those that receive the truth of the Word of God I think of the farmer as the analogy is used so often in the Word of God the farmer that plants his seed he too plants his seed in faith believing that a crop a harvest will one day come I've never been a farmer I'm not the son of a farmer I probably wouldn't survive long if I were a farmer just being honest Pierre can relate we talked about it a few times over the years but the reality is this I don't find as I've had interaction and seen various things I don't find that a farmer goes out and sows his seed and then every day goes out wringing his hands wondering where the harvest is why isn't it here today well why isn't it coming up I don't see anything I need to dig it up and start over what if he does that he's never gonna have a harvest he's gonna continue to destroy what's taking place and and what's going on with the germination of the seed and the growth of that plant and all that takes place and if he day by day goes out and says nothing's happening I need to dig it up and start again he's never gonna have a harvest but he has faith that he planted that seed And then in a little while, he'll start to see the seed sprout. He'll see that life. A little while longer, you see the growth and you see the progress, and soon it will be time for harvest. And for us as the people of God, as we go forth and we sow seed and we go by faith believing that God is working, believing that He's able to do what only He can do, and we're going forward, why? Because of obedience. How? By faith. We live in a very results-oriented culture. We understand that. We live in this culture. And so often, we're results-oriented and if we're not careful, we can become very pragmatic. And we can miss this element of faith. But we understand that we go forward how? By faith. Believing that the work that we're doing, the work that we're engaged in, is a spiritual work. And the Holy Spirit of God is moving and working and using His Word. Why is it that Paul tells Timothy to continue in the things that thou hast learned and hast been assured of? He didn't tell him that in those last days you're going to change all of your methodology, you're going to change your message, you're going to change all these things. No, in fact, as you enter into the fourth chapter, he says, preach the Word. Be instant in season, out of season, reprove, rebuke, exhort with all long-suffering and doctrine, for the time will come when they will not endure sound doctrine. And we find that, yeah, no doubt, we're in that place, we're in that time. And the reality is that God has still ordained preaching. The preaching of His Word. The sowing of the seed. And how is it that we go forward? We go forward by faith. Philippians 1.6 says this, being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ. Being confident. I'm thankful for the work that God is doing in me and in you, and trusting that He will continue to do what only He can do in our lives. When we think about this truth of go forward, we say, why do we go forward? Well, it's a matter of obedience. How do we go forward? It's by faith. Let me ask this question, number three. What hinders us from going forward? What hinders us from going forward? No doubt, if we'd be honest this morning, there are hindrances in our lives, there are hindrances to going forward. The children of Israel, there's a great big red sea in front of them. And God says, go forward. There's a body of water. It's an obstacle. It's a hindrance. But God's going to deal with that. But sometimes what happens in our lives is we have these obstacles or these hindrances and we fail to go forward. Why? Because we're looking by sight and not by faith. And we say, well, there's no way to go forward. It's impossible to go forward. I can't go forward. But God says, go forward. How? By faith. What hinders me from going forward? I would say this, doubt. Doubt. Several years ago, it was in 2017 that our theme for the year was Increase Our Faith. And through the year of 2017, I preached a number of messages on those things that God would use from His Word to increase our faith. We looked at examples of individuals that had their faith increase through the events in their lives. And I said this often in that particular calendar year, and it's worth repeating this morning, that if faith is a flower, then doubt is a weed. And what do weeds do? They choke out the life of the flowers. We need to get rid of the weeds. If we want our flower beds to grow, and we want our flowers to grow and to have that beauty, we get rid of weeds. Why do we pick weeds? Why do we spend time? And all of the things that are out there the marketing industry has provided us with to deal with weeds, why? Because they choke out the life of the flower. And if faith is a flower, then doubt is a weed. We must get rid of doubt. Someone said this, never put a question mark where God has put a period. Never put a question mark where God has put a period. But the problem sometimes in our life is that we have doubts. How's this going to work? What's going to happen? I can't see the way. But again, doubt is the enemy of faith. And if we go forward in obedience and by faith, when we acknowledge that there's times in which we are hindered from going forward, that one of those hindrances to going forward is doubt. How's it going to work out? How's this going to work? Doubt. God asked Moses in Numbers chapter 14, how long will it be, are my people believe me? You know, God wants us to have faith. He wants us to live by faith. He doesn't want us to doubt Him. He wants us to trust Him. What hinders us from going forward? Not only doubt, but I'd say this, fear. Fear. Fear of the unknown. Fear of failing. If I go forward, I might fail. Jesus never fails. If we know that we're going forward at His command, at His direction, at His instruction, it's a matter of obedience, we need not to fear failure. We need not to fear the uncertainties. We find that throughout the Word of God, we find over and over and over this phrase, fear not. Fear not. He's not given us a spirit of fear. He's not given us a spirit of fear, but yet we find that one thing that would hinder us from going forward is fear. I could say this, what hinders us from going forward at times is influence. Influence. Who's influencing us? Who are we going to listen to? In the passage of Scripture that we have here before us this morning in Exodus 14, we've already noted that the people spoke, Moses spoke, and the Lord spoke. There are times in which we will listen to the influence of others. We'll listen to what other people say. It doesn't work anymore. You can't do that. You can't do this. But if we're going forward at the command of the Lord, then we need not be influenced by anybody else. Think about the nation of Israel. They had been given the instruction. Of course, we understand that as we fast forward from this particular event and this time in Israel's history that they had the responsibility of going into the land. It was there in Numbers 14 that I mentioned just a moment ago when God said to Moses, how long will it be ere my people believe them? It's within the context of the spies being sent out. In chapters 13 and 14 of the book of Numbers, God has Moses take 12 spies and send them into the land to see what's there. What the land is. To bring back a report. And we know the account and we're familiar. We sing songs with children about 12 men went to spy on Canaan, 10 were bad and 2 were good. And those 10 came back with an evil report. It was a report that was full of doubt and fear and uncertainty. We be not able. The people are too great for us. We have fortified walls. But Joshua and Caleb, they had a faith. Yeah, they didn't deny the existence of the walled cities. They didn't deny the existence of the giants. They didn't deny the existence of the difficulties and the obstacles, but what they understood is that God told us to go into the land. And we're going by faith. We're going in obedience. And we're trusting that God will do what only God can do. If God is with us, we are able. But the influence of those 10 spies was great, was it not? What did the entire congregation want to do? Well, first of all, they were going to stone Joshua and Caleb. But they were going to make themselves captains and go back to Egypt. It wasn't the only time, by the way, that they murmured and complained and thought about going back to Egypt. The influence. God says go forward. What hinders us from going forward? Doubt and fear and influence, uncertainty, obstacles. But let me ask this final question as we conclude our message. What happens when we go forward? Why do we go forward? We go forward because of obedience. It's a matter of obedience. We go forward because God said go forward. How do we go forward? We go forward by faith. Believing that God will do what only God can do. Moses could not part that Red Sea. The children of Israel could not part that Red Sea. There was nothing within their power to provide them safe passage across that Red Sea, but God could. How? By faith. What hinders? No doubt there are many things that could hinder the children of Israel from going forward. In their history, as we've made note just a moment ago, there are many times in which they were hindered from going forward because of a variety of things. But what happens when we go forward? Well, go back to Exodus 14. We find the instruction from God in verses 15 and 16 that they're to go forward. I want you to skip down, if you will, in verse number 21. It says this, And Moses stretched out his hand over the sea. And that was at the direction of God. In verse 16, he says, Lift thou up thy rod and stretch out thine hand over the sea. And it says in verse 21 that Moses stretched out his hand over the sea. Notice what the Bible says, And the Lord caused the sea to go back by a strong east wind all that night and made the sea dry land and the waters were divided. All that night, God caused that strong east wind to come and he made the sea dry land and the waters were divided. Man, don't you wish you could have seen this? I mean, what miracle, what power of God that's displayed. And we find that Moses acted in obedience. He took what God told him to do and he obeyed God. He had seen God work in his life. The plagues have already taken place and Moses had seen God work. He had experienced the power of God and he holds out that rod at the command of God. And the Bible says that God moved and God worked. And the Bible tells us in verse number 22, notice what it says, And the children of Israel went into the midst of the sea upon the dry ground. You know what they did? They went forward. They went forward. God said in verse number 15, Go forward. In verse number 22, the Bible says, And the children of Israel went into the midst of the sea upon the dry ground. Notice the Bible says, And the waters were a wall unto them on their right hand and on their left. This isn't just a group of like 12 or 70 people. It's a large host of people that are crossing over, perhaps as many as a couple million, and they're crossing over the Red Sea on dry ground. And the Bible says that there was a wall, the waters were a wall unto them on their right hand and on their left. Can you imagine crossing over on dry ground? Man, this is miraculous. This is exciting. What happens when we go forward? We get to see what God can do when we go forward. They just sit there and say, Well, Moses, I understand God said to go forward, but really, if you look at the situation, there's nowhere to go forward. We're just going to hunker down here and we're going to hope for the best. We're going to hope that... God said, Go forward. And in verse number 22, the Bible tells us that they went into, they go forward, they went into the midst of the sea upon the dry ground. Man, how exciting to see what God can do. The Egyptians were not told to go forward, but they did. They looked at the situation and they said, Well, look, man, if they all crossed over on dry ground and they got to the other side, let us pursue after them. Verse 23 tells us the Egyptians pursued and went in after them to the midst of the sea. Even all Pharaoh's horses, his chariots and his horsemen, they didn't have the same command that God had given the children of Israel. And it didn't work out as good for them as it did for the children of Israel. Because when they got in the midst of the Red Sea, God caused their chariot wheels to fall off. They draved them heavily. And then God told Moses to raise up his rod and he, God, caused the sea to return. And the Egyptians were destroyed. The people of God at the command of God by inobedience and by faith, not being hindered by all of those things that could hinder them, what happens is they get to see God work. They get to see God move and work. It tells us in verse number 29, But the children of Israel walked upon dry land in the midst of the sea, and the waters were a wall unto them on their right hand and on their left. Thus the Lord saved Israel that day out of the hand of the Egyptians. Man, they walked on dry land. You think they talked about this? Of course they talked about this. The Scriptures speak much. I mentioned already by way of introduction that this event, the crossing of the Red Sea, is often spoke of within the Word of God. The Psalms very regularly reference the crossing of the Red Sea. In chapter number 15, here in Exodus, you see the song of Moses and the deliverance and how they're rejoicing and how they're just amazed at what God has done. It's miraculous. What happens when we go forward? We get to see God work. We get to see God work. The psalmist said in Psalm 119, It is time, O Lord, for thee to work. You see God work. And when is it that we see God work? When we go forward in obedience by faith. I would say this, what happens when we go forward, not only do we get to see God work, but I would say that we have our faith increased. Our faith is increased as we go forward. Yes, because we see God work, but let me say this, and we're actually going to look at an example of this this evening. I hope that you tune in again tonight as we look at an example of this very truth in Exodus chapter number 17. But I want to say this, what happens when we go forward, there's this idea, and it's really a false idea, that if we go forward in obedience and by faith that everything's just going to be perfect. It doesn't work that way. You know why? Oftentimes, our faith is increased through obstacles and difficulties. It's the obstacles and the difficulties when we go forward that actually result in our faith being increased. In chapter 15, at the end of the chapter, as they are crossed over and they've seen the victory, they've seen the hand of God work, they say, Who is like unto thee, O Lord, among the gods? Who is like thee, glorious in holiness, fearful in praises, doing wonders? I mean, they're rejoicing, and then you come to the end and there's not water that's drinkable. It's bitter water. It's an obstacle. We came here at your command. Unfortunately, they responded off in how we respond to obstacles, in disbelief and in doubt and in uncertainty and regret. Why are we here? We're going to die. But that obstacle in chapter number 15, at the end, the first trial after their deliverance, we find that those waters were bitter, and God healed those waters. God healed those waters, and they were sustained. It's interesting to me that you read in chapter number 16, the entirety of the chapter deals with the manna. How did the chapter begin? Well, it begins with murmuring and complaining because there's no food, because they're hungry. The obstacle turned to a great faith builder, where God says through Moses, the instruction is given with regard to going out and gathering the manna, and I would submit to you that day by day as they would go out and they would get that manna, that that was a faith builder. I preached a message from this passage a couple of years ago on a Wednesday evening from Exodus 16, and I titled it this way, Would You Have Passed the Test? Would You Have Passed the Test? Because just as some of them gathered more than they were supposed to, I would submit to you that in 2021, some of us would gather more than we were supposed to as well, because we wouldn't have faith that it'd be there tomorrow. And what happened? It bred worms and it stank. And so then, when they're supposed to gather twice as much on the sixth day, they decided that they'd only take enough for that day because it bred worms and stank, and so therefore I need to get it fresh tomorrow, and they did not find it tomorrow, because God said gather twice as much on that sixth day. And what happened? It stayed, and it was good for them. They could eat it. It was a faith builder. It was an obstacle. See, what happens when we go forward, there's this idea that exists amongst humans that if we go forward in obedience and by faith, that that just means everything's gonna be blissful and perfect and we're never gonna have a problem and everything's just gonna be wonderful. And when an obstacle comes, when a difficulty arises, we all of a sudden begin to second guess why we're where we are. But we find that throughout the Scriptures and even here in this passage that we're dealing with this morning in Exodus 14 when he says go forward, that their faith would be increased and it would be increased often through obstacles and difficulties. Through obstacles and difficulties. I'm thankful this morning that as we go forward we get to see God work. I'm thankful this morning that as we go forward that he increases our faith. And often he increases our faith through difficulties and obstacles. And so as we look at this passage of Scripture in Exodus 14 and we make some parallels to the New Testament believer, I would say to you this morning, let's determine to live by faith and go forward. We can't stay here. We can't go back. We must go forward. We must go forward. And why do we go forward? Because we've been commanded to. We go forward in obedience. Go and preach the gospel to every creature. The marching orders of the church. It's our responsibility. How? How do we go forward? Not by sight. We go forward by faith. Believing that God will work. Believing that God will do what only God can do. That yes, he'll use us as co-laborers with God. And what a blessing it is to be a co-laborer with God. Let us be aware that there are some things that will hinder us from going forward. No doubt. There are hindrances to going forward. There are obstacles. There are voices, influences. There's doubt. There's fear. There's all sorts of things that would hinder us from going forward. But let us focus upon what happens when we go forward is that we get to see God work. They obeyed God and they walked on dry ground. And they got to the other side. What a blessing. God said, speak unto the children of Israel that they go forward. This morning, we need to go forward. Let's pray together. Father, we love you. We thank you for loving us. We thank you for the opportunity to study your word. And we thank you for the passage of scripture that is before us. Again, a familiar passage of scripture in Exodus 14 in dealing with this event that is so well known to us, the crossing, the miraculous crossing of the Red Sea. We thank you for how you worked and moved and how you gave direction and how you provided a way. We thank you for your deliverance that is seen for the children of Israel here in this passage of scripture. As we make application for our lives today, as we close 2021, this last Sunday of the year, God, I pray that you'd help us to go forward. Help us to understand that it's a matter of obedience. Help us to understand that we must go forward in faith. Help us not to be hindered. God, we wanna see you work. We long to see you work. We know that you're able to do exceeding abundantly above all that we ask or think. We thank you for the ways in which we have seen you work in our midst, even in this past year, in our lives personally, in our church corporately, how we praise thee and how we thank thee for what you've done. But God, we must go forward at your command, at your instruction. And I pray that you'd help us. Onward, forward. Would you help us, Lord? Move and work as only you can. For it's in Christ's name we pray. We'll have a time of invitation.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.760000228881836,
      "text": " Turn the book of Exodus if you will Exodus chapter number 14 Exodus chapter number 14. It's a familiar passage of Scripture"
    },
    {
      "id": 1,
      "start": 6.760000228881836,
      "end": 12.039999961853027,
      "text": " I trust to be a blessing to you today as I mentioned just a little while ago by during the"
    },
    {
      "id": 2,
      "start": 12.4399995803833,
      "end": 16.399999618530273,
      "text": " announcements we finished up the book of Colossians and I thoroughly"
    },
    {
      "id": 3,
      "start": 16.719999313354492,
      "end": 21.65999984741211,
      "text": " enjoyed the opportunity of preaching and teaching through the book of Colossians on Sunday mornings here in"
    },
    {
      "id": 4,
      "start": 22.079999923706055,
      "end": 28.559999465942383,
      "text": " 2021 and we finished two weeks ago and I believe the Lord taught us much through our study the book of Colossians and"
    },
    {
      "id": 5,
      "start": 28.8799991607666,
      "end": 32.459999084472656,
      "text": " Next week. We'll begin a brand new study for a new theme for"
    },
    {
      "id": 6,
      "start": 33.15999984741211,
      "end": 36.720001220703125,
      "text": " 2022 and looking forward to the opportunity last week"
    },
    {
      "id": 7,
      "start": 36.720001220703125,
      "end": 42.439998626708984,
      "text": " Of course, we looked at that passage in John chapter number four when the Lord Jesus Christ went through Samaria"
    },
    {
      "id": 8,
      "start": 42.439998626708984,
      "end": 46.63999938964844,
      "text": " He met that woman at the well and he said to her if thou knewest the gift of God"
    },
    {
      "id": 9,
      "start": 46.63999938964844,
      "end": 52.279998779296875,
      "text": " And I know that we had the opportunity to study that passage. I trust that the Lord has"
    },
    {
      "id": 10,
      "start": 52.84000015258789,
      "end": 54.20000076293945,
      "text": " Encouraged you by"
    },
    {
      "id": 11,
      "start": 54.20000076293945,
      "end": 59.20000076293945,
      "text": " Understanding and being a recipient of the greatest gift that's ever been given the gift of God"
    },
    {
      "id": 12,
      "start": 59.20000076293945,
      "end": 65.76000213623047,
      "text": " Which is eternal life this morning as we look at this passage in Exodus chapter number 14 and really think about the closing of one"
    },
    {
      "id": 13,
      "start": 65.76000213623047,
      "end": 70.44000244140625,
      "text": " Year and entering into another year. I trust that we'd be encouraged that we'd be strengthened"
    },
    {
      "id": 14,
      "start": 70.44000244140625,
      "end": 75.55999755859375,
      "text": " We'd be challenged as we look forward to what God has for us. I'm thankful"
    },
    {
      "id": 15,
      "start": 76.23999786376953,
      "end": 78.5199966430664,
      "text": " then in the midst of all of the chaos and"
    },
    {
      "id": 16,
      "start": 79.04000091552734,
      "end": 83.31999969482422,
      "text": " Confusion that our God remains seated upon his throne and he has a plan and"
    },
    {
      "id": 17,
      "start": 83.5999984741211,
      "end": 88.4800033569336,
      "text": " I believe that as we look throughout the whole of Scripture that God's instruction to us"
    },
    {
      "id": 18,
      "start": 88.87999725341797,
      "end": 94.16000366210938,
      "text": " As the people of God is that we are to continue and we'll use a phrase throughout the service"
    },
    {
      "id": 19,
      "start": 94.36000061035156,
      "end": 99.55999755859375,
      "text": " this morning that we find here in Exodus chapter number 14 that we are to go forward and"
    },
    {
      "id": 20,
      "start": 100.16000366210938,
      "end": 106.83999633789062,
      "text": " There's no room for retreat. There's no room for compromise. We can't stay where we are. We can't go back"
    },
    {
      "id": 21,
      "start": 106.83999633789062,
      "end": 113.23999786376953,
      "text": " We must go forward as we look at Exodus chapter number 14 again. It's a very familiar passage of Scripture"
    },
    {
      "id": 22,
      "start": 113.23999786376953,
      "end": 118.16000366210938,
      "text": " In fact, it's here that God tells us about that great miracle of the crossing of the Red Sea"
    },
    {
      "id": 23,
      "start": 118.5199966430664,
      "end": 125.80000305175781,
      "text": " It's interesting to me that as you read the Scriptures you read the entirety of the Bible that this miracle above any other miracle is mentioned"
    },
    {
      "id": 24,
      "start": 126.19999694824219,
      "end": 128.36000061035156,
      "text": " Over and over throughout the Word of God"
    },
    {
      "id": 25,
      "start": 128.36000061035156,
      "end": 130.36000061035156,
      "text": " In fact, you read in the book of Psalms many"
    },
    {
      "id": 26,
      "start": 130.63999938964844,
      "end": 138.1999969482422,
      "text": " References to this period of time when God delivered his people from Egyptian bondage and they crossed over the Red Sea on dry ground"
    },
    {
      "id": 27,
      "start": 138.24000549316406,
      "end": 143.24000549316406,
      "text": " What a great miracle as we think about the many times in which this particular"
    },
    {
      "id": 28,
      "start": 143.67999267578125,
      "end": 147.63999938964844,
      "text": " Passage in this event is recorded and repeated in the Word of God"
    },
    {
      "id": 29,
      "start": 147.63999938964844,
      "end": 149.63999938964844,
      "text": " We find really that it serves two purposes"
    },
    {
      "id": 30,
      "start": 149.75999450683594,
      "end": 157.05999755859375,
      "text": " number one to remind us of God's power to remind us of what our God is able to do to remind us of what he"
    },
    {
      "id": 31,
      "start": 157.05999755859375,
      "end": 163.10000610351562,
      "text": " has done and encourage us with what he's able to do we find also that it certainly serves as a"
    },
    {
      "id": 32,
      "start": 163.66000366210938,
      "end": 165.66000366210938,
      "text": " As a faith builder"
    },
    {
      "id": 33,
      "start": 165.66000366210938,
      "end": 172.3800048828125,
      "text": " we often speak about the importance of our faith being increased and you look throughout the Word of God and you find that the"
    },
    {
      "id": 34,
      "start": 172.5,
      "end": 177.94000244140625,
      "text": " Disciples prayed they asked the Lord to increase their faith. We understand that there are"
    },
    {
      "id": 35,
      "start": 179.17999267578125,
      "end": 185.94000244140625,
      "text": " Representations throughout the Word of God of those that have had their faith increased and we know that faith cometh by hearing and hearing"
    },
    {
      "id": 36,
      "start": 186.74000549316406,
      "end": 193.6999969482422,
      "text": " From this precious book the Bible the Word of God and I'm so thankful that God has given it to us beginning in verse number"
    },
    {
      "id": 37,
      "start": 193.6999969482422,
      "end": 198.25999450683594,
      "text": " 1 of Exodus 14 the Bible says this and the Lord spake unto Moses saying"
    },
    {
      "id": 38,
      "start": 199.3000030517578,
      "end": 203.86000061035156,
      "text": " Speak unto the children of Israel that they turn and encamp before pie"
    },
    {
      "id": 39,
      "start": 203.86000061035156,
      "end": 210.02000427246094,
      "text": " Hi Roth between Migdol and the scene over against Baal Zephon before it shall ye"
    },
    {
      "id": 40,
      "start": 210.02000427246094,
      "end": 214.89999389648438,
      "text": " Encamp by the sea and so we find here in verse number two that God gave specific"
    },
    {
      "id": 41,
      "start": 215.02000427246094,
      "end": 219.05999755859375,
      "text": " Instruction with regard to the place in which the children of Israel were to go"
    },
    {
      "id": 42,
      "start": 219.05999755859375,
      "end": 222.89999389648438,
      "text": " The Bible says in verse number three for Pharaoh will say of the children of Israel"
    },
    {
      "id": 43,
      "start": 222.89999389648438,
      "end": 224.89999389648438,
      "text": " They are entangled in the land"
    },
    {
      "id": 44,
      "start": 224.94000244140625,
      "end": 230.13999938964844,
      "text": " The wilderness hath shut them in and I will harden Pharaoh's heart that he shall follow"
    },
    {
      "id": 45,
      "start": 230.6199951171875,
      "end": 235.66000366210938,
      "text": " after them and I will be honored upon Pharaoh and upon all his host that the"
    },
    {
      "id": 46,
      "start": 235.97999572753906,
      "end": 240.17999267578125,
      "text": " Egyptians may know that I am the Lord and they did so"
    },
    {
      "id": 47,
      "start": 240.82000732421875,
      "end": 246.6999969482422,
      "text": " and it was told the king of Egypt that the people fled and the heart of Pharaoh and of his servants was turned against the"
    },
    {
      "id": 48,
      "start": 246.6999969482422,
      "end": 251.8000030517578,
      "text": " People and they said why have we done this that we have let Israel go from serving us?"
    },
    {
      "id": 49,
      "start": 251.97999572753906,
      "end": 255.94000244140625,
      "text": " And he made ready his chariots and took his people with him and he took 600"
    },
    {
      "id": 50,
      "start": 256.29998779296875,
      "end": 263.1400146484375,
      "text": " chosen chariots and all the chariots of Egypt and captains over every one of them and the Lord hardened the heart of Pharaoh king of"
    },
    {
      "id": 51,
      "start": 263.1400146484375,
      "end": 268.17999267578125,
      "text": " Egypt and he pursued after the children of Israel and the children of Israel went out with a high hand"
    },
    {
      "id": 52,
      "start": 268.5400085449219,
      "end": 269.70001220703125,
      "text": " notice in verse number nine"
    },
    {
      "id": 53,
      "start": 269.70001220703125,
      "end": 276.4200134277344,
      "text": " the Bible says the Egyptians pursued after them all the horses and chariots of Pharaoh and his horsemen in his army and"
    },
    {
      "id": 54,
      "start": 276.94000244140625,
      "end": 283.0199890136719,
      "text": " Overtook them in camping by the sea beside Piah a high wrath before Baal Zephon"
    },
    {
      "id": 55,
      "start": 283.0199890136719,
      "end": 285.70001220703125,
      "text": " That's exactly where they were to be according to verse number two"
    },
    {
      "id": 56,
      "start": 285.94000244140625,
      "end": 292.5,
      "text": " the Bible says that when Pharaoh drew nigh the children of Israel lifted up their eyes and behold the"
    },
    {
      "id": 57,
      "start": 292.8599853515625,
      "end": 299.5400085449219,
      "text": " Egyptians marched after them and they were sore afraid and the children of Israel cried out unto the Lord"
    },
    {
      "id": 58,
      "start": 300.94000244140625,
      "end": 304.1400146484375,
      "text": " Verse number 11 records for us what they say to Moses"
    },
    {
      "id": 59,
      "start": 304.1400146484375,
      "end": 310.1400146484375,
      "text": " It says this and they said unto Moses because there were no graves in Egypt that has now taken us away"
    },
    {
      "id": 60,
      "start": 310.5,
      "end": 312.5,
      "text": " To die in the wilderness"
    },
    {
      "id": 61,
      "start": 313.17999267578125,
      "end": 318.4599914550781,
      "text": " Wherefore hast thou dealt thus with us to carry us forth out of Egypt"
    },
    {
      "id": 62,
      "start": 318.4599914550781,
      "end": 325.3399963378906,
      "text": " Is not this the word that we did tell thee in Egypt saying let us alone that we may serve the Egyptians"
    },
    {
      "id": 63,
      "start": 325.5799865722656,
      "end": 329.3399963378906,
      "text": " For it had been better for us to serve the Egyptians than that"
    },
    {
      "id": 64,
      "start": 329.3399963378906,
      "end": 336.5400085449219,
      "text": " We should die in the wilderness and we find first of all here the people speak in verses 11 and 12"
    },
    {
      "id": 65,
      "start": 336.5400085449219,
      "end": 343.260009765625,
      "text": " We read of the people speaking and really they're speaking against Moses and they are certain that death is imminent"
    },
    {
      "id": 66,
      "start": 343.260009765625,
      "end": 347.5799865722656,
      "text": " They of course are in this particular location where God has led them"
    },
    {
      "id": 67,
      "start": 347.5799865722656,
      "end": 352.3800048828125,
      "text": " We understand that before them is the Red Sea, but they see according to verse number 10"
    },
    {
      "id": 68,
      "start": 352.5400085449219,
      "end": 360.1400146484375,
      "text": " They lifted up their eyes and they beheld the Egyptians marched after them and the Bible says that they were sore afraid"
    },
    {
      "id": 69,
      "start": 360.3800048828125,
      "end": 367.3399963378906,
      "text": " Their circumstances led them to a place of fear and they speak and they say that it would be better for them"
    },
    {
      "id": 70,
      "start": 367.3399963378906,
      "end": 369.3399963378906,
      "text": " Had they stayed in Egypt?"
    },
    {
      "id": 71,
      "start": 369.4200134277344,
      "end": 375.8999938964844,
      "text": " We find that Moses speaks in verse number 13 and 14 and the Bible says and Moses said unto the people"
    },
    {
      "id": 72,
      "start": 377.1000061035156,
      "end": 378.70001220703125,
      "text": " Fear ye not"
    },
    {
      "id": 73,
      "start": 378.70001220703125,
      "end": 384.3800048828125,
      "text": " Stand still and see the salvation of the lord which he will show to you today"
    },
    {
      "id": 74,
      "start": 384.94000244140625,
      "end": 389.739990234375,
      "text": " For the egyptians whom ye have seen today ye shall see them again no more forever"
    },
    {
      "id": 75,
      "start": 390.1400146484375,
      "end": 395.5799865722656,
      "text": " Notice this the lord shall fight for you and ye shall hold your peace"
    },
    {
      "id": 76,
      "start": 395.5799865722656,
      "end": 403.5799865722656,
      "text": " And so moses the human leader the man that god had chosen to lead the children of israel out of egyptian bondage"
    },
    {
      "id": 77,
      "start": 403.9800109863281,
      "end": 407.5799865722656,
      "text": " God is now using his man to encourage the people"
    },
    {
      "id": 78,
      "start": 407.8999938964844,
      "end": 412.1400146484375,
      "text": " He tells them to fear not to stand still to see the salvation of the lord"
    },
    {
      "id": 79,
      "start": 412.4599914550781,
      "end": 416.4599914550781,
      "text": " He tells them the lord shall fight for you and ye shall hold your peace"
    },
    {
      "id": 80,
      "start": 417.0199890136719,
      "end": 420.6400146484375,
      "text": " But I want to draw your attention to what god says in verse number 15"
    },
    {
      "id": 81,
      "start": 421.6000061035156,
      "end": 426.9599914550781,
      "text": " We find that the people spoke we find that moses spoke and now the lord speaks"
    },
    {
      "id": 82,
      "start": 427.6000061035156,
      "end": 431.8399963378906,
      "text": " And notice the bible tells us in verse number 15 and the lord said unto moses"
    },
    {
      "id": 83,
      "start": 432.4599914550781,
      "end": 434.4599914550781,
      "text": " Wherefore cryest thou unto me?"
    },
    {
      "id": 84,
      "start": 435.20001220703125,
      "end": 439.67999267578125,
      "text": " Notice what he says speak unto the children of israel that they"
    },
    {
      "id": 85,
      "start": 440.32000732421875,
      "end": 441.3399963378906,
      "text": " go"
    },
    {
      "id": 86,
      "start": 441.3399963378906,
      "end": 443.0400085449219,
      "text": " forward"
    },
    {
      "id": 87,
      "start": 443.0400085449219,
      "end": 446.6400146484375,
      "text": " But lift thou up thy rod and stretch out thine hand over the sea"
    },
    {
      "id": 88,
      "start": 447.20001220703125,
      "end": 451.8399963378906,
      "text": " And divide it the children of israel shall go on dry ground through"
    },
    {
      "id": 89,
      "start": 452.4800109863281,
      "end": 453.760009765625,
      "text": " the midst"
    },
    {
      "id": 90,
      "start": 453.760009765625,
      "end": 455.760009765625,
      "text": " of the sea"
    },
    {
      "id": 91,
      "start": 455.8399963378906,
      "end": 457.44000244140625,
      "text": " He said this"
    },
    {
      "id": 92,
      "start": 457.44000244140625,
      "end": 458.6199951171875,
      "text": " go"
    },
    {
      "id": 93,
      "start": 458.6199951171875,
      "end": 459.9200134277344,
      "text": " forward"
    },
    {
      "id": 94,
      "start": 459.9200134277344,
      "end": 465.3599853515625,
      "text": " Go forward. We think about this truth and we understand for the children of israel"
    },
    {
      "id": 95,
      "start": 465.8999938964844,
      "end": 471.0400085449219,
      "text": " Contextually speaking in exodus 14 that they were to go forward. They were to cross this red sea"
    },
    {
      "id": 96,
      "start": 471.3599853515625,
      "end": 476.7200012207031,
      "text": " We find that for us as the people of god today, I mentioned already there's no room for retreat"
    },
    {
      "id": 97,
      "start": 476.79998779296875,
      "end": 478.4800109863281,
      "text": " There's no room for compromise"
    },
    {
      "id": 98,
      "start": 478.4800109863281,
      "end": 482.1600036621094,
      "text": " We must go forward in fact in hebrews chapter number 10"
    },
    {
      "id": 99,
      "start": 482.55999755859375,
      "end": 488.79998779296875,
      "text": " the word of god teaches us this truth with regard to going forward to making progress to"
    },
    {
      "id": 100,
      "start": 489.4200134277344,
      "end": 494.7200012207031,
      "text": " Continuing to understand the direction in which we're to go in hebrews chapter number 10"
    },
    {
      "id": 101,
      "start": 495.0400085449219,
      "end": 499.67999267578125,
      "text": " As that chapter ends and before we get to the great hall of faith chapter"
    },
    {
      "id": 102,
      "start": 500.0,
      "end": 503.1400146484375,
      "text": " I want you to see what is said in verses 37 through 39"
    },
    {
      "id": 103,
      "start": 504.0799865722656,
      "end": 506.0,
      "text": " of hebrews chapter number 10"
    },
    {
      "id": 104,
      "start": 506.0,
      "end": 512.6400146484375,
      "text": " The bible says this for yet a little while and he that shall come will come and will not tarry"
    },
    {
      "id": 105,
      "start": 512.7999877929688,
      "end": 520.0,
      "text": " He's speaking about the return of our great god and savior the lord. Jesus christ the blessed hope and we have great confidence that"
    },
    {
      "id": 106,
      "start": 520.0800170898438,
      "end": 525.52001953125,
      "text": " One day one glorious day. We will hear the trumpet of the lord and we will be here"
    },
    {
      "id": 107,
      "start": 525.5999755859375,
      "end": 531.280029296875,
      "text": " No longer we'll be caught up to meet the lord in the air and I look forward to that day"
    },
    {
      "id": 108,
      "start": 531.3599853515625,
      "end": 535.9400024414062,
      "text": " Of course, we do not know the hour the day nor the hour of that particular"
    },
    {
      "id": 109,
      "start": 536.9600219726562,
      "end": 541.3599853515625,
      "text": " Event that will take place but we have great confidence that we know that he will come"
    },
    {
      "id": 110,
      "start": 541.6799926757812,
      "end": 546.719970703125,
      "text": " Now notice what the bible says in verse number 38 now the just shall live"
    },
    {
      "id": 111,
      "start": 547.5999755859375,
      "end": 549.2000122070312,
      "text": " by faith"
    },
    {
      "id": 112,
      "start": 549.2000122070312,
      "end": 551.9199829101562,
      "text": " We don't live by sight. We live by faith"
    },
    {
      "id": 113,
      "start": 552.5599975585938,
      "end": 555.2000122070312,
      "text": " But if any man what does it say draw back"
    },
    {
      "id": 114,
      "start": 556.1599731445312,
      "end": 561.8599853515625,
      "text": " If any man draw back my soul shall have no pleasure in him notice in verse number 39"
    },
    {
      "id": 115,
      "start": 562.239990234375,
      "end": 566.9000244140625,
      "text": " But we are not of them who draw back unto perdition"
    },
    {
      "id": 116,
      "start": 567.6799926757812,
      "end": 572.5599975585938,
      "text": " but to them that believe to the saving of the soul and then we enter into"
    },
    {
      "id": 117,
      "start": 573.0399780273438,
      "end": 579.4400024414062,
      "text": " The 11th chapter of the book of hebrews the great hall of faith chapter where the bible tells us of all those great"
    },
    {
      "id": 118,
      "start": 579.6599731445312,
      "end": 584.7999877929688,
      "text": " Victories that were wrought through faith and we understand and we often reference verse number six"
    },
    {
      "id": 119,
      "start": 585.1199951171875,
      "end": 588.719970703125,
      "text": " But without faith it is impossible to please him"
    },
    {
      "id": 120,
      "start": 589.1199951171875,
      "end": 595.4600219726562,
      "text": " For he that cometh to god must believe that he is and that he is a rewarder to them that diligently"
    },
    {
      "id": 121,
      "start": 596.3200073242188,
      "end": 597.9199829101562,
      "text": " Seek him"
    },
    {
      "id": 122,
      "start": 597.9199829101562,
      "end": 599.9199829101562,
      "text": " Oh that we as the people of god"
    },
    {
      "id": 0,
      "start": 599.9199829101562,
      "end": 602.7199828624725,
      "text": " would go forward for a few minutes this morning"
    },
    {
      "id": 1,
      "start": 602.7199828624725,
      "end": 605.0599827766418,
      "text": " from the 14th chapter of the book of Exodus."
    },
    {
      "id": 2,
      "start": 605.0599827766418,
      "end": 606.3799829483032,
      "text": " I want to preach a message"
    },
    {
      "id": 3,
      "start": 606.3799829483032,
      "end": 609.3399829864502,
      "text": " that I've simply entitled from that 15th verse,"
    },
    {
      "id": 4,
      "start": 609.3399829864502,
      "end": 611.4199829101562,
      "text": " Go Forward."
    },
    {
      "id": 5,
      "start": 611.4199829101562,
      "end": 612.7199831008911,
      "text": " Go forward."
    },
    {
      "id": 6,
      "start": 612.7199831008911,
      "end": 614.519983291626,
      "text": " Four questions that we'll use"
    },
    {
      "id": 7,
      "start": 614.519983291626,
      "end": 616.5599822998047,
      "text": " by way of points this morning."
    },
    {
      "id": 8,
      "start": 616.5599822998047,
      "end": 618.2199821472168,
      "text": " The first question is this,"
    },
    {
      "id": 9,
      "start": 618.2199821472168,
      "end": 621.6799831390381,
      "text": " why do we go forward?"
    },
    {
      "id": 10,
      "start": 621.6799831390381,
      "end": 623.7599830627441,
      "text": " Why is it that we should go forward?"
    },
    {
      "id": 11,
      "start": 623.7599830627441,
      "end": 625.7999820709229,
      "text": " Why is it that the children of Israel,"
    },
    {
      "id": 12,
      "start": 625.7999820709229,
      "end": 627.5599822998047,
      "text": " given the circumstances,"
    },
    {
      "id": 13,
      "start": 627.5599822998047,
      "end": 629.1799831390381,
      "text": " the situation in which they face,"
    },
    {
      "id": 14,
      "start": 629.2599830627441,
      "end": 631.1399822235107,
      "text": " why do we go forward?"
    },
    {
      "id": 15,
      "start": 631.1399822235107,
      "end": 632.5599822998047,
      "text": " Why do they go forward?"
    },
    {
      "id": 16,
      "start": 632.5599822998047,
      "end": 635.2199821472168,
      "text": " Why today in 2021,"
    },
    {
      "id": 17,
      "start": 635.2199821472168,
      "end": 637.5599822998047,
      "text": " why is it that I would preach this message?"
    },
    {
      "id": 18,
      "start": 637.5599822998047,
      "end": 640.0199813842773,
      "text": " Why is it that we should have this thought"
    },
    {
      "id": 19,
      "start": 640.0199813842773,
      "end": 642.599983215332,
      "text": " that we are to go forward?"
    },
    {
      "id": 20,
      "start": 642.599983215332,
      "end": 645.2199821472168,
      "text": " In one word, the answer is this,"
    },
    {
      "id": 21,
      "start": 645.2199821472168,
      "end": 646.9199829101562,
      "text": " obedience."
    },
    {
      "id": 22,
      "start": 646.9199829101562,
      "end": 648.7199821472168,
      "text": " Obedience."
    },
    {
      "id": 23,
      "start": 648.7199821472168,
      "end": 649.8799819946289,
      "text": " Why do we go forward?"
    },
    {
      "id": 24,
      "start": 649.8799819946289,
      "end": 653.5599822998047,
      "text": " We go forward because we obey the Lord Jesus Christ."
    },
    {
      "id": 25,
      "start": 653.5599822998047,
      "end": 656.3799819946289,
      "text": " We go forward, the children of Israel are to go forward."
    },
    {
      "id": 26,
      "start": 656.3799819946289,
      "end": 657.2199821472168,
      "text": " Why?"
    },
    {
      "id": 27,
      "start": 657.2199821472168,
      "end": 658.7999839782715,
      "text": " Because God spoke."
    },
    {
      "id": 28,
      "start": 658.8799819946289,
      "end": 660.7999839782715,
      "text": " We find that the people said,"
    },
    {
      "id": 29,
      "start": 660.7999839782715,
      "end": 662.1199836730957,
      "text": " in verses 11 and 12,"
    },
    {
      "id": 30,
      "start": 662.1199836730957,
      "end": 664.1599807739258,
      "text": " we've mentioned it by way of introduction,"
    },
    {
      "id": 31,
      "start": 664.1599807739258,
      "end": 667.4999847412109,
      "text": " to understand the fear and the trembling"
    },
    {
      "id": 32,
      "start": 667.4999847412109,
      "end": 669.1599807739258,
      "text": " of the people of God,"
    },
    {
      "id": 33,
      "start": 669.1599807739258,
      "end": 670.4599838256836,
      "text": " the children of Israel."
    },
    {
      "id": 34,
      "start": 670.4599838256836,
      "end": 673.2399826049805,
      "text": " They said it had been better had they stayed in Egypt"
    },
    {
      "id": 35,
      "start": 673.2399826049805,
      "end": 675.1199798583984,
      "text": " than that they should die in the wilderness."
    },
    {
      "id": 36,
      "start": 675.1199798583984,
      "end": 676.6399841308594,
      "text": " And Moses speaks,"
    },
    {
      "id": 37,
      "start": 676.6399841308594,
      "end": 678.8399810791016,
      "text": " and I'm thankful for the leadership of Moses"
    },
    {
      "id": 38,
      "start": 678.8399810791016,
      "end": 681.9199829101562,
      "text": " and the faith of Moses when he says stand still."
    },
    {
      "id": 39,
      "start": 681.9199829101562,
      "end": 683.5199813842773,
      "text": " Fear ye not, stand still,"
    },
    {
      "id": 40,
      "start": 683.5199813842773,
      "end": 686.5399856567383,
      "text": " and see the salvation of the Lord."
    },
    {
      "id": 41,
      "start": 686.5399856567383,
      "end": 688.7599792480469,
      "text": " For the Lord shall fight for you."
    },
    {
      "id": 42,
      "start": 688.7599792480469,
      "end": 690.1799850463867,
      "text": " And ye shall hold your peace."
    },
    {
      "id": 43,
      "start": 690.1799850463867,
      "end": 691.6799850463867,
      "text": " I'm thankful for his faith."
    },
    {
      "id": 44,
      "start": 691.6799850463867,
      "end": 696.4199829101562,
      "text": " But we go forward because God speaks."
    },
    {
      "id": 45,
      "start": 696.4199829101562,
      "end": 699.47998046875,
      "text": " I'm thankful for the leadership of Moses."
    },
    {
      "id": 46,
      "start": 699.47998046875,
      "end": 701.0799865722656,
      "text": " I'm thankful for what Moses said."
    },
    {
      "id": 47,
      "start": 701.0799865722656,
      "end": 703.5199813842773,
      "text": " But you understand that Moses said stand still"
    },
    {
      "id": 48,
      "start": 703.5199813842773,
      "end": 705.3199844360352,
      "text": " and see the salvation of the Lord."
    },
    {
      "id": 49,
      "start": 705.3199844360352,
      "end": 706.9599838256836,
      "text": " And I believe he had great faith"
    },
    {
      "id": 50,
      "start": 706.9599838256836,
      "end": 708.3999862670898,
      "text": " that God was going to work,"
    },
    {
      "id": 51,
      "start": 708.3999862670898,
      "end": 711.6999816894531,
      "text": " but they went forward as a matter of obedience"
    },
    {
      "id": 52,
      "start": 711.6999816894531,
      "end": 713.7599792480469,
      "text": " because of what God said."
    },
    {
      "id": 53,
      "start": 713.7599792480469,
      "end": 714.9999847412109,
      "text": " Because in verse number 15,"
    },
    {
      "id": 54,
      "start": 714.9999847412109,
      "end": 715.8399810791016,
      "text": " the Bible says,"
    },
    {
      "id": 55,
      "start": 715.8399810791016,
      "end": 718.0799865722656,
      "text": " the Lord said unto Moses,"
    },
    {
      "id": 56,
      "start": 718.0799865722656,
      "end": 720.1599807739258,
      "text": " wherefore, cryest thou unto Me,"
    },
    {
      "id": 57,
      "start": 720.1599807739258,
      "end": 722.7999801635742,
      "text": " speak unto the children of Israel"
    },
    {
      "id": 58,
      "start": 722.7999801635742,
      "end": 726.5599822998047,
      "text": " that they go forward."
    },
    {
      "id": 59,
      "start": 726.5599822998047,
      "end": 728.47998046875,
      "text": " It's a matter of obedience."
    },
    {
      "id": 60,
      "start": 728.47998046875,
      "end": 730.8399810791016,
      "text": " We so often speak about obedience,"
    },
    {
      "id": 61,
      "start": 730.8399810791016,
      "end": 733.0799865722656,
      "text": " we sing songs about obedience,"
    },
    {
      "id": 62,
      "start": 733.0799865722656,
      "end": 734.2799835205078,
      "text": " trust and obey,"
    },
    {
      "id": 63,
      "start": 734.2799835205078,
      "end": 737.5999755859375,
      "text": " for there's no other way to be happy in Jesus"
    },
    {
      "id": 64,
      "start": 737.5999755859375,
      "end": 739.4399871826172,
      "text": " but to trust and obey."
    },
    {
      "id": 65,
      "start": 739.4399871826172,
      "end": 742.5999755859375,
      "text": " Obedience is the very best way to show what?"
    },
    {
      "id": 66,
      "start": 742.5999755859375,
      "end": 743.9599761962891,
      "text": " That you believe."
    },
    {
      "id": 67,
      "start": 743.9599761962891,
      "end": 746.8799896240234,
      "text": " Doing exactly what the Lord commands,"
    },
    {
      "id": 68,
      "start": 746.9599761962891,
      "end": 748.7599792480469,
      "text": " doing it happily."
    },
    {
      "id": 69,
      "start": 748.7599792480469,
      "end": 751.6799774169922,
      "text": " And we find that often as we think about the Word of God"
    },
    {
      "id": 70,
      "start": 751.6799774169922,
      "end": 753.6399841308594,
      "text": " and we understand throughout the Scriptures"
    },
    {
      "id": 71,
      "start": 753.6399841308594,
      "end": 757.8399810791016,
      "text": " that God has placed a premium on obedience,"
    },
    {
      "id": 72,
      "start": 757.8399810791016,
      "end": 760.3199768066406,
      "text": " we see it here in Exodus chapter number 14,"
    },
    {
      "id": 73,
      "start": 760.3199768066406,
      "end": 763.1999816894531,
      "text": " why is it that they should go forward?"
    },
    {
      "id": 74,
      "start": 763.1999816894531,
      "end": 765.5199890136719,
      "text": " Was it because collectively they got together"
    },
    {
      "id": 75,
      "start": 765.5199890136719,
      "end": 766.9199829101562,
      "text": " and they devised a plan?"
    },
    {
      "id": 76,
      "start": 766.9199829101562,
      "end": 769.5599822998047,
      "text": " Was it because of some other event"
    },
    {
      "id": 77,
      "start": 769.5599822998047,
      "end": 771.8399810791016,
      "text": " or some circumstance or some great idea?"
    },
    {
      "id": 78,
      "start": 771.8399810791016,
      "end": 774.9599761962891,
      "text": " No, it was because of obedience."
    },
    {
      "id": 79,
      "start": 774.9599761962891,
      "end": 776.7599792480469,
      "text": " It's a matter of obedience."
    },
    {
      "id": 80,
      "start": 776.7599792480469,
      "end": 778.4399871826172,
      "text": " Turn to the New Testament and think about us"
    },
    {
      "id": 81,
      "start": 778.4399871826172,
      "end": 780.3599853515625,
      "text": " for New Testament believers,"
    },
    {
      "id": 82,
      "start": 780.3599853515625,
      "end": 782.0399780273438,
      "text": " the book of Matthew."
    },
    {
      "id": 83,
      "start": 782.0399780273438,
      "end": 783.5199890136719,
      "text": " Matthew chapter number 28,"
    },
    {
      "id": 84,
      "start": 783.5199890136719,
      "end": 786.1199798583984,
      "text": " it's a familiar passage of Scripture,"
    },
    {
      "id": 85,
      "start": 786.1199798583984,
      "end": 788.239990234375,
      "text": " but I want to remind you this morning"
    },
    {
      "id": 86,
      "start": 788.239990234375,
      "end": 790.7599792480469,
      "text": " that we read and look to this passage of Scripture"
    },
    {
      "id": 87,
      "start": 790.7599792480469,
      "end": 792.7199859619141,
      "text": " because we as a church,"
    },
    {
      "id": 88,
      "start": 792.7199859619141,
      "end": 795.7199859619141,
      "text": " and I speak not just of Fellowship Baptist Church,"
    },
    {
      "id": 89,
      "start": 795.7199859619141,
      "end": 797.7199859619141,
      "text": " but as the people of God,"
    },
    {
      "id": 90,
      "start": 797.7199859619141,
      "end": 799.0799865722656,
      "text": " the church of God,"
    },
    {
      "id": 91,
      "start": 799.0799865722656,
      "end": 801.1999816894531,
      "text": " we've not yet fulfilled all"
    },
    {
      "id": 92,
      "start": 801.1999816894531,
      "end": 804.3199768066406,
      "text": " that this passage of Scripture has commanded us to do"
    },
    {
      "id": 93,
      "start": 804.3199768066406,
      "end": 806.5599822998047,
      "text": " when we think about the importance of missions"
    },
    {
      "id": 94,
      "start": 806.5599822998047,
      "end": 808.1199798583984,
      "text": " and preaching the Gospel"
    },
    {
      "id": 95,
      "start": 808.1199798583984,
      "end": 809.8799896240234,
      "text": " and taking it to all the world."
    },
    {
      "id": 96,
      "start": 809.8799896240234,
      "end": 812.6399841308594,
      "text": " The Bible says this in Matthew chapter 28,"
    },
    {
      "id": 97,
      "start": 812.6399841308594,
      "end": 815.5599822998047,
      "text": " before the Lord Jesus Christ ascended to heaven"
    },
    {
      "id": 98,
      "start": 815.5599822998047,
      "end": 816.6399841308594,
      "text": " in verse number 18,"
    },
    {
      "id": 99,
      "start": 816.6399841308594,
      "end": 819.47998046875,
      "text": " and Jesus came and spake unto them saying,"
    },
    {
      "id": 100,
      "start": 819.47998046875,
      "end": 824.47998046875,
      "text": " all power is given unto me in heaven and in earth."
    },
    {
      "id": 101,
      "start": 825.0399780273438,
      "end": 829.6399841308594,
      "text": " Go ye therefore and teach all nations,"
    },
    {
      "id": 102,
      "start": 829.6399841308594,
      "end": 832.1599884033203,
      "text": " baptizing them in the name of the Father"
    },
    {
      "id": 103,
      "start": 832.1599884033203,
      "end": 834.8399810791016,
      "text": " and of the Son and of the Holy Ghost,"
    },
    {
      "id": 104,
      "start": 835.8399810791016,
      "end": 838.2799835205078,
      "text": " teaching them to observe all things"
    },
    {
      "id": 105,
      "start": 838.2799835205078,
      "end": 840.6799774169922,
      "text": " whatsoever I have commanded you."
    },
    {
      "id": 106,
      "start": 840.6799774169922,
      "end": 842.8799896240234,
      "text": " And lo, I am with you all way,"
    },
    {
      "id": 107,
      "start": 842.8799896240234,
      "end": 846.0799865722656,
      "text": " even unto the end of the world."
    },
    {
      "id": 108,
      "start": 846.0799865722656,
      "end": 847.8799896240234,
      "text": " Amen."
    },
    {
      "id": 109,
      "start": 847.8799896240234,
      "end": 849.8799896240234,
      "text": " The reality is that oftentimes"
    },
    {
      "id": 110,
      "start": 849.8799896240234,
      "end": 851.7999877929688,
      "text": " as we look at this passage of Scripture,"
    },
    {
      "id": 111,
      "start": 851.7999877929688,
      "end": 854.0799865722656,
      "text": " we mentioned the Great Commission"
    },
    {
      "id": 112,
      "start": 854.0799865722656,
      "end": 856.8399963378906,
      "text": " and how important the Great Commission is."
    },
    {
      "id": 113,
      "start": 856.8399963378906,
      "end": 859.9999694824219,
      "text": " And we understand that the Lord Jesus Christ,"
    },
    {
      "id": 114,
      "start": 859.9999694824219,
      "end": 863.5999755859375,
      "text": " His last commandment that He gave us"
    },
    {
      "id": 115,
      "start": 864.1599731445312,
      "end": 867.2799682617188,
      "text": " before He ascended to heaven continues,"
    },
    {
      "id": 116,
      "start": 867.2799682617188,
      "end": 871.9599914550781,
      "text": " remains to be the mission of the church today."
    },
    {
      "id": 117,
      "start": 871.9599914550781,
      "end": 875.8399963378906,
      "text": " If we lose our focus, if we lose our mission,"
    },
    {
      "id": 118,
      "start": 875.8399963378906,
      "end": 877.47998046875,
      "text": " if we lose our purpose,"
    },
    {
      "id": 119,
      "start": 877.47998046875,
      "end": 881.239990234375,
      "text": " yes, it's to exalt and to glorify the Lord Jesus Christ,"
    },
    {
      "id": 120,
      "start": 881.239990234375,
      "end": 883.5999755859375,
      "text": " but we find it in John, the Bible says,"
    },
    {
      "id": 121,
      "start": 883.5999755859375,
      "end": 888.5999755859375,
      "text": " herein is my Father glorified that ye bear much fruit."
    },
    {
      "id": 122,
      "start": 889.3599853515625,
      "end": 891.8399963378906,
      "text": " And we must be about the Father's business."
    },
    {
      "id": 123,
      "start": 891.8399963378906,
      "end": 894.47998046875,
      "text": " We must be about obedience to this command."
    },
    {
      "id": 124,
      "start": 894.47998046875,
      "end": 896.3599853515625,
      "text": " Why is it that we go forward"
    },
    {
      "id": 125,
      "start": 896.3599853515625,
      "end": 899.3199768066406,
      "text": " with carrying the gospel to a lost and dying world?"
    },
    {
      "id": 126,
      "start": 899.3199768066406,
      "end": 901.7599792480469,
      "text": " It's a matter of obedience."
    },
    {
      "id": 127,
      "start": 901.7599792480469,
      "end": 904.239990234375,
      "text": " It's not because we've received some phone call"
    },
    {
      "id": 128,
      "start": 904.239990234375,
      "end": 906.5199890136719,
      "text": " from some city council member that has said,"
    },
    {
      "id": 129,
      "start": 906.5199890136719,
      "end": 908.9999694824219,
      "text": " would you please go into the community"
    },
    {
      "id": 130,
      "start": 908.9999694824219,
      "end": 911.1199951171875,
      "text": " and give them the truth of the gospel?"
    },
    {
      "id": 131,
      "start": 911.1199951171875,
      "end": 913.47998046875,
      "text": " That'd be very interesting if we received a phone call"
    },
    {
      "id": 132,
      "start": 913.47998046875,
      "end": 915.2799682617188,
      "text": " such as that, would it not?"
    },
    {
      "id": 133,
      "start": 915.2799682617188,
      "end": 917.8399963378906,
      "text": " But the reality is that we do not go forward"
    },
    {
      "id": 134,
      "start": 917.8399963378906,
      "end": 920.9999694824219,
      "text": " because of the request of some elected official,"
    },
    {
      "id": 135,
      "start": 920.9999694824219,
      "end": 925.1599731445312,
      "text": " some politician, we go forward because of the command"
    },
    {
      "id": 136,
      "start": 925.1599731445312,
      "end": 927.47998046875,
      "text": " of our Lord Jesus Christ."
    },
    {
      "id": 137,
      "start": 927.47998046875,
      "end": 928.9999694824219,
      "text": " It's a matter of obedience."
    },
    {
      "id": 138,
      "start": 929.9599914550781,
      "end": 931.3599853515625,
      "text": " We find it in Philippians,"
    },
    {
      "id": 139,
      "start": 931.3599853515625,
      "end": 933.1599731445312,
      "text": " turn over to the book of Philippians, if you will,"
    },
    {
      "id": 140,
      "start": 933.1599731445312,
      "end": 937.3199768066406,
      "text": " in chapter number three, Philippians chapter number three,"
    },
    {
      "id": 141,
      "start": 937.3199768066406,
      "end": 939.9599914550781,
      "text": " and you look in these verses of scripture here"
    },
    {
      "id": 142,
      "start": 939.9599914550781,
      "end": 941.6799926757812,
      "text": " in verses 12 through 14,"
    },
    {
      "id": 143,
      "start": 941.6799926757812,
      "end": 944.1599731445312,
      "text": " and I want you to consider the thought"
    },
    {
      "id": 144,
      "start": 944.1599731445312,
      "end": 947.3399963378906,
      "text": " and the perspective of the apostle Paul"
    },
    {
      "id": 145,
      "start": 947.3399963378906,
      "end": 949.9599914550781,
      "text": " as he gives it here in this passage of scripture."
    },
    {
      "id": 146,
      "start": 950.3599853515625,
      "end": 952.8799743652344,
      "text": " We find that he says this in Philippians three"
    },
    {
      "id": 147,
      "start": 952.8799743652344,
      "end": 954.3999938964844,
      "text": " in verse number 12,"
    },
    {
      "id": 148,
      "start": 955.5999755859375,
      "end": 958.8399963378906,
      "text": " not as though I had already attained,"
    },
    {
      "id": 149,
      "start": 958.8399963378906,
      "end": 962.1199951171875,
      "text": " either were already perfect,"
    },
    {
      "id": 150,
      "start": 962.1199951171875,
      "end": 966.5199890136719,
      "text": " but I follow after, if that I may apprehend that"
    },
    {
      "id": 151,
      "start": 966.5199890136719,
      "end": 971.3599853515625,
      "text": " for which also I am apprehended of Christ Jesus."
    },
    {
      "id": 152,
      "start": 971.3599853515625,
      "end": 975.9999694824219,
      "text": " Brethren, I count not myself to have apprehended,"
    },
    {
      "id": 153,
      "start": 975.9999694824219,
      "end": 978.0399780273438,
      "text": " but this one thing I do,"
    },
    {
      "id": 154,
      "start": 978.0399780273438,
      "end": 980.1599731445312,
      "text": " forgetting those things which are behind"
    },
    {
      "id": 155,
      "start": 980.1599731445312,
      "end": 983.9599914550781,
      "text": " and reaching forth unto those things which are before."
    },
    {
      "id": 156,
      "start": 983.9599914550781,
      "end": 985.7599792480469,
      "text": " Notice what he says in verse number 14,"
    },
    {
      "id": 157,
      "start": 985.7599792480469,
      "end": 989.7599792480469,
      "text": " I press toward the mark for the prize"
    },
    {
      "id": 158,
      "start": 989.7599792480469,
      "end": 994.1199951171875,
      "text": " of the high calling of God in Christ Jesus."
    },
    {
      "id": 159,
      "start": 994.1199951171875,
      "end": 998.9999694824219,
      "text": " This is a testimony of a man who desires to go forward"
    },
    {
      "id": 160,
      "start": 998.9999694824219,
      "end": 1000.6799926757812,
      "text": " for the Lord Jesus Christ,"
    },
    {
      "id": 161,
      "start": 1000.6799926757812,
      "end": 1005.6799926757812,
      "text": " a man that recognizes that I've not yet apprehended,"
    },
    {
      "id": 162,
      "start": 1005.7599792480469,
      "end": 1009.3199768066406,
      "text": " that I have a desire that I may apprehend that"
    },
    {
      "id": 163,
      "start": 1009.3199768066406,
      "end": 1012.1199951171875,
      "text": " for which also I am apprehended"
    },
    {
      "id": 164,
      "start": 1012.1199951171875,
      "end": 1013.239990234375,
      "text": " according to verse number 12,"
    },
    {
      "id": 165,
      "start": 1013.239990234375,
      "end": 1015.5999755859375,
      "text": " but he says I've not yet apprehended,"
    },
    {
      "id": 166,
      "start": 1015.5999755859375,
      "end": 1016.8799743652344,
      "text": " and so what do I do?"
    },
    {
      "id": 167,
      "start": 1016.8799743652344,
      "end": 1020.0399780273438,
      "text": " He says this at the end of verse number 13,"
    },
    {
      "id": 168,
      "start": 1020.0399780273438,
      "end": 1023.1599731445312,
      "text": " reaching forth unto those things which are before,"
    },
    {
      "id": 169,
      "start": 1023.1599731445312,
      "end": 1024.1199951171875,
      "text": " and how does he do it?"
    },
    {
      "id": 170,
      "start": 1024.1199951171875,
      "end": 1027.9599914550781,
      "text": " I press toward the mark for the prize"
    },
    {
      "id": 171,
      "start": 1027.9599914550781,
      "end": 1032.4199829101562,
      "text": " of the high calling of God in Christ Jesus."
    },
    {
      "id": 172,
      "start": 1032.4199829101562,
      "end": 1036.739990234375,
      "text": " Often as we read the examples of the apostle Paul"
    },
    {
      "id": 173,
      "start": 1036.739990234375,
      "end": 1038.9399719238281,
      "text": " as God would use him to write scripture,"
    },
    {
      "id": 174,
      "start": 1038.9399719238281,
      "end": 1042.5799865722656,
      "text": " we find that there are two really analogies"
    },
    {
      "id": 175,
      "start": 1042.5799865722656,
      "end": 1044.3799743652344,
      "text": " that he uses of the Christian life"
    },
    {
      "id": 176,
      "start": 1044.3799743652344,
      "end": 1047.3799743652344,
      "text": " regularly throughout the pages of scripture"
    },
    {
      "id": 177,
      "start": 1047.3799743652344,
      "end": 1048.7799682617188,
      "text": " that God would use him to pen."
    },
    {
      "id": 178,
      "start": 1048.7799682617188,
      "end": 1051.0599975585938,
      "text": " One is that of a soldier"
    },
    {
      "id": 179,
      "start": 1051.0599975585938,
      "end": 1055.739990234375,
      "text": " and the importance of being a good soldier of Jesus Christ,"
    },
    {
      "id": 180,
      "start": 1055.739990234375,
      "end": 1057.8999938964844,
      "text": " but another analogy that he uses"
    },
    {
      "id": 181,
      "start": 1057.8999938964844,
      "end": 1060.8599853515625,
      "text": " is that of a really an athlete,"
    },
    {
      "id": 182,
      "start": 1060.9399719238281,
      "end": 1063.1799926757812,
      "text": " and he speaks of some athletic terms,"
    },
    {
      "id": 183,
      "start": 1063.1799926757812,
      "end": 1067.9399719238281,
      "text": " and here no doubt there's a perspective of athletics"
    },
    {
      "id": 184,
      "start": 1067.9399719238281,
      "end": 1071.739990234375,
      "text": " and pressing toward the mark for the prize"
    },
    {
      "id": 185,
      "start": 1071.739990234375,
      "end": 1074.8599853515625,
      "text": " and thinking about reaching for that finish line,"
    },
    {
      "id": 186,
      "start": 1074.8599853515625,
      "end": 1078.4999694824219,
      "text": " if you will, that goal to get to that place,"
    },
    {
      "id": 187,
      "start": 1078.4999694824219,
      "end": 1080.7799682617188,
      "text": " and we find that as the people of God,"
    },
    {
      "id": 188,
      "start": 1080.7799682617188,
      "end": 1082.719970703125,
      "text": " we must go forward."
    },
    {
      "id": 189,
      "start": 1082.719970703125,
      "end": 1086.6999816894531,
      "text": " What was it that compelled Paul to have this perspective?"
    },
    {
      "id": 190,
      "start": 1086.6999816894531,
      "end": 1089.6999816894531,
      "text": " Why is it that he had this desire to go forward?"
    },
    {
      "id": 191,
      "start": 1089.6999816894531,
      "end": 1091.4999694824219,
      "text": " No doubt it was out of obedience."
    },
    {
      "id": 192,
      "start": 1091.4999694824219,
      "end": 1093.739990234375,
      "text": " God had placed a call upon his life."
    },
    {
      "id": 193,
      "start": 1093.739990234375,
      "end": 1096.8199768066406,
      "text": " God had given him a purpose and a vision"
    },
    {
      "id": 194,
      "start": 1096.8199768066406,
      "end": 1098.6199951171875,
      "text": " and a reason for living,"
    },
    {
      "id": 195,
      "start": 1098.6199951171875,
      "end": 1101.8999938964844,
      "text": " and we find that he wanted to go forward."
    },
    {
      "id": 196,
      "start": 1101.8999938964844,
      "end": 1104.739990234375,
      "text": " In 2 Timothy chapter number three,"
    },
    {
      "id": 197,
      "start": 1104.739990234375,
      "end": 1106.8999938964844,
      "text": " it's a familiar verse of scripture,"
    },
    {
      "id": 198,
      "start": 1106.8999938964844,
      "end": 1108.7999877929688,
      "text": " and we find that it's in this passage,"
    },
    {
      "id": 199,
      "start": 1108.7999877929688,
      "end": 1110.219970703125,
      "text": " really in the book of 2 Timothy,"
    },
    {
      "id": 200,
      "start": 1110.219970703125,
      "end": 1112.0199584960938,
      "text": " where Paul is writing"
    },
    {
      "id": 201,
      "start": 1112.0199584960938,
      "end": 1114.8599853515625,
      "text": " and he's about to be martyred for his faith."
    },
    {
      "id": 202,
      "start": 1114.8599853515625,
      "end": 1118.1399536132812,
      "text": " He speaks of that specifically in the fourth chapter,"
    },
    {
      "id": 203,
      "start": 1118.1399536132812,
      "end": 1120.3800048828125,
      "text": " but in the third chapter of the book of 2 Timothy,"
    },
    {
      "id": 204,
      "start": 1120.3800048828125,
      "end": 1122.8999633789062,
      "text": " he's speaking about these last days,"
    },
    {
      "id": 205,
      "start": 1122.8999633789062,
      "end": 1126.3399658203125,
      "text": " and he's giving a glimpse into the time"
    },
    {
      "id": 206,
      "start": 1126.3399658203125,
      "end": 1130.5,
      "text": " in which the last days and how they'll be described,"
    },
    {
      "id": 207,
      "start": 1130.5,
      "end": 1132.2999877929688,
      "text": " and we find that no doubt,"
    },
    {
      "id": 208,
      "start": 1132.2999877929688,
      "end": 1134.8200073242188,
      "text": " as you read the beginning of 2 Timothy chapter number three,"
    },
    {
      "id": 209,
      "start": 1134.8200073242188,
      "end": 1137.3399658203125,
      "text": " many of these descriptive terms"
    },
    {
      "id": 210,
      "start": 1137.3399658203125,
      "end": 1140.219970703125,
      "text": " that are used to describe the last days"
    },
    {
      "id": 211,
      "start": 1140.219970703125,
      "end": 1142.5399780273438,
      "text": " and the perilous times that shall come"
    },
    {
      "id": 212,
      "start": 1142.5399780273438,
      "end": 1145.4599609375,
      "text": " are prevalent in our day in which we live."
    },
    {
      "id": 213,
      "start": 1146.2999877929688,
      "end": 1149.6199951171875,
      "text": " And Paul says to Timothy in verse number 14,"
    },
    {
      "id": 214,
      "start": 1150.7799682617188,
      "end": 1152.6599731445312,
      "text": " but continue thou."
    },
    {
      "id": 215,
      "start": 1152.6599731445312,
      "end": 1155.3999633789062,
      "text": " Continue thou in the things which thou hast learned"
    },
    {
      "id": 216,
      "start": 1155.3999633789062,
      "end": 1157.0,
      "text": " and hast been assured of,"
    },
    {
      "id": 217,
      "start": 1157.0,
      "end": 1159.7000122070312,
      "text": " knowing of whom thou hast learned them."
    },
    {
      "id": 218,
      "start": 1160.5399780273438,
      "end": 1162.8599853515625,
      "text": " I understand that the phrase go forward"
    },
    {
      "id": 219,
      "start": 1162.8599853515625,
      "end": 1165.219970703125,
      "text": " is not found in that verse of scripture,"
    },
    {
      "id": 220,
      "start": 1165.219970703125,
      "end": 1168.739990234375,
      "text": " but I feel as we think about this truth of continue,"
    },
    {
      "id": 221,
      "start": 1168.739990234375,
      "end": 1172.97998046875,
      "text": " he's not telling him to just kind of hole up"
    },
    {
      "id": 222,
      "start": 1172.97998046875,
      "end": 1176.7000122070312,
      "text": " and mount up and get ready and just stay where you are"
    },
    {
      "id": 223,
      "start": 1176.7000122070312,
      "end": 1177.6599731445312,
      "text": " or to retreat."
    },
    {
      "id": 224,
      "start": 1177.6599731445312,
      "end": 1180.0999755859375,
      "text": " No, he tells him to continue."
    },
    {
      "id": 225,
      "start": 1180.0999755859375,
      "end": 1182.4199829101562,
      "text": " The idea of going forward, making progress."
    },
    {
      "id": 226,
      "start": 1182.4199829101562,
      "end": 1184.1599731445312,
      "text": " There's a work to be done."
    },
    {
      "id": 227,
      "start": 1185.5399780273438,
      "end": 1187.6599731445312,
      "text": " And so why is it that we go forward?"
    },
    {
      "id": 228,
      "start": 1187.6599731445312,
      "end": 1190.5399780273438,
      "text": " Why should the children of Israel respond?"
    },
    {
      "id": 229,
      "start": 1190.5399780273438,
      "end": 1194.219970703125,
      "text": " And here in Exodus chapter number 14,"
    },
    {
      "id": 230,
      "start": 1194.219970703125,
      "end": 1196.6199951171875,
      "text": " it's a matter of obedience."
    },
    {
      "id": 231,
      "start": 1196.6199951171875,
      "end": 1198.2999877929688,
      "text": " Let me ask this question, number two,"
    },
    {
      "id": 232,
      "start": 1198.2999877929688,
      "end": 1199.260009765625,
      "text": " if you're taking notes."
    },
    {
      "id": 233,
      "start": 1199.260009765625,
      "end": 1200.0999755859375,
      "text": " Not only why."
    },
    {
      "id": 0,
      "start": 1200.0999755859375,
      "end": 1205.499975681305,
      "text": " do we go forward? But number two, how? How do we go forward? How do we go forward?"
    },
    {
      "id": 1,
      "start": 1205.499975681305,
      "end": 1209.8199758529663,
      "text": " You say, well that's easy, you put one foot in front of the other. I want you to"
    },
    {
      "id": 2,
      "start": 1209.8199758529663,
      "end": 1212.8599758148193,
      "text": " think about the situation, the circumstances of the children of Israel"
    },
    {
      "id": 3,
      "start": 1212.8599758148193,
      "end": 1218.819974899292,
      "text": " back in Exodus chapter number 14. Again, it's a familiar passage of Scripture. I've"
    },
    {
      "id": 4,
      "start": 1218.819974899292,
      "end": 1223.4199752807617,
      "text": " preached from Exodus 14 in the past and no doubt you've read it, you've heard"
    },
    {
      "id": 5,
      "start": 1223.4199752807617,
      "end": 1227.6599750518799,
      "text": " people preach from it. It's a great passage of Scripture, a great victory"
    },
    {
      "id": 6,
      "start": 1227.6599750518799,
      "end": 1231.6999759674072,
      "text": " that was wrought for the children of Israel, but I want you to consider their"
    },
    {
      "id": 7,
      "start": 1231.6999759674072,
      "end": 1236.3399772644043,
      "text": " circumstances. And they're there in that place, Pi-hahiroth, as the Bible tells us,"
    },
    {
      "id": 8,
      "start": 1236.3399772644043,
      "end": 1242.1799774169922,
      "text": " and they were led to that place. And the Egyptians were gonna have the"
    },
    {
      "id": 9,
      "start": 1242.1799774169922,
      "end": 1247.3799743652344,
      "text": " perspective that they were entangled in the land, that there was no way for them"
    },
    {
      "id": 10,
      "start": 1247.3799743652344,
      "end": 1252.0599746704102,
      "text": " to get out, they were trapped, and thus the the Egyptians would be able to to be"
    },
    {
      "id": 11,
      "start": 1252.0599746704102,
      "end": 1256.9799766540527,
      "text": " victorious. But we find that as we look at the circumstances, that before them"
    },
    {
      "id": 12,
      "start": 1256.9799766540527,
      "end": 1265.2599792480469,
      "text": " is the Red Sea. Behind them they've seen, they lifted up their eyes according to"
    },
    {
      "id": 13,
      "start": 1265.2599792480469,
      "end": 1270.0199737548828,
      "text": " verse number 10, and they saw the Egyptians coming. All the host of the"
    },
    {
      "id": 14,
      "start": 1270.0199737548828,
      "end": 1278.3799743652344,
      "text": " Egyptians. So you got the Red Sea and you have the Egyptians. Go forward. Go forward."
    },
    {
      "id": 15,
      "start": 1278.3799743652344,
      "end": 1282.339973449707,
      "text": " It's a matter of obedience. Why do we go forward? We go forward because of"
    },
    {
      "id": 16,
      "start": 1282.339973449707,
      "end": 1288.579978942871,
      "text": " obedience. But how do we go forward? We go forward by faith. We go forward by"
    },
    {
      "id": 17,
      "start": 1288.579978942871,
      "end": 1294.0599746704102,
      "text": " faith. We find that here, as we look at this passage of Scripture in Exodus"
    },
    {
      "id": 18,
      "start": 1294.0599746704102,
      "end": 1299.2599792480469,
      "text": " chapter number 14, they had to believe God. They had to believe that it would"
    },
    {
      "id": 19,
      "start": 1299.2599792480469,
      "end": 1304.2999725341797,
      "text": " happen just as He said it would happen. Notice in Exodus chapter number 14, the"
    },
    {
      "id": 20,
      "start": 1304.2999725341797,
      "end": 1309.8199768066406,
      "text": " Bible says in verse number 15, that the Lord said unto Moses, wherefore criest"
    },
    {
      "id": 21,
      "start": 1309.8199768066406,
      "end": 1315.8999786376953,
      "text": " thou unto me? Speak unto the children of Israel that they go forward. Lift thou"
    },
    {
      "id": 22,
      "start": 1315.8999786376953,
      "end": 1322.0199737548828,
      "text": " up thy rod and stretch out thine hand over the sea, and divide it. And the"
    },
    {
      "id": 23,
      "start": 1322.0199737548828,
      "end": 1328.739974975586,
      "text": " children of Israel shall go on dry ground through the midst of the sea. I've"
    },
    {
      "id": 24,
      "start": 1328.739974975586,
      "end": 1332.0999755859375,
      "text": " heard people say that it didn't require much faith on the part of the children"
    },
    {
      "id": 25,
      "start": 1332.0999755859375,
      "end": 1337.8599700927734,
      "text": " of Israel because God parted the Red Sea before they walked into the dry ground"
    },
    {
      "id": 26,
      "start": 1337.8599700927734,
      "end": 1342.5399780273438,
      "text": " and to pass over the Red Sea. And they've peddled the idea that it took"
    },
    {
      "id": 27,
      "start": 1342.5399780273438,
      "end": 1347.2599792480469,
      "text": " more faith for the children of Israel to cross over the Jordan because they had"
    },
    {
      "id": 28,
      "start": 1347.2599792480469,
      "end": 1352.0999755859375,
      "text": " to take a step in before the waters were parted. I would submit to you that it's"
    },
    {
      "id": 29,
      "start": 1352.0999755859375,
      "end": 1355.5799713134766,
      "text": " really the same level of faith because when they saw the walls of water on"
    },
    {
      "id": 30,
      "start": 1355.5799713134766,
      "end": 1359.8199768066406,
      "text": " either side of them when they were going to enter into the Red Sea, it required a"
    },
    {
      "id": 31,
      "start": 1359.8199768066406,
      "end": 1363.8599700927734,
      "text": " great deal of faith to believe that God would continue to hold those walls of"
    },
    {
      "id": 32,
      "start": 1363.8599700927734,
      "end": 1369.8199768066406,
      "text": " water back for them to cross to the other side. It's a matter of faith."
    },
    {
      "id": 33,
      "start": 1369.8199768066406,
      "end": 1375.1799774169922,
      "text": " Believing God, believing that not only could God do it but that God would"
    },
    {
      "id": 34,
      "start": 1375.1799774169922,
      "end": 1381.3399810791016,
      "text": " provide them safety for the entirety of the passage, that until they reached the"
    },
    {
      "id": 35,
      "start": 1381.3399810791016,
      "end": 1386.8999786376953,
      "text": " other side that they would have the the safety and the ability to cross over. The"
    },
    {
      "id": 36,
      "start": 1386.8999786376953,
      "end": 1391.2999725341797,
      "text": " Bible tells us as we move forward further through here in Exodus chapter"
    },
    {
      "id": 37,
      "start": 1391.2999725341797,
      "end": 1398.3399810791016,
      "text": " 14 that they passed over on dry ground. It's amazing, phenomenal, but it's by"
    },
    {
      "id": 38,
      "start": 1398.3399810791016,
      "end": 1406.5799713134766,
      "text": " faith. It's by faith. We go forward. Why? Because of obedience. How? By faith. In"
    },
    {
      "id": 39,
      "start": 1406.5799713134766,
      "end": 1411.6199798583984,
      "text": " Matthew chapter number 16 and verse number 18 we find that Jesus gives this"
    },
    {
      "id": 40,
      "start": 1411.6199798583984,
      "end": 1417.2999725341797,
      "text": " great promise to Peter and he says, upon this rock I will build my church. He"
    },
    {
      "id": 41,
      "start": 1417.2999725341797,
      "end": 1421.739974975586,
      "text": " tells him that the gates of hell shall not prevail against it. When we think"
    },
    {
      "id": 42,
      "start": 1421.739974975586,
      "end": 1426.459976196289,
      "text": " about the the importance of us as New Testament believers going forward, we"
    },
    {
      "id": 43,
      "start": 1426.459976196289,
      "end": 1430.0199737548828,
      "text": " understand that it's a matter of obedience but we also understand that"
    },
    {
      "id": 44,
      "start": 1430.0199737548828,
      "end": 1434.6599731445312,
      "text": " it's a matter of faith that God has given us the marching orders and we are"
    },
    {
      "id": 45,
      "start": 1434.6599731445312,
      "end": 1440.739974975586,
      "text": " going in obedience but we're trusting him to do what only he can do. We go by"
    },
    {
      "id": 46,
      "start": 1440.739974975586,
      "end": 1446.2999725341797,
      "text": " faith. The just shall live by faith. We go by faith believing that God will use his"
    },
    {
      "id": 47,
      "start": 1446.2999725341797,
      "end": 1453.0999755859375,
      "text": " Word. Believing that the truth that God has given us within the Word of God is"
    },
    {
      "id": 48,
      "start": 1453.0999755859375,
      "end": 1457.8999633789062,
      "text": " effective on reaching the generation that God has given us the responsibility"
    },
    {
      "id": 49,
      "start": 1457.8999633789062,
      "end": 1463.7799682617188,
      "text": " to minister to. Our God is eternal. He is all-knowing and we find that he's given"
    },
    {
      "id": 50,
      "start": 1463.7799682617188,
      "end": 1469.739990234375,
      "text": " us a book and he's given us a plan and we're to simply follow the plan that"
    },
    {
      "id": 51,
      "start": 1469.739990234375,
      "end": 1475.9399719238281,
      "text": " he's given us and by faith we trust him to do what only he can do. So often today"
    },
    {
      "id": 52,
      "start": 1476.0599670410156,
      "end": 1481.0999755859375,
      "text": " we find and I would not suggest this morning that there's absolutely no use"
    },
    {
      "id": 53,
      "start": 1481.0999755859375,
      "end": 1486.0199890136719,
      "text": " in any of these types of sessions or seminars for no doubt I've gained some"
    },
    {
      "id": 54,
      "start": 1486.0199890136719,
      "end": 1491.219970703125,
      "text": " some good ideas and insight but so often it seems as if we sit around and we try"
    },
    {
      "id": 55,
      "start": 1491.219970703125,
      "end": 1495.8999633789062,
      "text": " to scheme and device plans on how it is that we're going to reach the current"
    },
    {
      "id": 56,
      "start": 1495.8999633789062,
      "end": 1500.0999755859375,
      "text": " generation that God has given us to minister to and all the while that we"
    },
    {
      "id": 57,
      "start": 1500.0999755859375,
      "end": 1504.4599609375,
      "text": " sit around and we come up with ideas and we seek to figure out how to do it we"
    },
    {
      "id": 58,
      "start": 1504.4599609375,
      "end": 1511.1799621582031,
      "text": " simply never actually do it and the importance is to follow what God has"
    },
    {
      "id": 59,
      "start": 1511.1799621582031,
      "end": 1517.1399841308594,
      "text": " said we can spend days and weeks and hours upon hours upon hours trying to"
    },
    {
      "id": 60,
      "start": 1517.1399841308594,
      "end": 1522.0999755859375,
      "text": " come up with ideas but God said that we're to go we're to preach the gospel"
    },
    {
      "id": 61,
      "start": 1522.0999755859375,
      "end": 1527.0199890136719,
      "text": " we believe as Paul said in Romans chapter number one I'm not ashamed of"
    },
    {
      "id": 62,
      "start": 1527.0199890136719,
      "end": 1532.3399658203125,
      "text": " the gospel of Christ why for it is the power of God unto salvation to everyone"
    },
    {
      "id": 63,
      "start": 1532.3799743652344,
      "end": 1536.8599853515625,
      "text": " that believeth to the Jew first and also to the Greek we believe that the Bible"
    },
    {
      "id": 64,
      "start": 1536.8599853515625,
      "end": 1542.0999755859375,
      "text": " tells us in Hebrews chapter 7 in verse number 25 that he is able to save them"
    },
    {
      "id": 65,
      "start": 1542.0999755859375,
      "end": 1547.8599853515625,
      "text": " to the uttermost the gospel still works we don't need to change the methodology"
    },
    {
      "id": 66,
      "start": 1547.8599853515625,
      "end": 1552.6199645996094,
      "text": " we don't need to change the message we find that as we take the message of God"
    },
    {
      "id": 67,
      "start": 1552.6199645996094,
      "end": 1557.5399780273438,
      "text": " in the power of God first Corinthians tells us that he's chosen the"
    },
    {
      "id": 68,
      "start": 1557.5399780273438,
      "end": 1565.0199890136719,
      "text": " foolishness of preaching why so that no flesh would glory in his sight and we"
    },
    {
      "id": 69,
      "start": 1565.0199890136719,
      "end": 1570.4399719238281,
      "text": " find that we live in this time in this age in which we must have faith as we go"
    },
    {
      "id": 70,
      "start": 1570.4399719238281,
      "end": 1576.6199645996094,
      "text": " forward in in obedience that we have faith that God is going to work and God"
    },
    {
      "id": 71,
      "start": 1576.6199645996094,
      "end": 1584.3399658203125,
      "text": " is going to move that he is able to do what only he can do and he'll use us"
    },
    {
      "id": 72,
      "start": 1584.3799743652344,
      "end": 1589.1799621582031,
      "text": " familiar passage of Scripture in 1st Corinthians 15 as we look at this"
    },
    {
      "id": 73,
      "start": 1589.1799621582031,
      "end": 1593.8199768066406,
      "text": " passage in 1st Corinthians 15 we're reminded of the great truth of the"
    },
    {
      "id": 74,
      "start": 1593.8199768066406,
      "end": 1598.5399780273438,
      "text": " resurrection of our Lord and Savior Jesus Christ how he conquered sin death"
    },
    {
      "id": 75,
      "start": 1598.5399780273438,
      "end": 1602.8199768066406,
      "text": " in the grave it is the cornerstone of our faith and it's in this 15th chapter"
    },
    {
      "id": 76,
      "start": 1602.8199768066406,
      "end": 1607.2999877929688,
      "text": " of the book of 1st Corinthians that you find that really the the greatest"
    },
    {
      "id": 77,
      "start": 1607.2999877929688,
      "end": 1611.0199890136719,
      "text": " information given to us in one place of Scripture with regard to the"
    },
    {
      "id": 78,
      "start": 1611.0199890136719,
      "end": 1616.2999877929688,
      "text": " resurrection and the hope that we have as the people of God that we too will be"
    },
    {
      "id": 79,
      "start": 1616.2999877929688,
      "end": 1623.0199890136719,
      "text": " resurrected why because he is the firstfruits we find that that he is the"
    },
    {
      "id": 80,
      "start": 1623.0199890136719,
      "end": 1628.5799865722656,
      "text": " firstfruits and we too will rise this mortal shall put on immortality this"
    },
    {
      "id": 81,
      "start": 1628.5799865722656,
      "end": 1633.6599731445312,
      "text": " corruption shall put on incorruption and how we rejoice in that but because we"
    },
    {
      "id": 82,
      "start": 1633.6599731445312,
      "end": 1640.1399841308594,
      "text": " serve a risen Savior we go in faith believing that he is able to do and able"
    },
    {
      "id": 83,
      "start": 1640.1399841308594,
      "end": 1644.6999816894531,
      "text": " to work as only he can notice as the passage of Scripture concludes in verse"
    },
    {
      "id": 84,
      "start": 1644.6999816894531,
      "end": 1652.219970703125,
      "text": " number 58 in 1st Corinthians 15 and 58 the Bible says this therefore my beloved"
    },
    {
      "id": 85,
      "start": 1652.219970703125,
      "end": 1662.8599853515625,
      "text": " brethren be steadfast unmovable always abounding in the work of the Lord for as"
    },
    {
      "id": 86,
      "start": 1662.8599853515625,
      "end": 1672.7799682617188,
      "text": " much as you know that your labor is not in vain in the Lord there are times in"
    },
    {
      "id": 87,
      "start": 1672.7799682617188,
      "end": 1679.219970703125,
      "text": " which we examine the circumstance of the situation we say is God working the"
    },
    {
      "id": 88,
      "start": 1679.219970703125,
      "end": 1683.0199890136719,
      "text": " truth of the matter is that if we continue to sow the seeds of the Word of"
    },
    {
      "id": 89,
      "start": 1683.0199890136719,
      "end": 1688.0999755859375,
      "text": " God and we continue to give the gospel we continue to go forth and and and do"
    },
    {
      "id": 90,
      "start": 1688.0999755859375,
      "end": 1693.739990234375,
      "text": " what God has called us to do the answer is yes God is working we may not see how"
    },
    {
      "id": 91,
      "start": 1693.739990234375,
      "end": 1698.6599731445312,
      "text": " God is working we may not see it today but we can have great hope and we can"
    },
    {
      "id": 92,
      "start": 1698.6599731445312,
      "end": 1708.219970703125,
      "text": " have great confidence because why we go in faith sowing our seeds the seeds of"
    },
    {
      "id": 93,
      "start": 1708.219970703125,
      "end": 1714.8199462890625,
      "text": " the gospel the Word of God believing that God is able to work in the hearts"
    },
    {
      "id": 94,
      "start": 1714.8199462890625,
      "end": 1720.97998046875,
      "text": " and the minds of those that receive the truth of the Word of God I think of the"
    },
    {
      "id": 95,
      "start": 1720.97998046875,
      "end": 1726.1799926757812,
      "text": " farmer as the analogy is used so often in the Word of God the farmer that"
    },
    {
      "id": 96,
      "start": 1726.1799926757812,
      "end": 1733.5799560546875,
      "text": " plants his seed he too plants his seed in faith believing that a crop a harvest"
    },
    {
      "id": 97,
      "start": 1733.5799560546875,
      "end": 1740.1399536132812,
      "text": " will one day come I've never been a farmer I'm not the son of a farmer I"
    },
    {
      "id": 98,
      "start": 1740.2599487304688,
      "end": 1746.5399780273438,
      "text": " probably wouldn't survive long if I were a farmer just being honest Pierre can"
    },
    {
      "id": 99,
      "start": 1746.5399780273438,
      "end": 1752.7799682617188,
      "text": " relate we talked about it a few times over the years but the reality is this I"
    },
    {
      "id": 100,
      "start": 1752.7799682617188,
      "end": 1757.5,
      "text": " don't find as I've had interaction and seen various things I don't find that a"
    },
    {
      "id": 101,
      "start": 1757.5,
      "end": 1762.3800048828125,
      "text": " farmer goes out and sows his seed and then every day goes out wringing his"
    },
    {
      "id": 102,
      "start": 1762.3800048828125,
      "end": 1769.1799926757812,
      "text": " hands wondering where the harvest is why isn't it here today well why isn't it"
    },
    {
      "id": 103,
      "start": 1769.1799926757812,
      "end": 1775.219970703125,
      "text": " coming up I don't see anything I need to dig it up and start over what if he"
    },
    {
      "id": 104,
      "start": 1775.219970703125,
      "end": 1780.8599853515625,
      "text": " does that he's never gonna have a harvest he's gonna continue to destroy"
    },
    {
      "id": 105,
      "start": 1780.8599853515625,
      "end": 1785.2999877929688,
      "text": " what's taking place and and what's going on with the germination of the seed and"
    },
    {
      "id": 106,
      "start": 1785.2999877929688,
      "end": 1790.1799926757812,
      "text": " the growth of that plant and all that takes place and if he day by day goes"
    },
    {
      "id": 107,
      "start": 1790.1799926757812,
      "end": 1794.7799682617188,
      "text": " out and says nothing's happening I need to dig it up and start again he's never"
    },
    {
      "id": 108,
      "start": 1794.7799682617188,
      "end": 1801.6599731445312,
      "text": " gonna have a harvest but he has faith that he planted that seed"
    },
    {
      "id": 0,
      "start": 1801.6599731445312,
      "end": 1804.979973077774,
      "text": " And then in a little while,"
    },
    {
      "id": 1,
      "start": 1804.979973077774,
      "end": 1807.7399730682373,
      "text": " he'll start to see the seed sprout."
    },
    {
      "id": 2,
      "start": 1807.7399730682373,
      "end": 1810.5999727249146,
      "text": " He'll see that life."
    },
    {
      "id": 3,
      "start": 1810.5999727249146,
      "end": 1812.299973487854,
      "text": " A little while longer,"
    },
    {
      "id": 4,
      "start": 1812.299973487854,
      "end": 1814.6999731063843,
      "text": " you see the growth and you see the progress,"
    },
    {
      "id": 5,
      "start": 1814.6999731063843,
      "end": 1819.4799728393555,
      "text": " and soon it will be time for harvest."
    },
    {
      "id": 6,
      "start": 1819.4799728393555,
      "end": 1821.2399730682373,
      "text": " And for us as the people of God,"
    },
    {
      "id": 7,
      "start": 1821.2399730682373,
      "end": 1823.7399730682373,
      "text": " as we go forth and we sow seed"
    },
    {
      "id": 8,
      "start": 1823.7399730682373,
      "end": 1826.0399723052979,
      "text": " and we go by faith believing"
    },
    {
      "id": 9,
      "start": 1826.0399723052979,
      "end": 1827.3799724578857,
      "text": " that God is working,"
    },
    {
      "id": 10,
      "start": 1827.3799724578857,
      "end": 1829.2999725341797,
      "text": " believing that He's able to do"
    },
    {
      "id": 11,
      "start": 1829.2999725341797,
      "end": 1830.7199726104736,
      "text": " what only He can do,"
    },
    {
      "id": 12,
      "start": 1830.7199726104736,
      "end": 1833.119972229004,
      "text": " and we're going forward, why?"
    },
    {
      "id": 13,
      "start": 1833.119972229004,
      "end": 1834.1999740600586,
      "text": " Because of obedience."
    },
    {
      "id": 14,
      "start": 1834.1999740600586,
      "end": 1837.6999740600586,
      "text": " How? By faith."
    },
    {
      "id": 15,
      "start": 1837.6999740600586,
      "end": 1842.839973449707,
      "text": " We live in a very results-oriented culture."
    },
    {
      "id": 16,
      "start": 1842.839973449707,
      "end": 1843.9199714660645,
      "text": " We understand that."
    },
    {
      "id": 17,
      "start": 1843.9199714660645,
      "end": 1846.7199745178223,
      "text": " We live in this culture."
    },
    {
      "id": 18,
      "start": 1846.7199745178223,
      "end": 1849.0799713134766,
      "text": " And so often, we're results-oriented"
    },
    {
      "id": 19,
      "start": 1849.0799713134766,
      "end": 1850.3199729919434,
      "text": " and if we're not careful,"
    },
    {
      "id": 20,
      "start": 1850.3199729919434,
      "end": 1853.4399719238281,
      "text": " we can become very pragmatic."
    },
    {
      "id": 21,
      "start": 1853.4399719238281,
      "end": 1857.1999740600586,
      "text": " And we can miss this element of faith."
    },
    {
      "id": 22,
      "start": 1857.1999740600586,
      "end": 1859.279972076416,
      "text": " But we understand that we go forward"
    },
    {
      "id": 23,
      "start": 1859.279972076416,
      "end": 1861.3599739074707,
      "text": " how? By faith."
    },
    {
      "id": 24,
      "start": 1861.3599739074707,
      "end": 1863.5599746704102,
      "text": " Believing that the work that we're doing,"
    },
    {
      "id": 25,
      "start": 1863.5599746704102,
      "end": 1865.2599716186523,
      "text": " the work that we're engaged in,"
    },
    {
      "id": 26,
      "start": 1865.2599716186523,
      "end": 1868.1599731445312,
      "text": " is a spiritual work."
    },
    {
      "id": 27,
      "start": 1868.1599731445312,
      "end": 1869.959976196289,
      "text": " And the Holy Spirit of God is moving"
    },
    {
      "id": 28,
      "start": 1869.959976196289,
      "end": 1871.9999694824219,
      "text": " and working and using His Word."
    },
    {
      "id": 29,
      "start": 1871.9999694824219,
      "end": 1874.119972229004,
      "text": " Why is it that Paul tells Timothy"
    },
    {
      "id": 30,
      "start": 1874.119972229004,
      "end": 1877.5999755859375,
      "text": " to continue in the things that thou hast learned"
    },
    {
      "id": 31,
      "start": 1877.5999755859375,
      "end": 1878.9999694824219,
      "text": " and hast been assured of?"
    },
    {
      "id": 32,
      "start": 1878.9999694824219,
      "end": 1881.119972229004,
      "text": " He didn't tell him that in those last days"
    },
    {
      "id": 33,
      "start": 1881.119972229004,
      "end": 1883.119972229004,
      "text": " you're going to change all of your methodology,"
    },
    {
      "id": 34,
      "start": 1883.119972229004,
      "end": 1884.239974975586,
      "text": " you're going to change your message,"
    },
    {
      "id": 35,
      "start": 1884.239974975586,
      "end": 1885.5199737548828,
      "text": " you're going to change all these things."
    },
    {
      "id": 36,
      "start": 1885.5199737548828,
      "end": 1887.5599746704102,
      "text": " No, in fact, as you enter into the fourth chapter,"
    },
    {
      "id": 37,
      "start": 1887.5599746704102,
      "end": 1890.3599700927734,
      "text": " he says, preach the Word."
    },
    {
      "id": 38,
      "start": 1890.3599700927734,
      "end": 1891.9999694824219,
      "text": " Be instant in season, out of season,"
    },
    {
      "id": 39,
      "start": 1891.9999694824219,
      "end": 1894.5199737548828,
      "text": " reprove, rebuke, exhort with all long-suffering"
    },
    {
      "id": 40,
      "start": 1894.5199737548828,
      "end": 1896.3599700927734,
      "text": " and doctrine, for the time will come"
    },
    {
      "id": 41,
      "start": 1896.3599700927734,
      "end": 1900.119972229004,
      "text": " when they will not endure sound doctrine."
    },
    {
      "id": 42,
      "start": 1900.119972229004,
      "end": 1902.0399703979492,
      "text": " And we find that, yeah, no doubt,"
    },
    {
      "id": 43,
      "start": 1902.0399703979492,
      "end": 1904.0399703979492,
      "text": " we're in that place, we're in that time."
    },
    {
      "id": 44,
      "start": 1904.0399703979492,
      "end": 1908.3599700927734,
      "text": " And the reality is that God has still ordained"
    },
    {
      "id": 45,
      "start": 1908.3599700927734,
      "end": 1910.7999725341797,
      "text": " preaching."
    },
    {
      "id": 46,
      "start": 1910.7999725341797,
      "end": 1912.7999725341797,
      "text": " The preaching of His Word."
    },
    {
      "id": 47,
      "start": 1912.7999725341797,
      "end": 1914.839973449707,
      "text": " The sowing of the seed."
    },
    {
      "id": 48,
      "start": 1914.839973449707,
      "end": 1916.3599700927734,
      "text": " And how is it that we go forward?"
    },
    {
      "id": 49,
      "start": 1916.3599700927734,
      "end": 1918.839973449707,
      "text": " We go forward by faith."
    },
    {
      "id": 50,
      "start": 1918.839973449707,
      "end": 1922.5599746704102,
      "text": " Philippians 1.6 says this,"
    },
    {
      "id": 51,
      "start": 1922.5599746704102,
      "end": 1925.2799758911133,
      "text": " being confident of this very thing,"
    },
    {
      "id": 52,
      "start": 1925.2799758911133,
      "end": 1928.5999755859375,
      "text": " that he which hath begun a good work in you"
    },
    {
      "id": 53,
      "start": 1928.5999755859375,
      "end": 1932.8799743652344,
      "text": " will perform it until the day of Jesus Christ."
    },
    {
      "id": 54,
      "start": 1932.8799743652344,
      "end": 1934.959976196289,
      "text": " Being confident."
    },
    {
      "id": 55,
      "start": 1934.959976196289,
      "end": 1937.3599700927734,
      "text": " I'm thankful for the work that God is doing"
    },
    {
      "id": 56,
      "start": 1937.3599700927734,
      "end": 1939.1599731445312,
      "text": " in me and in you,"
    },
    {
      "id": 57,
      "start": 1939.1599731445312,
      "end": 1941.7599792480469,
      "text": " and trusting that He will continue to do"
    },
    {
      "id": 58,
      "start": 1941.7599792480469,
      "end": 1945.47998046875,
      "text": " what only He can do in our lives."
    },
    {
      "id": 59,
      "start": 1945.47998046875,
      "end": 1947.3999786376953,
      "text": " When we think about this truth of go forward,"
    },
    {
      "id": 60,
      "start": 1947.3999786376953,
      "end": 1949.0399780273438,
      "text": " we say, why do we go forward?"
    },
    {
      "id": 61,
      "start": 1949.0399780273438,
      "end": 1950.47998046875,
      "text": " Well, it's a matter of obedience."
    },
    {
      "id": 62,
      "start": 1950.47998046875,
      "end": 1951.8799743652344,
      "text": " How do we go forward?"
    },
    {
      "id": 63,
      "start": 1951.8799743652344,
      "end": 1953.6399688720703,
      "text": " It's by faith."
    },
    {
      "id": 64,
      "start": 1953.6399688720703,
      "end": 1956.1199798583984,
      "text": " Let me ask this question, number three."
    },
    {
      "id": 65,
      "start": 1956.1199798583984,
      "end": 1959.1199798583984,
      "text": " What hinders us from going forward?"
    },
    {
      "id": 66,
      "start": 1959.1199798583984,
      "end": 1961.5599670410156,
      "text": " What hinders us from going forward?"
    },
    {
      "id": 67,
      "start": 1961.5599670410156,
      "end": 1963.5999755859375,
      "text": " No doubt, if we'd be honest this morning,"
    },
    {
      "id": 68,
      "start": 1963.5999755859375,
      "end": 1966.0399780273438,
      "text": " there are hindrances in our lives,"
    },
    {
      "id": 69,
      "start": 1966.0399780273438,
      "end": 1968.3599700927734,
      "text": " there are hindrances to going forward."
    },
    {
      "id": 70,
      "start": 1968.3599700927734,
      "end": 1969.959976196289,
      "text": " The children of Israel,"
    },
    {
      "id": 71,
      "start": 1969.959976196289,
      "end": 1973.5199737548828,
      "text": " there's a great big red sea in front of them."
    },
    {
      "id": 72,
      "start": 1973.6399688720703,
      "end": 1976.5599670410156,
      "text": " And God says, go forward."
    },
    {
      "id": 73,
      "start": 1976.5599670410156,
      "end": 1979.5599670410156,
      "text": " There's a body of water."
    },
    {
      "id": 74,
      "start": 1979.5599670410156,
      "end": 1981.719970703125,
      "text": " It's an obstacle. It's a hindrance."
    },
    {
      "id": 75,
      "start": 1981.719970703125,
      "end": 1984.6799774169922,
      "text": " But God's going to deal with that."
    },
    {
      "id": 76,
      "start": 1984.6799774169922,
      "end": 1987.2799682617188,
      "text": " But sometimes what happens in our lives"
    },
    {
      "id": 77,
      "start": 1987.2799682617188,
      "end": 1991.1599731445312,
      "text": " is we have these obstacles or these hindrances"
    },
    {
      "id": 78,
      "start": 1991.1599731445312,
      "end": 1993.5599670410156,
      "text": " and we fail to go forward. Why?"
    },
    {
      "id": 79,
      "start": 1993.5599670410156,
      "end": 1996.199966430664,
      "text": " Because we're looking by sight and not by faith."
    },
    {
      "id": 80,
      "start": 1996.199966430664,
      "end": 1998.4399719238281,
      "text": " And we say, well, there's no way to go forward."
    },
    {
      "id": 81,
      "start": 1998.4399719238281,
      "end": 2000.0399780273438,
      "text": " It's impossible to go forward."
    },
    {
      "id": 82,
      "start": 2000.0399780273438,
      "end": 2003.47998046875,
      "text": " I can't go forward."
    },
    {
      "id": 83,
      "start": 2003.5999755859375,
      "end": 2006.6399688720703,
      "text": " But God says, go forward."
    },
    {
      "id": 84,
      "start": 2006.6399688720703,
      "end": 2010.3199768066406,
      "text": " How? By faith."
    },
    {
      "id": 85,
      "start": 2010.3199768066406,
      "end": 2013.0399780273438,
      "text": " What hinders me from going forward?"
    },
    {
      "id": 86,
      "start": 2013.0399780273438,
      "end": 2018.719970703125,
      "text": " I would say this, doubt. Doubt."
    },
    {
      "id": 87,
      "start": 2018.719970703125,
      "end": 2025.47998046875,
      "text": " Several years ago, it was in 2017"
    },
    {
      "id": 88,
      "start": 2025.47998046875,
      "end": 2027.239974975586,
      "text": " that our theme for the year was"
    },
    {
      "id": 89,
      "start": 2027.239974975586,
      "end": 2030.3599700927734,
      "text": " Increase Our Faith."
    },
    {
      "id": 90,
      "start": 2030.3599700927734,
      "end": 2032.3999786376953,
      "text": " And through the year of 2017,"
    },
    {
      "id": 91,
      "start": 2032.3999786376953,
      "end": 2034.9999694824219,
      "text": " I preached a number of messages"
    },
    {
      "id": 92,
      "start": 2034.9999694824219,
      "end": 2036.9999694824219,
      "text": " on those things that God would use"
    },
    {
      "id": 93,
      "start": 2036.9999694824219,
      "end": 2038.6799774169922,
      "text": " from His Word to increase our faith."
    },
    {
      "id": 94,
      "start": 2038.6799774169922,
      "end": 2040.9999694824219,
      "text": " We looked at examples of individuals"
    },
    {
      "id": 95,
      "start": 2040.9999694824219,
      "end": 2043.8399658203125,
      "text": " that had their faith increase"
    },
    {
      "id": 96,
      "start": 2043.8399658203125,
      "end": 2046.3999786376953,
      "text": " through the events in their lives."
    },
    {
      "id": 97,
      "start": 2046.3999786376953,
      "end": 2048.0799713134766,
      "text": " And I said this often"
    },
    {
      "id": 98,
      "start": 2048.0799713134766,
      "end": 2049.919967651367,
      "text": " in that particular calendar year,"
    },
    {
      "id": 99,
      "start": 2049.919967651367,
      "end": 2051.999969482422,
      "text": " and it's worth repeating this morning,"
    },
    {
      "id": 100,
      "start": 2051.999969482422,
      "end": 2054.5599670410156,
      "text": " that if faith is a flower,"
    },
    {
      "id": 101,
      "start": 2054.5599670410156,
      "end": 2057.439971923828,
      "text": " then doubt is a weed."
    },
    {
      "id": 102,
      "start": 2057.439971923828,
      "end": 2058.5999755859375,
      "text": " And what do weeds do?"
    },
    {
      "id": 103,
      "start": 2058.5999755859375,
      "end": 2061.439971923828,
      "text": " They choke out the life of the flowers."
    },
    {
      "id": 104,
      "start": 2061.439971923828,
      "end": 2062.9199829101562,
      "text": " We need to get rid of the weeds."
    },
    {
      "id": 105,
      "start": 2062.9199829101562,
      "end": 2064.759979248047,
      "text": " If we want our flower beds to grow,"
    },
    {
      "id": 106,
      "start": 2064.759979248047,
      "end": 2067.5999755859375,
      "text": " and we want our flowers to grow"
    },
    {
      "id": 107,
      "start": 2067.5999755859375,
      "end": 2069.3199768066406,
      "text": " and to have that beauty,"
    },
    {
      "id": 108,
      "start": 2069.3199768066406,
      "end": 2070.5199584960938,
      "text": " we get rid of weeds."
    },
    {
      "id": 109,
      "start": 2070.5199584960938,
      "end": 2071.6399841308594,
      "text": " Why do we pick weeds?"
    },
    {
      "id": 110,
      "start": 2071.6399841308594,
      "end": 2072.759979248047,
      "text": " Why do we spend time?"
    },
    {
      "id": 111,
      "start": 2072.759979248047,
      "end": 2075.5999755859375,
      "text": " And all of the things that are out there"
    },
    {
      "id": 112,
      "start": 2075.5999755859375,
      "end": 2078.679962158203,
      "text": " the marketing industry has provided us with"
    },
    {
      "id": 113,
      "start": 2078.679962158203,
      "end": 2080.199981689453,
      "text": " to deal with weeds, why?"
    },
    {
      "id": 114,
      "start": 2080.199981689453,
      "end": 2083.9199829101562,
      "text": " Because they choke out the life of the flower."
    },
    {
      "id": 115,
      "start": 2083.9199829101562,
      "end": 2086.3599853515625,
      "text": " And if faith is a flower,"
    },
    {
      "id": 116,
      "start": 2086.3599853515625,
      "end": 2088.5599670410156,
      "text": " then doubt is a weed."
    },
    {
      "id": 117,
      "start": 2088.5599670410156,
      "end": 2091.9199829101562,
      "text": " We must get rid of doubt."
    },
    {
      "id": 118,
      "start": 2091.9199829101562,
      "end": 2094.5999755859375,
      "text": " Someone said this,"
    },
    {
      "id": 119,
      "start": 2094.5999755859375,
      "end": 2096.719970703125,
      "text": " never put a question mark"
    },
    {
      "id": 120,
      "start": 2096.719970703125,
      "end": 2099.999969482422,
      "text": " where God has put a period."
    },
    {
      "id": 121,
      "start": 2099.999969482422,
      "end": 2101.2799682617188,
      "text": " Never put a question mark"
    },
    {
      "id": 122,
      "start": 2101.2799682617188,
      "end": 2103.3999633789062,
      "text": " where God has put a period."
    },
    {
      "id": 123,
      "start": 2103.3999633789062,
      "end": 2105.3999633789062,
      "text": " But the problem sometimes in our life"
    },
    {
      "id": 124,
      "start": 2105.3999633789062,
      "end": 2108.0799865722656,
      "text": " is that we have doubts."
    },
    {
      "id": 125,
      "start": 2108.0799865722656,
      "end": 2109.5599670410156,
      "text": " How's this going to work?"
    },
    {
      "id": 126,
      "start": 2109.5599670410156,
      "end": 2111.0399780273438,
      "text": " What's going to happen?"
    },
    {
      "id": 127,
      "start": 2111.0399780273438,
      "end": 2112.679962158203,
      "text": " I can't see the way."
    },
    {
      "id": 128,
      "start": 2112.679962158203,
      "end": 2117.439971923828,
      "text": " But again, doubt is the enemy of faith."
    },
    {
      "id": 129,
      "start": 2117.439971923828,
      "end": 2120.0399780273438,
      "text": " And if we go forward in obedience"
    },
    {
      "id": 130,
      "start": 2120.0399780273438,
      "end": 2121.5199584960938,
      "text": " and by faith,"
    },
    {
      "id": 131,
      "start": 2121.5199584960938,
      "end": 2123.5999755859375,
      "text": " when we acknowledge that there's times"
    },
    {
      "id": 132,
      "start": 2123.5999755859375,
      "end": 2125.999969482422,
      "text": " in which we are hindered from going forward,"
    },
    {
      "id": 133,
      "start": 2125.999969482422,
      "end": 2128.0799865722656,
      "text": " that one of those hindrances to going forward"
    },
    {
      "id": 134,
      "start": 2128.0799865722656,
      "end": 2129.679962158203,
      "text": " is doubt."
    },
    {
      "id": 135,
      "start": 2129.679962158203,
      "end": 2132.239959716797,
      "text": " How's it going to work out?"
    },
    {
      "id": 136,
      "start": 2132.239959716797,
      "end": 2134.3599853515625,
      "text": " How's this going to work?"
    },
    {
      "id": 137,
      "start": 2134.3599853515625,
      "end": 2135.9599609375,
      "text": " Doubt."
    },
    {
      "id": 138,
      "start": 2135.9599609375,
      "end": 2141.0799865722656,
      "text": " God asked Moses in Numbers chapter 14,"
    },
    {
      "id": 139,
      "start": 2141.0799865722656,
      "end": 2142.199981689453,
      "text": " how long will it be,"
    },
    {
      "id": 140,
      "start": 2142.199981689453,
      "end": 2144.8799743652344,
      "text": " are my people believe me?"
    },
    {
      "id": 141,
      "start": 2144.8799743652344,
      "end": 2146.759979248047,
      "text": " You know, God wants us to have faith."
    },
    {
      "id": 142,
      "start": 2146.759979248047,
      "end": 2148.9199829101562,
      "text": " He wants us to live by faith."
    },
    {
      "id": 143,
      "start": 2148.9199829101562,
      "end": 2150.8799743652344,
      "text": " He doesn't want us to doubt Him."
    },
    {
      "id": 144,
      "start": 2150.8799743652344,
      "end": 2152.8799743652344,
      "text": " He wants us to trust Him."
    },
    {
      "id": 145,
      "start": 2152.8799743652344,
      "end": 2154.5599670410156,
      "text": " What hinders us from going forward?"
    },
    {
      "id": 146,
      "start": 2154.5599670410156,
      "end": 2157.3199768066406,
      "text": " Not only doubt, but I'd say this, fear."
    },
    {
      "id": 147,
      "start": 2157.3199768066406,
      "end": 2158.3599853515625,
      "text": " Fear."
    },
    {
      "id": 148,
      "start": 2158.3599853515625,
      "end": 2160.7999877929688,
      "text": " Fear of the unknown."
    },
    {
      "id": 149,
      "start": 2160.7999877929688,
      "end": 2164.8799743652344,
      "text": " Fear of failing."
    },
    {
      "id": 150,
      "start": 2164.8799743652344,
      "end": 2167.5599670410156,
      "text": " If I go forward, I might fail."
    },
    {
      "id": 151,
      "start": 2167.5599670410156,
      "end": 2169.1599731445312,
      "text": " Jesus never fails."
    },
    {
      "id": 152,
      "start": 2169.1599731445312,
      "end": 2170.8799743652344,
      "text": " If we know that we're going forward"
    },
    {
      "id": 153,
      "start": 2170.8799743652344,
      "end": 2172.7999877929688,
      "text": " at His command, at His direction,"
    },
    {
      "id": 154,
      "start": 2172.7999877929688,
      "end": 2174.5199584960938,
      "text": " at His instruction,"
    },
    {
      "id": 155,
      "start": 2174.5199584960938,
      "end": 2175.6399841308594,
      "text": " it's a matter of obedience,"
    },
    {
      "id": 156,
      "start": 2175.6399841308594,
      "end": 2177.9599609375,
      "text": " we need not to fear failure."
    },
    {
      "id": 157,
      "start": 2177.9599609375,
      "end": 2180.0399780273438,
      "text": " We need not to fear the uncertainties."
    },
    {
      "id": 158,
      "start": 2180.0399780273438,
      "end": 2182.3999633789062,
      "text": " We find that throughout the Word of God,"
    },
    {
      "id": 159,
      "start": 2182.3999633789062,
      "end": 2184.679962158203,
      "text": " we find over and over and over"
    },
    {
      "id": 160,
      "start": 2184.679962158203,
      "end": 2187.239959716797,
      "text": " this phrase, fear not."
    },
    {
      "id": 161,
      "start": 2187.239959716797,
      "end": 2189.3999633789062,
      "text": " Fear not."
    },
    {
      "id": 162,
      "start": 2189.3999633789062,
      "end": 2193.9199829101562,
      "text": " He's not given us a spirit of fear."
    },
    {
      "id": 163,
      "start": 2193.9199829101562,
      "end": 2196.0799865722656,
      "text": " He's not given us a spirit of fear,"
    },
    {
      "id": 164,
      "start": 2196.0799865722656,
      "end": 2199.1199645996094,
      "text": " but yet we find that one thing"
    },
    {
      "id": 165,
      "start": 2199.1199645996094,
      "end": 2201.2799682617188,
      "text": " that would hinder us from going forward"
    },
    {
      "id": 166,
      "start": 2201.2799682617188,
      "end": 2203.0399780273438,
      "text": " is fear."
    },
    {
      "id": 167,
      "start": 2203.0399780273438,
      "end": 2204.439971923828,
      "text": " I could say this, what hinders us"
    },
    {
      "id": 168,
      "start": 2204.439971923828,
      "end": 2205.719970703125,
      "text": " from going forward at times"
    },
    {
      "id": 169,
      "start": 2205.719970703125,
      "end": 2207.759979248047,
      "text": " is influence."
    },
    {
      "id": 170,
      "start": 2207.759979248047,
      "end": 2209.3599853515625,
      "text": " Influence."
    },
    {
      "id": 171,
      "start": 2209.3599853515625,
      "end": 2210.3599853515625,
      "text": " Who's influencing us?"
    },
    {
      "id": 172,
      "start": 2210.3599853515625,
      "end": 2211.5599670410156,
      "text": " Who are we going to listen to?"
    },
    {
      "id": 173,
      "start": 2211.5599670410156,
      "end": 2212.7999877929688,
      "text": " In the passage of Scripture"
    },
    {
      "id": 174,
      "start": 2212.7999877929688,
      "end": 2215.1599731445312,
      "text": " that we have here before us this morning"
    },
    {
      "id": 175,
      "start": 2215.1599731445312,
      "end": 2216.1599731445312,
      "text": " in Exodus 14,"
    },
    {
      "id": 176,
      "start": 2216.1599731445312,
      "end": 2218.3599853515625,
      "text": " we've already noted that the people spoke,"
    },
    {
      "id": 177,
      "start": 2218.3599853515625,
      "end": 2220.3199768066406,
      "text": " Moses spoke, and the Lord spoke."
    },
    {
      "id": 178,
      "start": 2220.3199768066406,
      "end": 2222.5199584960938,
      "text": " There are times in which we will listen"
    },
    {
      "id": 179,
      "start": 2222.5199584960938,
      "end": 2223.8799743652344,
      "text": " to the influence of others."
    },
    {
      "id": 180,
      "start": 2223.8799743652344,
      "end": 2225.439971923828,
      "text": " We'll listen to what other people say."
    },
    {
      "id": 181,
      "start": 2225.439971923828,
      "end": 2226.9599609375,
      "text": " It doesn't work anymore."
    },
    {
      "id": 182,
      "start": 2226.9599609375,
      "end": 2227.9199829101562,
      "text": " You can't do that."
    },
    {
      "id": 183,
      "start": 2227.9199829101562,
      "end": 2230.679962158203,
      "text": " You can't do this."
    },
    {
      "id": 184,
      "start": 2230.679962158203,
      "end": 2231.8399658203125,
      "text": " But if we're going forward"
    },
    {
      "id": 185,
      "start": 2231.8399658203125,
      "end": 2234.5599670410156,
      "text": " at the command of the Lord,"
    },
    {
      "id": 186,
      "start": 2234.5599670410156,
      "end": 2236.1199645996094,
      "text": " then we need not be influenced"
    },
    {
      "id": 187,
      "start": 2236.1199645996094,
      "end": 2237.5199584960938,
      "text": " by anybody else."
    },
    {
      "id": 188,
      "start": 2237.5199584960938,
      "end": 2239.1199645996094,
      "text": " Think about the nation of Israel."
    },
    {
      "id": 189,
      "start": 2239.1199645996094,
      "end": 2240.5999755859375,
      "text": " They had been given the instruction."
    },
    {
      "id": 190,
      "start": 2240.5999755859375,
      "end": 2241.759979248047,
      "text": " Of course, we understand that"
    },
    {
      "id": 191,
      "start": 2241.759979248047,
      "end": 2244.1599731445312,
      "text": " as we fast forward from this particular event"
    },
    {
      "id": 192,
      "start": 2244.1599731445312,
      "end": 2246.3999633789062,
      "text": " and this time in Israel's history"
    },
    {
      "id": 193,
      "start": 2246.3999633789062,
      "end": 2248.2799682617188,
      "text": " that they had the responsibility"
    },
    {
      "id": 194,
      "start": 2248.2799682617188,
      "end": 2249.5999755859375,
      "text": " of going into the land."
    },
    {
      "id": 195,
      "start": 2249.5999755859375,
      "end": 2250.8399658203125,
      "text": " It was there in Numbers 14"
    },
    {
      "id": 196,
      "start": 2250.8399658203125,
      "end": 2252.1599731445312,
      "text": " that I mentioned just a moment ago"
    },
    {
      "id": 197,
      "start": 2252.1599731445312,
      "end": 2253.2799682617188,
      "text": " when God said to Moses,"
    },
    {
      "id": 198,
      "start": 2253.2799682617188,
      "end": 2254.6399841308594,
      "text": " how long will it be"
    },
    {
      "id": 199,
      "start": 2254.6399841308594,
      "end": 2255.9599609375,
      "text": " ere my people believe them?"
    },
    {
      "id": 200,
      "start": 2255.9599609375,
      "end": 2257.199981689453,
      "text": " It's within the context"
    },
    {
      "id": 201,
      "start": 2257.199981689453,
      "end": 2259.439971923828,
      "text": " of the spies being sent out."
    },
    {
      "id": 202,
      "start": 2259.47998046875,
      "end": 2262.0399780273438,
      "text": " In chapters 13 and 14 of the book of Numbers,"
    },
    {
      "id": 203,
      "start": 2262.0399780273438,
      "end": 2264.6399841308594,
      "text": " God has Moses take 12 spies"
    },
    {
      "id": 204,
      "start": 2264.6399841308594,
      "end": 2266.1599731445312,
      "text": " and send them into the land"
    },
    {
      "id": 205,
      "start": 2266.1599731445312,
      "end": 2267.759979248047,
      "text": " to see what's there."
    },
    {
      "id": 206,
      "start": 2267.759979248047,
      "end": 2270.3999633789062,
      "text": " What the land is."
    },
    {
      "id": 207,
      "start": 2270.3999633789062,
      "end": 2272.3199768066406,
      "text": " To bring back a report."
    },
    {
      "id": 208,
      "start": 2272.3199768066406,
      "end": 2274.199981689453,
      "text": " And we know the account and we're familiar."
    },
    {
      "id": 209,
      "start": 2274.199981689453,
      "end": 2275.5599670410156,
      "text": " We sing songs with children"
    },
    {
      "id": 210,
      "start": 2275.5599670410156,
      "end": 2277.759979248047,
      "text": " about 12 men went to spy on Canaan,"
    },
    {
      "id": 211,
      "start": 2277.759979248047,
      "end": 2280.1199645996094,
      "text": " 10 were bad and 2 were good."
    },
    {
      "id": 212,
      "start": 2280.1199645996094,
      "end": 2282.1599731445312,
      "text": " And those 10 came back with an evil report."
    },
    {
      "id": 213,
      "start": 2282.1599731445312,
      "end": 2284.0799865722656,
      "text": " It was a report that was full of doubt"
    },
    {
      "id": 214,
      "start": 2284.0799865722656,
      "end": 2285.719970703125,
      "text": " and fear and uncertainty."
    },
    {
      "id": 215,
      "start": 2285.719970703125,
      "end": 2287.1599731445312,
      "text": " We be not able."
    },
    {
      "id": 216,
      "start": 2287.1599731445312,
      "end": 2288.679962158203,
      "text": " The people are too great for us."
    },
    {
      "id": 217,
      "start": 2288.679962158203,
      "end": 2292.719970703125,
      "text": " We have fortified walls."
    },
    {
      "id": 218,
      "start": 2292.719970703125,
      "end": 2294.999969482422,
      "text": " But Joshua and Caleb,"
    },
    {
      "id": 219,
      "start": 2294.999969482422,
      "end": 2298.8799743652344,
      "text": " they had a faith."
    },
    {
      "id": 220,
      "start": 2298.8799743652344,
      "end": 2301.199981689453,
      "text": " Yeah, they didn't deny the existence"
    },
    {
      "id": 221,
      "start": 2301.199981689453,
      "end": 2305.0399780273438,
      "text": " of the walled cities."
    },
    {
      "id": 222,
      "start": 2305.0399780273438,
      "end": 2306.439971923828,
      "text": " They didn't deny the existence"
    },
    {
      "id": 223,
      "start": 2306.439971923828,
      "end": 2308.239959716797,
      "text": " of the giants."
    },
    {
      "id": 224,
      "start": 2308.239959716797,
      "end": 2309.8799743652344,
      "text": " They didn't deny the existence"
    },
    {
      "id": 225,
      "start": 2309.8799743652344,
      "end": 2312.239959716797,
      "text": " of the difficulties and the obstacles,"
    },
    {
      "id": 226,
      "start": 2312.239959716797,
      "end": 2313.8399658203125,
      "text": " but what they understood"
    },
    {
      "id": 227,
      "start": 2313.8399658203125,
      "end": 2317.4400024414062,
      "text": " is that God told us to go into the land."
    },
    {
      "id": 228,
      "start": 2317.4400024414062,
      "end": 2319.1199951171875,
      "text": " And we're going by faith."
    },
    {
      "id": 229,
      "start": 2319.1199951171875,
      "end": 2321.0,
      "text": " We're going in obedience."
    },
    {
      "id": 230,
      "start": 2321.0,
      "end": 2323.7599487304688,
      "text": " And we're trusting that God will do"
    },
    {
      "id": 231,
      "start": 2323.7599487304688,
      "end": 2325.5999755859375,
      "text": " what only God can do."
    },
    {
      "id": 232,
      "start": 2325.5999755859375,
      "end": 2332.47998046875,
      "text": " If God is with us, we are able."
    },
    {
      "id": 233,
      "start": 2332.47998046875,
      "end": 2334.6399536132812,
      "text": " But the influence of those 10 spies"
    },
    {
      "id": 234,
      "start": 2334.6399536132812,
      "end": 2338.0399780273438,
      "text": " was great, was it not?"
    },
    {
      "id": 235,
      "start": 2338.0399780273438,
      "end": 2340.0799560546875,
      "text": " What did the entire congregation want to do?"
    },
    {
      "id": 236,
      "start": 2340.0799560546875,
      "end": 2341.6799926757812,
      "text": " Well, first of all, they were going to"
    },
    {
      "id": 237,
      "start": 2341.6799926757812,
      "end": 2344.47998046875,
      "text": " stone Joshua and Caleb."
    },
    {
      "id": 238,
      "start": 2344.47998046875,
      "end": 2346.0799560546875,
      "text": " But they were going to make themselves captains"
    },
    {
      "id": 239,
      "start": 2346.1199951171875,
      "end": 2349.1199951171875,
      "text": " and go back to Egypt."
    },
    {
      "id": 240,
      "start": 2349.1199951171875,
      "end": 2350.5199584960938,
      "text": " It wasn't the only time, by the way,"
    },
    {
      "id": 241,
      "start": 2350.5199584960938,
      "end": 2352.3999633789062,
      "text": " that they murmured and complained"
    },
    {
      "id": 242,
      "start": 2352.3999633789062,
      "end": 2357.0399780273438,
      "text": " and thought about going back to Egypt."
    },
    {
      "id": 243,
      "start": 2357.0399780273438,
      "end": 2358.8399658203125,
      "text": " The influence."
    },
    {
      "id": 244,
      "start": 2358.8399658203125,
      "end": 2362.2799682617188,
      "text": " God says go forward."
    },
    {
      "id": 245,
      "start": 2362.2799682617188,
      "end": 2364.0399780273438,
      "text": " What hinders us from going forward?"
    },
    {
      "id": 246,
      "start": 2364.0399780273438,
      "end": 2366.199951171875,
      "text": " Doubt and fear and influence,"
    },
    {
      "id": 247,
      "start": 2366.199951171875,
      "end": 2371.9599609375,
      "text": " uncertainty, obstacles."
    },
    {
      "id": 248,
      "start": 2371.9599609375,
      "end": 2373.47998046875,
      "text": " But let me ask this final question"
    },
    {
      "id": 249,
      "start": 2373.8799438476562,
      "end": 2376.0399780273438,
      "text": " as we conclude our message."
    },
    {
      "id": 250,
      "start": 2376.0399780273438,
      "end": 2379.3599853515625,
      "text": " What happens when we go forward?"
    },
    {
      "id": 251,
      "start": 2379.3599853515625,
      "end": 2380.5999755859375,
      "text": " Why do we go forward?"
    },
    {
      "id": 252,
      "start": 2380.5999755859375,
      "end": 2382.3999633789062,
      "text": " We go forward because of obedience."
    },
    {
      "id": 253,
      "start": 2382.3999633789062,
      "end": 2384.0399780273438,
      "text": " It's a matter of obedience."
    },
    {
      "id": 254,
      "start": 2384.0399780273438,
      "end": 2387.8799438476562,
      "text": " We go forward because God said go forward."
    },
    {
      "id": 255,
      "start": 2387.8799438476562,
      "end": 2388.8799438476562,
      "text": " How do we go forward?"
    },
    {
      "id": 256,
      "start": 2388.8799438476562,
      "end": 2390.8799438476562,
      "text": " We go forward by faith."
    },
    {
      "id": 257,
      "start": 2390.8799438476562,
      "end": 2392.47998046875,
      "text": " Believing that God will do"
    },
    {
      "id": 258,
      "start": 2392.47998046875,
      "end": 2394.5599975585938,
      "text": " what only God can do."
    },
    {
      "id": 259,
      "start": 2394.5599975585938,
      "end": 2397.2799682617188,
      "text": " Moses could not part that Red Sea."
    },
    {
      "id": 260,
      "start": 2397.2799682617188,
      "end": 2400.0,
      "text": " The children of Israel could not part that Red Sea."
    },
    {
      "id": 261,
      "start": 2400.0,
      "end": 2401.719970703125,
      "text": " There was nothing within their power"
    },
    {
      "id": 0,
      "start": 2401.719970703125,
      "end": 2411.0799703598022,
      "text": " to provide them safe passage across that Red Sea, but God could. How? By faith."
    },
    {
      "id": 1,
      "start": 2411.0799703598022,
      "end": 2414.679970741272,
      "text": " What hinders? No doubt there are many things that could hinder the children of"
    },
    {
      "id": 2,
      "start": 2414.679970741272,
      "end": 2419.1599712371826,
      "text": " Israel from going forward. In their history, as we've made note just a moment"
    },
    {
      "id": 3,
      "start": 2419.1599712371826,
      "end": 2423.639970779419,
      "text": " ago, there are many times in which they were hindered from going forward because"
    },
    {
      "id": 4,
      "start": 2423.639970779419,
      "end": 2429.039970397949,
      "text": " of a variety of things. But what happens when we go forward? Well, go back to"
    },
    {
      "id": 5,
      "start": 2429.039970397949,
      "end": 2435.119972229004,
      "text": " Exodus 14. We find the instruction from God in verses 15 and 16 that they're to"
    },
    {
      "id": 6,
      "start": 2435.119972229004,
      "end": 2440.039970397949,
      "text": " go forward. I want you to skip down, if you will, in verse number 21. It says this,"
    },
    {
      "id": 7,
      "start": 2440.039970397949,
      "end": 2446.2399711608887,
      "text": " And Moses stretched out his hand over the sea. And that was at the direction of"
    },
    {
      "id": 8,
      "start": 2446.2399711608887,
      "end": 2450.399971008301,
      "text": " God. In verse 16, he says, Lift thou up thy rod and stretch out thine hand over"
    },
    {
      "id": 9,
      "start": 2450.399971008301,
      "end": 2455.0799713134766,
      "text": " the sea. And it says in verse 21 that Moses stretched out his hand over the"
    },
    {
      "id": 10,
      "start": 2455.0799713134766,
      "end": 2460.7599716186523,
      "text": " sea. Notice what the Bible says, And the Lord caused the sea to go back by a"
    },
    {
      "id": 11,
      "start": 2460.7599716186523,
      "end": 2468.8799743652344,
      "text": " strong east wind all that night and made the sea dry land and the waters were"
    },
    {
      "id": 12,
      "start": 2468.8799743652344,
      "end": 2476.4599685668945,
      "text": " divided. All that night, God caused that strong east wind to come and he made the"
    },
    {
      "id": 13,
      "start": 2476.4599685668945,
      "end": 2482.4799728393555,
      "text": " sea dry land and the waters were divided. Man, don't you wish"
    },
    {
      "id": 14,
      "start": 2482.4799728393555,
      "end": 2487.6399688720703,
      "text": " you could have seen this? I mean, what miracle, what power of God that's"
    },
    {
      "id": 15,
      "start": 2487.6399688720703,
      "end": 2494.039970397949,
      "text": " displayed. And we find that Moses acted in obedience. He took what God told"
    },
    {
      "id": 16,
      "start": 2494.039970397949,
      "end": 2500.039970397949,
      "text": " him to do and he obeyed God. He had seen God work in his life. The plagues"
    },
    {
      "id": 17,
      "start": 2500.039970397949,
      "end": 2506.3599700927734,
      "text": " have already taken place and Moses had seen God work. He had experienced the"
    },
    {
      "id": 18,
      "start": 2506.3599700927734,
      "end": 2511.7599716186523,
      "text": " power of God and he holds out that rod at the command of God. And the Bible says"
    },
    {
      "id": 19,
      "start": 2511.999969482422,
      "end": 2517.1599731445312,
      "text": " that God moved and God worked. And the Bible tells us in verse number 22, notice"
    },
    {
      "id": 20,
      "start": 2517.1599731445312,
      "end": 2525.6799697875977,
      "text": " what it says, And the children of Israel went into the midst of the sea upon the"
    },
    {
      "id": 21,
      "start": 2525.6799697875977,
      "end": 2533.6399688720703,
      "text": " dry ground. You know what they did? They went forward. They went forward. God said"
    },
    {
      "id": 22,
      "start": 2533.6399688720703,
      "end": 2539.519973754883,
      "text": " in verse number 15, Go forward. In verse number 22, the Bible says, And the"
    },
    {
      "id": 23,
      "start": 2539.519973754883,
      "end": 2547.6399688720703,
      "text": " children of Israel went into the midst of the sea upon the dry ground. Notice"
    },
    {
      "id": 24,
      "start": 2547.6399688720703,
      "end": 2552.1199645996094,
      "text": " the Bible says, And the waters were a wall unto them on their right hand and"
    },
    {
      "id": 25,
      "start": 2552.1199645996094,
      "end": 2559.7999725341797,
      "text": " on their left. This isn't just a group of like 12 or 70 people. It's a large host"
    },
    {
      "id": 26,
      "start": 2559.7999725341797,
      "end": 2566.0799713134766,
      "text": " of people that are crossing over, perhaps as many as a couple million, and they're"
    },
    {
      "id": 27,
      "start": 2566.0799713134766,
      "end": 2570.959976196289,
      "text": " crossing over the Red Sea on dry ground. And the Bible says that there was a wall,"
    },
    {
      "id": 28,
      "start": 2570.959976196289,
      "end": 2575.439971923828,
      "text": " the waters were a wall unto them on their right hand and on their left. Can"
    },
    {
      "id": 29,
      "start": 2575.439971923828,
      "end": 2582.3599700927734,
      "text": " you imagine crossing over on dry ground? Man, this is miraculous. This is exciting."
    },
    {
      "id": 30,
      "start": 2582.3599700927734,
      "end": 2587.719970703125,
      "text": " What happens when we go forward? We get to see what God can do when we go"
    },
    {
      "id": 31,
      "start": 2587.719970703125,
      "end": 2592.719970703125,
      "text": " forward. They just sit there and say, Well, Moses, I understand God said to go"
    },
    {
      "id": 32,
      "start": 2592.759963989258,
      "end": 2596.1199645996094,
      "text": " forward, but really, if you look at the situation, there's nowhere to go forward."
    },
    {
      "id": 33,
      "start": 2596.1199645996094,
      "end": 2599.3999633789062,
      "text": " We're just going to hunker down here and we're going to hope for the best. We're"
    },
    {
      "id": 34,
      "start": 2599.3999633789062,
      "end": 2605.0799713134766,
      "text": " going to hope that... God said, Go forward. And in verse number 22, the Bible tells"
    },
    {
      "id": 35,
      "start": 2605.0799713134766,
      "end": 2611.519973754883,
      "text": " us that they went into, they go forward, they went into the midst of the sea upon"
    },
    {
      "id": 36,
      "start": 2611.519973754883,
      "end": 2623.239974975586,
      "text": " the dry ground. Man, how exciting to see what God can do. The Egyptians were not told"
    },
    {
      "id": 37,
      "start": 2623.239974975586,
      "end": 2632.7799682617188,
      "text": " to go forward, but they did. They looked at the situation and they said, Well, look, man,"
    },
    {
      "id": 38,
      "start": 2632.7799682617188,
      "end": 2636.679977416992,
      "text": " if they all crossed over on dry ground and they got to the other side, let us pursue"
    },
    {
      "id": 39,
      "start": 2636.679977416992,
      "end": 2644.8399658203125,
      "text": " after them. Verse 23 tells us the Egyptians pursued and went in after them to the midst"
    },
    {
      "id": 40,
      "start": 2644.8399658203125,
      "end": 2650.239974975586,
      "text": " of the sea. Even all Pharaoh's horses, his chariots and his horsemen, they didn't have"
    },
    {
      "id": 41,
      "start": 2650.239974975586,
      "end": 2654.679977416992,
      "text": " the same command that God had given the children of Israel. And it didn't work out as good"
    },
    {
      "id": 42,
      "start": 2654.679977416992,
      "end": 2660.239959716797,
      "text": " for them as it did for the children of Israel. Because when they got in the midst of the"
    },
    {
      "id": 43,
      "start": 2660.239959716797,
      "end": 2667.719970703125,
      "text": " Red Sea, God caused their chariot wheels to fall off. They draved them heavily. And"
    },
    {
      "id": 44,
      "start": 2667.719970703125,
      "end": 2674.719970703125,
      "text": " then God told Moses to raise up his rod and he, God, caused the sea to return. And the"
    },
    {
      "id": 45,
      "start": 2674.719970703125,
      "end": 2682.5999755859375,
      "text": " Egyptians were destroyed. The people of God at the command of God by inobedience and by"
    },
    {
      "id": 46,
      "start": 2682.5999755859375,
      "end": 2687.8799743652344,
      "text": " faith, not being hindered by all of those things that could hinder them, what happens"
    },
    {
      "id": 47,
      "start": 2687.8799743652344,
      "end": 2693.47998046875,
      "text": " is they get to see God work. They get to see God move and work. It tells us in verse"
    },
    {
      "id": 48,
      "start": 2693.47998046875,
      "end": 2702.47998046875,
      "text": " number 29, But the children of Israel walked upon dry land in the midst of the sea, and"
    },
    {
      "id": 49,
      "start": 2702.47998046875,
      "end": 2707.3999633789062,
      "text": " the waters were a wall unto them on their right hand and on their left. Thus the Lord"
    },
    {
      "id": 50,
      "start": 2707.3999633789062,
      "end": 2714.679962158203,
      "text": " saved Israel that day out of the hand of the Egyptians. Man, they walked on dry land. You"
    },
    {
      "id": 51,
      "start": 2714.679962158203,
      "end": 2722.1599731445312,
      "text": " think they talked about this? Of course they talked about this. The Scriptures speak much."
    },
    {
      "id": 52,
      "start": 2722.1599731445312,
      "end": 2726.6399841308594,
      "text": " I mentioned already by way of introduction that this event, the crossing of the Red Sea,"
    },
    {
      "id": 53,
      "start": 2726.6399841308594,
      "end": 2732.759979248047,
      "text": " is often spoke of within the Word of God. The Psalms very regularly reference the crossing"
    },
    {
      "id": 54,
      "start": 2732.759979248047,
      "end": 2738.9599609375,
      "text": " of the Red Sea. In chapter number 15, here in Exodus, you see the song of Moses and the"
    },
    {
      "id": 55,
      "start": 2738.9599609375,
      "end": 2745.8399658203125,
      "text": " deliverance and how they're rejoicing and how they're just amazed at what God has done."
    },
    {
      "id": 56,
      "start": 2745.8399658203125,
      "end": 2755.679962158203,
      "text": " It's miraculous. What happens when we go forward? We get to see God work. We get to see God"
    },
    {
      "id": 57,
      "start": 2755.679962158203,
      "end": 2763.439971923828,
      "text": " work. The psalmist said in Psalm 119, It is time, O Lord, for thee to work. You see God"
    },
    {
      "id": 58,
      "start": 2763.439971923828,
      "end": 2771.47998046875,
      "text": " work. And when is it that we see God work? When we go forward in obedience by faith."
    },
    {
      "id": 59,
      "start": 2771.47998046875,
      "end": 2775.999969482422,
      "text": " I would say this, what happens when we go forward, not only do we get to see God work,"
    },
    {
      "id": 60,
      "start": 2775.999969482422,
      "end": 2782.7999572753906,
      "text": " but I would say that we have our faith increased. Our faith is increased as we go forward. Yes,"
    },
    {
      "id": 61,
      "start": 2782.7999572753906,
      "end": 2787.6599731445312,
      "text": " because we see God work, but let me say this, and we're actually going to look at an example"
    },
    {
      "id": 62,
      "start": 2787.6599731445312,
      "end": 2791.97998046875,
      "text": " of this this evening. I hope that you tune in again tonight as we look at an example"
    },
    {
      "id": 63,
      "start": 2791.97998046875,
      "end": 2798.3399658203125,
      "text": " of this very truth in Exodus chapter number 17. But I want to say this, what happens when"
    },
    {
      "id": 64,
      "start": 2798.3399658203125,
      "end": 2805.219970703125,
      "text": " we go forward, there's this idea, and it's really a false idea, that if we go forward"
    },
    {
      "id": 65,
      "start": 2805.219970703125,
      "end": 2810.8199768066406,
      "text": " in obedience and by faith that everything's just going to be perfect. It doesn't work"
    },
    {
      "id": 66,
      "start": 2810.8199768066406,
      "end": 2821.259979248047,
      "text": " that way. You know why? Oftentimes, our faith is increased through obstacles and difficulties."
    },
    {
      "id": 67,
      "start": 2821.259979248047,
      "end": 2827.0599670410156,
      "text": " It's the obstacles and the difficulties when we go forward that actually result in our"
    },
    {
      "id": 68,
      "start": 2827.0599670410156,
      "end": 2834.2999572753906,
      "text": " faith being increased. In chapter 15, at the end of the chapter, as they are crossed over"
    },
    {
      "id": 69,
      "start": 2834.2999572753906,
      "end": 2839.0199584960938,
      "text": " and they've seen the victory, they've seen the hand of God work, they say, Who is like"
    },
    {
      "id": 70,
      "start": 2839.0199584960938,
      "end": 2843.8599853515625,
      "text": " unto thee, O Lord, among the gods? Who is like thee, glorious in holiness, fearful in"
    },
    {
      "id": 71,
      "start": 2843.8599853515625,
      "end": 2849.97998046875,
      "text": " praises, doing wonders? I mean, they're rejoicing, and then you come to the end and there's not"
    },
    {
      "id": 72,
      "start": 2849.97998046875,
      "end": 2861.939971923828,
      "text": " water that's drinkable. It's bitter water. It's an obstacle. We came here at your command."
    },
    {
      "id": 73,
      "start": 2861.939971923828,
      "end": 2869.259979248047,
      "text": " Unfortunately, they responded off in how we respond to obstacles, in disbelief and in"
    },
    {
      "id": 74,
      "start": 2869.259979248047,
      "end": 2877.8999633789062,
      "text": " doubt and in uncertainty and regret. Why are we here? We're going to die. But that obstacle"
    },
    {
      "id": 75,
      "start": 2877.8999633789062,
      "end": 2884.8199768066406,
      "text": " in chapter number 15, at the end, the first trial after their deliverance, we find that"
    },
    {
      "id": 76,
      "start": 2884.8199768066406,
      "end": 2892.1399841308594,
      "text": " those waters were bitter, and God healed those waters. God healed those waters, and they"
    },
    {
      "id": 77,
      "start": 2892.1399841308594,
      "end": 2898.939971923828,
      "text": " were sustained. It's interesting to me that you read in chapter number 16, the entirety"
    },
    {
      "id": 78,
      "start": 2898.939971923828,
      "end": 2907.4599609375,
      "text": " of the chapter deals with the manna. How did the chapter begin? Well, it begins with"
    },
    {
      "id": 79,
      "start": 2907.4599609375,
      "end": 2913.97998046875,
      "text": " murmuring and complaining because there's no food, because they're hungry. The obstacle"
    },
    {
      "id": 80,
      "start": 2913.97998046875,
      "end": 2920.6199951171875,
      "text": " turned to a great faith builder, where God says through Moses, the instruction is given"
    },
    {
      "id": 81,
      "start": 2920.6199951171875,
      "end": 2924.6799926757812,
      "text": " with regard to going out and gathering the manna, and I would submit to you that day"
    },
    {
      "id": 82,
      "start": 2924.6799926757812,
      "end": 2932.3999633789062,
      "text": " by day as they would go out and they would get that manna, that that was a faith builder."
    },
    {
      "id": 83,
      "start": 2932.3999633789062,
      "end": 2937.9199829101562,
      "text": " I preached a message from this passage a couple of years ago on a Wednesday evening from Exodus"
    },
    {
      "id": 84,
      "start": 2937.9199829101562,
      "end": 2944.1599731445312,
      "text": " 16, and I titled it this way, Would You Have Passed the Test? Would You Have Passed the"
    },
    {
      "id": 85,
      "start": 2944.1599731445312,
      "end": 2951.43994140625,
      "text": " Test? Because just as some of them gathered more than they were supposed to, I would submit"
    },
    {
      "id": 86,
      "start": 2951.43994140625,
      "end": 2957.1599731445312,
      "text": " to you that in 2021, some of us would gather more than we were supposed to as well, because"
    },
    {
      "id": 87,
      "start": 2957.1599731445312,
      "end": 2961.719970703125,
      "text": " we wouldn't have faith that it'd be there tomorrow. And what happened? It bred worms"
    },
    {
      "id": 88,
      "start": 2961.719970703125,
      "end": 2970.9599609375,
      "text": " and it stank. And so then, when they're supposed to gather twice as much on the sixth day,"
    },
    {
      "id": 89,
      "start": 2970.9599609375,
      "end": 2975.9199829101562,
      "text": " they decided that they'd only take enough for that day because it bred worms and stank,"
    },
    {
      "id": 90,
      "start": 2975.9199829101562,
      "end": 2981.5199584960938,
      "text": " and so therefore I need to get it fresh tomorrow, and they did not find it tomorrow, because"
    },
    {
      "id": 91,
      "start": 2981.5199584960938,
      "end": 2990.6799926757812,
      "text": " God said gather twice as much on that sixth day. And what happened? It stayed, and it"
    },
    {
      "id": 92,
      "start": 2990.6799926757812,
      "end": 2996.719970703125,
      "text": " was good for them. They could eat it. It was a faith builder. It was an obstacle. See,"
    },
    {
      "id": 93,
      "start": 2996.719970703125,
      "end": 3001.5999755859375,
      "text": " what happens when we go forward, there's this idea that exists amongst humans that if we"
    },
    {
      "id": 0,
      "start": 3001.5999755859375,
      "end": 3004.7399756908417,
      "text": " go forward in obedience and by faith,"
    },
    {
      "id": 1,
      "start": 3004.7399756908417,
      "end": 3007.5199756622314,
      "text": " that that just means everything's gonna be blissful"
    },
    {
      "id": 2,
      "start": 3007.5199756622314,
      "end": 3009.9599752426147,
      "text": " and perfect and we're never gonna have a problem"
    },
    {
      "id": 3,
      "start": 3009.9599752426147,
      "end": 3012.7599754333496,
      "text": " and everything's just gonna be wonderful."
    },
    {
      "id": 4,
      "start": 3014.3199758529663,
      "end": 3018.579975128174,
      "text": " And when an obstacle comes, when a difficulty arises,"
    },
    {
      "id": 5,
      "start": 3018.579975128174,
      "end": 3021.139976501465,
      "text": " we all of a sudden begin to second guess"
    },
    {
      "id": 6,
      "start": 3021.139976501465,
      "end": 3022.819974899292,
      "text": " why we're where we are."
    },
    {
      "id": 7,
      "start": 3027.239974975586,
      "end": 3030.55997467041,
      "text": " But we find that throughout the Scriptures"
    },
    {
      "id": 8,
      "start": 3030.55997467041,
      "end": 3032.9199752807617,
      "text": " and even here in this passage that we're dealing with"
    },
    {
      "id": 9,
      "start": 3032.9199752807617,
      "end": 3036.55997467041,
      "text": " this morning in Exodus 14 when he says go forward,"
    },
    {
      "id": 10,
      "start": 3036.55997467041,
      "end": 3038.1999740600586,
      "text": " that their faith would be increased"
    },
    {
      "id": 11,
      "start": 3038.1999740600586,
      "end": 3040.55997467041,
      "text": " and it would be increased often"
    },
    {
      "id": 12,
      "start": 3040.55997467041,
      "end": 3042.6599769592285,
      "text": " through obstacles and difficulties."
    },
    {
      "id": 13,
      "start": 3045.119976043701,
      "end": 3047.139976501465,
      "text": " Through obstacles and difficulties."
    },
    {
      "id": 14,
      "start": 3047.139976501465,
      "end": 3049.799976348877,
      "text": " I'm thankful this morning that as we go forward"
    },
    {
      "id": 15,
      "start": 3049.799976348877,
      "end": 3051.9199752807617,
      "text": " we get to see God work."
    },
    {
      "id": 16,
      "start": 3051.9199752807617,
      "end": 3054.079975128174,
      "text": " I'm thankful this morning that as we go forward"
    },
    {
      "id": 17,
      "start": 3054.079975128174,
      "end": 3056.679977416992,
      "text": " that he increases our faith."
    },
    {
      "id": 18,
      "start": 3056.679977416992,
      "end": 3058.2799758911133,
      "text": " And often he increases our faith"
    },
    {
      "id": 19,
      "start": 3058.2799758911133,
      "end": 3060.55997467041,
      "text": " through difficulties and obstacles."
    },
    {
      "id": 20,
      "start": 3060.55997467041,
      "end": 3062.9999771118164,
      "text": " And so as we look at this passage of Scripture"
    },
    {
      "id": 21,
      "start": 3062.9999771118164,
      "end": 3065.679977416992,
      "text": " in Exodus 14 and we make some parallels"
    },
    {
      "id": 22,
      "start": 3065.679977416992,
      "end": 3067.4799728393555,
      "text": " to the New Testament believer,"
    },
    {
      "id": 23,
      "start": 3067.4799728393555,
      "end": 3069.439971923828,
      "text": " I would say to you this morning,"
    },
    {
      "id": 24,
      "start": 3069.439971923828,
      "end": 3072.1599731445312,
      "text": " let's determine to live by faith and go forward."
    },
    {
      "id": 25,
      "start": 3072.9999771118164,
      "end": 3074.2799758911133,
      "text": " We can't stay here."
    },
    {
      "id": 26,
      "start": 3074.2799758911133,
      "end": 3075.4999771118164,
      "text": " We can't go back."
    },
    {
      "id": 27,
      "start": 3075.4999771118164,
      "end": 3077.119972229004,
      "text": " We must go forward."
    },
    {
      "id": 28,
      "start": 3077.119972229004,
      "end": 3078.439971923828,
      "text": " We must go forward."
    },
    {
      "id": 29,
      "start": 3079.3999786376953,
      "end": 3081.2999725341797,
      "text": " And why do we go forward?"
    },
    {
      "id": 30,
      "start": 3082.359977722168,
      "end": 3084.1599731445312,
      "text": " Because we've been commanded to."
    },
    {
      "id": 31,
      "start": 3084.1599731445312,
      "end": 3085.9999771118164,
      "text": " We go forward in obedience."
    },
    {
      "id": 32,
      "start": 3086.7199783325195,
      "end": 3090.639976501465,
      "text": " Go and preach the gospel to every creature."
    },
    {
      "id": 33,
      "start": 3090.639976501465,
      "end": 3092.519973754883,
      "text": " The marching orders of the church."
    },
    {
      "id": 34,
      "start": 3093.439971923828,
      "end": 3094.8799743652344,
      "text": " It's our responsibility."
    },
    {
      "id": 35,
      "start": 3094.8799743652344,
      "end": 3095.7199783325195,
      "text": " How?"
    },
    {
      "id": 36,
      "start": 3095.7199783325195,
      "end": 3097.4999771118164,
      "text": " How do we go forward?"
    },
    {
      "id": 37,
      "start": 3097.4999771118164,
      "end": 3098.359977722168,
      "text": " Not by sight."
    },
    {
      "id": 38,
      "start": 3098.359977722168,
      "end": 3099.859977722168,
      "text": " We go forward by faith."
    },
    {
      "id": 39,
      "start": 3100.759979248047,
      "end": 3102.119972229004,
      "text": " Believing that God will work."
    },
    {
      "id": 40,
      "start": 3102.119972229004,
      "end": 3105.639976501465,
      "text": " Believing that God will do what only God can do."
    },
    {
      "id": 41,
      "start": 3105.639976501465,
      "end": 3110.639976501465,
      "text": " That yes, he'll use us as co-laborers with God."
    },
    {
      "id": 42,
      "start": 3111.3199768066406,
      "end": 3114.079978942871,
      "text": " And what a blessing it is to be a co-laborer with God."
    },
    {
      "id": 43,
      "start": 3115.079978942871,
      "end": 3117.8799743652344,
      "text": " Let us be aware that there are some things"
    },
    {
      "id": 44,
      "start": 3117.8799743652344,
      "end": 3120.1599731445312,
      "text": " that will hinder us from going forward."
    },
    {
      "id": 45,
      "start": 3120.1599731445312,
      "end": 3121.55997467041,
      "text": " No doubt."
    },
    {
      "id": 46,
      "start": 3121.55997467041,
      "end": 3123.7999725341797,
      "text": " There are hindrances to going forward."
    },
    {
      "id": 47,
      "start": 3125.05997467041,
      "end": 3126.119972229004,
      "text": " There are obstacles."
    },
    {
      "id": 48,
      "start": 3126.119972229004,
      "end": 3128.339973449707,
      "text": " There are voices, influences."
    },
    {
      "id": 49,
      "start": 3128.339973449707,
      "end": 3129.179977416992,
      "text": " There's doubt."
    },
    {
      "id": 50,
      "start": 3129.179977416992,
      "end": 3129.999969482422,
      "text": " There's fear."
    },
    {
      "id": 51,
      "start": 3129.999969482422,
      "end": 3132.0399780273438,
      "text": " There's all sorts of things that would hinder us"
    },
    {
      "id": 52,
      "start": 3132.0399780273438,
      "end": 3133.0399780273438,
      "text": " from going forward."
    },
    {
      "id": 53,
      "start": 3133.0399780273438,
      "end": 3136.679977416992,
      "text": " But let us focus upon what happens when we go forward"
    },
    {
      "id": 54,
      "start": 3136.679977416992,
      "end": 3138.519973754883,
      "text": " is that we get to see God work."
    },
    {
      "id": 55,
      "start": 3139.3999786376953,
      "end": 3143.3399810791016,
      "text": " They obeyed God and they walked on dry ground."
    },
    {
      "id": 56,
      "start": 3144.439971923828,
      "end": 3146.5999755859375,
      "text": " And they got to the other side."
    },
    {
      "id": 57,
      "start": 3146.5999755859375,
      "end": 3147.519973754883,
      "text": " What a blessing."
    },
    {
      "id": 58,
      "start": 3148.719970703125,
      "end": 3149.8199768066406,
      "text": " God said,"
    },
    {
      "id": 59,
      "start": 3151.199981689453,
      "end": 3156.199981689453,
      "text": " speak unto the children of Israel that they go forward."
    },
    {
      "id": 60,
      "start": 3156.9199829101562,
      "end": 3159.759979248047,
      "text": " This morning, we need to go forward."
    },
    {
      "id": 61,
      "start": 3159.759979248047,
      "end": 3160.5799713134766,
      "text": " Let's pray together."
    },
    {
      "id": 62,
      "start": 3160.5799713134766,
      "end": 3161.719970703125,
      "text": " Father, we love you."
    },
    {
      "id": 63,
      "start": 3163.0399780273438,
      "end": 3165.1599731445312,
      "text": " We thank you for loving us."
    },
    {
      "id": 64,
      "start": 3165.1599731445312,
      "end": 3167.5599822998047,
      "text": " We thank you for the opportunity to study your word."
    },
    {
      "id": 65,
      "start": 3167.5599822998047,
      "end": 3169.3199768066406,
      "text": " And we thank you for the passage of scripture"
    },
    {
      "id": 66,
      "start": 3169.3199768066406,
      "end": 3170.1599731445312,
      "text": " that is before us."
    },
    {
      "id": 67,
      "start": 3170.1599731445312,
      "end": 3173.5599822998047,
      "text": " Again, a familiar passage of scripture in Exodus 14"
    },
    {
      "id": 68,
      "start": 3174.0399780273438,
      "end": 3177.199981689453,
      "text": " in dealing with this event that is so well known to us,"
    },
    {
      "id": 69,
      "start": 3177.199981689453,
      "end": 3180.7999725341797,
      "text": " the crossing, the miraculous crossing of the Red Sea."
    },
    {
      "id": 70,
      "start": 3180.7999725341797,
      "end": 3183.0399780273438,
      "text": " We thank you for how you worked and moved"
    },
    {
      "id": 71,
      "start": 3183.0399780273438,
      "end": 3187.719970703125,
      "text": " and how you gave direction and how you provided a way."
    },
    {
      "id": 72,
      "start": 3188.8399810791016,
      "end": 3190.239974975586,
      "text": " We thank you for your deliverance"
    },
    {
      "id": 73,
      "start": 3190.239974975586,
      "end": 3191.7999725341797,
      "text": " that is seen for the children of Israel"
    },
    {
      "id": 74,
      "start": 3191.7999725341797,
      "end": 3193.699981689453,
      "text": " here in this passage of scripture."
    },
    {
      "id": 75,
      "start": 3196.1599731445312,
      "end": 3198.999969482422,
      "text": " As we make application for our lives today,"
    },
    {
      "id": 76,
      "start": 3199.999969482422,
      "end": 3204.0799713134766,
      "text": " as we close 2021, this last Sunday of the year,"
    },
    {
      "id": 77,
      "start": 3205.239974975586,
      "end": 3208.0399780273438,
      "text": " God, I pray that you'd help us to go forward."
    },
    {
      "id": 78,
      "start": 3210.3199768066406,
      "end": 3213.7999725341797,
      "text": " Help us to understand that it's a matter of obedience."
    },
    {
      "id": 79,
      "start": 3213.7999725341797,
      "end": 3216.8799743652344,
      "text": " Help us to understand that we must go forward in faith."
    },
    {
      "id": 80,
      "start": 3219.3999786376953,
      "end": 3220.999969482422,
      "text": " Help us not to be hindered."
    },
    {
      "id": 81,
      "start": 3223.999969482422,
      "end": 3225.199981689453,
      "text": " God, we wanna see you work."
    },
    {
      "id": 82,
      "start": 3225.199981689453,
      "end": 3227.1199798583984,
      "text": " We long to see you work."
    },
    {
      "id": 83,
      "start": 3229.519973754883,
      "end": 3232.8799743652344,
      "text": " We know that you're able to do exceeding abundantly"
    },
    {
      "id": 84,
      "start": 3232.8799743652344,
      "end": 3234.959976196289,
      "text": " above all that we ask or think."
    },
    {
      "id": 85,
      "start": 3234.959976196289,
      "end": 3238.2799682617188,
      "text": " We thank you for the ways in which we have seen you work"
    },
    {
      "id": 86,
      "start": 3238.2799682617188,
      "end": 3241.9199829101562,
      "text": " in our midst, even in this past year,"
    },
    {
      "id": 87,
      "start": 3241.9199829101562,
      "end": 3244.8399810791016,
      "text": " in our lives personally, in our church corporately,"
    },
    {
      "id": 88,
      "start": 3245.8399810791016,
      "end": 3247.679977416992,
      "text": " how we praise thee and how we thank thee"
    },
    {
      "id": 89,
      "start": 3247.679977416992,
      "end": 3248.8999786376953,
      "text": " for what you've done."
    },
    {
      "id": 90,
      "start": 3251.3999786376953,
      "end": 3254.739974975586,
      "text": " But God, we must go forward at your command,"
    },
    {
      "id": 91,
      "start": 3254.739974975586,
      "end": 3256.3999786376953,
      "text": " at your instruction."
    },
    {
      "id": 92,
      "start": 3256.3999786376953,
      "end": 3258.219970703125,
      "text": " And I pray that you'd help us."
    },
    {
      "id": 93,
      "start": 3259.9199829101562,
      "end": 3261.2799682617188,
      "text": " Onward, forward."
    },
    {
      "id": 94,
      "start": 3264.8799743652344,
      "end": 3265.8799743652344,
      "text": " Would you help us, Lord?"
    },
    {
      "id": 95,
      "start": 3265.8799743652344,
      "end": 3267.47998046875,
      "text": " Move and work as only you can."
    },
    {
      "id": 96,
      "start": 3267.47998046875,
      "end": 3269.679962158203,
      "text": " For it's in Christ's name we pray."
    },
    {
      "id": 97,
      "start": 3269.679962158203,
      "end": 3271.2799682617188,
      "text": " We'll have a time of invitation."
    }
  ],
  "processed_at": "2025-04-17T01:19:41.649849"
}