{
  "video_id": "ptmZhTOqic0",
  "text": "picture after my message last week and you know we've been talking in Colossians chapter number three about the sins of the flesh and all the things are going on and sometimes if we're not careful I mentioned this from verse number five and also coupled with the truth of verses eight and nine that sometimes I've had people say to me well I've never murdered anybody and I'm like hey that's a good thing you know but sometimes what happens if you look on the left here the side view kind of the the bar graph if you will how we see sin right we kind of say well this one's really bad and this one's not so bad and you know lying might be over here and adultery and fornication and murder and however our view of sin is but that same bar graph from the top view looking down sin is sin to God amen and I shared with you that statement that that preacher made from yesteryear when the congregant said hey pastor you don't need to be preaching about sin because sin is different in the life of a believer and that preacher with great wisdom said you're right it's worse it's worse and what great truth and so I thought that'd be a great thing to share with you I appreciate it Brianna sharing it with me we were talking after church on Sunday and she said you know daddy as you were preaching I thought about this picture I saw once and she showed it to me and I said man would you send that to me that's really good I like that so I hope it's a blessing to you as well and Colossians chapter number three beginning verse number 10 this morning Colossians 3 and be looking in verse number 10 this morning is where we'll begin and of course as we've studied this portion of Scripture over the past couple of weeks we have examined verses 5 through 9 and as we've examined these verses of Scripture we have noted that Paul was both direct and detailed he didn't hold anything back amen he just kind of laid it right on the table mortify therefore your members which are upon the earth is how he starts verse number five and then in verse number eight put now ye also excuse me but now ye also put off all these he was very direct with these believers in Colossi and we find that not only was he direct but he was detailed he provided a list of things that needed to be put off things that we as believers ought not be engaged in behavior that is not appropriate for us and we find that I believe that he was direct and detailed because he understood the danger that our flesh presents I said this last week by way of introduction it'd be wonderful if that salvation our flesh was eradicated we didn't have to deal with it anymore but you know as well as I do that that is not the case and we still have this flesh one day this mortal shall put on immortality and this corruption shall put on incorruption but until then the flesh lusteth against the spirit in fact as we've looked at this really thought from Colossians 3 it's interesting this evening if you're back with us will be in Genesis chapter 21 and we'll be looking at some of that very same truth that we find here in Colossians all the way back in Genesis in the allegory that Paul refers to as that portion of Scripture as he's mentioning and ministering to the believers in the region of Galatia but we find that Paul as he's providing the the in the the believers in Colossi with this information we say that there's some things that need to be put off some things that we ought not be engaged in but that's only possible as we would crucify our flesh and as we'd understand that we need to walk in the Spirit the Bible says walk in the Spirit and you shall not fulfill the lust of the flesh and that's as true as for God so loved the world that he gave his only begotten Son amen we can have victory through the Lord Jesus Christ and I'm so thankful for the victory that he provides you note in verse number five some of those things that he deals with fornication uncleanness inordinate affection evil concupiscence and covetousness which he likens to idolatry we find in verse number eight he said anger wrath malice blasphemy filthy communication and verse number nine lying what a list and we see that these are things that as a believer we are to put off that we're not to be engaged in this behavior would a mortify our members which are upon the earth we find as I concluded last week that we need to learn to identify sin in our lives and the Bible will help you to identify what is sin we do not determine what is sin by what the culture says we do not determine what is sin by what the government says we live in a time we live in an age right now that of course through all of human history you see it all the way back in the land of Judah as Jeremiah would deal with they legislate wickedness Isaiah deals with so many things I was reading the book of Isaiah this morning in my personal devotions and we find that the reality is that we're living in a time in which listen right is called wrong and wrong is called right we're living in a time in which they legislate wickedness but for the child of God that is not how we determine what is sin we don't look at what's popular we don't look at what's accepted we look to the Word of God and we say no God's Word says this is sin and therefore I'm identifying sin in my life when I do so I then come to that place where I refuse to excuse it I'm not gonna make any provision for the flesh amen I'm gonna refuse to excuse sin I'm gonna come to that place where I'm gonna confess it and I'm gonna forsake it because we find that he that covereth his sin shall not prosper but we have a God who is ready to pardon who is ready to forgive and what a tremendous blessing that is and as we know all of these things that he deals with in verses 5 through 9 we then come to the section of this book we'll look at verses 10 through 14 this morning where he's going to now give instruction with regard to what needs to be put on as we find in verse number 11 excuse me verse number 12 he says this put on therefore as the elect of God holy and beloved and then he's gonna begin the list and so this morning I've simply entitled the message from verse number 12 put on therefore if you take some things off if you put off you need to put on and we find that as even the analogy would be known to these believers in Colossi we made note of it as we've studied the last couple of weeks it's almost that picture that analogy that example of putting off filthy garments to put on clean garments one preacher of yesteryear said it this way you put off the grave clothes to put on the grace clothes I like that Peter says that we're to be that were to be clothed in humility and we'll look at that in just a moment as we get into this list but before we look at the list I want you to notice a couple of things in verses 10 and 11 if you're taking notes this morning from verse number 10 I want you to note the plan God has a plan for you he has a plan for me and we find that as Paul begins here in verse number 10 he says and have put on the new man remember he's writing to believers we find that in Colossians 1 he's heard about the Epaphras had delivered to Paul Paul never ministered in Colossi but Epaphras delivered to Paul about this church and these believers and how they were growing and how God was working and Paul was encouraged and Paul commended them and Paul prayed for them and we find that he's speaking to these believers and he says and have put on the new man which is renewed in knowledge notice this after the image of him that created him you know that as we think about the last phrase of verse number 10 and really note the plan that God has for us you'll find that as you study the Word of God that you will discover that God's plan is that God's people look like God's son amen that's God's plan according to Romans 8 verse number 29 the Bible says that were to be conformed to the image of his dear son according to what Paul says in Ephesus and Ephesians 1 in verse number 10 he says that we should be holy and without blame before him in love notice that in verse number 12 he uses some of that same phraseology holy and beloved in verse number 12 the reality is that God desires for his people to take on the image of his son they were called Christians first in Antioch the Bible tells us to be a Christian is to be one that would follow Christ one that as someone would identify and evaluate you they would see that there are characteristics in your life that would be true of the Lord Jesus Christ we find that Peter would say this that Jesus has left us an example that we should follow his steps what a joy to know that we can be can be conformed to the image of his dear son it's a process of putting off and putting on and I believe that the truth that we would find with regard to this plan is really the theological term that we would refer to as sanctification sanctification someone said this salvation is the miracle of a moment aren't you thankful for that there's a time that you were born again amen a date in a time a place you trust at Christ as your Savior salvation is the miracle of a moment but sanctification is the process of a lifetime amen we are continually listen I understand I'm thankful that positionally I'm seated in the heavenlies according to what Paul says to the believers in Ephesus positionally I'm sanctified but practically speaking as we have this flesh as we're here upon this earth there's a process of progressive sanctification that we're becoming more and more like the Lord Jesus Christ, that we are identifying sin in our lives, that we're seeking to walk in the power of the Holy Spirit of God, and we're becoming like Christ. And I'm thankful that one day, according to what John says in 1 John, that we shall see him and we shall be like him. Amen? And what a joy that is! But until then, there's this process of sanctification. The word means to be consecrated. It means to be set apart for a sacred purpose. I want you to consider, as we think about this plan here in verse number 10, I want you to consider what Paul said to the believers in Thessalonica. Hold your place here in Colossians and turn over to 1 Thessalonians chapter number 4, if you will. 1 Thessalonians chapter number 4. I'm going to read a couple of verses to you. In verses 3 and 4, we see this phrase used with regard to sanctification, but I want you to understand what Paul says to these believers. He says this, he begins verse number 3, for this is the will of God, even your sanctification that you should abstain from fornication. That was one of the things that was mentioned in verse number 5, actually the first item that Paul dealt with in Colossians 3 and verse number 5. Notice verse number 4, 1 Thessalonians 4, that every one of you should know how to possess his vessel in sanctification and honor. Oftentimes our bodies are referred to as a vessel, a temple, a tabernacle. Peter says, I must put off shortly this my tabernacle. We find our vessel, Paul uses that phraseology with Timothy about our bodies and being a vessel that is fit for the master's use, and we find here that Paul is encouraging these believers in Thessalonica with regard to sanctification. I know I've said it in the past, it's worth repeating, you're as close to God today as you want to be. You're as close to God today as you want to be. I'm as close to God today as I want to be. The reality is that we read our Bibles as much as we want to, we pray as much as we want to, we attend church as much as we want to, we do all of the things as much as we desire to do so, and we find that that process of sanctification. I wonder this morning, see there are times in which, have you ever been in a place in a position in which maybe if you're a sports fan it's kind of extra innings or overtime or whatever, you're kind of glued to, you want to listen in and and find out what's going on, and somebody's calling you for something else that needs to take place, you need to be somewhere else, you know like you're just glued to it, you don't want to leave, you don't want to be distracted, you want to see what happens, you want to see the end. I wonder if we've ever had that same feeling when it comes to reading our Bibles, when it comes to praying, when someone would beckon us for some other duty, some other responsibility that it's just like, man I don't want to leave because it's so rich and it's so wonderful being in his presence and I'm enjoying this and I don't want to leave this, and perhaps you may have to for whatever the reason may be, but I just wonder this morning how much do we really love the Lord and love his Word? The psalmist cries out in Psalm 119, oh how love I thy law, it is my meditation all the day long. Not only do we note the plan here in verse number 10, but I want you to note a principle that is given to us in verse number 11. This is an important principle. The Bible says this, where there is neither Greek nor Jew, circumcision nor uncircumcision, barbarian, Scythian, bond nor free, but Christ is all and in all. And I want you to notice that last phrase in verse number 11 where he says, Christ is all and in all. I am thankful that it's all about the Lord Jesus Christ. We are reminded in Colossians 1 in verse number 18 that he is to have the preeminence, that in all things he would have the preeminence, that he would have that first place, that first position, and we understand that it's all about Christ. But we find that as Paul would give in verse number 11 when he's making these distinctions, he says there is neither Greek nor Jew, circumcision nor uncircumcision, barbarian, Scythian, bond nor free. I believe that the principle that Paul is communicating to these believers in Colossae, and what a great principle for us to understand this morning, is that in Christ there is no partiality. There is no partiality in Christ. I'm thankful this morning that our God is no respecter of persons, aren't you? And we too are to be no respecter of persons. There's no partiality. Listen to what Paul says in the book of Galatians. Turn to Galatians chapter number 3. Notice a couple of verses here. Of course they were dealing with some of the very things here in the region of Galatia where these Judaizers were coming in and all sorts of things. There was division. You understand that this thing of partiality goes all the way back to the beginning of human history. This is nothing new for us in the 21st century to deal with this subject of partiality. This is something that's existed for millennia, and the reality is that we find in the Word of God that there's to be no partiality. What a great principle this is. In Galatians chapter number 3 and verse number 28, notice he says there is neither Jew nor Greek, there is neither bond nor free, there is neither male nor female, for ye are all one in Christ Jesus. We find that in chapter number 5 of the book of Galatians, notice in verse number 6, he says, for in Jesus Christ neither circumcision availeth anything nor uncircumcision, but faith which worketh by love. I'm thankful for the truth that God has given us in His Word with regard to this subject and how relevant it is even for the day in which we're living, and you understand that in Christ there is no ethnic, no culture, no economic, no racial, no social distinction. We are in Christ. I've often said from this pulpit for many, many years, I've said from this pulpit that there are two categories of people in our world. There are people that are saved, and there are people that are lost. And the duty of the people that are saved is to preach the gospel to the people that are lost. Amen? There's no partiality in Christ, and we find that division is a work of the enemy. We find that the enemy seeks to divide, and oh how successful he is on dividing people. And we've seen even in our own recent history here in this country, we've seen the way in which the enemy seeks to divide. But in Christ, we understand, listen, the Bible, what did Jesus say? The truth shall make you free. Man, I'm so thankful for the truth of God's Word. Remember what Jesus said in John chapter 4? I must needs go through Samaria. You know that the Jewish people hated the Samaritans. There was a, I mean, a deep hatred that they had for the Samaritans, and you would find that they would go out of their way, they would take more time to travel, even in adverse circumstances, in order to avoid going through Samaria. But Jesus, he was teaching a truth. He was teaching something to those disciples that they needed to understand. Why? Because one day they would receive the Great Commission where Jesus would say, but you shall receive power after the Holy Ghost has come upon you, and you should be witnesses unto me, both in Jerusalem and Judea. What is it? Samaria, and under the uttermost part of the earth, right? And so they are to be witnesses. But they hated the Samaritans, and so as Jesus would give that command, no doubt those disciples would be mindful of the example of Christ back in John chapter 4, when he went through Samaria, and of course we know that he met that woman at the well. And oh man, there's a lot of people that got saved as a result of that, amen? There are many that came to Christ, and what a blessing. And we need to be careful to understand the principle that God has given us. Remember this, in Revelation 5, you don't need to turn there, but in verse number 9, the Bible says, and they sung a new song saying, thou art worthy to take the book and to open the seals thereof, for thou was slain and hast redeemed us to God by thy blood, notice this, out of every kindred and tongue and people and nation in Christ, amen? I'm so thankful for the principle that Paul begins this section with here in Colossians 3. Notice now, as we get into this process, we've noted the plan. God's plan is that you and I would be conformed to the image of his dear Son, that we would be like Christ. We find that there's a principle, there's no partiality, that Christ is all and in all, and now we note the process. He says in verse number 12, put on, therefore, as the elect of God, holy and beloved. That's our position, that's our standing. I'm thankful to be saved, to know the Lord Jesus Christ as my personal Savior, and then he's going to go through eight items that he's going to provide for us in verse 12, 13, and 14. Notice with me as we take the bulk of our time this morning to deal with each of these particular items that are referenced in these verses of Scripture. In verse number 12, he starts out by saying this, bowels of mercies. Bowels of mercies. Now you'd understand in this particular era, in this particular culture, the bowels would be known as and referred to as the seat of emotions. For us this morning, we would say from our heart, right? You hear somebody say, I love you with all of my heart. It'd be really weird if somebody said to you, in our culture, I love you with all of my bowels. You'd be like, what in the world, right? But that was their understanding of the seat of emotions. And so we find for us, we would use the word heart, and I just want us to make that connection this morning for us to understand that Paul is saying bowels of mercies. It really is the idea of having a heart of compassion. A heart of compassion. You know I'm thankful this morning that our God is compassionate, aren't you? The Bible declares to us that He's compassionate. The Bible not only declares to us, but we find that on a number of occasions during the life and ministry of the Lord Jesus Christ, that He was moved with compassion. He was moved with compassion, and it is that heart of compassion that we as the people of God, this idea of bowels of mercies, to be merciful, pitiful, to have that heart of compassion. Notice He continues and He says not only bowels of mercies, but kindness. You know kindness seems to just be missing in our society today, amen? I mean people just don't know how to be kind to one another anymore, and I like this explanation or definition of kindness. This is delight in contributing to the happiness of others. I like that definition of kindness. Delight in contributing to the happiness of others. To be kind. Aren't you thankful that God is kind? The idea of kindness is goodwill or benevolence. In Ephesians 4, in verse number 32, Paul says be kind one to another. Be kind one to another. And here he's saying that we've put off some things, all of those items that were mentioned, and really it's a great contrast if you look at the items that were mentioned to us in verse 8 and 9 of those things that were to put off anger, wrath, malice, blasphemy, filthy communication, and lying. And you think about those items that were given to us, and now you contrast those with the list that we're going to look at this morning, and it starts with bowels of mercies. Kindness. I mean how much opposite could you be of anger and wrath and malice? And we're to put off those things, that's the old man, that's the flesh, and we're to put on these things, we're to walk in the Spirit, we're to have the fruit of the Spirit. Notice he says this, humbleness of mind, number three in the list, humbleness of mind, humility, lowliness of mind, it's the antithesis of pride. God says that he hates pride. Amen? That's what God says about pride. God says this, that he is going to, he will give grace to the humble, but not to the prideful, right? He resisteth the proud, but he gives grace unto the humble. By pride comes contention, by pride and haughtiness of spirit comes a fall. We find that comes destruction and contention, and we find all of this with regard to pride, but no, this is humbleness of mind, the antithesis of pride, the fact that we're to to be humble, to have that humility as a child of God. Notice in Philippians 2, turn over if you will, I love the the book of Philippians, in the second chapter has great truth with regard to the subject of humility, and I want you to notice as we look at this portion of scripture that we'll use, the Lord Jesus Christ will be a great example that is given to us here in this portion, but notice how Paul begins in verse number one to these believers in Philippi, if there be therefore any consolation in Christ, if any comfort of love, if any fellowship of the Spirit, if any bowels and mercies fulfill you my joy, that you be like-minded, having the same love, being of one accord, of one mind. Notice verse number three, let nothing be done through strife or vainglory, but in lowliness of mind let each esteem other better than themselves. Look not every man on his own things, but every man also on the things of others. And then Paul, after he gives this charge, this instruction, the believers here in Philippi, and he's encouraging them with the idea of having unity, to be like-minded in verse number two, to have humility, to put off strife and vainglory, that is referred to in verse number three, to have that humility again in verse number four, then he says in verse number five, let this mind be in you, which was also in Christ Jesus. He's going to use the example of the Lord Jesus Christ, and he says here, who being in the form of God, thought it not robbery to be equal with God, but made himself of no reputation, and took upon him the form of a servant, and was made in the likeness of men. Being found in fashion as a man, notice he humbled himself, and became obedient unto death, even the death of the cross. I wonder how often we consider the humility of the Lord Jesus Christ, not only in his incarnation, but in his crucifixion. You think about the way in which he left the glory of heaven. He left all that, he says in John 17, as he's praying, before he would go to the cross, he says the hour has come, and he speaks about the glory that he enjoyed before, by understanding the truth that he's eternal, that he is God. He is God in flesh, and he put off that glory, and he left the glories of heaven, so that he could come and die for you, and die for me. What picture of humility. What example for us as the people of God. In fact, I believe that's the very thing that Peter was referring to, as I mentioned a moment ago, that Peter says that we're to follow his steps, that he, the Lord, left us an example. But as we find that in the context of which Peter is referring to, he says, for even hereunto were you called, because Christ also suffered for us, leaving us an example that you should follow his steps, who did no sin, neither was guile found in his mouth, who, when he was reviled, reviled not again, when he suffered, he threatened not, but committed himself to him that judgeth righteously, who his own self bear our sins in his own body on the tree, that we, being dead to sin, should live unto righteousness, by whose stripes ye are healed.\" You know, the reality that we're saved and that we're the people of God and home is our heaven, that shouldn't lead us to a place of pride. If we're not careful, it can lead us to a place of looking down upon others that they don't have the truth, they've not come to the truth, and we can become prideful in our position and in our our understanding of the truth, but the reality is that, as the songwriter said, I'm a sinner saved by grace. Amen? I'm so thankful for the grace of God. Deborah sang this morning, Amazing Grace. It is amazing, is it not? And I know for many that's a favorite hymn. I know Mr. Don often will mention, even as you get anywhere within the 180s of our songbook, why can't it be 187? Because that's Amazing Grace. There's nothing else in the 180s in our songbook that he would rather sing. And the reality is that God's grace is amazing, but we find here that, as the people of God, we're to be clothed in humility. We're to put on, as we find here in Colossians 3, not only bowels of mercies, not only kindness, but we find humbleness of mind, the antithesis of pride. Oh, that it would not be said of the people of God, of us individually here this morning, that we're prideful, that we're prideful, because God resisteth the proud. Not only does God resist the proud, but you understand that God knows how to humble you. The Bible tells us to humble ourselves in the sight of God, but if you don't humble yourself, God has a way of humbling you. Just talk to old Nebuchadnezzar. We won't take time to go to the book of Daniel this morning to look at that, but you understand that he was a prideful individual, the king of Babylon, and God brought him low. God humbled that man. This morning, not only do we see these first three, but notice number four, meekness. Meekness there in verse number 12 still. Meekness is an interesting word. I believe that it can best be described or defined as being a discipline of emotions. A discipline of emotions. A softness of temper. See, sometimes people equate meekness with weakness. People think somebody is meek and therefore they're weak, but reality is that the idea, the understanding of the word meekness is that it is that discipline of emotions. In other words, power under control. Power under control. That's meekness. And again, as the people of God, we find that as Paul was going through and saying, put on therefore, again the great contrast between the things that were to put off all these and now we put on therefore these, and we find that meekness, the fact that we would have a discipline of our emotions, that we would not have that wrath and anger and malice that was described in verse number eight that were to put off. No, it's not that we just, you know, have this fuse and this temper that just is uncontrollable. No, we have temperance. We have meekness. It's power under control. It's a discipline of our emotions. Can I tell you that you can only... only do that through the power of the Holy Spirit. You can only do that through the power of the Holy Spirit. As much as we try to discipline our own emotions, as much as we try to figure out when something really bothers me and somebody pushes that wrong button and you know what that means, I'm going to count to ten, I'm going to do this, I'm going to do that, I'm going to go through all of these exercises so that I don't blow my cool. The power of the Holy Spirit, walking in the Spirit, that's what we need, to put on this meekness. Notice as we end verse number 12, use of the word long-suffering, patience, endurance, steadfastness, really carries with it the idea of not being easily provoked. This idea of being long-suffering, it's interesting how it will lead us into the phrases that are given to us in verse number 13 and how important it is to understand this long-suffering that's being put on. I really believe that as we think about these items that Paul is giving to the believers in Colossae that we're receiving from God this morning through His Word because all Scripture is given by inspiration of God and it's profitable. Listen, it's helpful for us to understand these things that as we take these five items that are mentioned in verse number 12 that through putting on those things it will help us to do what we're supposed to do according to verse number 13. If we don't put on bowels of mercies, kindness, humbleness of mind, meekness in long-suffering, it's going to be real hard to forbear one another. That's how he begins verse number 13, forbearing one another. You know what it means? Basically it means this, put up with each other. Put up with each other. You ever hear somebody say, I love you but I don't have to like you? That's nonsense. I don't know where that, listen, that's not Bible. You understand there's no Bible verse that you can go to and say, well, this is, I have to love you in Jesus' name but I don't have to like you, bless God. No, that's not Bible. That's nonsense. That's making provision for the flesh, honestly. The reality is that, look, if you look at those things that are mentioned, those five items in verse number 12, bowels of mercies, kindness, humbleness of mind, meekness in long-suffering, do you find in there that you're not going to like somebody that's a child of God? Come on. If you're to put on these things, you're going to not only love them as we find in verse number 14, but you're going to be praying one for another and you're going to be following these things and this thing of forbearing, listen, I understand that we're all different. I understand that people will make a phraseology every once in a while. Some people just rub me the wrong way or somebody's, but the reality, remember in Christ, remember we looked at that principle in verse number 12, Christ is all and in all. And the reality is that all of those things are set aside because now we're in Christ and as we're seeking that process of sanctification and each one of us are on our journey of sanctification becoming more like Christ and we're walking with God and we're walking with Christ, you understand that there's sometimes that you might be further along than someone else on that journey and there are times in which someone else might be further along than you are on that journey. In the same grace that you would like to be afforded to you, you need to afford to the person that's not as far along as you are. Amen? Now sometimes that's hard for us. Sometimes that's a challenge because we've not put on all of these things that Paul is mentioning in verse number 13, forbearing one another. I believe that that's the result not only specifically of longsuffering that we're not easily provoked, that we have that patience and that endurance, but that we have the bowels of mercies, the kindness, the humility, and the meekness. You ever wonder why God puts up with you? I mean, let's just bring it right down where it is, you know what I mean? Because sometimes, listen, when did Christ, according to Romans chapter number 5, God demonstrated his love toward us in that while we were yet sinners, Christ died for us. Amen? And yet after salvation, how many times after salvation as we've dealt with this old man, this flesh, this principle that's carried on throughout, starting in verse number 5 of Colossians 3, going through what we're dealing with this morning, how many times have we failed our Savior? How many times have we just royally messed up? And yet he's forgiving. He's putting up with us. He's longsuffering toward us. He's kind toward us. He's merciful toward us. And I'm so thankful for that. And we are, as the people of God, we're to put on these things. We're to put these things on, forbearing one another. Notice as we continue through the list in verse number 13, we find the seventh item that is mentioned, really, the truth here, forgiving one another. He says this, if any man have a quarrel against any, even as Christ forgave you, so also do ye. The reality is that there will be times in which there will be a quarrel against someone. Why? Because we have the flesh. Amen? I was listening to a preacher preach. I was at a pastor's meeting. And sometimes you've heard these people that have said something of this nature. The guy that was the president of our Bible college, he would stand up and he'd say, we've been, my wife and I've been married for 43 years and we've never had one argument, not ever one argument. And some of those kids in the college, we'd sit there and we'd listen and think, man, that's awesome. That's wonderful. And so on and so forth. And then others just wondering like, how in the world could that happen? Right? Like seriously? And this, this preacher was preaching at a pastor's meeting just a couple of months ago. I was there down in, uh, just South of Spotsylvania and King George. And I was at the pastor's meeting. This fellow was preaching. And he said in all the years that I've been married, I've never had one argument with my wife. He said never one time have I ever said anything to my wife that I'd regret. Not one time I ever raised my voice to my wife. Oh man, this is great. Amen. Kevin's laughing back there. And then he said this, there have been plenty of times that I've not said a word to her and I've not talked to her for days. And I thought, well, that's not the right answer either. Amen. I mean, come on. And he was really building it up for this thing. But the reality is that the answer is not like, you know, being angry and sin not, yeah, I don't want to sin. I don't want to speak and sin. But at the same time, he says, let not the sun go down upon my wrath. It's not that I'm going to go days on end without talking to someone that I'm going to allow the divide to become greater than I'm going to give place to the devil. He gets that toe hold, which becomes a foothold, which becomes a stronghold. And we come to the place where we say, where did we get here? What happened anyway? We think it was just this little thing. If there's a quarrel, he says, listen, we're forbearing one another, but we're also forgiving one another. I'm so thankful for the teaching in God's Word with regard to forgiveness. Isn't it wonderful, wonderful to be forgiven? I mean, honestly, to know that your sins are forgiven, to know that God has forgiven you, to understand, as we've said in the past, and you can sing the song, I'm forgiven forever. Man, that's a wonderful thing. That with thee, with our God, there is forgiveness. That he promises that if we confess our sins, that he will forgive us and cleanse us from all unrighteousness. It's a wonderful thing to be forgiven. The problem that some people have in their lives is not necessarily understanding that God has forgiven them, but perhaps forgiving themselves. The enemy, as the child of God, the accuser of the brethren, he tries to come alongside and accuse us, but we say, listen, we have an advocate with the Father. It's under the blood. I've been forgiven. Get thee behind me, Satan. Amen? I don't want to hear that anymore because I've confessed that, I've forsaken that, and God promised to forgive me. But then all of a sudden, somewhere along the line, sometimes we have a difficulty with forgiveness in our lives. Remember Peter? Lord, how oft shall we forgive? Till seven times? Now, we understand contextually, at that particular time, the kind of social norm would be that if someone were to offend you in the same manner, three, maybe four times, the Pharisees and those religious leaders of the day, they would say, okay, you can forgive three or four times, but after that, I mean, you've crossed me one too many times. So Peter, when he comes to Christ and he says, till seven times? He's really kind of saying, we're doing a little better than those religious leaders over there. I mean, you've called them vipers, by the way, and so obviously they're not doing everything right, and so till seven times? Jesus says no. Not till seven. Till 70 times seven. Wow. Till 70 times seven. 490. But the idea isn't that you get your little journal book out and keep a list of who's offended you and how many times. And man, they get up to like 482 and you're like, oh man, they're getting close, I don't have to forgive them anymore, just a few more times. No. That's not the idea. It's to keep on forgiving. See, when Jesus said this to the disciples, another different way or a slightly different way of God speaking to them with regard to forgiveness is found for us in Luke 17. And he says, it says this, and if you trespass against thee seven times in a day, and seven times in a day turn again to thee, saying, I repent, thou shalt forgive him. So we find it says seven times a day. Now, I'm not sure about you, but perhaps if someone like three or four times in the same day offended you, you might be like, I gotta find a different place to go today, like I gotta do something different. But Jesus says, if seven times in the same day, that's what he says in Luke 17 and verse number four, in seven times in that day, he turns again to thee saying, I repent, thou shalt forgive him. Have you ever failed God more than one time in the same day? Sure you have, sure you have. Sometimes in the same way, right? You know how the disciples respond, the apostles responded to that teaching? The apostles said unto the Lord in verse number five, increase our faith. I believe contextually, that request is obviously made on the heels of that instruction with regard to forgiveness. Forgiveness. And we find here that, again, back in Colossians three, that is, Paul would say in verse number 13, not only forbearing one another, but forgiving one another. But notice what he says at the end of the verse. Even as Christ forgave you, so also do ye. The way that he says it to the believers in Ephesus, in Ephesians chapter number four, in verse number 32, he says, and be kind one to another, tenderhearted, forgiving one another, even as God, for Christ's sake, hath forgiven you. Why do we forgive? Because we've been forgiven. You say, but they don't deserve it, neither do you. I don't deserve God's forgiveness. But God is a forgiving God. Aren't you thankful for that? You know, I believe that as we look at this list, and we're gonna look at verse 14 here in just a moment, but even as we just look at these first seven things that are mentioned, five of those items in verse number 12, and then really the outworking, the forbearing, and the forgiving that's mentioned in verse number 13, I want you to consider that if we, as the people of God, would really put off all those things that are mentioned in verses five through nine, and we'd really put on these things that are mentioned, I think we could make a difference in our world. I really do. Listen, I think that as we go, our message would be more readily received. Why? Because we're walking in the Spirit. We're living the Christ life. We've been crucified to the old man, and now all of a sudden, we're able to have a greater impact and a greater influence. Why? Because we are merciful, we are compassionate, we're kind, we're humble, we're meek, we're long-suffering, we forbear, we forgive, and as we understand those things and say, man, we're going to have an opportunity to make a difference in our world. I've heard people say over the years, as you would speak to them about Christianity, as you would speak to them about the Lord, that they've had encounters and experiences with individuals that claim the name of Christ, but were nothing like Christ, and therefore they have no interest in anything to do with the Bible. No, that's sad. That's sad. One world religious leader of years ago made this statement, not a Christian at all, but made this statement as they examined and studied Christianity, I like your Christ, but not your Christians, for they are nothing like your Christ. Man, that'll hit you. Because a Christian is supposed to be like Christ. And how is it that we're going to be like Him? Well, Paul's giving us the application right here in this portion of Scripture. Listen, believers in Colossae, listen, church this morning, as we think about the truth of God's Word and we think about the way in which it's been preserved and it's for us this morning, God has said, listen, you're saved, but there's some things you need to deal with that old man, you need to put off these things. And there's some things you need to put on. And as we walk in the Spirit and as we have the fruit of the Spirit that Paul mentions in Galatians 5, I believe that we'll be so much more effective on reaching people, on sharing Christ with people. Notice verse number 14 as he concludes. And above all these things, put on charity. Notice this, which is the bond of perfectness. As he speaks about charity, we understand the word love and we use that word and we understand the truth that is given and really the word for love that is used here in this portion of Scripture is the word that is used to describe God's love, agape love. And we find that we're to, above all these things, put on charity, which is the bond of perfectness. I believe it's that evidence of maturity, if you will. And we think about this list and we could even work backwards and work sideways and just kind of interchange all of these things and understand how they're so dependent upon one another. Remember, as we look at this verse and think about the truth of charity, of love, remember what Jesus said. Turn over to 1 Corinthians 13, but I'm gonna read to you John chapter 13. 1 Corinthians 13, we'll look at some verses there as we conclude this morning. But I wanna remind you of what Jesus said in John chapter number 13. In John chapter number 13, in verse number 34, Jesus, of course, had just finished washing the feet of the disciples and was giving them, the disciples, truth with regard to His soon going to the cross of Calvary. And He says this, a new commandment I give unto you that ye love one another as I have loved you that ye also love one another. How are we to love one another? As Christ loved us. How are husbands to love their wives? As Christ loved the church and gave Himself for it. And we think about this great truth that He says that above all these put on charity, which is the bond of perfectness. And we find it in 1 Corinthians chapter number 13, a chapter that is given to the, really the supremacy of love, if you will, of charity. He says, though I speak with the tongues of men and of angels and have not charity, I am become a sounding brass or a tinkling cymbal. Though I have the gift of prophecy and understand all mysteries and all knowledge. And though I have all faith so that I could remove mountains and have not charity, I am nothing. And though I bestow all my goods to feed the poor and though I give my body to the burn and have not charity, it profiteth me nothing. Then He describes charity, love. Suffereth long. We saw that in our list, did we not? Long-suffering. And is kind. Did we see that in our list? Kindness. Charity envieth not. Charity, notice this, vaunteth not itself, is not puffed up. Did we see that in our list? Humbleness of mind. Doth not behave itself unseemly, speaketh not her own, is not easily provoked, thinketh no evil. We spoke about that not easily provoked being the truth of long-suffering. Behaveth itself unseemly, seeketh not her own, is not easily provoked, thinketh no evil. I mean, think about how it's being described here. Rejoiceth not in iniquity, but rejoiceth in the truth. Beareth all things, believeth all things, hopeth all things, endureth all things. Charity never faileth. But whether they be prophecies, they shall fail. Whether they be tongues, they shall cease. Whether it be knowledge, it shall vanish away. And He talks about the fact that we know in part and we prophesy in part, but when he that is perfect is come, then that which is, excuse me, but when that which is perfect is come, then that which is imperfect shall be done away. But I want you to think about the last verse. And now abideth faith, hope, charity. These three, but the greatest of these is charity, love. We're familiar with 1 Corinthians 13. It's a very common passage of scripture. We're familiar with the admonition that Jesus gives to the disciples, that we're to love one another as He loved. By this shall all men know that you're my disciples. I think about the terminologies in the first three verses that if I don't have charity, I'm become a sounding brass, a tinkling cymbal. I am nothing, it profiteth me nothing. I understand, I believe that you can develop a biblical principle to support this statement. It's not a verse of scripture, but I really believe that if you look at the book of 1 Thessalonians, that you can support this quote or this statement. And someone said this years and years ago, people don't care how much you know until they know how much you care. How many of you ever heard somebody say that? Now, that's not a Bible verse, but I do believe that if you look in the book of 1 Thessalonians and you find that Paul is speaking to those people in Thessalonica, and he says, I cared for you as a nurse, cherisheth her children. And then he's delivering to them, he said that I'm sending Timothy to perfect that which is lacking in your faith. Well, that's, I mean, if I don't know that you love me and you're coming to me saying, and I got some areas in which I need to develop, I'm not all the way there, like I could take offense to that. But we don't see in any way that the believers in Thessalonica take offense to anything that is said. Why? Because they knew that Paul loved them. He cared about them. You know, if we don't have charity, you ever try to talk to somebody and they just don't, they don't see your heart of compassion, of love? Someone asked me recently, trying to share the gospel with them. I said, why do you even care? That's what they said to me. What's in it for you? I said, honestly, nothing. There is absolutely nothing in it for me, aside from obedience, but my obedience has given you the truth. Whether you accept it or reject it, I'm not going to answer for that. Is that true? My job, my duty, my responsibility, what I'm accountable for is to give the truth. And here's what I told the individual, I'm going to heaven when I die, whether you get saved or not. But here's the thing, I understand the truth, and I want you to go to heaven when you die, because the alternative isn't so great, the lake of fire. But they looked at me with all seriousness, why do you care? What do you want from me? I don't want anything from you. Nothing. I just want you to be saved. I just want you to be saved. See, people need to see our love. They need to see that we're genuine. Notice what John says, he heard the Lord Jesus Christ give that new commandment, and he says this in closing in 1 John 4, in verses 7 and 8. 1 John 4, verses 7 and 8. Notice what John, who heard the Lord Jesus Christ give that new commandment, under the inspiration of the Holy Spirit of God, notice what he says. Beloved, let us love one another, for love is of God. And everyone that loveth is born of God and knoweth God. He that loveth not, knoweth not God, for God is love. Put on bowels of mercies, kindness, humbleness of mind, meekness, long-suffering, forbearing one another, forgiving one another. And above all these, put on charity, which is the bond of perfectness. Oh, we've learned some things over the last few weeks that we need to put off, but now this morning we learned some things we need to put on. There's an area in your life where the Holy Spirit of God just touched and said, this is an area, this put on area, this particular thing. God, help me. Help me to walk in the Spirit. Help me to have the fruit of the Spirit. Help me to be all that you've called me to be. Help me to be like your dear Son. See, that's God's plan, is that we'd be conformed to the image of His dear Son. Let's pray together. Father, we love you. We thank you for loving us. Thank you for the Word of God and for the truth that's contained therein. We thank you that you have provided to us in this portion of Scripture as your people, not only things that we need to put off, but now things that we need to put on. We're thankful that your plan is that we would be like Christ, conformed to the image of your dear Son. I thank you that you gave us that principle that there's no partiality. Christ is to have the preeminence. And in Christ, we are to be unified, brothers and sisters in Christ. What a joy. Because we notice this process that is given to us with this put on therefore. I thank you for working in my heart and my life. I pray God that as only you can, you would move and work and help us, Lord, to respond to how the Holy Spirit has spoken to us. That we'd allow you to have your will and way in our lives. That we would truly seek to be like Christ. That we could make the difference that you've called us to make, and if some have compassion, making a difference. Father, if there's one present that's never been saved, they've never trusted the Lord Jesus Christ as their personal Savior. I pray that today would be the day of their salvation. They'd understand before they can do any of what we've talked about this morning, they must first be born again in Christ. And that today is the day of salvation. Their sin carries with it a wage. That wage is death, separation from God in the lake of fire. We're so thankful for the gift of God, which is eternal life through Jesus Christ our Lord. I pray that you'd move and work as only you can. We'll give you the glory for every decision that's made, for it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano, and as she does, the altar is open. Maybe you need to come to this old-fashioned altar this morning. Maybe you need to make your pew an altar. But as the Holy Spirit of God has used the Word of God to minister to the people of God, let's do business with God as Kimberly plays.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.639999866485596,
      "text": " picture after my message last week and you know we've been talking in"
    },
    {
      "id": 1,
      "start": 4.639999866485596,
      "end": 8.760000228881836,
      "text": " Colossians chapter number three about the sins of the flesh and all the things"
    },
    {
      "id": 2,
      "start": 8.760000228881836,
      "end": 12.600000381469727,
      "text": " are going on and sometimes if we're not careful I mentioned this from verse"
    },
    {
      "id": 3,
      "start": 12.600000381469727,
      "end": 16.8799991607666,
      "text": " number five and also coupled with the truth of verses eight and nine that"
    },
    {
      "id": 4,
      "start": 16.8799991607666,
      "end": 20.360000610351562,
      "text": " sometimes I've had people say to me well I've never murdered anybody and I'm like"
    },
    {
      "id": 5,
      "start": 20.360000610351562,
      "end": 24.15999984741211,
      "text": " hey that's a good thing you know but sometimes what happens if you look on"
    },
    {
      "id": 6,
      "start": 24.15999984741211,
      "end": 29.200000762939453,
      "text": " the left here the side view kind of the the bar graph if you will how we see sin"
    },
    {
      "id": 7,
      "start": 29.200000762939453,
      "end": 32.720001220703125,
      "text": " right we kind of say well this one's really bad and this one's not so bad and"
    },
    {
      "id": 8,
      "start": 32.720001220703125,
      "end": 37.84000015258789,
      "text": " you know lying might be over here and adultery and fornication and murder and"
    },
    {
      "id": 9,
      "start": 37.84000015258789,
      "end": 45.36000061035156,
      "text": " however our view of sin is but that same bar graph from the top view looking down"
    },
    {
      "id": 10,
      "start": 45.36000061035156,
      "end": 52.7599983215332,
      "text": " sin is sin to God amen and I shared with you that statement that that preacher"
    },
    {
      "id": 11,
      "start": 52.7599983215332,
      "end": 57.400001525878906,
      "text": " made from yesteryear when the congregant said hey pastor you don't need to be"
    },
    {
      "id": 12,
      "start": 57.400001525878906,
      "end": 61.08000183105469,
      "text": " preaching about sin because sin is different in the life of a believer and"
    },
    {
      "id": 13,
      "start": 61.08000183105469,
      "end": 66.5199966430664,
      "text": " that preacher with great wisdom said you're right it's worse it's worse and"
    },
    {
      "id": 14,
      "start": 66.5199966430664,
      "end": 71.87999725341797,
      "text": " what great truth and so I thought that'd be a great thing to share with you I"
    },
    {
      "id": 15,
      "start": 71.87999725341797,
      "end": 74.76000213623047,
      "text": " appreciate it Brianna sharing it with me we were talking after church on Sunday"
    },
    {
      "id": 16,
      "start": 74.76000213623047,
      "end": 78.23999786376953,
      "text": " and she said you know daddy as you were preaching I thought about this picture I"
    },
    {
      "id": 17,
      "start": 78.23999786376953,
      "end": 81.91999816894531,
      "text": " saw once and she showed it to me and I said man would you send that to me"
    },
    {
      "id": 18,
      "start": 81.91999816894531,
      "end": 85.27999877929688,
      "text": " that's really good I like that so I hope it's a blessing to you as well and"
    },
    {
      "id": 19,
      "start": 85.27999877929688,
      "end": 88.87999725341797,
      "text": " Colossians chapter number three beginning verse number 10 this morning"
    },
    {
      "id": 20,
      "start": 88.87999725341797,
      "end": 92.83999633789062,
      "text": " Colossians 3 and be looking in verse number 10 this morning is where we'll"
    },
    {
      "id": 21,
      "start": 92.83999633789062,
      "end": 96.76000213623047,
      "text": " begin and of course as we've studied this portion of Scripture over the past"
    },
    {
      "id": 22,
      "start": 96.76000213623047,
      "end": 102.72000122070312,
      "text": " couple of weeks we have examined verses 5 through 9 and as we've examined these"
    },
    {
      "id": 23,
      "start": 102.72000122070312,
      "end": 108.72000122070312,
      "text": " verses of Scripture we have noted that Paul was both direct and detailed he"
    },
    {
      "id": 24,
      "start": 108.72000122070312,
      "end": 111.63999938964844,
      "text": " didn't hold anything back amen he just kind of laid it right on the table"
    },
    {
      "id": 25,
      "start": 111.63999938964844,
      "end": 115.83999633789062,
      "text": " mortify therefore your members which are upon the earth is how he starts"
    },
    {
      "id": 26,
      "start": 115.83999633789062,
      "end": 119.55999755859375,
      "text": " verse number five and then in verse number eight put now ye also excuse me"
    },
    {
      "id": 27,
      "start": 119.55999755859375,
      "end": 125.5999984741211,
      "text": " but now ye also put off all these he was very direct with these believers in"
    },
    {
      "id": 28,
      "start": 125.5999984741211,
      "end": 130.16000366210938,
      "text": " Colossi and we find that not only was he direct but he was detailed he provided a"
    },
    {
      "id": 29,
      "start": 130.16000366210938,
      "end": 134.8800048828125,
      "text": " list of things that needed to be put off things that we as believers ought not be"
    },
    {
      "id": 30,
      "start": 134.8800048828125,
      "end": 139.0800018310547,
      "text": " engaged in behavior that is not appropriate for us and we find that I"
    },
    {
      "id": 31,
      "start": 139.0800018310547,
      "end": 144.67999267578125,
      "text": " believe that he was direct and detailed because he understood the danger that"
    },
    {
      "id": 32,
      "start": 144.67999267578125,
      "end": 150.44000244140625,
      "text": " our flesh presents I said this last week by way of introduction it'd be wonderful"
    },
    {
      "id": 33,
      "start": 150.44000244140625,
      "end": 153.67999267578125,
      "text": " if that salvation our flesh was eradicated we didn't have to deal with"
    },
    {
      "id": 34,
      "start": 153.67999267578125,
      "end": 158.63999938964844,
      "text": " it anymore but you know as well as I do that that is not the case and we still"
    },
    {
      "id": 35,
      "start": 158.63999938964844,
      "end": 164.0399932861328,
      "text": " have this flesh one day this mortal shall put on immortality and this"
    },
    {
      "id": 36,
      "start": 164.0399932861328,
      "end": 169.67999267578125,
      "text": " corruption shall put on incorruption but until then the flesh lusteth against"
    },
    {
      "id": 37,
      "start": 169.67999267578125,
      "end": 174.0,
      "text": " the spirit in fact as we've looked at this really thought from Colossians 3"
    },
    {
      "id": 38,
      "start": 174.0,
      "end": 177.67999267578125,
      "text": " it's interesting this evening if you're back with us will be in Genesis chapter"
    },
    {
      "id": 39,
      "start": 177.67999267578125,
      "end": 181.8000030517578,
      "text": " 21 and we'll be looking at some of that very same truth that we find here in"
    },
    {
      "id": 40,
      "start": 181.8000030517578,
      "end": 186.0800018310547,
      "text": " Colossians all the way back in Genesis in the allegory that Paul refers to as"
    },
    {
      "id": 41,
      "start": 186.0800018310547,
      "end": 189.60000610351562,
      "text": " that portion of Scripture as he's mentioning and ministering to the"
    },
    {
      "id": 42,
      "start": 189.60000610351562,
      "end": 195.0800018310547,
      "text": " believers in the region of Galatia but we find that Paul as he's providing the"
    },
    {
      "id": 43,
      "start": 195.0800018310547,
      "end": 200.44000244140625,
      "text": " the in the the believers in Colossi with this information we say that there's"
    },
    {
      "id": 44,
      "start": 200.44000244140625,
      "end": 203.9199981689453,
      "text": " some things that need to be put off some things that we ought not be engaged in"
    },
    {
      "id": 45,
      "start": 203.9199981689453,
      "end": 207.8800048828125,
      "text": " but that's only possible as we would crucify our flesh and as we'd"
    },
    {
      "id": 46,
      "start": 207.8800048828125,
      "end": 211.39999389648438,
      "text": " understand that we need to walk in the Spirit the Bible says walk in the Spirit"
    },
    {
      "id": 47,
      "start": 211.39999389648438,
      "end": 217.0399932861328,
      "text": " and you shall not fulfill the lust of the flesh and that's as true as for God"
    },
    {
      "id": 48,
      "start": 217.0399932861328,
      "end": 222.0800018310547,
      "text": " so loved the world that he gave his only begotten Son amen we can have victory"
    },
    {
      "id": 49,
      "start": 222.0800018310547,
      "end": 226.63999938964844,
      "text": " through the Lord Jesus Christ and I'm so thankful for the victory that he"
    },
    {
      "id": 50,
      "start": 226.63999938964844,
      "end": 230.60000610351562,
      "text": " provides you note in verse number five some of those things that he deals with"
    },
    {
      "id": 51,
      "start": 230.60000610351562,
      "end": 235.8000030517578,
      "text": " fornication uncleanness inordinate affection evil concupiscence and"
    },
    {
      "id": 52,
      "start": 235.8000030517578,
      "end": 240.72000122070312,
      "text": " covetousness which he likens to idolatry we find in verse number eight he said"
    },
    {
      "id": 53,
      "start": 240.72000122070312,
      "end": 245.9199981689453,
      "text": " anger wrath malice blasphemy filthy communication and verse number nine"
    },
    {
      "id": 54,
      "start": 245.9199981689453,
      "end": 253.0800018310547,
      "text": " lying what a list and we see that these are things that as a believer we are to"
    },
    {
      "id": 55,
      "start": 253.0800018310547,
      "end": 257.2799987792969,
      "text": " put off that we're not to be engaged in this behavior would a mortify our"
    },
    {
      "id": 56,
      "start": 257.2799987792969,
      "end": 262.44000244140625,
      "text": " members which are upon the earth we find as I concluded last week that we need to"
    },
    {
      "id": 57,
      "start": 262.44000244140625,
      "end": 267.7200012207031,
      "text": " learn to identify sin in our lives and the Bible will help you to identify what"
    },
    {
      "id": 58,
      "start": 267.7200012207031,
      "end": 271.9599914550781,
      "text": " is sin we do not determine what is sin by what the culture says we do not"
    },
    {
      "id": 59,
      "start": 271.9599914550781,
      "end": 276.2799987792969,
      "text": " determine what is sin by what the government says we live in a time we"
    },
    {
      "id": 60,
      "start": 276.2799987792969,
      "end": 281.0799865722656,
      "text": " live in an age right now that of course through all of human history you see it"
    },
    {
      "id": 61,
      "start": 281.0799865722656,
      "end": 286.6400146484375,
      "text": " all the way back in the land of Judah as Jeremiah would deal with they legislate"
    },
    {
      "id": 62,
      "start": 286.6400146484375,
      "end": 290.79998779296875,
      "text": " wickedness Isaiah deals with so many things I was reading the book of Isaiah"
    },
    {
      "id": 63,
      "start": 290.79998779296875,
      "end": 295.20001220703125,
      "text": " this morning in my personal devotions and we find that the reality is that"
    },
    {
      "id": 64,
      "start": 295.20001220703125,
      "end": 299.3999938964844,
      "text": " we're living in a time in which listen right is called wrong and wrong is"
    },
    {
      "id": 65,
      "start": 299.3999938964844,
      "end": 303.8399963378906,
      "text": " called right we're living in a time in which they legislate wickedness but for"
    },
    {
      "id": 66,
      "start": 303.8399963378906,
      "end": 309.2799987792969,
      "text": " the child of God that is not how we determine what is sin we don't look at"
    },
    {
      "id": 67,
      "start": 309.2799987792969,
      "end": 313.760009765625,
      "text": " what's popular we don't look at what's accepted we look to the Word of God and"
    },
    {
      "id": 68,
      "start": 313.760009765625,
      "end": 319.55999755859375,
      "text": " we say no God's Word says this is sin and therefore I'm identifying sin in my"
    },
    {
      "id": 69,
      "start": 319.55999755859375,
      "end": 325.44000244140625,
      "text": " life when I do so I then come to that place where I refuse to excuse it I'm"
    },
    {
      "id": 70,
      "start": 325.44000244140625,
      "end": 330.239990234375,
      "text": " not gonna make any provision for the flesh amen I'm gonna refuse to excuse"
    },
    {
      "id": 71,
      "start": 330.239990234375,
      "end": 334.32000732421875,
      "text": " sin I'm gonna come to that place where I'm gonna confess it and I'm gonna"
    },
    {
      "id": 72,
      "start": 334.32000732421875,
      "end": 340.9599914550781,
      "text": " forsake it because we find that he that covereth his sin shall not prosper but"
    },
    {
      "id": 73,
      "start": 340.9599914550781,
      "end": 344.79998779296875,
      "text": " we have a God who is ready to pardon who is ready to forgive and what a"
    },
    {
      "id": 74,
      "start": 344.79998779296875,
      "end": 349.5199890136719,
      "text": " tremendous blessing that is and as we know all of these things that he deals"
    },
    {
      "id": 75,
      "start": 349.5199890136719,
      "end": 354.32000732421875,
      "text": " with in verses 5 through 9 we then come to the section of this book we'll look"
    },
    {
      "id": 76,
      "start": 354.32000732421875,
      "end": 358.7200012207031,
      "text": " at verses 10 through 14 this morning where he's going to now give instruction"
    },
    {
      "id": 77,
      "start": 358.7200012207031,
      "end": 364.44000244140625,
      "text": " with regard to what needs to be put on as we find in verse number 11 excuse me"
    },
    {
      "id": 78,
      "start": 364.44000244140625,
      "end": 370.4800109863281,
      "text": " verse number 12 he says this put on therefore as the elect of God holy and"
    },
    {
      "id": 79,
      "start": 370.4800109863281,
      "end": 375.20001220703125,
      "text": " beloved and then he's gonna begin the list and so this morning I've simply"
    },
    {
      "id": 80,
      "start": 375.20001220703125,
      "end": 381.2799987792969,
      "text": " entitled the message from verse number 12 put on therefore if you take some"
    },
    {
      "id": 81,
      "start": 381.2799987792969,
      "end": 386.0400085449219,
      "text": " things off if you put off you need to put on and we find that as even the"
    },
    {
      "id": 82,
      "start": 386.0400085449219,
      "end": 389.6400146484375,
      "text": " analogy would be known to these believers in Colossi we made note of it"
    },
    {
      "id": 83,
      "start": 389.6400146484375,
      "end": 393.3999938964844,
      "text": " as we've studied the last couple of weeks it's almost that picture that"
    },
    {
      "id": 84,
      "start": 393.3999938964844,
      "end": 398.8800048828125,
      "text": " analogy that example of putting off filthy garments to put on clean"
    },
    {
      "id": 85,
      "start": 398.8800048828125,
      "end": 404.239990234375,
      "text": " garments one preacher of yesteryear said it this way you put off the grave"
    },
    {
      "id": 86,
      "start": 404.239990234375,
      "end": 411.44000244140625,
      "text": " clothes to put on the grace clothes I like that Peter says that we're to be"
    },
    {
      "id": 87,
      "start": 411.44000244140625,
      "end": 417.239990234375,
      "text": " that were to be clothed in humility and we'll look at that in just a moment as"
    },
    {
      "id": 88,
      "start": 417.239990234375,
      "end": 420.0799865722656,
      "text": " we get into this list but before we look at the list I want you to notice a"
    },
    {
      "id": 89,
      "start": 420.0799865722656,
      "end": 423.6400146484375,
      "text": " couple of things in verses 10 and 11 if you're taking notes this morning from"
    },
    {
      "id": 90,
      "start": 423.6400146484375,
      "end": 427.67999267578125,
      "text": " verse number 10 I want you to note the plan God has a plan for you he has a"
    },
    {
      "id": 91,
      "start": 427.760009765625,
      "end": 431.7200012207031,
      "text": " plan for me and we find that as Paul begins here in verse number 10 he says"
    },
    {
      "id": 92,
      "start": 431.7200012207031,
      "end": 437.32000732421875,
      "text": " and have put on the new man remember he's writing to believers we find that"
    },
    {
      "id": 93,
      "start": 437.32000732421875,
      "end": 442.3599853515625,
      "text": " in Colossians 1 he's heard about the Epaphras had delivered to Paul Paul"
    },
    {
      "id": 94,
      "start": 442.3599853515625,
      "end": 447.0799865722656,
      "text": " never ministered in Colossi but Epaphras delivered to Paul about this church and"
    },
    {
      "id": 95,
      "start": 447.0799865722656,
      "end": 451.3999938964844,
      "text": " these believers and how they were growing and how God was working and Paul"
    },
    {
      "id": 96,
      "start": 451.3999938964844,
      "end": 456.0,
      "text": " was encouraged and Paul commended them and Paul prayed for them and we find"
    },
    {
      "id": 97,
      "start": 456.0,
      "end": 461.7200012207031,
      "text": " that he's speaking to these believers and he says and have put on the new man"
    },
    {
      "id": 98,
      "start": 461.7200012207031,
      "end": 468.760009765625,
      "text": " which is renewed in knowledge notice this after the image of him that created"
    },
    {
      "id": 99,
      "start": 468.760009765625,
      "end": 472.67999267578125,
      "text": " him you know that as we think about the last phrase of verse number 10 and"
    },
    {
      "id": 100,
      "start": 472.67999267578125,
      "end": 476.9599914550781,
      "text": " really note the plan that God has for us you'll find that as you study the Word"
    },
    {
      "id": 101,
      "start": 476.9599914550781,
      "end": 482.3599853515625,
      "text": " of God that you will discover that God's plan is that God's people look like God's"
    },
    {
      "id": 102,
      "start": 482.3999938964844,
      "end": 489.6000061035156,
      "text": " son amen that's God's plan according to Romans 8 verse number 29 the Bible says"
    },
    {
      "id": 103,
      "start": 489.6000061035156,
      "end": 493.8399963378906,
      "text": " that were to be conformed to the image of his dear son according to what Paul"
    },
    {
      "id": 104,
      "start": 493.8399963378906,
      "end": 497.67999267578125,
      "text": " says in Ephesus and Ephesians 1 in verse number 10 he says that we should"
    },
    {
      "id": 105,
      "start": 497.67999267578125,
      "end": 503.55999755859375,
      "text": " be holy and without blame before him in love notice that in verse number 12 he"
    },
    {
      "id": 106,
      "start": 503.55999755859375,
      "end": 509.0799865722656,
      "text": " uses some of that same phraseology holy and beloved in verse number 12 the"
    },
    {
      "id": 107,
      "start": 509.0799865722656,
      "end": 514.760009765625,
      "text": " reality is that God desires for his people to take on the image of his son"
    },
    {
      "id": 108,
      "start": 514.760009765625,
      "end": 519.2000122070312,
      "text": " they were called Christians first in Antioch the Bible tells us to be a"
    },
    {
      "id": 109,
      "start": 519.2000122070312,
      "end": 522.9600219726562,
      "text": " Christian is to be one that would follow Christ one that as someone would"
    },
    {
      "id": 110,
      "start": 522.9600219726562,
      "end": 528.52001953125,
      "text": " identify and evaluate you they would see that there are characteristics in your"
    },
    {
      "id": 111,
      "start": 528.52001953125,
      "end": 533.5999755859375,
      "text": " life that would be true of the Lord Jesus Christ we find that Peter would"
    },
    {
      "id": 112,
      "start": 533.5999755859375,
      "end": 539.6799926757812,
      "text": " say this that Jesus has left us an example that we should follow his steps"
    },
    {
      "id": 113,
      "start": 539.6799926757812,
      "end": 545.719970703125,
      "text": " what a joy to know that we can be can be conformed to the image of his dear son"
    },
    {
      "id": 114,
      "start": 545.719970703125,
      "end": 550.5599975585938,
      "text": " it's a process of putting off and putting on and I believe that the truth"
    },
    {
      "id": 115,
      "start": 550.5599975585938,
      "end": 556.3200073242188,
      "text": " that we would find with regard to this plan is really the theological term that"
    },
    {
      "id": 116,
      "start": 556.3200073242188,
      "end": 561.0399780273438,
      "text": " we would refer to as sanctification sanctification someone said this"
    },
    {
      "id": 117,
      "start": 561.0399780273438,
      "end": 567.5999755859375,
      "text": " salvation is the miracle of a moment aren't you thankful for that there's a"
    },
    {
      "id": 118,
      "start": 567.5999755859375,
      "end": 571.6400146484375,
      "text": " time that you were born again amen a date in a time a place you trust at"
    },
    {
      "id": 119,
      "start": 571.6400146484375,
      "end": 577.0399780273438,
      "text": " Christ as your Savior salvation is the miracle of a moment but sanctification"
    },
    {
      "id": 120,
      "start": 577.0399780273438,
      "end": 582.5599975585938,
      "text": " is the process of a lifetime amen we are continually listen I understand I'm"
    },
    {
      "id": 121,
      "start": 582.5599975585938,
      "end": 586.8400268554688,
      "text": " thankful that positionally I'm seated in the heavenlies according to what Paul"
    },
    {
      "id": 122,
      "start": 586.8400268554688,
      "end": 590.8400268554688,
      "text": " says to the believers in Ephesus positionally I'm sanctified but"
    },
    {
      "id": 123,
      "start": 590.8400268554688,
      "end": 595.4000244140625,
      "text": " practically speaking as we have this flesh as we're here upon this earth"
    },
    {
      "id": 124,
      "start": 595.4000244140625,
      "end": 602.0800170898438,
      "text": " there's a process of progressive sanctification that we're becoming"
    },
    {
      "id": 0,
      "start": 602.0800170898438,
      "end": 607.2800168991089,
      "text": " more and more like the Lord Jesus Christ, that we are identifying sin in our lives,"
    },
    {
      "id": 1,
      "start": 607.2800168991089,
      "end": 611.0400171279907,
      "text": " that we're seeking to walk in the power of the Holy Spirit of God, and we're"
    },
    {
      "id": 2,
      "start": 611.0400171279907,
      "end": 616.0000171661377,
      "text": " becoming like Christ. And I'm thankful that one day, according to what John says"
    },
    {
      "id": 3,
      "start": 616.0000171661377,
      "end": 620.2400169372559,
      "text": " in 1 John, that we shall see him and we shall be like him. Amen? And what a"
    },
    {
      "id": 4,
      "start": 620.2400169372559,
      "end": 625.6400165557861,
      "text": " joy that is! But until then, there's this process of sanctification. The word"
    },
    {
      "id": 5,
      "start": 625.6400165557861,
      "end": 630.6400165557861,
      "text": " means to be consecrated. It means to be set apart for a sacred purpose. I want"
    },
    {
      "id": 6,
      "start": 630.6400165557861,
      "end": 634.8000183105469,
      "text": " you to consider, as we think about this plan here in verse number 10, I want you"
    },
    {
      "id": 7,
      "start": 634.8000183105469,
      "end": 638.2400169372559,
      "text": " to consider what Paul said to the believers in Thessalonica. Hold your"
    },
    {
      "id": 8,
      "start": 638.2400169372559,
      "end": 641.4400177001953,
      "text": " place here in Colossians and turn over to 1 Thessalonians chapter number 4,"
    },
    {
      "id": 9,
      "start": 641.4400177001953,
      "end": 646.2800178527832,
      "text": " if you will. 1 Thessalonians chapter number 4. I'm going to read a couple of verses to"
    },
    {
      "id": 10,
      "start": 646.2800178527832,
      "end": 650.9200172424316,
      "text": " you. In verses 3 and 4, we see this phrase used with regard to sanctification, but I"
    },
    {
      "id": 11,
      "start": 650.9200172424316,
      "end": 656.0400161743164,
      "text": " want you to understand what Paul says to these believers. He says this, he begins"
    },
    {
      "id": 12,
      "start": 656.0400161743164,
      "end": 663.7200164794922,
      "text": " verse number 3, for this is the will of God, even your sanctification that you"
    },
    {
      "id": 13,
      "start": 663.7200164794922,
      "end": 667.8000183105469,
      "text": " should abstain from fornication. That was one of the things that was mentioned in"
    },
    {
      "id": 14,
      "start": 667.8000183105469,
      "end": 672.2400207519531,
      "text": " verse number 5, actually the first item that Paul dealt with in Colossians 3 and"
    },
    {
      "id": 15,
      "start": 672.2400207519531,
      "end": 676.400016784668,
      "text": " verse number 5. Notice verse number 4, 1 Thessalonians 4, that every one of"
    },
    {
      "id": 16,
      "start": 676.400016784668,
      "end": 684.2000198364258,
      "text": " you should know how to possess his vessel in sanctification and honor."
    },
    {
      "id": 17,
      "start": 684.2800140380859,
      "end": 691.0000152587891,
      "text": " Oftentimes our bodies are referred to as a vessel, a temple, a tabernacle. Peter"
    },
    {
      "id": 18,
      "start": 691.0000152587891,
      "end": 696.1600189208984,
      "text": " says, I must put off shortly this my tabernacle. We find our vessel, Paul uses"
    },
    {
      "id": 19,
      "start": 696.1600189208984,
      "end": 702.5600204467773,
      "text": " that phraseology with Timothy about our bodies and being a vessel that is fit"
    },
    {
      "id": 20,
      "start": 702.5600204467773,
      "end": 706.7200164794922,
      "text": " for the master's use, and we find here that Paul is encouraging these"
    },
    {
      "id": 21,
      "start": 706.7200164794922,
      "end": 713.0000152587891,
      "text": " believers in Thessalonica with regard to sanctification. I know I've said it in"
    },
    {
      "id": 22,
      "start": 713.0000152587891,
      "end": 719.0000152587891,
      "text": " the past, it's worth repeating, you're as close to God today as you want to be."
    },
    {
      "id": 23,
      "start": 719.0000152587891,
      "end": 722.8400192260742,
      "text": " You're as close to God today as you want to be. I'm as close to God today as I"
    },
    {
      "id": 24,
      "start": 722.8400192260742,
      "end": 727.9600143432617,
      "text": " want to be. The reality is that we read our Bibles as much as we want to, we pray"
    },
    {
      "id": 25,
      "start": 727.9600143432617,
      "end": 732.0400238037109,
      "text": " as much as we want to, we attend church as much as we want to, we do all of the"
    },
    {
      "id": 26,
      "start": 732.0400238037109,
      "end": 736.9600219726562,
      "text": " things as much as we desire to do so, and we find that that process of"
    },
    {
      "id": 27,
      "start": 736.9600219726562,
      "end": 741.5600128173828,
      "text": " sanctification. I wonder this morning, see there are times in which, have you ever"
    },
    {
      "id": 28,
      "start": 741.5600128173828,
      "end": 745.4400177001953,
      "text": " been in a place in a position in which maybe if you're a sports fan it's kind"
    },
    {
      "id": 29,
      "start": 745.4400177001953,
      "end": 749.0400238037109,
      "text": " of extra innings or overtime or whatever, you're kind of glued to, you want to"
    },
    {
      "id": 30,
      "start": 749.0400238037109,
      "end": 752.3200225830078,
      "text": " listen in and and find out what's going on, and somebody's calling you for"
    },
    {
      "id": 31,
      "start": 752.3200225830078,
      "end": 755.2800140380859,
      "text": " something else that needs to take place, you need to be somewhere else, you know"
    },
    {
      "id": 32,
      "start": 755.2800140380859,
      "end": 758.1600189208984,
      "text": " like you're just glued to it, you don't want to leave, you don't want to be"
    },
    {
      "id": 33,
      "start": 758.1600189208984,
      "end": 762.8800201416016,
      "text": " distracted, you want to see what happens, you want to see the end. I wonder if we've"
    },
    {
      "id": 34,
      "start": 762.8800201416016,
      "end": 767.2400207519531,
      "text": " ever had that same feeling when it comes to reading our Bibles, when it comes to"
    },
    {
      "id": 35,
      "start": 767.2400207519531,
      "end": 771.5600128173828,
      "text": " praying, when someone would beckon us for some other duty, some other"
    },
    {
      "id": 36,
      "start": 771.5600128173828,
      "end": 775.8800201416016,
      "text": " responsibility that it's just like, man I don't want to leave because it's so"
    },
    {
      "id": 37,
      "start": 775.8800201416016,
      "end": 781.0800170898438,
      "text": " rich and it's so wonderful being in his presence and I'm enjoying this and I"
    },
    {
      "id": 38,
      "start": 781.0800170898438,
      "end": 785.7200164794922,
      "text": " don't want to leave this, and perhaps you may have to for whatever the reason may"
    },
    {
      "id": 39,
      "start": 785.7200164794922,
      "end": 790.0800170898438,
      "text": " be, but I just wonder this morning how much do we really love the Lord and love"
    },
    {
      "id": 40,
      "start": 790.0800170898438,
      "end": 793.9600219726562,
      "text": " his Word? The psalmist cries out in Psalm 119,"
    },
    {
      "id": 41,
      "start": 793.9600219726562,
      "end": 801.6800231933594,
      "text": " oh how love I thy law, it is my meditation all the day long. Not only do"
    },
    {
      "id": 42,
      "start": 801.6800231933594,
      "end": 806.0400238037109,
      "text": " we note the plan here in verse number 10, but I want you to note a principle that"
    },
    {
      "id": 43,
      "start": 806.0400238037109,
      "end": 811.1600189208984,
      "text": " is given to us in verse number 11. This is an important principle. The Bible"
    },
    {
      "id": 44,
      "start": 811.1600189208984,
      "end": 815.760009765625,
      "text": " says this, where there is neither Greek nor Jew, circumcision nor uncircumcision,"
    },
    {
      "id": 45,
      "start": 815.760009765625,
      "end": 823.0400238037109,
      "text": " barbarian, Scythian, bond nor free, but Christ is all and in all. And I want you"
    },
    {
      "id": 46,
      "start": 823.0400238037109,
      "end": 827.4400177001953,
      "text": " to notice that last phrase in verse number 11 where he says, Christ is all and in all."
    },
    {
      "id": 47,
      "start": 827.4400177001953,
      "end": 831.2000122070312,
      "text": " I am thankful that it's all about the Lord Jesus Christ. We are reminded in"
    },
    {
      "id": 48,
      "start": 831.2000122070312,
      "end": 836.0400238037109,
      "text": " Colossians 1 in verse number 18 that he is to have the preeminence, that in all"
    },
    {
      "id": 49,
      "start": 836.0400238037109,
      "end": 839.9600219726562,
      "text": " things he would have the preeminence, that he would have that first place, that"
    },
    {
      "id": 50,
      "start": 839.9600219726562,
      "end": 844.8000183105469,
      "text": " first position, and we understand that it's all about Christ. But we find that"
    },
    {
      "id": 51,
      "start": 844.8000183105469,
      "end": 848.6000213623047,
      "text": " as Paul would give in verse number 11 when he's making these distinctions, he"
    },
    {
      "id": 52,
      "start": 848.6000213623047,
      "end": 854.0000152587891,
      "text": " says there is neither Greek nor Jew, circumcision nor uncircumcision,"
    },
    {
      "id": 53,
      "start": 854.0000152587891,
      "end": 860.0400085449219,
      "text": " barbarian, Scythian, bond nor free. I believe that the principle that Paul is"
    },
    {
      "id": 54,
      "start": 860.0400085449219,
      "end": 864.1600036621094,
      "text": " communicating to these believers in Colossae, and what a great principle for"
    },
    {
      "id": 55,
      "start": 864.1600036621094,
      "end": 869.6800231933594,
      "text": " us to understand this morning, is that in Christ there is no partiality. There is"
    },
    {
      "id": 56,
      "start": 869.6800231933594,
      "end": 873.6400146484375,
      "text": " no partiality in Christ. I'm thankful this morning that our God is no"
    },
    {
      "id": 57,
      "start": 873.6400146484375,
      "end": 879.8000183105469,
      "text": " respecter of persons, aren't you? And we too are to be no respecter of persons."
    },
    {
      "id": 58,
      "start": 879.8000183105469,
      "end": 883.9200134277344,
      "text": " There's no partiality. Listen to what Paul says in the book of"
    },
    {
      "id": 59,
      "start": 883.9200134277344,
      "end": 888.4400024414062,
      "text": " Galatians. Turn to Galatians chapter number 3. Notice a couple of verses here."
    },
    {
      "id": 60,
      "start": 888.4400024414062,
      "end": 892.9200134277344,
      "text": " Of course they were dealing with some of the very things here in the region of"
    },
    {
      "id": 61,
      "start": 892.9200134277344,
      "end": 896.4000244140625,
      "text": " Galatia where these Judaizers were coming in and all sorts of things. There"
    },
    {
      "id": 62,
      "start": 896.4000244140625,
      "end": 901.1200256347656,
      "text": " was division. You understand that this thing of partiality goes all the way"
    },
    {
      "id": 63,
      "start": 901.1200256347656,
      "end": 906.0000305175781,
      "text": " back to the beginning of human history. This is nothing new for us in the 21st"
    },
    {
      "id": 64,
      "start": 906.0000305175781,
      "end": 909.2400207519531,
      "text": " century to deal with this subject of partiality. This is something that's"
    },
    {
      "id": 65,
      "start": 909.2400207519531,
      "end": 914.6000061035156,
      "text": " existed for millennia, and the reality is that we find in the Word of God that"
    },
    {
      "id": 66,
      "start": 914.6000061035156,
      "end": 919.4400024414062,
      "text": " there's to be no partiality. What a great principle this is. In Galatians chapter"
    },
    {
      "id": 67,
      "start": 919.4400024414062,
      "end": 922.760009765625,
      "text": " number 3 and verse number 28, notice he says there is neither Jew nor Greek,"
    },
    {
      "id": 68,
      "start": 922.760009765625,
      "end": 926.8800048828125,
      "text": " there is neither bond nor free, there is neither male nor female, for ye are all"
    },
    {
      "id": 69,
      "start": 927.0000305175781,
      "end": 934.8400268554688,
      "text": " one in Christ Jesus. We find that in chapter number 5 of the book of Galatians,"
    },
    {
      "id": 70,
      "start": 934.8400268554688,
      "end": 940.760009765625,
      "text": " notice in verse number 6, he says, for in Jesus Christ neither circumcision availeth"
    },
    {
      "id": 71,
      "start": 940.760009765625,
      "end": 948.1200256347656,
      "text": " anything nor uncircumcision, but faith which worketh by love. I'm thankful for"
    },
    {
      "id": 72,
      "start": 948.1200256347656,
      "end": 952.1200256347656,
      "text": " the truth that God has given us in His Word with regard to this subject and how"
    },
    {
      "id": 73,
      "start": 952.1200256347656,
      "end": 956.1600036621094,
      "text": " relevant it is even for the day in which we're living, and you understand that in"
    },
    {
      "id": 74,
      "start": 956.1600036621094,
      "end": 961.3600158691406,
      "text": " Christ there is no ethnic, no culture, no economic, no racial, no social"
    },
    {
      "id": 75,
      "start": 961.3600158691406,
      "end": 966.5600280761719,
      "text": " distinction. We are in Christ. I've often said from this pulpit for many, many"
    },
    {
      "id": 76,
      "start": 966.5600280761719,
      "end": 970.3600158691406,
      "text": " years, I've said from this pulpit that there are two categories of people in"
    },
    {
      "id": 77,
      "start": 970.3600158691406,
      "end": 973.4400024414062,
      "text": " our world. There are people that are saved, and there are people that are lost."
    },
    {
      "id": 78,
      "start": 973.4400024414062,
      "end": 977.0800170898438,
      "text": " And the duty of the people that are saved is to preach the gospel to the"
    },
    {
      "id": 79,
      "start": 977.0800170898438,
      "end": 983.0400085449219,
      "text": " people that are lost. Amen? There's no partiality in Christ, and we find that"
    },
    {
      "id": 80,
      "start": 983.0800170898438,
      "end": 988.7200317382812,
      "text": " division is a work of the enemy. We find that the enemy seeks to divide, and oh"
    },
    {
      "id": 81,
      "start": 988.7200317382812,
      "end": 996.7200317382812,
      "text": " how successful he is on dividing people. And we've seen even in our own recent"
    },
    {
      "id": 82,
      "start": 996.7200317382812,
      "end": 1001.0400085449219,
      "text": " history here in this country, we've seen the way in which the enemy seeks to"
    },
    {
      "id": 83,
      "start": 1001.0400085449219,
      "end": 1006.2400207519531,
      "text": " divide. But in Christ, we understand, listen, the Bible, what did Jesus say?"
    },
    {
      "id": 84,
      "start": 1006.2400207519531,
      "end": 1011.2000122070312,
      "text": " The truth shall make you free. Man, I'm so thankful for the truth of God's Word."
    },
    {
      "id": 85,
      "start": 1011.280029296875,
      "end": 1016.6000061035156,
      "text": " Remember what Jesus said in John chapter 4? I must needs go through Samaria."
    },
    {
      "id": 86,
      "start": 1016.6000061035156,
      "end": 1021.6000061035156,
      "text": " You know that the Jewish people hated the Samaritans. There was a, I mean, a"
    },
    {
      "id": 87,
      "start": 1021.6000061035156,
      "end": 1026.2000122070312,
      "text": " deep hatred that they had for the Samaritans, and you would find that they"
    },
    {
      "id": 88,
      "start": 1026.2000122070312,
      "end": 1031.0400085449219,
      "text": " would go out of their way, they would take more time to travel, even in adverse"
    },
    {
      "id": 89,
      "start": 1031.0400085449219,
      "end": 1038.8800048828125,
      "text": " circumstances, in order to avoid going through Samaria. But Jesus, he was"
    },
    {
      "id": 90,
      "start": 1038.8800048828125,
      "end": 1044.3600158691406,
      "text": " teaching a truth. He was teaching something to those disciples that they"
    },
    {
      "id": 91,
      "start": 1044.3600158691406,
      "end": 1048.2000122070312,
      "text": " needed to understand. Why? Because one day they would receive the Great Commission"
    },
    {
      "id": 92,
      "start": 1048.2000122070312,
      "end": 1052.1200256347656,
      "text": " where Jesus would say, but you shall receive power after the Holy Ghost has"
    },
    {
      "id": 93,
      "start": 1052.1200256347656,
      "end": 1056.0400085449219,
      "text": " come upon you, and you should be witnesses unto me, both in Jerusalem and"
    },
    {
      "id": 94,
      "start": 1056.0400085449219,
      "end": 1061.0400085449219,
      "text": " Judea. What is it? Samaria, and under the uttermost part of the earth, right? And so"
    },
    {
      "id": 95,
      "start": 1061.0400085449219,
      "end": 1066.2000122070312,
      "text": " they are to be witnesses. But they hated the Samaritans, and so as Jesus would"
    },
    {
      "id": 96,
      "start": 1066.2000122070312,
      "end": 1070.6400146484375,
      "text": " give that command, no doubt those disciples would be mindful of the"
    },
    {
      "id": 97,
      "start": 1070.6400146484375,
      "end": 1076.280029296875,
      "text": " example of Christ back in John chapter 4, when he went through Samaria, and of"
    },
    {
      "id": 98,
      "start": 1076.280029296875,
      "end": 1080.7200317382812,
      "text": " course we know that he met that woman at the well. And oh man, there's a lot"
    },
    {
      "id": 99,
      "start": 1080.7200317382812,
      "end": 1084.6800231933594,
      "text": " of people that got saved as a result of that, amen? There are many that came to"
    },
    {
      "id": 100,
      "start": 1084.6800231933594,
      "end": 1088.8000183105469,
      "text": " Christ, and what a blessing. And we need to be careful to understand the principle"
    },
    {
      "id": 101,
      "start": 1088.8000183105469,
      "end": 1092.2000122070312,
      "text": " that God has given us. Remember this, in Revelation 5, you don't need to turn"
    },
    {
      "id": 102,
      "start": 1092.2000122070312,
      "end": 1096.0000305175781,
      "text": " there, but in verse number 9, the Bible says, and they sung a new song saying,"
    },
    {
      "id": 103,
      "start": 1096.0000305175781,
      "end": 1101.3200073242188,
      "text": " thou art worthy to take the book and to open the seals thereof, for thou was"
    },
    {
      "id": 104,
      "start": 1101.3200073242188,
      "end": 1106.7200317382812,
      "text": " slain and hast redeemed us to God by thy blood, notice this, out of every kindred"
    },
    {
      "id": 105,
      "start": 1106.7200317382812,
      "end": 1113.760009765625,
      "text": " and tongue and people and nation in Christ, amen? I'm so thankful for the"
    },
    {
      "id": 106,
      "start": 1113.760009765625,
      "end": 1120.0,
      "text": " principle that Paul begins this section with here in Colossians 3. Notice now, as"
    },
    {
      "id": 107,
      "start": 1120.3600463867188,
      "end": 1124.9200439453125,
      "text": " we get into this process, we've noted the plan. God's plan is that you and I would"
    },
    {
      "id": 108,
      "start": 1124.9200439453125,
      "end": 1129.4400024414062,
      "text": " be conformed to the image of his dear Son, that we would be like Christ. We find"
    },
    {
      "id": 109,
      "start": 1129.4400024414062,
      "end": 1133.9600219726562,
      "text": " that there's a principle, there's no partiality, that Christ is all and in all,"
    },
    {
      "id": 110,
      "start": 1133.9600219726562,
      "end": 1140.4000244140625,
      "text": " and now we note the process. He says in verse number 12, put on, therefore, as the"
    },
    {
      "id": 111,
      "start": 1140.4000244140625,
      "end": 1145.0,
      "text": " elect of God, holy and beloved. That's our position, that's our standing. I'm"
    },
    {
      "id": 112,
      "start": 1145.0,
      "end": 1150.1600341796875,
      "text": " thankful to be saved, to know the Lord Jesus Christ as my personal Savior, and"
    },
    {
      "id": 113,
      "start": 1150.1600341796875,
      "end": 1153.8400268554688,
      "text": " then he's going to go through eight items that he's going to provide for us"
    },
    {
      "id": 114,
      "start": 1153.8400268554688,
      "end": 1161.1600341796875,
      "text": " in verse 12, 13, and 14. Notice with me as we take the bulk of our time this morning"
    },
    {
      "id": 115,
      "start": 1161.1600341796875,
      "end": 1165.0400390625,
      "text": " to deal with each of these particular items that are referenced in these"
    },
    {
      "id": 116,
      "start": 1165.0400390625,
      "end": 1170.3600463867188,
      "text": " verses of Scripture. In verse number 12, he starts out by saying this, bowels of"
    },
    {
      "id": 117,
      "start": 1170.3600463867188,
      "end": 1175.280029296875,
      "text": " mercies. Bowels of mercies. Now you'd understand in this particular era, in"
    },
    {
      "id": 118,
      "start": 1175.280029296875,
      "end": 1180.9200439453125,
      "text": " this particular culture, the bowels would be known as and referred to as the seat"
    },
    {
      "id": 119,
      "start": 1180.9200439453125,
      "end": 1185.7200317382812,
      "text": " of emotions. For us this morning, we would say from our heart, right? You hear"
    },
    {
      "id": 120,
      "start": 1185.7200317382812,
      "end": 1190.0800170898438,
      "text": " somebody say, I love you with all of my heart. It'd be really weird if somebody"
    },
    {
      "id": 121,
      "start": 1190.0800170898438,
      "end": 1193.7200317382812,
      "text": " said to you, in our culture, I love you with all of my bowels. You'd be like, what"
    },
    {
      "id": 122,
      "start": 1193.7200317382812,
      "end": 1198.9600219726562,
      "text": " in the world, right? But that was their understanding of the seat of emotions."
    },
    {
      "id": 123,
      "start": 1198.9600219726562,
      "end": 1204.1199951171875,
      "text": " And so we find for us, we would use the word"
    },
    {
      "id": 0,
      "start": 1204.1199951171875,
      "end": 1208.3599948883057,
      "text": " heart, and I just want us to make that connection this morning for us to"
    },
    {
      "id": 1,
      "start": 1208.3599948883057,
      "end": 1212.7599954605103,
      "text": " understand that Paul is saying bowels of mercies."
    },
    {
      "id": 2,
      "start": 1212.7599954605103,
      "end": 1216.9999952316284,
      "text": " It really is the idea of having a heart of compassion."
    },
    {
      "id": 3,
      "start": 1216.9999952316284,
      "end": 1220.5999946594238,
      "text": " A heart of compassion. You know I'm thankful this morning that our God is"
    },
    {
      "id": 4,
      "start": 1220.5999946594238,
      "end": 1224.759994506836,
      "text": " compassionate, aren't you? The Bible declares to us that He's"
    },
    {
      "id": 5,
      "start": 1224.759994506836,
      "end": 1227.8799953460693,
      "text": " compassionate. The Bible not only declares to us, but we"
    },
    {
      "id": 6,
      "start": 1227.8799953460693,
      "end": 1231.1599960327148,
      "text": " find that on a number of occasions during the life and ministry"
    },
    {
      "id": 7,
      "start": 1231.1599960327148,
      "end": 1235.239995956421,
      "text": " of the Lord Jesus Christ, that He was moved with compassion."
    },
    {
      "id": 8,
      "start": 1235.239995956421,
      "end": 1239.8799934387207,
      "text": " He was moved with compassion, and it is that heart of compassion that we"
    },
    {
      "id": 9,
      "start": 1239.8799934387207,
      "end": 1243.7999954223633,
      "text": " as the people of God, this idea of bowels of mercies, to be"
    },
    {
      "id": 10,
      "start": 1243.7999954223633,
      "end": 1247.8799934387207,
      "text": " merciful, pitiful, to have that heart of compassion. Notice"
    },
    {
      "id": 11,
      "start": 1247.8799934387207,
      "end": 1250.9999961853027,
      "text": " He continues and He says not only bowels of mercies, but"
    },
    {
      "id": 12,
      "start": 1250.9999961853027,
      "end": 1256.5199966430664,
      "text": " kindness. You know kindness seems to just be missing in our society today, amen?"
    },
    {
      "id": 13,
      "start": 1256.5199966430664,
      "end": 1259.7999954223633,
      "text": " I mean people just don't know how to be kind to one another anymore,"
    },
    {
      "id": 14,
      "start": 1259.7999954223633,
      "end": 1263.8799934387207,
      "text": " and I like this explanation or definition of kindness."
    },
    {
      "id": 15,
      "start": 1263.8799934387207,
      "end": 1270.599998474121,
      "text": " This is delight in contributing to the happiness of others."
    },
    {
      "id": 16,
      "start": 1270.599998474121,
      "end": 1274.359992980957,
      "text": " I like that definition of kindness. Delight"
    },
    {
      "id": 17,
      "start": 1274.359992980957,
      "end": 1278.0399932861328,
      "text": " in contributing to the happiness of others."
    },
    {
      "id": 18,
      "start": 1278.0399932861328,
      "end": 1283.3999938964844,
      "text": " To be kind. Aren't you thankful that God is kind?"
    },
    {
      "id": 19,
      "start": 1283.479995727539,
      "end": 1288.9199981689453,
      "text": " The idea of kindness is goodwill or benevolence."
    },
    {
      "id": 20,
      "start": 1288.9199981689453,
      "end": 1295.3199920654297,
      "text": " In Ephesians 4, in verse number 32, Paul says be kind one to another."
    },
    {
      "id": 21,
      "start": 1295.3199920654297,
      "end": 1299.0799942016602,
      "text": " Be kind one to another. And here he's saying that"
    },
    {
      "id": 22,
      "start": 1299.0799942016602,
      "end": 1303.0799942016602,
      "text": " we've put off some things, all of those items that were mentioned, and really"
    },
    {
      "id": 23,
      "start": 1303.0799942016602,
      "end": 1306.9199981689453,
      "text": " it's a great contrast if you look at the items that were mentioned to us"
    },
    {
      "id": 24,
      "start": 1306.9199981689453,
      "end": 1310.0399932861328,
      "text": " in verse 8 and 9 of those things that were to put off"
    },
    {
      "id": 25,
      "start": 1310.0399932861328,
      "end": 1313.7999954223633,
      "text": " anger, wrath, malice, blasphemy, filthy communication, and lying."
    },
    {
      "id": 26,
      "start": 1313.7999954223633,
      "end": 1317.2399978637695,
      "text": " And you think about those items that were given to us, and now you"
    },
    {
      "id": 27,
      "start": 1317.3199920654297,
      "end": 1321.3199920654297,
      "text": " contrast those with the list that we're going to look at this morning,"
    },
    {
      "id": 28,
      "start": 1321.3199920654297,
      "end": 1327.3199920654297,
      "text": " and it starts with bowels of mercies. Kindness. I mean how much opposite could"
    },
    {
      "id": 29,
      "start": 1327.3199920654297,
      "end": 1333.0800018310547,
      "text": " you be of anger and wrath and malice? And we're to put off those things, that's"
    },
    {
      "id": 30,
      "start": 1333.0800018310547,
      "end": 1335.479995727539,
      "text": " the old man, that's the flesh, and we're to"
    },
    {
      "id": 31,
      "start": 1335.479995727539,
      "end": 1340.6799926757812,
      "text": " put on these things, we're to walk in the Spirit, we're to have the fruit of the"
    },
    {
      "id": 32,
      "start": 1340.6799926757812,
      "end": 1344.6799926757812,
      "text": " Spirit. Notice he says this,"
    },
    {
      "id": 33,
      "start": 1344.6799926757812,
      "end": 1348.6799926757812,
      "text": " humbleness of mind, number three in the list,"
    },
    {
      "id": 34,
      "start": 1348.6799926757812,
      "end": 1355.7200012207031,
      "text": " humbleness of mind, humility, lowliness of mind, it's the antithesis of pride."
    },
    {
      "id": 35,
      "start": 1356.8399963378906,
      "end": 1362.5999908447266,
      "text": " God says that he hates pride. Amen? That's what God says about pride."
    },
    {
      "id": 36,
      "start": 1362.5999908447266,
      "end": 1369.239990234375,
      "text": " God says this, that he is going to, he will give grace to the humble,"
    },
    {
      "id": 37,
      "start": 1369.239990234375,
      "end": 1373.3199920654297,
      "text": " but not to the prideful, right? He resisteth"
    },
    {
      "id": 38,
      "start": 1373.3199920654297,
      "end": 1376.9199981689453,
      "text": " the proud, but he gives grace unto the humble."
    },
    {
      "id": 39,
      "start": 1376.9199981689453,
      "end": 1382.9199981689453,
      "text": " By pride comes contention, by pride and haughtiness of spirit comes a fall."
    },
    {
      "id": 40,
      "start": 1382.9199981689453,
      "end": 1388.1999969482422,
      "text": " We find that comes destruction and contention, and we find all of this with"
    },
    {
      "id": 41,
      "start": 1388.1999969482422,
      "end": 1392.0399932861328,
      "text": " regard to pride, but no, this is"
    },
    {
      "id": 42,
      "start": 1392.0399932861328,
      "end": 1396.1199951171875,
      "text": " humbleness of mind, the antithesis of pride, the fact that we're to"
    },
    {
      "id": 43,
      "start": 1396.1199951171875,
      "end": 1402.6799926757812,
      "text": " to be humble, to have that humility as a child of God. Notice in Philippians 2,"
    },
    {
      "id": 44,
      "start": 1402.6799926757812,
      "end": 1407.3999938964844,
      "text": " turn over if you will, I love the the book of Philippians,"
    },
    {
      "id": 45,
      "start": 1407.3999938964844,
      "end": 1412.759994506836,
      "text": " in the second chapter has great truth with regard to the subject of"
    },
    {
      "id": 46,
      "start": 1412.759994506836,
      "end": 1416.9199981689453,
      "text": " humility, and I want you to notice as we look at"
    },
    {
      "id": 47,
      "start": 1416.9199981689453,
      "end": 1418.9199981689453,
      "text": " this portion of scripture that we'll use,"
    },
    {
      "id": 48,
      "start": 1418.9199981689453,
      "end": 1423.3199920654297,
      "text": " the Lord Jesus Christ will be a great example that is given to us here in this"
    },
    {
      "id": 49,
      "start": 1423.3199920654297,
      "end": 1427.239990234375,
      "text": " portion, but notice how Paul begins in verse number one to these believers in"
    },
    {
      "id": 50,
      "start": 1427.239990234375,
      "end": 1430.9199981689453,
      "text": " Philippi, if there be therefore any consolation in Christ,"
    },
    {
      "id": 51,
      "start": 1430.9199981689453,
      "end": 1434.1999969482422,
      "text": " if any comfort of love, if any fellowship of the Spirit,"
    },
    {
      "id": 52,
      "start": 1434.1999969482422,
      "end": 1437.8799896240234,
      "text": " if any bowels and mercies fulfill you my joy,"
    },
    {
      "id": 53,
      "start": 1437.8799896240234,
      "end": 1442.3600006103516,
      "text": " that you be like-minded, having the same love, being of one accord, of one mind."
    },
    {
      "id": 54,
      "start": 1442.3600006103516,
      "end": 1447.3999938964844,
      "text": " Notice verse number three, let nothing be done through strife or vainglory,"
    },
    {
      "id": 55,
      "start": 1447.3999938964844,
      "end": 1451.239990234375,
      "text": " but in lowliness of mind let each esteem other"
    },
    {
      "id": 56,
      "start": 1451.239990234375,
      "end": 1455.239990234375,
      "text": " better than themselves. Look not every man on his own things,"
    },
    {
      "id": 57,
      "start": 1455.239990234375,
      "end": 1459.7999877929688,
      "text": " but every man also on the things of others."
    },
    {
      "id": 58,
      "start": 1459.7999877929688,
      "end": 1463.9599914550781,
      "text": " And then Paul, after he gives this charge, this instruction, the believers"
    },
    {
      "id": 59,
      "start": 1463.9599914550781,
      "end": 1467.3200073242188,
      "text": " here in Philippi, and he's encouraging them with the"
    },
    {
      "id": 60,
      "start": 1467.3200073242188,
      "end": 1472.3599853515625,
      "text": " idea of having unity, to be like-minded in verse number two, to"
    },
    {
      "id": 61,
      "start": 1472.3599853515625,
      "end": 1475.9599914550781,
      "text": " have humility, to put off strife and vainglory,"
    },
    {
      "id": 62,
      "start": 1475.9599914550781,
      "end": 1480.1999816894531,
      "text": " that is referred to in verse number three, to have that humility again in"
    },
    {
      "id": 63,
      "start": 1480.1999816894531,
      "end": 1482.4400024414062,
      "text": " verse number four, then he says in verse number five,"
    },
    {
      "id": 64,
      "start": 1482.4400024414062,
      "end": 1486.1199951171875,
      "text": " let this mind be in you, which was also in Christ Jesus."
    },
    {
      "id": 65,
      "start": 1486.1199951171875,
      "end": 1490.2799987792969,
      "text": " He's going to use the example of the Lord Jesus Christ, and he says here,"
    },
    {
      "id": 66,
      "start": 1490.2799987792969,
      "end": 1495.0,
      "text": " who being in the form of God, thought it not robbery to be equal with God,"
    },
    {
      "id": 67,
      "start": 1495.0,
      "end": 1500.2799987792969,
      "text": " but made himself of no reputation, and took upon him the form of a servant, and"
    },
    {
      "id": 68,
      "start": 1500.2799987792969,
      "end": 1504.3599853515625,
      "text": " was made in the likeness of men. Being found in"
    },
    {
      "id": 69,
      "start": 1504.3599853515625,
      "end": 1507.3200073242188,
      "text": " fashion as a man, notice he humbled himself,"
    },
    {
      "id": 70,
      "start": 1507.3200073242188,
      "end": 1513.6399841308594,
      "text": " and became obedient unto death, even the death of the cross."
    },
    {
      "id": 71,
      "start": 1513.6399841308594,
      "end": 1518.6000061035156,
      "text": " I wonder how often we consider the humility of the Lord Jesus Christ,"
    },
    {
      "id": 72,
      "start": 1518.6000061035156,
      "end": 1522.8399963378906,
      "text": " not only in his incarnation, but in his crucifixion."
    },
    {
      "id": 73,
      "start": 1522.8399963378906,
      "end": 1526.5199890136719,
      "text": " You think about the way in which he left the glory of heaven."
    },
    {
      "id": 74,
      "start": 1526.5199890136719,
      "end": 1530.3599853515625,
      "text": " He left all that, he says in John 17, as he's praying,"
    },
    {
      "id": 75,
      "start": 1530.3599853515625,
      "end": 1533.47998046875,
      "text": " before he would go to the cross, he says the hour has come,"
    },
    {
      "id": 76,
      "start": 1533.47998046875,
      "end": 1537.0799865722656,
      "text": " and he speaks about the glory that he enjoyed before,"
    },
    {
      "id": 77,
      "start": 1537.0799865722656,
      "end": 1541.8800048828125,
      "text": " by understanding the truth that he's eternal, that he is God."
    },
    {
      "id": 78,
      "start": 1541.8800048828125,
      "end": 1548.9199829101562,
      "text": " He is God in flesh, and he put off that glory, and he left the glories of"
    },
    {
      "id": 79,
      "start": 1548.9199829101562,
      "end": 1552.4400024414062,
      "text": " heaven, so that he could come and die for you,"
    },
    {
      "id": 80,
      "start": 1552.4400024414062,
      "end": 1558.1199951171875,
      "text": " and die for me. What picture of humility."
    },
    {
      "id": 81,
      "start": 1558.1199951171875,
      "end": 1562.9199829101562,
      "text": " What example for us as the people of God. In fact, I believe that's the very thing"
    },
    {
      "id": 82,
      "start": 1562.9199829101562,
      "end": 1566.1199951171875,
      "text": " that Peter was referring to, as I mentioned a moment ago,"
    },
    {
      "id": 83,
      "start": 1566.1199951171875,
      "end": 1570.6000061035156,
      "text": " that Peter says that we're to follow his steps, that he, the Lord, left us an"
    },
    {
      "id": 84,
      "start": 1570.6000061035156,
      "end": 1573.7200012207031,
      "text": " example. But as we find that in the context of"
    },
    {
      "id": 85,
      "start": 1573.7200012207031,
      "end": 1577.7999877929688,
      "text": " which Peter is referring to, he says, for even hereunto were you"
    },
    {
      "id": 86,
      "start": 1577.7999877929688,
      "end": 1580.8399963378906,
      "text": " called, because Christ also suffered for us,"
    },
    {
      "id": 87,
      "start": 1580.8399963378906,
      "end": 1584.9199829101562,
      "text": " leaving us an example that you should follow his steps, who did no sin,"
    },
    {
      "id": 88,
      "start": 1584.9199829101562,
      "end": 1590.1199951171875,
      "text": " neither was guile found in his mouth, who, when he was reviled, reviled not again,"
    },
    {
      "id": 89,
      "start": 1590.1199951171875,
      "end": 1595.6399841308594,
      "text": " when he suffered, he threatened not, but committed himself to him that"
    },
    {
      "id": 90,
      "start": 1595.6399841308594,
      "end": 1598.2799987792969,
      "text": " judgeth righteously, who his own self bear"
    },
    {
      "id": 91,
      "start": 1598.2799987792969,
      "end": 1602.0400085449219,
      "text": " our sins in his own body on the tree, that we,"
    },
    {
      "id": 92,
      "start": 1602.0400085449219,
      "end": 1605.6399841308594,
      "text": " being dead to sin, should live unto righteousness,"
    },
    {
      "id": 93,
      "start": 1605.6399841308594,
      "end": 1612.3599853515625,
      "text": " by whose stripes ye are healed.\" You know, the reality that we're saved"
    },
    {
      "id": 94,
      "start": 1612.3599853515625,
      "end": 1616.3599853515625,
      "text": " and that we're the people of God and home is our heaven,"
    },
    {
      "id": 95,
      "start": 1616.3599853515625,
      "end": 1619.8800048828125,
      "text": " that shouldn't lead us to a place of pride."
    },
    {
      "id": 96,
      "start": 1619.8800048828125,
      "end": 1624.4400024414062,
      "text": " If we're not careful, it can lead us to a place of looking down upon others that"
    },
    {
      "id": 97,
      "start": 1624.4400024414062,
      "end": 1627.3999938964844,
      "text": " they don't have the truth, they've not come to the truth, and"
    },
    {
      "id": 98,
      "start": 1627.3999938964844,
      "end": 1630.5199890136719,
      "text": " we can become prideful in our position and in our"
    },
    {
      "id": 99,
      "start": 1630.5199890136719,
      "end": 1634.0400085449219,
      "text": " our understanding of the truth, but the reality is that,"
    },
    {
      "id": 100,
      "start": 1634.0400085449219,
      "end": 1637.8800048828125,
      "text": " as the songwriter said, I'm a sinner saved by grace."
    },
    {
      "id": 101,
      "start": 1637.8800048828125,
      "end": 1641.0799865722656,
      "text": " Amen? I'm so thankful for the grace of God."
    },
    {
      "id": 102,
      "start": 1641.0799865722656,
      "end": 1645.7200012207031,
      "text": " Deborah sang this morning, Amazing Grace. It is amazing, is it not?"
    },
    {
      "id": 103,
      "start": 1645.7200012207031,
      "end": 1649.7200012207031,
      "text": " And I know for many that's a favorite hymn. I know"
    },
    {
      "id": 104,
      "start": 1649.7200012207031,
      "end": 1654.2799987792969,
      "text": " Mr. Don often will mention, even as you get anywhere within the 180s of our"
    },
    {
      "id": 105,
      "start": 1654.2799987792969,
      "end": 1658.1999816894531,
      "text": " songbook, why can't it be 187? Because that's Amazing Grace."
    },
    {
      "id": 106,
      "start": 1658.1999816894531,
      "end": 1662.5199890136719,
      "text": " There's nothing else in the 180s in our songbook that he would rather sing."
    },
    {
      "id": 107,
      "start": 1662.5199890136719,
      "end": 1666.6000061035156,
      "text": " And the reality is that God's grace is amazing,"
    },
    {
      "id": 108,
      "start": 1666.6000061035156,
      "end": 1670.3599853515625,
      "text": " but we find here that, as the people of God, we're to be clothed"
    },
    {
      "id": 109,
      "start": 1670.3599853515625,
      "end": 1675.7200012207031,
      "text": " in humility. We're to put on, as we find here in Colossians 3,"
    },
    {
      "id": 110,
      "start": 1675.7200012207031,
      "end": 1679.3200073242188,
      "text": " not only bowels of mercies, not only kindness, but we find"
    },
    {
      "id": 111,
      "start": 1679.3200073242188,
      "end": 1686.5199890136719,
      "text": " humbleness of mind, the antithesis of pride. Oh, that it would not be said of"
    },
    {
      "id": 112,
      "start": 1686.5199890136719,
      "end": 1692.1199951171875,
      "text": " the people of God, of us individually here this morning, that we're prideful,"
    },
    {
      "id": 113,
      "start": 1692.1199951171875,
      "end": 1696.3599853515625,
      "text": " that we're prideful, because God resisteth the proud."
    },
    {
      "id": 114,
      "start": 1696.3599853515625,
      "end": 1699.6399841308594,
      "text": " Not only does God resist the proud, but you understand that God knows how to"
    },
    {
      "id": 115,
      "start": 1699.6399841308594,
      "end": 1704.5199890136719,
      "text": " humble you. The Bible tells us to humble ourselves"
    },
    {
      "id": 116,
      "start": 1704.5199890136719,
      "end": 1707.6399841308594,
      "text": " in the sight of God, but if you don't humble yourself, God"
    },
    {
      "id": 117,
      "start": 1707.6399841308594,
      "end": 1713.47998046875,
      "text": " has a way of humbling you. Just talk to old Nebuchadnezzar. We"
    },
    {
      "id": 118,
      "start": 1713.47998046875,
      "end": 1716.4400024414062,
      "text": " won't take time to go to the book of Daniel this morning to look at that,"
    },
    {
      "id": 119,
      "start": 1716.4400024414062,
      "end": 1720.0399780273438,
      "text": " but you understand that he was a prideful individual, the king"
    },
    {
      "id": 120,
      "start": 1720.0399780273438,
      "end": 1724.8399658203125,
      "text": " of Babylon, and God brought him low. God humbled that man."
    },
    {
      "id": 121,
      "start": 1724.8399658203125,
      "end": 1728.4400024414062,
      "text": " This morning, not only do we see these first three, but notice number four,"
    },
    {
      "id": 122,
      "start": 1728.4400024414062,
      "end": 1732.8399658203125,
      "text": " meekness. Meekness there in verse number 12 still."
    },
    {
      "id": 123,
      "start": 1732.8399658203125,
      "end": 1737.0800170898438,
      "text": " Meekness is an interesting word. I believe that it can best be described or"
    },
    {
      "id": 124,
      "start": 1737.0800170898438,
      "end": 1740.4400024414062,
      "text": " defined as being a discipline of emotions."
    },
    {
      "id": 125,
      "start": 1740.4400024414062,
      "end": 1743.9600219726562,
      "text": " A discipline of emotions. A softness of temper."
    },
    {
      "id": 126,
      "start": 1743.9600219726562,
      "end": 1747.4000244140625,
      "text": " See, sometimes people equate meekness with weakness."
    },
    {
      "id": 127,
      "start": 1747.4000244140625,
      "end": 1751.47998046875,
      "text": " People think somebody is meek and therefore they're weak, but reality is"
    },
    {
      "id": 128,
      "start": 1751.47998046875,
      "end": 1755.4000244140625,
      "text": " that the idea, the understanding of the word meekness is that it"
    },
    {
      "id": 129,
      "start": 1755.4000244140625,
      "end": 1758.8399658203125,
      "text": " is that discipline of emotions. In other words,"
    },
    {
      "id": 130,
      "start": 1758.8399658203125,
      "end": 1762.760009765625,
      "text": " power under control. Power under control."
    },
    {
      "id": 131,
      "start": 1762.760009765625,
      "end": 1766.8399658203125,
      "text": " That's meekness. And again, as the people of God,"
    },
    {
      "id": 132,
      "start": 1766.8399658203125,
      "end": 1771.0,
      "text": " we find that as Paul was going through and saying, put on therefore, again the"
    },
    {
      "id": 133,
      "start": 1771.0,
      "end": 1774.9199829101562,
      "text": " great contrast between the things that were to put off all these and"
    },
    {
      "id": 134,
      "start": 1774.9199829101562,
      "end": 1779.6400146484375,
      "text": " now we put on therefore these, and we find that meekness, the fact"
    },
    {
      "id": 135,
      "start": 1779.6400146484375,
      "end": 1783.47998046875,
      "text": " that we would have a discipline of our emotions, that we would not have"
    },
    {
      "id": 136,
      "start": 1783.47998046875,
      "end": 1787.0,
      "text": " that wrath and anger and malice that was described"
    },
    {
      "id": 137,
      "start": 1787.0,
      "end": 1791.0,
      "text": " in verse number eight that were to put off. No, it's not that we just,"
    },
    {
      "id": 138,
      "start": 1791.0,
      "end": 1795.4000244140625,
      "text": " you know, have this fuse and this temper that just is uncontrollable. No,"
    },
    {
      "id": 139,
      "start": 1795.4000244140625,
      "end": 1798.52001953125,
      "text": " we have temperance. We have meekness. It's power"
    },
    {
      "id": 140,
      "start": 1798.52001953125,
      "end": 1803.1599731445312,
      "text": " under control. It's a discipline of our emotions."
    },
    {
      "id": 141,
      "start": 1803.1599731445312,
      "end": 1806.1199951171875,
      "text": " Can I tell you that you can only..."
    },
    {
      "id": 0,
      "start": 1806.1199951171875,
      "end": 1810.3999953269958,
      "text": " only do that through the power of the Holy Spirit. You can only do that through the power"
    },
    {
      "id": 1,
      "start": 1810.3999953269958,
      "end": 1814.7999954223633,
      "text": " of the Holy Spirit. As much as we try to discipline our own emotions, as much as we try to figure"
    },
    {
      "id": 2,
      "start": 1814.7999954223633,
      "end": 1819.4799947738647,
      "text": " out when something really bothers me and somebody pushes that wrong button and you know what"
    },
    {
      "id": 3,
      "start": 1819.4799947738647,
      "end": 1823.3599948883057,
      "text": " that means, I'm going to count to ten, I'm going to do this, I'm going to do that, I'm"
    },
    {
      "id": 4,
      "start": 1823.3599948883057,
      "end": 1829.5199947357178,
      "text": " going to go through all of these exercises so that I don't blow my cool. The power of"
    },
    {
      "id": 5,
      "start": 1829.5199947357178,
      "end": 1836.4399948120117,
      "text": " the Holy Spirit, walking in the Spirit, that's what we need, to put on this meekness. Notice"
    },
    {
      "id": 6,
      "start": 1836.4399948120117,
      "end": 1849.2999954223633,
      "text": " as we end verse number 12, use of the word long-suffering, patience, endurance, steadfastness,"
    },
    {
      "id": 7,
      "start": 1849.2999954223633,
      "end": 1855.9599952697754,
      "text": " really carries with it the idea of not being easily provoked. This idea of being long-suffering,"
    },
    {
      "id": 8,
      "start": 1855.9599952697754,
      "end": 1859.9599952697754,
      "text": " it's interesting how it will lead us into the phrases that are given to us in verse"
    },
    {
      "id": 9,
      "start": 1859.9599952697754,
      "end": 1864.8399963378906,
      "text": " number 13 and how important it is to understand this long-suffering that's being put on. I"
    },
    {
      "id": 10,
      "start": 1864.8399963378906,
      "end": 1870.1999969482422,
      "text": " really believe that as we think about these items that Paul is giving to the believers"
    },
    {
      "id": 11,
      "start": 1870.1999969482422,
      "end": 1874.4399948120117,
      "text": " in Colossae that we're receiving from God this morning through His Word because all"
    },
    {
      "id": 12,
      "start": 1874.4399948120117,
      "end": 1878.359992980957,
      "text": " Scripture is given by inspiration of God and it's profitable. Listen, it's helpful for"
    },
    {
      "id": 13,
      "start": 1878.359992980957,
      "end": 1883.8199920654297,
      "text": " us to understand these things that as we take these five items that are mentioned in verse"
    },
    {
      "id": 14,
      "start": 1883.8199920654297,
      "end": 1890.379997253418,
      "text": " number 12 that through putting on those things it will help us to do what we're supposed"
    },
    {
      "id": 15,
      "start": 1890.379997253418,
      "end": 1897.1799926757812,
      "text": " to do according to verse number 13. If we don't put on bowels of mercies, kindness,"
    },
    {
      "id": 16,
      "start": 1897.1799926757812,
      "end": 1902.2399978637695,
      "text": " humbleness of mind, meekness in long-suffering, it's going to be real hard to forbear one"
    },
    {
      "id": 17,
      "start": 1902.2399978637695,
      "end": 1908.4599914550781,
      "text": " another. That's how he begins verse number 13, forbearing one another. You know what"
    },
    {
      "id": 18,
      "start": 1908.4599914550781,
      "end": 1915.1799926757812,
      "text": " it means? Basically it means this, put up with each other. Put up with each other. You"
    },
    {
      "id": 19,
      "start": 1915.1799926757812,
      "end": 1921.1799926757812,
      "text": " ever hear somebody say, I love you but I don't have to like you? That's nonsense. I don't"
    },
    {
      "id": 20,
      "start": 1921.1799926757812,
      "end": 1924.3399963378906,
      "text": " know where that, listen, that's not Bible. You understand there's no Bible verse that"
    },
    {
      "id": 21,
      "start": 1924.3399963378906,
      "end": 1928.6599960327148,
      "text": " you can go to and say, well, this is, I have to love you in Jesus' name but I don't have"
    },
    {
      "id": 22,
      "start": 1928.6599960327148,
      "end": 1936.0599975585938,
      "text": " to like you, bless God. No, that's not Bible. That's nonsense. That's making provision for"
    },
    {
      "id": 23,
      "start": 1936.0599975585938,
      "end": 1942.5,
      "text": " the flesh, honestly. The reality is that, look, if you look at those things that are"
    },
    {
      "id": 24,
      "start": 1942.5,
      "end": 1946.8799896240234,
      "text": " mentioned, those five items in verse number 12, bowels of mercies, kindness, humbleness"
    },
    {
      "id": 25,
      "start": 1946.8799896240234,
      "end": 1949.979995727539,
      "text": " of mind, meekness in long-suffering, do you find in there that you're not going to like"
    },
    {
      "id": 26,
      "start": 1949.979995727539,
      "end": 1955.739990234375,
      "text": " somebody that's a child of God? Come on. If you're to put on these things, you're going"
    },
    {
      "id": 27,
      "start": 1955.739990234375,
      "end": 1959.5399932861328,
      "text": " to not only love them as we find in verse number 14, but you're going to be praying"
    },
    {
      "id": 28,
      "start": 1959.5399932861328,
      "end": 1962.8600006103516,
      "text": " one for another and you're going to be following these things and this thing of forbearing,"
    },
    {
      "id": 29,
      "start": 1962.8600006103516,
      "end": 1968.3799896240234,
      "text": " listen, I understand that we're all different. I understand that people will make a phraseology"
    },
    {
      "id": 30,
      "start": 1968.3799896240234,
      "end": 1973.2200012207031,
      "text": " every once in a while. Some people just rub me the wrong way or somebody's, but the reality,"
    },
    {
      "id": 31,
      "start": 1973.2200012207031,
      "end": 1977.5800018310547,
      "text": " remember in Christ, remember we looked at that principle in verse number 12, Christ"
    },
    {
      "id": 32,
      "start": 1977.5800018310547,
      "end": 1984.0199890136719,
      "text": " is all and in all. And the reality is that all of those things are set aside because"
    },
    {
      "id": 33,
      "start": 1984.0199890136719,
      "end": 1988.6999969482422,
      "text": " now we're in Christ and as we're seeking that process of sanctification and each one of"
    },
    {
      "id": 34,
      "start": 1988.6999969482422,
      "end": 1994.1399993896484,
      "text": " us are on our journey of sanctification becoming more like Christ and we're walking with God"
    },
    {
      "id": 35,
      "start": 1994.1399993896484,
      "end": 1998.1799926757812,
      "text": " and we're walking with Christ, you understand that there's sometimes that you might be further"
    },
    {
      "id": 36,
      "start": 1998.1799926757812,
      "end": 2002.0199890136719,
      "text": " along than someone else on that journey and there are times in which someone else might"
    },
    {
      "id": 37,
      "start": 2002.0199890136719,
      "end": 2006.5800018310547,
      "text": " be further along than you are on that journey. In the same grace that you would like to be"
    },
    {
      "id": 38,
      "start": 2006.5800018310547,
      "end": 2010.9400024414062,
      "text": " afforded to you, you need to afford to the person that's not as far along as you are."
    },
    {
      "id": 39,
      "start": 2010.9400024414062,
      "end": 2017.739990234375,
      "text": " Amen? Now sometimes that's hard for us. Sometimes that's a challenge because we've not put on"
    },
    {
      "id": 40,
      "start": 2017.7799987792969,
      "end": 2024.5399932861328,
      "text": " all of these things that Paul is mentioning in verse number 13, forbearing one another."
    },
    {
      "id": 41,
      "start": 2024.5399932861328,
      "end": 2030.6999969482422,
      "text": " I believe that that's the result not only specifically of longsuffering that we're not"
    },
    {
      "id": 42,
      "start": 2030.6999969482422,
      "end": 2036.5399932861328,
      "text": " easily provoked, that we have that patience and that endurance, but that we have the bowels"
    },
    {
      "id": 43,
      "start": 2036.5399932861328,
      "end": 2041.9400024414062,
      "text": " of mercies, the kindness, the humility, and the meekness. You ever wonder why God puts"
    },
    {
      "id": 44,
      "start": 2041.9400024414062,
      "end": 2048.6199951171875,
      "text": " up with you? I mean, let's just bring it right down where it is, you know what I mean? Because"
    },
    {
      "id": 45,
      "start": 2048.6199951171875,
      "end": 2053.019989013672,
      "text": " sometimes, listen, when did Christ, according to Romans chapter number 5, God demonstrated"
    },
    {
      "id": 46,
      "start": 2053.019989013672,
      "end": 2058.699996948242,
      "text": " his love toward us in that while we were yet sinners, Christ died for us. Amen? And yet"
    },
    {
      "id": 47,
      "start": 2058.699996948242,
      "end": 2063.739990234375,
      "text": " after salvation, how many times after salvation as we've dealt with this old man, this flesh,"
    },
    {
      "id": 48,
      "start": 2063.739990234375,
      "end": 2068.6199951171875,
      "text": " this principle that's carried on throughout, starting in verse number 5 of Colossians 3,"
    },
    {
      "id": 49,
      "start": 2068.6199951171875,
      "end": 2071.8999938964844,
      "text": " going through what we're dealing with this morning, how many times have we failed our"
    },
    {
      "id": 50,
      "start": 2071.8999938964844,
      "end": 2078.260009765625,
      "text": " Savior? How many times have we just royally messed up? And yet he's forgiving. He's putting"
    },
    {
      "id": 51,
      "start": 2078.260009765625,
      "end": 2086.220001220703,
      "text": " up with us. He's longsuffering toward us. He's kind toward us. He's merciful toward"
    },
    {
      "id": 52,
      "start": 2086.220001220703,
      "end": 2091.8200073242188,
      "text": " us. And I'm so thankful for that. And we are, as the people of God, we're to put on these"
    },
    {
      "id": 53,
      "start": 2091.8200073242188,
      "end": 2097.0599975585938,
      "text": " things. We're to put these things on, forbearing one another. Notice as we continue through"
    },
    {
      "id": 54,
      "start": 2097.0599975585938,
      "end": 2102.3399963378906,
      "text": " the list in verse number 13, we find the seventh item that is mentioned, really, the"
    },
    {
      "id": 55,
      "start": 2102.3399963378906,
      "end": 2109.220001220703,
      "text": " truth here, forgiving one another. He says this, if any man have a quarrel against any,"
    },
    {
      "id": 56,
      "start": 2109.220001220703,
      "end": 2115.6199951171875,
      "text": " even as Christ forgave you, so also do ye. The reality is that there will be times in"
    },
    {
      "id": 57,
      "start": 2115.6199951171875,
      "end": 2121.8200073242188,
      "text": " which there will be a quarrel against someone. Why? Because we have the flesh. Amen? I was"
    },
    {
      "id": 58,
      "start": 2121.8200073242188,
      "end": 2125.699981689453,
      "text": " listening to a preacher preach. I was at a pastor's meeting. And sometimes you've heard"
    },
    {
      "id": 59,
      "start": 2125.739990234375,
      "end": 2129.1399841308594,
      "text": " these people that have said something of this nature. The guy that was the president of"
    },
    {
      "id": 60,
      "start": 2129.1399841308594,
      "end": 2132.8200073242188,
      "text": " our Bible college, he would stand up and he'd say, we've been, my wife and I've been married"
    },
    {
      "id": 61,
      "start": 2132.8200073242188,
      "end": 2138.5799865722656,
      "text": " for 43 years and we've never had one argument, not ever one argument. And some of those kids"
    },
    {
      "id": 62,
      "start": 2138.5799865722656,
      "end": 2142.97998046875,
      "text": " in the college, we'd sit there and we'd listen and think, man, that's awesome. That's wonderful."
    },
    {
      "id": 63,
      "start": 2142.97998046875,
      "end": 2147.459991455078,
      "text": " And so on and so forth. And then others just wondering like, how in the world could that"
    },
    {
      "id": 64,
      "start": 2147.459991455078,
      "end": 2152.540008544922,
      "text": " happen? Right? Like seriously? And this, this preacher was preaching at a pastor's meeting"
    },
    {
      "id": 65,
      "start": 2152.540008544922,
      "end": 2156.739990234375,
      "text": " just a couple of months ago. I was there down in, uh, just South of Spotsylvania and"
    },
    {
      "id": 66,
      "start": 2156.739990234375,
      "end": 2161.1799926757812,
      "text": " King George. And I was at the pastor's meeting. This fellow was preaching. And he said in"
    },
    {
      "id": 67,
      "start": 2161.1799926757812,
      "end": 2165.2999877929688,
      "text": " all the years that I've been married, I've never had one argument with my wife. He said"
    },
    {
      "id": 68,
      "start": 2165.2999877929688,
      "end": 2171.220001220703,
      "text": " never one time have I ever said anything to my wife that I'd regret. Not one time I ever"
    },
    {
      "id": 69,
      "start": 2171.220001220703,
      "end": 2177.699981689453,
      "text": " raised my voice to my wife. Oh man, this is great. Amen. Kevin's laughing back there."
    },
    {
      "id": 70,
      "start": 2177.699981689453,
      "end": 2181.260009765625,
      "text": " And then he said this, there have been plenty of times that I've not said a word to her"
    },
    {
      "id": 71,
      "start": 2181.260009765625,
      "end": 2185.9400024414062,
      "text": " and I've not talked to her for days. And I thought, well, that's not the right answer"
    },
    {
      "id": 72,
      "start": 2185.9400024414062,
      "end": 2191.779998779297,
      "text": " either. Amen. I mean, come on. And he was really building it up for this thing. But"
    },
    {
      "id": 73,
      "start": 2191.779998779297,
      "end": 2196.1000061035156,
      "text": " the reality is that the answer is not like, you know, being angry and sin not, yeah, I"
    },
    {
      "id": 74,
      "start": 2196.1000061035156,
      "end": 2200.3399963378906,
      "text": " don't want to sin. I don't want to speak and sin. But at the same time, he says, let not"
    },
    {
      "id": 75,
      "start": 2200.3399963378906,
      "end": 2205.5799865722656,
      "text": " the sun go down upon my wrath. It's not that I'm going to go days on end without talking"
    },
    {
      "id": 76,
      "start": 2205.5799865722656,
      "end": 2210.3800048828125,
      "text": " to someone that I'm going to allow the divide to become greater than I'm going to give place"
    },
    {
      "id": 77,
      "start": 2210.3800048828125,
      "end": 2215.8200073242188,
      "text": " to the devil. He gets that toe hold, which becomes a foothold, which becomes a stronghold."
    },
    {
      "id": 78,
      "start": 2215.8200073242188,
      "end": 2220.220001220703,
      "text": " And we come to the place where we say, where did we get here? What happened anyway? We"
    },
    {
      "id": 79,
      "start": 2220.220001220703,
      "end": 2225.459991455078,
      "text": " think it was just this little thing. If there's a quarrel, he says, listen, we're forbearing"
    },
    {
      "id": 80,
      "start": 2225.459991455078,
      "end": 2232.0599975585938,
      "text": " one another, but we're also forgiving one another. I'm so thankful for the teaching"
    },
    {
      "id": 81,
      "start": 2232.0599975585938,
      "end": 2238.97998046875,
      "text": " in God's Word with regard to forgiveness. Isn't it wonderful, wonderful to be forgiven?"
    },
    {
      "id": 82,
      "start": 2239.019989013672,
      "end": 2244.6600036621094,
      "text": " I mean, honestly, to know that your sins are forgiven, to know that God has forgiven you,"
    },
    {
      "id": 83,
      "start": 2244.6600036621094,
      "end": 2251.6600036621094,
      "text": " to understand, as we've said in the past, and you can sing the song, I'm forgiven forever."
    },
    {
      "id": 84,
      "start": 2251.6600036621094,
      "end": 2259.699981689453,
      "text": " Man, that's a wonderful thing. That with thee, with our God, there is forgiveness. That he"
    },
    {
      "id": 85,
      "start": 2259.699981689453,
      "end": 2265.019989013672,
      "text": " promises that if we confess our sins, that he will forgive us and cleanse us from all"
    },
    {
      "id": 86,
      "start": 2265.019989013672,
      "end": 2270.0599975585938,
      "text": " unrighteousness. It's a wonderful thing to be forgiven. The problem that some people"
    },
    {
      "id": 87,
      "start": 2270.0599975585938,
      "end": 2275.739990234375,
      "text": " have in their lives is not necessarily understanding that God has forgiven them, but perhaps forgiving"
    },
    {
      "id": 88,
      "start": 2275.739990234375,
      "end": 2281.97998046875,
      "text": " themselves. The enemy, as the child of God, the accuser of the brethren, he tries to come"
    },
    {
      "id": 89,
      "start": 2281.97998046875,
      "end": 2287.1000061035156,
      "text": " alongside and accuse us, but we say, listen, we have an advocate with the Father. It's"
    },
    {
      "id": 90,
      "start": 2287.1000061035156,
      "end": 2293.3399963378906,
      "text": " under the blood. I've been forgiven. Get thee behind me, Satan. Amen? I don't want to hear"
    },
    {
      "id": 91,
      "start": 2293.3399963378906,
      "end": 2298.2999877929688,
      "text": " that anymore because I've confessed that, I've forsaken that, and God promised to forgive"
    },
    {
      "id": 92,
      "start": 2298.2999877929688,
      "end": 2303.459991455078,
      "text": " me. But then all of a sudden, somewhere along the line, sometimes we have a difficulty with"
    },
    {
      "id": 93,
      "start": 2303.459991455078,
      "end": 2312.459991455078,
      "text": " forgiveness in our lives. Remember Peter? Lord, how oft shall we forgive? Till seven"
    },
    {
      "id": 94,
      "start": 2312.459991455078,
      "end": 2319.02001953125,
      "text": " times? Now, we understand contextually, at that particular time, the kind of social norm"
    },
    {
      "id": 95,
      "start": 2319.02001953125,
      "end": 2324.0999755859375,
      "text": " would be that if someone were to offend you in the same manner, three, maybe four times,"
    },
    {
      "id": 96,
      "start": 2324.0999755859375,
      "end": 2327.1400146484375,
      "text": " the Pharisees and those religious leaders of the day, they would say, okay, you can"
    },
    {
      "id": 97,
      "start": 2327.1400146484375,
      "end": 2332.5399780273438,
      "text": " forgive three or four times, but after that, I mean, you've crossed me one too many times."
    },
    {
      "id": 98,
      "start": 2332.5399780273438,
      "end": 2338.0599975585938,
      "text": " So Peter, when he comes to Christ and he says, till seven times? He's really kind of saying,"
    },
    {
      "id": 99,
      "start": 2338.0599975585938,
      "end": 2341.260009765625,
      "text": " we're doing a little better than those religious leaders over there. I mean, you've called"
    },
    {
      "id": 100,
      "start": 2341.260009765625,
      "end": 2344.7000122070312,
      "text": " them vipers, by the way, and so obviously they're not doing everything right, and so"
    },
    {
      "id": 101,
      "start": 2345.02001953125,
      "end": 2359.3399658203125,
      "text": " till seven times? Jesus says no. Not till seven. Till 70 times seven. Wow. Till 70 times"
    },
    {
      "id": 102,
      "start": 2359.3399658203125,
      "end": 2366.1799926757812,
      "text": " seven. 490. But the idea isn't that you get your little journal book out and keep a list"
    },
    {
      "id": 103,
      "start": 2366.1799926757812,
      "end": 2371.5,
      "text": " of who's offended you and how many times. And man, they get up to like 482 and you're"
    },
    {
      "id": 104,
      "start": 2371.5,
      "end": 2374.1799926757812,
      "text": " like, oh man, they're getting close, I don't have to forgive them anymore, just a few more"
    },
    {
      "id": 105,
      "start": 2374.1799926757812,
      "end": 2380.7799682617188,
      "text": " times. No. That's not the idea. It's to keep on forgiving."
    },
    {
      "id": 106,
      "start": 2380.7799682617188,
      "end": 2388.6599731445312,
      "text": " See, when Jesus said this to the disciples, another different way or a slightly different"
    },
    {
      "id": 107,
      "start": 2388.6599731445312,
      "end": 2395.260009765625,
      "text": " way of God speaking to them with regard to forgiveness is found for us in Luke 17. And"
    },
    {
      "id": 108,
      "start": 2395.260009765625,
      "end": 2400.6599731445312,
      "text": " he says, it says this, and if you trespass against thee seven times in a day, and seven"
    },
    {
      "id": 109,
      "start": 2400.6599731445312,
      "end": 2406.1799926757812,
      "text": " times in a day turn again to thee, saying, I repent, thou shalt forgive him."
    },
    {
      "id": 0,
      "start": 2406.1799926757812,
      "end": 2408.419992685318,
      "text": " So we find it says seven times a day."
    },
    {
      "id": 1,
      "start": 2408.419992685318,
      "end": 2410.979992866516,
      "text": " Now, I'm not sure about you, but perhaps if someone"
    },
    {
      "id": 2,
      "start": 2410.979992866516,
      "end": 2413.6199927330017,
      "text": " like three or four times in the same day offended you,"
    },
    {
      "id": 3,
      "start": 2413.6199927330017,
      "end": 2415.2599925994873,
      "text": " you might be like, I gotta find a different place"
    },
    {
      "id": 4,
      "start": 2415.2599925994873,
      "end": 2417.9999923706055,
      "text": " to go today, like I gotta do something different."
    },
    {
      "id": 5,
      "start": 2417.9999923706055,
      "end": 2421.239993095398,
      "text": " But Jesus says, if seven times in the same day,"
    },
    {
      "id": 6,
      "start": 2422.7599925994873,
      "end": 2425.8999919891357,
      "text": " that's what he says in Luke 17 and verse number four,"
    },
    {
      "id": 7,
      "start": 2425.8999919891357,
      "end": 2427.699993133545,
      "text": " in seven times in that day,"
    },
    {
      "id": 8,
      "start": 2427.699993133545,
      "end": 2430.3399925231934,
      "text": " he turns again to thee saying, I repent,"
    },
    {
      "id": 9,
      "start": 2430.3399925231934,
      "end": 2433.7199935913086,
      "text": " thou shalt forgive him."
    },
    {
      "id": 10,
      "start": 2433.7199935913086,
      "end": 2435.4999923706055,
      "text": " Have you ever failed God more than one time"
    },
    {
      "id": 11,
      "start": 2435.4999923706055,
      "end": 2436.8799934387207,
      "text": " in the same day?"
    },
    {
      "id": 12,
      "start": 2436.8799934387207,
      "end": 2439.7199935913086,
      "text": " Sure you have, sure you have."
    },
    {
      "id": 13,
      "start": 2439.7199935913086,
      "end": 2444.1199913024902,
      "text": " Sometimes in the same way, right?"
    },
    {
      "id": 14,
      "start": 2445.799991607666,
      "end": 2447.8399925231934,
      "text": " You know how the disciples respond,"
    },
    {
      "id": 15,
      "start": 2447.8399925231934,
      "end": 2450.6799926757812,
      "text": " the apostles responded to that teaching?"
    },
    {
      "id": 16,
      "start": 2451.6199913024902,
      "end": 2454.759994506836,
      "text": " The apostles said unto the Lord in verse number five,"
    },
    {
      "id": 17,
      "start": 2454.759994506836,
      "end": 2457.359992980957,
      "text": " increase our faith."
    },
    {
      "id": 18,
      "start": 2458.2399940490723,
      "end": 2462.519992828369,
      "text": " I believe contextually, that request is obviously made"
    },
    {
      "id": 19,
      "start": 2462.639991760254,
      "end": 2467.039993286133,
      "text": " on the heels of that instruction with regard to forgiveness."
    },
    {
      "id": 20,
      "start": 2467.039993286133,
      "end": 2468.5999908447266,
      "text": " Forgiveness."
    },
    {
      "id": 21,
      "start": 2468.5999908447266,
      "end": 2472.7199935913086,
      "text": " And we find here that, again, back in Colossians three,"
    },
    {
      "id": 22,
      "start": 2472.7199935913086,
      "end": 2476.7199935913086,
      "text": " that is, Paul would say in verse number 13,"
    },
    {
      "id": 23,
      "start": 2476.7199935913086,
      "end": 2480.359992980957,
      "text": " not only forbearing one another, but forgiving one another."
    },
    {
      "id": 24,
      "start": 2480.359992980957,
      "end": 2483.3199920654297,
      "text": " But notice what he says at the end of the verse."
    },
    {
      "id": 25,
      "start": 2483.3199920654297,
      "end": 2488.3199920654297,
      "text": " Even as Christ forgave you, so also do ye."
    },
    {
      "id": 26,
      "start": 2489.159996032715,
      "end": 2493.3199920654297,
      "text": " The way that he says it to the believers in Ephesus,"
    },
    {
      "id": 27,
      "start": 2493.3199920654297,
      "end": 2496.8399963378906,
      "text": " in Ephesians chapter number four, in verse number 32,"
    },
    {
      "id": 28,
      "start": 2496.8399963378906,
      "end": 2499.639991760254,
      "text": " he says, and be kind one to another, tenderhearted,"
    },
    {
      "id": 29,
      "start": 2499.639991760254,
      "end": 2503.059989929199,
      "text": " forgiving one another, even as God, for Christ's sake,"
    },
    {
      "id": 30,
      "start": 2503.059989929199,
      "end": 2504.639991760254,
      "text": " hath forgiven you."
    },
    {
      "id": 31,
      "start": 2504.639991760254,
      "end": 2506.039993286133,
      "text": " Why do we forgive?"
    },
    {
      "id": 32,
      "start": 2506.039993286133,
      "end": 2507.4399948120117,
      "text": " Because we've been forgiven."
    },
    {
      "id": 33,
      "start": 2509.739990234375,
      "end": 2512.3399963378906,
      "text": " You say, but they don't deserve it, neither do you."
    },
    {
      "id": 34,
      "start": 2514.6799926757812,
      "end": 2516.659996032715,
      "text": " I don't deserve God's forgiveness."
    },
    {
      "id": 35,
      "start": 2517.419990539551,
      "end": 2520.1799926757812,
      "text": " But God is a forgiving God."
    },
    {
      "id": 36,
      "start": 2520.1799926757812,
      "end": 2522.019989013672,
      "text": " Aren't you thankful for that?"
    },
    {
      "id": 37,
      "start": 2522.019989013672,
      "end": 2524.239990234375,
      "text": " You know, I believe that as we look at this list,"
    },
    {
      "id": 38,
      "start": 2524.239990234375,
      "end": 2526.57999420166,
      "text": " and we're gonna look at verse 14 here in just a moment,"
    },
    {
      "id": 39,
      "start": 2526.57999420166,
      "end": 2528.739990234375,
      "text": " but even as we just look at these first seven things"
    },
    {
      "id": 40,
      "start": 2528.739990234375,
      "end": 2532.0999908447266,
      "text": " that are mentioned, five of those items in verse number 12,"
    },
    {
      "id": 41,
      "start": 2532.0999908447266,
      "end": 2534.1799926757812,
      "text": " and then really the outworking, the forbearing,"
    },
    {
      "id": 42,
      "start": 2534.1799926757812,
      "end": 2536.699996948242,
      "text": " and the forgiving that's mentioned in verse number 13,"
    },
    {
      "id": 43,
      "start": 2536.699996948242,
      "end": 2540.259994506836,
      "text": " I want you to consider that if we, as the people of God,"
    },
    {
      "id": 44,
      "start": 2540.259994506836,
      "end": 2543.5799865722656,
      "text": " would really put off all those things that are mentioned"
    },
    {
      "id": 45,
      "start": 2543.5799865722656,
      "end": 2545.8999938964844,
      "text": " in verses five through nine, and we'd really put on"
    },
    {
      "id": 46,
      "start": 2545.8999938964844,
      "end": 2547.259994506836,
      "text": " these things that are mentioned,"
    },
    {
      "id": 47,
      "start": 2547.259994506836,
      "end": 2549.6599884033203,
      "text": " I think we could make a difference in our world."
    },
    {
      "id": 48,
      "start": 2551.259994506836,
      "end": 2552.219985961914,
      "text": " I really do."
    },
    {
      "id": 49,
      "start": 2553.6599884033203,
      "end": 2555.539993286133,
      "text": " Listen, I think that as we go,"
    },
    {
      "id": 50,
      "start": 2555.539993286133,
      "end": 2558.259994506836,
      "text": " our message would be more readily received."
    },
    {
      "id": 51,
      "start": 2558.259994506836,
      "end": 2559.0999908447266,
      "text": " Why?"
    },
    {
      "id": 52,
      "start": 2559.0999908447266,
      "end": 2561.1399993896484,
      "text": " Because we're walking in the Spirit."
    },
    {
      "id": 53,
      "start": 2561.1399993896484,
      "end": 2563.8199920654297,
      "text": " We're living the Christ life."
    },
    {
      "id": 54,
      "start": 2563.8199920654297,
      "end": 2565.939987182617,
      "text": " We've been crucified to the old man,"
    },
    {
      "id": 55,
      "start": 2565.939987182617,
      "end": 2568.3799896240234,
      "text": " and now all of a sudden, we're able to have"
    },
    {
      "id": 56,
      "start": 2568.3799896240234,
      "end": 2570.8599853515625,
      "text": " a greater impact and a greater influence."
    },
    {
      "id": 57,
      "start": 2570.8599853515625,
      "end": 2571.699996948242,
      "text": " Why?"
    },
    {
      "id": 58,
      "start": 2571.699996948242,
      "end": 2574.8199920654297,
      "text": " Because we are merciful, we are compassionate,"
    },
    {
      "id": 59,
      "start": 2574.8199920654297,
      "end": 2577.459991455078,
      "text": " we're kind, we're humble, we're meek,"
    },
    {
      "id": 60,
      "start": 2577.459991455078,
      "end": 2581.5799865722656,
      "text": " we're long-suffering, we forbear, we forgive,"
    },
    {
      "id": 61,
      "start": 2581.5799865722656,
      "end": 2583.2999877929688,
      "text": " and as we understand those things and say,"
    },
    {
      "id": 62,
      "start": 2583.2999877929688,
      "end": 2585.259994506836,
      "text": " man, we're going to have an opportunity"
    },
    {
      "id": 63,
      "start": 2585.259994506836,
      "end": 2587.6199951171875,
      "text": " to make a difference in our world."
    },
    {
      "id": 64,
      "start": 2590.0999908447266,
      "end": 2592.0599975585938,
      "text": " I've heard people say over the years,"
    },
    {
      "id": 65,
      "start": 2594.0599975585938,
      "end": 2596.0599975585938,
      "text": " as you would speak to them about Christianity,"
    },
    {
      "id": 66,
      "start": 2596.0599975585938,
      "end": 2598.8199920654297,
      "text": " as you would speak to them about the Lord,"
    },
    {
      "id": 67,
      "start": 2598.8199920654297,
      "end": 2601.259994506836,
      "text": " that they've had encounters and experiences"
    },
    {
      "id": 68,
      "start": 2601.259994506836,
      "end": 2604.459991455078,
      "text": " with individuals that claim the name of Christ,"
    },
    {
      "id": 69,
      "start": 2604.5,
      "end": 2605.979995727539,
      "text": " but were nothing like Christ,"
    },
    {
      "id": 70,
      "start": 2605.979995727539,
      "end": 2608.2999877929688,
      "text": " and therefore they have no interest"
    },
    {
      "id": 71,
      "start": 2608.2999877929688,
      "end": 2610.4199981689453,
      "text": " in anything to do with the Bible."
    },
    {
      "id": 72,
      "start": 2610.4199981689453,
      "end": 2612.219985961914,
      "text": " No, that's sad."
    },
    {
      "id": 73,
      "start": 2612.219985961914,
      "end": 2613.0599975585938,
      "text": " That's sad."
    },
    {
      "id": 74,
      "start": 2614.8199920654297,
      "end": 2619.8199920654297,
      "text": " One world religious leader of years ago"
    },
    {
      "id": 75,
      "start": 2621.699996948242,
      "end": 2624.0999908447266,
      "text": " made this statement, not a Christian at all,"
    },
    {
      "id": 76,
      "start": 2624.0999908447266,
      "end": 2626.539993286133,
      "text": " but made this statement as they examined"
    },
    {
      "id": 77,
      "start": 2626.539993286133,
      "end": 2628.6599884033203,
      "text": " and studied Christianity,"
    },
    {
      "id": 78,
      "start": 2628.6599884033203,
      "end": 2633.6599884033203,
      "text": " I like your Christ, but not your Christians,"
    },
    {
      "id": 79,
      "start": 2633.6599884033203,
      "end": 2635.8199920654297,
      "text": " for they are nothing like your Christ."
    },
    {
      "id": 80,
      "start": 2637.459991455078,
      "end": 2639.939987182617,
      "text": " Man, that'll hit you."
    },
    {
      "id": 81,
      "start": 2641.2999877929688,
      "end": 2643.8199920654297,
      "text": " Because a Christian is supposed to be like Christ."
    },
    {
      "id": 82,
      "start": 2644.739990234375,
      "end": 2646.2999877929688,
      "text": " And how is it that we're going to be like Him?"
    },
    {
      "id": 83,
      "start": 2646.2999877929688,
      "end": 2648.8999938964844,
      "text": " Well, Paul's giving us the application"
    },
    {
      "id": 84,
      "start": 2648.8999938964844,
      "end": 2651.0999908447266,
      "text": " right here in this portion of Scripture."
    },
    {
      "id": 85,
      "start": 2651.0999908447266,
      "end": 2653.0999908447266,
      "text": " Listen, believers in Colossae,"
    },
    {
      "id": 86,
      "start": 2653.0999908447266,
      "end": 2654.779998779297,
      "text": " listen, church this morning,"
    },
    {
      "id": 87,
      "start": 2654.779998779297,
      "end": 2657.1799926757812,
      "text": " as we think about the truth of God's Word"
    },
    {
      "id": 88,
      "start": 2657.1799926757812,
      "end": 2659.1399993896484,
      "text": " and we think about the way in which it's been preserved"
    },
    {
      "id": 89,
      "start": 2659.1399993896484,
      "end": 2660.459991455078,
      "text": " and it's for us this morning,"
    },
    {
      "id": 90,
      "start": 2660.459991455078,
      "end": 2662.0999908447266,
      "text": " God has said, listen, you're saved,"
    },
    {
      "id": 91,
      "start": 2662.0999908447266,
      "end": 2663.5799865722656,
      "text": " but there's some things you need to deal with"
    },
    {
      "id": 92,
      "start": 2664.3800048828125,
      "end": 2666.459991455078,
      "text": " that old man, you need to put off these things."
    },
    {
      "id": 93,
      "start": 2666.459991455078,
      "end": 2668.739990234375,
      "text": " And there's some things you need to put on."
    },
    {
      "id": 94,
      "start": 2668.739990234375,
      "end": 2670.3399963378906,
      "text": " And as we walk in the Spirit"
    },
    {
      "id": 95,
      "start": 2670.3399963378906,
      "end": 2673.1399841308594,
      "text": " and as we have the fruit of the Spirit"
    },
    {
      "id": 96,
      "start": 2673.1399841308594,
      "end": 2675.2999877929688,
      "text": " that Paul mentions in Galatians 5,"
    },
    {
      "id": 97,
      "start": 2675.2999877929688,
      "end": 2678.3399963378906,
      "text": " I believe that we'll be so much more effective"
    },
    {
      "id": 98,
      "start": 2678.3399963378906,
      "end": 2683.019989013672,
      "text": " on reaching people, on sharing Christ with people."
    },
    {
      "id": 99,
      "start": 2683.019989013672,
      "end": 2685.459991455078,
      "text": " Notice verse number 14 as he concludes."
    },
    {
      "id": 100,
      "start": 2687.3800048828125,
      "end": 2692.3800048828125,
      "text": " And above all these things, put on charity."
    },
    {
      "id": 101,
      "start": 2694.5,
      "end": 2699.5,
      "text": " Notice this, which is the bond of perfectness."
    },
    {
      "id": 102,
      "start": 2700.3800048828125,
      "end": 2703.8999938964844,
      "text": " As he speaks about charity, we understand the word love"
    },
    {
      "id": 103,
      "start": 2703.8999938964844,
      "end": 2707.4199829101562,
      "text": " and we use that word and we understand the truth"
    },
    {
      "id": 104,
      "start": 2707.4199829101562,
      "end": 2709.3399963378906,
      "text": " that is given and really the word for love"
    },
    {
      "id": 105,
      "start": 2709.3399963378906,
      "end": 2711.5,
      "text": " that is used here in this portion of Scripture"
    },
    {
      "id": 106,
      "start": 2711.5,
      "end": 2714.8599853515625,
      "text": " is the word that is used to describe God's love,"
    },
    {
      "id": 107,
      "start": 2714.8599853515625,
      "end": 2716.1799926757812,
      "text": " agape love."
    },
    {
      "id": 108,
      "start": 2717.1000061035156,
      "end": 2718.5,
      "text": " And we find that we're to,"
    },
    {
      "id": 109,
      "start": 2718.5,
      "end": 2720.8200073242188,
      "text": " above all these things, put on charity,"
    },
    {
      "id": 110,
      "start": 2720.8200073242188,
      "end": 2722.3399963378906,
      "text": " which is the bond of perfectness."
    },
    {
      "id": 111,
      "start": 2722.5399780273438,
      "end": 2725.6600036621094,
      "text": " I believe it's that evidence of maturity, if you will."
    },
    {
      "id": 112,
      "start": 2725.6600036621094,
      "end": 2727.220001220703,
      "text": " And we think about this list"
    },
    {
      "id": 113,
      "start": 2727.220001220703,
      "end": 2730.5,
      "text": " and we could even work backwards and work sideways"
    },
    {
      "id": 114,
      "start": 2730.5,
      "end": 2732.4199829101562,
      "text": " and just kind of interchange all of these things"
    },
    {
      "id": 115,
      "start": 2732.4199829101562,
      "end": 2736.8599853515625,
      "text": " and understand how they're so dependent upon one another."
    },
    {
      "id": 116,
      "start": 2736.8599853515625,
      "end": 2739.4199829101562,
      "text": " Remember, as we look at this verse"
    },
    {
      "id": 117,
      "start": 2739.4199829101562,
      "end": 2741.8200073242188,
      "text": " and think about the truth of charity, of love,"
    },
    {
      "id": 118,
      "start": 2741.8200073242188,
      "end": 2743.8200073242188,
      "text": " remember what Jesus said."
    },
    {
      "id": 119,
      "start": 2743.8200073242188,
      "end": 2745.4199829101562,
      "text": " Turn over to 1 Corinthians 13,"
    },
    {
      "id": 120,
      "start": 2745.4199829101562,
      "end": 2748.4199829101562,
      "text": " but I'm gonna read to you John chapter 13."
    },
    {
      "id": 121,
      "start": 2748.4199829101562,
      "end": 2750.97998046875,
      "text": " 1 Corinthians 13, we'll look at some verses there"
    },
    {
      "id": 122,
      "start": 2750.97998046875,
      "end": 2752.259979248047,
      "text": " as we conclude this morning."
    },
    {
      "id": 123,
      "start": 2753.1799926757812,
      "end": 2755.0599975585938,
      "text": " But I wanna remind you of what Jesus said"
    },
    {
      "id": 124,
      "start": 2755.0599975585938,
      "end": 2757.739990234375,
      "text": " in John chapter number 13."
    },
    {
      "id": 125,
      "start": 2757.739990234375,
      "end": 2760.8200073242188,
      "text": " In John chapter number 13, in verse number 34,"
    },
    {
      "id": 126,
      "start": 2760.8200073242188,
      "end": 2762.8999938964844,
      "text": " Jesus, of course, had just finished washing"
    },
    {
      "id": 127,
      "start": 2762.8999938964844,
      "end": 2765.739990234375,
      "text": " the feet of the disciples and was giving them,"
    },
    {
      "id": 128,
      "start": 2765.739990234375,
      "end": 2768.5399780273438,
      "text": " the disciples, truth with regard to His soon"
    },
    {
      "id": 129,
      "start": 2768.5399780273438,
      "end": 2770.0599975585938,
      "text": " going to the cross of Calvary."
    },
    {
      "id": 130,
      "start": 2770.0599975585938,
      "end": 2770.8999938964844,
      "text": " And He says this,"
    },
    {
      "id": 131,
      "start": 2770.8999938964844,
      "end": 2773.5399780273438,
      "text": " a new commandment I give unto you"
    },
    {
      "id": 132,
      "start": 2773.5399780273438,
      "end": 2777.97998046875,
      "text": " that ye love one another as I have loved you"
    },
    {
      "id": 133,
      "start": 2777.97998046875,
      "end": 2781.8999938964844,
      "text": " that ye also love one another."
    },
    {
      "id": 134,
      "start": 2781.8999938964844,
      "end": 2783.4199829101562,
      "text": " How are we to love one another?"
    },
    {
      "id": 135,
      "start": 2783.4199829101562,
      "end": 2785.5399780273438,
      "text": " As Christ loved us."
    },
    {
      "id": 136,
      "start": 2785.5399780273438,
      "end": 2787.5799865722656,
      "text": " How are husbands to love their wives?"
    },
    {
      "id": 137,
      "start": 2787.5799865722656,
      "end": 2790.5399780273438,
      "text": " As Christ loved the church and gave Himself for it."
    },
    {
      "id": 138,
      "start": 2791.3800048828125,
      "end": 2793.259979248047,
      "text": " And we think about this great truth"
    },
    {
      "id": 139,
      "start": 2793.259979248047,
      "end": 2796.5799865722656,
      "text": " that He says that above all these put on charity,"
    },
    {
      "id": 140,
      "start": 2796.5799865722656,
      "end": 2798.779998779297,
      "text": " which is the bond of perfectness."
    },
    {
      "id": 141,
      "start": 2798.779998779297,
      "end": 2801.8599853515625,
      "text": " And we find it in 1 Corinthians chapter number 13,"
    },
    {
      "id": 142,
      "start": 2801.8599853515625,
      "end": 2803.97998046875,
      "text": " a chapter that is given to the,"
    },
    {
      "id": 143,
      "start": 2803.97998046875,
      "end": 2807.459991455078,
      "text": " really the supremacy of love, if you will, of charity."
    },
    {
      "id": 144,
      "start": 2807.459991455078,
      "end": 2810.699981689453,
      "text": " He says, though I speak with the tongues of men"
    },
    {
      "id": 145,
      "start": 2810.739990234375,
      "end": 2813.8599853515625,
      "text": " and of angels and have not charity,"
    },
    {
      "id": 146,
      "start": 2813.8599853515625,
      "end": 2817.779998779297,
      "text": " I am become a sounding brass or a tinkling cymbal."
    },
    {
      "id": 147,
      "start": 2818.97998046875,
      "end": 2820.9400024414062,
      "text": " Though I have the gift of prophecy"
    },
    {
      "id": 148,
      "start": 2820.9400024414062,
      "end": 2823.4199829101562,
      "text": " and understand all mysteries and all knowledge."
    },
    {
      "id": 149,
      "start": 2823.4199829101562,
      "end": 2826.8999938964844,
      "text": " And though I have all faith so that I could remove mountains"
    },
    {
      "id": 150,
      "start": 2826.8999938964844,
      "end": 2830.4199829101562,
      "text": " and have not charity, I am nothing."
    },
    {
      "id": 151,
      "start": 2831.739990234375,
      "end": 2834.739990234375,
      "text": " And though I bestow all my goods to feed the poor"
    },
    {
      "id": 152,
      "start": 2834.739990234375,
      "end": 2836.8599853515625,
      "text": " and though I give my body to the burn"
    },
    {
      "id": 153,
      "start": 2836.8999938964844,
      "end": 2841.3800048828125,
      "text": " and have not charity, it profiteth me nothing."
    },
    {
      "id": 154,
      "start": 2842.8200073242188,
      "end": 2846.019989013672,
      "text": " Then He describes charity, love."
    },
    {
      "id": 155,
      "start": 2846.019989013672,
      "end": 2847.259979248047,
      "text": " Suffereth long."
    },
    {
      "id": 156,
      "start": 2848.3399963378906,
      "end": 2849.8599853515625,
      "text": " We saw that in our list, did we not?"
    },
    {
      "id": 157,
      "start": 2849.8599853515625,
      "end": 2850.8200073242188,
      "text": " Long-suffering."
    },
    {
      "id": 158,
      "start": 2852.779998779297,
      "end": 2854.1399841308594,
      "text": " And is kind."
    },
    {
      "id": 159,
      "start": 2854.1399841308594,
      "end": 2855.6199951171875,
      "text": " Did we see that in our list?"
    },
    {
      "id": 160,
      "start": 2855.6199951171875,
      "end": 2857.4199829101562,
      "text": " Kindness."
    },
    {
      "id": 161,
      "start": 2857.4199829101562,
      "end": 2859.8200073242188,
      "text": " Charity envieth not."
    },
    {
      "id": 162,
      "start": 2859.8200073242188,
      "end": 2864.5399780273438,
      "text": " Charity, notice this, vaunteth not itself, is not puffed up."
    },
    {
      "id": 163,
      "start": 2864.5399780273438,
      "end": 2866.019989013672,
      "text": " Did we see that in our list?"
    },
    {
      "id": 164,
      "start": 2866.0599975585938,
      "end": 2867.5799865722656,
      "text": " Humbleness of mind."
    },
    {
      "id": 165,
      "start": 2868.5399780273438,
      "end": 2873.3800048828125,
      "text": " Doth not behave itself unseemly, speaketh not her own,"
    },
    {
      "id": 166,
      "start": 2873.3800048828125,
      "end": 2877.6199951171875,
      "text": " is not easily provoked, thinketh no evil."
    },
    {
      "id": 167,
      "start": 2877.6199951171875,
      "end": 2880.699981689453,
      "text": " We spoke about that not easily provoked"
    },
    {
      "id": 168,
      "start": 2880.699981689453,
      "end": 2882.8200073242188,
      "text": " being the truth of long-suffering."
    },
    {
      "id": 169,
      "start": 2882.8200073242188,
      "end": 2886.1399841308594,
      "text": " Behaveth itself unseemly, seeketh not her own,"
    },
    {
      "id": 170,
      "start": 2886.1399841308594,
      "end": 2888.5,
      "text": " is not easily provoked, thinketh no evil."
    },
    {
      "id": 171,
      "start": 2888.5,
      "end": 2891.779998779297,
      "text": " I mean, think about how it's being described here."
    },
    {
      "id": 172,
      "start": 2891.779998779297,
      "end": 2895.9400024414062,
      "text": " Rejoiceth not in iniquity, but rejoiceth in the truth."
    },
    {
      "id": 173,
      "start": 2896.8599853515625,
      "end": 2898.259979248047,
      "text": " Beareth all things, believeth all things,"
    },
    {
      "id": 174,
      "start": 2898.259979248047,
      "end": 2900.739990234375,
      "text": " hopeth all things, endureth all things."
    },
    {
      "id": 175,
      "start": 2900.739990234375,
      "end": 2902.5799865722656,
      "text": " Charity never faileth."
    },
    {
      "id": 176,
      "start": 2903.8200073242188,
      "end": 2905.739990234375,
      "text": " But whether they be prophecies, they shall fail."
    },
    {
      "id": 177,
      "start": 2905.739990234375,
      "end": 2907.6199951171875,
      "text": " Whether they be tongues, they shall cease."
    },
    {
      "id": 178,
      "start": 2907.6199951171875,
      "end": 2909.8999938964844,
      "text": " Whether it be knowledge, it shall vanish away."
    },
    {
      "id": 179,
      "start": 2909.8999938964844,
      "end": 2911.779998779297,
      "text": " And He talks about the fact that we know in part"
    },
    {
      "id": 180,
      "start": 2911.779998779297,
      "end": 2913.97998046875,
      "text": " and we prophesy in part, but when he that is perfect"
    },
    {
      "id": 181,
      "start": 2913.97998046875,
      "end": 2917.5799865722656,
      "text": " is come, then that which is, excuse me,"
    },
    {
      "id": 182,
      "start": 2917.5799865722656,
      "end": 2919.260009765625,
      "text": " but when that which is perfect is come,"
    },
    {
      "id": 183,
      "start": 2919.260009765625,
      "end": 2921.97998046875,
      "text": " then that which is imperfect shall be done away."
    },
    {
      "id": 184,
      "start": 2921.97998046875,
      "end": 2923.739990234375,
      "text": " But I want you to think about the last verse."
    },
    {
      "id": 185,
      "start": 2923.739990234375,
      "end": 2925.6599731445312,
      "text": " And now abideth faith, hope, charity."
    },
    {
      "id": 186,
      "start": 2926.3399658203125,
      "end": 2930.9400024414062,
      "text": " These three, but the greatest of these is charity, love."
    },
    {
      "id": 187,
      "start": 2930.9400024414062,
      "end": 2932.8599853515625,
      "text": " We're familiar with 1 Corinthians 13."
    },
    {
      "id": 188,
      "start": 2934.739990234375,
      "end": 2937.2999877929688,
      "text": " It's a very common passage of scripture."
    },
    {
      "id": 189,
      "start": 2937.2999877929688,
      "end": 2940.02001953125,
      "text": " We're familiar with the admonition that Jesus gives"
    },
    {
      "id": 190,
      "start": 2940.02001953125,
      "end": 2941.739990234375,
      "text": " to the disciples, that we're to love one another"
    },
    {
      "id": 191,
      "start": 2941.739990234375,
      "end": 2942.9400024414062,
      "text": " as He loved."
    },
    {
      "id": 192,
      "start": 2945.4600219726562,
      "end": 2949.219970703125,
      "text": " By this shall all men know that you're my disciples."
    },
    {
      "id": 193,
      "start": 2949.219970703125,
      "end": 2953.97998046875,
      "text": " I think about the terminologies in the first three verses"
    },
    {
      "id": 194,
      "start": 2954.2999877929688,
      "end": 2957.1799926757812,
      "text": " that if I don't have charity, I'm become a sounding brass,"
    },
    {
      "id": 195,
      "start": 2957.1799926757812,
      "end": 2958.2999877929688,
      "text": " a tinkling cymbal."
    },
    {
      "id": 196,
      "start": 2958.2999877929688,
      "end": 2961.0999755859375,
      "text": " I am nothing, it profiteth me nothing."
    },
    {
      "id": 197,
      "start": 2962.6199951171875,
      "end": 2965.1799926757812,
      "text": " I understand, I believe that you can develop"
    },
    {
      "id": 198,
      "start": 2965.1799926757812,
      "end": 2968.97998046875,
      "text": " a biblical principle to support this statement."
    },
    {
      "id": 199,
      "start": 2968.97998046875,
      "end": 2972.260009765625,
      "text": " It's not a verse of scripture, but I really believe"
    },
    {
      "id": 200,
      "start": 2972.260009765625,
      "end": 2974.1400146484375,
      "text": " that if you look at the book of 1 Thessalonians,"
    },
    {
      "id": 201,
      "start": 2974.1400146484375,
      "end": 2977.1400146484375,
      "text": " that you can support this quote or this statement."
    },
    {
      "id": 202,
      "start": 2977.1400146484375,
      "end": 2979.6599731445312,
      "text": " And someone said this years and years ago,"
    },
    {
      "id": 203,
      "start": 2979.6599731445312,
      "end": 2981.0599975585938,
      "text": " people don't care how much you know"
    },
    {
      "id": 204,
      "start": 2981.0599975585938,
      "end": 2982.2999877929688,
      "text": " until they know how much you care."
    },
    {
      "id": 205,
      "start": 2982.2999877929688,
      "end": 2984.1799926757812,
      "text": " How many of you ever heard somebody say that?"
    },
    {
      "id": 206,
      "start": 2984.1799926757812,
      "end": 2987.02001953125,
      "text": " Now, that's not a Bible verse, but I do believe"
    },
    {
      "id": 207,
      "start": 2987.02001953125,
      "end": 2989.1799926757812,
      "text": " that if you look in the book of 1 Thessalonians"
    },
    {
      "id": 208,
      "start": 2989.1799926757812,
      "end": 2992.0599975585938,
      "text": " and you find that Paul is speaking to those people"
    },
    {
      "id": 209,
      "start": 2992.0599975585938,
      "end": 2994.8200073242188,
      "text": " in Thessalonica, and he says, I cared for you"
    },
    {
      "id": 210,
      "start": 2994.8200073242188,
      "end": 2997.3399658203125,
      "text": " as a nurse, cherisheth her children."
    },
    {
      "id": 211,
      "start": 2997.3399658203125,
      "end": 2999.0599975585938,
      "text": " And then he's delivering to them, he said"
    },
    {
      "id": 212,
      "start": 2999.0599975585938,
      "end": 3000.8599853515625,
      "text": " that I'm sending Timothy to perfect that"
    },
    {
      "id": 213,
      "start": 3000.8599853515625,
      "end": 3002.8599853515625,
      "text": " which is lacking in your faith."
    },
    {
      "id": 214,
      "start": 3002.8599853515625,
      "end": 3005.5,
      "text": " Well, that's, I mean, if I don't know that you love me"
    },
    {
      "id": 215,
      "start": 3005.5,
      "end": 3006.3399658203125,
      "text": " and you're coming to me saying,"
    },
    {
      "id": 0,
      "start": 3006.3399658203125,
      "end": 3010.5399656295776,
      "text": " and I got some areas in which I need to develop, I'm not all the way there, like I could take"
    },
    {
      "id": 1,
      "start": 3010.5399656295776,
      "end": 3016.279965400696,
      "text": " offense to that. But we don't see in any way that the believers in Thessalonica take offense"
    },
    {
      "id": 2,
      "start": 3016.279965400696,
      "end": 3022.3399658203125,
      "text": " to anything that is said. Why? Because they knew that Paul loved them. He cared about"
    },
    {
      "id": 3,
      "start": 3022.3399658203125,
      "end": 3025.979965209961,
      "text": " them. You know, if we don't have charity, you ever try to talk to somebody and they"
    },
    {
      "id": 4,
      "start": 3025.979965209961,
      "end": 3032.77996635437,
      "text": " just don't, they don't see your heart of compassion, of love? Someone asked me recently, trying"
    },
    {
      "id": 5,
      "start": 3032.77996635437,
      "end": 3039.7799644470215,
      "text": " to share the gospel with them. I said, why do you even care? That's what they said to"
    },
    {
      "id": 6,
      "start": 3039.7799644470215,
      "end": 3046.6599655151367,
      "text": " me. What's in it for you? I said, honestly, nothing. There is absolutely nothing in it"
    },
    {
      "id": 7,
      "start": 3046.6599655151367,
      "end": 3052.0599670410156,
      "text": " for me, aside from obedience, but my obedience has given you the truth. Whether you accept"
    },
    {
      "id": 8,
      "start": 3052.0599670410156,
      "end": 3060.699966430664,
      "text": " it or reject it, I'm not going to answer for that. Is that true? My job, my duty, my responsibility,"
    },
    {
      "id": 9,
      "start": 3060.699966430664,
      "end": 3066.539966583252,
      "text": " what I'm accountable for is to give the truth. And here's what I told the individual, I'm"
    },
    {
      "id": 10,
      "start": 3066.539966583252,
      "end": 3073.859962463379,
      "text": " going to heaven when I die, whether you get saved or not. But here's the thing, I understand"
    },
    {
      "id": 11,
      "start": 3073.859962463379,
      "end": 3080.979965209961,
      "text": " the truth, and I want you to go to heaven when you die, because the alternative isn't"
    },
    {
      "id": 12,
      "start": 3080.979965209961,
      "end": 3089.179962158203,
      "text": " so great, the lake of fire. But they looked at me with all seriousness, why do you care?"
    },
    {
      "id": 13,
      "start": 3089.179962158203,
      "end": 3094.7799682617188,
      "text": " What do you want from me? I don't want anything from you. Nothing. I just want you to be"
    },
    {
      "id": 14,
      "start": 3094.7799682617188,
      "end": 3103.7799682617188,
      "text": " saved. I just want you to be saved. See, people need to see our love. They need to see that"
    },
    {
      "id": 15,
      "start": 3103.7799682617188,
      "end": 3112.0599670410156,
      "text": " we're genuine. Notice what John says, he heard the Lord Jesus Christ give that new commandment,"
    },
    {
      "id": 16,
      "start": 3112.2199630737305,
      "end": 3123.1399688720703,
      "text": " and he says this in closing in 1 John 4, in verses 7 and 8. 1 John 4, verses 7 and 8. Notice"
    },
    {
      "id": 17,
      "start": 3123.1399688720703,
      "end": 3128.1399688720703,
      "text": " what John, who heard the Lord Jesus Christ give that new commandment, under the inspiration of"
    },
    {
      "id": 18,
      "start": 3128.1399688720703,
      "end": 3135.939971923828,
      "text": " the Holy Spirit of God, notice what he says. Beloved, let us love one another, for love is"
    },
    {
      "id": 19,
      "start": 3136.699966430664,
      "end": 3147.8199615478516,
      "text": " of God. And everyone that loveth is born of God and knoweth God. He that loveth not, knoweth"
    },
    {
      "id": 20,
      "start": 3147.8199615478516,
      "end": 3164.3399658203125,
      "text": " not God, for God is love. Put on bowels of mercies, kindness, humbleness of mind, meekness,"
    },
    {
      "id": 21,
      "start": 3164.3399658203125,
      "end": 3172.3399658203125,
      "text": " long-suffering, forbearing one another, forgiving one another. And above all these, put on charity,"
    },
    {
      "id": 22,
      "start": 3172.3399658203125,
      "end": 3177.8199615478516,
      "text": " which is the bond of perfectness. Oh, we've learned some things over the last few weeks"
    },
    {
      "id": 23,
      "start": 3177.8199615478516,
      "end": 3182.739959716797,
      "text": " that we need to put off, but now this morning we learned some things we need to put on. There's an"
    },
    {
      "id": 24,
      "start": 3182.739959716797,
      "end": 3188.699966430664,
      "text": " area in your life where the Holy Spirit of God just touched and said, this is an area, this put"
    },
    {
      "id": 25,
      "start": 3188.739959716797,
      "end": 3197.8599700927734,
      "text": " on area, this particular thing. God, help me. Help me to walk in the Spirit. Help me to have the fruit"
    },
    {
      "id": 26,
      "start": 3197.8599700927734,
      "end": 3204.259963989258,
      "text": " of the Spirit. Help me to be all that you've called me to be. Help me to be like your dear"
    },
    {
      "id": 27,
      "start": 3204.259963989258,
      "end": 3209.7799682617188,
      "text": " Son. See, that's God's plan, is that we'd be conformed to the image of His dear Son. Let's"
    },
    {
      "id": 28,
      "start": 3209.7799682617188,
      "end": 3215.7799682617188,
      "text": " pray together. Father, we love you. We thank you for loving us. Thank you for the Word of God and"
    },
    {
      "id": 29,
      "start": 3215.7799682617188,
      "end": 3222.3399658203125,
      "text": " for the truth that's contained therein. We thank you that you have provided to us in this portion"
    },
    {
      "id": 30,
      "start": 3222.3399658203125,
      "end": 3230.2999725341797,
      "text": " of Scripture as your people, not only things that we need to put off, but now things that we need"
    },
    {
      "id": 31,
      "start": 3230.2999725341797,
      "end": 3237.699966430664,
      "text": " to put on. We're thankful that your plan is that we would be like Christ, conformed to the image"
    },
    {
      "id": 32,
      "start": 3237.699966430664,
      "end": 3245.0199584960938,
      "text": " of your dear Son. I thank you that you gave us that principle that there's no partiality. Christ"
    },
    {
      "id": 33,
      "start": 3245.0199584960938,
      "end": 3253.419967651367,
      "text": " is to have the preeminence. And in Christ, we are to be unified, brothers and sisters in Christ."
    },
    {
      "id": 34,
      "start": 3253.419967651367,
      "end": 3264.699951171875,
      "text": " What a joy. Because we notice this process that is given to us with this put on therefore. I thank"
    },
    {
      "id": 35,
      "start": 3264.699951171875,
      "end": 3271.699951171875,
      "text": " you for working in my heart and my life. I pray God that as only you can, you would move and work"
    },
    {
      "id": 36,
      "start": 3271.699951171875,
      "end": 3280.0199584960938,
      "text": " and help us, Lord, to respond to how the Holy Spirit has spoken to us. That we'd allow you to"
    },
    {
      "id": 37,
      "start": 3280.0199584960938,
      "end": 3287.5799560546875,
      "text": " have your will and way in our lives. That we would truly seek to be like Christ. That we could make"
    },
    {
      "id": 38,
      "start": 3287.5799560546875,
      "end": 3293.8199768066406,
      "text": " the difference that you've called us to make, and if some have compassion, making a difference."
    },
    {
      "id": 39,
      "start": 3293.8199768066406,
      "end": 3300.4599609375,
      "text": " Father, if there's one present that's never been saved, they've never trusted the Lord Jesus Christ"
    },
    {
      "id": 40,
      "start": 3300.4599609375,
      "end": 3306.5799560546875,
      "text": " as their personal Savior. I pray that today would be the day of their salvation. They'd understand"
    },
    {
      "id": 41,
      "start": 3306.5799560546875,
      "end": 3312.0999755859375,
      "text": " before they can do any of what we've talked about this morning, they must first be born again in"
    },
    {
      "id": 42,
      "start": 3312.0999755859375,
      "end": 3323.4599609375,
      "text": " Christ. And that today is the day of salvation. Their sin carries with it a wage. That wage is"
    },
    {
      "id": 43,
      "start": 3323.4599609375,
      "end": 3328.939971923828,
      "text": " death, separation from God in the lake of fire. We're so thankful for the gift of God, which is"
    },
    {
      "id": 44,
      "start": 3328.939971923828,
      "end": 3335.419952392578,
      "text": " eternal life through Jesus Christ our Lord. I pray that you'd move and work as only you can. We'll"
    },
    {
      "id": 45,
      "start": 3335.419952392578,
      "end": 3339.179962158203,
      "text": " give you the glory for every decision that's made, for it's in Christ's name we pray. Would you stand"
    },
    {
      "id": 46,
      "start": 3339.179962158203,
      "end": 3343.5399780273438,
      "text": " with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano, and as she does,"
    },
    {
      "id": 47,
      "start": 3343.5399780273438,
      "end": 3348.6199645996094,
      "text": " the altar is open. Maybe you need to come to this old-fashioned altar this morning. Maybe you need"
    },
    {
      "id": 48,
      "start": 3348.6199645996094,
      "end": 3353.3799743652344,
      "text": " to make your pew an altar. But as the Holy Spirit of God has used the Word of God to minister to the"
    },
    {
      "id": 49,
      "start": 3353.3799743652344,
      "end": 3358.0599670410156,
      "text": " people of God, let's do business with God as Kimberly plays."
    }
  ],
  "processed_at": "2025-04-17T04:29:46.048975"
}