{
  "video_id": "pYLTkv5zKls",
  "text": "this evening, the book of Nehemiah. We'll be looking at Nehemiah chapter number two and we're gonna reference some things from the first chapter before we get into the message this evening. Nehemiah chapter two verses eleven through twenty will be the text for the service this evening. I just want to mention just a few background points with regard to this book of Nehemiah. Some of you might be familiar with it, but Nehemiah is the cupbearer to Artaxerxes. He's living post-captivity. And so what do we mean by that? Well, of course you know that the nation of Israel was taken captive by the Assyrians because of their wickedness, their idolatry, their sin, and God's judgment came upon them. And then shortly thereafter we find that Judah was taken captive into Babylon. That Babylonian captivity as prophesied by Jeremiah would last for seventy years. And of course Daniel as he was reading Jeremiah's prophecies and he understands the fulfillment of those seventy years and there's a remnant that was then permitted to return back to Jerusalem. So Nehemiah in Nehemiah chapter number one, he's not in Jerusalem, but he's inquired with regard to what's taking place in the city of Jerusalem with the people of God. And he is living there as the cupbearer again for Artaxerxes the king, but he's living post-captivity. We find that the report is provided, if you notice in chapter one, the Bible says in verse number two that Hanani, one of my brethren, came, he and certain men of Judah, and I asked them concerning the Jews that had escaped, which were left of the captivity, and concerning Jerusalem. And so you find that Nehemiah was concerned enough to ask, to inquire, ask to the condition not only of the people but also of the city. And he was burdened, he was interested in knowing, and it says that he asked them, and it says to us in verse number three, and they said unto me, and this is where Nehemiah receives the report, he is given a report and it says this, that the remnant that are left of the captivity there in the province notice are in great affliction and reproach. The wall of Jerusalem also is broken down and the gates thereof are burned with fire. It's no good report that Nehemiah receives and we find that this report that is provided to Nehemiah has an impact and the impact is serious. We find that Nehemiah is broken over the condition of what he hears and that brokenness, however, leads him to a closer walk with the Lord. There's a message all in of itself of that particular truth because we find that his response to hearing this awful report was that it says this in verse number four, and it came to pass when I heard these words that I sat down, notice, and wept and mourned certain days, but then he says this, and fasted and prayed before the God of heaven. He was broken over what he had heard of the report that was received, but that brokenness led him to a closer walk with the Lord. There's no doubt in my life, again it's not really the message this evening, there's no doubt in my mind, however, that there are times in which we will face circumstances and situations in our lives that may lead us to a place of brokenness, but that brokenness must lead us to a closer walk with the Lord. It must not allow, we must not allow for some circumstances to cause there to be a wedge or divide between me and my Savior, and that my brokenness causes me to be full of despair and to lose hope. Know that I draw nigh unto God, that I draw closer to Him. We find that he prays, and after he prays we find that he, once again, if you enter into the second chapter, and really we'll be looking at verse number eleven and going forward from there, but we find that eventually, after he prays and seeks the Lord, that he has an interaction with the king, with Artaxerxes, it's recorded for us in the beginning of chapter number two, we find that in that interaction the king had not seen Nehemiah sad at any other time in his presence. And the king, according to verse number two, said this is nothing more than sorrow of heart. In this situation, the circumstance had been laying heavy on the heart of Nehemiah, and we find that Nehemiah, he makes this request in verse number four, the Bible says, the king said unto me, For what dost thou make request? Notice the Bible says, So I prayed to the God of heaven, and I said unto the king, If it please the king, and if thy servant have found favor in thy sight, that thou wouldst send me unto Judah, unto the city of my father's sepulchres, that I may build it. We find that that's the request that Nehemiah has, and as we come to our text this evening, picking it up in verse number eleven, we find that our text is going to pick up the account at the time in which he's arrived in the city, and the Bible tells us that he was there for three days. Notice in verse eleven, the Bible says, So I came to Jerusalem, and was there three days, and I rose in the night. I and some few men with me, neither told I any man what my God had put in my heart to do at Jerusalem. Neither was there any beast with me, save the beast that I rode upon, and I went out by night by the gate of the valley, even before the dragon well, and to the dung port, and viewed the walls of Jerusalem, which were broken down, and the gates thereof were consumed with fire. Then I went on to the gate of the fountain, to the king's pool, but there was no place for the beast that was under me to pass. Then went I up in the night by the brook, and viewed the wall, and turned back, and entered by the gate of the valley, and so returned. We'll continue reading through verse number 20 as we get through the message this evening, but I want you to notice a phrase in verse number 12, and I've used this phrase really for the sermon this evening. Notice the Bible says, and I arose in the night, in verse number 12, I and some few men with me, and then it says this, neither told I any man what my God had put in my heart to do at Jerusalem. For the next few moments, I want to preach a message that I've simply entitled, When God Puts Something in Your Heart. We find that it's revealed in verse number five of the text of scripture, as he's speaking to Artaxerxes, that he had this desire, that he would receive permission to leave his place of responsibility, to go to Judah, to go to Jerusalem specifically, that he might build it. And we find that he is granted permission, he arrives in Jerusalem, according to verse number 11, and he's there for three days. The Bible goes on to give us an account that I think is so powerful, and so applicable for us this evening, when we consider the work of God that must be accomplished. I'm so thankful to be part of the greatest work in all the world. I preached a message earlier in the month of December, with regard to really that thought of being involved in the work of the ministry. The message was from the end of 2 Timothy chapter number four, when the Bible says about Mark, bring him, why? For he is profitable to me for the ministry. And I mentioned about being profitable for the ministry, and what a blessing it is to be involved in the ministry and the work of God. And we find here in Nehemiah chapter two, that God put something in Nehemiah's heart. As we look at the text of scripture, I want you to consider with me, number one, the reconnaissance of Nehemiah. In verses 11 through 15, we find that Nehemiah, there's really a reconnaissance type mission that takes place, if you will. I've read the verses of scripture. But we find that as we look at verses 12 through 15, as Nehemiah goes out, the Bible says, I arose in the night in verse number 12. He says he took a few men with him. There was no beast, according to the end of the verse with me, save the beast that I wrote upon. And notice in verse number 13, it says, and I went out by night by the gate of the valley, even before the dragon well into the dung port and viewed the walls of Jerusalem, which were broken down and the gates thereof were consumed with fire. He left from that place and he went onto the gate of the fountain and the king's pool. But there was no place for the beast that was under me to pass. And then in verse 15, he went up in the night by the brook and viewed the wall and turned back and entered by the gate of the valley and so returned. And as Nehemiah goes out on this particular mission, on this reconnaissance mission, if you will, I believe that Nehemiah is now seeing with his own eyes what he had previously only been told about. He had received a report according to chapter number one. And the report, as I read a moment ago, was that the people were in great affliction and reproach and that the wall of Jerusalem was broken down and the gates thereof are burned with fire. But now on this night, after the three days of being in Jerusalem, as Nehemiah and a few men go out, we find that he now is seeing with his own eyes the condition. I'm beginning to think about the truth of Lamentations 3. And perhaps if you have your Bibles, turn over there to Lamentations chapter 3 very quickly. And I want to remind you of a verse of Scripture in Lamentations, Jeremiah Lamentations, and look at Lamentations chapter 3. And I want you to notice what the Bible says in verse number 51. Lamentations 3 in verse number 51, the Bible says this, Mine eye affecteth... my heart, because of all the daughters of my city.\" You know there's something about seeing for yourself. There's something about what passes through your eye gate when you see that. It's one thing to read a report from a missionary, it's one thing to to hear on a Wednesday evening an update from a missionary, it's one thing to hear the pastor stand in the pulpit week after week and talk about a need in our region to reach our region with the gospel and then to go from here out to the world to reach the world with the gospel. It's one thing to hear someone give a testimony of, I was out talking to people and sharing the gospel with people and I was knocking on doors and here's, it's a whole nother thing to go out and experience it yourself. And to truly see the need, to see it with your own eyes, to see the condition of the of the world, to see the need of those around us. We understand that their greatest need is the need of salvation and we understand that we have the answer. In fact this afternoon I was in the office for just a short period of time this afternoon before the service and I was reading some things and one of the things that I read said this, it said that God's plan to reach this generation with the gospel is us. Absolutely. There are no more Spurgeons, there are no more Moody's. We can talk about them. Paul is with the Lord and has been for centuries. Amen. But we find that Nehemiah, he cared enough to ask but then God put something in his heart. And as God put something in his heart we find that Nehemiah goes to Jerusalem and after having the permission to leave from his place of responsibility in the palace as the cupbearer to Artaxerxes, we find that he arrives there in Jerusalem and what does he do before he tells anybody what God has put in his heart? He goes out and he sees it with his own eyes. You know why I think that is? Because he would then have the ability to communicate much more effectively after seeing it with his own eyes. He would have more of a fire burning in his soul after seeing it with his own eyes. You don't believe me? Think about the the report that we received at the end of the month of September after we returned from the missions trip to Panama. Those eleven people that came back, we had the privilege of being there and we came back and we gave testimonies that evening and you know it was interesting to hear the individual stand and give testimonies about what they saw, what they experienced personally as they were there in Panama. There's something about seeing it that does something in your heart, does something in your soul. Nehemiah had heard but now he sees. We see the reconnaissance of Nehemiah. I want you to notice in verses 16 and 17, number two, the request of Nehemiah. We find that the Bible says in verse 16, and the rulers knew not whither I went or what I did, neither had I as yet told it to the Jews, nor to the priests, nor to the nobles, nor to the rulers, nor to the rest that did the work. Then said I unto them, notice what he says, ye see the distress that we are in, how Jerusalem lieth waste and the gates thereof are burned with fire. Come and let us build up the wall of Jerusalem that we be no more a reproach. The reality is that the individuals that Nehemiah is speaking to in verses 16 and 17, they were the ones that lived there, they were the ones that had gotten used to the condition of the city, they were the ones that had week after week and had gone through and they'd seen that the walls were broken down, they'd seen that the the gates were burned with fire, they knew that they were reproach and they they just kind of got used to it. You ever think about that? Just kind of getting used to it. We get to the place where we're just almost not affected anymore. But he says to these individuals that had been living there, these individuals that knew it, he says to them, ye see the distress that we are in. This was nothing new for them, this was not their first pass. It was Nehemiah's first time that his eyes are beholding the condition of the city, but it is not the first time for these individuals. They had been there, they had lived it, and they had grown, I believe, calloused to the situation. And the Bible says something very interesting at the end of verse number 17. Notice what he says, come and let, what does it say? Us. Come and let us build up the wall of Jerusalem that we be no more a reproach. I begin to think about this request of Nehemiah, and he says us, and he says we, and this is speaking in the plural and understanding that this is a work, listen, this work was too big for Nehemiah. He could not on his own, with his own resources and his own strength, he could not accomplish what they together could accomplish. And therefore he says, come and let us build up the wall of Jerusalem that we be no more a reproach. God put something in the heart of Nehemiah, but he was gonna need the help of others. This was some great task, and he mentions in other portions of this book of Nehemiah, in fact in chapter 6, hold your place there in chapter 2, but go over to chapter 6 and look at verse 3, and notice as these messengers came to him and besought him to go and have this meeting in one of the villages in the plain of Ono. In verse number 3 we find that he, Nehemiah, sent messengers unto them, and notice what he says, I am doing a great work so that I cannot come down. Why should the work cease whilst I leave it and come down to you? Listen, he understood that it was a great work, he understood that this task, the work, the burden that God had placed in his heart was beyond his ability to accomplish in and of himself, but he says, let us, that we be no more a reproach. And Nehemiah is making this request, I want you to consider the truth of being co-laborers with the Lord. Notice over in the book of 1 Corinthians, if you will, look at some New Testament principles, and look in the book of 1 Corinthians, and we'll look at 2 Corinthians as well, and as you're turning there, I just want to remind you in there, in Luke chapter number 5, I don't need you to turn there, but when God told them to, told Peter to cast out into the deep, launch out into the deep, let down your nets for a draft of fishes, we find that it's interesting, you know what he did? He called, he beckoned to his partners. You know what he said? Come and help us. And we come here to the book of 1 Corinthians in chapter number 3, and I want you to notice, as Paul is writing to these believers in Corinth, these individuals that he mentions that they're carnal, because they're saying, I'm of Paul, I'm of Apollos, and so on and so forth, but notice what he says in verse number 5 of 1 Corinthians 3, who then is Paul and who is Apollos? But ministers, by whom you believed, even as the Lord gave to every man, I have planted, Apollos watered, but God gave the increase. Continue reading and look in verse 7, the Bible says, so then neither is he that planteth anything, neither he that watereth, but God that giveth the increase. Now he that planteth and he that watereth, what does it say? Are one. They're one. And every man shall receive in his own reward according to his own labor, and then notice this in verse number 9, for we are laborers together with God. Ye are God's husbandry, ye are God's building, and notice as he says in verse number 9, we are laborers together with God. Every word is specifically chosen. I'm thankful that all Scripture is given by inspiration of God, and we believe in the verbal plenary inspiration that every word of God is pure. And here's what God says. He says, we are, that's the believers, the Christians, we are laborers together, not for God, but with God. We are laborers together with God. And we find that Nehemiah, as he goes and he sees with his own eyes what he'd only previously heard with his ears, and God had put this thing in his heart, but before he could let any man know what God had put in his heart, he had to go out and see it for himself. And after he sees it, he makes this request, and he says, come and let us build up the wall of Jerusalem, that we be no more a reproach. And I'm reminded this evening about the importance of being co-laborers, being laborers together with God. And I'm thankful that God would use us, that God would allow us to serve him, and that God would equip us and strengthen us and and use us for his honor and for his glory. But we understand that what we could accomplish as a collective group is so much greater than what any one of us could accomplish in of ourselves. What we can accomplish as we're laboring together with God far exceeds what we could ever imagine being accomplished in of our own strength. We find that Paul then says to the believers here in Corinth, look in 2 Corinthians chapter number 6 as he continues to really hammer this thought down with this church in Corinth and understanding the position that we have and the great joy that we have in serving the Lord. 2 Corinthians 6 and verse number 1, we then, notice what he says, as workers together with him, beseech you also that you receive not the grace of God in vain. In several months I'll be preaching from this particular text of scripture on Sunday morning as we make our way through the book of 2 Corinthians, but understand with me as we look at this tonight as making reference from this passage in the book of Nehemiah that what Paul is again reiterating to the believers in Corinth is that we're workers together with God, but he says this, he says we then as workers together with him, beseech you also, notice that you receive not the grace of God, what's he say? In vain. God's grace, we talk about God's grace and God's grace is so precious and so important to understand, but when we think of God's grace in this particular context, he's not talking about God's saving grace, he's talking about God's enabling grace, and that we would be good stewards of the manifold grace of God. See, God saved us by grace, but then he gives us grace to serve him, he enables us to do the work as we are workers together with him, and Paul says that we receive not the grace of God in vain. That means that some could be guilty of receiving the grace of God, that enabling, in vain. How does that work? Well, they're not being good stewards of the manifold grace of God, they're not using the equipping that God has given for the honor and glory of God himself. And so we find that as this man Nehemiah comes to Jerusalem, can you imagine as these people had been living there, and Nehemiah comes in, and Nehemiah all of a sudden he just goes out and he's riding around, he's taking a look at the city, and he gathers these people together and he says, come, let us build up the wall of Jerusalem. I'm sure there were some that wondered, what in the world, you're just new here, I mean don't you know what's going on here? Don't you know that it's not possible? Don't you know? There's always some, there's always some. The reality is that Nehemiah had something in his heart that came from God. God put something in his heart. And what God put in his heart was to build up the wall, but he needed the help of others. And so he made the request, notice with me the response of the people, number three, if you're taking notes tonight, look at the response of the people. I will say this, I am overjoyed as you read the recorded response that is given to us in verse 18, the Bible says, then I told them of the hand of my God which was good upon me. It begins to share with them what God has been doing in his life, and maybe if you go back to the chapter two, or earlier in the chapters I mentioned that he makes that request in verse five to the king Artaxerxes that I may build it, and the king said unto me in verse number six, the queen also sitting by him, for how long shall I journey be and when wilt thou return? So it pleased the king to send me, and I said unto him, a time. Moreover I said unto the king, if it pleased the king, let letters be given me to the governors beyond the river, that they may convey me over till I come unto Judah, and a letter unto Asaph, the keeper of the king's forest, that he may give me timber to make beams for the gates of the palace, which appertain to the house and for the wall of the city, and for the house that I shall enter into, and the king granted me notice according to the good hand of my God upon me. Nehemiah was operating here not with a lack of faith, but following the leadership of God in his life, and he made the request to the king for these letters that would help him to easily travel from where he was located to Jerusalem, but also recognizing that he would need some supplies and said, can I get a letter to be able to get the supplies as well, and the Bible says that the king granted these letters to him, but notice what Nehemiah acknowledges, according to the good hand of my God upon me. God uses people. God uses people. God could do whatever he wants to do on his own. He's God. But God has chosen to use his people. And we find that God will put something into the hearts of his people, and God will enable us to do the work that he's called us to do. And we find that Nehemiah, as he's received these letters, it says in verse 9, then I came to the governors beyond the river, and what did he do? I gave them the king's letters. Now the king had sent captains of the army and horsemen with me. When Sanballat, the Hornite, and Tobiah the servant, the Ammonite heard of it, it grieved them exceedingly that there was come a man to seek the welfare of the children of Israel. But God's hand was good upon Nehemiah. And Nehemiah made this request, and as we read the response in verse 18, we're told that Nehemiah, even still before they're able to respond, he lets them know of how God was at work and what God was doing and how God was orchestrating these events and how God was showing his hand mighty. And the Bible says this, then I told them of the hand of my God which was good upon me, verse 18, as also the king's words that he had spoken unto me. And they said, here's the response of the people, hallelujah for this response, let us rise up and build. Let us rise up and build. He says, come, let us build up the wall. And they respond and they say, let us rise up and build. They needed a man that had vision, they needed a man that had something in his heart that God gave him to do to provide leadership and direction and to give them a cause and to help them understand that we are working together and we're seeking to accomplish what God has set us out to accomplish and they respond with this positive response of let us rise up and build. And then notice the end of verse 18, so they strengthened their hands for this good work. Can I submit to you this evening that this work that they were about to embark upon, this work that they were going to put their hand to was not a work of ease, it was not a work of comfort, it was not a work that was without any issues, it was a work that was laborious, it was a work that was exhausting and we find that they said, let us rise up and build, so they strengthened their hands for this good work. Could they have provided excuse, I'm sure they could. Could they have come up with maybe what some would say would be a valid excuse, I'm sure some could. But they said, let us rise, let us rise up and build. The Bible tells us later that the people had a mind to work. They responded in such a positive way, they could not, what they could not accomplish individually they now would be able to accomplish together as co-laborers. We understand that this great work that God gave them to do, that they would have the opportunity to see God work in an amazing way. In fact, we mentioned earlier about chapter six and all that was going on, turn back there again if you will to chapter six and in verse number 15, the Bible tells us this wonderful truth, so the wall, what does it say in your Bible? Was what? Finished. What does that mean? It means the work was accomplished. It means the work that they were enlisted to engage in in verse 17 of chapter two, come and let us build up the wall of Jerusalem that we be no more reproached. The people said, let us rise up and build so they strengthen their hands for this good work and the Bible says so the wall in Nehemiah six and verse 15 was finished in the twenty and fifth day of the month Elul in fifty and two days. What an accomplishment. That's what God can do. That's what God can do. Nehemiah could never do that. But when the people of God come together and are laboring together with God, God provided them with strength, God provided them with wisdom and they were able to accomplish a great work. Notice in verse 16. 16 of chapter 6, the Bible says in it came to pass that when all our enemies heard thereof and all the heathen that were about us saw these things, they were much cast down in their own eyes, notice, for they perceived that this work was wrought of our God. You know, God has not called us to build a wall, but God's called us to do a work. God's called us to do a work, and the work is not building a wall, but the work is propagating the truth of the gospel. The work that we're called to be involved in and engaged in is a work that requires us to go in the power of God, to go together in boldness and understanding that we're seeking to take a message to a lost and dying world, and we must come to this place where we recognize that it is our responsibility and we respond by saying, as Isaiah did in Isaiah 6, here am I, send me. It doesn't mean that we'd have to cross an ocean, it doesn't mean that we'd have to learn a new language, a new culture, it simply means that we may have to cross a street and actively be engaged in trying to reach someone with the gospel of the Lord Jesus Christ. I made this comment recently, I don't remember if it was on a Sunday morning or evening, but just in the last couple of weeks I made the comment, and I don't make the comment to be unkind to anyone, but just as God placed it upon my heart and challenged me with this thought, is this, it's not within me. We read the text already in 1 Corinthians chapter 3, I can't save anybody and you can't save anybody. It is God who gives the increase, amen? We believe that. But here's how God has challenged me and how I hope that God would challenge you as well, is not, when was the last time somebody, I had the privilege of leading somebody to Christ because God gives the increase, but the question really is this, when is the last time I've even shared the gospel with someone? Because that is something that is my responsibility. Could I say tonight, that's something that is your responsibility, to share the gospel. I can't save anybody, you can't save anybody, but I sure can tell somebody about Jesus. Some plant, some water, but God gives the increase. And we are laborers together with God. And we find here that the response of the people was so appropriate with regard to the request that was made, and they say, let us rise up and build. You say, man, it's wonderful, but it's not the end of the chapter, it's not the end of the chapter. There's one final point this evening, and that's this, number four, the resistance faced. You know, when there's a response like we read in verse 18, when there's a request like we see in verse 17, when God has put something in your heart like we see God putting in the heart of Nehemiah to go and do this work, to be engaged in what God has burdened him with, and the way that God's hand was upon him, the good hand of my God upon me, and as he received the letters and he had all of the resources and all of these things, and we find that Nehemiah comes to a place and he says, I'm doing what God's called me to do, and the people say, let us rise up and build, then everything should just go smooth. Have you found that it doesn't work that way? There's resistance that the people of God face. The Bible says in verse 19, but when Sanballat the Horonite and Tobiah the Servant, the Ammonite, and Geshem, excuse me, the Arabian heard it, they laughed us to scorn and despised us, and said, what is this thing that you do? Will ye rebel against the king? So we find that the resistance really starts out kind of light. It will intensify if you study the book of Nehemiah and you continue to go through and you see the resistance, in fact, in chapter number four in particular, you see how the enemy mocks and how they threaten and all that they do and they come and they seek to destroy and all that's taking place and we could not have the time this evening to read through the fourth chapter of the book of Nehemiah, but I would encourage you to go back later and read through it because you see this mocking, if you will, this little ridicule in chapter number two in verse 19 is light compared to what will be faced. In fact, when you get to chapter number six and we read already about him saying, Nehemiah saying, no, I'm not going to go because I'm doing a great work, not only did they send those letters to try to pull him away so that they might deal with him, but we find that then they lied and they said to Nehemiah that he should go hide himself in the temple which was not appropriate so that they can bring accusation against him. Listen, the enemy is deceitful. The enemy is relentless. We see the resistance faced and here when we look in verse 19, it's just the fact that the Bible tells us that they laughed at them. Well, that's not too bad. Well, you don't like being laughed at, am I right? I'm going to set out to do this and somebody laughs at you and says, good luck, it's not going to happen. Never going to work. It's discouraging. You know, discouragement is a tool that's in Satan's toolbox that he uses over and over and over again, the tool of discouragement. You know, sometimes he'll use even well-intentioned people to discourage you. That can't be done. You can't do that. The Bible says that they despised us. What is this thing that you do? Will ye rebel against the king? Later on in chapter 4, they talk about even if they were to do the work that even if I fox would run upon it, in verse number 3, even that which they build, if a fox go up, he shall even break down their stone wall. But notice the response in verse number 20, we'll always have adversity. We will always face resistance. When you seek to do a work for God, you can just guarantee there's going to be resistance because we have an enemy who hates advancement. He hates it when we seek to do the will of God. You know, he doesn't mess with you when you're just sitting on the sideline and just not really doing anything. You start trying to do something, and here's what happens in your mind. You say, well, I'm trying to do something for God and all these things have happened. Yeah, that's how it works. That's how it works. Because that's when the enemy notices you and says, oh, I got to deal with this. I got to discourage them. I got to stop them. Why? Because they're trying to do something for God. And we cannot focus on the resistance, no. We must take note of how Nehemiah answered this resistance that first came in verse 19. In verse 20, the Bible says, then answered I them. Notice what Nehemiah said. The God of heaven, he will prosper us. You see that as a statement of faith, confidence? I mean, we find that it says, therefore, we his servants will arise and build, but you have no portion, nor rite, nor memorial in Jerusalem. Man, that's wonderful to see the resolve. See, God put something in his heart. He said, I'm not going to focus on the resistance. I'm just going to let you know that our God is going to prosper us and that we are going to do what God has called us to do. It's interesting when you read chapter 3, and I'll finish with this, that you go through the work being assigned and the text gives us all of these individuals that we're building at particular gates and what have you. But I just want to note one statement in verse number 5. The Bible says, next unto them the Techoites repaired, but notice this, their nobles put not their necks to the work of their Lord. Could I say to you this evening that the resistance is always going to be faced, but we must refuse to be on the sidelines. We must get in the work, be engaged in doing the work that God has called us to do. There's a work to do, not building a wall, I've said that already this evening, but in reaching a community. Listen, I believe the hour is late. I really do. The hour is late. There's much to be accomplished. People are dying every day. Many of those people that are dying every day are dying without even knowing the truth of the gospel. I mean they're dying without knowing the truth of the gospel. I'm talking about your neighbors and my neighbors. I'm talking about your coworkers. I'm talking about people that we interact with in our community. There's a work to do. that needs to be done. There will be resistance. But I hope that our response would be that of what we read of these people as they responded to Nehemiah and said, let us rise up. Let us do the work that God has called us to do. God put us in this place for a purpose, for a reason. And that reason, first and foremost, is that he would receive glory. He says in John 15, herein is my Father glorified, that ye bear much fruit. That you bear much fruit. All that God would use us as being laborers together with him, laboring in his vineyard, doing his work, being used to bring honor and glory to the name of the Lord. Let's pray together. Father, we love you. We thank you for loving us. We thank you for the privilege of looking at this Old Testament passage of scripture and seeing what you put in Nehemiah's heart. Lord, the work that you did there, Lord, we rejoice in it. I pray God that you'd put something in our hearts tonight. Give us a burden. Lord, help us to rise up together as being laborers together with you. To accomplish, Lord, what you've called us to accomplish. To reach our Jerusalem with the gospel of the Lord Jesus Christ. I pray God that you'd move in hearts and lives. Lord, help us to be responsive this evening. Help us to be doers of the word and not hearers only. We'll thank you for what you'll do, for it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.240000009536743,
      "text": " this evening, the book of Nehemiah."
    },
    {
      "id": 1,
      "start": 3.240000009536743,
      "end": 6.400000095367432,
      "text": " We'll be looking at Nehemiah chapter number two"
    },
    {
      "id": 2,
      "start": 6.400000095367432,
      "end": 9.880000114440918,
      "text": " and we're gonna reference some things from the first chapter before we get"
    },
    {
      "id": 3,
      "start": 9.880000114440918,
      "end": 11.760000228881836,
      "text": " into the message this evening."
    },
    {
      "id": 4,
      "start": 11.760000228881836,
      "end": 15.800000190734863,
      "text": " Nehemiah chapter two verses eleven through twenty will be the text for the"
    },
    {
      "id": 5,
      "start": 15.800000190734863,
      "end": 17.639999389648438,
      "text": " service this evening."
    },
    {
      "id": 6,
      "start": 17.639999389648438,
      "end": 21.079999923706055,
      "text": " I just want to mention just a few background points with regard to this"
    },
    {
      "id": 7,
      "start": 21.079999923706055,
      "end": 24.479999542236328,
      "text": " book of Nehemiah. Some of you might be familiar with it, but Nehemiah is the"
    },
    {
      "id": 8,
      "start": 24.479999542236328,
      "end": 25.479999542236328,
      "text": " cupbearer"
    },
    {
      "id": 9,
      "start": 25.479999542236328,
      "end": 27.600000381469727,
      "text": " to Artaxerxes. He's living"
    },
    {
      "id": 10,
      "start": 27.600000381469727,
      "end": 31.360000610351562,
      "text": " post-captivity. And so what do we mean by that? Well,"
    },
    {
      "id": 11,
      "start": 31.360000610351562,
      "end": 34.040000915527344,
      "text": " of course you know that the nation of Israel"
    },
    {
      "id": 12,
      "start": 34.040000915527344,
      "end": 38.0,
      "text": " was taken captive by the Assyrians because of their wickedness, their"
    },
    {
      "id": 13,
      "start": 38.0,
      "end": 42.20000076293945,
      "text": " idolatry, their sin, and God's judgment came upon them."
    },
    {
      "id": 14,
      "start": 42.20000076293945,
      "end": 48.2599983215332,
      "text": " And then shortly thereafter we find that Judah was taken captive into Babylon."
    },
    {
      "id": 15,
      "start": 48.2599983215332,
      "end": 53.2400016784668,
      "text": " That Babylonian captivity as prophesied by Jeremiah would last for seventy"
    },
    {
      "id": 16,
      "start": 53.2400016784668,
      "end": 54.36000061035156,
      "text": " years."
    },
    {
      "id": 17,
      "start": 54.36000061035156,
      "end": 58.79999923706055,
      "text": " And of course Daniel as he was reading Jeremiah's prophecies and he understands"
    },
    {
      "id": 18,
      "start": 58.79999923706055,
      "end": 61.20000076293945,
      "text": " the fulfillment of those seventy years and"
    },
    {
      "id": 19,
      "start": 61.20000076293945,
      "end": 65.91999816894531,
      "text": " there's a remnant that was then permitted to return back to Jerusalem."
    },
    {
      "id": 20,
      "start": 65.91999816894531,
      "end": 71.31999969482422,
      "text": " So Nehemiah in Nehemiah chapter number one, he's not in Jerusalem, but he's"
    },
    {
      "id": 21,
      "start": 71.31999969482422,
      "end": 74.95999908447266,
      "text": " inquired with regard to what's taking place"
    },
    {
      "id": 22,
      "start": 74.95999908447266,
      "end": 78.04000091552734,
      "text": " in the city of Jerusalem with the people of God."
    },
    {
      "id": 23,
      "start": 78.04000091552734,
      "end": 83.83999633789062,
      "text": " And he is living there as the cupbearer again for Artaxerxes the king,"
    },
    {
      "id": 24,
      "start": 83.83999633789062,
      "end": 88.12000274658203,
      "text": " but he's living post-captivity. We find that the report is provided, if you"
    },
    {
      "id": 25,
      "start": 88.12000274658203,
      "end": 89.72000122070312,
      "text": " notice in chapter one,"
    },
    {
      "id": 26,
      "start": 89.72000122070312,
      "end": 92.12000274658203,
      "text": " the Bible says in verse number two"
    },
    {
      "id": 27,
      "start": 92.12000274658203,
      "end": 94.80000305175781,
      "text": " that Hanani, one of my brethren, came,"
    },
    {
      "id": 28,
      "start": 94.80000305175781,
      "end": 98.0,
      "text": " he and certain men of Judah, and I asked them"
    },
    {
      "id": 29,
      "start": 98.0,
      "end": 101.55999755859375,
      "text": " concerning the Jews that had escaped, which were left of the captivity, and"
    },
    {
      "id": 30,
      "start": 101.55999755859375,
      "end": 103.87999725341797,
      "text": " concerning Jerusalem. And so you find"
    },
    {
      "id": 31,
      "start": 103.87999725341797,
      "end": 108.63999938964844,
      "text": " that Nehemiah was concerned enough to ask, to inquire, ask to the condition"
    },
    {
      "id": 32,
      "start": 108.63999938964844,
      "end": 112.4800033569336,
      "text": " not only of the people but also of the city. And he was burdened, he was"
    },
    {
      "id": 33,
      "start": 112.4800033569336,
      "end": 114.16000366210938,
      "text": " interested in knowing,"
    },
    {
      "id": 34,
      "start": 114.16000366210938,
      "end": 117.91999816894531,
      "text": " and it says that he asked them, and it says to us in verse number three, and"
    },
    {
      "id": 35,
      "start": 117.91999816894531,
      "end": 119.87999725341797,
      "text": " they said unto me,"
    },
    {
      "id": 36,
      "start": 119.87999725341797,
      "end": 123.76000213623047,
      "text": " and this is where Nehemiah receives the report, he"
    },
    {
      "id": 37,
      "start": 123.76000213623047,
      "end": 128.9199981689453,
      "text": " is given a report and it says this, that the remnant that are left of the"
    },
    {
      "id": 38,
      "start": 128.9199981689453,
      "end": 131.0800018310547,
      "text": " captivity there in the province"
    },
    {
      "id": 39,
      "start": 131.0800018310547,
      "end": 134.83999633789062,
      "text": " notice are in great affliction and reproach."
    },
    {
      "id": 40,
      "start": 134.83999633789062,
      "end": 139.75999450683594,
      "text": " The wall of Jerusalem also is broken down and the gates thereof are burned"
    },
    {
      "id": 41,
      "start": 139.75999450683594,
      "end": 141.52000427246094,
      "text": " with fire."
    },
    {
      "id": 42,
      "start": 141.52000427246094,
      "end": 146.60000610351562,
      "text": " It's no good report that Nehemiah receives and we find that this report"
    },
    {
      "id": 43,
      "start": 146.60000610351562,
      "end": 151.44000244140625,
      "text": " that is provided to Nehemiah has an impact and the impact is serious."
    },
    {
      "id": 44,
      "start": 151.44000244140625,
      "end": 156.47999572753906,
      "text": " We find that Nehemiah is broken over the condition of what he hears and"
    },
    {
      "id": 45,
      "start": 156.47999572753906,
      "end": 161.55999755859375,
      "text": " that brokenness, however, leads him to a closer walk with the Lord."
    },
    {
      "id": 46,
      "start": 161.55999755859375,
      "end": 166.39999389648438,
      "text": " There's a message all in of itself of that particular truth because we find"
    },
    {
      "id": 47,
      "start": 166.39999389648438,
      "end": 170.44000244140625,
      "text": " that his response to hearing this awful report"
    },
    {
      "id": 48,
      "start": 170.44000244140625,
      "end": 173.47999572753906,
      "text": " was that it says this in verse number four,"
    },
    {
      "id": 49,
      "start": 173.47999572753906,
      "end": 176.36000061035156,
      "text": " and it came to pass when I heard these words"
    },
    {
      "id": 50,
      "start": 176.36000061035156,
      "end": 180.8800048828125,
      "text": " that I sat down, notice, and wept and mourned certain days,"
    },
    {
      "id": 51,
      "start": 180.8800048828125,
      "end": 185.44000244140625,
      "text": " but then he says this, and fasted and prayed before the God"
    },
    {
      "id": 52,
      "start": 185.44000244140625,
      "end": 186.55999755859375,
      "text": " of heaven."
    },
    {
      "id": 53,
      "start": 186.55999755859375,
      "end": 189.16000366210938,
      "text": " He was broken over what he had heard of the"
    },
    {
      "id": 54,
      "start": 189.16000366210938,
      "end": 193.67999267578125,
      "text": " report that was received, but that brokenness led him to a closer walk with"
    },
    {
      "id": 55,
      "start": 193.67999267578125,
      "end": 194.67999267578125,
      "text": " the Lord."
    },
    {
      "id": 56,
      "start": 194.67999267578125,
      "end": 197.75999450683594,
      "text": " There's no doubt in my life, again it's not really the message this evening,"
    },
    {
      "id": 57,
      "start": 197.75999450683594,
      "end": 199.83999633789062,
      "text": " there's no doubt in my mind, however,"
    },
    {
      "id": 58,
      "start": 199.83999633789062,
      "end": 204.16000366210938,
      "text": " that there are times in which we will face circumstances and situations in"
    },
    {
      "id": 59,
      "start": 204.16000366210938,
      "end": 205.27999877929688,
      "text": " our lives"
    },
    {
      "id": 60,
      "start": 205.27999877929688,
      "end": 209.63999938964844,
      "text": " that may lead us to a place of brokenness, but that brokenness must lead"
    },
    {
      "id": 61,
      "start": 209.63999938964844,
      "end": 210.39999389648438,
      "text": " us"
    },
    {
      "id": 62,
      "start": 210.39999389648438,
      "end": 212.9600067138672,
      "text": " to a closer walk with the Lord."
    },
    {
      "id": 63,
      "start": 212.9600067138672,
      "end": 218.47999572753906,
      "text": " It must not allow, we must not allow for some circumstances to cause there to be"
    },
    {
      "id": 64,
      "start": 218.47999572753906,
      "end": 221.63999938964844,
      "text": " a wedge or divide between me and my Savior,"
    },
    {
      "id": 65,
      "start": 221.63999938964844,
      "end": 225.52000427246094,
      "text": " and that my brokenness causes me to be full of despair and"
    },
    {
      "id": 66,
      "start": 225.52000427246094,
      "end": 230.9199981689453,
      "text": " to lose hope. Know that I draw nigh unto God, that I draw closer"
    },
    {
      "id": 67,
      "start": 230.9199981689453,
      "end": 231.8800048828125,
      "text": " to Him."
    },
    {
      "id": 68,
      "start": 231.8800048828125,
      "end": 236.67999267578125,
      "text": " We find that he prays, and after he prays we find that he, once again, if you"
    },
    {
      "id": 69,
      "start": 236.67999267578125,
      "end": 239.8800048828125,
      "text": " enter into the second chapter, and really we'll be looking at verse number"
    },
    {
      "id": 70,
      "start": 239.8800048828125,
      "end": 242.0399932861328,
      "text": " eleven and going forward from there,"
    },
    {
      "id": 71,
      "start": 242.0399932861328,
      "end": 246.27999877929688,
      "text": " but we find that eventually, after he prays and seeks the Lord,"
    },
    {
      "id": 72,
      "start": 246.27999877929688,
      "end": 250.72000122070312,
      "text": " that he has an interaction with the king, with Artaxerxes, it's recorded for us in"
    },
    {
      "id": 73,
      "start": 250.72000122070312,
      "end": 252.72000122070312,
      "text": " the beginning of chapter number two,"
    },
    {
      "id": 74,
      "start": 252.72000122070312,
      "end": 256.6400146484375,
      "text": " we find that in that interaction the king had not seen"
    },
    {
      "id": 75,
      "start": 256.6400146484375,
      "end": 262.0400085449219,
      "text": " Nehemiah sad at any other time in his presence."
    },
    {
      "id": 76,
      "start": 262.0400085449219,
      "end": 266.4800109863281,
      "text": " And the king, according to verse number two, said this is nothing more than sorrow"
    },
    {
      "id": 77,
      "start": 266.4800109863281,
      "end": 268.0,
      "text": " of heart."
    },
    {
      "id": 78,
      "start": 268.0,
      "end": 271.3599853515625,
      "text": " In this situation, the circumstance had been"
    },
    {
      "id": 79,
      "start": 271.3599853515625,
      "end": 275.8399963378906,
      "text": " laying heavy on the heart of Nehemiah, and we find that Nehemiah,"
    },
    {
      "id": 80,
      "start": 275.8399963378906,
      "end": 280.1199951171875,
      "text": " he makes this request in verse number four, the Bible says, the king said unto me,"
    },
    {
      "id": 81,
      "start": 280.1199951171875,
      "end": 282.44000244140625,
      "text": " For what dost thou make request?"
    },
    {
      "id": 82,
      "start": 282.44000244140625,
      "end": 286.67999267578125,
      "text": " Notice the Bible says, So I prayed to the God of heaven, and I said unto the king,"
    },
    {
      "id": 83,
      "start": 286.67999267578125,
      "end": 290.79998779296875,
      "text": " If it please the king, and if thy servant have found favor in thy sight,"
    },
    {
      "id": 84,
      "start": 290.79998779296875,
      "end": 295.67999267578125,
      "text": " that thou wouldst send me unto Judah, unto the city of my father's sepulchres,"
    },
    {
      "id": 85,
      "start": 295.67999267578125,
      "end": 298.6400146484375,
      "text": " that I may build it."
    },
    {
      "id": 86,
      "start": 298.6400146484375,
      "end": 302.239990234375,
      "text": " We find that that's the request that Nehemiah has, and as we"
    },
    {
      "id": 87,
      "start": 302.239990234375,
      "end": 306.5199890136719,
      "text": " come to our text this evening, picking it up in verse number eleven,"
    },
    {
      "id": 88,
      "start": 306.5199890136719,
      "end": 310.67999267578125,
      "text": " we find that our text is going to pick up the account"
    },
    {
      "id": 89,
      "start": 310.67999267578125,
      "end": 314.8399963378906,
      "text": " at the time in which he's arrived in the city, and the Bible tells us that he was"
    },
    {
      "id": 90,
      "start": 314.8399963378906,
      "end": 316.3999938964844,
      "text": " there for three days."
    },
    {
      "id": 91,
      "start": 316.3999938964844,
      "end": 319.760009765625,
      "text": " Notice in verse eleven, the Bible says, So I came to Jerusalem,"
    },
    {
      "id": 92,
      "start": 319.760009765625,
      "end": 324.0400085449219,
      "text": " and was there three days, and I rose in the night."
    },
    {
      "id": 93,
      "start": 324.0799865722656,
      "end": 328.79998779296875,
      "text": " I and some few men with me, neither told I any man what my God"
    },
    {
      "id": 94,
      "start": 328.79998779296875,
      "end": 332.5199890136719,
      "text": " had put in my heart to do at Jerusalem."
    },
    {
      "id": 95,
      "start": 332.5199890136719,
      "end": 336.0400085449219,
      "text": " Neither was there any beast with me, save the beast that I rode upon,"
    },
    {
      "id": 96,
      "start": 336.0400085449219,
      "end": 340.7200012207031,
      "text": " and I went out by night by the gate of the valley, even before the dragon well,"
    },
    {
      "id": 97,
      "start": 340.7200012207031,
      "end": 344.239990234375,
      "text": " and to the dung port, and viewed the walls of Jerusalem,"
    },
    {
      "id": 98,
      "start": 344.239990234375,
      "end": 349.44000244140625,
      "text": " which were broken down, and the gates thereof were consumed with fire."
    },
    {
      "id": 99,
      "start": 349.44000244140625,
      "end": 353.4800109863281,
      "text": " Then I went on to the gate of the fountain, to the king's pool,"
    },
    {
      "id": 100,
      "start": 353.4800109863281,
      "end": 357.1199951171875,
      "text": " but there was no place for the beast that was under me to pass."
    },
    {
      "id": 101,
      "start": 357.1199951171875,
      "end": 361.67999267578125,
      "text": " Then went I up in the night by the brook, and viewed the wall, and turned back,"
    },
    {
      "id": 102,
      "start": 361.67999267578125,
      "end": 366.760009765625,
      "text": " and entered by the gate of the valley, and so returned."
    },
    {
      "id": 103,
      "start": 366.760009765625,
      "end": 369.4800109863281,
      "text": " We'll continue reading through verse number 20 as we get through the message"
    },
    {
      "id": 104,
      "start": 369.4800109863281,
      "end": 372.55999755859375,
      "text": " this evening, but I want you to notice a phrase in verse number 12,"
    },
    {
      "id": 105,
      "start": 372.55999755859375,
      "end": 375.760009765625,
      "text": " and I've used this phrase really for the sermon this evening."
    },
    {
      "id": 106,
      "start": 375.760009765625,
      "end": 378.67999267578125,
      "text": " Notice the Bible says, and I arose in the night, in verse number 12,"
    },
    {
      "id": 107,
      "start": 378.67999267578125,
      "end": 381.4800109863281,
      "text": " I and some few men with me, and then it says this,"
    },
    {
      "id": 108,
      "start": 381.4800109863281,
      "end": 389.4800109863281,
      "text": " neither told I any man what my God had put in my heart to do at Jerusalem."
    },
    {
      "id": 109,
      "start": 389.4800109863281,
      "end": 392.32000732421875,
      "text": " For the next few moments, I want to preach a message that I've simply entitled,"
    },
    {
      "id": 110,
      "start": 392.32000732421875,
      "end": 396.2200012207031,
      "text": " When God Puts Something in Your Heart."
    },
    {
      "id": 111,
      "start": 396.2200012207031,
      "end": 399.760009765625,
      "text": " We find that it's revealed in verse number five of the text of scripture,"
    },
    {
      "id": 112,
      "start": 399.760009765625,
      "end": 403.7200012207031,
      "text": " as he's speaking to Artaxerxes, that he had this desire,"
    },
    {
      "id": 113,
      "start": 403.7200012207031,
      "end": 409.1600036621094,
      "text": " that he would receive permission to leave his place of responsibility,"
    },
    {
      "id": 114,
      "start": 409.1600036621094,
      "end": 414.6400146484375,
      "text": " to go to Judah, to go to Jerusalem specifically, that he might build it."
    },
    {
      "id": 115,
      "start": 414.6400146484375,
      "end": 418.3599853515625,
      "text": " And we find that he is granted permission, he arrives in Jerusalem,"
    },
    {
      "id": 116,
      "start": 418.3599853515625,
      "end": 421.44000244140625,
      "text": " according to verse number 11, and he's there for three days."
    },
    {
      "id": 117,
      "start": 421.44000244140625,
      "end": 425.79998779296875,
      "text": " The Bible goes on to give us an account that I think is so powerful,"
    },
    {
      "id": 118,
      "start": 425.79998779296875,
      "end": 430.239990234375,
      "text": " and so applicable for us this evening, when we consider the work of God"
    },
    {
      "id": 119,
      "start": 430.239990234375,
      "end": 431.9200134277344,
      "text": " that must be accomplished."
    },
    {
      "id": 120,
      "start": 431.9200134277344,
      "end": 435.760009765625,
      "text": " I'm so thankful to be part of the greatest work in all the world."
    },
    {
      "id": 121,
      "start": 435.760009765625,
      "end": 438.44000244140625,
      "text": " I preached a message earlier in the month of December,"
    },
    {
      "id": 122,
      "start": 438.44000244140625,
      "end": 443.3999938964844,
      "text": " with regard to really that thought of being involved in the work of the ministry."
    },
    {
      "id": 123,
      "start": 443.3999938964844,
      "end": 446.79998779296875,
      "text": " The message was from the end of 2 Timothy chapter number four,"
    },
    {
      "id": 124,
      "start": 446.79998779296875,
      "end": 448.79998779296875,
      "text": " when the Bible says about Mark,"
    },
    {
      "id": 125,
      "start": 448.79998779296875,
      "end": 450.1199951171875,
      "text": " bring him, why?"
    },
    {
      "id": 126,
      "start": 450.1199951171875,
      "end": 452.9200134277344,
      "text": " For he is profitable to me for the ministry."
    },
    {
      "id": 127,
      "start": 452.9200134277344,
      "end": 456.44000244140625,
      "text": " And I mentioned about being profitable for the ministry,"
    },
    {
      "id": 128,
      "start": 456.44000244140625,
      "end": 460.32000732421875,
      "text": " and what a blessing it is to be involved in the ministry and the work of God."
    },
    {
      "id": 129,
      "start": 460.32000732421875,
      "end": 466.20001220703125,
      "text": " And we find here in Nehemiah chapter two, that God put something in Nehemiah's heart."
    },
    {
      "id": 130,
      "start": 466.20001220703125,
      "end": 468.760009765625,
      "text": " As we look at the text of scripture, I want you to consider with me,"
    },
    {
      "id": 131,
      "start": 468.760009765625,
      "end": 471.3599853515625,
      "text": " number one, the reconnaissance of Nehemiah."
    },
    {
      "id": 132,
      "start": 471.3599853515625,
      "end": 474.67999267578125,
      "text": " In verses 11 through 15, we find that Nehemiah,"
    },
    {
      "id": 133,
      "start": 474.67999267578125,
      "end": 478.20001220703125,
      "text": " there's really a reconnaissance type mission that takes place, if you will."
    },
    {
      "id": 134,
      "start": 478.20001220703125,
      "end": 480.239990234375,
      "text": " I've read the verses of scripture."
    },
    {
      "id": 135,
      "start": 480.239990234375,
      "end": 485.55999755859375,
      "text": " But we find that as we look at verses 12 through 15, as Nehemiah goes out,"
    },
    {
      "id": 136,
      "start": 485.55999755859375,
      "end": 488.8399963378906,
      "text": " the Bible says, I arose in the night in verse number 12."
    },
    {
      "id": 137,
      "start": 488.8399963378906,
      "end": 490.6400146484375,
      "text": " He says he took a few men with him."
    },
    {
      "id": 138,
      "start": 490.6400146484375,
      "end": 493.6400146484375,
      "text": " There was no beast, according to the end of the verse with me,"
    },
    {
      "id": 139,
      "start": 493.6400146484375,
      "end": 496.0400085449219,
      "text": " save the beast that I wrote upon."
    },
    {
      "id": 140,
      "start": 496.0400085449219,
      "end": 497.67999267578125,
      "text": " And notice in verse number 13, it says,"
    },
    {
      "id": 141,
      "start": 497.67999267578125,
      "end": 500.32000732421875,
      "text": " and I went out by night by the gate of the valley,"
    },
    {
      "id": 142,
      "start": 501.32000732421875,
      "end": 506.32000732421875,
      "text": " even before the dragon well into the dung port and viewed the walls of Jerusalem,"
    },
    {
      "id": 143,
      "start": 506.9599914550781,
      "end": 511.7200012207031,
      "text": " which were broken down and the gates thereof were consumed with fire."
    },
    {
      "id": 144,
      "start": 511.7200012207031,
      "end": 516.719970703125,
      "text": " He left from that place and he went onto the gate of the fountain and the king's pool."
    },
    {
      "id": 145,
      "start": 517.5999755859375,
      "end": 520.6400146484375,
      "text": " But there was no place for the beast that was under me to pass."
    },
    {
      "id": 146,
      "start": 520.6400146484375,
      "end": 524.3200073242188,
      "text": " And then in verse 15, he went up in the night by the brook"
    },
    {
      "id": 147,
      "start": 524.3200073242188,
      "end": 530.0,
      "text": " and viewed the wall and turned back and entered by the gate of the valley and so returned."
    },
    {
      "id": 148,
      "start": 530.0,
      "end": 533.239990234375,
      "text": " And as Nehemiah goes out on this particular mission,"
    },
    {
      "id": 149,
      "start": 533.239990234375,
      "end": 535.6799926757812,
      "text": " on this reconnaissance mission, if you will,"
    },
    {
      "id": 150,
      "start": 535.6799926757812,
      "end": 540.4400024414062,
      "text": " I believe that Nehemiah is now seeing with his own eyes"
    },
    {
      "id": 151,
      "start": 540.4400024414062,
      "end": 544.8400268554688,
      "text": " what he had previously only been told about."
    },
    {
      "id": 152,
      "start": 545.0800170898438,
      "end": 547.6400146484375,
      "text": " He had received a report according to chapter number one."
    },
    {
      "id": 153,
      "start": 547.6400146484375,
      "end": 549.9600219726562,
      "text": " And the report, as I read a moment ago,"
    },
    {
      "id": 154,
      "start": 549.9600219726562,
      "end": 552.8400268554688,
      "text": " was that the people were in great affliction and reproach"
    },
    {
      "id": 155,
      "start": 552.8400268554688,
      "end": 555.5599975585938,
      "text": " and that the wall of Jerusalem was broken down"
    },
    {
      "id": 156,
      "start": 555.5599975585938,
      "end": 557.9199829101562,
      "text": " and the gates thereof are burned with fire."
    },
    {
      "id": 157,
      "start": 557.9199829101562,
      "end": 562.0,
      "text": " But now on this night, after the three days of being in Jerusalem,"
    },
    {
      "id": 158,
      "start": 562.0,
      "end": 564.4400024414062,
      "text": " as Nehemiah and a few men go out,"
    },
    {
      "id": 159,
      "start": 564.4400024414062,
      "end": 570.2000122070312,
      "text": " we find that he now is seeing with his own eyes the condition."
    },
    {
      "id": 160,
      "start": 571.0800170898438,
      "end": 574.280029296875,
      "text": " I'm beginning to think about the truth of Lamentations 3."
    },
    {
      "id": 161,
      "start": 574.280029296875,
      "end": 575.9600219726562,
      "text": " And perhaps if you have your Bibles,"
    },
    {
      "id": 162,
      "start": 575.9600219726562,
      "end": 579.3200073242188,
      "text": " turn over there to Lamentations chapter 3 very quickly."
    },
    {
      "id": 163,
      "start": 579.3200073242188,
      "end": 583.3200073242188,
      "text": " And I want to remind you of a verse of Scripture in Lamentations,"
    },
    {
      "id": 164,
      "start": 583.3200073242188,
      "end": 588.0399780273438,
      "text": " Jeremiah Lamentations, and look at Lamentations chapter 3."
    },
    {
      "id": 165,
      "start": 588.0399780273438,
      "end": 592.0399780273438,
      "text": " And I want you to notice what the Bible says in verse number 51."
    },
    {
      "id": 166,
      "start": 592.0399780273438,
      "end": 596.9199829101562,
      "text": " Lamentations 3 in verse number 51, the Bible says this,"
    },
    {
      "id": 167,
      "start": 596.9199829101562,
      "end": 599.8800048828125,
      "text": " Mine eye affecteth..."
    },
    {
      "id": 0,
      "start": 599.8800048828125,
      "end": 607.0800046920776,
      "text": " my heart, because of all the daughters of my city.\" You know there's something about"
    },
    {
      "id": 1,
      "start": 607.0800046920776,
      "end": 613.7600049972534,
      "text": " seeing for yourself. There's something about what passes through your eye gate"
    },
    {
      "id": 2,
      "start": 613.7600049972534,
      "end": 617.680004119873,
      "text": " when you see that. It's one thing to read a report from a missionary, it's one"
    },
    {
      "id": 3,
      "start": 617.680004119873,
      "end": 621.9600048065186,
      "text": " thing to to hear on a Wednesday evening an update from a missionary, it's one"
    },
    {
      "id": 4,
      "start": 621.9600048065186,
      "end": 626.0400047302246,
      "text": " thing to hear the pastor stand in the pulpit week after week and talk about a"
    },
    {
      "id": 5,
      "start": 626.0400047302246,
      "end": 631.3200054168701,
      "text": " need in our region to reach our region with the gospel and then to go from here"
    },
    {
      "id": 6,
      "start": 631.3200054168701,
      "end": 635.7200050354004,
      "text": " out to the world to reach the world with the gospel. It's one thing to hear"
    },
    {
      "id": 7,
      "start": 635.7200050354004,
      "end": 640.0000038146973,
      "text": " someone give a testimony of, I was out talking to people and sharing the"
    },
    {
      "id": 8,
      "start": 640.0000038146973,
      "end": 644.0000038146973,
      "text": " gospel with people and I was knocking on doors and here's, it's a whole nother"
    },
    {
      "id": 9,
      "start": 644.0000038146973,
      "end": 650.4800033569336,
      "text": " thing to go out and experience it yourself. And to truly see the need, to"
    },
    {
      "id": 10,
      "start": 650.4800033569336,
      "end": 656.5600051879883,
      "text": " see it with your own eyes, to see the condition of the of the world, to see"
    },
    {
      "id": 11,
      "start": 656.5600051879883,
      "end": 661.5600051879883,
      "text": " the need of those around us. We understand that their greatest need is"
    },
    {
      "id": 12,
      "start": 661.5600051879883,
      "end": 667.6800079345703,
      "text": " the need of salvation and we understand that we have the answer. In fact this"
    },
    {
      "id": 13,
      "start": 667.6800079345703,
      "end": 672.0400085449219,
      "text": " afternoon I was in the office for just a short period of time this afternoon"
    },
    {
      "id": 14,
      "start": 672.0400085449219,
      "end": 675.3200073242188,
      "text": " before the service and I was reading some things and one of the things that I"
    },
    {
      "id": 15,
      "start": 675.3200073242188,
      "end": 680.7600021362305,
      "text": " read said this, it said that God's plan to reach this generation with the"
    },
    {
      "id": 16,
      "start": 680.7600021362305,
      "end": 689.1600036621094,
      "text": " gospel is us. Absolutely. There are no more Spurgeons, there are no more Moody's. We"
    },
    {
      "id": 17,
      "start": 689.1600036621094,
      "end": 695.8000030517578,
      "text": " can talk about them. Paul is with the Lord and has been for centuries. Amen. But"
    },
    {
      "id": 18,
      "start": 695.8000030517578,
      "end": 702.5600051879883,
      "text": " we find that Nehemiah, he cared enough to ask but then God put something in his"
    },
    {
      "id": 19,
      "start": 702.6000061035156,
      "end": 708.8000030517578,
      "text": " heart. And as God put something in his heart we find that Nehemiah goes to"
    },
    {
      "id": 20,
      "start": 708.8000030517578,
      "end": 714.7600021362305,
      "text": " Jerusalem and after having the permission to leave from his place of"
    },
    {
      "id": 21,
      "start": 714.7600021362305,
      "end": 719.2400054931641,
      "text": " responsibility in the palace as the cupbearer to Artaxerxes, we find that he"
    },
    {
      "id": 22,
      "start": 719.2400054931641,
      "end": 723.8800048828125,
      "text": " arrives there in Jerusalem and what does he do before he tells anybody what God"
    },
    {
      "id": 23,
      "start": 723.8800048828125,
      "end": 728.2000122070312,
      "text": " has put in his heart? He goes out and he sees it with his own eyes. You know why I"
    },
    {
      "id": 24,
      "start": 728.2000122070312,
      "end": 733.4400024414062,
      "text": " think that is? Because he would then have the ability to communicate much"
    },
    {
      "id": 25,
      "start": 733.4400024414062,
      "end": 740.2000122070312,
      "text": " more effectively after seeing it with his own eyes. He would have more of a"
    },
    {
      "id": 26,
      "start": 740.2000122070312,
      "end": 746.8800048828125,
      "text": " fire burning in his soul after seeing it with his own eyes. You don't believe me?"
    },
    {
      "id": 27,
      "start": 746.8800048828125,
      "end": 751.2400054931641,
      "text": " Think about the the report that we received at the end of the month of"
    },
    {
      "id": 28,
      "start": 751.2400054931641,
      "end": 755.8400115966797,
      "text": " September after we returned from the missions trip to Panama. Those eleven"
    },
    {
      "id": 29,
      "start": 755.8400115966797,
      "end": 758.7200012207031,
      "text": " people that came back, we had the privilege of being there and we came"
    },
    {
      "id": 30,
      "start": 758.7200012207031,
      "end": 762.8800048828125,
      "text": " back and we gave testimonies that evening and you know it was interesting"
    },
    {
      "id": 31,
      "start": 762.8800048828125,
      "end": 768.5599975585938,
      "text": " to hear the individual stand and give testimonies about what they saw, what"
    },
    {
      "id": 32,
      "start": 768.5599975585938,
      "end": 773.9199981689453,
      "text": " they experienced personally as they were there in Panama. There's something about"
    },
    {
      "id": 33,
      "start": 773.9199981689453,
      "end": 778.8000030517578,
      "text": " seeing it that does something in your heart, does something in your soul."
    },
    {
      "id": 34,
      "start": 778.8000030517578,
      "end": 785.3200073242188,
      "text": " Nehemiah had heard but now he sees. We see the reconnaissance of Nehemiah. I want"
    },
    {
      "id": 35,
      "start": 785.3200073242188,
      "end": 790.5200042724609,
      "text": " you to notice in verses 16 and 17, number two, the request of Nehemiah. We find"
    },
    {
      "id": 36,
      "start": 790.5200042724609,
      "end": 795.4400024414062,
      "text": " that the Bible says in verse 16, and the rulers knew not whither I went or what I"
    },
    {
      "id": 37,
      "start": 795.4400024414062,
      "end": 801.1200103759766,
      "text": " did, neither had I as yet told it to the Jews, nor to the priests, nor to the"
    },
    {
      "id": 38,
      "start": 801.1200103759766,
      "end": 807.4400024414062,
      "text": " nobles, nor to the rulers, nor to the rest that did the work. Then said I unto"
    },
    {
      "id": 39,
      "start": 807.6000061035156,
      "end": 815.6000061035156,
      "text": " them, notice what he says, ye see the distress that we are in, how Jerusalem"
    },
    {
      "id": 40,
      "start": 815.6000061035156,
      "end": 822.6000061035156,
      "text": " lieth waste and the gates thereof are burned with fire. Come and let us build"
    },
    {
      "id": 41,
      "start": 822.6000061035156,
      "end": 829.8400115966797,
      "text": " up the wall of Jerusalem that we be no more a reproach. The reality is that the"
    },
    {
      "id": 42,
      "start": 829.8400115966797,
      "end": 834.2000122070312,
      "text": " individuals that Nehemiah is speaking to in verses 16 and 17, they were the ones"
    },
    {
      "id": 43,
      "start": 834.2000122070312,
      "end": 838.6399993896484,
      "text": " that lived there, they were the ones that had gotten used to the condition of"
    },
    {
      "id": 44,
      "start": 838.6399993896484,
      "end": 843.3600006103516,
      "text": " the city, they were the ones that had week after week and had gone through and"
    },
    {
      "id": 45,
      "start": 843.3600006103516,
      "end": 847.0800018310547,
      "text": " they'd seen that the walls were broken down, they'd seen that the the gates"
    },
    {
      "id": 46,
      "start": 847.0800018310547,
      "end": 850.8000030517578,
      "text": " were burned with fire, they knew that they were reproach and they they just"
    },
    {
      "id": 47,
      "start": 850.8000030517578,
      "end": 856.1199951171875,
      "text": " kind of got used to it. You ever think about that? Just kind of getting used to it."
    },
    {
      "id": 48,
      "start": 856.1199951171875,
      "end": 863.4400024414062,
      "text": " We get to the place where we're just almost not affected anymore. But he says"
    },
    {
      "id": 49,
      "start": 863.4800109863281,
      "end": 867.3200073242188,
      "text": " to these individuals that had been living there, these individuals that"
    },
    {
      "id": 50,
      "start": 867.3200073242188,
      "end": 873.2799987792969,
      "text": " knew it, he says to them, ye see the distress that we are in. This was"
    },
    {
      "id": 51,
      "start": 873.2799987792969,
      "end": 878.5599975585938,
      "text": " nothing new for them, this was not their first pass. It was Nehemiah's first time"
    },
    {
      "id": 52,
      "start": 878.5599975585938,
      "end": 883.3999938964844,
      "text": " that his eyes are beholding the condition of the city, but it is not the"
    },
    {
      "id": 53,
      "start": 883.3999938964844,
      "end": 887.0400085449219,
      "text": " first time for these individuals. They had been there, they had lived it, and"
    },
    {
      "id": 54,
      "start": 887.3600158691406,
      "end": 893.9200134277344,
      "text": " they had grown, I believe, calloused to the situation. And the Bible says"
    },
    {
      "id": 55,
      "start": 893.9200134277344,
      "end": 897.4400024414062,
      "text": " something very interesting at the end of verse number 17. Notice what he says,"
    },
    {
      "id": 56,
      "start": 897.4400024414062,
      "end": 909.8399963378906,
      "text": " come and let, what does it say? Us. Come and let us build up the wall of"
    },
    {
      "id": 57,
      "start": 909.8800048828125,
      "end": 918.9200134277344,
      "text": " Jerusalem that we be no more a reproach. I begin to think about this request of"
    },
    {
      "id": 58,
      "start": 918.9200134277344,
      "end": 924.3600158691406,
      "text": " Nehemiah, and he says us, and he says we, and this is speaking in the plural and"
    },
    {
      "id": 59,
      "start": 924.3600158691406,
      "end": 929.5599975585938,
      "text": " understanding that this is a work, listen, this work was too big for Nehemiah. He"
    },
    {
      "id": 60,
      "start": 929.5599975585938,
      "end": 935.0,
      "text": " could not on his own, with his own resources and his own strength, he could"
    },
    {
      "id": 61,
      "start": 935.0,
      "end": 942.2799987792969,
      "text": " not accomplish what they together could accomplish. And therefore he says, come"
    },
    {
      "id": 62,
      "start": 942.2799987792969,
      "end": 949.4800109863281,
      "text": " and let us build up the wall of Jerusalem that we be no more a reproach."
    },
    {
      "id": 63,
      "start": 949.4800109863281,
      "end": 953.3999938964844,
      "text": " God put something in the heart of Nehemiah, but he was gonna need the help"
    },
    {
      "id": 64,
      "start": 953.3999938964844,
      "end": 958.760009765625,
      "text": " of others. This was some great task, and he mentions in other portions of this"
    },
    {
      "id": 65,
      "start": 958.760009765625,
      "end": 962.9599914550781,
      "text": " book of Nehemiah, in fact in chapter 6, hold your place there in chapter 2, but"
    },
    {
      "id": 66,
      "start": 962.9599914550781,
      "end": 967.3999938964844,
      "text": " go over to chapter 6 and look at verse 3, and notice as these messengers came"
    },
    {
      "id": 67,
      "start": 967.3999938964844,
      "end": 972.2799987792969,
      "text": " to him and besought him to go and have this meeting in one of the villages in"
    },
    {
      "id": 68,
      "start": 972.2799987792969,
      "end": 977.3200073242188,
      "text": " the plain of Ono. In verse number 3 we find that he, Nehemiah, sent messengers"
    },
    {
      "id": 69,
      "start": 977.3200073242188,
      "end": 984.7200012207031,
      "text": " unto them, and notice what he says, I am doing a great work so that I cannot come"
    },
    {
      "id": 70,
      "start": 984.7200012207031,
      "end": 991.0800170898438,
      "text": " down. Why should the work cease whilst I leave it and come down to you? Listen, he"
    },
    {
      "id": 71,
      "start": 991.1199951171875,
      "end": 995.5599975585938,
      "text": " understood that it was a great work, he understood that this task, the work, the"
    },
    {
      "id": 72,
      "start": 995.5599975585938,
      "end": 1000.9200134277344,
      "text": " burden that God had placed in his heart was beyond his ability to accomplish in"
    },
    {
      "id": 73,
      "start": 1000.9200134277344,
      "end": 1007.8800048828125,
      "text": " and of himself, but he says, let us, that we be no more a reproach. And Nehemiah is"
    },
    {
      "id": 74,
      "start": 1007.8800048828125,
      "end": 1012.4800109863281,
      "text": " making this request, I want you to consider the truth of being co-laborers"
    },
    {
      "id": 75,
      "start": 1012.4800109863281,
      "end": 1015.7200012207031,
      "text": " with the Lord. Notice over in the book of 1 Corinthians, if you will, look at some"
    },
    {
      "id": 76,
      "start": 1015.7200012207031,
      "end": 1019.4800109863281,
      "text": " New Testament principles, and look in the book of 1 Corinthians, and we'll look at"
    },
    {
      "id": 77,
      "start": 1019.4800109863281,
      "end": 1024.5599975585938,
      "text": " 2 Corinthians as well, and as you're turning there, I just want to remind you"
    },
    {
      "id": 78,
      "start": 1024.5599975585938,
      "end": 1029.3999938964844,
      "text": " in there, in Luke chapter number 5, I don't need you to turn there, but when"
    },
    {
      "id": 79,
      "start": 1029.3999938964844,
      "end": 1034.239990234375,
      "text": " God told them to, told Peter to cast out into the deep, launch out into the deep,"
    },
    {
      "id": 80,
      "start": 1034.239990234375,
      "end": 1038.3200073242188,
      "text": " let down your nets for a draft of fishes, we find that it's interesting, you know"
    },
    {
      "id": 81,
      "start": 1038.3200073242188,
      "end": 1042.8800048828125,
      "text": " what he did? He called, he beckoned to his partners. You know what he said? Come and"
    },
    {
      "id": 82,
      "start": 1042.8800048828125,
      "end": 1047.760009765625,
      "text": " help us. And we come here to the book of 1 Corinthians in chapter number 3,"
    },
    {
      "id": 83,
      "start": 1047.760009765625,
      "end": 1052.6400146484375,
      "text": " and I want you to notice, as Paul is writing to these believers in Corinth,"
    },
    {
      "id": 84,
      "start": 1052.6400146484375,
      "end": 1056.0800170898438,
      "text": " these individuals that he mentions that they're carnal, because they're saying,"
    },
    {
      "id": 85,
      "start": 1056.0800170898438,
      "end": 1060.6799926757812,
      "text": " I'm of Paul, I'm of Apollos, and so on and so forth, but notice what he says in"
    },
    {
      "id": 86,
      "start": 1060.6799926757812,
      "end": 1066.760009765625,
      "text": " verse number 5 of 1 Corinthians 3, who then is Paul and who is Apollos? But"
    },
    {
      "id": 87,
      "start": 1066.760009765625,
      "end": 1072.9200134277344,
      "text": " ministers, by whom you believed, even as the Lord gave to every man, I have"
    },
    {
      "id": 88,
      "start": 1072.9200134277344,
      "end": 1078.239990234375,
      "text": " planted, Apollos watered, but God gave the increase. Continue reading and look"
    },
    {
      "id": 89,
      "start": 1078.239990234375,
      "end": 1081.4800109863281,
      "text": " in verse 7, the Bible says, so then neither is he that planteth anything,"
    },
    {
      "id": 90,
      "start": 1081.4800109863281,
      "end": 1086.6799926757812,
      "text": " neither he that watereth, but God that giveth the increase. Now he that planteth"
    },
    {
      "id": 91,
      "start": 1086.6799926757812,
      "end": 1093.6799926757812,
      "text": " and he that watereth, what does it say? Are one. They're one. And every man shall"
    },
    {
      "id": 92,
      "start": 1093.6799926757812,
      "end": 1098.239990234375,
      "text": " receive in his own reward according to his own labor, and then notice this in"
    },
    {
      "id": 93,
      "start": 1098.239990234375,
      "end": 1106.3600158691406,
      "text": " verse number 9, for we are laborers together with God. Ye are God's husbandry,"
    },
    {
      "id": 94,
      "start": 1106.3600158691406,
      "end": 1111.1199951171875,
      "text": " ye are God's building, and notice as he says in verse number 9, we are laborers"
    },
    {
      "id": 95,
      "start": 1111.1199951171875,
      "end": 1117.4000244140625,
      "text": " together with God. Every word is specifically chosen. I'm thankful that"
    },
    {
      "id": 96,
      "start": 1117.4000244140625,
      "end": 1120.760009765625,
      "text": " all Scripture is given by inspiration of God, and we believe in the verbal"
    },
    {
      "id": 97,
      "start": 1120.760009765625,
      "end": 1126.47998046875,
      "text": " plenary inspiration that every word of God is pure. And here's what God"
    },
    {
      "id": 98,
      "start": 1126.47998046875,
      "end": 1132.6400146484375,
      "text": " says. He says, we are, that's the believers, the Christians, we are laborers"
    },
    {
      "id": 99,
      "start": 1132.6400146484375,
      "end": 1142.7200317382812,
      "text": " together, not for God, but with God. We are laborers together with God. And we"
    },
    {
      "id": 100,
      "start": 1142.7200317382812,
      "end": 1147.8400268554688,
      "text": " find that Nehemiah, as he goes and he sees with his own eyes what he'd only"
    },
    {
      "id": 101,
      "start": 1147.8400268554688,
      "end": 1152.7999877929688,
      "text": " previously heard with his ears, and God had put this thing in his heart, but"
    },
    {
      "id": 102,
      "start": 1152.7999877929688,
      "end": 1157.5999755859375,
      "text": " before he could let any man know what God had put in his heart, he had to go"
    },
    {
      "id": 103,
      "start": 1157.5999755859375,
      "end": 1161.7999877929688,
      "text": " out and see it for himself. And after he sees it, he makes this request, and he"
    },
    {
      "id": 104,
      "start": 1161.7999877929688,
      "end": 1168.52001953125,
      "text": " says, come and let us build up the wall of Jerusalem, that we be no more a"
    },
    {
      "id": 105,
      "start": 1168.52001953125,
      "end": 1173.6799926757812,
      "text": " reproach. And I'm reminded this evening about the importance of being co-laborers,"
    },
    {
      "id": 106,
      "start": 1173.6799926757812,
      "end": 1180.2000122070312,
      "text": " being laborers together with God. And I'm thankful that God would use us, that God"
    },
    {
      "id": 107,
      "start": 1180.239990234375,
      "end": 1185.280029296875,
      "text": " would allow us to serve him, and that God would equip us and strengthen us and"
    },
    {
      "id": 108,
      "start": 1185.280029296875,
      "end": 1190.0399780273438,
      "text": " and use us for his honor and for his glory. But we understand that what we"
    },
    {
      "id": 109,
      "start": 1190.0399780273438,
      "end": 1196.6799926757812,
      "text": " could accomplish as a collective group is so much greater than what any one of"
    },
    {
      "id": 110,
      "start": 1196.6799926757812,
      "end": 1200.6400146484375,
      "text": " us could accomplish in of ourselves."
    },
    {
      "id": 0,
      "start": 1200.6400146484375,
      "end": 1207.540014743805,
      "text": " What we can accomplish as we're laboring together with God far exceeds what we could ever imagine"
    },
    {
      "id": 1,
      "start": 1207.540014743805,
      "end": 1211.2600145339966,
      "text": " being accomplished in of our own strength."
    },
    {
      "id": 2,
      "start": 1211.2600145339966,
      "end": 1216.5200147628784,
      "text": " We find that Paul then says to the believers here in Corinth, look in 2 Corinthians chapter"
    },
    {
      "id": 3,
      "start": 1216.5200147628784,
      "end": 1222.1000137329102,
      "text": " number 6 as he continues to really hammer this thought down with this church in Corinth"
    },
    {
      "id": 4,
      "start": 1222.1000137329102,
      "end": 1228.360013961792,
      "text": " and understanding the position that we have and the great joy that we have in serving"
    },
    {
      "id": 5,
      "start": 1228.360013961792,
      "end": 1230.6000137329102,
      "text": " the Lord."
    },
    {
      "id": 6,
      "start": 1230.6000137329102,
      "end": 1237.440013885498,
      "text": " 2 Corinthians 6 and verse number 1, we then, notice what he says, as workers together with"
    },
    {
      "id": 7,
      "start": 1237.440013885498,
      "end": 1243.8000144958496,
      "text": " him, beseech you also that you receive not the grace of God in vain."
    },
    {
      "id": 8,
      "start": 1243.8000144958496,
      "end": 1248.000015258789,
      "text": " In several months I'll be preaching from this particular text of scripture on Sunday morning"
    },
    {
      "id": 9,
      "start": 1248.000015258789,
      "end": 1253.6000137329102,
      "text": " as we make our way through the book of 2 Corinthians, but understand with me as we look at this"
    },
    {
      "id": 10,
      "start": 1253.6000137329102,
      "end": 1259.0800132751465,
      "text": " tonight as making reference from this passage in the book of Nehemiah that what Paul is"
    },
    {
      "id": 11,
      "start": 1259.0800132751465,
      "end": 1264.7600173950195,
      "text": " again reiterating to the believers in Corinth is that we're workers together with God, but"
    },
    {
      "id": 12,
      "start": 1264.7600173950195,
      "end": 1271.9200134277344,
      "text": " he says this, he says we then as workers together with him, beseech you also, notice that you"
    },
    {
      "id": 13,
      "start": 1271.9200134277344,
      "end": 1276.880012512207,
      "text": " receive not the grace of God, what's he say?"
    },
    {
      "id": 14,
      "start": 1276.880012512207,
      "end": 1280.120018005371,
      "text": " In vain."
    },
    {
      "id": 15,
      "start": 1280.120018005371,
      "end": 1286.9600143432617,
      "text": " God's grace, we talk about God's grace and God's grace is so precious and so important"
    },
    {
      "id": 16,
      "start": 1286.9600143432617,
      "end": 1291.5600128173828,
      "text": " to understand, but when we think of God's grace in this particular context, he's not"
    },
    {
      "id": 17,
      "start": 1291.5600128173828,
      "end": 1297.8000183105469,
      "text": " talking about God's saving grace, he's talking about God's enabling grace, and that we would"
    },
    {
      "id": 18,
      "start": 1297.8000183105469,
      "end": 1301.7600173950195,
      "text": " be good stewards of the manifold grace of God."
    },
    {
      "id": 19,
      "start": 1301.7600173950195,
      "end": 1308.9600143432617,
      "text": " See, God saved us by grace, but then he gives us grace to serve him, he enables us to do"
    },
    {
      "id": 20,
      "start": 1308.9600143432617,
      "end": 1316.400016784668,
      "text": " the work as we are workers together with him, and Paul says that we receive not the grace"
    },
    {
      "id": 21,
      "start": 1316.400016784668,
      "end": 1320.0800170898438,
      "text": " of God in vain."
    },
    {
      "id": 22,
      "start": 1320.0800170898438,
      "end": 1326.9600143432617,
      "text": " That means that some could be guilty of receiving the grace of God, that enabling, in vain."
    },
    {
      "id": 23,
      "start": 1326.9600143432617,
      "end": 1327.9600143432617,
      "text": " How does that work?"
    },
    {
      "id": 24,
      "start": 1327.9600143432617,
      "end": 1331.9600219726562,
      "text": " Well, they're not being good stewards of the manifold grace of God, they're not using the"
    },
    {
      "id": 25,
      "start": 1331.9600219726562,
      "end": 1339.0800170898438,
      "text": " equipping that God has given for the honor and glory of God himself."
    },
    {
      "id": 26,
      "start": 1339.0800170898438,
      "end": 1345.280014038086,
      "text": " And so we find that as this man Nehemiah comes to Jerusalem, can you imagine as these people"
    },
    {
      "id": 27,
      "start": 1345.3200073242188,
      "end": 1349.8400115966797,
      "text": " had been living there, and Nehemiah comes in, and Nehemiah all of a sudden he just goes"
    },
    {
      "id": 28,
      "start": 1349.8400115966797,
      "end": 1354.280014038086,
      "text": " out and he's riding around, he's taking a look at the city, and he gathers these people"
    },
    {
      "id": 29,
      "start": 1354.280014038086,
      "end": 1359.52001953125,
      "text": " together and he says, come, let us build up the wall of Jerusalem."
    },
    {
      "id": 30,
      "start": 1359.52001953125,
      "end": 1363.1200103759766,
      "text": " I'm sure there were some that wondered, what in the world, you're just new here, I mean"
    },
    {
      "id": 31,
      "start": 1363.1200103759766,
      "end": 1365.1200103759766,
      "text": " don't you know what's going on here?"
    },
    {
      "id": 32,
      "start": 1365.1200103759766,
      "end": 1366.9200134277344,
      "text": " Don't you know that it's not possible?"
    },
    {
      "id": 33,
      "start": 1366.9200134277344,
      "end": 1369.000015258789,
      "text": " Don't you know?"
    },
    {
      "id": 34,
      "start": 1369.000015258789,
      "end": 1374.280014038086,
      "text": " There's always some, there's always some."
    },
    {
      "id": 35,
      "start": 1374.280014038086,
      "end": 1381.52001953125,
      "text": " The reality is that Nehemiah had something in his heart that came from God."
    },
    {
      "id": 36,
      "start": 1381.52001953125,
      "end": 1384.6400146484375,
      "text": " God put something in his heart."
    },
    {
      "id": 37,
      "start": 1384.6400146484375,
      "end": 1394.0800170898438,
      "text": " And what God put in his heart was to build up the wall, but he needed the help of others."
    },
    {
      "id": 38,
      "start": 1394.0800170898438,
      "end": 1398.2400207519531,
      "text": " And so he made the request, notice with me the response of the people, number three,"
    },
    {
      "id": 39,
      "start": 1398.2400207519531,
      "end": 1403.280014038086,
      "text": " if you're taking notes tonight, look at the response of the people."
    },
    {
      "id": 40,
      "start": 1403.280014038086,
      "end": 1410.2400207519531,
      "text": " I will say this, I am overjoyed as you read the recorded response that is given to us"
    },
    {
      "id": 41,
      "start": 1410.2400207519531,
      "end": 1415.6000213623047,
      "text": " in verse 18, the Bible says, then I told them of the hand of my God which was good upon"
    },
    {
      "id": 42,
      "start": 1415.6000213623047,
      "end": 1416.6000213623047,
      "text": " me."
    },
    {
      "id": 43,
      "start": 1416.6000213623047,
      "end": 1422.3800201416016,
      "text": " It begins to share with them what God has been doing in his life, and maybe if you go"
    },
    {
      "id": 44,
      "start": 1422.3800201416016,
      "end": 1428.000015258789,
      "text": " back to the chapter two, or earlier in the chapters I mentioned that he makes that request"
    },
    {
      "id": 45,
      "start": 1428.000015258789,
      "end": 1431.760009765625,
      "text": " in verse five to the king Artaxerxes that I may build it, and the king said unto me"
    },
    {
      "id": 46,
      "start": 1431.760009765625,
      "end": 1436.6000213623047,
      "text": " in verse number six, the queen also sitting by him, for how long shall I journey be and"
    },
    {
      "id": 47,
      "start": 1436.6000213623047,
      "end": 1437.8800201416016,
      "text": " when wilt thou return?"
    },
    {
      "id": 48,
      "start": 1437.8800201416016,
      "end": 1442.9600219726562,
      "text": " So it pleased the king to send me, and I said unto him, a time."
    },
    {
      "id": 49,
      "start": 1442.9600219726562,
      "end": 1447.1000213623047,
      "text": " Moreover I said unto the king, if it pleased the king, let letters be given me to the governors"
    },
    {
      "id": 50,
      "start": 1447.1000213623047,
      "end": 1451.4400177001953,
      "text": " beyond the river, that they may convey me over till I come unto Judah, and a letter"
    },
    {
      "id": 51,
      "start": 1451.4400177001953,
      "end": 1455.4400177001953,
      "text": " unto Asaph, the keeper of the king's forest, that he may give me timber to make beams for"
    },
    {
      "id": 52,
      "start": 1455.4400177001953,
      "end": 1460.2400207519531,
      "text": " the gates of the palace, which appertain to the house and for the wall of the city, and"
    },
    {
      "id": 53,
      "start": 1460.2400207519531,
      "end": 1465.3600158691406,
      "text": " for the house that I shall enter into, and the king granted me notice according to the"
    },
    {
      "id": 54,
      "start": 1465.3600158691406,
      "end": 1469.6400146484375,
      "text": " good hand of my God upon me."
    },
    {
      "id": 55,
      "start": 1469.6400146484375,
      "end": 1476.1600036621094,
      "text": " Nehemiah was operating here not with a lack of faith, but following the leadership of"
    },
    {
      "id": 56,
      "start": 1476.1600036621094,
      "end": 1482.0,
      "text": " God in his life, and he made the request to the king for these letters that would help"
    },
    {
      "id": 57,
      "start": 1482.0,
      "end": 1488.4800109863281,
      "text": " him to easily travel from where he was located to Jerusalem, but also recognizing that he"
    },
    {
      "id": 58,
      "start": 1488.4800109863281,
      "end": 1492.6800231933594,
      "text": " would need some supplies and said, can I get a letter to be able to get the supplies"
    },
    {
      "id": 59,
      "start": 1492.6800231933594,
      "end": 1498.0800170898438,
      "text": " as well, and the Bible says that the king granted these letters to him, but notice what"
    },
    {
      "id": 60,
      "start": 1498.0800170898438,
      "end": 1505.4000244140625,
      "text": " Nehemiah acknowledges, according to the good hand of my God upon me."
    },
    {
      "id": 61,
      "start": 1505.4000244140625,
      "end": 1507.4600219726562,
      "text": " God uses people."
    },
    {
      "id": 62,
      "start": 1507.4600219726562,
      "end": 1510.4800109863281,
      "text": " God uses people."
    },
    {
      "id": 63,
      "start": 1510.4800109863281,
      "end": 1515.52001953125,
      "text": " God could do whatever he wants to do on his own."
    },
    {
      "id": 64,
      "start": 1515.52001953125,
      "end": 1517.7000122070312,
      "text": " He's God."
    },
    {
      "id": 65,
      "start": 1517.7000122070312,
      "end": 1523.1400146484375,
      "text": " But God has chosen to use his people."
    },
    {
      "id": 66,
      "start": 1523.1400146484375,
      "end": 1530.1400146484375,
      "text": " And we find that God will put something into the hearts of his people, and God will enable"
    },
    {
      "id": 67,
      "start": 1530.1400146484375,
      "end": 1534.7400207519531,
      "text": " us to do the work that he's called us to do."
    },
    {
      "id": 68,
      "start": 1534.7400207519531,
      "end": 1541.6200256347656,
      "text": " And we find that Nehemiah, as he's received these letters, it says in verse 9, then I"
    },
    {
      "id": 69,
      "start": 1541.6200256347656,
      "end": 1545.1800231933594,
      "text": " came to the governors beyond the river, and what did he do?"
    },
    {
      "id": 70,
      "start": 1545.1800231933594,
      "end": 1546.9400024414062,
      "text": " I gave them the king's letters."
    },
    {
      "id": 71,
      "start": 1546.9400024414062,
      "end": 1550.4600219726562,
      "text": " Now the king had sent captains of the army and horsemen with me."
    },
    {
      "id": 72,
      "start": 1550.4600219726562,
      "end": 1555.3000183105469,
      "text": " When Sanballat, the Hornite, and Tobiah the servant, the Ammonite heard of it, it grieved"
    },
    {
      "id": 73,
      "start": 1555.3000183105469,
      "end": 1559.9000244140625,
      "text": " them exceedingly that there was come a man to seek the welfare of the children of Israel."
    },
    {
      "id": 74,
      "start": 1559.9000244140625,
      "end": 1563.780029296875,
      "text": " But God's hand was good upon Nehemiah."
    },
    {
      "id": 75,
      "start": 1563.780029296875,
      "end": 1570.260009765625,
      "text": " And Nehemiah made this request, and as we read the response in verse 18, we're told"
    },
    {
      "id": 76,
      "start": 1570.260009765625,
      "end": 1576.780029296875,
      "text": " that Nehemiah, even still before they're able to respond, he lets them know of how God was"
    },
    {
      "id": 77,
      "start": 1576.780029296875,
      "end": 1583.02001953125,
      "text": " at work and what God was doing and how God was orchestrating these events and how God"
    },
    {
      "id": 78,
      "start": 1583.02001953125,
      "end": 1585.1800231933594,
      "text": " was showing his hand mighty."
    },
    {
      "id": 79,
      "start": 1585.1800231933594,
      "end": 1589.7000122070312,
      "text": " And the Bible says this, then I told them of the hand of my God which was good upon"
    },
    {
      "id": 80,
      "start": 1589.7000122070312,
      "end": 1593.5400085449219,
      "text": " me, verse 18, as also the king's words that he had spoken unto me."
    },
    {
      "id": 81,
      "start": 1593.5400085449219,
      "end": 1598.8200073242188,
      "text": " And they said, here's the response of the people, hallelujah for this response, let"
    },
    {
      "id": 82,
      "start": 1598.8200073242188,
      "end": 1604.02001953125,
      "text": " us rise up and build."
    },
    {
      "id": 83,
      "start": 1604.02001953125,
      "end": 1606.3400268554688,
      "text": " Let us rise up and build."
    },
    {
      "id": 84,
      "start": 1606.3400268554688,
      "end": 1611.1800231933594,
      "text": " He says, come, let us build up the wall."
    },
    {
      "id": 85,
      "start": 1611.1800231933594,
      "end": 1616.780029296875,
      "text": " And they respond and they say, let us rise up and build."
    },
    {
      "id": 86,
      "start": 1616.780029296875,
      "end": 1620.9000244140625,
      "text": " They needed a man that had vision, they needed a man that had something in his heart that"
    },
    {
      "id": 87,
      "start": 1620.9000244140625,
      "end": 1626.260009765625,
      "text": " God gave him to do to provide leadership and direction and to give them a cause and to"
    },
    {
      "id": 88,
      "start": 1626.260009765625,
      "end": 1632.6600036621094,
      "text": " help them understand that we are working together and we're seeking to accomplish what God has"
    },
    {
      "id": 89,
      "start": 1632.6600036621094,
      "end": 1639.6200256347656,
      "text": " set us out to accomplish and they respond with this positive response of let us rise"
    },
    {
      "id": 90,
      "start": 1639.6200256347656,
      "end": 1640.8600158691406,
      "text": " up and build."
    },
    {
      "id": 91,
      "start": 1640.8600158691406,
      "end": 1648.3400268554688,
      "text": " And then notice the end of verse 18, so they strengthened their hands for this good work."
    },
    {
      "id": 92,
      "start": 1648.3400268554688,
      "end": 1653.02001953125,
      "text": " Can I submit to you this evening that this work that they were about to embark upon,"
    },
    {
      "id": 93,
      "start": 1653.02001953125,
      "end": 1658.02001953125,
      "text": " this work that they were going to put their hand to was not a work of ease, it was not"
    },
    {
      "id": 94,
      "start": 1658.02001953125,
      "end": 1662.9800109863281,
      "text": " a work of comfort, it was not a work that was without any issues, it was a work that"
    },
    {
      "id": 95,
      "start": 1662.9800109863281,
      "end": 1670.5,
      "text": " was laborious, it was a work that was exhausting and we find that they said, let us rise up"
    },
    {
      "id": 96,
      "start": 1670.5,
      "end": 1677.3800048828125,
      "text": " and build, so they strengthened their hands for this good work."
    },
    {
      "id": 97,
      "start": 1677.3800048828125,
      "end": 1680.8600158691406,
      "text": " Could they have provided excuse, I'm sure they could."
    },
    {
      "id": 98,
      "start": 1680.8600158691406,
      "end": 1685.1000061035156,
      "text": " Could they have come up with maybe what some would say would be a valid excuse, I'm sure"
    },
    {
      "id": 99,
      "start": 1685.1000061035156,
      "end": 1686.1000061035156,
      "text": " some could."
    },
    {
      "id": 100,
      "start": 1686.1800231933594,
      "end": 1692.4600219726562,
      "text": " But they said, let us rise, let us rise up and build."
    },
    {
      "id": 101,
      "start": 1692.4600219726562,
      "end": 1698.1400146484375,
      "text": " The Bible tells us later that the people had a mind to work."
    },
    {
      "id": 102,
      "start": 1698.1400146484375,
      "end": 1706.4200134277344,
      "text": " They responded in such a positive way, they could not, what they could not accomplish"
    },
    {
      "id": 103,
      "start": 1706.4200134277344,
      "end": 1711.780029296875,
      "text": " individually they now would be able to accomplish together as co-laborers."
    },
    {
      "id": 104,
      "start": 1711.780029296875,
      "end": 1719.02001953125,
      "text": " We understand that this great work that God gave them to do, that they would have the"
    },
    {
      "id": 105,
      "start": 1719.02001953125,
      "end": 1723.1799926757812,
      "text": " opportunity to see God work in an amazing way."
    },
    {
      "id": 106,
      "start": 1723.1799926757812,
      "end": 1727.9400024414062,
      "text": " In fact, we mentioned earlier about chapter six and all that was going on, turn back there"
    },
    {
      "id": 107,
      "start": 1727.9400024414062,
      "end": 1734.1799926757812,
      "text": " again if you will to chapter six and in verse number 15, the Bible tells us this wonderful"
    },
    {
      "id": 108,
      "start": 1734.1799926757812,
      "end": 1738.739990234375,
      "text": " truth, so the wall, what does it say in your Bible?"
    },
    {
      "id": 109,
      "start": 1738.739990234375,
      "end": 1739.739990234375,
      "text": " Was what?"
    },
    {
      "id": 110,
      "start": 1739.739990234375,
      "end": 1740.739990234375,
      "text": " Finished."
    },
    {
      "id": 111,
      "start": 1740.739990234375,
      "end": 1741.739990234375,
      "text": " What does that mean?"
    },
    {
      "id": 112,
      "start": 1741.739990234375,
      "end": 1745.1799926757812,
      "text": " It means the work was accomplished."
    },
    {
      "id": 113,
      "start": 1745.1799926757812,
      "end": 1751.7000122070312,
      "text": " It means the work that they were enlisted to engage in in verse 17 of chapter two, come"
    },
    {
      "id": 114,
      "start": 1751.7000122070312,
      "end": 1756.1400146484375,
      "text": " and let us build up the wall of Jerusalem that we be no more reproached."
    },
    {
      "id": 115,
      "start": 1756.1400146484375,
      "end": 1761.1000366210938,
      "text": " The people said, let us rise up and build so they strengthen their hands for this good"
    },
    {
      "id": 116,
      "start": 1761.1000366210938,
      "end": 1768.1000366210938,
      "text": " work and the Bible says so the wall in Nehemiah six and verse 15 was finished in the twenty"
    },
    {
      "id": 117,
      "start": 1768.260009765625,
      "end": 1775.260009765625,
      "text": " and fifth day of the month Elul in fifty and two days."
    },
    {
      "id": 118,
      "start": 1775.7000122070312,
      "end": 1778.5800170898438,
      "text": " What an accomplishment."
    },
    {
      "id": 119,
      "start": 1778.5800170898438,
      "end": 1780.8200073242188,
      "text": " That's what God can do."
    },
    {
      "id": 120,
      "start": 1780.8200073242188,
      "end": 1783.780029296875,
      "text": " That's what God can do."
    },
    {
      "id": 121,
      "start": 1783.780029296875,
      "end": 1785.6600341796875,
      "text": " Nehemiah could never do that."
    },
    {
      "id": 122,
      "start": 1785.6600341796875,
      "end": 1792.6600341796875,
      "text": " But when the people of God come together and are laboring together with God, God provided"
    },
    {
      "id": 123,
      "start": 1793.5400390625,
      "end": 1798.9400024414062,
      "text": " them with strength, God provided them with wisdom and they were able to accomplish a"
    },
    {
      "id": 124,
      "start": 1798.9400024414062,
      "end": 1799.8599853515625,
      "text": " great work."
    },
    {
      "id": 125,
      "start": 1799.8599853515625,
      "end": 1800.7000122070312,
      "text": " Notice in verse 16."
    },
    {
      "id": 0,
      "start": 1800.7000122070312,
      "end": 1805.460012435913,
      "text": " 16 of chapter 6, the Bible says in it came to pass that when all our enemies heard thereof"
    },
    {
      "id": 1,
      "start": 1805.460012435913,
      "end": 1808.9400119781494,
      "text": " and all the heathen that were about us saw these things, they were much cast down in"
    },
    {
      "id": 2,
      "start": 1808.9400119781494,
      "end": 1816.380012512207,
      "text": " their own eyes, notice, for they perceived that this work was wrought of our God."
    },
    {
      "id": 3,
      "start": 1816.380012512207,
      "end": 1823.1000118255615,
      "text": " You know, God has not called us to build a wall, but God's called us to do a work."
    },
    {
      "id": 4,
      "start": 1823.1000118255615,
      "end": 1829.1800117492676,
      "text": " God's called us to do a work, and the work is not building a wall, but the work is propagating"
    },
    {
      "id": 5,
      "start": 1829.1800117492676,
      "end": 1831.300012588501,
      "text": " the truth of the gospel."
    },
    {
      "id": 6,
      "start": 1831.300012588501,
      "end": 1837.3000106811523,
      "text": " The work that we're called to be involved in and engaged in is a work that requires"
    },
    {
      "id": 7,
      "start": 1837.3000106811523,
      "end": 1846.160011291504,
      "text": " us to go in the power of God, to go together in boldness and understanding that we're seeking"
    },
    {
      "id": 8,
      "start": 1846.160011291504,
      "end": 1853.7400131225586,
      "text": " to take a message to a lost and dying world, and we must come to this place where we recognize"
    },
    {
      "id": 9,
      "start": 1853.7400131225586,
      "end": 1859.7400131225586,
      "text": " that it is our responsibility and we respond by saying, as Isaiah did in Isaiah 6, here"
    },
    {
      "id": 10,
      "start": 1859.7400131225586,
      "end": 1863.8600120544434,
      "text": " am I, send me."
    },
    {
      "id": 11,
      "start": 1863.8600120544434,
      "end": 1867.3000106811523,
      "text": " It doesn't mean that we'd have to cross an ocean, it doesn't mean that we'd have to learn"
    },
    {
      "id": 12,
      "start": 1867.3000106811523,
      "end": 1874.260009765625,
      "text": " a new language, a new culture, it simply means that we may have to cross a street and actively"
    },
    {
      "id": 13,
      "start": 1874.260009765625,
      "end": 1880.8600158691406,
      "text": " be engaged in trying to reach someone with the gospel of the Lord Jesus Christ."
    },
    {
      "id": 14,
      "start": 1880.8600158691406,
      "end": 1884.7400131225586,
      "text": " I made this comment recently, I don't remember if it was on a Sunday morning or evening,"
    },
    {
      "id": 15,
      "start": 1884.7400131225586,
      "end": 1887.9000091552734,
      "text": " but just in the last couple of weeks I made the comment, and I don't make the comment"
    },
    {
      "id": 16,
      "start": 1887.9000091552734,
      "end": 1894.8600158691406,
      "text": " to be unkind to anyone, but just as God placed it upon my heart and challenged me with this"
    },
    {
      "id": 17,
      "start": 1894.8600158691406,
      "end": 1897.500015258789,
      "text": " thought, is this, it's not within me."
    },
    {
      "id": 18,
      "start": 1897.500015258789,
      "end": 1902.1400146484375,
      "text": " We read the text already in 1 Corinthians chapter 3, I can't save anybody and you can't"
    },
    {
      "id": 19,
      "start": 1902.1400146484375,
      "end": 1904.260009765625,
      "text": " save anybody."
    },
    {
      "id": 20,
      "start": 1904.260009765625,
      "end": 1907.260009765625,
      "text": " It is God who gives the increase, amen?"
    },
    {
      "id": 21,
      "start": 1907.260009765625,
      "end": 1909.3000106811523,
      "text": " We believe that."
    },
    {
      "id": 22,
      "start": 1909.3000106811523,
      "end": 1914.0200119018555,
      "text": " But here's how God has challenged me and how I hope that God would challenge you as well,"
    },
    {
      "id": 23,
      "start": 1914.0200119018555,
      "end": 1919.0200119018555,
      "text": " is not, when was the last time somebody, I had the privilege of leading somebody to Christ"
    },
    {
      "id": 24,
      "start": 1919.0200119018555,
      "end": 1923.500015258789,
      "text": " because God gives the increase, but the question really is this, when is the last time I've"
    },
    {
      "id": 25,
      "start": 1923.500015258789,
      "end": 1927.0600128173828,
      "text": " even shared the gospel with someone?"
    },
    {
      "id": 26,
      "start": 1927.0600128173828,
      "end": 1930.6200103759766,
      "text": " Because that is something that is my responsibility."
    },
    {
      "id": 27,
      "start": 1930.6200103759766,
      "end": 1934.8600158691406,
      "text": " Could I say tonight, that's something that is your responsibility, to share the gospel."
    },
    {
      "id": 28,
      "start": 1934.8600158691406,
      "end": 1941.500015258789,
      "text": " I can't save anybody, you can't save anybody, but I sure can tell somebody about Jesus."
    },
    {
      "id": 29,
      "start": 1941.500015258789,
      "end": 1949.260009765625,
      "text": " Some plant, some water, but God gives the increase."
    },
    {
      "id": 30,
      "start": 1949.260009765625,
      "end": 1953.1800079345703,
      "text": " And we are laborers together with God."
    },
    {
      "id": 31,
      "start": 1953.1800079345703,
      "end": 1960.2200164794922,
      "text": " And we find here that the response of the people was so appropriate with regard to the"
    },
    {
      "id": 32,
      "start": 1960.2200164794922,
      "end": 1964.4600067138672,
      "text": " request that was made, and they say, let us rise up and build."
    },
    {
      "id": 33,
      "start": 1964.4600067138672,
      "end": 1970.4200134277344,
      "text": " You say, man, it's wonderful, but it's not the end of the chapter, it's not the end of"
    },
    {
      "id": 34,
      "start": 1970.4200134277344,
      "end": 1971.8200073242188,
      "text": " the chapter."
    },
    {
      "id": 35,
      "start": 1971.8200073242188,
      "end": 1979.4600067138672,
      "text": " There's one final point this evening, and that's this, number four, the resistance faced."
    },
    {
      "id": 36,
      "start": 1979.4600067138672,
      "end": 1983.1000061035156,
      "text": " You know, when there's a response like we read in verse 18, when there's a request like"
    },
    {
      "id": 37,
      "start": 1983.1000061035156,
      "end": 1988.5800170898438,
      "text": " we see in verse 17, when God has put something in your heart like we see God putting in the"
    },
    {
      "id": 38,
      "start": 1988.5800170898438,
      "end": 1993.8600158691406,
      "text": " heart of Nehemiah to go and do this work, to be engaged in what God has burdened him"
    },
    {
      "id": 39,
      "start": 1993.8600158691406,
      "end": 1999.500015258789,
      "text": " with, and the way that God's hand was upon him, the good hand of my God upon me, and"
    },
    {
      "id": 40,
      "start": 1999.500015258789,
      "end": 2004.1000061035156,
      "text": " as he received the letters and he had all of the resources and all of these things,"
    },
    {
      "id": 41,
      "start": 2004.1000061035156,
      "end": 2007.9000091552734,
      "text": " and we find that Nehemiah comes to a place and he says, I'm doing what God's called me"
    },
    {
      "id": 42,
      "start": 2007.9000091552734,
      "end": 2011.3400115966797,
      "text": " to do, and the people say, let us rise up and build, then everything should just go"
    },
    {
      "id": 43,
      "start": 2011.3400115966797,
      "end": 2014.3400115966797,
      "text": " smooth."
    },
    {
      "id": 44,
      "start": 2014.3400115966797,
      "end": 2017.8200073242188,
      "text": " Have you found that it doesn't work that way?"
    },
    {
      "id": 45,
      "start": 2017.8200073242188,
      "end": 2022.740005493164,
      "text": " There's resistance that the people of God face."
    },
    {
      "id": 46,
      "start": 2022.740005493164,
      "end": 2029.8200073242188,
      "text": " The Bible says in verse 19, but when Sanballat the Horonite and Tobiah the Servant, the Ammonite,"
    },
    {
      "id": 47,
      "start": 2029.8200073242188,
      "end": 2039.0600128173828,
      "text": " and Geshem, excuse me, the Arabian heard it, they laughed us to scorn and despised us,"
    },
    {
      "id": 48,
      "start": 2039.0600128173828,
      "end": 2042.9800109863281,
      "text": " and said, what is this thing that you do?"
    },
    {
      "id": 49,
      "start": 2042.9800109863281,
      "end": 2047.8000183105469,
      "text": " Will ye rebel against the king?"
    },
    {
      "id": 50,
      "start": 2047.8000183105469,
      "end": 2052.560012817383,
      "text": " So we find that the resistance really starts out kind of light."
    },
    {
      "id": 51,
      "start": 2052.560012817383,
      "end": 2057.0800170898438,
      "text": " It will intensify if you study the book of Nehemiah and you continue to go through and"
    },
    {
      "id": 52,
      "start": 2057.0800170898438,
      "end": 2062.3600158691406,
      "text": " you see the resistance, in fact, in chapter number four in particular, you see how the"
    },
    {
      "id": 53,
      "start": 2062.3600158691406,
      "end": 2068.480010986328,
      "text": " enemy mocks and how they threaten and all that they do and they come and they seek to"
    },
    {
      "id": 54,
      "start": 2068.480010986328,
      "end": 2072.6400146484375,
      "text": " destroy and all that's taking place and we could not have the time this evening to read"
    },
    {
      "id": 55,
      "start": 2072.6400146484375,
      "end": 2076.1600036621094,
      "text": " through the fourth chapter of the book of Nehemiah, but I would encourage you to go"
    },
    {
      "id": 56,
      "start": 2076.1600036621094,
      "end": 2081.8400268554688,
      "text": " back later and read through it because you see this mocking, if you will, this little"
    },
    {
      "id": 57,
      "start": 2081.8400268554688,
      "end": 2088.1200256347656,
      "text": " ridicule in chapter number two in verse 19 is light compared to what will be faced."
    },
    {
      "id": 58,
      "start": 2088.1200256347656,
      "end": 2093.040008544922,
      "text": " In fact, when you get to chapter number six and we read already about him saying, Nehemiah"
    },
    {
      "id": 59,
      "start": 2093.040008544922,
      "end": 2097.1200256347656,
      "text": " saying, no, I'm not going to go because I'm doing a great work, not only did they send"
    },
    {
      "id": 60,
      "start": 2097.1200256347656,
      "end": 2102.4000244140625,
      "text": " those letters to try to pull him away so that they might deal with him, but we find that"
    },
    {
      "id": 61,
      "start": 2102.4000244140625,
      "end": 2108.8400268554688,
      "text": " then they lied and they said to Nehemiah that he should go hide himself in the temple"
    },
    {
      "id": 62,
      "start": 2108.8400268554688,
      "end": 2113.040008544922,
      "text": " which was not appropriate so that they can bring accusation against him."
    },
    {
      "id": 63,
      "start": 2113.040008544922,
      "end": 2117.760009765625,
      "text": " Listen, the enemy is deceitful."
    },
    {
      "id": 64,
      "start": 2117.760009765625,
      "end": 2121.1800231933594,
      "text": " The enemy is relentless."
    },
    {
      "id": 65,
      "start": 2121.1800231933594,
      "end": 2128.279998779297,
      "text": " We see the resistance faced and here when we look in verse 19, it's just the fact that"
    },
    {
      "id": 66,
      "start": 2128.279998779297,
      "end": 2131.480010986328,
      "text": " the Bible tells us that they laughed at them."
    },
    {
      "id": 67,
      "start": 2131.5599975585938,
      "end": 2133.2000122070312,
      "text": " Well, that's not too bad."
    },
    {
      "id": 68,
      "start": 2133.2000122070312,
      "end": 2137.8400268554688,
      "text": " Well, you don't like being laughed at, am I right?"
    },
    {
      "id": 69,
      "start": 2137.8400268554688,
      "end": 2141.6000061035156,
      "text": " I'm going to set out to do this and somebody laughs at you and says, good luck, it's not"
    },
    {
      "id": 70,
      "start": 2141.6000061035156,
      "end": 2144.240020751953,
      "text": " going to happen."
    },
    {
      "id": 71,
      "start": 2144.240020751953,
      "end": 2147.4600219726562,
      "text": " Never going to work."
    },
    {
      "id": 72,
      "start": 2147.4600219726562,
      "end": 2149.800018310547,
      "text": " It's discouraging."
    },
    {
      "id": 73,
      "start": 2149.800018310547,
      "end": 2156.4000244140625,
      "text": " You know, discouragement is a tool that's in Satan's toolbox that he uses over and over"
    },
    {
      "id": 74,
      "start": 2156.4000244140625,
      "end": 2160.6000061035156,
      "text": " and over again, the tool of discouragement."
    },
    {
      "id": 75,
      "start": 2160.720001220703,
      "end": 2169.6800231933594,
      "text": " You know, sometimes he'll use even well-intentioned people to discourage you."
    },
    {
      "id": 76,
      "start": 2169.6800231933594,
      "end": 2171.9200134277344,
      "text": " That can't be done."
    },
    {
      "id": 77,
      "start": 2171.9200134277344,
      "end": 2175.9200134277344,
      "text": " You can't do that."
    },
    {
      "id": 78,
      "start": 2175.9200134277344,
      "end": 2179.6400146484375,
      "text": " The Bible says that they despised us."
    },
    {
      "id": 79,
      "start": 2179.6400146484375,
      "end": 2181.760009765625,
      "text": " What is this thing that you do?"
    },
    {
      "id": 80,
      "start": 2181.760009765625,
      "end": 2186.040008544922,
      "text": " Will ye rebel against the king?"
    },
    {
      "id": 81,
      "start": 2186.040008544922,
      "end": 2190.5800170898438,
      "text": " Later on in chapter 4, they talk about even if they were to do the work that even if I"
    },
    {
      "id": 82,
      "start": 2190.5800170898438,
      "end": 2195.4200134277344,
      "text": " fox would run upon it, in verse number 3, even that which they build, if a fox go up,"
    },
    {
      "id": 83,
      "start": 2195.4200134277344,
      "end": 2200.5800170898438,
      "text": " he shall even break down their stone wall."
    },
    {
      "id": 84,
      "start": 2200.5800170898438,
      "end": 2207.8200073242188,
      "text": " But notice the response in verse number 20, we'll always have adversity."
    },
    {
      "id": 85,
      "start": 2207.8200073242188,
      "end": 2210.8600158691406,
      "text": " We will always face resistance."
    },
    {
      "id": 86,
      "start": 2210.8600158691406,
      "end": 2216.7000122070312,
      "text": " When you seek to do a work for God, you can just guarantee there's going to be resistance"
    },
    {
      "id": 87,
      "start": 2216.9000244140625,
      "end": 2221.8600158691406,
      "text": " because we have an enemy who hates advancement."
    },
    {
      "id": 88,
      "start": 2221.8600158691406,
      "end": 2225.260009765625,
      "text": " He hates it when we seek to do the will of God."
    },
    {
      "id": 89,
      "start": 2225.260009765625,
      "end": 2227.8200073242188,
      "text": " You know, he doesn't mess with you when you're just sitting on the sideline and just not"
    },
    {
      "id": 90,
      "start": 2227.8200073242188,
      "end": 2230.4600219726562,
      "text": " really doing anything."
    },
    {
      "id": 91,
      "start": 2230.4600219726562,
      "end": 2233.300018310547,
      "text": " You start trying to do something, and here's what happens in your mind."
    },
    {
      "id": 92,
      "start": 2233.300018310547,
      "end": 2236.7000122070312,
      "text": " You say, well, I'm trying to do something for God and all these things have happened."
    },
    {
      "id": 93,
      "start": 2236.7000122070312,
      "end": 2238.7000122070312,
      "text": " Yeah, that's how it works."
    },
    {
      "id": 94,
      "start": 2238.7000122070312,
      "end": 2241.3800048828125,
      "text": " That's how it works."
    },
    {
      "id": 95,
      "start": 2241.3800048828125,
      "end": 2245.1000061035156,
      "text": " Because that's when the enemy notices you and says, oh, I got to deal with this."
    },
    {
      "id": 96,
      "start": 2245.1000061035156,
      "end": 2246.1000061035156,
      "text": " I got to discourage them."
    },
    {
      "id": 97,
      "start": 2246.5,
      "end": 2247.5,
      "text": " I got to stop them."
    },
    {
      "id": 98,
      "start": 2247.5,
      "end": 2248.5,
      "text": " Why?"
    },
    {
      "id": 99,
      "start": 2248.5,
      "end": 2250.5,
      "text": " Because they're trying to do something for God."
    },
    {
      "id": 100,
      "start": 2250.5,
      "end": 2255.4200134277344,
      "text": " And we cannot focus on the resistance, no."
    },
    {
      "id": 101,
      "start": 2255.4200134277344,
      "end": 2263.0599975585938,
      "text": " We must take note of how Nehemiah answered this resistance that first came in verse 19."
    },
    {
      "id": 102,
      "start": 2263.0599975585938,
      "end": 2266.8600158691406,
      "text": " In verse 20, the Bible says, then answered I them."
    },
    {
      "id": 103,
      "start": 2266.8600158691406,
      "end": 2268.779998779297,
      "text": " Notice what Nehemiah said."
    },
    {
      "id": 104,
      "start": 2268.779998779297,
      "end": 2275.6200256347656,
      "text": " The God of heaven, he will prosper us."
    },
    {
      "id": 105,
      "start": 2275.6200256347656,
      "end": 2279.5,
      "text": " You see that as a statement of faith, confidence?"
    },
    {
      "id": 106,
      "start": 2279.5,
      "end": 2286.4200134277344,
      "text": " I mean, we find that it says, therefore, we his servants will arise and build, but you"
    },
    {
      "id": 107,
      "start": 2286.4200134277344,
      "end": 2291.6200256347656,
      "text": " have no portion, nor rite, nor memorial in Jerusalem."
    },
    {
      "id": 108,
      "start": 2291.6200256347656,
      "end": 2295.540008544922,
      "text": " Man, that's wonderful to see the resolve."
    },
    {
      "id": 109,
      "start": 2295.540008544922,
      "end": 2298.3800048828125,
      "text": " See, God put something in his heart."
    },
    {
      "id": 110,
      "start": 2298.3800048828125,
      "end": 2300.8200073242188,
      "text": " He said, I'm not going to focus on the resistance."
    },
    {
      "id": 111,
      "start": 2300.8200073242188,
      "end": 2305.1400146484375,
      "text": " I'm just going to let you know that our God is going to prosper us and that we are going"
    },
    {
      "id": 112,
      "start": 2305.1400146484375,
      "end": 2309.0599975585938,
      "text": " to do what God has called us to do."
    },
    {
      "id": 113,
      "start": 2309.0599975585938,
      "end": 2313.4600219726562,
      "text": " It's interesting when you read chapter 3, and I'll finish with this, that you go through"
    },
    {
      "id": 114,
      "start": 2313.4600219726562,
      "end": 2318.6199951171875,
      "text": " the work being assigned and the text gives us all of these individuals that we're building"
    },
    {
      "id": 115,
      "start": 2318.6199951171875,
      "end": 2320.5800170898438,
      "text": " at particular gates and what have you."
    },
    {
      "id": 116,
      "start": 2320.5800170898438,
      "end": 2325.3800048828125,
      "text": " But I just want to note one statement in verse number 5."
    },
    {
      "id": 117,
      "start": 2325.3800048828125,
      "end": 2332.8200073242188,
      "text": " The Bible says, next unto them the Techoites repaired, but notice this, their nobles put"
    },
    {
      "id": 118,
      "start": 2332.8200073242188,
      "end": 2340.0599975585938,
      "text": " not their necks to the work of their Lord."
    },
    {
      "id": 119,
      "start": 2340.0599975585938,
      "end": 2349.5400390625,
      "text": " Could I say to you this evening that the resistance is always going to be faced, but we must refuse"
    },
    {
      "id": 120,
      "start": 2349.5400390625,
      "end": 2351.7000122070312,
      "text": " to be on the sidelines."
    },
    {
      "id": 121,
      "start": 2351.7000122070312,
      "end": 2359.4600219726562,
      "text": " We must get in the work, be engaged in doing the work that God has called us to do."
    },
    {
      "id": 122,
      "start": 2359.4600219726562,
      "end": 2364.260009765625,
      "text": " There's a work to do, not building a wall, I've said that already this evening, but in"
    },
    {
      "id": 123,
      "start": 2364.260009765625,
      "end": 2365.260009765625,
      "text": " reaching a community."
    },
    {
      "id": 124,
      "start": 2365.260009765625,
      "end": 2367.8200073242188,
      "text": " Listen, I believe the hour is late."
    },
    {
      "id": 125,
      "start": 2367.8200073242188,
      "end": 2370.260009765625,
      "text": " I really do."
    },
    {
      "id": 126,
      "start": 2370.260009765625,
      "end": 2372.8200073242188,
      "text": " The hour is late."
    },
    {
      "id": 127,
      "start": 2372.8200073242188,
      "end": 2375.0599975585938,
      "text": " There's much to be accomplished."
    },
    {
      "id": 128,
      "start": 2375.0599975585938,
      "end": 2378.5400390625,
      "text": " People are dying every day."
    },
    {
      "id": 129,
      "start": 2378.5400390625,
      "end": 2382.9000244140625,
      "text": " Many of those people that are dying every day are dying without even knowing the truth"
    },
    {
      "id": 130,
      "start": 2382.9000244140625,
      "end": 2385.3800048828125,
      "text": " of the gospel."
    },
    {
      "id": 131,
      "start": 2385.3800048828125,
      "end": 2389.739990234375,
      "text": " I mean they're dying without knowing the truth of the gospel."
    },
    {
      "id": 132,
      "start": 2389.739990234375,
      "end": 2391.8200073242188,
      "text": " I'm talking about your neighbors and my neighbors."
    },
    {
      "id": 133,
      "start": 2391.8200073242188,
      "end": 2393.4199829101562,
      "text": " I'm talking about your coworkers."
    },
    {
      "id": 134,
      "start": 2393.4199829101562,
      "end": 2400.3400268554688,
      "text": " I'm talking about people that we interact with in our community."
    },
    {
      "id": 135,
      "start": 2400.3400268554688,
      "end": 2400.739990234375,
      "text": " There's a work to do."
    },
    {
      "id": 0,
      "start": 2400.739990234375,
      "end": 2407.279990196228,
      "text": " that needs to be done. There will be resistance. But I hope that our response would be that"
    },
    {
      "id": 1,
      "start": 2407.279990196228,
      "end": 2413.559989929199,
      "text": " of what we read of these people as they responded to Nehemiah and said, let us rise up. Let"
    },
    {
      "id": 2,
      "start": 2413.559989929199,
      "end": 2420.399990081787,
      "text": " us do the work that God has called us to do. God put us in this place for a purpose, for"
    },
    {
      "id": 3,
      "start": 2420.399990081787,
      "end": 2430.6399898529053,
      "text": " a reason. And that reason, first and foremost, is that he would receive glory. He says in"
    },
    {
      "id": 4,
      "start": 2430.6399898529053,
      "end": 2438.959991455078,
      "text": " John 15, herein is my Father glorified, that ye bear much fruit. That you bear much fruit."
    },
    {
      "id": 5,
      "start": 2438.959991455078,
      "end": 2446.1199913024902,
      "text": " All that God would use us as being laborers together with him, laboring in his vineyard,"
    },
    {
      "id": 6,
      "start": 2446.1199913024902,
      "end": 2451.7599906921387,
      "text": " doing his work, being used to bring honor and glory to the name of the Lord. Let's pray"
    },
    {
      "id": 7,
      "start": 2451.7599906921387,
      "end": 2456.999988555908,
      "text": " together. Father, we love you. We thank you for loving us. We thank you for the privilege"
    },
    {
      "id": 8,
      "start": 2456.999988555908,
      "end": 2462.1599884033203,
      "text": " of looking at this Old Testament passage of scripture and seeing what you put in Nehemiah's"
    },
    {
      "id": 9,
      "start": 2462.1599884033203,
      "end": 2468.2799911499023,
      "text": " heart. Lord, the work that you did there, Lord, we rejoice in it. I pray God that you'd"
    },
    {
      "id": 10,
      "start": 2468.2799911499023,
      "end": 2478.639991760254,
      "text": " put something in our hearts tonight. Give us a burden. Lord, help us to rise up together"
    },
    {
      "id": 11,
      "start": 2478.639991760254,
      "end": 2486.839988708496,
      "text": " as being laborers together with you. To accomplish, Lord, what you've called us to accomplish."
    },
    {
      "id": 12,
      "start": 2486.839988708496,
      "end": 2494.3999938964844,
      "text": " To reach our Jerusalem with the gospel of the Lord Jesus Christ. I pray God that you'd"
    },
    {
      "id": 13,
      "start": 2494.3999938964844,
      "end": 2499.359992980957,
      "text": " move in hearts and lives. Lord, help us to be responsive this evening. Help us to be"
    },
    {
      "id": 14,
      "start": 2499.359992980957,
      "end": 2502.8799896240234,
      "text": " doers of the word and not hearers only. We'll thank you for what you'll do, for it's in"
    },
    {
      "id": 15,
      "start": 2502.8799896240234,
      "end": 2504.119987487793,
      "text": " Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-14T20:48:51.094719"
}