{
  "video_id": "Q_1QzEYkQvA",
  "text": "evening, Genesis chapter number 28, Genesis chapter number 28 tonight, and we'll finish this chapter. We started last Sunday evening looking at the first nine verses of Genesis chapter 28 and be looking at verses 10 through 22 this evening. And we've noted, of course, as we've studied through these last several chapters of the book of Genesis, things with regard to the life of Jacob. And now the focus, of course, had shifted from Abraham to Isaac, and now it's going to shift from Isaac to Jacob, and begin to follow his life over the next several chapters and look at all that takes place. In fact, his death, of course, recorded near the end of the book of Genesis. And as we look at the passage of Scripture this evening and looking at the life of Jacob, of course, I mentioned this even this morning, that the events previously recorded to this passage of Scripture have resulted in Jacob, of course, leaving home, being instructed to do so. And he's received that instruction in our previous text of Scripture. But it's interesting because really up to this point in the life of Jacob, there's really nothing of any significance in his life with regard to spiritual aspect, right? The spiritual aspect in Jacob's life, there's really nothing of significance in the Scriptures. It was in the 25th chapter of the book of Genesis that we read of the birth of Jacob. It was in the 25th chapter at the end of the chapter that we read how that he obtained Esau's birthright. It was in chapter number 26 where the family is in Gerar. Remember, there was a famine. And it's interesting because all of the chapter, chapter number 26, there's not one reference to Jacob in the entire chapter. And much there about Isaac and all that takes place and the interactions with the Philistines and what have you. So there's nothing that is specifically mentioned about Jacob. And then of course, as we've studied chapter number 27 over the last several Sunday evenings, we've had the opportunity to see that it was in that chapter where there's much deception and carnality on the part of Jacob. We come to Genesis chapter 28. We read how that as we studied last week that Isaac called Jacob, he blessed him, and he charged him. It's interesting because God records for us that as Jacob is receiving this charge from Isaac in verse number three, it says, and God Almighty bless thee and make thee fruitful. It's interesting. That's the God's name, El Shaddai, the Lord God Almighty. And of course, God had revealed himself to Abraham and as being El Shaddai back in Genesis chapter number 17. And so it's interesting that God uses Isaac to give this charge to Jacob and he hears those words. He speaks to him about a blessing, but we find that as we pick it up this evening in verse number 10, the Bible says that Jacob went out from Beersheba and he went toward Haran and he lighted upon a certain place and tarried there all night because the sun was set. And he took the stones of that place and put them for his pillows and lay down in that place to sleep. It says in verse number 12 that he dreamed and behold, a ladder set up on the earth and the top of it reached to heaven. Behold the angels of God ascending and descending on it. And behold, the Lord stood above it and said, and we're going to look at all that he said I'm going to pause there and give you the title for the message we'll dig in tonight. The Lord spoke to Jacob. What a blessing to think about God speaking to his people. What a blessing to consider this evening that we have the written Word of God, the complete Word of God, the whole canon of Scripture and that God uses his Word in our lives. God speaks to us through his Word. We understand that Jacob did not have a Bible as we have a Bible. The Lord speaks to Jacob and I'm thankful that every time that I open the pages of this precious book, that God Almighty speaks to me. That's wonderful. It's precious. I mentioned to somebody as they were leaving this morning, of course, I preached on prayer this morning and we just had a brief conversation with someone as they were leaving. And I said, you know, the reality is at least I will be very transparent with you this evening. It is easier for me, that's what I said to the person at the back door this morning. It is much easier for me to read the Word of God than it is for me to pray. It's just the way it is in my life. I don't know. You might say it's easier for me to pray than it is to read. But I have no problem. I can sit down and read the Bible for an hour, for longer. I can just read and read. I love reading the Bible. But it just seems like every time you go to pray, there's just distraction. I pray. I'm not suggesting I don't pray. I'm saying that it's easier for me to read than it is for praying. It's more natural for me. Every time I open the Word of God, God speaks to me. And I love it. It's precious. And here in this passage of Scripture, the Bible tells us no longer is Jacob receiving something from Isaac with regard to God. Now God is speaking directly to Jacob. And that's exciting to me. It's encouraging to me. And what a blessing to think about the truth of this passage of Scripture and to think about the way in which God reveals great truth to Jacob. If you're taking notes this evening, notice in verses 10 and 11, as we begin looking through this passage, his departure. Very quickly, not much that we'll discuss here. But I do want you to note that the Bible says that he went out from Beersheba and he went toward Haran. Now Haran was the chief city of Paddan Aram. And according to verse number two of Genesis 28, he was instructed by his father Isaac to go to Paddan Aram and to the house of Bethuel, thy mother's father, and take thee a wife from then, so the daughters of Laban, thy mother's brother. And so we see that in verse number 10, that when the Bible tells us that he went out from Beersheba and he went toward Haran, that he went in obedience. He followed the instruction that had been given. And what a blessing, because we find that it's very important where he finds himself here in this passage of Scripture and how God appears to him and God speaks to him. And I find that that act of obedience that begins our portion of Scripture, our study this evening, is of great significance and it's of great importance. We find that the Bible tells us that he alighted upon a certain place. He tarried there all night because the sun was set. It tells us that he took of the stones of that place and put them for his pillows and he laid down in that place to sleep. And we find that his departure is recorded very quickly and we see that what notes that, what's important about those verses is you note the obedience of Jacob. As we look at verses 12 down through verse number 15, I want you to capture with me and look at the dream. We see his departure, but we see his dream. In verse number 12, we see what Jacob saw in this dream. The Bible says that he dreamed, and behold, a ladder set up on the earth, and the top of it reached to heaven. Behold, the angels of God ascending and descending on it. So you see, as God would allow us by recorded, written word of God to allow us to see and to hear, to understand what it was that Jacob dreamed in this passage of Scripture. And it's very interesting because the Bible says that he sees this ladder that was set up on the earth, and it says that the top of it reached to heaven. And I want you to notice, the Bible says that the angels of God ascending and descending on it, on that ladder. We find that this is what he saw. So it's interesting, hold your place here, but turn to the book of John very quickly, if you will. The gospel of John. And I want you to look in the first chapter of the gospel of John. And you look in this first chapter, and remember, it was John the Baptist that spoke about Jesus Christ being the Lamb of God, according to verse number 36. And the Bible tells us that there were some that followed after Jesus, and there's some interaction that takes place. Remember, Jesus asked them, what seek ye? And they told him in verse number 38 that they said unto him, where dwellest thou? And he said to them in verse 39, come and see. And we find that there's reference here with regard to Andrew and Simon Peter. But skip down, if you will. And I want you to notice in verse number 46, it says, in Nathanael, let me say in verse 45, because Philip findeth Nathanael and saith unto him, we have found him of whom Moses and the law and the prophets did write, Jesus of Nazareth, the son of Joseph. Nathanael said unto him, can any good thing come out of Nazareth? Philip saith unto him, come and see. Jesus saw Nathanael coming to him and saith unto him, verse 47, behold, an Israelite indeed in whom is no guile. Nathanael said unto him, whence knowest thou me? Jesus answered and said unto him, before that Philip called thee, when thou wast under the fig tree, I saw thee. That's how Nathanael answers in verse 49. He answers and says, Rabbi, thou art the Son of God. Thou art the King of Israel. Jesus answers, and I want you to see what he says here in verse 50, and especially in verse number 51 as it pertains to this dream that Jacob had. In verse number 50, Jesus answered unto him, because I said unto thee, I saw thee under the fig tree, believest thou? Thou shalt see greater things than these, and he saith unto him, verily, verily, of a truth of a truth, I say unto you, hereafter ye shall see heaven open, and the angels of God ascending and descending upon the Son of Man. That ladder that Jacob saw in our passage of Scripture in Genesis 28, that's no other than Jesus Christ. He says he's the Son of Man, amen? And it says that you're going to see heaven open, and the angels of God ascending and descending upon the Son of Man. In Genesis chapter 28, in verse number 12, it says that he dreamed, and behold, a ladder set up on the earth, and the top of it reached heaven, and behold, the angels of God ascending and descending on it. And Jesus ties it. in with Nathanael in John chapter 1 and verse number 51, all the way back to this dream of Jacob in Genesis chapter 28, and what precious truth that we see there. And so as we consider this dream this evening, we note first of all what he saw, but I want you to pay close attention to what he heard. Beginning in verse number 13 and down through verse number 15, Jacob heard some powerful truth. The Bible says, and behold, the Lord stood above it and said, and God Almighty is going to speak to him. And look, notice first of all that what he heard was regarding a place in verse number 13. It says, I am the Lord God of Abraham, thy father, the God of Isaac, the land whereon thou liest, to thee will I give it and to thy seed. We find that Jacob hears the voice of God. He follows, he departs, he goes toward Haran as he had been instructed to do so, and he goes to sleep, and he dreams a dream, and we see the vision that he saw, but we note what he heard and how the Lord spoke to him and gave him precious promises. And he begins in verse number 13 regarding a place, a land, and we know that this goes back to the Abrahamic covenant. We understand that as we've studied in weeks gone by the details of the Abrahamic covenant, we see here that God says to Jacob, I am the Lord God of Abraham, thy father, the God of Isaac, the land whereon thou liest, to thee will I give it and to thy seed. Notice he continues in verse number 14, not only regarding a place, but now regarding a person, and that person being the Lord. Notice it says, and thy seed shall be as the dust of the earth, and thou shalt spread abroad to the west, to the east, to the north, and to the south, and in thee and in thy seed shall all the families of the earth be blessed. Of course, we understand seed plural with regard to the nation of Israel, but when we think about seed singular, as God spoke to Abraham, remember in Galatians 3 in verse number 16, he says, I did not say seeds, but seed, speaking of the Lord Jesus Christ. And what great truth. Of course, we know that Jacob would be married, he'd have the sons, the tribes of Israel, so on and so forth. But we find that as he gives them this promise, he talks about the way in which they'd spread abroad to the west, east, north, and south. But we think specifically about the promised Messiah, the messianic prophecy and the promise and the line that I mentioned already in Galatians 3 in verse number 16, and what a precious truth. And so as we begin to focus in and we see that Jacob, he goes to this place and he lies down to sleep and he has this dream. And as he has this dream, he hears the voice of God. God begins to speak to him. God begins to reveal truth to him. We would say that God begins to reveal his plan to him. In verse number 15, we find that he gives them truth regarding his plan and his presence. He is now speaking about Jacob's life specifically. Notice in verse 15, what encouraging promises are received here in this verse of Scripture. And behold, I am with thee, and will keep thee in all places whither thou goest, and will bring thee again into this land, for I will not leave thee until I have done that which I have spoken to thee of. Isn't that precious? Isn't that encouraging? How often we go to the Word of God and we are reminded of the precious truth of God giving his promise with regard to his presence and how that he says, I will be with thee. We understand that we have that great promise of Hebrews 13 in verse number 5 when the Word of God tells us, I will never leave thee nor forsake thee, and how wonderful that truth is and how impactful that is. I've often said over the years that the promise of his presence brings comfort in the life of the believer, and certainly that's true because we know, even as the psalmist says in Psalm 23, that yea, though I walk through the valley of the shadow of death, I will fear no evil, why, for thou art with me. And to know his presence is so encouraging. And that's how God starts out when he speaks about the land and about the seed, and he then talks about the life of Jacob and his presence, and he starts in verse 15 and says, and behold, I am with thee. Wow, that's precious. He says this, and will keep thee in all places whither thou goest. Now, that's encouraging, isn't it? And you think about the promise that God gives to Joshua in Joshua chapter number 9, or Joshua chapter number 1, excuse me, with regard to going in and conquering the land, and that God said he was going to be with them. And as he went through that place and fulfilled the plan of God in his life for the nation of Israel, that God Almighty would be with him. And here Jacob is receiving this promise that I am with thee, and I will keep thee in all places whither thou goest. But then he tells them this, and I will bring thee again into this land. I'll bring thee again into this land. And then he says this, for I will not leave thee until I have done that which I have spoken to thee of. These are encouraging promises. And I want you to think about Jacob in this situation, and I want you to think about his life up to this point, and all that we've studied, and all that we've seen. And again, as I mentioned by way of introduction, there's very little of any spiritual significance that's mentioned in the life of Jacob. I mean, we read of his birth, and then right after his birth, you read how he's swindling his brother out of his birthright, and then you read about the time in Gerar, and there's no reference whatsoever to Jacob. And then you read about his deception and his carnality in chapter 27, and how he takes the blessing, and so on and so forth. And there's really nothing of any significance from a spiritual perspective. And now God Almighty has appeared to him, and God has spoken to him, and God is revealing himself. He says, I am the Lord God of Abraham thy father, as he begins speaking to him in verse number 13, and how that sets the record straight and helps Jacob to understand all of what he's experiencing in this moment. And God gives him these encouraging promises, and it's God who is the eternal God that is able to make these kind of promises, that's able to say to Jacob that, I will not leave thee until I have done that which I have spoken to thee of. And it reveals, it reminds us of the power of God to accomplish his purpose and his will in our lives. I'm so thankful this evening that God has a purpose and a will for your life and for my life. We find that the Word of God tells in the book of Philippians that he's begun a good work in us, but he's going to continue it until the day of Jesus Christ and how precious that is. And it's interesting because Paul says it this way under the inspirational Holy Spirit of God, being confident of this thing, having the confidence to know that God is working and moving in our lives and that he has a purpose for everything that we deal with. He's growing us. He's developing us. And we find here that God Almighty gives these promises to Jacob. And we think about the point where we are here at this passage of Scripture in the life of Jacob and you, yes, his departure, but now his dream, and how he would respond and how this would impact his life. And I believe that it had a profound impact in the life of Jacob, as we will see in the next verses of Scripture that we'll look to. And we see that in these verses of Scripture that it's so well laid out as to how impactful this was in the life of Jacob. You remember the day in your life when you met the Lord, you understood who he was, and you understood his plan for your life after your salvation and understanding how he loved you and the promises. And here we find that Jacob has this time with the Lord and his, really, I would use the terminology from a New Testament perspective, his conversion here in this passage of Scripture. As you continue and we focus our attention on verses 16 through 22, I want you to notice his declarations. His departure, his dream, and his declarations. Really, four things in which I've noted as I've looked at these verses of Scripture to deal with what it is that he, Jacob, declares. First of all, I want you to notice what he says in verse 16, and Jacob awaked out of his sleep and he said, notice what he said, \"'Surely the Lord is in this place, and I knew it not.'\" Now think about that. He said, the Lord is in this place, Jehovah God. And he recognized, remember, as he went to that place, as he lighted upon a certain place, according to verse number 11, I don't think he really thought of any significance of the place where he lay. I don't think there was anything, really, that he anticipated happening. He was on a journey. He was heading towards Haran. He was following the direction of his... father, no doubt there were various levels of emotions that Jacob would have been dealing with. He's leaving his home, he's leaving all that he knows, he's leaving not only the security of his home and the people that he's close with, his mother, and so on and so forth. He's got on his mind, no doubt, the thought of Esau's hatred and all of those things that are happening and all of the emotions that take place, and he takes his journey. He's wearied, he's going to sleep, I don't think he anticipates anything taking place as we see here where he says, surely the Lord is in this place, and I knew it not. Surely the Lord is in this place. Man, this was impactful in the life of Jacob, but I want you to notice what he continues to say. It says that here in verse 17, he was afraid and said, how dreadful is this place. This is none other but the house of God, and this is the gate of heaven. I want you to consider with me his response when it says that he was afraid and said, how dreadful is this place. The reality is that when you consider being in the presence of God and you understand how awesome he is and how wonderful he is, that we respond in a response of reverence, a response of awe. We understand that he is God. And here the Bible tells us that he says, this is none other but the house of God, and this is the gate of heaven. This is that second declaration that this is the house of God. Notice what he does because of what he had recognized. In verse number 18, it says that he rose up early in the morning. Now there's a note there for us to understand the urgency in which he was operating, that he rose early in the morning. This was an immediate response. He wasn't going to just kind of lay around and think about it and muse upon it. He had this dream, God had spoken to him, and now he's going to respond. He rises up early. Notice it says in verse 18 that he took the stone that he had put for his pillows and he set it up for a pillar and poured oil upon the top of it, a process of consecration. We notice that in verse number 18, he pours that oil upon the top of it in this act of consecration, and he's understanding that this is the house of God. This is the place. Remember, he made that declaration in verse number 16, surely the Lord is in this place, and I knew it not. In verse number 19, he calls the place Bethel. Notice what he says, and he called the name of that place Bethel, but the name of the city was called Luz at the first. So he gives this name of this place Bethel, this place where he set up this pillar, this place in which he's poured the oil on top of the pillar, the place in which he's referred to as being the house of God. In fact, the word Bethel literally means house of God. You see the impact that this event has had in the life of Jacob. You see the way in which he's responding to what he's experienced, and you see how that he's immediately taking action and the changes. We don't see this type of behavior in the life of Jacob prior to this, do we? You don't see this kind of behavior in the life of Jacob. As we've studied the previous chapters, as we've studied the life of Jacob and the little bit that God has given us, and especially in chapter 27 with so much provided to us about the life of Jacob, you see no types of responses like this. You see no recognition of God being God and what His plan and His purpose is, and we find that Jacob is now responding and behaving in a different way. He's a changed man because of what he experienced. We think about this change and how it's evidenced through these declarations and through his behavior, and no doubt when we think about our lives and we think about our conversion and we think about the day in which we met the Lord Jesus Christ, there's some changes in our life. Amen? I'm not the person I used to be. Aren't you glad that you're not the person you used to be? Man, we sing the song with the kids and we talk about there's been a great change since I've been born again, and we talk about the things that I used to do, I don't do them anymore, the places I used to go, I don't go there anymore, the things I used to say. We sing all of those and we deal with all of that. Why? Because there's been a great change since I've been born again. Do you not see in the behavior of Jacob that there's a change? He's a changed man. We think about this change and we think about these declarations, we find that he understands that he's in the place of God, that this is the house of God. He sets up this pillar, and then notice that he vows a vow, he makes a vow, and really there's multiple aspects of it in verses 20-22, but I want you to notice what he says and how he's responding and how his response, again, gives further evidence to the change in his life. The Bible says that Jacob vowed a vow saying, if God will be with me and will keep me in this way that I go and will give me bread to eat and raiment to put on so that I come again to my father's house in peace, then shall the Lord be my God. Now, I want to break this down for you in verse 20 and 21, and I want you to understand something that's very significant and very important as we seek to interpret this passage of Scripture. In verse number 20, when Jacob vowed a vow and he said, if, that word, if, is different than how we typically use the word, if. That word, if, is, in what you just said, it's since. The idea, the understanding is that Jacob is saying, since God will be with me. He's not saying, he's not laying out there and says, okay, well, if God is going to do all of these things, then I will do this. He's not wheeling and dealing with God. There's some people that kind of have that approach in life. There's some people that kind of, God, if you get me out of this, then I'll do that, and if you do this for me, then I'll do this. That's not how God works. It's not a barter system. It's just not how it works with God, amen? And we find that here, Jacob is not using the word as we often use it in our today's language. In fact, when you study through the Old Testament and the Hebrew language in particular, this word, if, it carries with it, and actually through context, you can easily determine if it's meaning if, as in if something's going to happen or if this happens, or if it's carrying it with that idea of since. In fact, in the New Testament, it's the same way. You remember in the passage of Scripture in 1 Thessalonians 4. Let me just quickly go there for you, and I'll just give you this side note, not really part of the message, but hopefully it'll be a blessing to you. 1 Thessalonians chapter number 4, and we see this in the New Testament as well, where he uses this terminology, and we find that he's given the great promise with regard to the return of the Lord, and he says in verse number 13, but I would not have you to be ignorant, brethren, 1 Thessalonians 4 and verse 13, concerning them which are asleep, that ye sorrow not even as others which have no hope, for if we believe that Jesus died and rose again, even so them also which sleep in Jesus will God bring with him. That word if, in verse number 14, is since. Since we believe that Jesus died and rose again. He's not saying if we believe this. It's already been understood that they believe this truth, right? Paul's not now wavering at some level. The church in Thessalonica is not wavering at some level with regard to the death and burial and resurrection of Jesus Christ, but he's saying since we believe this, based upon our belief, understanding this great truth, here's how it impacts us, and so Jacob is using the word in that sense, and it says, if God, since God will be with me. Now where do you get this idea? Verse number 15, right? Remember the promises that God gave him? Remember we mentioned that dream, what he saw, but we mentioned specifically what he heard, and the significance of what Jacob heard God say, and as God is speaking to him, and God speaks to him about a seed and about a land, but God speaks to him about his own life, and he tells him that Jacob, I'm going to be with thee, and I will keep thee in all places where thou goest, and now Jacob is saying, as he vows this vow to the Lord, he says, since God will be with me, and since he will keep me in this way that I go, and he will give me bread to eat and raiment to put on, listen, our God's a good God. He takes good care of us, and Jacob has been impacted by what he heard God say. Listen, I would say it this way for us as New Testament believers, he had faith in what God said. Amen? He believed that God said to him, I will be with thee, and Jacob said, I believe that. I believe that God made this promise to me, and I'm trusting the faithful God. And that's precious. He's going out, now, from the best of our knowledge as we look at the biblical history, we know that he's been turned in the direction in which he's to go, he's been given that instruction by Isaac, and he knows the home in which he's going to go, but as best as we know, he doesn't even know his uncle. There's no record of any family reunions that took place that we read of, and he's going out, but God says, I'm going to be with you, and I'm going to provide for you. I'm going to not leave you. I'm going to... fulfill my purpose in you.\" And Jacob believes God. He has faith in what God said. The Bible says that he continues and he says, so that I come again in verse number 21, to my father's house in peace. Now, notice what he says at the end of verse number 21, then shall the Lord be my God. I want you to think about the personal nature of this. Because when God first speaks to him in verse number 13, he says, I am the Lord God of Abraham my father and the God of Isaac. We know that Abraham's his grandfather. The Word of God uses that phraseology often and it's, there's no error, there's no discrepancy. But God, Jehovah, he was Isaac's God, he was Abraham's God. And we find that now Jacob is making this great declaration and he's acknowledging the fact that the Lord is going to be my God. You know how important it is for every individual to come to the place where they acknowledge that he's my God? I know it seems maybe a little bit basic and elementary, but the reality is that God has no grandchildren. He only has children. Amen? And I understand for you grandparents out there, you love grandchildren, you think grandchildren are wonderful and all of the blessings of grandchildren, and I get it, but the reality is that God has no grandchildren. He only has children. And there has to come a point in your life when your parents' God is your God. There comes a point in our lives where it's no longer that it's just the God of my father, it's not just the the God of my mother, but we find that it's my God and that I have a personal relationship with the God of heaven. It's so important. We find that no doubt it's beneficial for us, it's helpful for us to be in a place, in a position in which we have the influence of godly people in our lives and we have the understanding that there are people that come into our lives and they have this influence in our lives and they help us in our walk with God and they help us to to be what we're to be in the Lord and in all of that influence, but the reality is that there's some point in our lives where it must be that this God is my God. Joshua brings the people to a place of decision. He says, ask for me in my house, we will serve the Lord. But the decision is for you, nation of Israel. How are you going to respond? What are you going to do? And we know that the Bible tells us and teaches us that they respond and they make the declaration, they make the decision that they too would serve the Lord God. But we find that as we look throughout the Word of God, I often think of this particular example in 2nd Chronicles 24. If you want to turn there just for a moment and look at this passage and we can see this over in Kings as well, but here in 2nd Chronicles chapter number 24 and I just want to draw your attention very quickly to a couple of points within this passage of Scripture and I want you to think this evening of the significance of Jacob making this statement that he no longer is just the God of Abraham and Isaac but he's my God, the Lord Jehovah, he's my God. Here in 2nd Chronicles 24 we read of Joash and he's going to be the king and the Bible tells us about Jehoiada who was the priest and Jehoiada was very influential in the life of Joash. In fact the Bible tells us that as long as Jehoiada was living that Joash did the right thing and he served and he followed the Lord so on and so forth but I want to draw your attention to 2nd Chronicles 24 and verse 15 for the Bible says that Jehoiada waxed old and was full of days when he died. There's gonna come a time when that mentor, that influencer in your life is going to go home to be with the Lord and that personal relationship that we have with God is of such importance because when Jehoiada is off the scene when he dies, now what does that do to Joash? Where is his place? What is his walk with God? That's why I try to teach these young people to walk with God. That's why we're passing out these prayer lists on Wednesday evening and listing out the names of the kids in the nursery, the kids in the children's ministry, the teenagers this Wednesday and we're listing those young people. We want to pray that they get saved at a young age and that they learn to walk with God. They learn to develop that relationship, that fellowship with God. Notice in verse 17 it says, Now after the death of Jehoiada came the princes of Judah and made obeisance to the king. Then the king hearkened unto them, listen, they came with flattery and they sought to influence Joash. His mentor was now gone and it was it becomes obvious, abundantly clear that he had no real walk with God personally. In fact, the Bible tells us that in verse number 21, they conspired against him and stoned him with stones at the commandment of the king in the court of the house of the Lord. You know who they they stoned here? They stoned Zechariah. According to verse number 20, he came and he spoke against what was happening and talked about how they were forsaking the Lord and Zechariah was the son of Jehoiada. And Joash says stone him. The importance of having that walk with God. While Jehoiada was alive, Joash did right, but Jehoiada died. And here in Genesis chapter 28, as Jacob is responding and declaring the change, he vows this vow and he says, I understand that God has made this promise, these promises to me and I trust God, I believe God, I believe that he's going to do it and the Lord, he's my God. How powerful that is. Notice in verse number 22, back in Genesis chapter 28, as we clean up or finish up this passage of scripture, he refers to the stone, which of course, if you go back in verse number 11, it was the stones that he had set up for pillows. You look at verse number 18, it's the stone that he now uses as a pillar and poured oil upon it and he says, this stone, which I have set for a pillar, shall be God's house. No longer is Jacob just out looking for himself. Up to this point in Jacob's life, who was he most concerned for? Himself, right? Esau comes and he's hungry. He'd been out, he's fainting. What's Jacob looking for? I'll give you some pottage, you give me the birthright, right? Chapter 27, what's Jacob trying to get? He's trying to get a blessing. Who's he looking for? Himself. Remember, when Rebecca says, here's what our plan's going to be, here's what you're going to do, he wasn't concerned with the plan not being right, he was concerned about getting caught, right? But now all of a sudden, the evidence of the change in the life of Jacob, he now declares that this pillar that I've set up, this shall be God's house. Now notice the depth of what he reveals in this final statement of verse number 22. It says this, and of all that thou shalt give me, now I know there's no punctuation there but I want you to just stop there just for a moment, and of all that thou shalt give me, you understand that he is the giver of all things. You understand that this evening? Everything that we have is because of the good hand of God. Amen? Everything that we have. You say, well you don't understand pastor, I have this really good mind and I was able to go to school and get these... Who gave you that mind? You know about Nebuchadnezzar? He was pretty powerful, wasn't he? He was the king of Babylon, the most powerful empire at that time, the world empire. He was the king, had all the power. In fact, it's obvious when Shadrach, Meshach, and Abednego decide that they're not gonna bow down, they're gonna stand in courageous... and stand in defiance with courage against that mandate that had been given by Nebuchadnezzar, and they stand courageously. And he says, who is that God that shall deliver you out of my hand? And then he found out who that God was. What happened to Nebuchadnezzar? God gave him over. He was like an animal out in the field, right? We must recognize this evening that everything that we have is because of the good hand of God. Every good gift, right? James 1 verse 17, it comes from where? It comes from above. It comes from God. Our God is good. And Jacob is acknowledging some powerful truth here. that is important for every child of God to recognize. In fact, later on, as God is preparing the children of Israel for entrance into the land and he's using Moses to give them instruction, God reminds them of this. God reminds them of this in Deuteronomy 8, in verse number 18, it says, \"'But thou shalt remember the Lord thy God, \"'for it is he that giveth thee power to get wealth, \"'that he may establish his covenant, \"'which he sware unto thy fathers, as it is this day.'\" And so he says, listen, Moses is given this instruction, we have to recognize that it's God that gives us the power to get this wealth. You use that terminology, you've heard it, no doubt, where people talk about being a self-made man, there's no such thing. There really isn't. We find that God, in his grace and his mercy, and he would give us the abilities that he gives us and how important that we find this evening, this statement of Jacob when he says, \"'Of all that thou shalt give me,' recognizing that it's God that is the one that gives. This God that is the one that blesses. Jacob is finally, I believe, coming to a place where he's understanding it's no longer needful. We've said this multiple times in the last several chapters, living by faith does not require scheming. He's coming to this place where he's recognizing that God is the giver. And he says, \"'Of all that thou shalt give me,' notice what he says, \"'I will surely give the 10th unto thee.'\" I will surely give the 10th unto thee. And so we find that he recognizes that the Lord is the giver of all things and he's committed to giving a tithe, as we'd understand, a 10th unto thee. And he's committed to that and he's recognizing the significance and the importance of that and really the blessing of that. This is pre-law. So many people wanna argue, even as I mentioned this morning, with miracles. They wanna dismiss and argue about miracles and try to explain away. And people that wanna try to get out of giving a tithe, they try to explain away, \"'Well, we're not under the law,' and so on and so forth. \"'Abraham gave of the tithe, Jacob's committing to it.'\" It's not necessarily just part of the law. Giving to God is a blessing, is an absolute blessing. By the way, you could never out-give God. Somebody said this. Letourneau actually was the one that said it. And he had actually suffered some really difficult days leading up into the Great Depression in the 1930s. And he was a Christian man. Many people had encouraged him to file bankruptcy and so on and so forth, but he was committed to doing the right thing and to having integrity and to paying his bills and so on and so forth. And he was committed to giving to God. And here's what Letourneau said. He said, when I think about giving to God, your perspective has to be this. It's not how much of my money I give to God, but it's how much of God's money I keep for myself. That's a different way to think about it. I like that. By the way, Letourneau was famously known for giving 90% to God and keeping 10% for himself. I'm not suggesting anyone do that. You better pray about it, amen? You start doing that and you can't pay your electric bill and you're gonna call me, amen? But the reality is that, man, that's what a great perspective. It's not how much of my money I give God, but how much of God's money I keep for myself. Why? Because I'm recognizing that God, He gives me all of this. He's been so good to me. I want you to think about this in 1 Chronicles 29, and we'll finish here. The life of David near the end of his life. And I don't have time to look at all of this that the hour's gone, I need to wrap up the message, but I want you to see here in 1 Chronicles 29, perhaps you'd like to go back and read it later this evening, this week, make a note to read this passage. It's just fabulous, the response of David and the people with the ability to give to the work of God. David is giving to a work that he'd never see fulfilled. He'd never see the temple completed. He'd never worship God in the temple, but yet he's giving and he's preparing and he's offering willingly. And I want you to see that they're rejoicing greatly because of the opportunity to give. In fact, it says in verse number nine, then the people rejoiced, why? For that they offered willingly, because with perfect heart, they offered willingly to the Lord. And David the king also rejoiced, how? With great joy. Why could they rejoice at the giving? Why could they rejoice in the manner in which they did? Well, it's because of their perspective. Notice in verse number 14, it says, but who am I and what is my people that we should be able to offer so willingly after this sort? For all things come of thee and of thine own have we given thee. Man, we change our perspective and it really changes our entire outlook, does it not? And here, Jacob, a man who is known for, as we've studied his life, he's known for me and myself and how can I benefit and how can I get and how can I, in this situation, how can I benefit the most? But then he meets the Lord personally. He departed, had a dream, and in that dream, he saw a vision, but more than seeing a vision, he heard a voice. And he heard the voice of God. And God gave him some promise with regard to the Abrahamic covenant and with regard to the land and the seed, but God spoke about his life personally in verse number 15. And all that God said he would do for Jacob. And Jacob responded and he made some declarations and through his response and through these declarations, we see that he's a changed individual. And he concludes by saying, of all that thou shalt give me, I will surely give the 10th unto thee. He understood that God had given him some encouraging promises. And he said, the Lord shall be my God. The Lord shall be my God. And here's how I'm gonna worship him. Here's how I'm gonna serve him. This evening, I'm so thankful that God revealed himself to me. Aren't you glad that God revealed himself to you? Man, that we can know him, we can have that relationship with him. But how's it impact us? How does it change our behavior? How does it change our outlook? How does it change our perspective in life? Because when we know him and we know his promises, it's going to have an impact in our lives. It's gonna change us. Father, we love you. We thank you for loving us. We thank you for the change in Jacob's life. Up to this point, we've seen very little of anything spiritual. But now we see a changed man making some powerful declarations, commitments. God, I pray this evening that you'd help us to really evaluate and consider tonight the wonderful promises that you've given to us and how we respond to those promises, how we determine to live in obedience to you and to your word, how we become more concerned about your kingdom than my life. Just a few weeks ago, the teenager sang a powerful song about living their lives in such a way that you would be glorified and not looking for recognition or name or type of recognition here upon this earth, but living for you, Lord. God, I pray that even as we see that in Jacob's life in these last verses of Scripture, that it would be seen in our lives. It's about you, Lord. As John the Baptist said of the Lord Jesus Christ, he must increase, I must decrease. Help us to recognize that you're the giver of all things. Help us to be faithful and obedient to you and to your word, to rejoice in the privilege and opportunity that we have to give to you. I pray that you'd move and work as only you can and we'll thank you for it. In Christ's name we pray. Would you stand with me?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.039999961853027,
      "text": " evening, Genesis chapter number 28, Genesis chapter number 28 tonight, and we'll finish"
    },
    {
      "id": 1,
      "start": 5.039999961853027,
      "end": 6.079999923706055,
      "text": " this chapter."
    },
    {
      "id": 2,
      "start": 6.079999923706055,
      "end": 11.359999656677246,
      "text": " We started last Sunday evening looking at the first nine verses of Genesis chapter 28"
    },
    {
      "id": 3,
      "start": 11.359999656677246,
      "end": 14.640000343322754,
      "text": " and be looking at verses 10 through 22 this evening."
    },
    {
      "id": 4,
      "start": 14.640000343322754,
      "end": 18.719999313354492,
      "text": " And we've noted, of course, as we've studied through these last several chapters of the"
    },
    {
      "id": 5,
      "start": 18.719999313354492,
      "end": 22.440000534057617,
      "text": " book of Genesis, things with regard to the life of Jacob."
    },
    {
      "id": 6,
      "start": 22.440000534057617,
      "end": 27.84000015258789,
      "text": " And now the focus, of course, had shifted from Abraham to Isaac, and now it's going"
    },
    {
      "id": 7,
      "start": 27.84000015258789,
      "end": 32.79999923706055,
      "text": " to shift from Isaac to Jacob, and begin to follow his life over the next several chapters"
    },
    {
      "id": 8,
      "start": 32.79999923706055,
      "end": 35.040000915527344,
      "text": " and look at all that takes place."
    },
    {
      "id": 9,
      "start": 35.040000915527344,
      "end": 39.84000015258789,
      "text": " In fact, his death, of course, recorded near the end of the book of Genesis."
    },
    {
      "id": 10,
      "start": 39.84000015258789,
      "end": 43.84000015258789,
      "text": " And as we look at the passage of Scripture this evening and looking at the life of Jacob,"
    },
    {
      "id": 11,
      "start": 43.84000015258789,
      "end": 48.040000915527344,
      "text": " of course, I mentioned this even this morning, that the events previously recorded to this"
    },
    {
      "id": 12,
      "start": 48.040000915527344,
      "end": 53.0,
      "text": " passage of Scripture have resulted in Jacob, of course, leaving home, being instructed"
    },
    {
      "id": 13,
      "start": 53.0,
      "end": 54.52000045776367,
      "text": " to do so."
    },
    {
      "id": 14,
      "start": 54.52000045776367,
      "end": 58.36000061035156,
      "text": " And he's received that instruction in our previous text of Scripture."
    },
    {
      "id": 15,
      "start": 58.36000061035156,
      "end": 63.36000061035156,
      "text": " But it's interesting because really up to this point in the life of Jacob, there's really"
    },
    {
      "id": 16,
      "start": 63.36000061035156,
      "end": 69.55999755859375,
      "text": " nothing of any significance in his life with regard to spiritual aspect, right?"
    },
    {
      "id": 17,
      "start": 69.55999755859375,
      "end": 75.5199966430664,
      "text": " The spiritual aspect in Jacob's life, there's really nothing of significance in the Scriptures."
    },
    {
      "id": 18,
      "start": 75.5199966430664,
      "end": 79.91999816894531,
      "text": " It was in the 25th chapter of the book of Genesis that we read of the birth of Jacob."
    },
    {
      "id": 19,
      "start": 80.31999969482422,
      "end": 84.91999816894531,
      "text": " It was in the 25th chapter at the end of the chapter that we read how that he obtained"
    },
    {
      "id": 20,
      "start": 84.91999816894531,
      "end": 85.91999816894531,
      "text": " Esau's birthright."
    },
    {
      "id": 21,
      "start": 85.91999816894531,
      "end": 90.23999786376953,
      "text": " It was in chapter number 26 where the family is in Gerar."
    },
    {
      "id": 22,
      "start": 90.23999786376953,
      "end": 93.08000183105469,
      "text": " Remember, there was a famine."
    },
    {
      "id": 23,
      "start": 93.08000183105469,
      "end": 98.27999877929688,
      "text": " And it's interesting because all of the chapter, chapter number 26, there's not one reference"
    },
    {
      "id": 24,
      "start": 98.27999877929688,
      "end": 101.16000366210938,
      "text": " to Jacob in the entire chapter."
    },
    {
      "id": 25,
      "start": 101.16000366210938,
      "end": 107.23999786376953,
      "text": " And much there about Isaac and all that takes place and the interactions with the Philistines"
    },
    {
      "id": 26,
      "start": 107.23999786376953,
      "end": 108.23999786376953,
      "text": " and what have you."
    },
    {
      "id": 27,
      "start": 108.23999786376953,
      "end": 111.12000274658203,
      "text": " So there's nothing that is specifically mentioned about Jacob."
    },
    {
      "id": 28,
      "start": 111.12000274658203,
      "end": 116.04000091552734,
      "text": " And then of course, as we've studied chapter number 27 over the last several Sunday evenings,"
    },
    {
      "id": 29,
      "start": 116.04000091552734,
      "end": 121.44000244140625,
      "text": " we've had the opportunity to see that it was in that chapter where there's much deception"
    },
    {
      "id": 30,
      "start": 121.44000244140625,
      "end": 123.5999984741211,
      "text": " and carnality on the part of Jacob."
    },
    {
      "id": 31,
      "start": 123.5999984741211,
      "end": 125.72000122070312,
      "text": " We come to Genesis chapter 28."
    },
    {
      "id": 32,
      "start": 125.72000122070312,
      "end": 130.0399932861328,
      "text": " We read how that as we studied last week that Isaac called Jacob, he blessed him, and he"
    },
    {
      "id": 33,
      "start": 130.0399932861328,
      "end": 131.0399932861328,
      "text": " charged him."
    },
    {
      "id": 34,
      "start": 131.0399932861328,
      "end": 136.52000427246094,
      "text": " It's interesting because God records for us that as Jacob is receiving this charge from"
    },
    {
      "id": 35,
      "start": 136.52000427246094,
      "end": 142.1999969482422,
      "text": " Isaac in verse number three, it says, and God Almighty bless thee and make thee fruitful."
    },
    {
      "id": 36,
      "start": 142.1999969482422,
      "end": 143.36000061035156,
      "text": " It's interesting."
    },
    {
      "id": 37,
      "start": 143.36000061035156,
      "end": 147.75999450683594,
      "text": " That's the God's name, El Shaddai, the Lord God Almighty."
    },
    {
      "id": 38,
      "start": 147.75999450683594,
      "end": 153.55999755859375,
      "text": " And of course, God had revealed himself to Abraham and as being El Shaddai back in Genesis"
    },
    {
      "id": 39,
      "start": 153.55999755859375,
      "end": 154.55999755859375,
      "text": " chapter number 17."
    },
    {
      "id": 40,
      "start": 154.55999755859375,
      "end": 161.0399932861328,
      "text": " And so it's interesting that God uses Isaac to give this charge to Jacob and he hears"
    },
    {
      "id": 41,
      "start": 161.0399932861328,
      "end": 162.3000030517578,
      "text": " those words."
    },
    {
      "id": 42,
      "start": 162.3000030517578,
      "end": 165.52000427246094,
      "text": " He speaks to him about a blessing, but we find that as we pick it up this evening in"
    },
    {
      "id": 43,
      "start": 165.52000427246094,
      "end": 169.63999938964844,
      "text": " verse number 10, the Bible says that Jacob went out from Beersheba and he went toward"
    },
    {
      "id": 44,
      "start": 169.63999938964844,
      "end": 174.0399932861328,
      "text": " Haran and he lighted upon a certain place and tarried there all night because the sun"
    },
    {
      "id": 45,
      "start": 174.0399932861328,
      "end": 175.0399932861328,
      "text": " was set."
    },
    {
      "id": 46,
      "start": 175.0399932861328,
      "end": 178.55999755859375,
      "text": " And he took the stones of that place and put them for his pillows and lay down in that"
    },
    {
      "id": 47,
      "start": 178.55999755859375,
      "end": 180.47999572753906,
      "text": " place to sleep."
    },
    {
      "id": 48,
      "start": 180.47999572753906,
      "end": 184.47999572753906,
      "text": " It says in verse number 12 that he dreamed and behold, a ladder set up on the earth and"
    },
    {
      "id": 49,
      "start": 184.47999572753906,
      "end": 186.9199981689453,
      "text": " the top of it reached to heaven."
    },
    {
      "id": 50,
      "start": 186.9199981689453,
      "end": 189.75999450683594,
      "text": " Behold the angels of God ascending and descending on it."
    },
    {
      "id": 51,
      "start": 189.75999450683594,
      "end": 195.44000244140625,
      "text": " And behold, the Lord stood above it and said, and we're going to look at all that he said"
    },
    {
      "id": 52,
      "start": 196.36000061035156,
      "end": 199.75999450683594,
      "text": " I'm going to pause there and give you the title for the message we'll dig in tonight."
    },
    {
      "id": 53,
      "start": 199.75999450683594,
      "end": 202.0399932861328,
      "text": " The Lord spoke to Jacob."
    },
    {
      "id": 54,
      "start": 202.0399932861328,
      "end": 205.10000610351562,
      "text": " What a blessing to think about God speaking to his people."
    },
    {
      "id": 55,
      "start": 205.10000610351562,
      "end": 209.39999389648438,
      "text": " What a blessing to consider this evening that we have the written Word of God, the complete"
    },
    {
      "id": 56,
      "start": 209.39999389648438,
      "end": 216.0,
      "text": " Word of God, the whole canon of Scripture and that God uses his Word in our lives."
    },
    {
      "id": 57,
      "start": 216.0,
      "end": 217.72000122070312,
      "text": " God speaks to us through his Word."
    },
    {
      "id": 58,
      "start": 217.72000122070312,
      "end": 221.8000030517578,
      "text": " We understand that Jacob did not have a Bible as we have a Bible."
    },
    {
      "id": 59,
      "start": 221.8000030517578,
      "end": 225.67999267578125,
      "text": " The Lord speaks to Jacob and I'm thankful that every time that I open the pages of this"
    },
    {
      "id": 60,
      "start": 225.67999267578125,
      "end": 229.0800018310547,
      "text": " precious book, that God Almighty speaks to me."
    },
    {
      "id": 61,
      "start": 229.0800018310547,
      "end": 230.0800018310547,
      "text": " That's wonderful."
    },
    {
      "id": 62,
      "start": 230.0800018310547,
      "end": 231.0800018310547,
      "text": " It's precious."
    },
    {
      "id": 63,
      "start": 231.0800018310547,
      "end": 233.8000030517578,
      "text": " I mentioned to somebody as they were leaving this morning, of course, I preached on prayer"
    },
    {
      "id": 64,
      "start": 233.8000030517578,
      "end": 238.1199951171875,
      "text": " this morning and we just had a brief conversation with someone as they were leaving."
    },
    {
      "id": 65,
      "start": 238.1199951171875,
      "end": 244.0399932861328,
      "text": " And I said, you know, the reality is at least I will be very transparent with you this evening."
    },
    {
      "id": 66,
      "start": 244.0399932861328,
      "end": 247.63999938964844,
      "text": " It is easier for me, that's what I said to the person at the back door this morning."
    },
    {
      "id": 67,
      "start": 247.63999938964844,
      "end": 252.55999755859375,
      "text": " It is much easier for me to read the Word of God than it is for me to pray."
    },
    {
      "id": 68,
      "start": 252.55999755859375,
      "end": 253.8000030517578,
      "text": " It's just the way it is in my life."
    },
    {
      "id": 69,
      "start": 253.8000030517578,
      "end": 254.8000030517578,
      "text": " I don't know."
    },
    {
      "id": 70,
      "start": 254.8000030517578,
      "end": 258.0,
      "text": " You might say it's easier for me to pray than it is to read."
    },
    {
      "id": 71,
      "start": 258.0,
      "end": 259.0,
      "text": " But I have no problem."
    },
    {
      "id": 72,
      "start": 259.0,
      "end": 261.1199951171875,
      "text": " I can sit down and read the Bible for an hour, for longer."
    },
    {
      "id": 73,
      "start": 261.1199951171875,
      "end": 262.2799987792969,
      "text": " I can just read and read."
    },
    {
      "id": 74,
      "start": 262.2799987792969,
      "end": 264.239990234375,
      "text": " I love reading the Bible."
    },
    {
      "id": 75,
      "start": 264.239990234375,
      "end": 267.0799865722656,
      "text": " But it just seems like every time you go to pray, there's just distraction."
    },
    {
      "id": 76,
      "start": 267.0799865722656,
      "end": 268.0799865722656,
      "text": " I pray."
    },
    {
      "id": 77,
      "start": 268.0799865722656,
      "end": 269.20001220703125,
      "text": " I'm not suggesting I don't pray."
    },
    {
      "id": 78,
      "start": 269.20001220703125,
      "end": 273.0,
      "text": " I'm saying that it's easier for me to read than it is for praying."
    },
    {
      "id": 79,
      "start": 273.0,
      "end": 274.67999267578125,
      "text": " It's more natural for me."
    },
    {
      "id": 80,
      "start": 274.67999267578125,
      "end": 277.1600036621094,
      "text": " Every time I open the Word of God, God speaks to me."
    },
    {
      "id": 81,
      "start": 277.1600036621094,
      "end": 278.1600036621094,
      "text": " And I love it."
    },
    {
      "id": 82,
      "start": 278.1600036621094,
      "end": 279.1600036621094,
      "text": " It's precious."
    },
    {
      "id": 83,
      "start": 279.1600036621094,
      "end": 284.67999267578125,
      "text": " And here in this passage of Scripture, the Bible tells us no longer is Jacob receiving"
    },
    {
      "id": 84,
      "start": 284.67999267578125,
      "end": 287.2799987792969,
      "text": " something from Isaac with regard to God."
    },
    {
      "id": 85,
      "start": 287.2799987792969,
      "end": 290.1600036621094,
      "text": " Now God is speaking directly to Jacob."
    },
    {
      "id": 86,
      "start": 290.1600036621094,
      "end": 291.239990234375,
      "text": " And that's exciting to me."
    },
    {
      "id": 87,
      "start": 291.239990234375,
      "end": 293.0,
      "text": " It's encouraging to me."
    },
    {
      "id": 88,
      "start": 293.0,
      "end": 299.0400085449219,
      "text": " And what a blessing to think about the truth of this passage of Scripture and to think"
    },
    {
      "id": 89,
      "start": 299.0400085449219,
      "end": 302.739990234375,
      "text": " about the way in which God reveals great truth to Jacob."
    },
    {
      "id": 90,
      "start": 302.739990234375,
      "end": 306.9800109863281,
      "text": " If you're taking notes this evening, notice in verses 10 and 11, as we begin looking through"
    },
    {
      "id": 91,
      "start": 306.9800109863281,
      "end": 308.70001220703125,
      "text": " this passage, his departure."
    },
    {
      "id": 92,
      "start": 308.70001220703125,
      "end": 311.5,
      "text": " Very quickly, not much that we'll discuss here."
    },
    {
      "id": 93,
      "start": 311.5,
      "end": 314.5,
      "text": " But I do want you to note that the Bible says that he went out from Beersheba and he went"
    },
    {
      "id": 94,
      "start": 314.5,
      "end": 315.739990234375,
      "text": " toward Haran."
    },
    {
      "id": 95,
      "start": 315.739990234375,
      "end": 318.6199951171875,
      "text": " Now Haran was the chief city of Paddan Aram."
    },
    {
      "id": 96,
      "start": 318.6199951171875,
      "end": 324.5799865722656,
      "text": " And according to verse number two of Genesis 28, he was instructed by his father Isaac"
    },
    {
      "id": 97,
      "start": 324.5799865722656,
      "end": 329.8599853515625,
      "text": " to go to Paddan Aram and to the house of Bethuel, thy mother's father, and take thee a wife"
    },
    {
      "id": 98,
      "start": 329.9800109863281,
      "end": 334.0199890136719,
      "text": " from then, so the daughters of Laban, thy mother's brother."
    },
    {
      "id": 99,
      "start": 334.0199890136719,
      "end": 337.1400146484375,
      "text": " And so we see that in verse number 10, that when the Bible tells us that he went out from"
    },
    {
      "id": 100,
      "start": 337.1400146484375,
      "end": 341.260009765625,
      "text": " Beersheba and he went toward Haran, that he went in obedience."
    },
    {
      "id": 101,
      "start": 341.260009765625,
      "end": 344.1400146484375,
      "text": " He followed the instruction that had been given."
    },
    {
      "id": 102,
      "start": 344.1400146484375,
      "end": 349.3800048828125,
      "text": " And what a blessing, because we find that it's very important where he finds himself"
    },
    {
      "id": 103,
      "start": 349.3800048828125,
      "end": 355.260009765625,
      "text": " here in this passage of Scripture and how God appears to him and God speaks to him."
    },
    {
      "id": 104,
      "start": 355.260009765625,
      "end": 360.3800048828125,
      "text": " And I find that that act of obedience that begins our portion of Scripture, our study"
    },
    {
      "id": 105,
      "start": 360.3800048828125,
      "end": 364.94000244140625,
      "text": " this evening, is of great significance and it's of great importance."
    },
    {
      "id": 106,
      "start": 364.94000244140625,
      "end": 367.8599853515625,
      "text": " We find that the Bible tells us that he alighted upon a certain place."
    },
    {
      "id": 107,
      "start": 367.8599853515625,
      "end": 370.9599914550781,
      "text": " He tarried there all night because the sun was set."
    },
    {
      "id": 108,
      "start": 370.9599914550781,
      "end": 375.05999755859375,
      "text": " It tells us that he took of the stones of that place and put them for his pillows and"
    },
    {
      "id": 109,
      "start": 375.05999755859375,
      "end": 378.5400085449219,
      "text": " he laid down in that place to sleep."
    },
    {
      "id": 110,
      "start": 378.5400085449219,
      "end": 384.17999267578125,
      "text": " And we find that his departure is recorded very quickly and we see that what notes that,"
    },
    {
      "id": 111,
      "start": 384.17999267578125,
      "end": 389.3800048828125,
      "text": " what's important about those verses is you note the obedience of Jacob."
    },
    {
      "id": 112,
      "start": 389.3800048828125,
      "end": 394.05999755859375,
      "text": " As we look at verses 12 down through verse number 15, I want you to capture with me and"
    },
    {
      "id": 113,
      "start": 394.05999755859375,
      "end": 395.67999267578125,
      "text": " look at the dream."
    },
    {
      "id": 114,
      "start": 395.67999267578125,
      "end": 398.2200012207031,
      "text": " We see his departure, but we see his dream."
    },
    {
      "id": 115,
      "start": 398.2200012207031,
      "end": 401.8800048828125,
      "text": " In verse number 12, we see what Jacob saw in this dream."
    },
    {
      "id": 116,
      "start": 401.8800048828125,
      "end": 406.82000732421875,
      "text": " The Bible says that he dreamed, and behold, a ladder set up on the earth, and the top"
    },
    {
      "id": 117,
      "start": 406.82000732421875,
      "end": 408.2200012207031,
      "text": " of it reached to heaven."
    },
    {
      "id": 118,
      "start": 408.2200012207031,
      "end": 411.5799865722656,
      "text": " Behold, the angels of God ascending and descending on it."
    },
    {
      "id": 119,
      "start": 411.5799865722656,
      "end": 418.82000732421875,
      "text": " So you see, as God would allow us by recorded, written word of God to allow us to see and"
    },
    {
      "id": 120,
      "start": 418.82000732421875,
      "end": 423.5400085449219,
      "text": " to hear, to understand what it was that Jacob dreamed in this passage of Scripture."
    },
    {
      "id": 121,
      "start": 423.5400085449219,
      "end": 427.5799865722656,
      "text": " And it's very interesting because the Bible says that he sees this ladder that was set"
    },
    {
      "id": 122,
      "start": 427.5799865722656,
      "end": 430.6199951171875,
      "text": " up on the earth, and it says that the top of it reached to heaven."
    },
    {
      "id": 123,
      "start": 430.6199951171875,
      "end": 436.29998779296875,
      "text": " And I want you to notice, the Bible says that the angels of God ascending and descending"
    },
    {
      "id": 124,
      "start": 436.29998779296875,
      "end": 438.739990234375,
      "text": " on it, on that ladder."
    },
    {
      "id": 125,
      "start": 438.739990234375,
      "end": 440.6600036621094,
      "text": " We find that this is what he saw."
    },
    {
      "id": 126,
      "start": 440.739990234375,
      "end": 444.5,
      "text": " So it's interesting, hold your place here, but turn to the book of John very quickly,"
    },
    {
      "id": 127,
      "start": 444.5,
      "end": 445.5,
      "text": " if you will."
    },
    {
      "id": 128,
      "start": 445.5,
      "end": 446.5,
      "text": " The gospel of John."
    },
    {
      "id": 129,
      "start": 446.5,
      "end": 450.4599914550781,
      "text": " And I want you to look in the first chapter of the gospel of John."
    },
    {
      "id": 130,
      "start": 450.4599914550781,
      "end": 455.70001220703125,
      "text": " And you look in this first chapter, and remember, it was John the Baptist that spoke about Jesus"
    },
    {
      "id": 131,
      "start": 455.70001220703125,
      "end": 460.29998779296875,
      "text": " Christ being the Lamb of God, according to verse number 36."
    },
    {
      "id": 132,
      "start": 460.29998779296875,
      "end": 465.5199890136719,
      "text": " And the Bible tells us that there were some that followed after Jesus, and there's some"
    },
    {
      "id": 133,
      "start": 465.5199890136719,
      "end": 467.70001220703125,
      "text": " interaction that takes place."
    },
    {
      "id": 134,
      "start": 467.70001220703125,
      "end": 470.6600036621094,
      "text": " Remember, Jesus asked them, what seek ye?"
    },
    {
      "id": 135,
      "start": 470.6600036621094,
      "end": 476.17999267578125,
      "text": " And they told him in verse number 38 that they said unto him, where dwellest thou?"
    },
    {
      "id": 136,
      "start": 476.17999267578125,
      "end": 478.5799865722656,
      "text": " And he said to them in verse 39, come and see."
    },
    {
      "id": 137,
      "start": 478.5799865722656,
      "end": 484.9599914550781,
      "text": " And we find that there's reference here with regard to Andrew and Simon Peter."
    },
    {
      "id": 138,
      "start": 484.9599914550781,
      "end": 486.5199890136719,
      "text": " But skip down, if you will."
    },
    {
      "id": 139,
      "start": 486.5199890136719,
      "end": 491.5,
      "text": " And I want you to notice in verse number 46, it says, in Nathanael, let me say in verse"
    },
    {
      "id": 140,
      "start": 491.5,
      "end": 496.9800109863281,
      "text": " 45, because Philip findeth Nathanael and saith unto him, we have found him of whom Moses"
    },
    {
      "id": 141,
      "start": 496.9800109863281,
      "end": 502.4200134277344,
      "text": " and the law and the prophets did write, Jesus of Nazareth, the son of Joseph."
    },
    {
      "id": 142,
      "start": 502.4200134277344,
      "end": 505.9800109863281,
      "text": " Nathanael said unto him, can any good thing come out of Nazareth?"
    },
    {
      "id": 143,
      "start": 505.9800109863281,
      "end": 508.8999938964844,
      "text": " Philip saith unto him, come and see."
    },
    {
      "id": 144,
      "start": 508.8999938964844,
      "end": 514.780029296875,
      "text": " Jesus saw Nathanael coming to him and saith unto him, verse 47, behold, an Israelite indeed"
    },
    {
      "id": 145,
      "start": 514.780029296875,
      "end": 517.02001953125,
      "text": " in whom is no guile."
    },
    {
      "id": 146,
      "start": 517.02001953125,
      "end": 519.5,
      "text": " Nathanael said unto him, whence knowest thou me?"
    },
    {
      "id": 147,
      "start": 519.5,
      "end": 523.780029296875,
      "text": " Jesus answered and said unto him, before that Philip called thee, when thou wast under the"
    },
    {
      "id": 148,
      "start": 523.780029296875,
      "end": 525.3400268554688,
      "text": " fig tree, I saw thee."
    },
    {
      "id": 149,
      "start": 525.3400268554688,
      "end": 527.739990234375,
      "text": " That's how Nathanael answers in verse 49."
    },
    {
      "id": 150,
      "start": 527.739990234375,
      "end": 533.260009765625,
      "text": " He answers and says, Rabbi, thou art the Son of God."
    },
    {
      "id": 151,
      "start": 533.260009765625,
      "end": 536.219970703125,
      "text": " Thou art the King of Israel."
    },
    {
      "id": 152,
      "start": 536.219970703125,
      "end": 540.3800048828125,
      "text": " Jesus answers, and I want you to see what he says here in verse 50, and especially in"
    },
    {
      "id": 153,
      "start": 540.3800048828125,
      "end": 544.4600219726562,
      "text": " verse number 51 as it pertains to this dream that Jacob had."
    },
    {
      "id": 154,
      "start": 544.4600219726562,
      "end": 548.219970703125,
      "text": " In verse number 50, Jesus answered unto him, because I said unto thee, I saw thee under"
    },
    {
      "id": 155,
      "start": 548.219970703125,
      "end": 550.97998046875,
      "text": " the fig tree, believest thou?"
    },
    {
      "id": 156,
      "start": 550.97998046875,
      "end": 555.6599731445312,
      "text": " Thou shalt see greater things than these, and he saith unto him, verily, verily, of"
    },
    {
      "id": 157,
      "start": 555.6599731445312,
      "end": 563.5800170898438,
      "text": " a truth of a truth, I say unto you, hereafter ye shall see heaven open, and the angels of"
    },
    {
      "id": 158,
      "start": 563.5800170898438,
      "end": 571.2999877929688,
      "text": " God ascending and descending upon the Son of Man."
    },
    {
      "id": 159,
      "start": 571.2999877929688,
      "end": 577.6199951171875,
      "text": " That ladder that Jacob saw in our passage of Scripture in Genesis 28, that's no other"
    },
    {
      "id": 160,
      "start": 577.6199951171875,
      "end": 578.780029296875,
      "text": " than Jesus Christ."
    },
    {
      "id": 161,
      "start": 578.780029296875,
      "end": 581.5800170898438,
      "text": " He says he's the Son of Man, amen?"
    },
    {
      "id": 162,
      "start": 581.5800170898438,
      "end": 586.4199829101562,
      "text": " And it says that you're going to see heaven open, and the angels of God ascending and"
    },
    {
      "id": 163,
      "start": 586.4199829101562,
      "end": 588.3400268554688,
      "text": " descending upon the Son of Man."
    },
    {
      "id": 164,
      "start": 588.3400268554688,
      "end": 592.4600219726562,
      "text": " In Genesis chapter 28, in verse number 12, it says that he dreamed, and behold, a ladder"
    },
    {
      "id": 165,
      "start": 592.4600219726562,
      "end": 596.1199951171875,
      "text": " set up on the earth, and the top of it reached heaven, and behold, the angels of God ascending"
    },
    {
      "id": 166,
      "start": 596.1199951171875,
      "end": 598.1799926757812,
      "text": " and descending on it."
    },
    {
      "id": 167,
      "start": 598.1799926757812,
      "end": 600.0599975585938,
      "text": " And Jesus ties it."
    },
    {
      "id": 0,
      "start": 600.0599975585938,
      "end": 605.6599974632263,
      "text": " in with Nathanael in John chapter 1 and verse number 51, all the way back to this dream of"
    },
    {
      "id": 1,
      "start": 605.6599974632263,
      "end": 611.3399972915649,
      "text": " Jacob in Genesis chapter 28, and what precious truth that we see there. And so as we consider"
    },
    {
      "id": 2,
      "start": 611.3399972915649,
      "end": 616.5399971008301,
      "text": " this dream this evening, we note first of all what he saw, but I want you to pay close attention to"
    },
    {
      "id": 3,
      "start": 616.5399971008301,
      "end": 622.5399971008301,
      "text": " what he heard. Beginning in verse number 13 and down through verse number 15, Jacob heard some"
    },
    {
      "id": 4,
      "start": 622.5399971008301,
      "end": 629.0199966430664,
      "text": " powerful truth. The Bible says, and behold, the Lord stood above it and said, and God Almighty"
    },
    {
      "id": 5,
      "start": 629.0199966430664,
      "end": 638.0599975585938,
      "text": " is going to speak to him. And look, notice first of all that what he heard was regarding a place"
    },
    {
      "id": 6,
      "start": 638.0599975585938,
      "end": 645.2599983215332,
      "text": " in verse number 13. It says, I am the Lord God of Abraham, thy father, the God of Isaac, the land"
    },
    {
      "id": 7,
      "start": 645.2599983215332,
      "end": 653.4999961853027,
      "text": " whereon thou liest, to thee will I give it and to thy seed. We find that Jacob hears the voice of"
    },
    {
      "id": 8,
      "start": 653.5799980163574,
      "end": 660.6999969482422,
      "text": " God. He follows, he departs, he goes toward Haran as he had been instructed to do so, and he goes"
    },
    {
      "id": 9,
      "start": 660.6999969482422,
      "end": 665.9799957275391,
      "text": " to sleep, and he dreams a dream, and we see the vision that he saw, but we note what he heard and"
    },
    {
      "id": 10,
      "start": 665.9799957275391,
      "end": 672.1399993896484,
      "text": " how the Lord spoke to him and gave him precious promises. And he begins in verse number 13"
    },
    {
      "id": 11,
      "start": 672.1399993896484,
      "end": 677.8199996948242,
      "text": " regarding a place, a land, and we know that this goes back to the Abrahamic covenant. We understand"
    },
    {
      "id": 12,
      "start": 677.8199996948242,
      "end": 683.6599960327148,
      "text": " that as we've studied in weeks gone by the details of the Abrahamic covenant, we see here"
    },
    {
      "id": 13,
      "start": 683.6599960327148,
      "end": 693.3399963378906,
      "text": " that God says to Jacob, I am the Lord God of Abraham, thy father, the God of Isaac, the land"
    },
    {
      "id": 14,
      "start": 693.3399963378906,
      "end": 701.0199966430664,
      "text": " whereon thou liest, to thee will I give it and to thy seed. Notice he continues in verse number 14,"
    },
    {
      "id": 15,
      "start": 701.9799957275391,
      "end": 708.2200012207031,
      "text": " not only regarding a place, but now regarding a person, and that person being the Lord. Notice it"
    },
    {
      "id": 16,
      "start": 708.2200012207031,
      "end": 714.0599975585938,
      "text": " says, and thy seed shall be as the dust of the earth, and thou shalt spread abroad to the west,"
    },
    {
      "id": 17,
      "start": 714.0599975585938,
      "end": 721.1800003051758,
      "text": " to the east, to the north, and to the south, and in thee and in thy seed shall all the families"
    },
    {
      "id": 18,
      "start": 721.1800003051758,
      "end": 727.3399963378906,
      "text": " of the earth be blessed. Of course, we understand seed plural with regard to the nation of Israel,"
    },
    {
      "id": 19,
      "start": 727.3399963378906,
      "end": 733.9799957275391,
      "text": " but when we think about seed singular, as God spoke to Abraham, remember in Galatians 3 in"
    },
    {
      "id": 20,
      "start": 733.9799957275391,
      "end": 740.7799987792969,
      "text": " verse number 16, he says, I did not say seeds, but seed, speaking of the Lord Jesus Christ."
    },
    {
      "id": 21,
      "start": 740.7799987792969,
      "end": 747.5,
      "text": " And what great truth. Of course, we know that Jacob would be married, he'd have the sons,"
    },
    {
      "id": 22,
      "start": 747.5,
      "end": 753.2599945068359,
      "text": " the tribes of Israel, so on and so forth. But we find that as he gives them this promise,"
    },
    {
      "id": 23,
      "start": 753.2599945068359,
      "end": 757.1799926757812,
      "text": " he talks about the way in which they'd spread abroad to the west, east, north, and south."
    },
    {
      "id": 24,
      "start": 757.739990234375,
      "end": 764.3800048828125,
      "text": " But we think specifically about the promised Messiah, the messianic prophecy and the promise"
    },
    {
      "id": 25,
      "start": 764.3800048828125,
      "end": 770.5399932861328,
      "text": " and the line that I mentioned already in Galatians 3 in verse number 16, and what a precious truth."
    },
    {
      "id": 26,
      "start": 770.5399932861328,
      "end": 778.6199951171875,
      "text": " And so as we begin to focus in and we see that Jacob, he goes to this place and he lies down"
    },
    {
      "id": 27,
      "start": 778.6199951171875,
      "end": 785.0999908447266,
      "text": " to sleep and he has this dream. And as he has this dream, he hears the voice of God. God begins"
    },
    {
      "id": 28,
      "start": 785.0999908447266,
      "end": 791.8999938964844,
      "text": " to speak to him. God begins to reveal truth to him. We would say that God begins to reveal his"
    },
    {
      "id": 29,
      "start": 791.8999938964844,
      "end": 798.3000030517578,
      "text": " plan to him. In verse number 15, we find that he gives them truth regarding his plan and his"
    },
    {
      "id": 30,
      "start": 798.3000030517578,
      "end": 804.3000030517578,
      "text": " presence. He is now speaking about Jacob's life specifically. Notice in verse 15,"
    },
    {
      "id": 31,
      "start": 804.9400024414062,
      "end": 809.1799926757812,
      "text": " what encouraging promises are received here in this verse of Scripture."
    },
    {
      "id": 32,
      "start": 809.1799926757812,
      "end": 817.4199981689453,
      "text": " And behold, I am with thee, and will keep thee in all places whither thou goest,"
    },
    {
      "id": 33,
      "start": 818.0599975585938,
      "end": 821.8999938964844,
      "text": " and will bring thee again into this land, for I will not leave thee"
    },
    {
      "id": 34,
      "start": 822.6199951171875,
      "end": 829.8999938964844,
      "text": " until I have done that which I have spoken to thee of. Isn't that precious? Isn't that encouraging?"
    },
    {
      "id": 35,
      "start": 830.5399932861328,
      "end": 837.0200042724609,
      "text": " How often we go to the Word of God and we are reminded of the precious truth of God giving"
    },
    {
      "id": 36,
      "start": 837.0200042724609,
      "end": 843.739990234375,
      "text": " his promise with regard to his presence and how that he says, I will be with thee. We understand"
    },
    {
      "id": 37,
      "start": 843.739990234375,
      "end": 848.9400024414062,
      "text": " that we have that great promise of Hebrews 13 in verse number 5 when the Word of God tells us,"
    },
    {
      "id": 38,
      "start": 848.9400024414062,
      "end": 855.4199981689453,
      "text": " I will never leave thee nor forsake thee, and how wonderful that truth is and how impactful that is."
    },
    {
      "id": 39,
      "start": 855.4199981689453,
      "end": 860.6199951171875,
      "text": " I've often said over the years that the promise of his presence brings comfort in the life of the"
    },
    {
      "id": 40,
      "start": 860.6199951171875,
      "end": 866.6199951171875,
      "text": " believer, and certainly that's true because we know, even as the psalmist says in Psalm 23,"
    },
    {
      "id": 41,
      "start": 867.5,
      "end": 871.9800109863281,
      "text": " that yea, though I walk through the valley of the shadow of death, I will fear no evil, why,"
    },
    {
      "id": 42,
      "start": 871.9800109863281,
      "end": 881.4199829101562,
      "text": " for thou art with me. And to know his presence is so encouraging. And that's how God starts out"
    },
    {
      "id": 43,
      "start": 881.4199829101562,
      "end": 890.0599975585938,
      "text": " when he speaks about the land and about the seed, and he then talks about the life of Jacob and his"
    },
    {
      "id": 44,
      "start": 890.0599975585938,
      "end": 897.6600036621094,
      "text": " presence, and he starts in verse 15 and says, and behold, I am with thee. Wow, that's precious."
    },
    {
      "id": 45,
      "start": 898.8599853515625,
      "end": 906.0599975585938,
      "text": " He says this, and will keep thee in all places whither thou goest. Now, that's encouraging,"
    },
    {
      "id": 46,
      "start": 906.0599975585938,
      "end": 911.5799865722656,
      "text": " isn't it? And you think about the promise that God gives to Joshua in Joshua chapter number 9,"
    },
    {
      "id": 47,
      "start": 911.5799865722656,
      "end": 917.1799926757812,
      "text": " or Joshua chapter number 1, excuse me, with regard to going in and conquering the land,"
    },
    {
      "id": 48,
      "start": 917.1799926757812,
      "end": 921.6600036621094,
      "text": " and that God said he was going to be with them. And as he went through that place and fulfilled"
    },
    {
      "id": 49,
      "start": 921.6600036621094,
      "end": 927.0199890136719,
      "text": " the plan of God in his life for the nation of Israel, that God Almighty would be with him."
    },
    {
      "id": 50,
      "start": 927.0199890136719,
      "end": 933.3399963378906,
      "text": " And here Jacob is receiving this promise that I am with thee, and I will keep thee in all places"
    },
    {
      "id": 51,
      "start": 933.3399963378906,
      "end": 939.3399963378906,
      "text": " whither thou goest. But then he tells them this, and I will bring thee again into this land."
    },
    {
      "id": 52,
      "start": 940.4599914550781,
      "end": 945.4199829101562,
      "text": " I'll bring thee again into this land. And then he says this, for I will not leave thee"
    },
    {
      "id": 53,
      "start": 947.3399963378906,
      "end": 954.3800048828125,
      "text": " until I have done that which I have spoken to thee of. These are encouraging promises."
    },
    {
      "id": 54,
      "start": 955.1799926757812,
      "end": 959.9800109863281,
      "text": " And I want you to think about Jacob in this situation, and I want you to think about his"
    },
    {
      "id": 55,
      "start": 959.9800109863281,
      "end": 964.5400085449219,
      "text": " life up to this point, and all that we've studied, and all that we've seen. And again,"
    },
    {
      "id": 56,
      "start": 964.5400085449219,
      "end": 969.1799926757812,
      "text": " as I mentioned by way of introduction, there's very little of any spiritual significance that's"
    },
    {
      "id": 57,
      "start": 969.1799926757812,
      "end": 973.8999938964844,
      "text": " mentioned in the life of Jacob. I mean, we read of his birth, and then right after his birth,"
    },
    {
      "id": 58,
      "start": 973.8999938964844,
      "end": 978.6199951171875,
      "text": " you read how he's swindling his brother out of his birthright, and then you read about the"
    },
    {
      "id": 59,
      "start": 978.6199951171875,
      "end": 984.6199951171875,
      "text": " time in Gerar, and there's no reference whatsoever to Jacob. And then you read about his deception"
    },
    {
      "id": 60,
      "start": 984.6199951171875,
      "end": 988.9400024414062,
      "text": " and his carnality in chapter 27, and how he takes the blessing, and so on and so forth."
    },
    {
      "id": 61,
      "start": 988.9400024414062,
      "end": 992.7799987792969,
      "text": " And there's really nothing of any significance from a spiritual perspective."
    },
    {
      "id": 62,
      "start": 994.2999877929688,
      "end": 1002.0599975585938,
      "text": " And now God Almighty has appeared to him, and God has spoken to him, and God is revealing himself."
    },
    {
      "id": 63,
      "start": 1002.0599975585938,
      "end": 1009.4199829101562,
      "text": " He says, I am the Lord God of Abraham thy father, as he begins speaking to him in verse number 13,"
    },
    {
      "id": 64,
      "start": 1009.4199829101562,
      "end": 1015.3399963378906,
      "text": " and how that sets the record straight and helps Jacob to understand all of what he's experiencing"
    },
    {
      "id": 65,
      "start": 1015.3399963378906,
      "end": 1020.7799987792969,
      "text": " in this moment. And God gives him these encouraging promises, and it's God who is"
    },
    {
      "id": 66,
      "start": 1020.7799987792969,
      "end": 1028.2200012207031,
      "text": " the eternal God that is able to make these kind of promises, that's able to say to Jacob that,"
    },
    {
      "id": 67,
      "start": 1028.2200012207031,
      "end": 1034.0599975585938,
      "text": " I will not leave thee until I have done that which I have spoken to thee of. And it reveals,"
    },
    {
      "id": 68,
      "start": 1034.0599975585938,
      "end": 1039.9800109863281,
      "text": " it reminds us of the power of God to accomplish his purpose and his will in our lives."
    },
    {
      "id": 69,
      "start": 1040.7799987792969,
      "end": 1045.4199829101562,
      "text": " I'm so thankful this evening that God has a purpose and a will for your life and for my life."
    },
    {
      "id": 70,
      "start": 1046.1399841308594,
      "end": 1051.9800109863281,
      "text": " We find that the Word of God tells in the book of Philippians that he's begun a good work in us,"
    },
    {
      "id": 71,
      "start": 1051.9800109863281,
      "end": 1057.5799865722656,
      "text": " but he's going to continue it until the day of Jesus Christ and how precious that is. And it's"
    },
    {
      "id": 72,
      "start": 1057.5799865722656,
      "end": 1061.8200073242188,
      "text": " interesting because Paul says it this way under the inspirational Holy Spirit of God, being"
    },
    {
      "id": 73,
      "start": 1061.8200073242188,
      "end": 1068.6199951171875,
      "text": " confident of this thing, having the confidence to know that God is working and moving in our"
    },
    {
      "id": 74,
      "start": 1068.6199951171875,
      "end": 1075.6600036621094,
      "text": " lives and that he has a purpose for everything that we deal with. He's growing us. He's developing"
    },
    {
      "id": 75,
      "start": 1075.6600036621094,
      "end": 1084.5400085449219,
      "text": " us. And we find here that God Almighty gives these promises to Jacob. And we think about the point"
    },
    {
      "id": 76,
      "start": 1084.5400085449219,
      "end": 1090.2200012207031,
      "text": " where we are here at this passage of Scripture in the life of Jacob and you, yes, his departure,"
    },
    {
      "id": 77,
      "start": 1090.2200012207031,
      "end": 1096.2999877929688,
      "text": " but now his dream, and how he would respond and how this would impact his life. And I believe"
    },
    {
      "id": 78,
      "start": 1096.2999877929688,
      "end": 1102.2200012207031,
      "text": " that it had a profound impact in the life of Jacob, as we will see in the next verses of"
    },
    {
      "id": 79,
      "start": 1102.2200012207031,
      "end": 1108.1399841308594,
      "text": " Scripture that we'll look to. And we see that in these verses of Scripture that it's so well laid"
    },
    {
      "id": 80,
      "start": 1108.1399841308594,
      "end": 1115.9000244140625,
      "text": " out as to how impactful this was in the life of Jacob. You remember the day in your life when"
    },
    {
      "id": 81,
      "start": 1116.5399780273438,
      "end": 1121.02001953125,
      "text": " you met the Lord, you understood who he was, and you understood his plan for your life after"
    },
    {
      "id": 82,
      "start": 1121.6599731445312,
      "end": 1128.3800048828125,
      "text": " your salvation and understanding how he loved you and the promises. And here we find that Jacob"
    },
    {
      "id": 83,
      "start": 1129.0999755859375,
      "end": 1135.6599731445312,
      "text": " has this time with the Lord and his, really, I would use the terminology from a New Testament"
    },
    {
      "id": 84,
      "start": 1135.6599731445312,
      "end": 1144.5399780273438,
      "text": " perspective, his conversion here in this passage of Scripture. As you continue and we focus our"
    },
    {
      "id": 85,
      "start": 1144.5399780273438,
      "end": 1152.6199951171875,
      "text": " attention on verses 16 through 22, I want you to notice his declarations. His departure, his dream,"
    },
    {
      "id": 86,
      "start": 1152.6199951171875,
      "end": 1157.5800170898438,
      "text": " and his declarations. Really, four things in which I've noted as I've looked at these verses"
    },
    {
      "id": 87,
      "start": 1157.5800170898438,
      "end": 1164.3800048828125,
      "text": " of Scripture to deal with what it is that he, Jacob, declares. First of all, I want you to"
    },
    {
      "id": 88,
      "start": 1164.3800048828125,
      "end": 1169.260009765625,
      "text": " notice what he says in verse 16, and Jacob awaked out of his sleep and he said, notice what he said,"
    },
    {
      "id": 89,
      "start": 1169.97998046875,
      "end": 1176.9400024414062,
      "text": " \"'Surely the Lord is in this place, and I knew it not.'\" Now think about that. He said,"
    },
    {
      "id": 90,
      "start": 1176.9400024414062,
      "end": 1184.5399780273438,
      "text": " the Lord is in this place, Jehovah God. And he recognized, remember, as he went to that place,"
    },
    {
      "id": 91,
      "start": 1184.5399780273438,
      "end": 1189.3400268554688,
      "text": " as he lighted upon a certain place, according to verse number 11, I don't think he really thought"
    },
    {
      "id": 92,
      "start": 1189.3400268554688,
      "end": 1193.8200073242188,
      "text": " of any significance of the place where he lay. I don't think there was anything, really, that he"
    },
    {
      "id": 93,
      "start": 1193.8200073242188,
      "end": 1198.7000122070312,
      "text": " anticipated happening. He was on a journey. He was heading towards Haran. He was following the"
    },
    {
      "id": 94,
      "start": 1198.7000122070312,
      "end": 1200.1400146484375,
      "text": " direction of his..."
    },
    {
      "id": 0,
      "start": 1200.1400146484375,
      "end": 1206.4400148391724,
      "text": " father, no doubt there were various levels of emotions that Jacob would have been dealing"
    },
    {
      "id": 1,
      "start": 1206.4400148391724,
      "end": 1207.4400148391724,
      "text": " with."
    },
    {
      "id": 2,
      "start": 1207.4400148391724,
      "end": 1212.3600149154663,
      "text": " He's leaving his home, he's leaving all that he knows, he's leaving not only the security"
    },
    {
      "id": 3,
      "start": 1212.3600149154663,
      "end": 1218.360013961792,
      "text": " of his home and the people that he's close with, his mother, and so on and so forth."
    },
    {
      "id": 4,
      "start": 1218.360013961792,
      "end": 1224.1600151062012,
      "text": " He's got on his mind, no doubt, the thought of Esau's hatred and all of those things that"
    },
    {
      "id": 5,
      "start": 1224.1600151062012,
      "end": 1228.6000137329102,
      "text": " are happening and all of the emotions that take place, and he takes his journey."
    },
    {
      "id": 6,
      "start": 1228.6000137329102,
      "end": 1233.280014038086,
      "text": " He's wearied, he's going to sleep, I don't think he anticipates anything taking place"
    },
    {
      "id": 7,
      "start": 1233.280014038086,
      "end": 1240.440013885498,
      "text": " as we see here where he says, surely the Lord is in this place, and I knew it not."
    },
    {
      "id": 8,
      "start": 1240.440013885498,
      "end": 1243.0800132751465,
      "text": " Surely the Lord is in this place."
    },
    {
      "id": 9,
      "start": 1243.0800132751465,
      "end": 1248.6400146484375,
      "text": " Man, this was impactful in the life of Jacob, but I want you to notice what he continues"
    },
    {
      "id": 10,
      "start": 1248.6400146484375,
      "end": 1249.6400146484375,
      "text": " to say."
    },
    {
      "id": 11,
      "start": 1249.6400146484375,
      "end": 1256.7000160217285,
      "text": " It says that here in verse 17, he was afraid and said, how dreadful is this place."
    },
    {
      "id": 12,
      "start": 1256.7000160217285,
      "end": 1262.5200157165527,
      "text": " This is none other but the house of God, and this is the gate of heaven."
    },
    {
      "id": 13,
      "start": 1262.5200157165527,
      "end": 1266.620018005371,
      "text": " I want you to consider with me his response when it says that he was afraid and said,"
    },
    {
      "id": 14,
      "start": 1266.620018005371,
      "end": 1269.1000137329102,
      "text": " how dreadful is this place."
    },
    {
      "id": 15,
      "start": 1269.1000137329102,
      "end": 1274.4600143432617,
      "text": " The reality is that when you consider being in the presence of God and you understand"
    },
    {
      "id": 16,
      "start": 1274.4600143432617,
      "end": 1282.8600158691406,
      "text": " how awesome he is and how wonderful he is, that we respond in a response of reverence,"
    },
    {
      "id": 17,
      "start": 1282.8600158691406,
      "end": 1285.9200134277344,
      "text": " a response of awe."
    },
    {
      "id": 18,
      "start": 1285.9200134277344,
      "end": 1289.5200119018555,
      "text": " We understand that he is God."
    },
    {
      "id": 19,
      "start": 1289.5200119018555,
      "end": 1294.8400115966797,
      "text": " And here the Bible tells us that he says, this is none other but the house of God, and"
    },
    {
      "id": 20,
      "start": 1294.8400115966797,
      "end": 1297.120018005371,
      "text": " this is the gate of heaven."
    },
    {
      "id": 21,
      "start": 1297.120018005371,
      "end": 1300.6000137329102,
      "text": " This is that second declaration that this is the house of God."
    },
    {
      "id": 22,
      "start": 1300.6000137329102,
      "end": 1303.6800155639648,
      "text": " Notice what he does because of what he had recognized."
    },
    {
      "id": 23,
      "start": 1303.6800155639648,
      "end": 1307.0400161743164,
      "text": " In verse number 18, it says that he rose up early in the morning."
    },
    {
      "id": 24,
      "start": 1307.0400161743164,
      "end": 1311.9200134277344,
      "text": " Now there's a note there for us to understand the urgency in which he was operating, that"
    },
    {
      "id": 25,
      "start": 1311.9200134277344,
      "end": 1313.6400146484375,
      "text": " he rose early in the morning."
    },
    {
      "id": 26,
      "start": 1313.6400146484375,
      "end": 1315.5800170898438,
      "text": " This was an immediate response."
    },
    {
      "id": 27,
      "start": 1316.2400131225586,
      "end": 1319.3400115966797,
      "text": " He wasn't going to just kind of lay around and think about it and muse upon it."
    },
    {
      "id": 28,
      "start": 1319.3400115966797,
      "end": 1324.620018005371,
      "text": " He had this dream, God had spoken to him, and now he's going to respond."
    },
    {
      "id": 29,
      "start": 1324.620018005371,
      "end": 1325.880012512207,
      "text": " He rises up early."
    },
    {
      "id": 30,
      "start": 1325.880012512207,
      "end": 1329.9400177001953,
      "text": " Notice it says in verse 18 that he took the stone that he had put for his pillows and"
    },
    {
      "id": 31,
      "start": 1329.9400177001953,
      "end": 1338.8000183105469,
      "text": " he set it up for a pillar and poured oil upon the top of it, a process of consecration."
    },
    {
      "id": 32,
      "start": 1338.8000183105469,
      "end": 1346.1600189208984,
      "text": " We notice that in verse number 18, he pours that oil upon the top of it in this act of"
    },
    {
      "id": 33,
      "start": 1346.1600189208984,
      "end": 1351.3200073242188,
      "text": " consecration, and he's understanding that this is the house of God."
    },
    {
      "id": 34,
      "start": 1351.3200073242188,
      "end": 1352.3200073242188,
      "text": " This is the place."
    },
    {
      "id": 35,
      "start": 1352.3200073242188,
      "end": 1358.1600189208984,
      "text": " Remember, he made that declaration in verse number 16, surely the Lord is in this place,"
    },
    {
      "id": 36,
      "start": 1358.1600189208984,
      "end": 1360.500015258789,
      "text": " and I knew it not."
    },
    {
      "id": 37,
      "start": 1360.500015258789,
      "end": 1365.0400085449219,
      "text": " In verse number 19, he calls the place Bethel."
    },
    {
      "id": 38,
      "start": 1365.0400085449219,
      "end": 1369.4000091552734,
      "text": " Notice what he says, and he called the name of that place Bethel, but the name of the"
    },
    {
      "id": 39,
      "start": 1369.4000091552734,
      "end": 1372.4400177001953,
      "text": " city was called Luz at the first."
    },
    {
      "id": 40,
      "start": 1372.4400177001953,
      "end": 1378.6400146484375,
      "text": " So he gives this name of this place Bethel, this place where he set up this pillar, this"
    },
    {
      "id": 41,
      "start": 1378.6400146484375,
      "end": 1382.7200164794922,
      "text": " place in which he's poured the oil on top of the pillar, the place in which he's referred"
    },
    {
      "id": 42,
      "start": 1382.7200164794922,
      "end": 1385.4000091552734,
      "text": " to as being the house of God."
    },
    {
      "id": 43,
      "start": 1385.4000091552734,
      "end": 1391.6000213623047,
      "text": " In fact, the word Bethel literally means house of God."
    },
    {
      "id": 44,
      "start": 1391.6000213623047,
      "end": 1395.280014038086,
      "text": " You see the impact that this event has had in the life of Jacob."
    },
    {
      "id": 45,
      "start": 1395.280014038086,
      "end": 1400.52001953125,
      "text": " You see the way in which he's responding to what he's experienced, and you see how that"
    },
    {
      "id": 46,
      "start": 1400.52001953125,
      "end": 1403.8400115966797,
      "text": " he's immediately taking action and the changes."
    },
    {
      "id": 47,
      "start": 1403.8400115966797,
      "end": 1408.760009765625,
      "text": " We don't see this type of behavior in the life of Jacob prior to this, do we?"
    },
    {
      "id": 48,
      "start": 1408.760009765625,
      "end": 1411.4400177001953,
      "text": " You don't see this kind of behavior in the life of Jacob."
    },
    {
      "id": 49,
      "start": 1411.4400177001953,
      "end": 1415.52001953125,
      "text": " As we've studied the previous chapters, as we've studied the life of Jacob and the little"
    },
    {
      "id": 50,
      "start": 1415.52001953125,
      "end": 1420.0400085449219,
      "text": " bit that God has given us, and especially in chapter 27 with so much provided to us"
    },
    {
      "id": 51,
      "start": 1420.0400085449219,
      "end": 1424.3600158691406,
      "text": " about the life of Jacob, you see no types of responses like this."
    },
    {
      "id": 52,
      "start": 1424.3600158691406,
      "end": 1429.9200134277344,
      "text": " You see no recognition of God being God and what His plan and His purpose is, and we find"
    },
    {
      "id": 53,
      "start": 1429.9200134277344,
      "end": 1434.280014038086,
      "text": " that Jacob is now responding and behaving in a different way."
    },
    {
      "id": 54,
      "start": 1434.280014038086,
      "end": 1440.4000091552734,
      "text": " He's a changed man because of what he experienced."
    },
    {
      "id": 55,
      "start": 1440.4000091552734,
      "end": 1444.1200103759766,
      "text": " We think about this change and how it's evidenced through these declarations and through his"
    },
    {
      "id": 56,
      "start": 1444.1200103759766,
      "end": 1450.2400207519531,
      "text": " behavior, and no doubt when we think about our lives and we think about our conversion"
    },
    {
      "id": 57,
      "start": 1450.2400207519531,
      "end": 1454.000015258789,
      "text": " and we think about the day in which we met the Lord Jesus Christ, there's some changes"
    },
    {
      "id": 58,
      "start": 1454.000015258789,
      "end": 1455.000015258789,
      "text": " in our life."
    },
    {
      "id": 59,
      "start": 1455.000015258789,
      "end": 1456.000015258789,
      "text": " Amen?"
    },
    {
      "id": 60,
      "start": 1456.000015258789,
      "end": 1457.8800048828125,
      "text": " I'm not the person I used to be."
    },
    {
      "id": 61,
      "start": 1457.8800048828125,
      "end": 1461.0800170898438,
      "text": " Aren't you glad that you're not the person you used to be?"
    },
    {
      "id": 62,
      "start": 1461.0800170898438,
      "end": 1465.6800231933594,
      "text": " Man, we sing the song with the kids and we talk about there's been a great change since"
    },
    {
      "id": 63,
      "start": 1465.6800231933594,
      "end": 1469.3600158691406,
      "text": " I've been born again, and we talk about the things that I used to do, I don't do them"
    },
    {
      "id": 64,
      "start": 1469.3600158691406,
      "end": 1472.4800109863281,
      "text": " anymore, the places I used to go, I don't go there anymore, the things I used to say."
    },
    {
      "id": 65,
      "start": 1472.4800109863281,
      "end": 1475.2400207519531,
      "text": " We sing all of those and we deal with all of that."
    },
    {
      "id": 66,
      "start": 1475.2400207519531,
      "end": 1476.2400207519531,
      "text": " Why?"
    },
    {
      "id": 67,
      "start": 1476.2400207519531,
      "end": 1478.8400268554688,
      "text": " Because there's been a great change since I've been born again."
    },
    {
      "id": 68,
      "start": 1478.8400268554688,
      "end": 1482.6800231933594,
      "text": " Do you not see in the behavior of Jacob that there's a change?"
    },
    {
      "id": 69,
      "start": 1482.6800231933594,
      "end": 1486.8000183105469,
      "text": " He's a changed man."
    },
    {
      "id": 70,
      "start": 1486.8000183105469,
      "end": 1492.3200073242188,
      "text": " We think about this change and we think about these declarations, we find that he understands"
    },
    {
      "id": 71,
      "start": 1492.3200073242188,
      "end": 1495.3200073242188,
      "text": " that he's in the place of God, that this is the house of God."
    },
    {
      "id": 72,
      "start": 1495.3200073242188,
      "end": 1500.760009765625,
      "text": " He sets up this pillar, and then notice that he vows a vow, he makes a vow, and really"
    },
    {
      "id": 73,
      "start": 1500.760009765625,
      "end": 1505.3600158691406,
      "text": " there's multiple aspects of it in verses 20-22, but I want you to notice what he says"
    },
    {
      "id": 74,
      "start": 1505.3600158691406,
      "end": 1511.9000244140625,
      "text": " and how he's responding and how his response, again, gives further evidence to the change"
    },
    {
      "id": 75,
      "start": 1511.9000244140625,
      "end": 1513.4000244140625,
      "text": " in his life."
    },
    {
      "id": 76,
      "start": 1513.4000244140625,
      "end": 1519.280029296875,
      "text": " The Bible says that Jacob vowed a vow saying, if God will be with me and will keep me in"
    },
    {
      "id": 77,
      "start": 1519.280029296875,
      "end": 1524.9200134277344,
      "text": " this way that I go and will give me bread to eat and raiment to put on so that I come"
    },
    {
      "id": 78,
      "start": 1524.9200134277344,
      "end": 1528.9600219726562,
      "text": " again to my father's house in peace, then shall the Lord be my God."
    },
    {
      "id": 79,
      "start": 1529.1600036621094,
      "end": 1532.760009765625,
      "text": " Now, I want to break this down for you in verse 20 and 21, and I want you to understand"
    },
    {
      "id": 80,
      "start": 1532.760009765625,
      "end": 1537.2000122070312,
      "text": " something that's very significant and very important as we seek to interpret this passage"
    },
    {
      "id": 81,
      "start": 1537.2000122070312,
      "end": 1538.3200073242188,
      "text": " of Scripture."
    },
    {
      "id": 82,
      "start": 1538.3200073242188,
      "end": 1543.7200012207031,
      "text": " In verse number 20, when Jacob vowed a vow and he said, if, that word, if, is different"
    },
    {
      "id": 83,
      "start": 1543.7200012207031,
      "end": 1547.3600158691406,
      "text": " than how we typically use the word, if."
    },
    {
      "id": 84,
      "start": 1547.3600158691406,
      "end": 1552.280029296875,
      "text": " That word, if, is, in what you just said, it's since."
    },
    {
      "id": 85,
      "start": 1552.280029296875,
      "end": 1559.1600036621094,
      "text": " The idea, the understanding is that Jacob is saying, since God will be with me."
    },
    {
      "id": 86,
      "start": 1559.1600036621094,
      "end": 1563.2000122070312,
      "text": " He's not saying, he's not laying out there and says, okay, well, if God is going to do"
    },
    {
      "id": 87,
      "start": 1563.2000122070312,
      "end": 1566.4600219726562,
      "text": " all of these things, then I will do this."
    },
    {
      "id": 88,
      "start": 1566.4600219726562,
      "end": 1568.1200256347656,
      "text": " He's not wheeling and dealing with God."
    },
    {
      "id": 89,
      "start": 1568.1200256347656,
      "end": 1570.3600158691406,
      "text": " There's some people that kind of have that approach in life."
    },
    {
      "id": 90,
      "start": 1570.3600158691406,
      "end": 1573.760009765625,
      "text": " There's some people that kind of, God, if you get me out of this, then I'll do that,"
    },
    {
      "id": 91,
      "start": 1573.760009765625,
      "end": 1576.760009765625,
      "text": " and if you do this for me, then I'll do this."
    },
    {
      "id": 92,
      "start": 1576.760009765625,
      "end": 1577.760009765625,
      "text": " That's not how God works."
    },
    {
      "id": 93,
      "start": 1577.760009765625,
      "end": 1578.760009765625,
      "text": " It's not a barter system."
    },
    {
      "id": 94,
      "start": 1578.760009765625,
      "end": 1582.280029296875,
      "text": " It's just not how it works with God, amen?"
    },
    {
      "id": 95,
      "start": 1582.280029296875,
      "end": 1588.9200134277344,
      "text": " And we find that here, Jacob is not using the word as we often use it in our today's"
    },
    {
      "id": 96,
      "start": 1588.9200134277344,
      "end": 1589.9200134277344,
      "text": " language."
    },
    {
      "id": 97,
      "start": 1589.9200134277344,
      "end": 1593.8800048828125,
      "text": " In fact, when you study through the Old Testament and the Hebrew language in particular, this"
    },
    {
      "id": 98,
      "start": 1593.8800048828125,
      "end": 1599.5400085449219,
      "text": " word, if, it carries with it, and actually through context, you can easily determine"
    },
    {
      "id": 99,
      "start": 1599.5400085449219,
      "end": 1605.0,
      "text": " if it's meaning if, as in if something's going to happen or if this happens, or if it's carrying"
    },
    {
      "id": 100,
      "start": 1605.0,
      "end": 1606.3200073242188,
      "text": " it with that idea of since."
    },
    {
      "id": 101,
      "start": 1606.3200073242188,
      "end": 1608.2400207519531,
      "text": " In fact, in the New Testament, it's the same way."
    },
    {
      "id": 102,
      "start": 1608.2400207519531,
      "end": 1612.2000122070312,
      "text": " You remember in the passage of Scripture in 1 Thessalonians 4."
    },
    {
      "id": 103,
      "start": 1612.2000122070312,
      "end": 1616.4000244140625,
      "text": " Let me just quickly go there for you, and I'll just give you this side note, not really"
    },
    {
      "id": 104,
      "start": 1616.4000244140625,
      "end": 1619.0400085449219,
      "text": " part of the message, but hopefully it'll be a blessing to you."
    },
    {
      "id": 105,
      "start": 1619.0400085449219,
      "end": 1624.0800170898438,
      "text": " 1 Thessalonians chapter number 4, and we see this in the New Testament as well, where he"
    },
    {
      "id": 106,
      "start": 1624.0800170898438,
      "end": 1630.4400024414062,
      "text": " uses this terminology, and we find that he's given the great promise with regard to the"
    },
    {
      "id": 107,
      "start": 1630.4400024414062,
      "end": 1635.8400268554688,
      "text": " return of the Lord, and he says in verse number 13, but I would not have you to be ignorant,"
    },
    {
      "id": 108,
      "start": 1635.8400268554688,
      "end": 1639.8000183105469,
      "text": " brethren, 1 Thessalonians 4 and verse 13, concerning them which are asleep, that ye"
    },
    {
      "id": 109,
      "start": 1639.8000183105469,
      "end": 1644.4400024414062,
      "text": " sorrow not even as others which have no hope, for if we believe that Jesus died and rose"
    },
    {
      "id": 110,
      "start": 1644.4400024414062,
      "end": 1648.4400024414062,
      "text": " again, even so them also which sleep in Jesus will God bring with him."
    },
    {
      "id": 111,
      "start": 1648.4400024414062,
      "end": 1652.3600158691406,
      "text": " That word if, in verse number 14, is since."
    },
    {
      "id": 112,
      "start": 1652.3600158691406,
      "end": 1655.280029296875,
      "text": " Since we believe that Jesus died and rose again."
    },
    {
      "id": 113,
      "start": 1655.280029296875,
      "end": 1657.7200012207031,
      "text": " He's not saying if we believe this."
    },
    {
      "id": 114,
      "start": 1657.7200012207031,
      "end": 1660.5600280761719,
      "text": " It's already been understood that they believe this truth, right?"
    },
    {
      "id": 115,
      "start": 1660.5600280761719,
      "end": 1662.8400268554688,
      "text": " Paul's not now wavering at some level."
    },
    {
      "id": 116,
      "start": 1662.8400268554688,
      "end": 1667.0800170898438,
      "text": " The church in Thessalonica is not wavering at some level with regard to the death and"
    },
    {
      "id": 117,
      "start": 1667.0800170898438,
      "end": 1671.6400146484375,
      "text": " burial and resurrection of Jesus Christ, but he's saying since we believe this, based upon"
    },
    {
      "id": 118,
      "start": 1671.6400146484375,
      "end": 1676.8800048828125,
      "text": " our belief, understanding this great truth, here's how it impacts us, and so Jacob is"
    },
    {
      "id": 119,
      "start": 1676.8800048828125,
      "end": 1683.4000244140625,
      "text": " using the word in that sense, and it says, if God, since God will be with me."
    },
    {
      "id": 120,
      "start": 1683.4000244140625,
      "end": 1686.7000122070312,
      "text": " Now where do you get this idea?"
    },
    {
      "id": 121,
      "start": 1686.7000122070312,
      "end": 1689.8000183105469,
      "text": " Verse number 15, right?"
    },
    {
      "id": 122,
      "start": 1689.8000183105469,
      "end": 1691.8000183105469,
      "text": " Remember the promises that God gave him?"
    },
    {
      "id": 123,
      "start": 1691.8000183105469,
      "end": 1696.2400207519531,
      "text": " Remember we mentioned that dream, what he saw, but we mentioned specifically what he"
    },
    {
      "id": 124,
      "start": 1696.2400207519531,
      "end": 1704.0400085449219,
      "text": " heard, and the significance of what Jacob heard God say, and as God is speaking to him,"
    },
    {
      "id": 125,
      "start": 1704.0400085449219,
      "end": 1708.1600036621094,
      "text": " and God speaks to him about a seed and about a land, but God speaks to him about his own"
    },
    {
      "id": 126,
      "start": 1708.1600036621094,
      "end": 1712.9200439453125,
      "text": " life, and he tells him that Jacob, I'm going to be with thee, and I will keep thee in all"
    },
    {
      "id": 127,
      "start": 1712.9200439453125,
      "end": 1718.3599853515625,
      "text": " places where thou goest, and now Jacob is saying, as he vows this vow to the Lord, he"
    },
    {
      "id": 128,
      "start": 1718.3599853515625,
      "end": 1726.4400024414062,
      "text": " says, since God will be with me, and since he will keep me in this way that I go, and"
    },
    {
      "id": 129,
      "start": 1726.4400024414062,
      "end": 1732.9600219726562,
      "text": " he will give me bread to eat and raiment to put on, listen, our God's a good God."
    },
    {
      "id": 130,
      "start": 1732.9600219726562,
      "end": 1741.0,
      "text": " He takes good care of us, and Jacob has been impacted by what he heard God say."
    },
    {
      "id": 131,
      "start": 1741.0,
      "end": 1745.3200073242188,
      "text": " Listen, I would say it this way for us as New Testament believers, he had faith in what"
    },
    {
      "id": 132,
      "start": 1745.3200073242188,
      "end": 1746.7200317382812,
      "text": " God said."
    },
    {
      "id": 133,
      "start": 1746.7200317382812,
      "end": 1747.9800415039062,
      "text": " Amen?"
    },
    {
      "id": 134,
      "start": 1747.9800415039062,
      "end": 1756.02001953125,
      "text": " He believed that God said to him, I will be with thee, and Jacob said, I believe that."
    },
    {
      "id": 135,
      "start": 1756.02001953125,
      "end": 1763.7000122070312,
      "text": " I believe that God made this promise to me, and I'm trusting the faithful God."
    },
    {
      "id": 136,
      "start": 1763.7000122070312,
      "end": 1766.8599853515625,
      "text": " And that's precious."
    },
    {
      "id": 137,
      "start": 1766.8599853515625,
      "end": 1772.2999877929688,
      "text": " He's going out, now, from the best of our knowledge as we look at the biblical history,"
    },
    {
      "id": 138,
      "start": 1772.2999877929688,
      "end": 1776.0599975585938,
      "text": " we know that he's been turned in the direction in which he's to go, he's been given that"
    },
    {
      "id": 139,
      "start": 1776.0599975585938,
      "end": 1781.4200439453125,
      "text": " instruction by Isaac, and he knows the home in which he's going to go, but as best as"
    },
    {
      "id": 140,
      "start": 1781.4200439453125,
      "end": 1784.9400024414062,
      "text": " we know, he doesn't even know his uncle."
    },
    {
      "id": 141,
      "start": 1784.9400024414062,
      "end": 1790.02001953125,
      "text": " There's no record of any family reunions that took place that we read of, and he's going"
    },
    {
      "id": 142,
      "start": 1790.02001953125,
      "end": 1797.1400146484375,
      "text": " out, but God says, I'm going to be with you, and I'm going to provide for you."
    },
    {
      "id": 143,
      "start": 1797.1400146484375,
      "end": 1799.4200439453125,
      "text": " I'm going to not leave you."
    },
    {
      "id": 144,
      "start": 1799.4200439453125,
      "end": 1800.1799926757812,
      "text": " I'm going to..."
    },
    {
      "id": 0,
      "start": 1800.1799926757812,
      "end": 1806.6599926948547,
      "text": " fulfill my purpose in you.\" And Jacob believes God. He has faith in what God"
    },
    {
      "id": 1,
      "start": 1806.6599926948547,
      "end": 1812.4199924468994,
      "text": " said. The Bible says that he continues and he says, so that I come again in"
    },
    {
      "id": 2,
      "start": 1812.4199924468994,
      "end": 1816.859992980957,
      "text": " verse number 21, to my father's house in peace. Now, notice what he says at the"
    },
    {
      "id": 3,
      "start": 1816.859992980957,
      "end": 1823.0999927520752,
      "text": " end of verse number 21, then shall the Lord be my God. I want you to think about"
    },
    {
      "id": 4,
      "start": 1823.0999927520752,
      "end": 1828.3399925231934,
      "text": " the personal nature of this. Because when God first speaks to him in verse number"
    },
    {
      "id": 5,
      "start": 1828.3399925231934,
      "end": 1837.419994354248,
      "text": " 13, he says, I am the Lord God of Abraham my father and the God of Isaac. We know"
    },
    {
      "id": 6,
      "start": 1837.419994354248,
      "end": 1843.2199935913086,
      "text": " that Abraham's his grandfather. The Word of God uses that phraseology often and"
    },
    {
      "id": 7,
      "start": 1843.2199935913086,
      "end": 1849.139991760254,
      "text": " it's, there's no error, there's no discrepancy. But God, Jehovah, he was"
    },
    {
      "id": 8,
      "start": 1849.139991760254,
      "end": 1855.9399909973145,
      "text": " Isaac's God, he was Abraham's God. And we find that now Jacob is making this great"
    },
    {
      "id": 9,
      "start": 1855.9799919128418,
      "end": 1860.9399909973145,
      "text": " declaration and he's acknowledging the fact that the Lord is going to be my God."
    },
    {
      "id": 10,
      "start": 1860.9399909973145,
      "end": 1867.2999954223633,
      "text": " You know how important it is for every individual to come to the place where"
    },
    {
      "id": 11,
      "start": 1867.2999954223633,
      "end": 1876.0999908447266,
      "text": " they acknowledge that he's my God? I know it seems maybe a little bit basic and"
    },
    {
      "id": 12,
      "start": 1876.0999908447266,
      "end": 1881.6999893188477,
      "text": " elementary, but the reality is that God has no grandchildren. He only has"
    },
    {
      "id": 13,
      "start": 1881.6999893188477,
      "end": 1888.6999893188477,
      "text": " children. Amen? And I understand for you grandparents out there, you love"
    },
    {
      "id": 14,
      "start": 1888.6999893188477,
      "end": 1892.259994506836,
      "text": " grandchildren, you think grandchildren are wonderful and all of the blessings"
    },
    {
      "id": 15,
      "start": 1892.259994506836,
      "end": 1897.9399948120117,
      "text": " of grandchildren, and I get it, but the reality is that God has no grandchildren."
    },
    {
      "id": 16,
      "start": 1897.9399948120117,
      "end": 1904.3799896240234,
      "text": " He only has children. And there has to come a point in your life when your"
    },
    {
      "id": 17,
      "start": 1904.3799896240234,
      "end": 1909.979995727539,
      "text": " parents' God is your God. There comes a point in our lives where it's no longer"
    },
    {
      "id": 18,
      "start": 1910.1799926757812,
      "end": 1914.9399948120117,
      "text": " that it's just the God of my father, it's not just the the God of my mother, but we"
    },
    {
      "id": 19,
      "start": 1914.9399948120117,
      "end": 1919.6999893188477,
      "text": " find that it's my God and that I have a personal relationship with the God of"
    },
    {
      "id": 20,
      "start": 1919.6999893188477,
      "end": 1928.0199890136719,
      "text": " heaven. It's so important. We find that no doubt it's beneficial for us, it's"
    },
    {
      "id": 21,
      "start": 1928.0199890136719,
      "end": 1932.9399871826172,
      "text": " helpful for us to be in a place, in a position in which we have the influence"
    },
    {
      "id": 22,
      "start": 1932.9399871826172,
      "end": 1937.7799987792969,
      "text": " of godly people in our lives and we have the understanding that there are people"
    },
    {
      "id": 23,
      "start": 1937.7799987792969,
      "end": 1942.1399993896484,
      "text": " that come into our lives and they have this influence in our lives and they"
    },
    {
      "id": 24,
      "start": 1942.1399993896484,
      "end": 1949.0,
      "text": " help us in our walk with God and they help us to to be what we're to be in the"
    },
    {
      "id": 25,
      "start": 1949.0,
      "end": 1953.1799926757812,
      "text": " Lord and in all of that influence, but the reality is that there's some point"
    },
    {
      "id": 26,
      "start": 1953.1799926757812,
      "end": 1960.7799987792969,
      "text": " in our lives where it must be that this God is my God. Joshua brings the people"
    },
    {
      "id": 27,
      "start": 1960.7799987792969,
      "end": 1966.1399993896484,
      "text": " to a place of decision. He says, ask for me in my house, we will serve the Lord."
    },
    {
      "id": 28,
      "start": 1966.259994506836,
      "end": 1971.2999877929688,
      "text": " But the decision is for you, nation of Israel. How are you going to respond? What"
    },
    {
      "id": 29,
      "start": 1971.2999877929688,
      "end": 1975.739990234375,
      "text": " are you going to do? And we know that the Bible tells us and teaches us that they"
    },
    {
      "id": 30,
      "start": 1975.739990234375,
      "end": 1980.1799926757812,
      "text": " respond and they make the declaration, they make the decision that they too"
    },
    {
      "id": 31,
      "start": 1980.1799926757812,
      "end": 1985.3399963378906,
      "text": " would serve the Lord God. But we find that as we look throughout the Word of"
    },
    {
      "id": 32,
      "start": 1985.3399963378906,
      "end": 1991.9399871826172,
      "text": " God, I often think of this particular example in 2nd Chronicles 24. If you"
    },
    {
      "id": 33,
      "start": 1991.9399871826172,
      "end": 1996.4599914550781,
      "text": " want to turn there just for a moment and look at this passage and we can see"
    },
    {
      "id": 34,
      "start": 1996.4599914550781,
      "end": 2002.1399993896484,
      "text": " this over in Kings as well, but here in 2nd Chronicles chapter number 24 and I"
    },
    {
      "id": 35,
      "start": 2002.1399993896484,
      "end": 2006.0199890136719,
      "text": " just want to draw your attention very quickly to a couple of points within"
    },
    {
      "id": 36,
      "start": 2006.0199890136719,
      "end": 2009.979995727539,
      "text": " this passage of Scripture and I want you to think this evening of the"
    },
    {
      "id": 37,
      "start": 2009.979995727539,
      "end": 2014.9399871826172,
      "text": " significance of Jacob making this statement that he no longer is just the"
    },
    {
      "id": 38,
      "start": 2014.9399871826172,
      "end": 2022.2999877929688,
      "text": " God of Abraham and Isaac but he's my God, the Lord Jehovah, he's my God. Here"
    },
    {
      "id": 39,
      "start": 2022.2999877929688,
      "end": 2027.1399993896484,
      "text": " in 2nd Chronicles 24 we read of Joash and he's going to be the king and the"
    },
    {
      "id": 40,
      "start": 2027.1399993896484,
      "end": 2031.0599975585938,
      "text": " Bible tells us about Jehoiada who was the priest and Jehoiada was very"
    },
    {
      "id": 41,
      "start": 2031.0599975585938,
      "end": 2036.2999877929688,
      "text": " influential in the life of Joash. In fact the Bible tells us that as long as"
    },
    {
      "id": 42,
      "start": 2036.2999877929688,
      "end": 2042.5,
      "text": " Jehoiada was living that Joash did the right thing and he served and he"
    },
    {
      "id": 43,
      "start": 2042.5,
      "end": 2045.5399932861328,
      "text": " followed the Lord so on and so forth but I want to draw your attention to"
    },
    {
      "id": 44,
      "start": 2045.5399932861328,
      "end": 2050.3399963378906,
      "text": " 2nd Chronicles 24 and verse 15 for the Bible says that Jehoiada waxed old and"
    },
    {
      "id": 45,
      "start": 2050.3399963378906,
      "end": 2056.8999938964844,
      "text": " was full of days when he died. There's gonna come a time when that mentor,"
    },
    {
      "id": 46,
      "start": 2056.8999938964844,
      "end": 2063.8200073242188,
      "text": " that influencer in your life is going to go home to be with the Lord and"
    },
    {
      "id": 47,
      "start": 2063.8200073242188,
      "end": 2071.8999938964844,
      "text": " that personal relationship that we have with God is of such importance because"
    },
    {
      "id": 48,
      "start": 2071.8999938964844,
      "end": 2078.8999938964844,
      "text": " when Jehoiada is off the scene when he dies, now what does that do to"
    },
    {
      "id": 49,
      "start": 2078.8999938964844,
      "end": 2083.8200073242188,
      "text": " Joash? Where is his place? What is his walk with God? That's why I try to teach"
    },
    {
      "id": 50,
      "start": 2083.8200073242188,
      "end": 2087.97998046875,
      "text": " these young people to walk with God. That's why we're passing out these"
    },
    {
      "id": 51,
      "start": 2087.97998046875,
      "end": 2092.97998046875,
      "text": " prayer lists on Wednesday evening and listing out the names of the kids in the"
    },
    {
      "id": 52,
      "start": 2092.97998046875,
      "end": 2096.2999877929688,
      "text": " nursery, the kids in the children's ministry, the teenagers this Wednesday"
    },
    {
      "id": 53,
      "start": 2096.2999877929688,
      "end": 2099.5,
      "text": " and we're listing those young people. We want to pray that they get saved at a"
    },
    {
      "id": 54,
      "start": 2099.5,
      "end": 2105.6199951171875,
      "text": " young age and that they learn to walk with God. They learn to develop that"
    },
    {
      "id": 55,
      "start": 2105.6199951171875,
      "end": 2110.019989013672,
      "text": " relationship, that fellowship with God. Notice in verse 17 it says,"
    },
    {
      "id": 56,
      "start": 2110.019989013672,
      "end": 2114.459991455078,
      "text": " Now after the death of Jehoiada came the princes of Judah and made obeisance to"
    },
    {
      "id": 57,
      "start": 2114.459991455078,
      "end": 2118.5399780273438,
      "text": " the king. Then the king hearkened unto them, listen, they came with flattery and"
    },
    {
      "id": 58,
      "start": 2118.5399780273438,
      "end": 2123.9400024414062,
      "text": " they sought to influence Joash. His mentor was now gone and it was it"
    },
    {
      "id": 59,
      "start": 2123.97998046875,
      "end": 2131.739990234375,
      "text": " becomes obvious, abundantly clear that he had no real walk with God personally. In"
    },
    {
      "id": 60,
      "start": 2131.739990234375,
      "end": 2137.3800048828125,
      "text": " fact, the Bible tells us that in verse number 21, they conspired against him and"
    },
    {
      "id": 61,
      "start": 2137.3800048828125,
      "end": 2139.8200073242188,
      "text": " stoned him with stones at the commandment of the king in the court of"
    },
    {
      "id": 62,
      "start": 2139.8200073242188,
      "end": 2143.0599975585938,
      "text": " the house of the Lord. You know who they they stoned here? They stoned"
    },
    {
      "id": 63,
      "start": 2143.0599975585938,
      "end": 2147.220001220703,
      "text": " Zechariah. According to verse number 20, he came and he spoke against what was"
    },
    {
      "id": 64,
      "start": 2147.220001220703,
      "end": 2151.779998779297,
      "text": " happening and talked about how they were forsaking the Lord and Zechariah was the"
    },
    {
      "id": 65,
      "start": 2151.779998779297,
      "end": 2165.019989013672,
      "text": " son of Jehoiada. And Joash says stone him. The importance of having that walk"
    },
    {
      "id": 66,
      "start": 2165.019989013672,
      "end": 2174.9400024414062,
      "text": " with God. While Jehoiada was alive, Joash did right, but Jehoiada died. And here in"
    },
    {
      "id": 67,
      "start": 2174.9400024414062,
      "end": 2186.459991455078,
      "text": " Genesis chapter 28, as Jacob is responding and declaring the change, he"
    },
    {
      "id": 68,
      "start": 2186.459991455078,
      "end": 2192.3800048828125,
      "text": " vows this vow and he says, I understand that God has made this promise, these"
    },
    {
      "id": 69,
      "start": 2192.3800048828125,
      "end": 2197.0599975585938,
      "text": " promises to me and I trust God, I believe God, I believe that he's going to do it"
    },
    {
      "id": 70,
      "start": 2197.220001220703,
      "end": 2205.8999938964844,
      "text": " and the Lord, he's my God. How powerful that is. Notice in verse number 22, back"
    },
    {
      "id": 71,
      "start": 2205.8999938964844,
      "end": 2213.8599853515625,
      "text": " in Genesis chapter 28, as we clean up or finish up this passage of scripture, he"
    },
    {
      "id": 72,
      "start": 2213.8599853515625,
      "end": 2219.5799865722656,
      "text": " refers to the stone, which of course, if you go back in verse number 11, it was"
    },
    {
      "id": 73,
      "start": 2219.5799865722656,
      "end": 2222.699981689453,
      "text": " the stones that he had set up for pillows. You look at verse number 18, it's the"
    },
    {
      "id": 74,
      "start": 2222.699981689453,
      "end": 2228.1000061035156,
      "text": " stone that he now uses as a pillar and poured oil upon it and he says, this stone,"
    },
    {
      "id": 75,
      "start": 2228.1000061035156,
      "end": 2235.3800048828125,
      "text": " which I have set for a pillar, shall be God's house. No longer is Jacob just out"
    },
    {
      "id": 76,
      "start": 2235.3800048828125,
      "end": 2241.5799865722656,
      "text": " looking for himself. Up to this point in Jacob's life, who was he most concerned"
    },
    {
      "id": 77,
      "start": 2241.5799865722656,
      "end": 2248.8999938964844,
      "text": " for? Himself, right? Esau comes and he's hungry. He'd been out, he's fainting."
    },
    {
      "id": 78,
      "start": 2249.1000061035156,
      "end": 2254.3800048828125,
      "text": " What's Jacob looking for? I'll give you some pottage, you give me the birthright, right?"
    },
    {
      "id": 79,
      "start": 2256.3800048828125,
      "end": 2259.97998046875,
      "text": " Chapter 27, what's Jacob trying to get? He's trying to get a blessing. Who's he looking for?"
    },
    {
      "id": 80,
      "start": 2259.97998046875,
      "end": 2265.4199829101562,
      "text": " Himself. Remember, when Rebecca says, here's what our plan's going to be, here's"
    },
    {
      "id": 81,
      "start": 2265.4199829101562,
      "end": 2270.97998046875,
      "text": " what you're going to do, he wasn't concerned with the plan not being right, he was"
    },
    {
      "id": 82,
      "start": 2270.97998046875,
      "end": 2279.1399841308594,
      "text": " concerned about getting caught, right? But now all of a sudden, the evidence of the"
    },
    {
      "id": 83,
      "start": 2279.1399841308594,
      "end": 2284.97998046875,
      "text": " change in the life of Jacob, he now declares that this pillar that I've set"
    },
    {
      "id": 84,
      "start": 2284.97998046875,
      "end": 2290.1799926757812,
      "text": " up, this shall be God's house. Now notice the depth of what he reveals in this"
    },
    {
      "id": 85,
      "start": 2290.1799926757812,
      "end": 2295.1000061035156,
      "text": " final statement of verse number 22. It says this, and of all that thou shalt"
    },
    {
      "id": 86,
      "start": 2295.1000061035156,
      "end": 2298.1000061035156,
      "text": " give me, now I know there's no punctuation there but I want you to just"
    },
    {
      "id": 87,
      "start": 2298.1000061035156,
      "end": 2303.97998046875,
      "text": " stop there just for a moment, and of all that thou shalt give me, you understand"
    },
    {
      "id": 88,
      "start": 2303.97998046875,
      "end": 2310.6600036621094,
      "text": " that he is the giver of all things. You understand that this evening? Everything"
    },
    {
      "id": 89,
      "start": 2310.6600036621094,
      "end": 2318.0599975585938,
      "text": " that we have is because of the good hand of God. Amen? Everything that we have. You"
    },
    {
      "id": 90,
      "start": 2318.0599975585938,
      "end": 2320.739990234375,
      "text": " say, well you don't understand pastor, I have this really good mind and I was"
    },
    {
      "id": 91,
      "start": 2320.739990234375,
      "end": 2327.0599975585938,
      "text": " able to go to school and get these... Who gave you that mind? You know about"
    },
    {
      "id": 92,
      "start": 2327.0599975585938,
      "end": 2333.8200073242188,
      "text": " Nebuchadnezzar? He was pretty powerful, wasn't he? He was the king of Babylon, the"
    },
    {
      "id": 93,
      "start": 2333.8200073242188,
      "end": 2339.97998046875,
      "text": " most powerful empire at that time, the world empire. He was the king, had all the"
    },
    {
      "id": 94,
      "start": 2339.97998046875,
      "end": 2345.0999755859375,
      "text": " power. In fact, it's obvious when Shadrach, Meshach, and Abednego decide"
    },
    {
      "id": 95,
      "start": 2345.0999755859375,
      "end": 2350.9400024414062,
      "text": " that they're not gonna bow down, they're gonna stand in courageous... and stand in"
    },
    {
      "id": 96,
      "start": 2350.9400024414062,
      "end": 2356.02001953125,
      "text": " defiance with courage against that mandate that had been given by"
    },
    {
      "id": 97,
      "start": 2356.02001953125,
      "end": 2361.0999755859375,
      "text": " Nebuchadnezzar, and they stand courageously. And he says, who is that"
    },
    {
      "id": 98,
      "start": 2361.0999755859375,
      "end": 2365.1400146484375,
      "text": " God that shall deliver you out of my hand? And then he found out who that God"
    },
    {
      "id": 99,
      "start": 2365.1400146484375,
      "end": 2373.6199951171875,
      "text": " was. What happened to Nebuchadnezzar? God gave him over. He was like an animal out"
    },
    {
      "id": 100,
      "start": 2373.6199951171875,
      "end": 2382.6599731445312,
      "text": " in the field, right? We must recognize this evening that everything that we"
    },
    {
      "id": 101,
      "start": 2382.6599731445312,
      "end": 2391.0999755859375,
      "text": " have is because of the good hand of God. Every good gift, right? James 1 verse 17,"
    },
    {
      "id": 102,
      "start": 2391.0999755859375,
      "end": 2396.6599731445312,
      "text": " it comes from where? It comes from above. It comes from God. Our God is good. And"
    },
    {
      "id": 103,
      "start": 2396.6599731445312,
      "end": 2402.0999755859375,
      "text": " Jacob is acknowledging some powerful truth here."
    },
    {
      "id": 0,
      "start": 2402.0999755859375,
      "end": 2406.1799755096436,
      "text": " that is important for every child of God to recognize."
    },
    {
      "id": 1,
      "start": 2406.1799755096436,
      "end": 2410.0199756622314,
      "text": " In fact, later on, as God is preparing the children"
    },
    {
      "id": 2,
      "start": 2410.0199756622314,
      "end": 2412.8399753570557,
      "text": " of Israel for entrance into the land"
    },
    {
      "id": 3,
      "start": 2412.8399753570557,
      "end": 2416.9799757003784,
      "text": " and he's using Moses to give them instruction,"
    },
    {
      "id": 4,
      "start": 2416.9799757003784,
      "end": 2419.0999755859375,
      "text": " God reminds them of this."
    },
    {
      "id": 5,
      "start": 2419.0999755859375,
      "end": 2422.219976425171,
      "text": " God reminds them of this in Deuteronomy 8,"
    },
    {
      "id": 6,
      "start": 2422.219976425171,
      "end": 2423.4199752807617,
      "text": " in verse number 18, it says,"
    },
    {
      "id": 7,
      "start": 2423.4199752807617,
      "end": 2425.699975967407,
      "text": " \"'But thou shalt remember the Lord thy God,"
    },
    {
      "id": 8,
      "start": 2425.699975967407,
      "end": 2429.8399753570557,
      "text": " \"'for it is he that giveth thee power to get wealth,"
    },
    {
      "id": 9,
      "start": 2429.8399753570557,
      "end": 2431.459976196289,
      "text": " \"'that he may establish his covenant,"
    },
    {
      "id": 10,
      "start": 2431.479974746704,
      "end": 2433.999975204468,
      "text": " \"'which he sware unto thy fathers, as it is this day.'\""
    },
    {
      "id": 11,
      "start": 2433.999975204468,
      "end": 2435.1999740600586,
      "text": " And so he says, listen,"
    },
    {
      "id": 12,
      "start": 2436.1599769592285,
      "end": 2437.7199745178223,
      "text": " Moses is given this instruction,"
    },
    {
      "id": 13,
      "start": 2437.7199745178223,
      "end": 2439.4799766540527,
      "text": " we have to recognize that it's God"
    },
    {
      "id": 14,
      "start": 2439.4799766540527,
      "end": 2442.7599754333496,
      "text": " that gives us the power to get this wealth."
    },
    {
      "id": 15,
      "start": 2442.7599754333496,
      "end": 2445.119976043701,
      "text": " You use that terminology, you've heard it, no doubt,"
    },
    {
      "id": 16,
      "start": 2445.119976043701,
      "end": 2447.3199768066406,
      "text": " where people talk about being a self-made man,"
    },
    {
      "id": 17,
      "start": 2447.3199768066406,
      "end": 2448.4799766540527,
      "text": " there's no such thing."
    },
    {
      "id": 18,
      "start": 2449.4399757385254,
      "end": 2451.1599769592285,
      "text": " There really isn't."
    },
    {
      "id": 19,
      "start": 2451.1599769592285,
      "end": 2454.799976348877,
      "text": " We find that God, in his grace and his mercy,"
    },
    {
      "id": 20,
      "start": 2454.799976348877,
      "end": 2457.3199768066406,
      "text": " and he would give us the abilities that he gives us"
    },
    {
      "id": 21,
      "start": 2457.3199768066406,
      "end": 2460.799976348877,
      "text": " and how important that we find this evening,"
    },
    {
      "id": 22,
      "start": 2460.799976348877,
      "end": 2462.679977416992,
      "text": " this statement of Jacob when he says,"
    },
    {
      "id": 23,
      "start": 2462.679977416992,
      "end": 2464.739974975586,
      "text": " \"'Of all that thou shalt give me,'"
    },
    {
      "id": 24,
      "start": 2464.739974975586,
      "end": 2468.9799728393555,
      "text": " recognizing that it's God that is the one that gives."
    },
    {
      "id": 25,
      "start": 2468.9799728393555,
      "end": 2472.339973449707,
      "text": " This God that is the one that blesses."
    },
    {
      "id": 26,
      "start": 2472.339973449707,
      "end": 2475.759979248047,
      "text": " Jacob is finally, I believe, coming to a place"
    },
    {
      "id": 27,
      "start": 2475.759979248047,
      "end": 2478.4999771118164,
      "text": " where he's understanding it's no longer needful."
    },
    {
      "id": 28,
      "start": 2478.4999771118164,
      "end": 2480.4199752807617,
      "text": " We've said this multiple times"
    },
    {
      "id": 29,
      "start": 2480.4199752807617,
      "end": 2481.579978942871,
      "text": " in the last several chapters,"
    },
    {
      "id": 30,
      "start": 2481.579978942871,
      "end": 2484.3199768066406,
      "text": " living by faith does not require scheming."
    },
    {
      "id": 31,
      "start": 2486.05997467041,
      "end": 2486.8999786376953,
      "text": " He's coming to this place"
    },
    {
      "id": 32,
      "start": 2486.8999786376953,
      "end": 2489.7799758911133,
      "text": " where he's recognizing that God is the giver."
    },
    {
      "id": 33,
      "start": 2489.7999725341797,
      "end": 2492.639976501465,
      "text": " And he says, \"'Of all that thou shalt give me,'"
    },
    {
      "id": 34,
      "start": 2492.639976501465,
      "end": 2493.939971923828,
      "text": " notice what he says,"
    },
    {
      "id": 35,
      "start": 2493.939971923828,
      "end": 2498.939971923828,
      "text": " \"'I will surely give the 10th unto thee.'\""
    },
    {
      "id": 36,
      "start": 2499.3199768066406,
      "end": 2500.9999771118164,
      "text": " I will surely give the 10th unto thee."
    },
    {
      "id": 37,
      "start": 2500.9999771118164,
      "end": 2503.2199783325195,
      "text": " And so we find that he recognizes"
    },
    {
      "id": 38,
      "start": 2503.2199783325195,
      "end": 2505.139976501465,
      "text": " that the Lord is the giver of all things"
    },
    {
      "id": 39,
      "start": 2505.139976501465,
      "end": 2508.0399780273438,
      "text": " and he's committed to giving a tithe,"
    },
    {
      "id": 40,
      "start": 2508.0399780273438,
      "end": 2510.359977722168,
      "text": " as we'd understand, a 10th unto thee."
    },
    {
      "id": 41,
      "start": 2510.359977722168,
      "end": 2511.639976501465,
      "text": " And he's committed to that"
    },
    {
      "id": 42,
      "start": 2511.639976501465,
      "end": 2513.5999755859375,
      "text": " and he's recognizing the significance"
    },
    {
      "id": 43,
      "start": 2513.5999755859375,
      "end": 2514.7199783325195,
      "text": " and the importance of that"
    },
    {
      "id": 44,
      "start": 2514.7199783325195,
      "end": 2517.519973754883,
      "text": " and really the blessing of that."
    },
    {
      "id": 45,
      "start": 2517.519973754883,
      "end": 2518.9199752807617,
      "text": " This is pre-law."
    },
    {
      "id": 46,
      "start": 2518.939971923828,
      "end": 2521.0999755859375,
      "text": " So many people wanna argue,"
    },
    {
      "id": 47,
      "start": 2521.0999755859375,
      "end": 2522.9999771118164,
      "text": " even as I mentioned this morning, with miracles."
    },
    {
      "id": 48,
      "start": 2522.9999771118164,
      "end": 2526.9799728393555,
      "text": " They wanna dismiss and argue about miracles"
    },
    {
      "id": 49,
      "start": 2526.9799728393555,
      "end": 2529.179977416992,
      "text": " and try to explain away."
    },
    {
      "id": 50,
      "start": 2529.179977416992,
      "end": 2531.8599700927734,
      "text": " And people that wanna try to get out of giving a tithe,"
    },
    {
      "id": 51,
      "start": 2531.8599700927734,
      "end": 2532.699981689453,
      "text": " they try to explain away,"
    },
    {
      "id": 52,
      "start": 2532.699981689453,
      "end": 2535.6199798583984,
      "text": " \"'Well, we're not under the law,' and so on and so forth."
    },
    {
      "id": 53,
      "start": 2535.6199798583984,
      "end": 2539.3999786376953,
      "text": " \"'Abraham gave of the tithe, Jacob's committing to it.'\""
    },
    {
      "id": 54,
      "start": 2539.3999786376953,
      "end": 2541.5399780273438,
      "text": " It's not necessarily just part of the law."
    },
    {
      "id": 55,
      "start": 2543.199981689453,
      "end": 2547.3599700927734,
      "text": " Giving to God is a blessing, is an absolute blessing."
    },
    {
      "id": 56,
      "start": 2547.3599700927734,
      "end": 2549.459976196289,
      "text": " By the way, you could never out-give God."
    },
    {
      "id": 57,
      "start": 2550.759979248047,
      "end": 2551.5999755859375,
      "text": " Somebody said this."
    },
    {
      "id": 58,
      "start": 2551.5999755859375,
      "end": 2553.439971923828,
      "text": " Letourneau actually was the one that said it."
    },
    {
      "id": 59,
      "start": 2553.439971923828,
      "end": 2557.719970703125,
      "text": " And he had actually suffered some really difficult days"
    },
    {
      "id": 60,
      "start": 2557.719970703125,
      "end": 2561.3999786376953,
      "text": " leading up into the Great Depression in the 1930s."
    },
    {
      "id": 61,
      "start": 2561.3999786376953,
      "end": 2563.1199798583984,
      "text": " And he was a Christian man."
    },
    {
      "id": 62,
      "start": 2563.1199798583984,
      "end": 2565.97998046875,
      "text": " Many people had encouraged him to file bankruptcy"
    },
    {
      "id": 63,
      "start": 2565.97998046875,
      "end": 2566.8599700927734,
      "text": " and so on and so forth,"
    },
    {
      "id": 64,
      "start": 2566.8599700927734,
      "end": 2568.759979248047,
      "text": " but he was committed to doing the right thing"
    },
    {
      "id": 65,
      "start": 2568.759979248047,
      "end": 2570.9199829101562,
      "text": " and to having integrity and to paying his bills"
    },
    {
      "id": 66,
      "start": 2570.9199829101562,
      "end": 2571.8799743652344,
      "text": " and so on and so forth."
    },
    {
      "id": 67,
      "start": 2571.8799743652344,
      "end": 2573.939971923828,
      "text": " And he was committed to giving to God."
    },
    {
      "id": 68,
      "start": 2573.939971923828,
      "end": 2576.4199829101562,
      "text": " And here's what Letourneau said."
    },
    {
      "id": 69,
      "start": 2576.4199829101562,
      "end": 2578.3399810791016,
      "text": " He said, when I think about giving to God,"
    },
    {
      "id": 70,
      "start": 2578.3399810791016,
      "end": 2579.8199768066406,
      "text": " your perspective has to be this."
    },
    {
      "id": 71,
      "start": 2579.8199768066406,
      "end": 2584.3399810791016,
      "text": " It's not how much of my money I give to God,"
    },
    {
      "id": 72,
      "start": 2584.3399810791016,
      "end": 2588.259979248047,
      "text": " but it's how much of God's money I keep for myself."
    },
    {
      "id": 73,
      "start": 2588.259979248047,
      "end": 2590.6199798583984,
      "text": " That's a different way to think about it."
    },
    {
      "id": 74,
      "start": 2590.6199798583984,
      "end": 2592.4199829101562,
      "text": " I like that."
    },
    {
      "id": 75,
      "start": 2592.4199829101562,
      "end": 2595.999969482422,
      "text": " By the way, Letourneau was famously known"
    },
    {
      "id": 76,
      "start": 2595.999969482422,
      "end": 2600.0999755859375,
      "text": " for giving 90% to God and keeping 10% for himself."
    },
    {
      "id": 77,
      "start": 2601.0999755859375,
      "end": 2602.6599731445312,
      "text": " I'm not suggesting anyone do that."
    },
    {
      "id": 78,
      "start": 2602.6599731445312,
      "end": 2604.259979248047,
      "text": " You better pray about it, amen?"
    },
    {
      "id": 79,
      "start": 2604.259979248047,
      "end": 2606.219970703125,
      "text": " You start doing that and you can't pay your electric bill"
    },
    {
      "id": 80,
      "start": 2607.0599822998047,
      "end": 2608.1399688720703,
      "text": " and you're gonna call me, amen?"
    },
    {
      "id": 81,
      "start": 2608.1399688720703,
      "end": 2610.499969482422,
      "text": " But the reality is that, man,"
    },
    {
      "id": 82,
      "start": 2610.499969482422,
      "end": 2611.6199798583984,
      "text": " that's what a great perspective."
    },
    {
      "id": 83,
      "start": 2611.6199798583984,
      "end": 2614.019973754883,
      "text": " It's not how much of my money I give God,"
    },
    {
      "id": 84,
      "start": 2614.019973754883,
      "end": 2616.679977416992,
      "text": " but how much of God's money I keep for myself."
    },
    {
      "id": 85,
      "start": 2616.679977416992,
      "end": 2617.519973754883,
      "text": " Why?"
    },
    {
      "id": 86,
      "start": 2617.519973754883,
      "end": 2621.3799743652344,
      "text": " Because I'm recognizing that God, He gives me all of this."
    },
    {
      "id": 87,
      "start": 2621.3799743652344,
      "end": 2623.219970703125,
      "text": " He's been so good to me."
    },
    {
      "id": 88,
      "start": 2623.219970703125,
      "end": 2625.459976196289,
      "text": " I want you to think about this in 1 Chronicles 29,"
    },
    {
      "id": 89,
      "start": 2625.459976196289,
      "end": 2627.459976196289,
      "text": " and we'll finish here."
    },
    {
      "id": 90,
      "start": 2627.459976196289,
      "end": 2630.3199768066406,
      "text": " The life of David near the end of his life."
    },
    {
      "id": 91,
      "start": 2632.499969482422,
      "end": 2634.2999725341797,
      "text": " And I don't have time to look at all of this"
    },
    {
      "id": 92,
      "start": 2634.2999725341797,
      "end": 2638.179977416992,
      "text": " that the hour's gone, I need to wrap up the message,"
    },
    {
      "id": 93,
      "start": 2638.179977416992,
      "end": 2640.699981689453,
      "text": " but I want you to see here in 1 Chronicles 29,"
    },
    {
      "id": 94,
      "start": 2640.699981689453,
      "end": 2642.5399780273438,
      "text": " perhaps you'd like to go back and read it later"
    },
    {
      "id": 95,
      "start": 2642.5399780273438,
      "end": 2646.259979248047,
      "text": " this evening, this week, make a note to read this passage."
    },
    {
      "id": 96,
      "start": 2646.259979248047,
      "end": 2650.3399810791016,
      "text": " It's just fabulous, the response of David and the people"
    },
    {
      "id": 97,
      "start": 2650.3399810791016,
      "end": 2653.8799743652344,
      "text": " with the ability to give to the work of God."
    },
    {
      "id": 98,
      "start": 2653.8799743652344,
      "end": 2656.6399688720703,
      "text": " David is giving to a work that he'd never see fulfilled."
    },
    {
      "id": 99,
      "start": 2656.6399688720703,
      "end": 2659.1399841308594,
      "text": " He'd never see the temple completed."
    },
    {
      "id": 100,
      "start": 2659.1399841308594,
      "end": 2660.699981689453,
      "text": " He'd never worship God in the temple,"
    },
    {
      "id": 101,
      "start": 2660.699981689453,
      "end": 2662.699981689453,
      "text": " but yet he's giving and he's preparing"
    },
    {
      "id": 102,
      "start": 2662.699981689453,
      "end": 2663.97998046875,
      "text": " and he's offering willingly."
    },
    {
      "id": 103,
      "start": 2664.6599731445312,
      "end": 2666.6599731445312,
      "text": " And I want you to see that they're rejoicing greatly"
    },
    {
      "id": 104,
      "start": 2666.6599731445312,
      "end": 2668.3399658203125,
      "text": " because of the opportunity to give."
    },
    {
      "id": 105,
      "start": 2668.3399658203125,
      "end": 2670.179962158203,
      "text": " In fact, it says in verse number nine,"
    },
    {
      "id": 106,
      "start": 2670.179962158203,
      "end": 2672.3799743652344,
      "text": " then the people rejoiced, why?"
    },
    {
      "id": 107,
      "start": 2672.3799743652344,
      "end": 2673.97998046875,
      "text": " For that they offered willingly,"
    },
    {
      "id": 108,
      "start": 2673.97998046875,
      "end": 2675.1399841308594,
      "text": " because with perfect heart,"
    },
    {
      "id": 109,
      "start": 2675.1399841308594,
      "end": 2677.0999755859375,
      "text": " they offered willingly to the Lord."
    },
    {
      "id": 110,
      "start": 2677.0999755859375,
      "end": 2679.4199829101562,
      "text": " And David the king also rejoiced, how?"
    },
    {
      "id": 111,
      "start": 2679.4199829101562,
      "end": 2680.999969482422,
      "text": " With great joy."
    },
    {
      "id": 112,
      "start": 2683.219970703125,
      "end": 2685.699981689453,
      "text": " Why could they rejoice at the giving?"
    },
    {
      "id": 113,
      "start": 2685.699981689453,
      "end": 2687.8599853515625,
      "text": " Why could they rejoice in the manner in which they did?"
    },
    {
      "id": 114,
      "start": 2687.8599853515625,
      "end": 2689.179962158203,
      "text": " Well, it's because of their perspective."
    },
    {
      "id": 115,
      "start": 2689.179962158203,
      "end": 2691.6199645996094,
      "text": " Notice in verse number 14, it says,"
    },
    {
      "id": 116,
      "start": 2691.6199645996094,
      "end": 2693.739990234375,
      "text": " but who am I and what is my people"
    },
    {
      "id": 117,
      "start": 2694.499969482422,
      "end": 2697.1399841308594,
      "text": " that we should be able to offer so willingly"
    },
    {
      "id": 118,
      "start": 2697.1399841308594,
      "end": 2699.0999755859375,
      "text": " after this sort?"
    },
    {
      "id": 119,
      "start": 2699.0999755859375,
      "end": 2702.939971923828,
      "text": " For all things come of thee and of thine own"
    },
    {
      "id": 120,
      "start": 2702.939971923828,
      "end": 2704.519989013672,
      "text": " have we given thee."
    },
    {
      "id": 121,
      "start": 2705.6599731445312,
      "end": 2707.5799865722656,
      "text": " Man, we change our perspective"
    },
    {
      "id": 122,
      "start": 2707.5799865722656,
      "end": 2710.8999633789062,
      "text": " and it really changes our entire outlook, does it not?"
    },
    {
      "id": 123,
      "start": 2710.8999633789062,
      "end": 2714.5399780273438,
      "text": " And here, Jacob, a man who is known for,"
    },
    {
      "id": 124,
      "start": 2714.5399780273438,
      "end": 2718.739990234375,
      "text": " as we've studied his life, he's known for me and myself"
    },
    {
      "id": 125,
      "start": 2718.739990234375,
      "end": 2721.019989013672,
      "text": " and how can I benefit and how can I get"
    },
    {
      "id": 126,
      "start": 2721.019989013672,
      "end": 2723.179962158203,
      "text": " and how can I, in this situation,"
    },
    {
      "id": 127,
      "start": 2723.5399780273438,
      "end": 2725.8599853515625,
      "text": " how can I benefit the most?"
    },
    {
      "id": 128,
      "start": 2725.8599853515625,
      "end": 2728.439971923828,
      "text": " But then he meets the Lord personally."
    },
    {
      "id": 129,
      "start": 2729.4599609375,
      "end": 2731.939971923828,
      "text": " He departed, had a dream,"
    },
    {
      "id": 130,
      "start": 2732.97998046875,
      "end": 2735.939971923828,
      "text": " and in that dream, he saw a vision,"
    },
    {
      "id": 131,
      "start": 2735.939971923828,
      "end": 2738.739990234375,
      "text": " but more than seeing a vision, he heard a voice."
    },
    {
      "id": 132,
      "start": 2738.739990234375,
      "end": 2741.0999755859375,
      "text": " And he heard the voice of God."
    },
    {
      "id": 133,
      "start": 2741.0999755859375,
      "end": 2743.6199645996094,
      "text": " And God gave him some promise"
    },
    {
      "id": 134,
      "start": 2743.6199645996094,
      "end": 2745.6199645996094,
      "text": " with regard to the Abrahamic covenant"
    },
    {
      "id": 135,
      "start": 2745.6199645996094,
      "end": 2748.1399841308594,
      "text": " and with regard to the land and the seed,"
    },
    {
      "id": 136,
      "start": 2748.1399841308594,
      "end": 2753.1399841308594,
      "text": " but God spoke about his life personally in verse number 15."
    },
    {
      "id": 137,
      "start": 2753.3799743652344,
      "end": 2756.6199645996094,
      "text": " And all that God said he would do for Jacob."
    },
    {
      "id": 138,
      "start": 2756.6199645996094,
      "end": 2760.219970703125,
      "text": " And Jacob responded and he made some declarations"
    },
    {
      "id": 139,
      "start": 2760.219970703125,
      "end": 2763.8999633789062,
      "text": " and through his response and through these declarations,"
    },
    {
      "id": 140,
      "start": 2763.8999633789062,
      "end": 2766.6599731445312,
      "text": " we see that he's a changed individual."
    },
    {
      "id": 141,
      "start": 2767.97998046875,
      "end": 2771.1399841308594,
      "text": " And he concludes by saying,"
    },
    {
      "id": 142,
      "start": 2771.1399841308594,
      "end": 2772.8999633789062,
      "text": " of all that thou shalt give me,"
    },
    {
      "id": 143,
      "start": 2772.8999633789062,
      "end": 2777.1399841308594,
      "text": " I will surely give the 10th unto thee."
    },
    {
      "id": 144,
      "start": 2777.1399841308594,
      "end": 2779.679962158203,
      "text": " He understood that God had given him"
    },
    {
      "id": 145,
      "start": 2779.679962158203,
      "end": 2781.499969482422,
      "text": " some encouraging promises."
    },
    {
      "id": 146,
      "start": 2781.499969482422,
      "end": 2785.2999877929688,
      "text": " And he said, the Lord shall be my God."
    },
    {
      "id": 147,
      "start": 2786.3999633789062,
      "end": 2788.219970703125,
      "text": " The Lord shall be my God."
    },
    {
      "id": 148,
      "start": 2788.219970703125,
      "end": 2790.0999755859375,
      "text": " And here's how I'm gonna worship him."
    },
    {
      "id": 149,
      "start": 2790.0999755859375,
      "end": 2792.0599670410156,
      "text": " Here's how I'm gonna serve him."
    },
    {
      "id": 150,
      "start": 2792.0599670410156,
      "end": 2793.4599609375,
      "text": " This evening, I'm so thankful"
    },
    {
      "id": 151,
      "start": 2793.4599609375,
      "end": 2795.219970703125,
      "text": " that God revealed himself to me."
    },
    {
      "id": 152,
      "start": 2796.179962158203,
      "end": 2798.6199645996094,
      "text": " Aren't you glad that God revealed himself to you?"
    },
    {
      "id": 153,
      "start": 2799.499969482422,
      "end": 2801.5399780273438,
      "text": " Man, that we can know him,"
    },
    {
      "id": 154,
      "start": 2801.5399780273438,
      "end": 2804.0999755859375,
      "text": " we can have that relationship with him."
    },
    {
      "id": 155,
      "start": 2804.0999755859375,
      "end": 2805.699981689453,
      "text": " But how's it impact us?"
    },
    {
      "id": 156,
      "start": 2805.699981689453,
      "end": 2807.179962158203,
      "text": " How does it change our behavior?"
    },
    {
      "id": 157,
      "start": 2807.179962158203,
      "end": 2808.499969482422,
      "text": " How does it change our outlook?"
    },
    {
      "id": 158,
      "start": 2808.499969482422,
      "end": 2813.219970703125,
      "text": " How does it change our perspective in life?"
    },
    {
      "id": 159,
      "start": 2813.219970703125,
      "end": 2817.179962158203,
      "text": " Because when we know him and we know his promises,"
    },
    {
      "id": 160,
      "start": 2817.179962158203,
      "end": 2819.4199829101562,
      "text": " it's going to have an impact in our lives."
    },
    {
      "id": 161,
      "start": 2819.4199829101562,
      "end": 2821.0799865722656,
      "text": " It's gonna change us."
    },
    {
      "id": 162,
      "start": 2822.3799743652344,
      "end": 2823.6199645996094,
      "text": " Father, we love you."
    },
    {
      "id": 163,
      "start": 2824.4599609375,
      "end": 2826.0999755859375,
      "text": " We thank you for loving us."
    },
    {
      "id": 164,
      "start": 2827.1399841308594,
      "end": 2831.679962158203,
      "text": " We thank you for the change in Jacob's life."
    },
    {
      "id": 165,
      "start": 2834.3399658203125,
      "end": 2836.97998046875,
      "text": " Up to this point, we've seen very little"
    },
    {
      "id": 166,
      "start": 2837.939971923828,
      "end": 2839.4599609375,
      "text": " of anything spiritual."
    },
    {
      "id": 167,
      "start": 2842.8599853515625,
      "end": 2844.3399658203125,
      "text": " But now we see a changed man"
    },
    {
      "id": 168,
      "start": 2846.3399658203125,
      "end": 2851.3399658203125,
      "text": " making some powerful declarations, commitments."
    },
    {
      "id": 169,
      "start": 2855.219970703125,
      "end": 2858.0999755859375,
      "text": " God, I pray this evening that you'd help us"
    },
    {
      "id": 170,
      "start": 2861.699981689453,
      "end": 2864.4599609375,
      "text": " to really evaluate and consider tonight"
    },
    {
      "id": 171,
      "start": 2865.4599609375,
      "end": 2868.8599853515625,
      "text": " the wonderful promises that you've given to us"
    },
    {
      "id": 172,
      "start": 2868.8599853515625,
      "end": 2871.4599609375,
      "text": " and how we respond to those promises,"
    },
    {
      "id": 173,
      "start": 2873.1399841308594,
      "end": 2878.1399841308594,
      "text": " how we determine to live in obedience to you and to your word,"
    },
    {
      "id": 174,
      "start": 2879.1399841308594,
      "end": 2884.1399841308594,
      "text": " how we become more concerned about your kingdom"
    },
    {
      "id": 175,
      "start": 2888.4599609375,
      "end": 2889.739990234375,
      "text": " than my life."
    },
    {
      "id": 176,
      "start": 2890.739990234375,
      "end": 2894.8599853515625,
      "text": " Just a few weeks ago, the teenager sang a powerful song"
    },
    {
      "id": 177,
      "start": 2899.3399658203125,
      "end": 2901.259979248047,
      "text": " about living their lives in such a way"
    },
    {
      "id": 178,
      "start": 2901.259979248047,
      "end": 2903.259979248047,
      "text": " that you would be glorified"
    },
    {
      "id": 179,
      "start": 2903.259979248047,
      "end": 2907.219970703125,
      "text": " and not looking for recognition or name"
    },
    {
      "id": 180,
      "start": 2907.219970703125,
      "end": 2909.3799743652344,
      "text": " or type of recognition here upon this earth,"
    },
    {
      "id": 181,
      "start": 2909.3799743652344,
      "end": 2910.8999633789062,
      "text": " but living for you, Lord."
    },
    {
      "id": 182,
      "start": 2911.97998046875,
      "end": 2914.5399780273438,
      "text": " God, I pray that even as we see that in Jacob's life"
    },
    {
      "id": 183,
      "start": 2914.5399780273438,
      "end": 2917.0999755859375,
      "text": " in these last verses of Scripture,"
    },
    {
      "id": 184,
      "start": 2917.0999755859375,
      "end": 2918.8999633789062,
      "text": " that it would be seen in our lives."
    },
    {
      "id": 185,
      "start": 2920.6599731445312,
      "end": 2922.219970703125,
      "text": " It's about you, Lord."
    },
    {
      "id": 186,
      "start": 2922.219970703125,
      "end": 2925.8599853515625,
      "text": " As John the Baptist said of the Lord Jesus Christ,"
    },
    {
      "id": 187,
      "start": 2925.8599853515625,
      "end": 2928.699951171875,
      "text": " he must increase, I must decrease."
    },
    {
      "id": 188,
      "start": 2929.8599853515625,
      "end": 2933.4599609375,
      "text": " Help us to recognize that you're the giver of all things."
    },
    {
      "id": 189,
      "start": 2933.4599609375,
      "end": 2936.4599609375,
      "text": " Help us to be faithful and obedient to you and to your word,"
    },
    {
      "id": 190,
      "start": 2937.5,
      "end": 2939.5799560546875,
      "text": " to rejoice in the privilege and opportunity"
    },
    {
      "id": 191,
      "start": 2939.5799560546875,
      "end": 2940.97998046875,
      "text": " that we have to give to you."
    },
    {
      "id": 192,
      "start": 2942.219970703125,
      "end": 2943.8199462890625,
      "text": " I pray that you'd move and work as only you can"
    },
    {
      "id": 193,
      "start": 2943.8199462890625,
      "end": 2944.8199462890625,
      "text": " and we'll thank you for it."
    },
    {
      "id": 194,
      "start": 2944.8199462890625,
      "end": 2945.739990234375,
      "text": " In Christ's name we pray."
    },
    {
      "id": 195,
      "start": 2945.739990234375,
      "end": 2946.5799560546875,
      "text": " Would you stand with me?"
    }
  ],
  "processed_at": "2025-04-16T16:13:03.716238"
}