{
  "video_id": "QN66bc7XOjk",
  "text": "over to the book of Psalms, Psalm 105. Psalm 105 this morning, and be looking at verses 23 down through verse number 28. And if you've looked at the back of the bulletin already this morning, you see the title for the message is this, in Egypt, God made his greatness known. The people of God, as you know, were in Egyptian bondage and God was going to bring them out. We mentioned in our previous message on our subject, our theme for Sunday mornings, great is the Lord, that he, God, the Lord God Almighty, he appeared to Moses in Horeb. And in that place, he revealed to Moses his plan. We spoke about the greatness of God as it was revealed to Moses in that particular text of scripture, as we look through Exodus 3, 4, and 5, and mentioned a number of things. And it's interesting as you begin to think about all that God would do and all that God was showing Moses, he would later declare in the book of Deuteronomy, this great statement about God beginning to show his greatness to his servant. And we find that it began there in Horeb, but it continues in Egypt, Moses obeyed the command of the Lord. And Moses went and stood before Pharaoh. And as he stood before Pharaoh, he said what God told him to say, he delivered faithfully the message of the Lord. And here's what he said, thus saith the Lord, the Lord God of Israel, let my people go. And we know that that was met with opposition, that Pharaoh refused to allow the people of God to depart. And over the next several chapters in the book of Exodus, you find that God makes his greatness known in Egypt. As we're gonna think about the truth that our God is great, and in fact, he's revealed his greatness to us in his word. We've seen it over and over, even as we've studied this year, and in this particular theme of great is the Lord. The reality is that as we recognize how great he is, that we ought to finish the verse great is the Lord and greatly to be praised. And he is worthy of our praise, he is worthy of our worship, we should stand in awe of who our God is. It's interesting that the manner in which God revealed his power there in Egypt, he made his greatness known. We of course are familiar with the plagues and we'll mention as we get through the message this morning but it's of interest that here in Psalm 105, the psalmist makes reference to the plagues. In Psalm 78, the psalmist makes reference to the plagues. And then also in Psalm 106, there's a reference not as detailed as we find in Psalm 78 or in Psalm 105, but again, you see the reference in Psalm 106 to these plagues. It's interesting because there, as God would speak to Moses, he's there in Egypt, he tells Moses that with great judgments is recorded that way in Exodus six and verse number six, and then in chapter seven and verse number three, God promised that he would multiply his signs and wonders in Egypt. Notice with me here in Psalm 105, beginning in verse number 23, the Bible says this, Israel also came into Egypt and Jacob sojourned in the land of Ham and he increased his people greatly and made them stronger than their enemies. He turned their heart to hate his people to deal subtly with his servants. Notice he sent Moses his servant Aaron whom he had chosen. They showed his signs among them and wonders in the land of Ham. We'll read the rest of the text as we get through the message this morning, but I wanna draw your attention to that phrase in verse number 27 where the Bible says they showed his signs among them and wonders in the land of Egypt. That word that we find there in verse number 27, wonders, it really means a miracle. It really carries with it this idea, it's a special display of God's power, a special display of God's power. If you're familiar with the text of scripture in the book of Exodus with regard to the 10 plagues, you will understand that God indeed multiplied his signs and wonders, he made himself known and there was a special display of God's great power. I'm so thankful this morning that we serve the Lord God omnipotent, that he has all power. We speak about his omnipotence and we rejoice in understanding that even as he stood before Abram and said, is anything too hard for the Lord? And we know that the answer to that question is no and we find that as we study through the precious word of God, that God has revealed over and over and over to us again his great power. This morning, we serve the Lord God omnipotent. We find that here as we look at this portion of scripture, I want you to notice with me if you're taking notes, number one, 10 devastating plagues. We will not take the time to read all of the details with regard to the plagues as they're revealed to us in the book of Exodus, we will not take the time to go through all of that dialogue and what have you, but I do want you to understand that in chapters seven through 11 of the book of Exodus, you will find that these plagues are recorded and you begin to read about all that's taking place and as we look here and we think about these 10 devastating plagues, we find that the Bible says here in Psalm 105, beginning in verse number 28, he sent darkness and made it dark. Now understand that these are not in the same order that the plagues came as you read Exodus seven through 11, but it says here, he sent darkness and made it dark and they rebelled not against his word. He turned their waters into blood and slew their fish, their land brought forth frogs in abundance and the chambers of their kings. He spake and there came diverse sorts of flies and lice and all their coast. He gave them hail for rain and flaming fire in their land. He smote their vines also in their fig trees and break the trees of their coast. He spake and the locust came and the caterpillars and that without number and did eat up all the herbs in their land and devoured the fruit of their ground. He smote also all the firstborn in their land, the chief of all their strength. He brought them forth also with silver and gold and there was not one feeble person among their tribes. Notice in verse 38, it says Egypt was glad when they departed for the fear of them fell upon them. It's interesting as you consider the 10 devastating plagues and you understand the devastation that was endured there by Pharaoh, by Egypt and all of the Egyptians. It's really summarized for us by the servants of Pharaoh in Exodus 10 in verse number seven. Perhaps you wanna turn there and look at what the servants of Pharaoh say in this passage of scripture. In Exodus chapter number 10 in verse number seven, we find that this is only after seven of the plagues. There's still three more plagues to come. There are 10 devastating plagues. And after the seventh plague, we find that the servants of Pharaoh begin to speak to Pharaoh in chapter 10 in verse number seven. Notice what the Bible says. And Pharaoh's servants said unto him, how long shall this man be a snare unto us? Let the men go that they may serve the Lord their God. Knowest thou not yet that Egypt is destroyed? These plagues were devastating. The impact that it would have upon the lives of the Egyptians, we would understand that really every aspect of their life would be impacted. And you would think about the ways in which their livestock were destroyed. And it would certainly impact transportation and agriculture. It would impact all sorts of things. Every area of their lives, they were impacted by these plagues. It's interesting as you begin to study through the 10 plagues, you will find that the first three affected both the Egyptians and the children of Israel. You'll find that in those first three plagues, it was affected all that were in the land. And so the children of Israel were not exempt in those first three plagues. But as you continue to read through the account in the book of Exodus with regard to these 10 devastating plagues, you will find that plagues number four through nine only impacted the Egyptians. God made his power known that he could bring these plagues upon all. But then think about the display of God's power in the fourth through ninth plague when the Egyptians were affected, but the children of Israel were not affected. God's great power. I would submit to you that not only was God's power displayed in the devastating plagues and bringing of the plagues, but I would say also in the departure of the plagues, you would read through the accounts in Exodus seven through 11. I would just deal with the first one with frogs and begin to think about frogs. And maybe you like frogs, but you don't want frogs everywhere. Bed, chamber, oven, all over the place. I mean, think about all these frogs. And then the magicians, they were like, well, we can make frogs too. I've never understood that. You got so many frogs, frogs coming all over the place, and these magicians are gonna create more frogs. It just doesn't make any kind of sense to me. But we find that in each of these accounts, as you look through the book of Exodus and just using that one particular example, that God would send Moses to appear before Pharaoh once again. And after Pharaoh and Moses would have a conversation, many times the conversation would go something like this. Pharaoh would say, listen, if you would just allow this plague to depart, then we'll let you go. And so Moses would say, depending on the particular plague, here's what's going to happen. I'm gonna depart, raise up my hands, and it will go. will be gone. Man, God's power. God's power. Not only to bring the plague, but then for the departure of the plague. And we're going to see how God is revealing His power. We see in the first three that all are affected and in four through nine just the Egyptians. Of course we know that the death of the firstborn, that tenth plague, that the Bible would tell us that those only would be exempt if they applied the blood. We spake this morning, we sang the song about the power in the blood. And I'm so thankful for the blood of Jesus Christ and I'm so thankful that we can sing this morning about the blood. And I'm so thankful that as we look at the Old Testament and even as we find that the Bible would tell us in Hebrews chapter number 10 that the Old Testament and the law and all of those offerings and sacrifices that they were a shadow of good things to come. And I think about this Passover as it would be known, as you would think about the tenth plague and you would think about the application of the blood and the Bible would teach us and show us how that Paul would conclude to the believers in Corinth, Christ our Passover. And I'm so thankful for the blood. Listen, the only way, there was only one way for the firstborn of any home, any household not to be destroyed, not to be killed, and that only way was by applying the blood. There was but one way that God prescribed and we find that that had to be followed exactly how God said in order to spare life. And we would find this morning that even as we look at that wonderful truth of that tenth plague that Jesus teaches us as we look at the truth of the gospel that there's just one way to be saved. There are not many ways to be saved. There are some that have this idea that you just are sincere in whatever you believe and you'll just make it at the end. And I would submit to you that that's just not biblically accurate. No doubt there are people that are sincere in what they believe but I would say to you that they are sincerely wrong. You can be wrong and be sincere. We find that Jesus said, I am the way. He didn't say a way. He said I am the way, the truth and the life. No man cometh unto the Father but by me. And I'm so thankful that God Almighty took our place so that we could be redeemed. See, there's only one way to be saved and we see in these ten devastating plagues that even as God was displaying His power in all that's taking place and all that is recorded for us in the book of Exodus with regard to these plagues and God there in Egypt making His greatness known, we find that even in that tenth plague, again as you follow the crimson cord through the scriptures, you'll find again that truth of the blood. And every time they would observe the Passover, they would be reminded of what God did in Egypt. But they would also be reminded of what God promised to do one day at a place called Calvary. And I'm so thankful that this morning that as we sit here, as we have the opportunity as New Testament believers that we can look back to that day at Calvary when Jesus went to that cruel cross and He shed His precious blood, that one work where He offered Himself one time for sin forever, what a blessed truth. This morning as we look at God demonstrating His greatness and making His greatness known in Egypt, we see ten devastating plagues. Number two, if you're taking notes, I want you to note God's divine power. We've already made mention with regard to the power of God being displayed with regard to these plagues that He brought upon the Egyptians, but we find that it's very interesting as I begin to study through the book of Exodus and these particular testimonies and the accounts, it's interesting to me that we find that God is revealing His power first to His own people, to His own people. You understand that the children of Israel, they had to know how powerful God was. They had to understand the power of God. They were in Egyptian bondage. They were in a place where their life was bitter and hard and difficult and all that they were facing and God said, I'm going to bring you out and I'm going to bring you to a place and we find that even as we would trace the steps of the children of Israel, as we would go forward through the scriptures and we would understand that God already knew all of those things that would take place. See, we know as we read the Bible, we know that the Egyptians would be devastated through those plagues and that the children of Israel would depart from the land of Egypt, but we find they'd end up in a place called the Red Sea. Now God knew that, for the Bible tells us as you study through the portion of scripture that it was God that led them to that very place. It was not that Moses had bad directional leadership and he just went the wrong way and came to a place of difficulty. No, it was God Almighty that led them directly to that place and God through these plagues, He was revealing His power to His people so that they would know what God is able to do. I would say to you on a number of occasions, they just didn't get the lesson. On a number of occasions they'd face a great difficulty. They'd not remember what God did. They would not recall what God did there in Egypt and all that He displayed to them, but we find that God was desiring that His people, the children of Israel, would know His power. In fact, the Bible says it this way in Psalm 106 and verses 21 and 22, it says, they forgot God their Savior, which had done great things in Egypt. And He showed His greatness. He made His greatness known in Egypt. You think about those spies that went out. They went to spy out the land of Canaan and they say ten of them were just not able. I mean the people have defense cities. I mean they have walled cities. The people, they're giants in the land. There are two that stood and say God is able. God is able. And we find this morning that as we look at God's divine power here as He's making His greatness known in Egypt, He's preparing His children for that which would come for those events that they would face in their lives and He's revealed His power to them. We find that God also reveals His power to the Egyptians. No doubt they recognized the greatness of God's power. We find that the Egyptian society would be a people group, a society that was polytheistic. You would find that there were people that worshipped a plurality of gods. They did not serve the Lord God, Jehovah. They had this polytheistic world view. In fact, if you were to study, we won't take the time this morning, it's an interesting study, however, for those of you that may want to do it. You can look at each of the plagues and you can find how each of those plagues were a direct attack against one of the false deities that were served by the Egyptians. You can see that and you can study that and you can see how God is revealing His power to the Egyptians. See in the beginning you begin to note what's taking place as Moses and Aaron would stand before Pharaoh as they would have these plagues. Even before the plagues began with the rod that turned to a serpent, well the servants of Pharaoh were like, we could do that too. But soon they recognized that this power of Jehovah was a power they were not familiar with. That this God of the children of Israel was different than the false gods that they served. In fact, if you were to look there in Exodus 8 and verse number 19, it's interesting, this year again only after in this particular account just a couple of plagues that have taken place, they're in the midst of the third plague here and the third one being lice and we find that that takes place in chapter number 8 and verse number 16. And we find that the Bible tells us, notice in verse number 17, it says, and they did so for Aaron stretched out his hand with his rod and smote the dust of the earth and it became lice in man and in beast. All the dust of the land became lice throughout all the land of Egypt. That's terrible. I can't even imagine. You ever get out in the yard and work and you got those little gnats that fly around? Make you feel like you're going to lose your mind, right? Make you go absolutely insane. Lice, all the dust, I mean can you imagine? But notice this, it says in verse number 18, and the magicians did so with their enchantments. Again, I don't understand it, to bring forth lice. But notice these words, but they could not. But they could not. So, there were lice upon man and upon beast. Notice in verse number 19, then, then the magicians said unto Pharaoh, this is the finger of God. These magicians that serve these false gods. See, the Egyptians, they had to know the power of God. They had to understand God was revealing. As we look at the truth of the Word of God and we begin to see throughout the pages of Scripture that God desires to make Himself known to people, His prized creation. He loves us. He died for us. He seeks to make Himself known. And we find that here as we consider these 10 devastating plagues, but then we know God's divine power not only revealed to the children of Israel, to His people at that time, but we find to the Egyptians as well, and I would submit to you this morning that His divine power through this account that is given to us and recorded and preserved in God's Word for us this morning, that believers throughout the ages have been helped by understanding God's great power as it was made known in Egypt. You read through these portions of Scripture and you see plague after plague and you see situation and event that unfold and you say, man, look at the power of God Almighty. We see that throughout the ages, God's people have been helped, have been blessed, have been encouraged, have understood in a greater way just how wonderful and great the power of God Almighty is. I'm thankful this morning that God is able to not only declare to us truth, but on so many times He demonstrates those truths to us. See, it's one thing for God to have said, here's what I am. I am all powerful. I am merciful. I am gracious. I am, just keep on, I am love. That would certainly help us to understand who He is. But He said, I am all powerful, and then He demonstrates His power. He says, I am merciful, and then He demonstrates His mercy. He says, I am compassionate, and then we see where the Bible teaches us where God is moved with compassion. We find that He says, I am love, and God is love, but He said, for God's soul of the world that He gave His only begotten Son, He demonstrated His love for us. And I'm so thankful that as you study the pages of this precious book that you find that God declares to us who He is, but He also demonstrates. And listen, it helps us when we have the record of what God is able to do and we see God's power at work, and it helps me and it helps you as we face life. God is all powerful. It's not just that He stated it, though that would be sufficient, but then He reveals it to us and He demonstrates it in such a great way. We see here ten devastating plagues. We see the divine power of God on display. And I would say this if you're taking notes, number three, notice God's divine purpose. I'm so thankful that God always has purpose. I'm thankful that as you study through the portion of Scripture here in the book of Exodus with regard to the plagues and as you note what's taking place, that you understand that God is moving with purpose. In your life and in my life today, God has purpose. You face a circumstance, you face a difficulty, you have a season of blessing, a season of trial, and you find in all of that God has purpose. And I'm so thankful that God has purpose. And we find that as we look at the text of Scripture, I would say that ultimately, through every circumstance that we face in life, that ultimately God's purpose is that He would be glorified. That is the ultimate purpose, that God would be glorified. As we live our lives, as we live day by day, our desire ought to be that we live in such a manner that God is glorified. That God is exalted and magnified in my life. Listen, it's not about you, it's not about me, it's all about Jesus. The Bible teaches us, even as we read in John chapter number three, that wonderful statement from John the Baptist when he said, listen, I must decrease, but He, He, the Lord Jesus Christ, He must increase. In my life and in your life, it's all about Him. And that ultimately is the main purpose, the high-level purpose is that God would be glorified. How does He accomplish that purpose? Well, as we look here at the book of Exodus and we begin to look at some things with regard to the purpose of God being revealed to us, I want you to note what is said in chapter number five of the book of Exodus, and then we'll go forward from there looking at a number of portions of Scripture. Notice in chapter number five of the book of Exodus, this is when we first read of the obedience of Moses as he comes before Pharaoh. The Bible says in verse number one, and afterward Moses and Aaron went in and told Pharaoh, thus saith the Lord God of Israel, let my people go, that they may hold a feast unto me in the wilderness. Notice in verse number two, and Pharaoh said, who is the Lord that I should obey His voice to let Israel go? I know not the Lord, neither will I let Israel go. See Pharaoh didn't know who God was. Pharaoh didn't know God. I think about Nebuchadnezzar in the book of Daniel, he says bow to this image, the three Hebrew children that refused to bow, and he says, who is that God that will deliver you out of my hand? He was soon going to find out who that God was. He is the Lord God Almighty. And he sat there, the Bible says a stone-eyed, looking in and he says, did not, hey, hey, hey, hey guys, didn't we throw three in there, bound? But there's four walking around and the fourth is like unto the Son of God, the Son of Man. Wow, God's power. Pharaoh says, who is the Lord? Who is the Lord that I should obey His voice to let Israel go? I would submit to you that over the next several chapters in the book of Exodus as we think about these ten plagues, you know what God does? He makes Himself known to Pharaoh. He shows Pharaoh who He is. See if we don't know who God is, we can't glorify Him. The ultimate purpose is to glorify God. Listen, before you trusted Christ as your Savior, you probably weren't glorifying God. But after we trust Christ as our Savior, begin to live a life that we can bring glory and honor to Him. Why? Because I understand now that the purpose of my life is to bring glory to my God. And whatsoever you do, right, whether you eat, no matter what you do, do all to the glory of God. We find here that as we look at this text of Scripture and we find that Moses says to Pharaoh that God said, let my people go, and Pharaoh says, who is He? I don't know who He is. Notice in verse number four of chapter number seven, keep moving along, the Bible says this, but Pharaoh shall not hearken unto you that I may lay my hand upon Egypt and bring forth mine armies and my people, the children of Israel, out of the land of Egypt by great judgments. Notice verse number five, and the Egyptians shall know that I am the Lord. And I stretch forth mine hand upon Egypt and bring out the children of Israel from among them. Remember, I referenced already in chapter eight and verse number 19 after the third plague with the lice, what happens? The magicians, they say this is the finger of God. As we find that God was making Himself known, He was revealing Himself, we find that in chapter number nine, notice a couple of verses here, as we continue to see how God is working and what God is doing, you'll reference this or you'll note this reference throughout the pages of this portion of God's Word where the Bible speaks about that you may know something. Notice with me in verse number 14. The Bible says, for I will at this time send all my plagues upon thine heart and upon thy servants and upon thy people. Notice that thou mayest know that there is none like me in all the earth. Isn't that wonderful? You know, there's no one like Jesus. No one. No one's going to satisfy you like Jesus will satisfy you. Jesus, I think they played the offertory this morning. Jesus is the sweetest name I know. Is that what you guys played? Jesus is the sweetest name I know. It really is. I mean, after you understand, I mean, when you hear the name Jesus, man, immediately what comes to your mind, what comes to your heart, man, He's my Savior. He's my all in all. He's my everything. It grieves my heart when I hear somebody use the name of my Savior in vain. Why? Because Jesus is my Savior and it means so much to me. We find that God says that thou mayest know that there is none like me in all the earth. Oh, the Egyptians had a plurality of false gods. But God was going to display His power in such a way that they would know that there's no one like Him. There's no one like Him. Listen, the more you get to know the Lord, you find there's no one like Him. No one like Him. Listen, there's no other world religion, there's no other cult group that offers anything that we find that this. book gives us. And I'm so thankful to know God. It's a wonderful privilege. You know people today around our globe, they don't know who God is. They would be in that same situation of Pharaoh there in Exodus chapter 5, of Nebuchadnezzar over in the book of Daniel. Who is that God? They don't know him. You remember as Paul was there, he was supposed to go to Athens to get a little R&R if you will, but he saw a city that was wholly given to idolatry. He walked through and he saw all of these altars and he came to a place and he found this altar that was marked to the unknown God. Paul stood before those men and he said, him declare I unto you. He was making God known. I'm so thankful that God is making himself known. Look, skip down to verse number 29 there in Exodus chapter 9. Notice what the Bible says. And Moses said unto him, as soon as I am gone out of the city I will spread abroad my hands unto the Lord and the thunder shall cease. Neither shall there be any more hail. Why? That thou mayest know how that the earth is the Lord's. He is the creator and the possessor of. All things are his. And we find that again as I mentioned just a few moments ago how that the coming of the plagues but also the departure of the plagues. And Moses said, listen, I'm going to go and I'm going to spread abroad my hands unto the Lord. The thunder is going to cease and there's not going to be any more hail. That's faith by the way. Amen? We find that he said that you would know how that the earth is the Lord's. God gave a promise when he gave the Noahic covenant with regard to seasons. We find that in our society today that we find all of this talk about global warming and all sorts of things that are going on but we find that the Noahic covenant that God gave a promise with regard to seasons and that they would not fail. Listen, the earth is God's. He created it. And by the way, it is going to be burned up one day. You read in 2 Peter chapter number 3 and you read about what's going to happen. But that's in God's time. That's according to God's plan. Notice with me in Exodus chapter number 10 beginning in verse number 1 the Bible says the Lord said unto Moses, go in unto Pharaoh for I have heart in his heart and the heart of his servants that I might show these my signs before him and that thou mayest tell in the ears of thy son and of thy son's son what things I have wrought in Egypt and my signs which I have done among them that ye may know how that I am the Lord. Listen, God was interested in the perpetuity of this truth. He was interested and he says to Moses, listen, I'm doing these things. I'm showing you my power. I'm demonstrating to you my power and my greatness not only so that you would know but so that you can declare these truths to your sons and to their sons. What a wonderful blessing to see the perpetuity of truth, to understand that it's our responsibility to influence and impact and teach those that are coming before or behind us that we would teach them to set their hope in God that they would know the wonderful works of God, that they would have faith in what God is able to do, that they would know the power of God Almighty. In chapter number 13, this is dealing specifically with the children of Israel with regard to the Passover. The dedication of the firstborn is recorded here, all the information given with regard to the process and the applying of blood and so on and so forth. And notice with me, we'll pick it up right in the middle in verse number 11 of Exodus 13. The Bible says, and it shall be when the Lord shall bring thee into the land of the Canaanites as he sware unto thee and to thy fathers and shall give it thee that thou shalt set apart unto the Lord all that openeth the matrix and every firstling that cometh of a beast which thou hast and the males shall be the Lord's. Notice verse 13, and every firstling of an ass thou shalt redeem with a lamb that if thou wilt not redeem it then thou shalt break his neck and all the firstborn of man among thy children shalt thou redeem. And it shall be when thy son asketh thee in time to come saying, what is this? What is this? That thou shalt say unto him, by strength of hand the Lord brought us out from Egypt from the house of bondage. What a great opportunity that they would have. See, in just a little while we'll celebrate Memorial Day and we speak about the importance of memorials and we find that the Passover, such as other events in Israel's history, really had the idea of setting up a memorial, a time to remember what God did. Of course, with the Passover it was twofold, not only of remembering what God did but looking forward to what God would do in the Messiah coming and becoming our Passover. We find that as we look through these portions of Scripture and look at what God is saying as to how he is making himself known and the reason that ye may know these truths, I would summarize it this way. We think about God's purpose is that he would be glorified. In order for him to be glorified I would say this, that he wants us to know his great power personally. He wants us to know his great power personally. I believe this morning that he wants each and every one of us of his children to know how powerful he is. So you're going to face things in your life. I'm going to face things in my life. We'll face things corporately and collectively as a church. God wants us to know how powerful he is. He wants us to know that he has all power. See, Jesus, before he would ascend and go to heaven after his resurrection, we find that he said this and it's recorded this way in Matthew's Gospel, all power is given unto me in heaven and in earth. Go ye therefore and we see that the go ye therefore is preceded by the all power is given unto me in heaven and in earth. He concludes that portion of Scripture by saying and I will be with you. I will be with you. Isn't that precious truth? See God wants us to know that he is the all powerful God. Power is an interesting thing. People in our society, people around the world, people for centuries, generations as you study history, you will find that people are longing for more power and more power and there are world powers that are set up and you look through the pages of history and you begin to see all of those that were seeking power. There are some times that people like Nebuchadnezzar, like Pharaoh, like others that you could read of in history that had the perspective that they had great power. Think of Pilate. He said to Jesus, don't you know that I have power to release you or to go to the cross? What did Jesus say? He said, I want you to understand something Pilate. The only power you have, I'm paraphrasing, the only power that you have is the power that I let you have. This morning we can look at some people and some groups of people and some organizations. We could think about their power. But I want you to understand that it pales in comparison to the power of God Almighty. Our God is the God of the impossible. Our God is the God who has all power. You begin to look at the Assyrians when they're attacking the children of Israel, Judah, Hezekiah is trusting the Lord. Sennacherib and Rabshakeh. Don't you know all the other peoples that we've conquered? Don't you know who we are? Honestly, accurately, the Assyrians were the world power at that time. But God sent one angel in one night and killed 185,000. We have the God of all power. And He wants us to know it personally. He wants us to know it personally. I would say this, that when we know His great power personally, then we would praise Him accordingly. See, He is worthy of our praise. This morning when we think about the greatness of God, when we think about and understand the great power that our God has, then we should praise Him accordingly. Stand in awe of who He is. He's a great God with great power. Abram, is anything too hard for the Lord? Well God, you just told me that you are the Lord God Almighty. El Shaddai. Obviously there's nothing that's too hard for God. What was it that Abraham thought? Well, he thought that he and Sarah could not have a child. But God promised. God promised, not that He'd give a child between Abraham and Hagar, but that He would give a child between Abraham and Sarah. And what did God do? Exactly what He promised to do. We find that Isaac was born. What a blessing. I mean we could look over and over and over through the pages of Scripture. You could look in your life and you can look at those that have gone before us and you can see God's power in their lives. and we ought to praise Him accordingly. I would say this finally this morning, when God makes Himself known for the purpose that He'd be glorified, when we understand His great power personally, we praise Him accordingly, He desires that we would trust Him fully. He desires that we trust Him fully. I mean just complete trust in God Almighty. I've referenced this morning already with the situation with Nebuchadnezzar and the three Hebrew children, Shadrach, Meshach, and Abednego. You think about those three Hebrew children, they trusted God fully. I mean they were all in, man. They just believed that God was able. And they said, and if not, we're still not gonna bow. But they had every belief that God was able. And because they understood God's great power personally, they trusted Him fully. See, in your life and in my life, listen, we don't have to scheme. We don't have to devise. We don't have to, you know, there's a world that schemes. Try to bring to pass certain things that they wanna bring to pass. They scheme and manipulate and all those types. We don't have to do that. We just trust God fully. God, you're God. You've shown me all of these wonderful truths with regard to your power. You have demonstrated it, and I'm gonna trust you fully. I think about Moses. See, in Horeb, God made His greatness known to Moses personally. We mentioned that in a previous message just a few weeks ago. We had two messages with regard to he took my place in the empty tomb between that message and this message. We find here in Egypt that God made His greatness known. Begin to think about Moses. See, the whole congregation in the nation of Israel didn't get it. They forgot his works, right? They didn't get it. But Moses was a man that trusted God. He wasn't perfect. There's some times in his life you can look at what's taking place, but you begin to think about the trust. Moses says, I can't lead these people, but you begin to trust God because God had shown, had demonstrated His greatness. In your life and in my life, I don't know what's gonna happen tomorrow or next week or next month, but God does. And today, God is wanting us to understand His great power so that we would trust Him fully with whatever it is that might come. How many people get devastating news with this or that? And it might be job-related. It might be health-related. It could be a whole host of things, but we find that God wants to prepare us. Now, He wants you to know personally how great He is in His great power so that you would praise Him and so that you would trust Him. Oh, this morning, I hope that we would not be like the children of Israel that would forget. Many times, in the midst of a growth difficulty, as the songwriter said, we're prone to wander. I mean, we forget, but oh, that God would help us. God, this is nothing for you. This is nothing for you, God. You've demonstrated all of these things in your precious book, and you've done it in my life before. God, I am trusting you alone, and let's see what God will do, because God is making Himself known for the single purpose that He would be glorified. And you know, when we trust Him and when we see Him do great things, He's glorified. When they sing in Exodus 15 the song of Moses, it wasn't Moses that was getting the glory for parting the Red Sea. It was God that was getting the glory. And that's what it would be in our lives as we just trust Him that He would be glorified. Let's pray together. Father, we love you. We thank you for loving us. We thank you for your precious word. We thank you for the privilege of being able to know just how great you are. Thank you for in the life of Moses, there in Horeb, you made your greatness known. I think about here in Egypt, as we think about these plagues, how you made your greatness known. God, I pray that as we have had the opportunity to study these portions of Scripture this morning, God, I pray that you would help us to glorify you in our lives, that we'd glorify you by trusting you. And I know, God, that we'll only trust you like we should when we fully understand personally how great you really are. And I pray, God, this morning that you'd help us to submit and surrender our lives to you, that we'd see you do great and mighty things. We thank you for the privilege of knowing you and of serving you. God, if there's one here that's not sure of heaven, they've never trusted the Lord Jesus Christ as their personal Savior, I pray that today they would understand their need for Christ. Just as we mentioned of that 10th plague, the death of the firstborn, there was only one way to spare death, and that was by applying that blood. We find that Christ is our Passover, the Lamb of God, was slain before the foundation of the world, the Lamb of God, which taketh away the sins of the world. He came and he lived a perfect, sinless life. He was buried in a borrowed tomb. He rose conquering sin, death, and the grave. He lives forevermore. Oh, God, I pray that today, if there's one not saved, they'd be saved today, be born again. I pray that you'd help every child of God that's here. God, would you help us to trust you? I don't know the specific circumstances that are being dealt with by every individual that's present this morning, but God, you do. God, I believe that you want them to know how powerful and how great you are, and that we'd trust you through every circumstance, that you alone would be glorified. I pray that you'd move and work in this time of invitation, that decisions would be made that would be pleasing to thee, Lord, that would cause us to be conformed to the image of your Son. Well, thank you for all that you'll do, for it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano, and as we have at the end of our service, there's an opportunity for a time of invitation, give you an opportunity to respond. We're ready to listen, ready to hear the word of God, but we must be ready to respond. You've got someone in your life, there's some trial you're going through, and you need to make that determination, that you're gonna trust him fully. Maybe you're not sure of heaven, let me take a Bible and show you how you can know for sure that heaven's your home. As Kimberly plays, this altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.819999933242798,
      "text": " over to the book of Psalms, Psalm 105."
    },
    {
      "id": 1,
      "start": 2.819999933242798,
      "end": 6.099999904632568,
      "text": " Psalm 105 this morning, and be looking at verses 23"
    },
    {
      "id": 2,
      "start": 6.099999904632568,
      "end": 7.880000114440918,
      "text": " down through verse number 28."
    },
    {
      "id": 3,
      "start": 7.880000114440918,
      "end": 9.399999618530273,
      "text": " And if you've looked at the back of the bulletin"
    },
    {
      "id": 4,
      "start": 9.399999618530273,
      "end": 12.359999656677246,
      "text": " already this morning, you see the title for the message"
    },
    {
      "id": 5,
      "start": 12.359999656677246,
      "end": 16.860000610351562,
      "text": " is this, in Egypt, God made his greatness known."
    },
    {
      "id": 6,
      "start": 16.860000610351562,
      "end": 19.459999084472656,
      "text": " The people of God, as you know, were in Egyptian bondage"
    },
    {
      "id": 7,
      "start": 19.459999084472656,
      "end": 21.639999389648438,
      "text": " and God was going to bring them out."
    },
    {
      "id": 8,
      "start": 21.639999389648438,
      "end": 24.280000686645508,
      "text": " We mentioned in our previous message on our subject,"
    },
    {
      "id": 9,
      "start": 24.280000686645508,
      "end": 27.68000030517578,
      "text": " our theme for Sunday mornings, great is the Lord,"
    },
    {
      "id": 10,
      "start": 27.68000030517578,
      "end": 30.15999984741211,
      "text": " that he, God, the Lord God Almighty,"
    },
    {
      "id": 11,
      "start": 30.15999984741211,
      "end": 32.91999816894531,
      "text": " he appeared to Moses in Horeb."
    },
    {
      "id": 12,
      "start": 32.91999816894531,
      "end": 36.86000061035156,
      "text": " And in that place, he revealed to Moses his plan."
    },
    {
      "id": 13,
      "start": 36.86000061035156,
      "end": 39.560001373291016,
      "text": " We spoke about the greatness of God"
    },
    {
      "id": 14,
      "start": 39.560001373291016,
      "end": 41.380001068115234,
      "text": " as it was revealed to Moses"
    },
    {
      "id": 15,
      "start": 41.380001068115234,
      "end": 43.880001068115234,
      "text": " in that particular text of scripture,"
    },
    {
      "id": 16,
      "start": 43.880001068115234,
      "end": 46.47999954223633,
      "text": " as we look through Exodus 3, 4, and 5,"
    },
    {
      "id": 17,
      "start": 46.47999954223633,
      "end": 48.220001220703125,
      "text": " and mentioned a number of things."
    },
    {
      "id": 18,
      "start": 48.220001220703125,
      "end": 50.939998626708984,
      "text": " And it's interesting as you begin to think about"
    },
    {
      "id": 19,
      "start": 50.939998626708984,
      "end": 54.380001068115234,
      "text": " all that God would do and all that God was showing Moses,"
    },
    {
      "id": 20,
      "start": 54.380001068115234,
      "end": 57.099998474121094,
      "text": " he would later declare in the book of Deuteronomy,"
    },
    {
      "id": 21,
      "start": 57.099998474121094,
      "end": 59.939998626708984,
      "text": " this great statement about God beginning to show"
    },
    {
      "id": 22,
      "start": 59.939998626708984,
      "end": 62.65999984741211,
      "text": " his greatness to his servant."
    },
    {
      "id": 23,
      "start": 62.65999984741211,
      "end": 64.30000305175781,
      "text": " And we find that it began there in Horeb,"
    },
    {
      "id": 24,
      "start": 64.30000305175781,
      "end": 65.77999877929688,
      "text": " but it continues in Egypt,"
    },
    {
      "id": 25,
      "start": 65.77999877929688,
      "end": 68.54000091552734,
      "text": " Moses obeyed the command of the Lord."
    },
    {
      "id": 26,
      "start": 68.54000091552734,
      "end": 70.94000244140625,
      "text": " And Moses went and stood before Pharaoh."
    },
    {
      "id": 27,
      "start": 70.94000244140625,
      "end": 72.33999633789062,
      "text": " And as he stood before Pharaoh,"
    },
    {
      "id": 28,
      "start": 72.33999633789062,
      "end": 74.5,
      "text": " he said what God told him to say,"
    },
    {
      "id": 29,
      "start": 74.5,
      "end": 76.9000015258789,
      "text": " he delivered faithfully the message of the Lord."
    },
    {
      "id": 30,
      "start": 76.9000015258789,
      "end": 77.73999786376953,
      "text": " And here's what he said,"
    },
    {
      "id": 31,
      "start": 77.73999786376953,
      "end": 80.69999694824219,
      "text": " thus saith the Lord, the Lord God of Israel,"
    },
    {
      "id": 32,
      "start": 80.69999694824219,
      "end": 82.54000091552734,
      "text": " let my people go."
    },
    {
      "id": 33,
      "start": 82.54000091552734,
      "end": 84.86000061035156,
      "text": " And we know that that was met with opposition,"
    },
    {
      "id": 34,
      "start": 84.86000061035156,
      "end": 88.86000061035156,
      "text": " that Pharaoh refused to allow the people of God to depart."
    },
    {
      "id": 35,
      "start": 88.86000061035156,
      "end": 91.44000244140625,
      "text": " And over the next several chapters in the book of Exodus,"
    },
    {
      "id": 36,
      "start": 91.44000244140625,
      "end": 96.44000244140625,
      "text": " you find that God makes his greatness known in Egypt."
    },
    {
      "id": 37,
      "start": 96.58000183105469,
      "end": 99.26000213623047,
      "text": " As we're gonna think about the truth that our God is great,"
    },
    {
      "id": 38,
      "start": 99.26000213623047,
      "end": 102.63999938964844,
      "text": " and in fact, he's revealed his greatness to us in his word."
    },
    {
      "id": 39,
      "start": 102.63999938964844,
      "end": 103.86000061035156,
      "text": " We've seen it over and over,"
    },
    {
      "id": 40,
      "start": 103.86000061035156,
      "end": 105.58000183105469,
      "text": " even as we've studied this year,"
    },
    {
      "id": 41,
      "start": 105.58000183105469,
      "end": 109.4000015258789,
      "text": " and in this particular theme of great is the Lord."
    },
    {
      "id": 42,
      "start": 109.4000015258789,
      "end": 112.0199966430664,
      "text": " The reality is that as we recognize how great he is,"
    },
    {
      "id": 43,
      "start": 112.0199966430664,
      "end": 114.27999877929688,
      "text": " that we ought to finish the verse great is the Lord"
    },
    {
      "id": 44,
      "start": 114.27999877929688,
      "end": 117.0,
      "text": " and greatly to be praised."
    },
    {
      "id": 45,
      "start": 117.0,
      "end": 119.12000274658203,
      "text": " And he is worthy of our praise,"
    },
    {
      "id": 46,
      "start": 119.12000274658203,
      "end": 120.44000244140625,
      "text": " he is worthy of our worship,"
    },
    {
      "id": 47,
      "start": 120.44000244140625,
      "end": 123.62000274658203,
      "text": " we should stand in awe of who our God is."
    },
    {
      "id": 48,
      "start": 123.62000274658203,
      "end": 125.72000122070312,
      "text": " It's interesting that the manner"
    },
    {
      "id": 49,
      "start": 125.72000122070312,
      "end": 128.52000427246094,
      "text": " in which God revealed his power there in Egypt,"
    },
    {
      "id": 50,
      "start": 128.52000427246094,
      "end": 130.10000610351562,
      "text": " he made his greatness known."
    },
    {
      "id": 51,
      "start": 130.10000610351562,
      "end": 131.72000122070312,
      "text": " We of course are familiar with the plagues"
    },
    {
      "id": 52,
      "start": 131.72000122070312,
      "end": 134.44000244140625,
      "text": " and we'll mention as we get through the message this morning"
    },
    {
      "id": 53,
      "start": 134.44000244140625,
      "end": 137.0800018310547,
      "text": " but it's of interest that here in Psalm 105,"
    },
    {
      "id": 54,
      "start": 137.0800018310547,
      "end": 140.27999877929688,
      "text": " the psalmist makes reference to the plagues."
    },
    {
      "id": 55,
      "start": 140.27999877929688,
      "end": 143.60000610351562,
      "text": " In Psalm 78, the psalmist makes reference to the plagues."
    },
    {
      "id": 56,
      "start": 143.67999267578125,
      "end": 145.44000244140625,
      "text": " And then also in Psalm 106,"
    },
    {
      "id": 57,
      "start": 145.44000244140625,
      "end": 147.0800018310547,
      "text": " there's a reference not as detailed"
    },
    {
      "id": 58,
      "start": 147.0800018310547,
      "end": 150.0399932861328,
      "text": " as we find in Psalm 78 or in Psalm 105,"
    },
    {
      "id": 59,
      "start": 150.0399932861328,
      "end": 153.0800018310547,
      "text": " but again, you see the reference in Psalm 106"
    },
    {
      "id": 60,
      "start": 153.0800018310547,
      "end": 154.1199951171875,
      "text": " to these plagues."
    },
    {
      "id": 61,
      "start": 154.1199951171875,
      "end": 156.32000732421875,
      "text": " It's interesting because there,"
    },
    {
      "id": 62,
      "start": 156.32000732421875,
      "end": 159.8000030517578,
      "text": " as God would speak to Moses, he's there in Egypt,"
    },
    {
      "id": 63,
      "start": 159.8000030517578,
      "end": 164.5,
      "text": " he tells Moses that with great judgments"
    },
    {
      "id": 64,
      "start": 164.5,
      "end": 167.33999633789062,
      "text": " is recorded that way in Exodus six and verse number six,"
    },
    {
      "id": 65,
      "start": 167.33999633789062,
      "end": 169.47999572753906,
      "text": " and then in chapter seven and verse number three,"
    },
    {
      "id": 66,
      "start": 169.47999572753906,
      "end": 173.36000061035156,
      "text": " God promised that he would multiply his signs"
    },
    {
      "id": 67,
      "start": 174.0,
      "end": 176.16000366210938,
      "text": " and wonders in Egypt."
    },
    {
      "id": 68,
      "start": 176.16000366210938,
      "end": 178.44000244140625,
      "text": " Notice with me here in Psalm 105,"
    },
    {
      "id": 69,
      "start": 178.44000244140625,
      "end": 180.24000549316406,
      "text": " beginning in verse number 23,"
    },
    {
      "id": 70,
      "start": 180.24000549316406,
      "end": 183.8000030517578,
      "text": " the Bible says this, Israel also came into Egypt"
    },
    {
      "id": 71,
      "start": 183.8000030517578,
      "end": 187.39999389648438,
      "text": " and Jacob sojourned in the land of Ham"
    },
    {
      "id": 72,
      "start": 187.39999389648438,
      "end": 190.0800018310547,
      "text": " and he increased his people greatly"
    },
    {
      "id": 73,
      "start": 190.0800018310547,
      "end": 193.27999877929688,
      "text": " and made them stronger than their enemies."
    },
    {
      "id": 74,
      "start": 193.27999877929688,
      "end": 195.4199981689453,
      "text": " He turned their heart to hate his people"
    },
    {
      "id": 75,
      "start": 195.4199981689453,
      "end": 197.67999267578125,
      "text": " to deal subtly with his servants."
    },
    {
      "id": 76,
      "start": 197.67999267578125,
      "end": 202.0,
      "text": " Notice he sent Moses his servant Aaron whom he had chosen."
    },
    {
      "id": 77,
      "start": 203.0,
      "end": 206.36000061035156,
      "text": " They showed his signs among them"
    },
    {
      "id": 78,
      "start": 206.36000061035156,
      "end": 209.9600067138672,
      "text": " and wonders in the land of Ham."
    },
    {
      "id": 79,
      "start": 209.9600067138672,
      "end": 211.0399932861328,
      "text": " We'll read the rest of the text"
    },
    {
      "id": 80,
      "start": 211.0399932861328,
      "end": 212.89999389648438,
      "text": " as we get through the message this morning,"
    },
    {
      "id": 81,
      "start": 212.89999389648438,
      "end": 214.72000122070312,
      "text": " but I wanna draw your attention to that phrase"
    },
    {
      "id": 82,
      "start": 214.72000122070312,
      "end": 216.39999389648438,
      "text": " in verse number 27 where the Bible says"
    },
    {
      "id": 83,
      "start": 216.39999389648438,
      "end": 219.9600067138672,
      "text": " they showed his signs among them"
    },
    {
      "id": 84,
      "start": 219.9600067138672,
      "end": 222.9600067138672,
      "text": " and wonders in the land of Egypt."
    },
    {
      "id": 85,
      "start": 222.9600067138672,
      "end": 226.0,
      "text": " That word that we find there in verse number 27,"
    },
    {
      "id": 86,
      "start": 226.0,
      "end": 228.1999969482422,
      "text": " wonders, it really means a miracle."
    },
    {
      "id": 87,
      "start": 228.1999969482422,
      "end": 230.0800018310547,
      "text": " It really carries with it this idea,"
    },
    {
      "id": 88,
      "start": 230.16000366210938,
      "end": 234.32000732421875,
      "text": " it's a special display of God's power,"
    },
    {
      "id": 89,
      "start": 234.32000732421875,
      "end": 237.83999633789062,
      "text": " a special display of God's power."
    },
    {
      "id": 90,
      "start": 237.83999633789062,
      "end": 239.63999938964844,
      "text": " If you're familiar with the text of scripture"
    },
    {
      "id": 91,
      "start": 239.63999938964844,
      "end": 243.25999450683594,
      "text": " in the book of Exodus with regard to the 10 plagues,"
    },
    {
      "id": 92,
      "start": 243.25999450683594,
      "end": 248.05999755859375,
      "text": " you will understand that God indeed multiplied"
    },
    {
      "id": 93,
      "start": 248.05999755859375,
      "end": 252.0399932861328,
      "text": " his signs and wonders, he made himself known"
    },
    {
      "id": 94,
      "start": 252.0399932861328,
      "end": 256.20001220703125,
      "text": " and there was a special display of God's great power."
    },
    {
      "id": 95,
      "start": 256.20001220703125,
      "end": 257.9800109863281,
      "text": " I'm so thankful this morning that we serve"
    },
    {
      "id": 96,
      "start": 257.9800109863281,
      "end": 261.29998779296875,
      "text": " the Lord God omnipotent, that he has all power."
    },
    {
      "id": 97,
      "start": 261.29998779296875,
      "end": 264.5,
      "text": " We speak about his omnipotence and we rejoice"
    },
    {
      "id": 98,
      "start": 264.5,
      "end": 268.0,
      "text": " in understanding that even as he stood before Abram"
    },
    {
      "id": 99,
      "start": 268.0,
      "end": 270.7799987792969,
      "text": " and said, is anything too hard for the Lord?"
    },
    {
      "id": 100,
      "start": 270.7799987792969,
      "end": 273.1600036621094,
      "text": " And we know that the answer to that question is no"
    },
    {
      "id": 101,
      "start": 273.1600036621094,
      "end": 275.6199951171875,
      "text": " and we find that as we study through"
    },
    {
      "id": 102,
      "start": 275.6199951171875,
      "end": 278.94000244140625,
      "text": " the precious word of God, that God has revealed"
    },
    {
      "id": 103,
      "start": 278.94000244140625,
      "end": 283.94000244140625,
      "text": " over and over and over to us again his great power."
    },
    {
      "id": 104,
      "start": 284.1000061035156,
      "end": 287.82000732421875,
      "text": " This morning, we serve the Lord God omnipotent."
    },
    {
      "id": 105,
      "start": 288.6600036621094,
      "end": 290.29998779296875,
      "text": " We find that here as we look at this portion of scripture,"
    },
    {
      "id": 106,
      "start": 290.29998779296875,
      "end": 292.1199951171875,
      "text": " I want you to notice with me if you're taking notes,"
    },
    {
      "id": 107,
      "start": 292.1199951171875,
      "end": 295.4200134277344,
      "text": " number one, 10 devastating plagues."
    },
    {
      "id": 108,
      "start": 295.4200134277344,
      "end": 299.0199890136719,
      "text": " We will not take the time to read all of the details"
    },
    {
      "id": 109,
      "start": 299.0199890136719,
      "end": 301.5400085449219,
      "text": " with regard to the plagues as they're revealed to us"
    },
    {
      "id": 110,
      "start": 301.5400085449219,
      "end": 304.260009765625,
      "text": " in the book of Exodus, we will not take the time"
    },
    {
      "id": 111,
      "start": 304.260009765625,
      "end": 307.5,
      "text": " to go through all of that dialogue and what have you,"
    },
    {
      "id": 112,
      "start": 307.5,
      "end": 310.1000061035156,
      "text": " but I do want you to understand that in chapters seven"
    },
    {
      "id": 113,
      "start": 310.1000061035156,
      "end": 312.05999755859375,
      "text": " through 11 of the book of Exodus,"
    },
    {
      "id": 114,
      "start": 312.05999755859375,
      "end": 314.5,
      "text": " you will find that these plagues are recorded"
    },
    {
      "id": 115,
      "start": 314.5,
      "end": 317.1000061035156,
      "text": " and you begin to read about all that's taking place"
    },
    {
      "id": 116,
      "start": 317.1000061035156,
      "end": 319.5,
      "text": " and as we look here and we think about"
    },
    {
      "id": 117,
      "start": 319.5,
      "end": 323.4599914550781,
      "text": " these 10 devastating plagues, we find that the Bible says"
    },
    {
      "id": 118,
      "start": 323.4599914550781,
      "end": 326.29998779296875,
      "text": " here in Psalm 105, beginning in verse number 28,"
    },
    {
      "id": 119,
      "start": 326.29998779296875,
      "end": 328.7799987792969,
      "text": " he sent darkness and made it dark."
    },
    {
      "id": 120,
      "start": 328.7799987792969,
      "end": 330.8999938964844,
      "text": " Now understand that these are not in the same order"
    },
    {
      "id": 121,
      "start": 330.8999938964844,
      "end": 334.3800048828125,
      "text": " that the plagues came as you read Exodus seven through 11,"
    },
    {
      "id": 122,
      "start": 334.3800048828125,
      "end": 337.1000061035156,
      "text": " but it says here, he sent darkness and made it dark"
    },
    {
      "id": 123,
      "start": 337.1000061035156,
      "end": 339.2200012207031,
      "text": " and they rebelled not against his word."
    },
    {
      "id": 124,
      "start": 339.2200012207031,
      "end": 342.3399963378906,
      "text": " He turned their waters into blood and slew their fish,"
    },
    {
      "id": 125,
      "start": 342.3399963378906,
      "end": 345.17999267578125,
      "text": " their land brought forth frogs in abundance"
    },
    {
      "id": 126,
      "start": 345.17999267578125,
      "end": 346.7799987792969,
      "text": " and the chambers of their kings."
    },
    {
      "id": 127,
      "start": 346.7799987792969,
      "end": 350.17999267578125,
      "text": " He spake and there came diverse sorts of flies"
    },
    {
      "id": 128,
      "start": 350.17999267578125,
      "end": 351.9800109863281,
      "text": " and lice and all their coast."
    },
    {
      "id": 129,
      "start": 351.9800109863281,
      "end": 356.1400146484375,
      "text": " He gave them hail for rain and flaming fire in their land."
    },
    {
      "id": 130,
      "start": 356.1400146484375,
      "end": 359.260009765625,
      "text": " He smote their vines also in their fig trees"
    },
    {
      "id": 131,
      "start": 359.260009765625,
      "end": 361.70001220703125,
      "text": " and break the trees of their coast."
    },
    {
      "id": 132,
      "start": 361.70001220703125,
      "end": 364.5,
      "text": " He spake and the locust came and the caterpillars"
    },
    {
      "id": 133,
      "start": 364.5,
      "end": 367.94000244140625,
      "text": " and that without number and did eat up all the herbs"
    },
    {
      "id": 134,
      "start": 367.94000244140625,
      "end": 372.94000244140625,
      "text": " in their land and devoured the fruit of their ground."
    },
    {
      "id": 135,
      "start": 373.1000061035156,
      "end": 375.739990234375,
      "text": " He smote also all the firstborn in their land,"
    },
    {
      "id": 136,
      "start": 375.739990234375,
      "end": 377.5799865722656,
      "text": " the chief of all their strength."
    },
    {
      "id": 137,
      "start": 377.5799865722656,
      "end": 380.3800048828125,
      "text": " He brought them forth also with silver and gold"
    },
    {
      "id": 138,
      "start": 380.3800048828125,
      "end": 383.0199890136719,
      "text": " and there was not one feeble person among their tribes."
    },
    {
      "id": 139,
      "start": 383.0199890136719,
      "end": 385.1400146484375,
      "text": " Notice in verse 38, it says Egypt was glad"
    },
    {
      "id": 140,
      "start": 385.1400146484375,
      "end": 389.05999755859375,
      "text": " when they departed for the fear of them fell upon them."
    },
    {
      "id": 141,
      "start": 389.05999755859375,
      "end": 391.5799865722656,
      "text": " It's interesting as you consider the 10 devastating plagues"
    },
    {
      "id": 142,
      "start": 391.5799865722656,
      "end": 395.67999267578125,
      "text": " and you understand the devastation that was endured there"
    },
    {
      "id": 143,
      "start": 395.67999267578125,
      "end": 399.3399963378906,
      "text": " by Pharaoh, by Egypt and all of the Egyptians."
    },
    {
      "id": 144,
      "start": 399.3399963378906,
      "end": 403.1400146484375,
      "text": " It's really summarized for us by the servants of Pharaoh"
    },
    {
      "id": 145,
      "start": 403.1400146484375,
      "end": 405.6400146484375,
      "text": " in Exodus 10 in verse number seven."
    },
    {
      "id": 146,
      "start": 405.6400146484375,
      "end": 407.8800048828125,
      "text": " Perhaps you wanna turn there and look at what the servants"
    },
    {
      "id": 147,
      "start": 407.8800048828125,
      "end": 410.8999938964844,
      "text": " of Pharaoh say in this passage of scripture."
    },
    {
      "id": 148,
      "start": 410.8999938964844,
      "end": 413.5199890136719,
      "text": " In Exodus chapter number 10 in verse number seven,"
    },
    {
      "id": 149,
      "start": 413.5199890136719,
      "end": 416.4200134277344,
      "text": " we find that this is only after seven of the plagues."
    },
    {
      "id": 150,
      "start": 416.4200134277344,
      "end": 418.1199951171875,
      "text": " There's still three more plagues to come."
    },
    {
      "id": 151,
      "start": 418.1199951171875,
      "end": 420.239990234375,
      "text": " There are 10 devastating plagues."
    },
    {
      "id": 152,
      "start": 420.239990234375,
      "end": 422.260009765625,
      "text": " And after the seventh plague,"
    },
    {
      "id": 153,
      "start": 422.260009765625,
      "end": 425.17999267578125,
      "text": " we find that the servants of Pharaoh"
    },
    {
      "id": 154,
      "start": 425.17999267578125,
      "end": 428.44000244140625,
      "text": " begin to speak to Pharaoh in chapter 10 in verse number seven."
    },
    {
      "id": 155,
      "start": 428.44000244140625,
      "end": 430.0799865722656,
      "text": " Notice what the Bible says."
    },
    {
      "id": 156,
      "start": 431.3999938964844,
      "end": 433.44000244140625,
      "text": " And Pharaoh's servants said unto him,"
    },
    {
      "id": 157,
      "start": 433.44000244140625,
      "end": 436.79998779296875,
      "text": " how long shall this man be a snare unto us?"
    },
    {
      "id": 158,
      "start": 436.79998779296875,
      "end": 441.2200012207031,
      "text": " Let the men go that they may serve the Lord their God."
    },
    {
      "id": 159,
      "start": 441.2200012207031,
      "end": 446.2200012207031,
      "text": " Knowest thou not yet that Egypt is destroyed?"
    },
    {
      "id": 160,
      "start": 447.6600036621094,
      "end": 450.260009765625,
      "text": " These plagues were devastating."
    },
    {
      "id": 161,
      "start": 450.260009765625,
      "end": 454.3599853515625,
      "text": " The impact that it would have upon the lives"
    },
    {
      "id": 162,
      "start": 454.3599853515625,
      "end": 456.8399963378906,
      "text": " of the Egyptians, we would understand"
    },
    {
      "id": 163,
      "start": 456.8399963378906,
      "end": 460.0799865722656,
      "text": " that really every aspect of their life would be impacted."
    },
    {
      "id": 164,
      "start": 460.0799865722656,
      "end": 461.9599914550781,
      "text": " And you would think about the ways"
    },
    {
      "id": 165,
      "start": 461.9599914550781,
      "end": 465.6400146484375,
      "text": " in which their livestock were destroyed."
    },
    {
      "id": 166,
      "start": 465.6400146484375,
      "end": 469.0400085449219,
      "text": " And it would certainly impact transportation"
    },
    {
      "id": 167,
      "start": 469.0400085449219,
      "end": 470.3599853515625,
      "text": " and agriculture."
    },
    {
      "id": 168,
      "start": 470.3599853515625,
      "end": 472.67999267578125,
      "text": " It would impact all sorts of things."
    },
    {
      "id": 169,
      "start": 472.67999267578125,
      "end": 474.0400085449219,
      "text": " Every area of their lives,"
    },
    {
      "id": 170,
      "start": 474.0400085449219,
      "end": 477.9599914550781,
      "text": " they were impacted by these plagues."
    },
    {
      "id": 171,
      "start": 477.9599914550781,
      "end": 480.05999755859375,
      "text": " It's interesting as you begin to study"
    },
    {
      "id": 172,
      "start": 480.05999755859375,
      "end": 482.1199951171875,
      "text": " through the 10 plagues, you will find"
    },
    {
      "id": 173,
      "start": 482.1199951171875,
      "end": 486.67999267578125,
      "text": " that the first three affected both the Egyptians"
    },
    {
      "id": 174,
      "start": 487.5199890136719,
      "end": 489.0799865722656,
      "text": " and the children of Israel."
    },
    {
      "id": 175,
      "start": 489.0799865722656,
      "end": 491.6400146484375,
      "text": " You'll find that in those first three plagues,"
    },
    {
      "id": 176,
      "start": 491.6400146484375,
      "end": 494.3599853515625,
      "text": " it was affected all that were in the land."
    },
    {
      "id": 177,
      "start": 494.3599853515625,
      "end": 496.2799987792969,
      "text": " And so the children of Israel were not exempt"
    },
    {
      "id": 178,
      "start": 496.2799987792969,
      "end": 497.82000732421875,
      "text": " in those first three plagues."
    },
    {
      "id": 179,
      "start": 497.82000732421875,
      "end": 500.5400085449219,
      "text": " But as you continue to read through the account"
    },
    {
      "id": 180,
      "start": 500.5400085449219,
      "end": 502.05999755859375,
      "text": " in the book of Exodus with regard"
    },
    {
      "id": 181,
      "start": 502.05999755859375,
      "end": 503.55999755859375,
      "text": " to these 10 devastating plagues,"
    },
    {
      "id": 182,
      "start": 503.55999755859375,
      "end": 506.67999267578125,
      "text": " you will find that plagues number four through nine"
    },
    {
      "id": 183,
      "start": 506.67999267578125,
      "end": 510.1600036621094,
      "text": " only impacted the Egyptians."
    },
    {
      "id": 184,
      "start": 510.1600036621094,
      "end": 512.5599975585938,
      "text": " God made his power known"
    },
    {
      "id": 185,
      "start": 512.5599975585938,
      "end": 514.9600219726562,
      "text": " that he could bring these plagues upon all."
    },
    {
      "id": 186,
      "start": 514.9600219726562,
      "end": 518.0399780273438,
      "text": " But then think about the display of God's power"
    },
    {
      "id": 187,
      "start": 518.0399780273438,
      "end": 520.6799926757812,
      "text": " in the fourth through ninth plague"
    },
    {
      "id": 188,
      "start": 520.6799926757812,
      "end": 523.0,
      "text": " when the Egyptians were affected,"
    },
    {
      "id": 189,
      "start": 523.0,
      "end": 525.5,
      "text": " but the children of Israel were not affected."
    },
    {
      "id": 190,
      "start": 526.5,
      "end": 528.280029296875,
      "text": " God's great power."
    },
    {
      "id": 191,
      "start": 528.280029296875,
      "end": 531.760009765625,
      "text": " I would submit to you that not only was God's power displayed"
    },
    {
      "id": 192,
      "start": 531.760009765625,
      "end": 535.0399780273438,
      "text": " in the devastating plagues and bringing of the plagues,"
    },
    {
      "id": 193,
      "start": 535.0399780273438,
      "end": 538.280029296875,
      "text": " but I would say also in the departure of the plagues,"
    },
    {
      "id": 194,
      "start": 538.280029296875,
      "end": 539.760009765625,
      "text": " you would read through the accounts"
    },
    {
      "id": 195,
      "start": 539.760009765625,
      "end": 541.7999877929688,
      "text": " in Exodus seven through 11."
    },
    {
      "id": 196,
      "start": 541.7999877929688,
      "end": 544.3400268554688,
      "text": " I would just deal with the first one with frogs"
    },
    {
      "id": 197,
      "start": 544.3400268554688,
      "end": 545.7000122070312,
      "text": " and begin to think about frogs."
    },
    {
      "id": 198,
      "start": 545.7000122070312,
      "end": 547.6199951171875,
      "text": " And maybe you like frogs,"
    },
    {
      "id": 199,
      "start": 547.6199951171875,
      "end": 549.280029296875,
      "text": " but you don't want frogs everywhere."
    },
    {
      "id": 200,
      "start": 549.280029296875,
      "end": 551.8200073242188,
      "text": " Bed, chamber, oven, all over the place."
    },
    {
      "id": 201,
      "start": 551.8200073242188,
      "end": 553.0999755859375,
      "text": " I mean, think about all these frogs."
    },
    {
      "id": 202,
      "start": 553.0999755859375,
      "end": 555.6199951171875,
      "text": " And then the magicians, they were like,"
    },
    {
      "id": 203,
      "start": 555.6199951171875,
      "end": 557.280029296875,
      "text": " well, we can make frogs too."
    },
    {
      "id": 204,
      "start": 558.260009765625,
      "end": 560.0999755859375,
      "text": " I've never understood that."
    },
    {
      "id": 205,
      "start": 560.0999755859375,
      "end": 562.739990234375,
      "text": " You got so many frogs, frogs coming all over the place,"
    },
    {
      "id": 206,
      "start": 562.739990234375,
      "end": 565.280029296875,
      "text": " and these magicians are gonna create more frogs."
    },
    {
      "id": 207,
      "start": 565.280029296875,
      "end": 567.280029296875,
      "text": " It just doesn't make any kind of sense to me."
    },
    {
      "id": 208,
      "start": 567.280029296875,
      "end": 570.8599853515625,
      "text": " But we find that in each of these accounts,"
    },
    {
      "id": 209,
      "start": 570.8599853515625,
      "end": 573.1400146484375,
      "text": " as you look through the book of Exodus"
    },
    {
      "id": 210,
      "start": 573.1400146484375,
      "end": 575.6799926757812,
      "text": " and just using that one particular example,"
    },
    {
      "id": 211,
      "start": 575.6799926757812,
      "end": 577.739990234375,
      "text": " that God would send Moses to appear"
    },
    {
      "id": 212,
      "start": 577.739990234375,
      "end": 579.4199829101562,
      "text": " before Pharaoh once again."
    },
    {
      "id": 213,
      "start": 579.4199829101562,
      "end": 582.9000244140625,
      "text": " And after Pharaoh and Moses would have a conversation,"
    },
    {
      "id": 214,
      "start": 582.9000244140625,
      "end": 585.7000122070312,
      "text": " many times the conversation would go something like this."
    },
    {
      "id": 215,
      "start": 585.7000122070312,
      "end": 586.6599731445312,
      "text": " Pharaoh would say, listen,"
    },
    {
      "id": 216,
      "start": 586.6599731445312,
      "end": 589.6799926757812,
      "text": " if you would just allow this plague to depart,"
    },
    {
      "id": 217,
      "start": 589.6799926757812,
      "end": 590.780029296875,
      "text": " then we'll let you go."
    },
    {
      "id": 218,
      "start": 593.9000244140625,
      "end": 596.8599853515625,
      "text": " And so Moses would say, depending on the particular plague,"
    },
    {
      "id": 219,
      "start": 596.8599853515625,
      "end": 597.9000244140625,
      "text": " here's what's going to happen."
    },
    {
      "id": 220,
      "start": 597.9000244140625,
      "end": 599.8200073242188,
      "text": " I'm gonna depart, raise up my hands,"
    },
    {
      "id": 221,
      "start": 599.8200073242188,
      "end": 600.6599731445312,
      "text": " and it will go."
    },
    {
      "id": 0,
      "start": 600.6599731445312,
      "end": 609.299973487854,
      "text": " will be gone. Man, God's power. God's power. Not only to bring the plague, but then for"
    },
    {
      "id": 1,
      "start": 609.299973487854,
      "end": 614.1399726867676,
      "text": " the departure of the plague. And we're going to see how God is revealing His power. We"
    },
    {
      "id": 2,
      "start": 614.1399726867676,
      "end": 619.4399738311768,
      "text": " see in the first three that all are affected and in four through nine just the Egyptians."
    },
    {
      "id": 3,
      "start": 619.4399738311768,
      "end": 624.0199737548828,
      "text": " Of course we know that the death of the firstborn, that tenth plague, that the Bible would tell"
    },
    {
      "id": 4,
      "start": 624.0199737548828,
      "end": 630.0399723052979,
      "text": " us that those only would be exempt if they applied the blood. We spake this morning,"
    },
    {
      "id": 5,
      "start": 630.0399723052979,
      "end": 635.9999732971191,
      "text": " we sang the song about the power in the blood. And I'm so thankful for the blood of Jesus"
    },
    {
      "id": 6,
      "start": 635.9999732971191,
      "end": 641.0799713134766,
      "text": " Christ and I'm so thankful that we can sing this morning about the blood. And I'm so thankful"
    },
    {
      "id": 7,
      "start": 641.0799713134766,
      "end": 644.6599731445312,
      "text": " that as we look at the Old Testament and even as we find that the Bible would tell us in"
    },
    {
      "id": 8,
      "start": 644.6599731445312,
      "end": 648.5999717712402,
      "text": " Hebrews chapter number 10 that the Old Testament and the law and all of those offerings and"
    },
    {
      "id": 9,
      "start": 648.5999717712402,
      "end": 654.3599739074707,
      "text": " sacrifices that they were a shadow of good things to come. And I think about this Passover"
    },
    {
      "id": 10,
      "start": 654.3599739074707,
      "end": 659.3599739074707,
      "text": " as it would be known, as you would think about the tenth plague and you would think about"
    },
    {
      "id": 11,
      "start": 659.3599739074707,
      "end": 664.6799697875977,
      "text": " the application of the blood and the Bible would teach us and show us how that Paul would"
    },
    {
      "id": 12,
      "start": 664.6799697875977,
      "end": 671.6799697875977,
      "text": " conclude to the believers in Corinth, Christ our Passover. And I'm so thankful for the"
    },
    {
      "id": 13,
      "start": 671.6799697875977,
      "end": 677.219970703125,
      "text": " blood. Listen, the only way, there was only one way for the firstborn of any home, any"
    },
    {
      "id": 14,
      "start": 677.219970703125,
      "end": 683.1999740600586,
      "text": " household not to be destroyed, not to be killed, and that only way was by applying the blood."
    },
    {
      "id": 15,
      "start": 683.1999740600586,
      "end": 688.839973449707,
      "text": " There was but one way that God prescribed and we find that that had to be followed exactly"
    },
    {
      "id": 16,
      "start": 688.839973449707,
      "end": 694.9999694824219,
      "text": " how God said in order to spare life. And we would find this morning that even as we"
    },
    {
      "id": 17,
      "start": 694.9999694824219,
      "end": 700.1199722290039,
      "text": " look at that wonderful truth of that tenth plague that Jesus teaches us as we look at"
    },
    {
      "id": 18,
      "start": 700.1199722290039,
      "end": 704.8799743652344,
      "text": " the truth of the gospel that there's just one way to be saved. There are not many ways"
    },
    {
      "id": 19,
      "start": 704.8799743652344,
      "end": 709.5999755859375,
      "text": " to be saved. There are some that have this idea that you just are sincere in whatever"
    },
    {
      "id": 20,
      "start": 709.5999755859375,
      "end": 715.2799758911133,
      "text": " you believe and you'll just make it at the end. And I would submit to you that that's"
    },
    {
      "id": 21,
      "start": 715.2799758911133,
      "end": 723.2399749755859,
      "text": " just not biblically accurate. No doubt there are people that are sincere in what they believe"
    },
    {
      "id": 22,
      "start": 723.2399749755859,
      "end": 731.1999664306641,
      "text": " but I would say to you that they are sincerely wrong. You can be wrong and be sincere. We"
    },
    {
      "id": 23,
      "start": 731.1999664306641,
      "end": 740.0799713134766,
      "text": " find that Jesus said, I am the way. He didn't say a way. He said I am the way, the truth"
    },
    {
      "id": 24,
      "start": 740.0799713134766,
      "end": 752.1199798583984,
      "text": " and the life. No man cometh unto the Father but by me. And I'm so thankful that God Almighty"
    },
    {
      "id": 25,
      "start": 752.1199798583984,
      "end": 759.1199798583984,
      "text": " took our place so that we could be redeemed. See, there's only one way to be saved and"
    },
    {
      "id": 26,
      "start": 759.1199798583984,
      "end": 764.6799774169922,
      "text": " we see in these ten devastating plagues that even as God was displaying His power in all"
    },
    {
      "id": 27,
      "start": 764.6799774169922,
      "end": 770.1199798583984,
      "text": " that's taking place and all that is recorded for us in the book of Exodus with regard to"
    },
    {
      "id": 28,
      "start": 770.1199798583984,
      "end": 775.9199676513672,
      "text": " these plagues and God there in Egypt making His greatness known, we find that even in"
    },
    {
      "id": 29,
      "start": 775.9199676513672,
      "end": 781.5599670410156,
      "text": " that tenth plague, again as you follow the crimson cord through the scriptures, you'll"
    },
    {
      "id": 30,
      "start": 781.5599670410156,
      "end": 789.3599700927734,
      "text": " find again that truth of the blood. And every time they would observe the Passover, they"
    },
    {
      "id": 31,
      "start": 789.9199676513672,
      "end": 795.5999755859375,
      "text": " would be reminded of what God did in Egypt. But they would also be reminded of what God"
    },
    {
      "id": 32,
      "start": 795.5999755859375,
      "end": 801.6799774169922,
      "text": " promised to do one day at a place called Calvary. And I'm so thankful that this morning that"
    },
    {
      "id": 33,
      "start": 801.6799774169922,
      "end": 806.1599731445312,
      "text": " as we sit here, as we have the opportunity as New Testament believers that we can look"
    },
    {
      "id": 34,
      "start": 806.1599731445312,
      "end": 812.5599670410156,
      "text": " back to that day at Calvary when Jesus went to that cruel cross and He shed His precious"
    },
    {
      "id": 35,
      "start": 812.5999755859375,
      "end": 819.5999755859375,
      "text": " blood, that one work where He offered Himself one time for sin forever, what a blessed truth."
    },
    {
      "id": 36,
      "start": 821.1199798583984,
      "end": 825.7599792480469,
      "text": " This morning as we look at God demonstrating His greatness and making His greatness known"
    },
    {
      "id": 37,
      "start": 825.7599792480469,
      "end": 830.2399749755859,
      "text": " in Egypt, we see ten devastating plagues. Number two, if you're taking notes, I want"
    },
    {
      "id": 38,
      "start": 830.2399749755859,
      "end": 836.1599731445312,
      "text": " you to note God's divine power. We've already made mention with regard to the power of God"
    },
    {
      "id": 39,
      "start": 836.1599731445312,
      "end": 841.5199737548828,
      "text": " being displayed with regard to these plagues that He brought upon the Egyptians, but we"
    },
    {
      "id": 40,
      "start": 841.5199737548828,
      "end": 845.5999755859375,
      "text": " find that it's very interesting as I begin to study through the book of Exodus and these"
    },
    {
      "id": 41,
      "start": 845.5999755859375,
      "end": 851.3599700927734,
      "text": " particular testimonies and the accounts, it's interesting to me that we find that God is"
    },
    {
      "id": 42,
      "start": 851.3599700927734,
      "end": 857.1999816894531,
      "text": " revealing His power first to His own people, to His own people. You understand that the"
    },
    {
      "id": 43,
      "start": 857.1999816894531,
      "end": 862.5599670410156,
      "text": " children of Israel, they had to know how powerful God was. They had to understand the power"
    },
    {
      "id": 44,
      "start": 862.5599670410156,
      "end": 868.47998046875,
      "text": " of God. They were in Egyptian bondage. They were in a place where their life was bitter"
    },
    {
      "id": 45,
      "start": 868.5599670410156,
      "end": 873.1199645996094,
      "text": " and hard and difficult and all that they were facing and God said, I'm going to bring you"
    },
    {
      "id": 46,
      "start": 873.1199645996094,
      "end": 878.9599609375,
      "text": " out and I'm going to bring you to a place and we find that even as we would trace the"
    },
    {
      "id": 47,
      "start": 878.9599609375,
      "end": 883.0399780273438,
      "text": " steps of the children of Israel, as we would go forward through the scriptures and we would"
    },
    {
      "id": 48,
      "start": 883.0399780273438,
      "end": 889.0799865722656,
      "text": " understand that God already knew all of those things that would take place. See, we know"
    },
    {
      "id": 49,
      "start": 889.0799865722656,
      "end": 896.0799865722656,
      "text": " as we read the Bible, we know that the Egyptians would be devastated through those plagues"
    },
    {
      "id": 50,
      "start": 896.47998046875,
      "end": 900.7999877929688,
      "text": " and that the children of Israel would depart from the land of Egypt, but we find they'd"
    },
    {
      "id": 51,
      "start": 900.7999877929688,
      "end": 907.3999633789062,
      "text": " end up in a place called the Red Sea. Now God knew that, for the Bible tells us as you"
    },
    {
      "id": 52,
      "start": 907.3999633789062,
      "end": 913.1999816894531,
      "text": " study through the portion of scripture that it was God that led them to that very place."
    },
    {
      "id": 53,
      "start": 913.1999816894531,
      "end": 917.7999877929688,
      "text": " It was not that Moses had bad directional leadership and he just went the wrong way"
    },
    {
      "id": 54,
      "start": 917.7999877929688,
      "end": 923.0399780273438,
      "text": " and came to a place of difficulty. No, it was God Almighty that led them directly to"
    },
    {
      "id": 55,
      "start": 923.0399780273438,
      "end": 929.719970703125,
      "text": " that place and God through these plagues, He was revealing His power to His people"
    },
    {
      "id": 56,
      "start": 929.719970703125,
      "end": 935.9199829101562,
      "text": " so that they would know what God is able to do. I would say to you on a number of occasions,"
    },
    {
      "id": 57,
      "start": 935.9199829101562,
      "end": 942.2599792480469,
      "text": " they just didn't get the lesson. On a number of occasions they'd face a great difficulty."
    },
    {
      "id": 58,
      "start": 942.2599792480469,
      "end": 948.7999877929688,
      "text": " They'd not remember what God did. They would not recall what God did there in Egypt and"
    },
    {
      "id": 59,
      "start": 948.7999877929688,
      "end": 955.47998046875,
      "text": " all that He displayed to them, but we find that God was desiring that His people, the"
    },
    {
      "id": 60,
      "start": 955.47998046875,
      "end": 961.4399719238281,
      "text": " children of Israel, would know His power. In fact, the Bible says it this way in Psalm"
    },
    {
      "id": 61,
      "start": 961.4399719238281,
      "end": 968.4399719238281,
      "text": " 106 and verses 21 and 22, it says, they forgot God their Savior, which had done great things"
    },
    {
      "id": 62,
      "start": 968.4399719238281,
      "end": 975.2799682617188,
      "text": " in Egypt. And He showed His greatness. He made His greatness known in Egypt. You think"
    },
    {
      "id": 63,
      "start": 975.3199768066406,
      "end": 982.3199768066406,
      "text": " about those spies that went out. They went to spy out the land of Canaan and they say"
    },
    {
      "id": 64,
      "start": 982.3199768066406,
      "end": 989.3199768066406,
      "text": " ten of them were just not able. I mean the people have defense cities. I mean they have"
    },
    {
      "id": 65,
      "start": 991.9199829101562,
      "end": 998.5999755859375,
      "text": " walled cities. The people, they're giants in the land. There are two that stood and"
    },
    {
      "id": 66,
      "start": 998.5999755859375,
      "end": 1005.5999755859375,
      "text": " say God is able. God is able. And we find this morning that as we look at God's divine"
    },
    {
      "id": 67,
      "start": 1008.1199645996094,
      "end": 1014.4399719238281,
      "text": " power here as He's making His greatness known in Egypt, He's preparing His children for"
    },
    {
      "id": 68,
      "start": 1014.4399719238281,
      "end": 1019.719970703125,
      "text": " that which would come for those events that they would face in their lives and He's revealed"
    },
    {
      "id": 69,
      "start": 1019.719970703125,
      "end": 1026.3599853515625,
      "text": " His power to them. We find that God also reveals His power to the Egyptians. No doubt they"
    },
    {
      "id": 70,
      "start": 1026.3599853515625,
      "end": 1032.1199645996094,
      "text": " recognized the greatness of God's power. We find that the Egyptian society would be"
    },
    {
      "id": 71,
      "start": 1032.1199645996094,
      "end": 1037.4399719238281,
      "text": " a people group, a society that was polytheistic. You would find that there were people that"
    },
    {
      "id": 72,
      "start": 1037.4399719238281,
      "end": 1044.3599853515625,
      "text": " worshipped a plurality of gods. They did not serve the Lord God, Jehovah. They had this"
    },
    {
      "id": 73,
      "start": 1044.3599853515625,
      "end": 1049.1599731445312,
      "text": " polytheistic world view. In fact, if you were to study, we won't take the time this morning,"
    },
    {
      "id": 74,
      "start": 1049.1599731445312,
      "end": 1053.2799682617188,
      "text": " it's an interesting study, however, for those of you that may want to do it. You can look"
    },
    {
      "id": 75,
      "start": 1053.8799743652344,
      "end": 1059.4399719238281,
      "text": " at each of the plagues and you can find how each of those plagues were a direct attack"
    },
    {
      "id": 76,
      "start": 1059.4399719238281,
      "end": 1066.4399719238281,
      "text": " against one of the false deities that were served by the Egyptians. You can see that"
    },
    {
      "id": 77,
      "start": 1066.4399719238281,
      "end": 1073.3599853515625,
      "text": " and you can study that and you can see how God is revealing His power to the Egyptians."
    },
    {
      "id": 78,
      "start": 1073.3599853515625,
      "end": 1078.9599609375,
      "text": " See in the beginning you begin to note what's taking place as Moses and Aaron would stand"
    },
    {
      "id": 79,
      "start": 1078.9599609375,
      "end": 1084.9599609375,
      "text": " before Pharaoh as they would have these plagues. Even before the plagues began with the rod"
    },
    {
      "id": 80,
      "start": 1084.9599609375,
      "end": 1091.47998046875,
      "text": " that turned to a serpent, well the servants of Pharaoh were like, we could do that too."
    },
    {
      "id": 81,
      "start": 1091.47998046875,
      "end": 1098.1599731445312,
      "text": " But soon they recognized that this power of Jehovah was a power they were not familiar"
    },
    {
      "id": 82,
      "start": 1098.1599731445312,
      "end": 1106.719970703125,
      "text": " with. That this God of the children of Israel was different than the false gods that they"
    },
    {
      "id": 83,
      "start": 1106.719970703125,
      "end": 1112.3799743652344,
      "text": " served. In fact, if you were to look there in Exodus 8 and verse number 19, it's interesting,"
    },
    {
      "id": 84,
      "start": 1112.3799743652344,
      "end": 1117.2799682617188,
      "text": " this year again only after in this particular account just a couple of plagues that have"
    },
    {
      "id": 85,
      "start": 1117.2799682617188,
      "end": 1122.7599487304688,
      "text": " taken place, they're in the midst of the third plague here and the third one being"
    },
    {
      "id": 86,
      "start": 1122.7599487304688,
      "end": 1128.0799560546875,
      "text": " lice and we find that that takes place in chapter number 8 and verse number 16. And"
    },
    {
      "id": 87,
      "start": 1128.0799560546875,
      "end": 1132.7999877929688,
      "text": " we find that the Bible tells us, notice in verse number 17, it says, and they did so"
    },
    {
      "id": 88,
      "start": 1132.7999877929688,
      "end": 1137.239990234375,
      "text": " for Aaron stretched out his hand with his rod and smote the dust of the earth and it"
    },
    {
      "id": 89,
      "start": 1137.239990234375,
      "end": 1143.239990234375,
      "text": " became lice in man and in beast. All the dust of the land became lice throughout all the"
    },
    {
      "id": 90,
      "start": 1143.239990234375,
      "end": 1148.0799560546875,
      "text": " land of Egypt. That's terrible. I can't even imagine. You ever get out in the yard"
    },
    {
      "id": 91,
      "start": 1148.0799560546875,
      "end": 1151.0799560546875,
      "text": " and work and you got those little gnats that fly around? Make you feel like you're going"
    },
    {
      "id": 92,
      "start": 1151.0799560546875,
      "end": 1159.6799926757812,
      "text": " to lose your mind, right? Make you go absolutely insane. Lice, all the dust, I mean can you"
    },
    {
      "id": 93,
      "start": 1159.6799926757812,
      "end": 1165.6399536132812,
      "text": " imagine? But notice this, it says in verse number 18, and the magicians did so with"
    },
    {
      "id": 94,
      "start": 1165.6399536132812,
      "end": 1171.5599975585938,
      "text": " their enchantments. Again, I don't understand it, to bring forth lice. But notice these"
    },
    {
      "id": 95,
      "start": 1171.5599975585938,
      "end": 1181.6399536132812,
      "text": " words, but they could not. But they could not. So, there were lice upon man and upon"
    },
    {
      "id": 96,
      "start": 1181.6399536132812,
      "end": 1190.7599487304688,
      "text": " beast. Notice in verse number 19, then, then the magicians said unto Pharaoh, this is"
    },
    {
      "id": 97,
      "start": 1190.7599487304688,
      "end": 1200.199951171875,
      "text": " the finger of God. These magicians that serve these false gods."
    },
    {
      "id": 0,
      "start": 1200.199951171875,
      "end": 1205.359951019287,
      "text": " See, the Egyptians, they had to know the power of God."
    },
    {
      "id": 1,
      "start": 1205.359951019287,
      "end": 1207.4999513626099,
      "text": " They had to understand God was revealing."
    },
    {
      "id": 2,
      "start": 1207.4999513626099,
      "end": 1212.4399509429932,
      "text": " As we look at the truth of the Word of God and we begin to see throughout the pages of"
    },
    {
      "id": 3,
      "start": 1212.4399509429932,
      "end": 1222.7599506378174,
      "text": " Scripture that God desires to make Himself known to people, His prized creation."
    },
    {
      "id": 4,
      "start": 1222.7599506378174,
      "end": 1223.7599506378174,
      "text": " He loves us."
    },
    {
      "id": 5,
      "start": 1223.7599506378174,
      "end": 1226.279951095581,
      "text": " He died for us."
    },
    {
      "id": 6,
      "start": 1226.279951095581,
      "end": 1229.3199520111084,
      "text": " He seeks to make Himself known."
    },
    {
      "id": 7,
      "start": 1229.3199520111084,
      "end": 1234.639949798584,
      "text": " And we find that here as we consider these 10 devastating plagues, but then we know God's"
    },
    {
      "id": 8,
      "start": 1234.639949798584,
      "end": 1239.9999504089355,
      "text": " divine power not only revealed to the children of Israel, to His people at that time, but"
    },
    {
      "id": 9,
      "start": 1239.9999504089355,
      "end": 1243.759952545166,
      "text": " we find to the Egyptians as well, and I would submit to you this morning that His divine"
    },
    {
      "id": 10,
      "start": 1243.759952545166,
      "end": 1249.9999504089355,
      "text": " power through this account that is given to us and recorded and preserved in God's Word"
    },
    {
      "id": 11,
      "start": 1249.9999504089355,
      "end": 1257.0799522399902,
      "text": " for us this morning, that believers throughout the ages have been helped by understanding"
    },
    {
      "id": 12,
      "start": 1257.0799522399902,
      "end": 1262.139949798584,
      "text": " God's great power as it was made known in Egypt."
    },
    {
      "id": 13,
      "start": 1262.139949798584,
      "end": 1267.4399490356445,
      "text": " You read through these portions of Scripture and you see plague after plague and you see"
    },
    {
      "id": 14,
      "start": 1267.4399490356445,
      "end": 1275.6599502563477,
      "text": " situation and event that unfold and you say, man, look at the power of God Almighty."
    },
    {
      "id": 15,
      "start": 1275.6599502563477,
      "end": 1281.8799514770508,
      "text": " We see that throughout the ages, God's people have been helped, have been blessed, have"
    },
    {
      "id": 16,
      "start": 1281.8799514770508,
      "end": 1288.7599487304688,
      "text": " been encouraged, have understood in a greater way just how wonderful and great the power"
    },
    {
      "id": 17,
      "start": 1288.7599487304688,
      "end": 1291.5599517822266,
      "text": " of God Almighty is."
    },
    {
      "id": 18,
      "start": 1291.5599517822266,
      "end": 1298.9599533081055,
      "text": " I'm thankful this morning that God is able to not only declare to us truth, but on so"
    },
    {
      "id": 19,
      "start": 1298.9599533081055,
      "end": 1302.4799499511719,
      "text": " many times He demonstrates those truths to us."
    },
    {
      "id": 20,
      "start": 1302.4799499511719,
      "end": 1305.9199523925781,
      "text": " See, it's one thing for God to have said, here's what I am."
    },
    {
      "id": 21,
      "start": 1305.9199523925781,
      "end": 1307.4799499511719,
      "text": " I am all powerful."
    },
    {
      "id": 22,
      "start": 1307.4799499511719,
      "end": 1308.799949645996,
      "text": " I am merciful."
    },
    {
      "id": 23,
      "start": 1308.799949645996,
      "end": 1309.799949645996,
      "text": " I am gracious."
    },
    {
      "id": 24,
      "start": 1309.799949645996,
      "end": 1315.2399520874023,
      "text": " I am, just keep on, I am love."
    },
    {
      "id": 25,
      "start": 1315.2399520874023,
      "end": 1320.2599487304688,
      "text": " That would certainly help us to understand who He is."
    },
    {
      "id": 26,
      "start": 1320.2599487304688,
      "end": 1324.9999542236328,
      "text": " But He said, I am all powerful, and then He demonstrates His power."
    },
    {
      "id": 27,
      "start": 1324.9999542236328,
      "end": 1328.4799499511719,
      "text": " He says, I am merciful, and then He demonstrates His mercy."
    },
    {
      "id": 28,
      "start": 1328.4799499511719,
      "end": 1334.439956665039,
      "text": " He says, I am compassionate, and then we see where the Bible teaches us where God is moved"
    },
    {
      "id": 29,
      "start": 1334.439956665039,
      "end": 1335.8799438476562,
      "text": " with compassion."
    },
    {
      "id": 30,
      "start": 1335.8799438476562,
      "end": 1339.9199523925781,
      "text": " We find that He says, I am love, and God is love, but He said, for God's soul of the"
    },
    {
      "id": 31,
      "start": 1339.9199523925781,
      "end": 1345.7399444580078,
      "text": " world that He gave His only begotten Son, He demonstrated His love for us."
    },
    {
      "id": 32,
      "start": 1345.7399444580078,
      "end": 1350.439956665039,
      "text": " And I'm so thankful that as you study the pages of this precious book that you find"
    },
    {
      "id": 33,
      "start": 1350.439956665039,
      "end": 1354.8799438476562,
      "text": " that God declares to us who He is, but He also demonstrates."
    },
    {
      "id": 34,
      "start": 1354.8799438476562,
      "end": 1360.7999572753906,
      "text": " And listen, it helps us when we have the record of what God is able to do and we see God's"
    },
    {
      "id": 35,
      "start": 1360.7999572753906,
      "end": 1366.1599578857422,
      "text": " power at work, and it helps me and it helps you as we face life."
    },
    {
      "id": 36,
      "start": 1366.1599578857422,
      "end": 1367.7999572753906,
      "text": " God is all powerful."
    },
    {
      "id": 37,
      "start": 1367.7999572753906,
      "end": 1372.5599517822266,
      "text": " It's not just that He stated it, though that would be sufficient, but then He reveals it"
    },
    {
      "id": 38,
      "start": 1372.5599517822266,
      "end": 1377.0799560546875,
      "text": " to us and He demonstrates it in such a great way."
    },
    {
      "id": 39,
      "start": 1377.0799560546875,
      "end": 1381.0799560546875,
      "text": " We see here ten devastating plagues."
    },
    {
      "id": 40,
      "start": 1381.0799560546875,
      "end": 1384.719955444336,
      "text": " We see the divine power of God on display."
    },
    {
      "id": 41,
      "start": 1384.719955444336,
      "end": 1389.2799530029297,
      "text": " And I would say this if you're taking notes, number three, notice God's divine purpose."
    },
    {
      "id": 42,
      "start": 1389.2799530029297,
      "end": 1392.7599487304688,
      "text": " I'm so thankful that God always has purpose."
    },
    {
      "id": 43,
      "start": 1392.7599487304688,
      "end": 1396.959945678711,
      "text": " I'm thankful that as you study through the portion of Scripture here in the book of Exodus"
    },
    {
      "id": 44,
      "start": 1396.959945678711,
      "end": 1402.719955444336,
      "text": " with regard to the plagues and as you note what's taking place, that you understand that"
    },
    {
      "id": 45,
      "start": 1402.719955444336,
      "end": 1406.3199462890625,
      "text": " God is moving with purpose."
    },
    {
      "id": 46,
      "start": 1406.3199462890625,
      "end": 1411.3199462890625,
      "text": " In your life and in my life today, God has purpose."
    },
    {
      "id": 47,
      "start": 1411.3199462890625,
      "end": 1416.3199462890625,
      "text": " You face a circumstance, you face a difficulty, you have a season of blessing, a season of"
    },
    {
      "id": 48,
      "start": 1416.439956665039,
      "end": 1421.5999450683594,
      "text": " trial, and you find in all of that God has purpose."
    },
    {
      "id": 49,
      "start": 1421.5999450683594,
      "end": 1425.7599487304688,
      "text": " And I'm so thankful that God has purpose."
    },
    {
      "id": 50,
      "start": 1425.7599487304688,
      "end": 1432.7599487304688,
      "text": " And we find that as we look at the text of Scripture, I would say that ultimately, through"
    },
    {
      "id": 51,
      "start": 1433.3999481201172,
      "end": 1438.679946899414,
      "text": " every circumstance that we face in life, that ultimately God's purpose is that He would"
    },
    {
      "id": 52,
      "start": 1438.679946899414,
      "end": 1441.1199493408203,
      "text": " be glorified."
    },
    {
      "id": 53,
      "start": 1441.1199493408203,
      "end": 1445.9799499511719,
      "text": " That is the ultimate purpose, that God would be glorified."
    },
    {
      "id": 54,
      "start": 1445.9799499511719,
      "end": 1451.0599517822266,
      "text": " As we live our lives, as we live day by day, our desire ought to be that we live in such"
    },
    {
      "id": 55,
      "start": 1451.0599517822266,
      "end": 1454.219955444336,
      "text": " a manner that God is glorified."
    },
    {
      "id": 56,
      "start": 1454.219955444336,
      "end": 1456.8999633789062,
      "text": " That God is exalted and magnified in my life."
    },
    {
      "id": 57,
      "start": 1456.8999633789062,
      "end": 1460.8199462890625,
      "text": " Listen, it's not about you, it's not about me, it's all about Jesus."
    },
    {
      "id": 58,
      "start": 1460.8199462890625,
      "end": 1465.4199523925781,
      "text": " The Bible teaches us, even as we read in John chapter number three, that wonderful statement"
    },
    {
      "id": 59,
      "start": 1465.4199523925781,
      "end": 1471.2599487304688,
      "text": " from John the Baptist when he said, listen, I must decrease, but He, He, the Lord Jesus"
    },
    {
      "id": 60,
      "start": 1471.2599487304688,
      "end": 1474.5399475097656,
      "text": " Christ, He must increase."
    },
    {
      "id": 61,
      "start": 1474.5399475097656,
      "end": 1477.3799438476562,
      "text": " In my life and in your life, it's all about Him."
    },
    {
      "id": 62,
      "start": 1477.3799438476562,
      "end": 1483.8999633789062,
      "text": " And that ultimately is the main purpose, the high-level purpose is that God would be glorified."
    },
    {
      "id": 63,
      "start": 1483.8999633789062,
      "end": 1485.6599426269531,
      "text": " How does He accomplish that purpose?"
    },
    {
      "id": 64,
      "start": 1485.6599426269531,
      "end": 1490.5399475097656,
      "text": " Well, as we look here at the book of Exodus and we begin to look at some things with regard"
    },
    {
      "id": 65,
      "start": 1490.5399475097656,
      "end": 1494.7799377441406,
      "text": " to the purpose of God being revealed to us, I want you to note what is said in chapter"
    },
    {
      "id": 66,
      "start": 1494.7799377441406,
      "end": 1499.3399658203125,
      "text": " number five of the book of Exodus, and then we'll go forward from there looking at a number"
    },
    {
      "id": 67,
      "start": 1499.3399658203125,
      "end": 1501.8199462890625,
      "text": " of portions of Scripture."
    },
    {
      "id": 68,
      "start": 1501.8199462890625,
      "end": 1506.5799560546875,
      "text": " Notice in chapter number five of the book of Exodus, this is when we first read of the"
    },
    {
      "id": 69,
      "start": 1506.5799560546875,
      "end": 1510.0199584960938,
      "text": " obedience of Moses as he comes before Pharaoh."
    },
    {
      "id": 70,
      "start": 1510.0199584960938,
      "end": 1515.4599609375,
      "text": " The Bible says in verse number one, and afterward Moses and Aaron went in and told Pharaoh,"
    },
    {
      "id": 71,
      "start": 1515.4599609375,
      "end": 1520.1799621582031,
      "text": " thus saith the Lord God of Israel, let my people go, that they may hold a feast unto"
    },
    {
      "id": 72,
      "start": 1520.1799621582031,
      "end": 1521.1799621582031,
      "text": " me in the wilderness."
    },
    {
      "id": 73,
      "start": 1521.1799621582031,
      "end": 1527.4599609375,
      "text": " Notice in verse number two, and Pharaoh said, who is the Lord that I should obey His voice"
    },
    {
      "id": 74,
      "start": 1527.4599609375,
      "end": 1529.3799438476562,
      "text": " to let Israel go?"
    },
    {
      "id": 75,
      "start": 1529.3799438476562,
      "end": 1535.0599365234375,
      "text": " I know not the Lord, neither will I let Israel go."
    },
    {
      "id": 76,
      "start": 1535.0599365234375,
      "end": 1539.2999572753906,
      "text": " See Pharaoh didn't know who God was."
    },
    {
      "id": 77,
      "start": 1539.2999572753906,
      "end": 1540.2999572753906,
      "text": " Pharaoh didn't know God."
    },
    {
      "id": 78,
      "start": 1540.2999572753906,
      "end": 1550.699951171875,
      "text": " I think about Nebuchadnezzar in the book of Daniel, he says bow to this image, the three"
    },
    {
      "id": 79,
      "start": 1550.699951171875,
      "end": 1555.6199645996094,
      "text": " Hebrew children that refused to bow, and he says, who is that God that will deliver you"
    },
    {
      "id": 80,
      "start": 1555.6199645996094,
      "end": 1556.6199645996094,
      "text": " out of my hand?"
    },
    {
      "id": 81,
      "start": 1556.8599548339844,
      "end": 1560.1799621582031,
      "text": " He was soon going to find out who that God was."
    },
    {
      "id": 82,
      "start": 1560.1799621582031,
      "end": 1561.1799621582031,
      "text": " He is the Lord God Almighty."
    },
    {
      "id": 83,
      "start": 1561.1799621582031,
      "end": 1567.7399597167969,
      "text": " And he sat there, the Bible says a stone-eyed, looking in and he says, did not, hey, hey,"
    },
    {
      "id": 84,
      "start": 1567.7399597167969,
      "end": 1573.4199523925781,
      "text": " hey, hey guys, didn't we throw three in there, bound?"
    },
    {
      "id": 85,
      "start": 1573.4199523925781,
      "end": 1579.9799499511719,
      "text": " But there's four walking around and the fourth is like unto the Son of God, the Son of Man."
    },
    {
      "id": 86,
      "start": 1579.9799499511719,
      "end": 1583.5799560546875,
      "text": " Wow, God's power."
    },
    {
      "id": 87,
      "start": 1583.5799560546875,
      "end": 1586.8999633789062,
      "text": " Pharaoh says, who is the Lord?"
    },
    {
      "id": 88,
      "start": 1586.8999633789062,
      "end": 1590.0599365234375,
      "text": " Who is the Lord that I should obey His voice to let Israel go?"
    },
    {
      "id": 89,
      "start": 1590.0599365234375,
      "end": 1594.0199584960938,
      "text": " I would submit to you that over the next several chapters in the book of Exodus as we think"
    },
    {
      "id": 90,
      "start": 1594.0199584960938,
      "end": 1595.9799499511719,
      "text": " about these ten plagues, you know what God does?"
    },
    {
      "id": 91,
      "start": 1595.9799499511719,
      "end": 1598.7399597167969,
      "text": " He makes Himself known to Pharaoh."
    },
    {
      "id": 92,
      "start": 1598.7399597167969,
      "end": 1601.4599609375,
      "text": " He shows Pharaoh who He is."
    },
    {
      "id": 93,
      "start": 1601.4599609375,
      "end": 1605.4199523925781,
      "text": " See if we don't know who God is, we can't glorify Him."
    },
    {
      "id": 94,
      "start": 1605.4199523925781,
      "end": 1607.4199523925781,
      "text": " The ultimate purpose is to glorify God."
    },
    {
      "id": 95,
      "start": 1607.4199523925781,
      "end": 1612.7799377441406,
      "text": " Listen, before you trusted Christ as your Savior, you probably weren't glorifying God."
    },
    {
      "id": 96,
      "start": 1612.9799499511719,
      "end": 1616.699951171875,
      "text": " But after we trust Christ as our Savior, begin to live a life that we can bring glory and"
    },
    {
      "id": 97,
      "start": 1616.699951171875,
      "end": 1617.699951171875,
      "text": " honor to Him."
    },
    {
      "id": 98,
      "start": 1617.699951171875,
      "end": 1618.699951171875,
      "text": " Why?"
    },
    {
      "id": 99,
      "start": 1618.699951171875,
      "end": 1622.6199645996094,
      "text": " Because I understand now that the purpose of my life is to bring glory to my God."
    },
    {
      "id": 100,
      "start": 1622.6199645996094,
      "end": 1627.4199523925781,
      "text": " And whatsoever you do, right, whether you eat, no matter what you do, do all to the"
    },
    {
      "id": 101,
      "start": 1627.4199523925781,
      "end": 1630.4199523925781,
      "text": " glory of God."
    },
    {
      "id": 102,
      "start": 1630.4199523925781,
      "end": 1639.5399475097656,
      "text": " We find here that as we look at this text of Scripture and we find that Moses says to Pharaoh"
    },
    {
      "id": 103,
      "start": 1639.5399475097656,
      "end": 1643.0999450683594,
      "text": " that God said, let my people go, and Pharaoh says, who is He?"
    },
    {
      "id": 104,
      "start": 1643.0999450683594,
      "end": 1644.3799438476562,
      "text": " I don't know who He is."
    },
    {
      "id": 105,
      "start": 1644.3799438476562,
      "end": 1648.9799499511719,
      "text": " Notice in verse number four of chapter number seven, keep moving along, the Bible says this,"
    },
    {
      "id": 106,
      "start": 1648.9799499511719,
      "end": 1654.6199645996094,
      "text": " but Pharaoh shall not hearken unto you that I may lay my hand upon Egypt and bring forth"
    },
    {
      "id": 107,
      "start": 1654.6199645996094,
      "end": 1658.4199523925781,
      "text": " mine armies and my people, the children of Israel, out of the land of Egypt by great"
    },
    {
      "id": 108,
      "start": 1658.4199523925781,
      "end": 1659.4199523925781,
      "text": " judgments."
    },
    {
      "id": 109,
      "start": 1659.4199523925781,
      "end": 1667.5399475097656,
      "text": " Notice verse number five, and the Egyptians shall know that I am the Lord."
    },
    {
      "id": 110,
      "start": 1667.5399475097656,
      "end": 1672.3799438476562,
      "text": " And I stretch forth mine hand upon Egypt and bring out the children of Israel from"
    },
    {
      "id": 111,
      "start": 1672.3799438476562,
      "end": 1673.8999633789062,
      "text": " among them."
    },
    {
      "id": 112,
      "start": 1673.8999633789062,
      "end": 1678.2799377441406,
      "text": " Remember, I referenced already in chapter eight and verse number 19 after the third"
    },
    {
      "id": 113,
      "start": 1678.2799377441406,
      "end": 1680.5399475097656,
      "text": " plague with the lice, what happens?"
    },
    {
      "id": 114,
      "start": 1680.5399475097656,
      "end": 1686.8599548339844,
      "text": " The magicians, they say this is the finger of God."
    },
    {
      "id": 115,
      "start": 1686.8599548339844,
      "end": 1694.6599426269531,
      "text": " As we find that God was making Himself known, He was revealing Himself, we find that in"
    },
    {
      "id": 116,
      "start": 1694.6599426269531,
      "end": 1699.8599548339844,
      "text": " chapter number nine, notice a couple of verses here, as we continue to see how God is working"
    },
    {
      "id": 117,
      "start": 1699.8599548339844,
      "end": 1704.5399475097656,
      "text": " and what God is doing, you'll reference this or you'll note this reference throughout the"
    },
    {
      "id": 118,
      "start": 1704.5399475097656,
      "end": 1709.8599548339844,
      "text": " pages of this portion of God's Word where the Bible speaks about that you may know something."
    },
    {
      "id": 119,
      "start": 1709.8599548339844,
      "end": 1713.179931640625,
      "text": " Notice with me in verse number 14."
    },
    {
      "id": 120,
      "start": 1713.179931640625,
      "end": 1717.419921875,
      "text": " The Bible says, for I will at this time send all my plagues upon thine heart and upon thy"
    },
    {
      "id": 121,
      "start": 1717.419921875,
      "end": 1719.699951171875,
      "text": " servants and upon thy people."
    },
    {
      "id": 122,
      "start": 1719.699951171875,
      "end": 1724.419921875,
      "text": " Notice that thou mayest know that there is none like me in all the earth."
    },
    {
      "id": 123,
      "start": 1724.419921875,
      "end": 1726.419921875,
      "text": " Isn't that wonderful?"
    },
    {
      "id": 124,
      "start": 1726.419921875,
      "end": 1728.8999633789062,
      "text": " You know, there's no one like Jesus."
    },
    {
      "id": 125,
      "start": 1728.8999633789062,
      "end": 1729.8999633789062,
      "text": " No one."
    },
    {
      "id": 126,
      "start": 1729.8999633789062,
      "end": 1733.219970703125,
      "text": " No one's going to satisfy you like Jesus will satisfy you."
    },
    {
      "id": 127,
      "start": 1733.219970703125,
      "end": 1736.2999267578125,
      "text": " Jesus, I think they played the offertory this morning."
    },
    {
      "id": 128,
      "start": 1736.2999267578125,
      "end": 1737.6199340820312,
      "text": " Jesus is the sweetest name I know."
    },
    {
      "id": 129,
      "start": 1737.6199340820312,
      "end": 1739.0199584960938,
      "text": " Is that what you guys played?"
    },
    {
      "id": 130,
      "start": 1739.0199584960938,
      "end": 1741.8599243164062,
      "text": " Jesus is the sweetest name I know."
    },
    {
      "id": 131,
      "start": 1741.8599243164062,
      "end": 1743.699951171875,
      "text": " It really is."
    },
    {
      "id": 132,
      "start": 1743.699951171875,
      "end": 1748.1399536132812,
      "text": " I mean, after you understand, I mean, when you hear the name Jesus, man, immediately"
    },
    {
      "id": 133,
      "start": 1748.1399536132812,
      "end": 1751.5399780273438,
      "text": " what comes to your mind, what comes to your heart, man, He's my Savior."
    },
    {
      "id": 134,
      "start": 1751.5399780273438,
      "end": 1752.699951171875,
      "text": " He's my all in all."
    },
    {
      "id": 135,
      "start": 1752.699951171875,
      "end": 1755.5399780273438,
      "text": " He's my everything."
    },
    {
      "id": 136,
      "start": 1755.5399780273438,
      "end": 1760.0199584960938,
      "text": " It grieves my heart when I hear somebody use the name of my Savior in vain."
    },
    {
      "id": 137,
      "start": 1760.0199584960938,
      "end": 1761.0199584960938,
      "text": " Why?"
    },
    {
      "id": 138,
      "start": 1761.0199584960938,
      "end": 1766.93994140625,
      "text": " Because Jesus is my Savior and it means so much to me."
    },
    {
      "id": 139,
      "start": 1766.93994140625,
      "end": 1775.6599731445312,
      "text": " We find that God says that thou mayest know that there is none like me in all the earth."
    },
    {
      "id": 140,
      "start": 1775.97998046875,
      "end": 1780.5399780273438,
      "text": " Oh, the Egyptians had a plurality of false gods."
    },
    {
      "id": 141,
      "start": 1780.5399780273438,
      "end": 1785.0999755859375,
      "text": " But God was going to display His power in such a way that they would know that there's"
    },
    {
      "id": 142,
      "start": 1785.0999755859375,
      "end": 1786.6599731445312,
      "text": " no one like Him."
    },
    {
      "id": 143,
      "start": 1786.6599731445312,
      "end": 1787.6599731445312,
      "text": " There's no one like Him."
    },
    {
      "id": 144,
      "start": 1787.6599731445312,
      "end": 1791.699951171875,
      "text": " Listen, the more you get to know the Lord, you find there's no one like Him."
    },
    {
      "id": 145,
      "start": 1791.699951171875,
      "end": 1792.699951171875,
      "text": " No one like Him."
    },
    {
      "id": 146,
      "start": 1792.699951171875,
      "end": 1799.2599487304688,
      "text": " Listen, there's no other world religion, there's no other cult group that offers anything that"
    },
    {
      "id": 147,
      "start": 1799.2599487304688,
      "end": 1800.2599487304688,
      "text": " we find that this."
    },
    {
      "id": 0,
      "start": 1800.2599487304688,
      "end": 1806.8599486351013,
      "text": " book gives us. And I'm so thankful to know God. It's a wonderful privilege. You know"
    },
    {
      "id": 1,
      "start": 1806.8599486351013,
      "end": 1813.0599489212036,
      "text": " people today around our globe, they don't know who God is. They would be in that same"
    },
    {
      "id": 2,
      "start": 1813.0599489212036,
      "end": 1822.4599494934082,
      "text": " situation of Pharaoh there in Exodus chapter 5, of Nebuchadnezzar over in the book of Daniel."
    },
    {
      "id": 3,
      "start": 1822.4599494934082,
      "end": 1831.0599479675293,
      "text": " Who is that God? They don't know him. You remember as Paul was there, he was supposed"
    },
    {
      "id": 4,
      "start": 1831.0599479675293,
      "end": 1836.0399475097656,
      "text": " to go to Athens to get a little R&R if you will, but he saw a city that was wholly given"
    },
    {
      "id": 5,
      "start": 1836.0399475097656,
      "end": 1841.8199501037598,
      "text": " to idolatry. He walked through and he saw all of these altars and he came to a place"
    },
    {
      "id": 6,
      "start": 1841.8199501037598,
      "end": 1848.4999504089355,
      "text": " and he found this altar that was marked to the unknown God. Paul stood before those men"
    },
    {
      "id": 7,
      "start": 1848.4999504089355,
      "end": 1856.299949645996,
      "text": " and he said, him declare I unto you. He was making God known. I'm so thankful that God"
    },
    {
      "id": 8,
      "start": 1856.299949645996,
      "end": 1861.3199501037598,
      "text": " is making himself known. Look, skip down to verse number 29 there in Exodus chapter 9."
    },
    {
      "id": 9,
      "start": 1861.3199501037598,
      "end": 1866.299949645996,
      "text": " Notice what the Bible says. And Moses said unto him, as soon as I am gone out of the"
    },
    {
      "id": 10,
      "start": 1866.299949645996,
      "end": 1871.799949645996,
      "text": " city I will spread abroad my hands unto the Lord and the thunder shall cease. Neither"
    },
    {
      "id": 11,
      "start": 1871.799949645996,
      "end": 1880.5999450683594,
      "text": " shall there be any more hail. Why? That thou mayest know how that the earth is the Lord's."
    },
    {
      "id": 12,
      "start": 1880.5999450683594,
      "end": 1886.3999481201172,
      "text": " He is the creator and the possessor of. All things are his. And we find that again as"
    },
    {
      "id": 13,
      "start": 1886.3999481201172,
      "end": 1891.4399490356445,
      "text": " I mentioned just a few moments ago how that the coming of the plagues but also the departure"
    },
    {
      "id": 14,
      "start": 1891.4399490356445,
      "end": 1894.2399520874023,
      "text": " of the plagues. And Moses said, listen, I'm going to go and I'm going to spread abroad"
    },
    {
      "id": 15,
      "start": 1894.2399520874023,
      "end": 1897.6399459838867,
      "text": " my hands unto the Lord. The thunder is going to cease and there's not going to be any more"
    },
    {
      "id": 16,
      "start": 1897.6399459838867,
      "end": 1906.1199493408203,
      "text": " hail. That's faith by the way. Amen? We find that he said that you would know how that"
    },
    {
      "id": 17,
      "start": 1906.1199493408203,
      "end": 1914.4399490356445,
      "text": " the earth is the Lord's. God gave a promise when he gave the Noahic covenant with regard"
    },
    {
      "id": 18,
      "start": 1914.4399490356445,
      "end": 1920.1199493408203,
      "text": " to seasons. We find that in our society today that we find all of this talk about global"
    },
    {
      "id": 19,
      "start": 1920.1199493408203,
      "end": 1925.079948425293,
      "text": " warming and all sorts of things that are going on but we find that the Noahic covenant that"
    },
    {
      "id": 20,
      "start": 1925.079948425293,
      "end": 1930.3999481201172,
      "text": " God gave a promise with regard to seasons and that they would not fail. Listen, the"
    },
    {
      "id": 21,
      "start": 1930.3999481201172,
      "end": 1937.9199523925781,
      "text": " earth is God's. He created it. And by the way, it is going to be burned up one day."
    },
    {
      "id": 22,
      "start": 1937.9199523925781,
      "end": 1942.3199462890625,
      "text": " You read in 2 Peter chapter number 3 and you read about what's going to happen. But that's"
    },
    {
      "id": 23,
      "start": 1942.3199462890625,
      "end": 1949.9999542236328,
      "text": " in God's time. That's according to God's plan. Notice with me in Exodus chapter number 10"
    },
    {
      "id": 24,
      "start": 1949.9999542236328,
      "end": 1954.199951171875,
      "text": " beginning in verse number 1 the Bible says the Lord said unto Moses, go in unto Pharaoh"
    },
    {
      "id": 25,
      "start": 1954.199951171875,
      "end": 1957.8399505615234,
      "text": " for I have heart in his heart and the heart of his servants that I might show these my"
    },
    {
      "id": 26,
      "start": 1957.8399505615234,
      "end": 1964.6399536132812,
      "text": " signs before him and that thou mayest tell in the ears of thy son and of thy son's son"
    },
    {
      "id": 27,
      "start": 1964.6399536132812,
      "end": 1969.6399536132812,
      "text": " what things I have wrought in Egypt and my signs which I have done among them that ye"
    },
    {
      "id": 28,
      "start": 1969.6399536132812,
      "end": 1978.679946899414,
      "text": " may know how that I am the Lord. Listen, God was interested in the perpetuity of this truth."
    },
    {
      "id": 29,
      "start": 1978.679946899414,
      "end": 1984.0799560546875,
      "text": " He was interested and he says to Moses, listen, I'm doing these things. I'm showing you"
    },
    {
      "id": 30,
      "start": 1984.0799560546875,
      "end": 1989.9999542236328,
      "text": " my power. I'm demonstrating to you my power and my greatness not only so that you would"
    },
    {
      "id": 31,
      "start": 1989.9999542236328,
      "end": 1996.2399444580078,
      "text": " know but so that you can declare these truths to your sons and to their sons. What a wonderful"
    },
    {
      "id": 32,
      "start": 1996.2399444580078,
      "end": 2002.3199462890625,
      "text": " blessing to see the perpetuity of truth, to understand that it's our responsibility to"
    },
    {
      "id": 33,
      "start": 2002.3199462890625,
      "end": 2007.6399536132812,
      "text": " influence and impact and teach those that are coming before or behind us that we would"
    },
    {
      "id": 34,
      "start": 2007.6399536132812,
      "end": 2013.6399536132812,
      "text": " teach them to set their hope in God that they would know the wonderful works of God, that"
    },
    {
      "id": 35,
      "start": 2013.6399536132812,
      "end": 2018.1599426269531,
      "text": " they would have faith in what God is able to do, that they would know the power of God"
    },
    {
      "id": 36,
      "start": 2018.1599426269531,
      "end": 2025.2399444580078,
      "text": " Almighty. In chapter number 13, this is dealing specifically with the children of Israel with"
    },
    {
      "id": 37,
      "start": 2025.2399444580078,
      "end": 2032.6399536132812,
      "text": " regard to the Passover. The dedication of the firstborn is recorded here, all the information"
    },
    {
      "id": 38,
      "start": 2032.6399536132812,
      "end": 2038.2799530029297,
      "text": " given with regard to the process and the applying of blood and so on and so forth. And notice"
    },
    {
      "id": 39,
      "start": 2038.2799530029297,
      "end": 2043.0399475097656,
      "text": " with me, we'll pick it up right in the middle in verse number 11 of Exodus 13. The Bible"
    },
    {
      "id": 40,
      "start": 2043.0399475097656,
      "end": 2046.8399505615234,
      "text": " says, and it shall be when the Lord shall bring thee into the land of the Canaanites"
    },
    {
      "id": 41,
      "start": 2046.8399505615234,
      "end": 2051.5599517822266,
      "text": " as he sware unto thee and to thy fathers and shall give it thee that thou shalt set"
    },
    {
      "id": 42,
      "start": 2051.5599517822266,
      "end": 2057.1199340820312,
      "text": " apart unto the Lord all that openeth the matrix and every firstling that cometh of a beast"
    },
    {
      "id": 43,
      "start": 2057.1199340820312,
      "end": 2062.679962158203,
      "text": " which thou hast and the males shall be the Lord's. Notice verse 13, and every firstling"
    },
    {
      "id": 44,
      "start": 2062.679962158203,
      "end": 2067.3199462890625,
      "text": " of an ass thou shalt redeem with a lamb that if thou wilt not redeem it then thou shalt"
    },
    {
      "id": 45,
      "start": 2067.3199462890625,
      "end": 2071.2799377441406,
      "text": " break his neck and all the firstborn of man among thy children shalt thou redeem. And"
    },
    {
      "id": 46,
      "start": 2071.2799377441406,
      "end": 2079.199951171875,
      "text": " it shall be when thy son asketh thee in time to come saying, what is this? What is this?"
    },
    {
      "id": 47,
      "start": 2079.199951171875,
      "end": 2086.3999633789062,
      "text": " That thou shalt say unto him, by strength of hand the Lord brought us out from Egypt"
    },
    {
      "id": 48,
      "start": 2086.3999633789062,
      "end": 2093.0399475097656,
      "text": " from the house of bondage. What a great opportunity that they would have. See, in just a little"
    },
    {
      "id": 49,
      "start": 2093.0399475097656,
      "end": 2097.479949951172,
      "text": " while we'll celebrate Memorial Day and we speak about the importance of memorials and"
    },
    {
      "id": 50,
      "start": 2097.479949951172,
      "end": 2102.8399353027344,
      "text": " we find that the Passover, such as other events in Israel's history, really had the"
    },
    {
      "id": 51,
      "start": 2102.8399353027344,
      "end": 2109.8399353027344,
      "text": " idea of setting up a memorial, a time to remember what God did. Of course, with the Passover"
    },
    {
      "id": 52,
      "start": 2109.8399353027344,
      "end": 2114.3199462890625,
      "text": " it was twofold, not only of remembering what God did but looking forward to what God would"
    },
    {
      "id": 53,
      "start": 2114.3199462890625,
      "end": 2120.43994140625,
      "text": " do in the Messiah coming and becoming our Passover. We find that as we look through"
    },
    {
      "id": 54,
      "start": 2120.43994140625,
      "end": 2125.5599365234375,
      "text": " these portions of Scripture and look at what God is saying as to how he is making himself"
    },
    {
      "id": 55,
      "start": 2125.5599365234375,
      "end": 2132.5599365234375,
      "text": " known and the reason that ye may know these truths, I would summarize it this way. We"
    },
    {
      "id": 56,
      "start": 2132.5599365234375,
      "end": 2137.8399353027344,
      "text": " think about God's purpose is that he would be glorified. In order for him to be glorified"
    },
    {
      "id": 57,
      "start": 2137.8399353027344,
      "end": 2144.3999633789062,
      "text": " I would say this, that he wants us to know his great power personally. He wants us to"
    },
    {
      "id": 58,
      "start": 2144.3999633789062,
      "end": 2148.9999389648438,
      "text": " know his great power personally. I believe this morning that he wants each and every"
    },
    {
      "id": 59,
      "start": 2148.9999389648438,
      "end": 2153.7999572753906,
      "text": " one of us of his children to know how powerful he is. So you're going to face things in your"
    },
    {
      "id": 60,
      "start": 2153.7999572753906,
      "end": 2158.239959716797,
      "text": " life. I'm going to face things in my life. We'll face things corporately and collectively"
    },
    {
      "id": 61,
      "start": 2158.239959716797,
      "end": 2165.679962158203,
      "text": " as a church. God wants us to know how powerful he is. He wants us to know that he has all"
    },
    {
      "id": 62,
      "start": 2165.679962158203,
      "end": 2173.159942626953,
      "text": " power. See, Jesus, before he would ascend and go to heaven after his resurrection, we"
    },
    {
      "id": 63,
      "start": 2173.159942626953,
      "end": 2178.1199340820312,
      "text": " find that he said this and it's recorded this way in Matthew's Gospel, all power is given"
    },
    {
      "id": 64,
      "start": 2178.1199340820312,
      "end": 2187.2599487304688,
      "text": " unto me in heaven and in earth. Go ye therefore and we see that the go ye therefore is preceded"
    },
    {
      "id": 65,
      "start": 2187.2599487304688,
      "end": 2193.3599548339844,
      "text": " by the all power is given unto me in heaven and in earth. He concludes that portion of"
    },
    {
      "id": 66,
      "start": 2193.3599548339844,
      "end": 2199.5999450683594,
      "text": " Scripture by saying and I will be with you. I will be with you. Isn't that precious truth?"
    },
    {
      "id": 67,
      "start": 2199.5999450683594,
      "end": 2206.1399536132812,
      "text": " See God wants us to know that he is the all powerful God. Power is an interesting thing."
    },
    {
      "id": 68,
      "start": 2206.1399536132812,
      "end": 2210.6199340820312,
      "text": " People in our society, people around the world, people for centuries, generations as"
    },
    {
      "id": 69,
      "start": 2210.6199340820312,
      "end": 2215.8199462890625,
      "text": " you study history, you will find that people are longing for more power and more power"
    },
    {
      "id": 70,
      "start": 2215.8199462890625,
      "end": 2221.0599365234375,
      "text": " and there are world powers that are set up and you look through the pages of history"
    },
    {
      "id": 71,
      "start": 2221.0599365234375,
      "end": 2227.8799438476562,
      "text": " and you begin to see all of those that were seeking power. There are some times that people"
    },
    {
      "id": 72,
      "start": 2227.8799438476562,
      "end": 2234.2599487304688,
      "text": " like Nebuchadnezzar, like Pharaoh, like others that you could read of in history that had"
    },
    {
      "id": 73,
      "start": 2234.2599487304688,
      "end": 2242.8999633789062,
      "text": " the perspective that they had great power. Think of Pilate. He said to Jesus, don't you"
    },
    {
      "id": 74,
      "start": 2242.8999633789062,
      "end": 2251.93994140625,
      "text": " know that I have power to release you or to go to the cross? What did Jesus say? He said,"
    },
    {
      "id": 75,
      "start": 2251.93994140625,
      "end": 2256.8199462890625,
      "text": " I want you to understand something Pilate. The only power you have, I'm paraphrasing,"
    },
    {
      "id": 76,
      "start": 2256.8199462890625,
      "end": 2266.3399353027344,
      "text": " the only power that you have is the power that I let you have. This morning we can look"
    },
    {
      "id": 77,
      "start": 2266.3399353027344,
      "end": 2272.6199340820312,
      "text": " at some people and some groups of people and some organizations. We could think about their"
    },
    {
      "id": 78,
      "start": 2272.6199340820312,
      "end": 2281.699951171875,
      "text": " power. But I want you to understand that it pales in comparison to the power of God Almighty."
    },
    {
      "id": 79,
      "start": 2281.699951171875,
      "end": 2288.3799438476562,
      "text": " Our God is the God of the impossible. Our God is the God who has all power. You begin"
    },
    {
      "id": 80,
      "start": 2288.3799438476562,
      "end": 2295.659942626953,
      "text": " to look at the Assyrians when they're attacking the children of Israel, Judah, Hezekiah is"
    },
    {
      "id": 81,
      "start": 2295.659942626953,
      "end": 2302.739959716797,
      "text": " trusting the Lord. Sennacherib and Rabshakeh. Don't you know all the other peoples that"
    },
    {
      "id": 82,
      "start": 2302.739959716797,
      "end": 2308.739959716797,
      "text": " we've conquered? Don't you know who we are? Honestly, accurately, the Assyrians were the"
    },
    {
      "id": 83,
      "start": 2308.739959716797,
      "end": 2316.9799194335938,
      "text": " world power at that time. But God sent one angel in one night and killed 185,000. We"
    },
    {
      "id": 84,
      "start": 2316.9799194335938,
      "end": 2324.699951171875,
      "text": " have the God of all power. And He wants us to know it personally. He wants us to know"
    },
    {
      "id": 85,
      "start": 2324.699951171875,
      "end": 2330.3399658203125,
      "text": " it personally. I would say this, that when we know His great power personally, then we"
    },
    {
      "id": 86,
      "start": 2330.3399658203125,
      "end": 2337.179931640625,
      "text": " would praise Him accordingly. See, He is worthy of our praise. This morning when we think"
    },
    {
      "id": 87,
      "start": 2337.179931640625,
      "end": 2341.3799438476562,
      "text": " about the greatness of God, when we think about and understand the great power that"
    },
    {
      "id": 88,
      "start": 2341.3799438476562,
      "end": 2351.179931640625,
      "text": " our God has, then we should praise Him accordingly. Stand in awe of who He is. He's a great God"
    },
    {
      "id": 89,
      "start": 2351.179931640625,
      "end": 2352.699951171875,
      "text": " with great power."
    },
    {
      "id": 90,
      "start": 2352.699951171875,
      "end": 2358.4599609375,
      "text": " Abram, is anything too hard for the Lord? Well God, you just told me that you are the"
    },
    {
      "id": 91,
      "start": 2358.4599609375,
      "end": 2366.8199462890625,
      "text": " Lord God Almighty. El Shaddai. Obviously there's nothing that's too hard for God. What was"
    },
    {
      "id": 92,
      "start": 2366.8599243164062,
      "end": 2371.5799560546875,
      "text": " it that Abraham thought? Well, he thought that he and Sarah could not have a child."
    },
    {
      "id": 93,
      "start": 2371.5799560546875,
      "end": 2379.0599365234375,
      "text": " But God promised. God promised, not that He'd give a child between Abraham and Hagar, but"
    },
    {
      "id": 94,
      "start": 2379.0599365234375,
      "end": 2385.5399780273438,
      "text": " that He would give a child between Abraham and Sarah. And what did God do? Exactly what"
    },
    {
      "id": 95,
      "start": 2385.5399780273438,
      "end": 2390.8999633789062,
      "text": " He promised to do. We find that Isaac was born. What a blessing. I mean we could look"
    },
    {
      "id": 96,
      "start": 2390.8999633789062,
      "end": 2395.699951171875,
      "text": " over and over and over through the pages of Scripture. You could look in your life and"
    },
    {
      "id": 97,
      "start": 2395.699951171875,
      "end": 2400.1399536132812,
      "text": " you can look at those that have gone before us and you can see God's power in their lives."
    },
    {
      "id": 0,
      "start": 2400.1399536132812,
      "end": 2403.6799535751343,
      "text": " and we ought to praise Him accordingly."
    },
    {
      "id": 1,
      "start": 2403.6799535751343,
      "end": 2406.099953651428,
      "text": " I would say this finally this morning,"
    },
    {
      "id": 2,
      "start": 2406.099953651428,
      "end": 2408.2599534988403,
      "text": " when God makes Himself known for the purpose"
    },
    {
      "id": 3,
      "start": 2408.2599534988403,
      "end": 2409.7199535369873,
      "text": " that He'd be glorified,"
    },
    {
      "id": 4,
      "start": 2410.7599534988403,
      "end": 2413.2999534606934,
      "text": " when we understand His great power personally,"
    },
    {
      "id": 5,
      "start": 2413.2999534606934,
      "end": 2415.3399534225464,
      "text": " we praise Him accordingly,"
    },
    {
      "id": 6,
      "start": 2415.3399534225464,
      "end": 2417.499954223633,
      "text": " He desires that we would trust Him fully."
    },
    {
      "id": 7,
      "start": 2418.579954147339,
      "end": 2420.599952697754,
      "text": " He desires that we trust Him fully."
    },
    {
      "id": 8,
      "start": 2420.599952697754,
      "end": 2425.599952697754,
      "text": " I mean just complete trust in God Almighty."
    },
    {
      "id": 9,
      "start": 2426.499954223633,
      "end": 2428.819953918457,
      "text": " I've referenced this morning already"
    },
    {
      "id": 10,
      "start": 2428.819953918457,
      "end": 2430.4199542999268,
      "text": " with the situation with Nebuchadnezzar"
    },
    {
      "id": 11,
      "start": 2430.4199542999268,
      "end": 2432.1399536132812,
      "text": " and the three Hebrew children,"
    },
    {
      "id": 12,
      "start": 2432.1399536132812,
      "end": 2434.2999534606934,
      "text": " Shadrach, Meshach, and Abednego."
    },
    {
      "id": 13,
      "start": 2434.2999534606934,
      "end": 2435.9599533081055,
      "text": " You think about those three Hebrew children,"
    },
    {
      "id": 14,
      "start": 2435.9599533081055,
      "end": 2437.3999519348145,
      "text": " they trusted God fully."
    },
    {
      "id": 15,
      "start": 2438.4599533081055,
      "end": 2440.3399543762207,
      "text": " I mean they were all in, man."
    },
    {
      "id": 16,
      "start": 2440.3399543762207,
      "end": 2442.939952850342,
      "text": " They just believed that God was able."
    },
    {
      "id": 17,
      "start": 2442.939952850342,
      "end": 2446.2799530029297,
      "text": " And they said, and if not, we're still not gonna bow."
    },
    {
      "id": 18,
      "start": 2448.4599533081055,
      "end": 2452.259952545166,
      "text": " But they had every belief that God was able."
    },
    {
      "id": 19,
      "start": 2453.259952545166,
      "end": 2458.259952545166,
      "text": " And because they understood God's great power personally,"
    },
    {
      "id": 20,
      "start": 2459.1399536132812,
      "end": 2461.2399520874023,
      "text": " they trusted Him fully."
    },
    {
      "id": 21,
      "start": 2462.099952697754,
      "end": 2463.8399543762207,
      "text": " See, in your life and in my life,"
    },
    {
      "id": 22,
      "start": 2463.8399543762207,
      "end": 2465.6399536132812,
      "text": " listen, we don't have to scheme."
    },
    {
      "id": 23,
      "start": 2466.499954223633,
      "end": 2468.939956665039,
      "text": " We don't have to devise."
    },
    {
      "id": 24,
      "start": 2468.939956665039,
      "end": 2473.1399536132812,
      "text": " We don't have to, you know, there's a world that schemes."
    },
    {
      "id": 25,
      "start": 2473.1399536132812,
      "end": 2475.419952392578,
      "text": " Try to bring to pass certain things"
    },
    {
      "id": 26,
      "start": 2475.419952392578,
      "end": 2476.4599533081055,
      "text": " that they wanna bring to pass."
    },
    {
      "id": 27,
      "start": 2476.4599533081055,
      "end": 2478.8599548339844,
      "text": " They scheme and manipulate and all those types."
    },
    {
      "id": 28,
      "start": 2478.8599548339844,
      "end": 2480.6599502563477,
      "text": " We don't have to do that."
    },
    {
      "id": 29,
      "start": 2480.6599502563477,
      "end": 2482.0599517822266,
      "text": " We just trust God fully."
    },
    {
      "id": 30,
      "start": 2482.7799530029297,
      "end": 2484.939956665039,
      "text": " God, you're God."
    },
    {
      "id": 31,
      "start": 2486.5799560546875,
      "end": 2489.819953918457,
      "text": " You've shown me all of these wonderful truths"
    },
    {
      "id": 32,
      "start": 2489.819953918457,
      "end": 2490.8399505615234,
      "text": " with regard to your power."
    },
    {
      "id": 33,
      "start": 2490.8399505615234,
      "end": 2494.999954223633,
      "text": " You have demonstrated it, and I'm gonna trust you fully."
    },
    {
      "id": 34,
      "start": 2494.999954223633,
      "end": 2496.3599548339844,
      "text": " I think about Moses."
    },
    {
      "id": 35,
      "start": 2497.6599502563477,
      "end": 2501.7399520874023,
      "text": " See, in Horeb, God made His greatness known"
    },
    {
      "id": 36,
      "start": 2501.7399520874023,
      "end": 2503.379951477051,
      "text": " to Moses personally."
    },
    {
      "id": 37,
      "start": 2504.3399505615234,
      "end": 2507.939956665039,
      "text": " We mentioned that in a previous message just a few weeks ago."
    },
    {
      "id": 38,
      "start": 2507.939956665039,
      "end": 2512.019950866699,
      "text": " We had two messages with regard to he took my place"
    },
    {
      "id": 39,
      "start": 2512.7799530029297,
      "end": 2515.53995513916,
      "text": " in the empty tomb between that message and this message."
    },
    {
      "id": 40,
      "start": 2516.4599533081055,
      "end": 2520.099952697754,
      "text": " We find here in Egypt that God made His greatness known."
    },
    {
      "id": 41,
      "start": 2522.219955444336,
      "end": 2524.0599517822266,
      "text": " Begin to think about Moses."
    },
    {
      "id": 42,
      "start": 2525.5799560546875,
      "end": 2528.659957885742,
      "text": " See, the whole congregation in the nation of Israel"
    },
    {
      "id": 43,
      "start": 2528.659957885742,
      "end": 2530.0799560546875,
      "text": " didn't get it."
    },
    {
      "id": 44,
      "start": 2530.0799560546875,
      "end": 2531.179946899414,
      "text": " They forgot his works, right?"
    },
    {
      "id": 45,
      "start": 2531.179946899414,
      "end": 2533.0199584960938,
      "text": " They didn't get it."
    },
    {
      "id": 46,
      "start": 2533.899948120117,
      "end": 2536.2999572753906,
      "text": " But Moses was a man that trusted God."
    },
    {
      "id": 47,
      "start": 2536.2999572753906,
      "end": 2537.2599487304688,
      "text": " He wasn't perfect."
    },
    {
      "id": 48,
      "start": 2537.2599487304688,
      "end": 2538.419952392578,
      "text": " There's some times in his life"
    },
    {
      "id": 49,
      "start": 2538.419952392578,
      "end": 2540.0999603271484,
      "text": " you can look at what's taking place,"
    },
    {
      "id": 50,
      "start": 2540.2999572753906,
      "end": 2543.239959716797,
      "text": " but you begin to think about the trust."
    },
    {
      "id": 51,
      "start": 2544.7799530029297,
      "end": 2547.179946899414,
      "text": " Moses says, I can't lead these people,"
    },
    {
      "id": 52,
      "start": 2548.0999603271484,
      "end": 2549.8599548339844,
      "text": " but you begin to trust God"
    },
    {
      "id": 53,
      "start": 2549.8599548339844,
      "end": 2554.0599517822266,
      "text": " because God had shown, had demonstrated His greatness."
    },
    {
      "id": 54,
      "start": 2554.0599517822266,
      "end": 2556.3399505615234,
      "text": " In your life and in my life,"
    },
    {
      "id": 55,
      "start": 2556.3399505615234,
      "end": 2558.1399536132812,
      "text": " I don't know what's gonna happen tomorrow"
    },
    {
      "id": 56,
      "start": 2558.1399536132812,
      "end": 2561.3399505615234,
      "text": " or next week or next month, but God does."
    },
    {
      "id": 57,
      "start": 2562.4599609375,
      "end": 2567.4599609375,
      "text": " And today, God is wanting us to understand His great power"
    },
    {
      "id": 58,
      "start": 2567.5799560546875,
      "end": 2570.179946899414,
      "text": " so that we would trust Him fully"
    },
    {
      "id": 59,
      "start": 2570.179946899414,
      "end": 2572.0799560546875,
      "text": " with whatever it is that might come."
    },
    {
      "id": 60,
      "start": 2573.899948120117,
      "end": 2578.6199493408203,
      "text": " How many people get devastating news with this or that?"
    },
    {
      "id": 61,
      "start": 2578.6199493408203,
      "end": 2580.899948120117,
      "text": " And it might be job-related."
    },
    {
      "id": 62,
      "start": 2580.899948120117,
      "end": 2582.3399505615234,
      "text": " It might be health-related."
    },
    {
      "id": 63,
      "start": 2582.3399505615234,
      "end": 2584.3799591064453,
      "text": " It could be a whole host of things,"
    },
    {
      "id": 64,
      "start": 2584.3799591064453,
      "end": 2586.7799530029297,
      "text": " but we find that God wants to prepare us."
    },
    {
      "id": 65,
      "start": 2586.7799530029297,
      "end": 2588.979949951172,
      "text": " Now, He wants you to know personally"
    },
    {
      "id": 66,
      "start": 2588.979949951172,
      "end": 2592.3399505615234,
      "text": " how great He is in His great power"
    },
    {
      "id": 67,
      "start": 2592.3399505615234,
      "end": 2593.5399475097656,
      "text": " so that you would praise Him"
    },
    {
      "id": 68,
      "start": 2593.5399475097656,
      "end": 2595.5399475097656,
      "text": " and so that you would trust Him."
    },
    {
      "id": 69,
      "start": 2595.5399475097656,
      "end": 2598.3399505615234,
      "text": " Oh, this morning, I hope that we would not be"
    },
    {
      "id": 70,
      "start": 2598.3399505615234,
      "end": 2600.739959716797,
      "text": " like the children of Israel that would forget."
    },
    {
      "id": 71,
      "start": 2602.3799591064453,
      "end": 2606.5199584960938,
      "text": " Many times, in the midst of a growth difficulty,"
    },
    {
      "id": 72,
      "start": 2606.5199584960938,
      "end": 2608.3799591064453,
      "text": " as the songwriter said, we're prone to wander."
    },
    {
      "id": 73,
      "start": 2608.3799591064453,
      "end": 2612.499954223633,
      "text": " I mean, we forget, but oh, that God would help us."
    },
    {
      "id": 74,
      "start": 2612.499954223633,
      "end": 2614.8599548339844,
      "text": " God, this is nothing for you."
    },
    {
      "id": 75,
      "start": 2614.8599548339844,
      "end": 2616.8199462890625,
      "text": " This is nothing for you, God."
    },
    {
      "id": 76,
      "start": 2616.8199462890625,
      "end": 2619.219955444336,
      "text": " You've demonstrated all of these things"
    },
    {
      "id": 77,
      "start": 2619.219955444336,
      "end": 2623.219955444336,
      "text": " in your precious book, and you've done it in my life before."
    },
    {
      "id": 78,
      "start": 2623.219955444336,
      "end": 2627.219955444336,
      "text": " God, I am trusting you alone,"
    },
    {
      "id": 79,
      "start": 2627.219955444336,
      "end": 2629.2999572753906,
      "text": " and let's see what God will do,"
    },
    {
      "id": 80,
      "start": 2629.2999572753906,
      "end": 2632.8599548339844,
      "text": " because God is making Himself known"
    },
    {
      "id": 81,
      "start": 2632.8599548339844,
      "end": 2636.659957885742,
      "text": " for the single purpose that He would be glorified."
    },
    {
      "id": 82,
      "start": 2636.659957885742,
      "end": 2639.0599517822266,
      "text": " And you know, when we trust Him"
    },
    {
      "id": 83,
      "start": 2639.0599517822266,
      "end": 2643.3799591064453,
      "text": " and when we see Him do great things, He's glorified."
    },
    {
      "id": 84,
      "start": 2644.419952392578,
      "end": 2649.0999603271484,
      "text": " When they sing in Exodus 15 the song of Moses,"
    },
    {
      "id": 85,
      "start": 2649.0999603271484,
      "end": 2651.2599487304688,
      "text": " it wasn't Moses that was getting the glory"
    },
    {
      "id": 86,
      "start": 2651.2599487304688,
      "end": 2652.2599487304688,
      "text": " for parting the Red Sea."
    },
    {
      "id": 87,
      "start": 2652.2599487304688,
      "end": 2654.719955444336,
      "text": " It was God that was getting the glory."
    },
    {
      "id": 88,
      "start": 2656.8199462890625,
      "end": 2658.6199645996094,
      "text": " And that's what it would be in our lives"
    },
    {
      "id": 89,
      "start": 2658.6199645996094,
      "end": 2661.719940185547,
      "text": " as we just trust Him that He would be glorified."
    },
    {
      "id": 90,
      "start": 2661.719940185547,
      "end": 2662.5599670410156,
      "text": " Let's pray together."
    },
    {
      "id": 91,
      "start": 2662.5599670410156,
      "end": 2663.6199645996094,
      "text": " Father, we love you."
    },
    {
      "id": 92,
      "start": 2663.6199645996094,
      "end": 2664.7799682617188,
      "text": " We thank you for loving us."
    },
    {
      "id": 93,
      "start": 2664.7799682617188,
      "end": 2666.7999572753906,
      "text": " We thank you for your precious word."
    },
    {
      "id": 94,
      "start": 2666.7999572753906,
      "end": 2668.739959716797,
      "text": " We thank you for the privilege of being able"
    },
    {
      "id": 95,
      "start": 2668.739959716797,
      "end": 2671.5799560546875,
      "text": " to know just how great you are."
    },
    {
      "id": 96,
      "start": 2673.0999450683594,
      "end": 2675.8199462890625,
      "text": " Thank you for in the life of Moses,"
    },
    {
      "id": 97,
      "start": 2675.8199462890625,
      "end": 2678.5799560546875,
      "text": " there in Horeb, you made your greatness known."
    },
    {
      "id": 98,
      "start": 2678.6199645996094,
      "end": 2679.93994140625,
      "text": " I think about here in Egypt,"
    },
    {
      "id": 99,
      "start": 2679.93994140625,
      "end": 2681.419952392578,
      "text": " as we think about these plagues,"
    },
    {
      "id": 100,
      "start": 2681.419952392578,
      "end": 2683.8599548339844,
      "text": " how you made your greatness known."
    },
    {
      "id": 101,
      "start": 2683.8599548339844,
      "end": 2686.739959716797,
      "text": " God, I pray that as we have had the opportunity"
    },
    {
      "id": 102,
      "start": 2686.739959716797,
      "end": 2689.739959716797,
      "text": " to study these portions of Scripture this morning,"
    },
    {
      "id": 103,
      "start": 2689.739959716797,
      "end": 2691.93994140625,
      "text": " God, I pray that you would help us"
    },
    {
      "id": 104,
      "start": 2692.7799682617188,
      "end": 2694.4599609375,
      "text": " to glorify you in our lives,"
    },
    {
      "id": 105,
      "start": 2694.4599609375,
      "end": 2698.4599609375,
      "text": " that we'd glorify you by trusting you."
    },
    {
      "id": 106,
      "start": 2698.4599609375,
      "end": 2701.6199645996094,
      "text": " And I know, God, that we'll only trust you like we should"
    },
    {
      "id": 107,
      "start": 2702.979949951172,
      "end": 2706.8599548339844,
      "text": " when we fully understand personally"
    },
    {
      "id": 108,
      "start": 2707.699951171875,
      "end": 2709.2599487304688,
      "text": " how great you really are."
    },
    {
      "id": 109,
      "start": 2710.1399536132812,
      "end": 2712.0999450683594,
      "text": " And I pray, God, this morning that you'd help us"
    },
    {
      "id": 110,
      "start": 2712.0999450683594,
      "end": 2715.0999450683594,
      "text": " to submit and surrender our lives to you,"
    },
    {
      "id": 111,
      "start": 2715.0999450683594,
      "end": 2718.0599670410156,
      "text": " that we'd see you do great and mighty things."
    },
    {
      "id": 112,
      "start": 2718.0599670410156,
      "end": 2720.4599609375,
      "text": " We thank you for the privilege"
    },
    {
      "id": 113,
      "start": 2720.4599609375,
      "end": 2723.6199645996094,
      "text": " of knowing you and of serving you."
    },
    {
      "id": 114,
      "start": 2723.6199645996094,
      "end": 2726.659942626953,
      "text": " God, if there's one here that's not sure of heaven,"
    },
    {
      "id": 115,
      "start": 2726.659942626953,
      "end": 2728.699951171875,
      "text": " they've never trusted the Lord Jesus Christ"
    },
    {
      "id": 116,
      "start": 2728.699951171875,
      "end": 2730.6199645996094,
      "text": " as their personal Savior,"
    },
    {
      "id": 117,
      "start": 2730.6199645996094,
      "end": 2733.0999450683594,
      "text": " I pray that today they would understand"
    },
    {
      "id": 118,
      "start": 2733.0999450683594,
      "end": 2735.2599487304688,
      "text": " their need for Christ."
    },
    {
      "id": 119,
      "start": 2735.2599487304688,
      "end": 2737.2999572753906,
      "text": " Just as we mentioned of that 10th plague,"
    },
    {
      "id": 120,
      "start": 2737.2999572753906,
      "end": 2738.2999572753906,
      "text": " the death of the firstborn,"
    },
    {
      "id": 121,
      "start": 2738.2999572753906,
      "end": 2741.179962158203,
      "text": " there was only one way to spare death,"
    },
    {
      "id": 122,
      "start": 2741.179962158203,
      "end": 2742.979949951172,
      "text": " and that was by applying that blood."
    },
    {
      "id": 123,
      "start": 2744.2999572753906,
      "end": 2746.4599609375,
      "text": " We find that Christ is our Passover,"
    },
    {
      "id": 124,
      "start": 2746.4599609375,
      "end": 2748.219940185547,
      "text": " the Lamb of God,"
    },
    {
      "id": 125,
      "start": 2748.219940185547,
      "end": 2749.8999633789062,
      "text": " was slain before the foundation of the world,"
    },
    {
      "id": 126,
      "start": 2749.8999633789062,
      "end": 2750.739959716797,
      "text": " the Lamb of God,"
    },
    {
      "id": 127,
      "start": 2750.739959716797,
      "end": 2752.699951171875,
      "text": " which taketh away the sins of the world."
    },
    {
      "id": 128,
      "start": 2754.419952392578,
      "end": 2756.419952392578,
      "text": " He came and he lived a perfect, sinless life."
    },
    {
      "id": 129,
      "start": 2756.419952392578,
      "end": 2757.659942626953,
      "text": " He was buried in a borrowed tomb."
    },
    {
      "id": 130,
      "start": 2757.659942626953,
      "end": 2760.0999450683594,
      "text": " He rose conquering sin, death, and the grave."
    },
    {
      "id": 131,
      "start": 2760.0999450683594,
      "end": 2761.659942626953,
      "text": " He lives forevermore."
    },
    {
      "id": 132,
      "start": 2762.7799682617188,
      "end": 2764.1399536132812,
      "text": " Oh, God, I pray that today,"
    },
    {
      "id": 133,
      "start": 2764.1399536132812,
      "end": 2765.179962158203,
      "text": " if there's one not saved,"
    },
    {
      "id": 134,
      "start": 2765.179962158203,
      "end": 2766.739959716797,
      "text": " they'd be saved today,"
    },
    {
      "id": 135,
      "start": 2766.739959716797,
      "end": 2767.7799682617188,
      "text": " be born again."
    },
    {
      "id": 136,
      "start": 2768.8999633789062,
      "end": 2771.93994140625,
      "text": " I pray that you'd help every child of God that's here."
    },
    {
      "id": 137,
      "start": 2771.93994140625,
      "end": 2774.0999450683594,
      "text": " God, would you help us to trust you?"
    },
    {
      "id": 138,
      "start": 2774.0999450683594,
      "end": 2777.3399658203125,
      "text": " I don't know the specific circumstances"
    },
    {
      "id": 139,
      "start": 2777.3399658203125,
      "end": 2779.8199462890625,
      "text": " that are being dealt with by every individual"
    },
    {
      "id": 140,
      "start": 2779.8199462890625,
      "end": 2780.8999633789062,
      "text": " that's present this morning,"
    },
    {
      "id": 141,
      "start": 2780.8999633789062,
      "end": 2781.93994140625,
      "text": " but God, you do."
    },
    {
      "id": 142,
      "start": 2782.979949951172,
      "end": 2784.739959716797,
      "text": " God, I believe that you want them to know"
    },
    {
      "id": 143,
      "start": 2784.739959716797,
      "end": 2786.93994140625,
      "text": " how powerful and how great you are,"
    },
    {
      "id": 144,
      "start": 2787.93994140625,
      "end": 2791.659942626953,
      "text": " and that we'd trust you through every circumstance,"
    },
    {
      "id": 145,
      "start": 2791.659942626953,
      "end": 2793.93994140625,
      "text": " that you alone would be glorified."
    },
    {
      "id": 146,
      "start": 2794.739959716797,
      "end": 2795.979949951172,
      "text": " I pray that you'd move and work"
    },
    {
      "id": 147,
      "start": 2795.979949951172,
      "end": 2798.0999450683594,
      "text": " in this time of invitation,"
    },
    {
      "id": 148,
      "start": 2798.0999450683594,
      "end": 2799.219940185547,
      "text": " that decisions would be made"
    },
    {
      "id": 149,
      "start": 2799.219940185547,
      "end": 2801.2599487304688,
      "text": " that would be pleasing to thee, Lord,"
    },
    {
      "id": 150,
      "start": 2801.2599487304688,
      "end": 2802.4999389648438,
      "text": " that would cause us to be conformed"
    },
    {
      "id": 151,
      "start": 2802.4999389648438,
      "end": 2804.179962158203,
      "text": " to the image of your Son."
    },
    {
      "id": 152,
      "start": 2804.179962158203,
      "end": 2805.4599609375,
      "text": " Well, thank you for all that you'll do,"
    },
    {
      "id": 153,
      "start": 2805.4599609375,
      "end": 2806.8199462890625,
      "text": " for it's in Christ's name we pray."
    },
    {
      "id": 154,
      "start": 2806.8199462890625,
      "end": 2808.179962158203,
      "text": " Would you stand with me?"
    },
    {
      "id": 155,
      "start": 2808.179962158203,
      "end": 2810.3399658203125,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 156,
      "start": 2810.3399658203125,
      "end": 2812.219940185547,
      "text": " Kimberly's gonna play quietly on the piano,"
    },
    {
      "id": 157,
      "start": 2812.219940185547,
      "end": 2814.2999572753906,
      "text": " and as we have at the end of our service,"
    },
    {
      "id": 158,
      "start": 2814.2999572753906,
      "end": 2816.4599609375,
      "text": " there's an opportunity for a time of invitation,"
    },
    {
      "id": 159,
      "start": 2816.4599609375,
      "end": 2819.0999450683594,
      "text": " give you an opportunity to respond."
    },
    {
      "id": 160,
      "start": 2819.0999450683594,
      "end": 2820.179962158203,
      "text": " We're ready to listen,"
    },
    {
      "id": 161,
      "start": 2820.179962158203,
      "end": 2821.4999389648438,
      "text": " ready to hear the word of God,"
    },
    {
      "id": 162,
      "start": 2821.4999389648438,
      "end": 2823.419952392578,
      "text": " but we must be ready to respond."
    },
    {
      "id": 163,
      "start": 2823.4599609375,
      "end": 2824.8199462890625,
      "text": " You've got someone in your life,"
    },
    {
      "id": 164,
      "start": 2824.8199462890625,
      "end": 2826.5799560546875,
      "text": " there's some trial you're going through,"
    },
    {
      "id": 165,
      "start": 2826.5799560546875,
      "end": 2828.93994140625,
      "text": " and you need to make that determination,"
    },
    {
      "id": 166,
      "start": 2828.93994140625,
      "end": 2831.4999389648438,
      "text": " that you're gonna trust him fully."
    },
    {
      "id": 167,
      "start": 2831.4999389648438,
      "end": 2832.699951171875,
      "text": " Maybe you're not sure of heaven,"
    },
    {
      "id": 168,
      "start": 2832.699951171875,
      "end": 2833.7799682617188,
      "text": " let me take a Bible and show you"
    },
    {
      "id": 169,
      "start": 2833.7799682617188,
      "end": 2836.0999450683594,
      "text": " how you can know for sure that heaven's your home."
    },
    {
      "id": 170,
      "start": 2836.0999450683594,
      "end": 2838.3799438476562,
      "text": " As Kimberly plays, this altar is open."
    }
  ],
  "processed_at": "2025-04-16T09:40:37.571085"
}