{
  "video_id": "Qr15eY1HTgY",
  "text": "I'm thankful for the Word of God. The last couple of weeks, we've had the opportunity to study, we've noted the greatness of God, and we've said that God's greatness is revealed first through inspiration. I'm thankful that the Bible tells us that all scripture is given by inspiration of God and is profitable. I'm so thankful that God has given us His Word and not only the truth of inspiration, but then we dealt with the truth of preservation, and preservation reveals the greatness of God. I'm thankful this morning that God has preserved His Word. I said this last week, that inspiration is a precious Bible truth, but without preservation, inspiration really only affects the initial immediate recipients. And I'm thankful that this morning, when we have the truth of the preserved Word of God, that we can rejoice in how great our God is. He is eternal. I think about what the psalmist said. We're here in 2 Peter. We're gonna stay here, but I want you to hear these words from the psalmist in Psalm 111, in verse number four. The Bible says this, He, speaking of the Lord, hath made His wonderful works, notice these words, to be remembered. He, the Lord, hath made His wonderful works to be remembered. How did He make them to be remembered? Right here. Right here. This morning, we can read of things that have taken place thousands of years ago. We can read of those biblical accounts. We can read of God's work and all that God has done, and we say we rejoice greatly. Why? Because God has made His works to be remembered. And this morning, we can rejoice in understanding that truth. We understand this morning as well that God's word continues to be under attack. It's always been under attack. We find that back in the garden, Satan said, yea, hath God said, and then he says, ye shall not surely die. And we know that the Bible continues to be under attack still to this very day. In fact, this morning, as we think about the Bible being attacked, we would say that liberalism would say that a Bible is just a book of suggestions. Sometimes good suggestions, but suggestions nonetheless. And this book is not a book of suggestions. This is a book of God's word. This is profitable for us as the people of God. We could speak of those which have the approach and the idea that God's word could have errors. It could be wrong. And, but every word of God is pure because it's been given by inspiration. And it's God's word. It's been preserved for us. So we believe that the Bible is inerrant. It is incapable of having error. And I'm thankful for that truth. In fact, this morning, there are some that would say that the Bible is just no longer relevant. You say, do they really say that? Well, sometimes they don't say it with their words, but they say it with their actions. They make decisions, they make choices. They do things that reveal to us what they really believe. Because the fact of the matter, I've said this often over the years, is that our belief impacts our behavior, but our behavior reveals what we believe. And so when you find individuals, organizations, groups of people within the broad term of Christendom that are behaving in a certain way that is contrary to what God's word says, then really what they're telling us through their behavior is that God's word really is no longer relevant. Well, I beg to differ. God's word is absolutely relevant. God who is eternal has given us an eternal book and it is relevant. It is for us today. There are some that have the idea that the Bible must be updated. There are some that have the idea that experience supersedes biblical truth. No, the Bible stands. And as we look at the passage of Scripture before us this morning, I find that Peter, as he's writing to these believers, he uses this term, speaking of God's word, he says it's a more sure word. We're gonna use that as our title this morning. And you can see that in verse number 19, but pick it up with me in verse number 12. And notice what Peter, under the inspiration of the Holy Spirit of God, is writing to these believers. The Bible says in verse number 12, wherefore, I will not be negligent to put you always in remembrance of these things, though you know them, and be established in the present truth. Yea, I think it meet as long as I am in this tabernacle to stir you up by putting you in remembrance, knowing that shortly I must put off this my tabernacle, even as our Lord Jesus Christ hath showed me. What is Peter talking about? He said, I'm gonna die. The reality is that each and every one of us are gonna die one day. And Peter understood that he was coming near the end of his life, as the Lord had revealed to him. And now, of course, speaking under the inspiration of the Holy Spirit of God, we find that he's writing these words. And he says, listen, as long as I'm in this tabernacle, as long as I'm in this body, I understand that I must soon put off this my tabernacle, but as long as I'm here, I'm seeking to influence you, and I'm seeking to instruct you, and I'm seeking to give you truth. And notice what he says in verse number 15. Why is he doing this? Moreover, I will endeavor that ye may be able, after my decease, to have these things always in remembrance. Peter says, I'm not gonna be here forever. And we're passing the baton to a next generation, to a future generation. And Peter says, I wanna influence, and instruct, and impact you. I wanna give you the truth of God's word, so that after I'm gone, after my decease, that you'll have these things always in remembrance, and that the work of God would continue to move forward. In verse 16, he says, for we have not followed cunningly devised fables, when we made known unto you the power and coming of our Lord Jesus Christ, but were eyewitnesses of his majesty. For he received from God the Father honor and glory, when there came such a voice to him from the excellent glory this is my beloved son in whom I am well pleased. In this voice which came from heaven, we heard when we were with him in the holy mount. We have also a more sure word of prophecy. Where unto? Ye do well that ye take heed, as unto a light that shineth in a dark place unto the day dawn, and the day star arise in your hearts. Knowing this first, that no prophecy of the scriptures of any private interpretation, for the prophecy came not in old time by the will of man, but a holy man of God spake, as they were moved by the Holy Ghost. In verses 20 and 21, we referenced those verses of scripture in our first message, that inspiration reveals the greatness of God. And in that message, we discuss the process of inspiration. How did God give us his word? We understand that he promised, he said that all scripture is given by inspiration of God. And then in verses 20 and 21 of the book of 2 Peter, he helps us understand the process in which he gave us his word. Now I want you to think about Peter. And many of us, we can relate to Peter, and we can think of Peter, and we read of Peter's life, and we say, man, that's someone that I can relate to. That's one of the disciples that I learned from his life, and I see some things in Peter's life that are very relatable to me in my life. But Peter, as he's writing here, of course, he's an apostle, he walked with the Lord Jesus Christ. And you think about the ministry that God gave him, and here at this particular time, as he's ready to depart from this earth and enter into glory, we find that he's endeavoring to instruct. And he says, you have a more sure word. As I think about that truth that he shares with us here in verse number 19, and he shares with the recipients, the original recipients, these believers, by the way, they were in need of encouragement. We find that they were in need of instruction. If you look at the book of 1 Peter, and you find the timing of 1 and 2 Peter, there was great persecution, there was false teaching, there was all sorts of things that were taking place, and these believers were in need of both encouragement and instruction. And Peter clearly says in verse number 16, we've not followed cunningly devised fables. These are not just stories. These are, no, no, we're eyewitnesses of his majesty. And we find that he's writing, again, under the inspiration of the Holy Spirit of God. And so as we look at this passage of Scripture, I want you to consider two things with me this morning. Number one, I want you to consider the sufficiency of God's word, the sufficiency of God's word. I'm thankful this morning that God has given us exactly what we need. I'm thankful that as we open this book this morning, that we can find the answers to life's questions. I've mentioned in previous messages with regard to studying and teaching and preaching about the word of God, that this morning, God's word has the answer, that there are many books that can inform, but only this book will transform. And as we desire to maybe help ourselves in some way, I wanna be a better husband, I wanna be a better father, I wanna be a better wife or mother, or whatever it might be, that the reality is that God's word provides us with instruction with every role that we'll have in life. As we think about those roles and we find those principles that God has given us and we incorporate those principles in our lives and we're doers of the Word and not hearers only, we find that God's Word is sufficient. That's why we're not looking for any new revelation. God's given us exactly what we need and we hold it in our hands this morning. And I want you to think about the sufficiency of God's Word, and I want you to think about Peter writing this particular letter to these believers, and I want you to think about the mindset sometimes that we can have. Peter, again I mentioned a moment ago, he was an apostle. Peter, he was at the Mount of Transfiguration. As you read verse 17 and 18 and the end of 16 with it, and you read that he's speaking specifically about the time at the Mount of Transfiguration. See Peter was an apostle, but Peter was in that inner circle. We find that often as you think about that inner circle, it would be three individuals. It would be Peter, James, and John, and you would find how God would allow them as they walked with the Lord Jesus Christ to experience certain things that even the others didn't experience. And Peter was one with James and John that were on the Mount of Transfiguration. What a blessed truth. What a great experience that Peter had there on the Mount of Transfiguration. He walked with the Lord Jesus Christ. The Bible tells us that he heard the voice of the Father there at the Mount of Transfiguration. What we find in verse number 17 at the end of the verse, the Bible says, this is my beloved Son in whom I am well pleased. And we can read that in the Gospel account and we can see that, but notice what the Bible says in verse number 18, and this voice which came from heaven, notice what it says, we heard. We heard when we were with Him in the Holy Mount. See Peter, he was a leader. God used him. In fact, the Lord Jesus Christ said to Peter after he told him that Satan hath desired to have him, that he had sifted his wheat, he said, I have prayed for thee. When thou art converted, strengthen thy brethren. We find that God is using Peter in a great way. You can read of his life and ministry in the book of Acts, and you can see here in 1 and 2 Peter how God was using Peter. But the reality is that Peter would soon die. Peter was not going to last forever on this earth, and none of us will either. And so what is Peter doing? Well, Peter is pointing them to the Word of God. He's helping them to understand the sufficiency of God's Word. He's helping them to understand here in this passage of Scripture, listen, you're not just following me as an individual that was an apostle, you're not just following me as an individual that walked with the Lord Jesus Christ, that even had the opportunity to go to the Mount of Transfiguration and to hear the voice of the Father. No, I want to point you to the sufficiency of Scripture, because he says we have also a more sure word of prophecy. That's a blessed truth and a blessed thought this morning, because people tend to gravitate towards individuals that have experiences. They begin to put a certain amount of trust and confidence in an individual, and we could think about these that are being ministered here in 2 Peter, these believers that are being ministered to, and how they would possibly gravitate to Peter and want to hear what Peter says. But Peter says, no, no, God's Word is sufficient, and I want to point you to God's Word. Notice back just earlier in chapter number 1, go back to verse number 3, if you will, and notice what Peter says at the beginning of this book, again, under the inspiration of the Holy Spirit of God, notice what the Bible says in verse number 3, according as His divine power, notice what it says, hath given unto us all things that pertain unto life and godliness, through the knowledge of Him that hath called us to glory and virtue. I'm thankful that God's given us all things that pertain unto life and godliness. I'm thankful the Bible says, according as His divine power hath given unto us all things that pertain unto life and godliness, and we find that in verse number 4, He says, whereby are given unto us exceeding great and precious promises, that by these ye might be partakers of the divine nature, having escaped the corruption that is in the world through lust. Now let me ask you, in verse number 4, as we look at this, how is it this morning that we know about these exceeding great and precious promises that God has given? He's recorded them for us in the Word of God. Oftentimes we'll sing the song, Standing on the Promises, and what a great song it is, and as we sing that song, we're reminded, perhaps, our minds as we're singing and meditating upon the words of that song, our minds are filled with promises from God's Word. In fact, there are times that in our service, when we sing that song, that I'll come to the pulpit and I'll say, who's got a promise that they're thankful for? And someone will share a promise, and another promise, and another promise. Listen, I'm thankful that God said, for whosoever shall call upon the name of the Lord shall be saved. That's a wonderful promise in Romans chapter 10 and verse number 13, and we ought to be grateful for that, but the reality is that God has given us so many promises, and as we look into God's precious Word, we read of those promises and we can say, yes, they're exceeding great and precious. This morning, in Sunday school, someone said, I'm thankful that God's always with us. He said, I will never leave thee nor forsake thee. It's a precious promise. What about this promise in John 14 when he says, I will come again? Aren't you thankful that Jesus is coming again? I mean, we could spend the remainder of our time this morning speaking about the promises that God has given, but as we're looking at this passage of Scripture and considering this more sure Word and the sufficiency of God's Word that Peter says to these believers in the beginning of this passage of Scripture, he says, listen, God's given us all things that pertain unto life and godliness. He's given us exceeding great and precious promises, and how thankful we ought to be. But notice he says this also at the end of verse number four, having escaped the corruption that is in the world through lust. How do we escape that corruption? Again, through the cleansing of God's Word. You read the book of Ephesians, and you read about the cleansing of the Word in the fifth chapter, and what a blessing to think about the fact that we can escape that corruption that is in the world. Listen, we acknowledge this morning that there's corruption in the world. We can escape that corruption that is in the world. Why? Because God's given us a book, the Bible. The Bible is sufficient. Turn over to the book of Luke, if you will. No doubt as you're turning to the book of Luke, Peter knew, and those that he's writing to in 2 Peter were familiar with the first epistle that he wrote to them. And of course, in that particular epistle, as we studied last week in chapter one in verse 23 and 25, he spoke about the Word of God, which liveth and abideth forever. And as he spoke of that in the first epistle, then in the second epistle he's saying we have a more sure Word. He's helping these believers to understand the sufficiency of God's Word. Look in the book of Luke, if you will, in the 16th chapter, beginning in verse number 19. In Luke 16, in verse number 19, this is what the Bible says, and there was a certain rich man which was clothed in purple and fine linen and fared sumptuously every day. There was a certain beggar named Lazarus which was laid at his gate full of sores. Desiring to be fed with the crumbs which fell from the rich man's table, moreover, the dogs came and licked his sores. And it came to pass, in verse 22, the Bible says, the beggar died and was carried by the angels in Abraham's bosom. The rich man also died and was buried. Now, let me say this, and I'm not preaching from this entire passage this morning, I'm using it as a reference point, but understand this morning that as of the point of demand wants to die. And after this, the judgment. The beggar died and the rich man died. The Bible tells us that. Listen, every person is going to die. As we look here and we notice the Bible says that, speaking of the beggar that he was carried by the angels in Abraham's bosom, and then it says that the rich man also died and was buried and in hell he lifted up his eyes. I want you to understand this, that the poor man, the beggar, he didn't go to Abraham's bosom because he was poor. Nor did the rich man go to hell because he was rich. We find that what determines our eternal destination is what we do with Christ. And whether we accept the Lord Jesus Christ as our personal Savior. Understanding that I'm a sinner in need of the Savior, and He is the only Savior, and we understand that. Listen, the law in life for these individuals, the one being a beggar and the one being rich, has zero to do with where they end up in eternity. God's providing with us the backdrop and helping us understand this, and it's important for us to recognize that truth. It tells us that in hell he lift up his eyes, in verse 23, being in torments, and seeth Abraham afar off, and Lazarus in his bosom, and he cried and said, Father Abraham, have mercy on me. on me, and send Lazarus, that he may dip the tip of his finger in water, and cool my tongue. Notice what he says, for I am tormented in this flame. Next time somebody tells you that they're going to go to hell and they're going to enjoy it and have a party, you just remind them of Luke 16. I've had many people tell me that over the years. It's a lie of the devil. Hell is a terrible place. The Bible tells us in verse 25, but Abraham said, Son, remember that thou in thy lifetime receivest thy good things, and likewise Lazarus evil things. But now he is comforted, and thou art tormented. And beside all this, between us and you, there's a great gulf thick, so that they which would pass from hence to you cannot, neither can they pass to us that would come from thence. Verse 26 helps us to understand the fact that what you do with Christ in this life, once you die, it's too late. I've often said from the book of Philippians, the Bible says that every knee should bow and every tongue should confess. And I've said this often as I've looked at that passage of Scripture, it's not a matter of if, it's a matter of when. And when makes all the difference. It says in verse number 27, then he said, I pray thee, therefore, Father, that thou wouldest send him to my father's house. Now it's very interesting as we look at the end of chapter 16, the concern of this rich man. Initially, the concern of the rich man is his own comfort. He's tormented in this flame and he's desiring that there'd be opportunity for the tip of the finger of this beggar to be in water and to cool his tongue. But we find that after he finds out that it's just not possible, that he says, listen, I pray thee, therefore, Father, that thou wouldest send him to my father's house. Why? For I have five brethren that he may testify unto them, lest they also come into this place of torment. The truth of verse number 28 should be impactful in our lives. This rich man died. Because he had not trusted the Lord Jesus Christ as his personal Savior, he's in hell. The Bible tells us that he's got great concern for his brethren, lest they come into this place of torment. He knew his brothers. Seems quite obvious to me that he knew that they were headed to the same destination and had a great concern for them. Verse 29, notice what the Bible says, Abraham saith unto him, they, the five brothers from verse 28, they have Moses and the prophets. Let them hear them. What is he saying in verse 29? They have the Scriptures. They have the Word of God. Remember in the book of 2 Timothy, we looked at it two weeks ago that all Scripture is given by inspiration of God. But before that, we find that Paul says to Timothy that from a child thou hast known the Holy Scriptures, which are able to make thee wise unto salvation. And then he says all Scripture is given by inspiration of God, is profitable for doctrine, for reproof, for correction, for instruction in righteousness, that the man of God might be perfect, truly furnished unto all good works. And so we find that here, that Abraham's response to this man, he wants this beggar that's died, he wants him to go back to his brother's house, and Abraham says, no, they have the Scriptures. They have Moses and the prophets. Let them hear them. Notice the response in verse 30, and he said, nay, father Abraham, but if one went unto them from the dead, they will repent. Now I think he believed that. I want you to notice how the text ends. And he said unto him, if they hear not Moses and the prophets, neither will they be persuaded the one rose from the dead. A lot of people today looking for some great miracle, kind of like Naaman. But God said, my word is sufficient, and I've given my word. And Peter, though he had walked with the Lord Jesus Christ, though he had been at the Mount of Transfiguration, though he had heard the voice of God, he understood that his time on earth was coming to an end. And he says to these believers that I want to remind you of some things, I want to teach you some things, I want to give you the truth. Why? Because after I'm departed, after my decease, I want you to be able to remember and to continue. And we find that, he says, we have also a more sure word of prophecy. I can imagine, I've alluded to this already this morning, but I can imagine how there were some that would like to just hear Peter because of what he had experienced, because of what his life experience had been. But we find that Peter says we have also a more sure word of prophecy. We note this morning the sufficiency of God's word. Number two, I want you to consider with me the superiority of God's word. God's word is superior. Of course, we find the Bible says we have also, picking up in verse 19, back in 2 Peter chapter number 1, we have also a more sure word of prophecy, whereunto you do well that you take heed, as unto a light that shineth in a dark place unto the day dawn and the day star arise in your hearts. By the way, the end of verse number 19 is going to be the subject matter that we'll deal with next week. Now that we understand that God's given his word by inspiration, he's promised to preserve his word, we have a more sure word, what's my approach to this book? How do those truths that we've just established over these last few weeks, how do those truths impact my approach to the word of God? And we find that verse 20, he says, knowing this first, that no prophecy of the scripture is of any private interpretation, for the prophecy came not in old time by the will of man, but holy men of God spake as they were moved by the Holy Ghost. The word of God is superior because it is given by inspiration and is providentially preserved. We see that in verse 20 and 21. The reality this morning is that when we think about this truth that says that no prophecy of scripture is of any private interpretation, the prophecy came not in old time by the will of man. I've said this before, Isaiah didn't just decide he was going to sit down and write scripture. Ezekiel didn't just decide he was going to sit down and write scripture. No, the Holy Spirit, the Holy Ghost moved these men and they spake as they were moved by the Holy Ghost. And it's all scripture is given by inspiration of God. And that in itself is what sets the Bible apart from any other book. That's why we find that Peter is saying we have also a more sure word. Not only is the Bible sufficient, but the Bible is superior. When we look to the truth that's contained within this book and we rest in the truth that's contained within this book, why? Because it's God's word. And it's superior. Listen, when you have thoughts in your mind, when you have ideas, when you have philosophies, you better bring those things into agreement with God's word because God's word is superior. See when my philosophy, when my worldview is wrong, when I'm in error, I must get into the Bible to have that corrected so that I have a biblical perspective, so that I have a biblical foundation. As we look at this passage of scripture and we think about the word of God being superior, we understand that it's superior because of what it is, because of it being God's word. But I want you to notice from the text of scripture two thoughts with regard to God's word being superior. I would say this, God's word is superior to leadership. The word of God is superior to leadership. What do I mean by that? Well sometimes people look at a leader kind of like they would look at Peter. And all of a sudden what that leader says begins to carry great weight, begins to have some level of influence in the lives of individuals. But God's word is superior to leadership. God's word is superior to leadership. Listen, today we have people that would talk about the church fathers. What would they mean by that? Well they're meaning by individuals that have gone on before us and they reference some of the writings of the church fathers and they'll say, well we'll reference those writings of the church fathers and those writings have some level of credibility. Those writings have some level of superiority with regard to whatever matter they deal with. But I would contend that God's word is superior. There are some church fathers that wrote things that are consistent with what's found in the Bible. But we must always take those writings and filter them through the Bible. Why? Because the Bible is true. The Bible is God's word. The Bible is superior to leadership. Peter was in a place of leadership and as we've looked and we've already read the verses in verses 12 through 15 and thinking about his leadership and the place where God has put him in this time in his life and he says, listen, as he's pointing these beliefs. believers to the more sure word of prophecy, to the word of God, he's saying, listen, the Bible is superior to me as a leader. There are leaders that go astray. There are churches that go astray. It happens. They leave this book. If a leader, if I, as the pastor of Fellowship Baptist Church, begin teaching something that is contrary to this book, this book is superior to leadership. And you ought to get a new leader, amen? And that's me as the pastor saying that. What happens so often is churches get hijacked, is the term that I'll use, and as they get hijacked, good, solid people within those churches say, well, I guess we're going to go find another church. And they allow the church to be hijacked. But the Bible is superior to leadership. We use the King James Bible. There's an issue going on right now in America. I'm not sure if you're aware of it. There's an issue over the King James Bible right now that's probably as big as it was 50 years ago. For a long period of time, the King James Bible kind of battle kind of simmered a little bit broadly speaking, but we've got a group of people today, I mean, this just happened two weeks ago, group of people today that are taking churches like ours that are King James and they're leading them to a different modern translation. And then they had, on February 8th and 9th, I think it was, they had a conference and invited other pastors to come to teach them how to lead your church away from the King James, yeah, just a few weeks ago. And what I'd say this morning is that we have a more sure word and God's Word is not only sufficient but God's Word is superior and it's superior to leadership. By the way, let me say this, the integrity of an individual is to be questioned when they take over a ministry with the intent of leading it in a different direction. It's an integrity issue and it's unfortunate. But this morning, what do we see Peter saying? Peter's saying, we have a more sure word, the superiority of God's Word. But Peter, you walked with Christ. But Peter, you were at the Mount of Transfiguration. But Peter, you heard the voice of the Father. God's Word is superior, God's Word is superior than leadership. Let me say this, not only is God's Word superior to leadership, but God's Word is superior to experience. God's Word is superior to experience. Now this is something that is very important for us to understand. Peter had these great experiences and, of course, I've mentioned already about him walking with the Lord Jesus Christ and we've mentioned about the Mount of Transfiguration, specifically that he mentions here within this text of Scripture, and though he had these great experiences, he's going to point the believers that he's ministering to, to the fact that we have also a more sure word of prophecy. See, there are people today that would elevate experience over God's Word. It's happening all over the place today. They would elevate experience over God's Word. And what happens in our lives is we have some experience. Listen, experience is real. When you have somebody that's experienced something, it is almost impossible to convince them they've not had that experience. I spoke with a man years ago, he said, I saw a vision, and I mean, he was absolutely 100% convinced that he saw a vision. And I was just a young man, I was probably 19, 20 years old, 20, maybe 21, just in that ballpark, a young man, and I thought, this guy's crazy. That's my initial thought when he was explaining this to me. But then as I listened to him, I didn't tell him he was crazy, that's just what I thought, and then as I listened to him, I realized he was absolutely certain that he had this experience. There was absolutely nothing I was going to do to tell him he didn't have that experience. There are people today that are having experiences, and they're experiences that are contrary to God's Word. And what happens is when they have an experience that's contrary to God's Word, unfortunately, there are many people that take and they say, well, that was my experience, and all of a sudden their experience trumps the Word of God. But Peter's saying, no, no, no, listen, God's Word is sufficient and God's Word is superior, and God's Word is superior to leadership, but it's also superior to experience. Turn over to the book of 2 Corinthians, if you will, and let me read a passage of Scripture to you as we consider this thought that God's Word is superior to experience. God's Word is superior to experience. People today say, well, I want to figure out, I want to understand what it is that I experienced. I want to have an understanding as I look to the Bible and I see the truth of the Word of God, but yet I had this experience and I want to try to understand how does that jive? What did that really mean? We must dig into the Bible, we must dig into the Bible. The Bible tells us in verse number 13 of 2 Corinthians chapter number 11, 2 Corinthians chapter number 11 beginning in verse number 13, the Bible says, for such are false apostles, deceitful workers, transforming themselves into the apostles of Christ. I want you to notice verse 14, it says, in no marvel, for Satan himself is transformed into an angel of light, therefore, it's no great thing if his ministers also be transformed as the ministers of righteousness whose end shall be according to their works. These verses of Scripture in 2 Corinthians 11 are verses that should cause us to be sober, to understand the spiritual battle that we're engaged in and the tactics of the enemy. In fact, earlier in this book, and you don't need to turn back, but in 2 Corinthians chapter number 2 and verse number 11, Paul says this, lest Satan should get an advantage of us for we are not ignorant of his devices. And as we look at this 11th chapter of the book of 2 Corinthians, we find that God is revealing to us some of how it is that the enemy works. And he says, no marvel, for Satan himself is transformed into an angel of light, and if he is, it says, therefore, it's no great thing if his ministers also be transformed as the ministers of righteousness whose end shall be according to their works. So the Word of God is superior to experience. You say, well, I experienced such and such, and I had this experience. I talk to people and ask them about being saved, are you sure that heaven's your home? Well, this is my experience. I'm not asking you about your experience, I'm asking if you've trusted Christ as your Savior. I've had people say, in fact, I've seen a number of videos in the past week about this very thing, that people have said, well, I've spoken in tongues. And they begin to try to say that speaking in tongues is the evidence of either being saved or being filled with the Holy Spirit of God, but as you look at the Bible, it's not always that…yes, there's a biblical truth of tongues, but they always speak in a known language. It's a sign for the unbelievers, the Bible tells us, for the Jews. And begin to have this experience, and they cannot understand their experience with regard to what does the Bible say, why? Because what happens, we begin to elevate our experience over what God said in His Word. But God's Word is superior to experience. And we must understand that we bring every…in fact, in this same passage in chapter number 10, look back actually at 2 Corinthians chapter number 10, notice what he says in verse number five. This is…it goes right together with this when you think about experience, in 2 Corinthians 10, in verse number five, he says, casting down imaginations and every high thing that exalted itself against the knowledge of God, and bringing into captivity every thought to the obedience of Christ. I would say this, not only bringing every thought into obedience of Christ, but every experience of the obedience of Christ. What is this that happened? What did I experience here, there, or somewhere else? But we say God's Word is superior to our experiences, it's superior. So Peter, he's about to die, he says, I must put off this, my earthly tabernacle. But though this is going to happen shortly, I want to give you some truth. I want to help you, I want to instruct you, and influence you, and impact you, and I want to point you to the Word of God, because we have also a more sure word of prophecy. Listen, this book, because of what it is, is so precious. And we must elevate the Lord Jesus Christ, and we must place a priority on the preaching of God's Word. And understanding, even as we look next week, why are we taking three weeks to set the foundation for how it is that I approach the Bible? Because we will never, I will never, and you will never approach the Bible in the way that we should if we don't first understand what it is. If we don't first have an understanding of what this book is, we're not going to approach it the way that we should. It's no longer going to be a situation of, I'll read it if I get around to it. No, it's going to take a place of priority. I must. We'll say, as Job said, the words of thy mouth are more necessary than my food. You think about that. Most of us aren't skipping any meals, I haven't skipped any recently at least, and the reality is that we get hungry for sustenance. I wonder how often we get hungry for God's Word. I just need to get in the Bible. I just can't wait to read. I'm so excited for what God's going to show me, what God's going to reveal to me. You see, when we understand what this book is, it will impact greatly what our approach to this book is. He says in the same passage of Scripture, we have a more sure word of prophecy. He says this, and I love the imagery, and I'll give you a sneak peek the next week. He says, whereunto ye do well that ye take heed. It is in our best interest to take heed to God's Word because of what it is. Then he uses an illustration, as unto a light that shineth in a dark place. Have you ever been in a dark place? I mean, today it's light out, if we turn all the lights off in here, you'd still be able to see perfectly fine. How many of you have ever been to the caverns out in Shenandoah? I don't know if they still do this or not, but the last time I was there, they turned all the lights off. Anyone have that experience when you went to the caverns and they turn all the lights off and they said, wave your hand in front of you, and you can't see anything? I mean, it is dark, right? You experienced it? So if we're in that place and it's dark like that, and you pull out a handy Fellowship Baptist Church key chain flashlight, because we give those things out every year, but you grab one of those things and you're in the room down there with 50 people, and you turn that light on, what do you think is going to happen? It's going to get people's attention. You're going to look to that light. I mean, without thinking about it. In fact, if you're knowledgeable that somebody is going to turn on a light and you try to tell yourself, don't look, don't look, don't you ever do that? Don't do it, don't do it, don't do it. But man, that light comes on and it's just an instinct. That's the illustration that Peter uses. And we do well that we take heed, and he says that as we're looking at a light that shineth in a dark place, but we understand this morning, God's Word is sufficient. People today are running around looking for some kind of new revelation, looking for some new experience, while at the same time they're neglecting this book. I don't know, God said, I've given you the Bible, and it's a more sure word of prophecy. It is sufficient. Peter says, I want to point you to the Word of God. It's sufficient. And then he says, it's superior, superior to leadership. Leaders can be wrong. I've been wrong. Leaders can be wrong. We are humans. Peter can be wrong, not as he's penning Scripture, but in his leadership, but God's Word is never wrong. It's incapable of error, and therefore, Peter says it's superior to leadership. It's superior to your leadership.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.680000066757202,
      "text": " I'm thankful for the Word of God."
    },
    {
      "id": 1,
      "start": 2.680000066757202,
      "end": 3.799999952316284,
      "text": " The last couple of weeks,"
    },
    {
      "id": 2,
      "start": 3.799999952316284,
      "end": 5.71999979019165,
      "text": " we've had the opportunity to study,"
    },
    {
      "id": 3,
      "start": 5.71999979019165,
      "end": 7.800000190734863,
      "text": " we've noted the greatness of God,"
    },
    {
      "id": 4,
      "start": 7.800000190734863,
      "end": 9.279999732971191,
      "text": " and we've said that God's greatness"
    },
    {
      "id": 5,
      "start": 9.279999732971191,
      "end": 11.920000076293945,
      "text": " is revealed first through inspiration."
    },
    {
      "id": 6,
      "start": 11.920000076293945,
      "end": 13.520000457763672,
      "text": " I'm thankful that the Bible tells us"
    },
    {
      "id": 7,
      "start": 13.520000457763672,
      "end": 17.280000686645508,
      "text": " that all scripture is given by inspiration of God"
    },
    {
      "id": 8,
      "start": 17.280000686645508,
      "end": 18.84000015258789,
      "text": " and is profitable."
    },
    {
      "id": 9,
      "start": 18.84000015258789,
      "end": 22.280000686645508,
      "text": " I'm so thankful that God has given us His Word"
    },
    {
      "id": 10,
      "start": 22.280000686645508,
      "end": 25.020000457763672,
      "text": " and not only the truth of inspiration,"
    },
    {
      "id": 11,
      "start": 25.020000457763672,
      "end": 28.079999923706055,
      "text": " but then we dealt with the truth of preservation,"
    },
    {
      "id": 12,
      "start": 28.079999923706055,
      "end": 30.600000381469727,
      "text": " and preservation reveals the greatness of God."
    },
    {
      "id": 13,
      "start": 30.600000381469727,
      "end": 34.68000030517578,
      "text": " I'm thankful this morning that God has preserved His Word."
    },
    {
      "id": 14,
      "start": 34.68000030517578,
      "end": 35.7599983215332,
      "text": " I said this last week,"
    },
    {
      "id": 15,
      "start": 35.7599983215332,
      "end": 39.400001525878906,
      "text": " that inspiration is a precious Bible truth,"
    },
    {
      "id": 16,
      "start": 39.400001525878906,
      "end": 41.279998779296875,
      "text": " but without preservation,"
    },
    {
      "id": 17,
      "start": 41.279998779296875,
      "end": 43.560001373291016,
      "text": " inspiration really only affects"
    },
    {
      "id": 18,
      "start": 43.560001373291016,
      "end": 46.79999923706055,
      "text": " the initial immediate recipients."
    },
    {
      "id": 19,
      "start": 46.79999923706055,
      "end": 48.959999084472656,
      "text": " And I'm thankful that this morning,"
    },
    {
      "id": 20,
      "start": 48.959999084472656,
      "end": 53.18000030517578,
      "text": " when we have the truth of the preserved Word of God,"
    },
    {
      "id": 21,
      "start": 53.18000030517578,
      "end": 56.15999984741211,
      "text": " that we can rejoice in how great our God is."
    },
    {
      "id": 22,
      "start": 56.15999984741211,
      "end": 58.2400016784668,
      "text": " He is eternal."
    },
    {
      "id": 23,
      "start": 58.2400016784668,
      "end": 59.599998474121094,
      "text": " I think about what the psalmist said."
    },
    {
      "id": 24,
      "start": 59.599998474121094,
      "end": 60.52000045776367,
      "text": " We're here in 2 Peter."
    },
    {
      "id": 25,
      "start": 60.52000045776367,
      "end": 61.36000061035156,
      "text": " We're gonna stay here,"
    },
    {
      "id": 26,
      "start": 61.36000061035156,
      "end": 63.79999923706055,
      "text": " but I want you to hear these words from the psalmist"
    },
    {
      "id": 27,
      "start": 63.79999923706055,
      "end": 66.63999938964844,
      "text": " in Psalm 111, in verse number four."
    },
    {
      "id": 28,
      "start": 66.63999938964844,
      "end": 67.83999633789062,
      "text": " The Bible says this,"
    },
    {
      "id": 29,
      "start": 67.83999633789062,
      "end": 69.76000213623047,
      "text": " He, speaking of the Lord,"
    },
    {
      "id": 30,
      "start": 69.76000213623047,
      "end": 73.36000061035156,
      "text": " hath made His wonderful works,"
    },
    {
      "id": 31,
      "start": 73.36000061035156,
      "end": 74.31999969482422,
      "text": " notice these words,"
    },
    {
      "id": 32,
      "start": 74.31999969482422,
      "end": 76.63999938964844,
      "text": " to be remembered."
    },
    {
      "id": 33,
      "start": 77.4800033569336,
      "end": 78.83999633789062,
      "text": " He, the Lord,"
    },
    {
      "id": 34,
      "start": 78.83999633789062,
      "end": 82.36000061035156,
      "text": " hath made His wonderful works"
    },
    {
      "id": 35,
      "start": 82.36000061035156,
      "end": 83.5999984741211,
      "text": " to be remembered."
    },
    {
      "id": 36,
      "start": 83.63999938964844,
      "end": 86.19999694824219,
      "text": " How did He make them to be remembered?"
    },
    {
      "id": 37,
      "start": 87.12000274658203,
      "end": 88.5999984741211,
      "text": " Right here."
    },
    {
      "id": 38,
      "start": 88.5999984741211,
      "end": 90.12000274658203,
      "text": " Right here."
    },
    {
      "id": 39,
      "start": 90.12000274658203,
      "end": 92.5199966430664,
      "text": " This morning, we can read of things"
    },
    {
      "id": 40,
      "start": 92.5199966430664,
      "end": 95.5199966430664,
      "text": " that have taken place thousands of years ago."
    },
    {
      "id": 41,
      "start": 95.5199966430664,
      "end": 97.72000122070312,
      "text": " We can read of those biblical accounts."
    },
    {
      "id": 42,
      "start": 97.72000122070312,
      "end": 101.16000366210938,
      "text": " We can read of God's work and all that God has done,"
    },
    {
      "id": 43,
      "start": 101.16000366210938,
      "end": 103.63999938964844,
      "text": " and we say we rejoice greatly."
    },
    {
      "id": 44,
      "start": 103.63999938964844,
      "end": 104.4800033569336,
      "text": " Why?"
    },
    {
      "id": 45,
      "start": 104.4800033569336,
      "end": 108.95999908447266,
      "text": " Because God has made His works to be remembered."
    },
    {
      "id": 46,
      "start": 108.95999908447266,
      "end": 109.80000305175781,
      "text": " And this morning,"
    },
    {
      "id": 47,
      "start": 109.80000305175781,
      "end": 112.72000122070312,
      "text": " we can rejoice in understanding that truth."
    },
    {
      "id": 48,
      "start": 112.72000122070312,
      "end": 114.19999694824219,
      "text": " We understand this morning as well"
    },
    {
      "id": 49,
      "start": 114.19999694824219,
      "end": 116.5199966430664,
      "text": " that God's word continues to be under attack."
    },
    {
      "id": 50,
      "start": 116.5199966430664,
      "end": 118.13999938964844,
      "text": " It's always been under attack."
    },
    {
      "id": 51,
      "start": 118.13999938964844,
      "end": 120.4000015258789,
      "text": " We find that back in the garden,"
    },
    {
      "id": 52,
      "start": 120.4000015258789,
      "end": 121.23999786376953,
      "text": " Satan said,"
    },
    {
      "id": 53,
      "start": 121.23999786376953,
      "end": 122.91999816894531,
      "text": " yea, hath God said,"
    },
    {
      "id": 54,
      "start": 122.91999816894531,
      "end": 123.76000213623047,
      "text": " and then he says,"
    },
    {
      "id": 55,
      "start": 123.76000213623047,
      "end": 125.04000091552734,
      "text": " ye shall not surely die."
    },
    {
      "id": 56,
      "start": 125.04000091552734,
      "end": 127.5999984741211,
      "text": " And we know that the Bible continues to be under attack"
    },
    {
      "id": 57,
      "start": 127.5999984741211,
      "end": 129.1999969482422,
      "text": " still to this very day."
    },
    {
      "id": 58,
      "start": 129.1999969482422,
      "end": 130.83999633789062,
      "text": " In fact, this morning,"
    },
    {
      "id": 59,
      "start": 130.83999633789062,
      "end": 132.8800048828125,
      "text": " as we think about the Bible being attacked,"
    },
    {
      "id": 60,
      "start": 132.8800048828125,
      "end": 135.55999755859375,
      "text": " we would say that liberalism would say"
    },
    {
      "id": 61,
      "start": 135.55999755859375,
      "end": 139.0399932861328,
      "text": " that a Bible is just a book of suggestions."
    },
    {
      "id": 62,
      "start": 139.0399932861328,
      "end": 140.36000061035156,
      "text": " Sometimes good suggestions,"
    },
    {
      "id": 63,
      "start": 140.36000061035156,
      "end": 142.52000427246094,
      "text": " but suggestions nonetheless."
    },
    {
      "id": 64,
      "start": 143.32000732421875,
      "end": 144.8000030517578,
      "text": " And this book is not a book of suggestions."
    },
    {
      "id": 65,
      "start": 144.8000030517578,
      "end": 146.86000061035156,
      "text": " This is a book of God's word."
    },
    {
      "id": 66,
      "start": 146.86000061035156,
      "end": 150.47999572753906,
      "text": " This is profitable for us as the people of God."
    },
    {
      "id": 67,
      "start": 150.47999572753906,
      "end": 153.52000427246094,
      "text": " We could speak of those which have the approach"
    },
    {
      "id": 68,
      "start": 153.52000427246094,
      "end": 156.24000549316406,
      "text": " and the idea that God's word could have errors."
    },
    {
      "id": 69,
      "start": 156.24000549316406,
      "end": 157.36000061035156,
      "text": " It could be wrong."
    },
    {
      "id": 70,
      "start": 157.36000061035156,
      "end": 159.6999969482422,
      "text": " And, but every word of God is pure"
    },
    {
      "id": 71,
      "start": 159.6999969482422,
      "end": 162.55999755859375,
      "text": " because it's been given by inspiration."
    },
    {
      "id": 72,
      "start": 162.55999755859375,
      "end": 163.60000610351562,
      "text": " And it's God's word."
    },
    {
      "id": 73,
      "start": 163.60000610351562,
      "end": 165.0,
      "text": " It's been preserved for us."
    },
    {
      "id": 74,
      "start": 165.0,
      "end": 167.02000427246094,
      "text": " So we believe that the Bible is inerrant."
    },
    {
      "id": 75,
      "start": 167.02000427246094,
      "end": 170.1999969482422,
      "text": " It is incapable of having error."
    },
    {
      "id": 76,
      "start": 170.1999969482422,
      "end": 172.0,
      "text": " And I'm thankful for that truth."
    },
    {
      "id": 77,
      "start": 172.44000244140625,
      "end": 173.27999877929688,
      "text": " In fact, this morning,"
    },
    {
      "id": 78,
      "start": 173.27999877929688,
      "end": 175.60000610351562,
      "text": " there are some that would say that the Bible"
    },
    {
      "id": 79,
      "start": 175.60000610351562,
      "end": 177.8000030517578,
      "text": " is just no longer relevant."
    },
    {
      "id": 80,
      "start": 177.8000030517578,
      "end": 179.3800048828125,
      "text": " You say, do they really say that?"
    },
    {
      "id": 81,
      "start": 179.3800048828125,
      "end": 181.0399932861328,
      "text": " Well, sometimes they don't say it with their words,"
    },
    {
      "id": 82,
      "start": 181.0399932861328,
      "end": 182.9600067138672,
      "text": " but they say it with their actions."
    },
    {
      "id": 83,
      "start": 182.9600067138672,
      "end": 184.8800048828125,
      "text": " They make decisions, they make choices."
    },
    {
      "id": 84,
      "start": 184.8800048828125,
      "end": 188.72000122070312,
      "text": " They do things that reveal to us what they really believe."
    },
    {
      "id": 85,
      "start": 188.72000122070312,
      "end": 189.83999633789062,
      "text": " Because the fact of the matter,"
    },
    {
      "id": 86,
      "start": 189.83999633789062,
      "end": 192.02000427246094,
      "text": " I've said this often over the years,"
    },
    {
      "id": 87,
      "start": 192.02000427246094,
      "end": 197.02000427246094,
      "text": " is that our belief impacts our behavior,"
    },
    {
      "id": 88,
      "start": 197.24000549316406,
      "end": 200.9199981689453,
      "text": " but our behavior reveals what we believe."
    },
    {
      "id": 89,
      "start": 200.9199981689453,
      "end": 204.0399932861328,
      "text": " And so when you find individuals, organizations,"
    },
    {
      "id": 90,
      "start": 205.16000366210938,
      "end": 208.9600067138672,
      "text": " groups of people within the broad term of Christendom"
    },
    {
      "id": 91,
      "start": 208.9600067138672,
      "end": 211.27999877929688,
      "text": " that are behaving in a certain way"
    },
    {
      "id": 92,
      "start": 211.27999877929688,
      "end": 214.16000366210938,
      "text": " that is contrary to what God's word says,"
    },
    {
      "id": 93,
      "start": 214.16000366210938,
      "end": 217.36000061035156,
      "text": " then really what they're telling us through their behavior"
    },
    {
      "id": 94,
      "start": 217.36000061035156,
      "end": 220.52000427246094,
      "text": " is that God's word really is no longer relevant."
    },
    {
      "id": 95,
      "start": 220.52000427246094,
      "end": 221.8000030517578,
      "text": " Well, I beg to differ."
    },
    {
      "id": 96,
      "start": 221.8000030517578,
      "end": 224.0,
      "text": " God's word is absolutely relevant."
    },
    {
      "id": 97,
      "start": 224.0,
      "end": 227.1199951171875,
      "text": " God who is eternal has given us an eternal book"
    },
    {
      "id": 98,
      "start": 227.1199951171875,
      "end": 228.75999450683594,
      "text": " and it is relevant."
    },
    {
      "id": 99,
      "start": 228.75999450683594,
      "end": 230.8000030517578,
      "text": " It is for us today."
    },
    {
      "id": 100,
      "start": 231.6199951171875,
      "end": 232.44000244140625,
      "text": " There are some that have the idea"
    },
    {
      "id": 101,
      "start": 232.44000244140625,
      "end": 235.72000122070312,
      "text": " that the Bible must be updated."
    },
    {
      "id": 102,
      "start": 235.72000122070312,
      "end": 237.27999877929688,
      "text": " There are some that have the idea"
    },
    {
      "id": 103,
      "start": 237.27999877929688,
      "end": 242.27999877929688,
      "text": " that experience supersedes biblical truth."
    },
    {
      "id": 104,
      "start": 243.0399932861328,
      "end": 244.9199981689453,
      "text": " No, the Bible stands."
    },
    {
      "id": 105,
      "start": 244.9199981689453,
      "end": 246.60000610351562,
      "text": " And as we look at the passage of Scripture"
    },
    {
      "id": 106,
      "start": 246.60000610351562,
      "end": 248.0800018310547,
      "text": " before us this morning,"
    },
    {
      "id": 107,
      "start": 248.0800018310547,
      "end": 252.24000549316406,
      "text": " I find that Peter, as he's writing to these believers,"
    },
    {
      "id": 108,
      "start": 252.24000549316406,
      "end": 255.47999572753906,
      "text": " he uses this term, speaking of God's word,"
    },
    {
      "id": 109,
      "start": 255.47999572753906,
      "end": 259.3599853515625,
      "text": " he says it's a more sure word."
    },
    {
      "id": 110,
      "start": 259.3599853515625,
      "end": 261.7200012207031,
      "text": " We're gonna use that as our title this morning."
    },
    {
      "id": 111,
      "start": 261.7200012207031,
      "end": 263.5199890136719,
      "text": " And you can see that in verse number 19,"
    },
    {
      "id": 112,
      "start": 263.5199890136719,
      "end": 265.760009765625,
      "text": " but pick it up with me in verse number 12."
    },
    {
      "id": 113,
      "start": 265.760009765625,
      "end": 267.1600036621094,
      "text": " And notice what Peter,"
    },
    {
      "id": 114,
      "start": 267.1600036621094,
      "end": 269.3599853515625,
      "text": " under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 115,
      "start": 269.3599853515625,
      "end": 272.0,
      "text": " is writing to these believers."
    },
    {
      "id": 116,
      "start": 272.0,
      "end": 273.55999755859375,
      "text": " The Bible says in verse number 12,"
    },
    {
      "id": 117,
      "start": 273.55999755859375,
      "end": 276.8399963378906,
      "text": " wherefore, I will not be negligent"
    },
    {
      "id": 118,
      "start": 276.8399963378906,
      "end": 281.0799865722656,
      "text": " to put you always in remembrance of these things,"
    },
    {
      "id": 119,
      "start": 281.0799865722656,
      "end": 282.2799987792969,
      "text": " though you know them,"
    },
    {
      "id": 120,
      "start": 283.44000244140625,
      "end": 286.1199951171875,
      "text": " and be established in the present truth."
    },
    {
      "id": 121,
      "start": 286.1199951171875,
      "end": 291.1199951171875,
      "text": " Yea, I think it meet as long as I am in this tabernacle"
    },
    {
      "id": 122,
      "start": 291.239990234375,
      "end": 295.760009765625,
      "text": " to stir you up by putting you in remembrance,"
    },
    {
      "id": 123,
      "start": 295.760009765625,
      "end": 300.6400146484375,
      "text": " knowing that shortly I must put off this my tabernacle,"
    },
    {
      "id": 124,
      "start": 300.6400146484375,
      "end": 304.0799865722656,
      "text": " even as our Lord Jesus Christ hath showed me."
    },
    {
      "id": 125,
      "start": 304.0799865722656,
      "end": 305.1600036621094,
      "text": " What is Peter talking about?"
    },
    {
      "id": 126,
      "start": 305.1600036621094,
      "end": 306.3599853515625,
      "text": " He said, I'm gonna die."
    },
    {
      "id": 127,
      "start": 307.5199890136719,
      "end": 309.0799865722656,
      "text": " The reality is that each and every one of us"
    },
    {
      "id": 128,
      "start": 309.0799865722656,
      "end": 310.9200134277344,
      "text": " are gonna die one day."
    },
    {
      "id": 129,
      "start": 310.9200134277344,
      "end": 312.4800109863281,
      "text": " And Peter understood that he was coming"
    },
    {
      "id": 130,
      "start": 312.4800109863281,
      "end": 313.760009765625,
      "text": " near the end of his life,"
    },
    {
      "id": 131,
      "start": 314.20001220703125,
      "end": 316.79998779296875,
      "text": " as the Lord had revealed to him."
    },
    {
      "id": 132,
      "start": 316.79998779296875,
      "end": 318.6000061035156,
      "text": " And now, of course, speaking under the inspiration"
    },
    {
      "id": 133,
      "start": 318.6000061035156,
      "end": 319.760009765625,
      "text": " of the Holy Spirit of God,"
    },
    {
      "id": 134,
      "start": 319.760009765625,
      "end": 321.3599853515625,
      "text": " we find that he's writing these words."
    },
    {
      "id": 135,
      "start": 321.3599853515625,
      "end": 324.3999938964844,
      "text": " And he says, listen, as long as I'm in this tabernacle,"
    },
    {
      "id": 136,
      "start": 324.3999938964844,
      "end": 325.4800109863281,
      "text": " as long as I'm in this body,"
    },
    {
      "id": 137,
      "start": 325.4800109863281,
      "end": 328.4800109863281,
      "text": " I understand that I must soon put off this my tabernacle,"
    },
    {
      "id": 138,
      "start": 328.4800109863281,
      "end": 331.239990234375,
      "text": " but as long as I'm here, I'm seeking to influence you,"
    },
    {
      "id": 139,
      "start": 331.239990234375,
      "end": 333.0,
      "text": " and I'm seeking to instruct you,"
    },
    {
      "id": 140,
      "start": 333.0,
      "end": 334.5199890136719,
      "text": " and I'm seeking to give you truth."
    },
    {
      "id": 141,
      "start": 334.5199890136719,
      "end": 336.1199951171875,
      "text": " And notice what he says in verse number 15."
    },
    {
      "id": 142,
      "start": 336.1199951171875,
      "end": 337.6400146484375,
      "text": " Why is he doing this?"
    },
    {
      "id": 143,
      "start": 337.6400146484375,
      "end": 342.6400146484375,
      "text": " Moreover, I will endeavor that ye may be able,"
    },
    {
      "id": 144,
      "start": 342.760009765625,
      "end": 346.3599853515625,
      "text": " after my decease, to have these things"
    },
    {
      "id": 145,
      "start": 346.3599853515625,
      "end": 348.79998779296875,
      "text": " always in remembrance."
    },
    {
      "id": 146,
      "start": 348.79998779296875,
      "end": 350.9599914550781,
      "text": " Peter says, I'm not gonna be here forever."
    },
    {
      "id": 147,
      "start": 351.8399963378906,
      "end": 354.0,
      "text": " And we're passing the baton to a next generation,"
    },
    {
      "id": 148,
      "start": 354.0,
      "end": 355.9599914550781,
      "text": " to a future generation."
    },
    {
      "id": 149,
      "start": 355.9599914550781,
      "end": 357.6000061035156,
      "text": " And Peter says, I wanna influence,"
    },
    {
      "id": 150,
      "start": 357.6000061035156,
      "end": 359.67999267578125,
      "text": " and instruct, and impact you."
    },
    {
      "id": 151,
      "start": 359.67999267578125,
      "end": 362.3999938964844,
      "text": " I wanna give you the truth of God's word,"
    },
    {
      "id": 152,
      "start": 362.3999938964844,
      "end": 365.6400146484375,
      "text": " so that after I'm gone, after my decease,"
    },
    {
      "id": 153,
      "start": 365.6400146484375,
      "end": 368.20001220703125,
      "text": " that you'll have these things always in remembrance,"
    },
    {
      "id": 154,
      "start": 368.20001220703125,
      "end": 372.55999755859375,
      "text": " and that the work of God would continue to move forward."
    },
    {
      "id": 155,
      "start": 373.3999938964844,
      "end": 375.0400085449219,
      "text": " In verse 16, he says, for we have not followed"
    },
    {
      "id": 156,
      "start": 375.0400085449219,
      "end": 378.44000244140625,
      "text": " cunningly devised fables, when we made known unto you"
    },
    {
      "id": 157,
      "start": 378.44000244140625,
      "end": 382.239990234375,
      "text": " the power and coming of our Lord Jesus Christ,"
    },
    {
      "id": 158,
      "start": 382.239990234375,
      "end": 385.760009765625,
      "text": " but were eyewitnesses of his majesty."
    },
    {
      "id": 159,
      "start": 385.760009765625,
      "end": 388.67999267578125,
      "text": " For he received from God the Father honor and glory,"
    },
    {
      "id": 160,
      "start": 388.67999267578125,
      "end": 391.9599914550781,
      "text": " when there came such a voice to him from the excellent glory"
    },
    {
      "id": 161,
      "start": 391.9599914550781,
      "end": 395.9200134277344,
      "text": " this is my beloved son in whom I am well pleased."
    },
    {
      "id": 162,
      "start": 395.9200134277344,
      "end": 397.8399963378906,
      "text": " In this voice which came from heaven,"
    },
    {
      "id": 163,
      "start": 397.8399963378906,
      "end": 402.3999938964844,
      "text": " we heard when we were with him in the holy mount."
    },
    {
      "id": 164,
      "start": 403.239990234375,
      "end": 408.239990234375,
      "text": " We have also a more sure word of prophecy."
    },
    {
      "id": 165,
      "start": 408.9200134277344,
      "end": 410.1199951171875,
      "text": " Where unto?"
    },
    {
      "id": 166,
      "start": 410.1199951171875,
      "end": 412.2799987792969,
      "text": " Ye do well that ye take heed,"
    },
    {
      "id": 167,
      "start": 412.2799987792969,
      "end": 414.55999755859375,
      "text": " as unto a light that shineth in a dark place"
    },
    {
      "id": 168,
      "start": 414.55999755859375,
      "end": 419.0,
      "text": " unto the day dawn, and the day star arise in your hearts."
    },
    {
      "id": 169,
      "start": 419.0,
      "end": 421.8399963378906,
      "text": " Knowing this first, that no prophecy of the scriptures"
    },
    {
      "id": 170,
      "start": 421.8399963378906,
      "end": 424.0,
      "text": " of any private interpretation,"
    },
    {
      "id": 171,
      "start": 424.0,
      "end": 426.5199890136719,
      "text": " for the prophecy came not in old time by the will of man,"
    },
    {
      "id": 172,
      "start": 426.5199890136719,
      "end": 428.0400085449219,
      "text": " but a holy man of God spake,"
    },
    {
      "id": 173,
      "start": 428.0400085449219,
      "end": 431.0400085449219,
      "text": " as they were moved by the Holy Ghost."
    },
    {
      "id": 174,
      "start": 431.0400085449219,
      "end": 434.1600036621094,
      "text": " In verses 20 and 21, we referenced those verses"
    },
    {
      "id": 175,
      "start": 434.1600036621094,
      "end": 436.239990234375,
      "text": " of scripture in our first message,"
    },
    {
      "id": 176,
      "start": 436.239990234375,
      "end": 438.9599914550781,
      "text": " that inspiration reveals the greatness of God."
    },
    {
      "id": 177,
      "start": 438.9599914550781,
      "end": 443.1600036621094,
      "text": " And in that message, we discuss the process of inspiration."
    },
    {
      "id": 178,
      "start": 443.1600036621094,
      "end": 445.67999267578125,
      "text": " How did God give us his word?"
    },
    {
      "id": 179,
      "start": 445.67999267578125,
      "end": 447.8800048828125,
      "text": " We understand that he promised,"
    },
    {
      "id": 180,
      "start": 447.8800048828125,
      "end": 450.55999755859375,
      "text": " he said that all scripture is given by inspiration of God."
    },
    {
      "id": 181,
      "start": 450.55999755859375,
      "end": 453.5199890136719,
      "text": " And then in verses 20 and 21 of the book of 2 Peter,"
    },
    {
      "id": 182,
      "start": 453.5199890136719,
      "end": 455.32000732421875,
      "text": " he helps us understand the process"
    },
    {
      "id": 183,
      "start": 455.32000732421875,
      "end": 457.6000061035156,
      "text": " in which he gave us his word."
    },
    {
      "id": 184,
      "start": 457.6000061035156,
      "end": 459.2799987792969,
      "text": " Now I want you to think about Peter."
    },
    {
      "id": 185,
      "start": 459.2799987792969,
      "end": 461.2799987792969,
      "text": " And many of us, we can relate to Peter,"
    },
    {
      "id": 186,
      "start": 461.2799987792969,
      "end": 464.67999267578125,
      "text": " and we can think of Peter, and we read of Peter's life,"
    },
    {
      "id": 187,
      "start": 464.67999267578125,
      "end": 467.2799987792969,
      "text": " and we say, man, that's someone that I can relate to."
    },
    {
      "id": 188,
      "start": 467.2799987792969,
      "end": 470.6000061035156,
      "text": " That's one of the disciples that I learned from his life,"
    },
    {
      "id": 189,
      "start": 470.6000061035156,
      "end": 472.44000244140625,
      "text": " and I see some things in Peter's life"
    },
    {
      "id": 190,
      "start": 472.44000244140625,
      "end": 475.0400085449219,
      "text": " that are very relatable to me in my life."
    },
    {
      "id": 191,
      "start": 475.0400085449219,
      "end": 477.79998779296875,
      "text": " But Peter, as he's writing here,"
    },
    {
      "id": 192,
      "start": 477.79998779296875,
      "end": 479.1600036621094,
      "text": " of course, he's an apostle,"
    },
    {
      "id": 193,
      "start": 479.1600036621094,
      "end": 481.0,
      "text": " he walked with the Lord Jesus Christ."
    },
    {
      "id": 194,
      "start": 481.0,
      "end": 483.8399963378906,
      "text": " And you think about the ministry that God gave him,"
    },
    {
      "id": 195,
      "start": 483.8399963378906,
      "end": 485.9200134277344,
      "text": " and here at this particular time,"
    },
    {
      "id": 196,
      "start": 485.9200134277344,
      "end": 489.32000732421875,
      "text": " as he's ready to depart from this earth"
    },
    {
      "id": 197,
      "start": 489.32000732421875,
      "end": 492.0400085449219,
      "text": " and enter into glory,"
    },
    {
      "id": 198,
      "start": 492.0400085449219,
      "end": 496.260009765625,
      "text": " we find that he's endeavoring to instruct."
    },
    {
      "id": 199,
      "start": 496.260009765625,
      "end": 500.760009765625,
      "text": " And he says, you have a more sure word."
    },
    {
      "id": 200,
      "start": 501.9200134277344,
      "end": 503.67999267578125,
      "text": " As I think about that truth"
    },
    {
      "id": 201,
      "start": 503.67999267578125,
      "end": 507.6000061035156,
      "text": " that he shares with us here in verse number 19,"
    },
    {
      "id": 202,
      "start": 507.6000061035156,
      "end": 509.6199951171875,
      "text": " and he shares with the recipients,"
    },
    {
      "id": 203,
      "start": 509.6199951171875,
      "end": 511.5199890136719,
      "text": " the original recipients,"
    },
    {
      "id": 204,
      "start": 511.5199890136719,
      "end": 513.1599731445312,
      "text": " these believers, by the way,"
    },
    {
      "id": 205,
      "start": 513.1599731445312,
      "end": 514.8800048828125,
      "text": " they were in need of encouragement."
    },
    {
      "id": 206,
      "start": 514.8800048828125,
      "end": 517.52001953125,
      "text": " We find that they were in need of instruction."
    },
    {
      "id": 207,
      "start": 517.52001953125,
      "end": 519.280029296875,
      "text": " If you look at the book of 1 Peter,"
    },
    {
      "id": 208,
      "start": 519.280029296875,
      "end": 521.6799926757812,
      "text": " and you find the timing of 1 and 2 Peter,"
    },
    {
      "id": 209,
      "start": 521.6799926757812,
      "end": 524.0800170898438,
      "text": " there was great persecution, there was false teaching,"
    },
    {
      "id": 210,
      "start": 524.0800170898438,
      "end": 526.760009765625,
      "text": " there was all sorts of things that were taking place,"
    },
    {
      "id": 211,
      "start": 526.760009765625,
      "end": 528.5,
      "text": " and these believers were in need"
    },
    {
      "id": 212,
      "start": 528.5,
      "end": 531.4400024414062,
      "text": " of both encouragement and instruction."
    },
    {
      "id": 213,
      "start": 531.4400024414062,
      "end": 533.5999755859375,
      "text": " And Peter clearly says in verse number 16,"
    },
    {
      "id": 214,
      "start": 533.5999755859375,
      "end": 538.2000122070312,
      "text": " we've not followed cunningly devised fables."
    },
    {
      "id": 215,
      "start": 538.2000122070312,
      "end": 539.5599975585938,
      "text": " These are not just stories."
    },
    {
      "id": 216,
      "start": 539.5599975585938,
      "end": 543.760009765625,
      "text": " These are, no, no, we're eyewitnesses of his majesty."
    },
    {
      "id": 217,
      "start": 543.760009765625,
      "end": 545.2000122070312,
      "text": " And we find that he's writing, again,"
    },
    {
      "id": 218,
      "start": 545.2000122070312,
      "end": 547.3599853515625,
      "text": " under the inspiration of the Holy Spirit of God."
    },
    {
      "id": 219,
      "start": 547.3599853515625,
      "end": 549.1199951171875,
      "text": " And so as we look at this passage of Scripture,"
    },
    {
      "id": 220,
      "start": 549.1199951171875,
      "end": 551.52001953125,
      "text": " I want you to consider two things with me this morning."
    },
    {
      "id": 221,
      "start": 551.52001953125,
      "end": 552.8400268554688,
      "text": " Number one, I want you to consider"
    },
    {
      "id": 222,
      "start": 552.8400268554688,
      "end": 555.7999877929688,
      "text": " the sufficiency of God's word,"
    },
    {
      "id": 223,
      "start": 555.7999877929688,
      "end": 558.0,
      "text": " the sufficiency of God's word."
    },
    {
      "id": 224,
      "start": 558.0,
      "end": 559.1199951171875,
      "text": " I'm thankful this morning"
    },
    {
      "id": 225,
      "start": 559.1199951171875,
      "end": 562.0999755859375,
      "text": " that God has given us exactly what we need."
    },
    {
      "id": 226,
      "start": 562.0999755859375,
      "end": 564.6799926757812,
      "text": " I'm thankful that as we open this book this morning,"
    },
    {
      "id": 227,
      "start": 564.6799926757812,
      "end": 568.02001953125,
      "text": " that we can find the answers to life's questions."
    },
    {
      "id": 228,
      "start": 568.02001953125,
      "end": 570.6400146484375,
      "text": " I've mentioned in previous messages"
    },
    {
      "id": 229,
      "start": 570.6400146484375,
      "end": 572.760009765625,
      "text": " with regard to studying and teaching"
    },
    {
      "id": 230,
      "start": 572.760009765625,
      "end": 574.6599731445312,
      "text": " and preaching about the word of God,"
    },
    {
      "id": 231,
      "start": 574.6599731445312,
      "end": 577.7999877929688,
      "text": " that this morning, God's word has the answer,"
    },
    {
      "id": 232,
      "start": 577.7999877929688,
      "end": 579.5999755859375,
      "text": " that there are many books that can inform,"
    },
    {
      "id": 233,
      "start": 579.5999755859375,
      "end": 581.4400024414062,
      "text": " but only this book will transform."
    },
    {
      "id": 234,
      "start": 581.4400024414062,
      "end": 586.4400024414062,
      "text": " And as we desire to maybe help ourselves in some way,"
    },
    {
      "id": 235,
      "start": 586.4400024414062,
      "end": 589.47998046875,
      "text": " I wanna be a better husband, I wanna be a better father,"
    },
    {
      "id": 236,
      "start": 589.47998046875,
      "end": 591.4400024414062,
      "text": " I wanna be a better wife or mother,"
    },
    {
      "id": 237,
      "start": 591.4400024414062,
      "end": 592.739990234375,
      "text": " or whatever it might be,"
    },
    {
      "id": 238,
      "start": 592.739990234375,
      "end": 595.719970703125,
      "text": " that the reality is that God's word provides us"
    },
    {
      "id": 239,
      "start": 595.719970703125,
      "end": 599.7999877929688,
      "text": " with instruction with every role that we'll have in life."
    },
    {
      "id": 0,
      "start": 599.7999877929688,
      "end": 604.0199875831604,
      "text": " As we think about those roles and we find those principles that God has given us and"
    },
    {
      "id": 1,
      "start": 604.0199875831604,
      "end": 609.5199880599976,
      "text": " we incorporate those principles in our lives and we're doers of the Word and not hearers"
    },
    {
      "id": 2,
      "start": 609.5199880599976,
      "end": 612.5199880599976,
      "text": " only, we find that God's Word is sufficient."
    },
    {
      "id": 3,
      "start": 612.5199880599976,
      "end": 617.8399887084961,
      "text": " That's why we're not looking for any new revelation."
    },
    {
      "id": 4,
      "start": 617.8399887084961,
      "end": 622.9199886322021,
      "text": " God's given us exactly what we need and we hold it in our hands this morning."
    },
    {
      "id": 5,
      "start": 622.9199886322021,
      "end": 625.9199886322021,
      "text": " And I want you to think about the sufficiency of God's Word, and I want you to think about"
    },
    {
      "id": 6,
      "start": 625.9199886322021,
      "end": 631.8399887084961,
      "text": " Peter writing this particular letter to these believers, and I want you to think about the"
    },
    {
      "id": 7,
      "start": 631.8399887084961,
      "end": 634.1999893188477,
      "text": " mindset sometimes that we can have."
    },
    {
      "id": 8,
      "start": 634.1999893188477,
      "end": 638.6399879455566,
      "text": " Peter, again I mentioned a moment ago, he was an apostle."
    },
    {
      "id": 9,
      "start": 638.6399879455566,
      "end": 642.1999893188477,
      "text": " Peter, he was at the Mount of Transfiguration."
    },
    {
      "id": 10,
      "start": 642.1999893188477,
      "end": 648.3199882507324,
      "text": " As you read verse 17 and 18 and the end of 16 with it, and you read that he's speaking"
    },
    {
      "id": 11,
      "start": 648.3199882507324,
      "end": 652.9599876403809,
      "text": " specifically about the time at the Mount of Transfiguration."
    },
    {
      "id": 12,
      "start": 652.9599876403809,
      "end": 656.6999893188477,
      "text": " See Peter was an apostle, but Peter was in that inner circle."
    },
    {
      "id": 13,
      "start": 656.6999893188477,
      "end": 660.3199882507324,
      "text": " We find that often as you think about that inner circle, it would be three individuals."
    },
    {
      "id": 14,
      "start": 660.3199882507324,
      "end": 666.6399841308594,
      "text": " It would be Peter, James, and John, and you would find how God would allow them as they"
    },
    {
      "id": 15,
      "start": 666.6399841308594,
      "end": 671.4399871826172,
      "text": " walked with the Lord Jesus Christ to experience certain things that even the others didn't"
    },
    {
      "id": 16,
      "start": 671.4399871826172,
      "end": 672.4399871826172,
      "text": " experience."
    },
    {
      "id": 17,
      "start": 672.4399871826172,
      "end": 677.3599853515625,
      "text": " And Peter was one with James and John that were on the Mount of Transfiguration."
    },
    {
      "id": 18,
      "start": 677.3599853515625,
      "end": 679.0399856567383,
      "text": " What a blessed truth."
    },
    {
      "id": 19,
      "start": 679.119987487793,
      "end": 683.3599853515625,
      "text": " What a great experience that Peter had there on the Mount of Transfiguration."
    },
    {
      "id": 20,
      "start": 683.3599853515625,
      "end": 685.5199890136719,
      "text": " He walked with the Lord Jesus Christ."
    },
    {
      "id": 21,
      "start": 685.5199890136719,
      "end": 693.7599868774414,
      "text": " The Bible tells us that he heard the voice of the Father there at the Mount of Transfiguration."
    },
    {
      "id": 22,
      "start": 693.7599868774414,
      "end": 698.7999877929688,
      "text": " What we find in verse number 17 at the end of the verse, the Bible says, this is my beloved"
    },
    {
      "id": 23,
      "start": 698.7999877929688,
      "end": 701.8199844360352,
      "text": " Son in whom I am well pleased."
    },
    {
      "id": 24,
      "start": 701.8199844360352,
      "end": 705.7199859619141,
      "text": " And we can read that in the Gospel account and we can see that, but notice what the Bible"
    },
    {
      "id": 25,
      "start": 705.7199859619141,
      "end": 710.9999847412109,
      "text": " says in verse number 18, and this voice which came from heaven, notice what it says, we"
    },
    {
      "id": 26,
      "start": 710.9999847412109,
      "end": 712.5999908447266,
      "text": " heard."
    },
    {
      "id": 27,
      "start": 712.5999908447266,
      "end": 718.5599899291992,
      "text": " We heard when we were with Him in the Holy Mount."
    },
    {
      "id": 28,
      "start": 718.5599899291992,
      "end": 723.6399841308594,
      "text": " See Peter, he was a leader."
    },
    {
      "id": 29,
      "start": 723.6399841308594,
      "end": 724.9599914550781,
      "text": " God used him."
    },
    {
      "id": 30,
      "start": 724.9599914550781,
      "end": 730.7199859619141,
      "text": " In fact, the Lord Jesus Christ said to Peter after he told him that Satan hath desired"
    },
    {
      "id": 31,
      "start": 730.7199859619141,
      "end": 735.6999816894531,
      "text": " to have him, that he had sifted his wheat, he said, I have prayed for thee."
    },
    {
      "id": 32,
      "start": 735.6999816894531,
      "end": 739.2199859619141,
      "text": " When thou art converted, strengthen thy brethren."
    },
    {
      "id": 33,
      "start": 739.2199859619141,
      "end": 742.97998046875,
      "text": " We find that God is using Peter in a great way."
    },
    {
      "id": 34,
      "start": 742.97998046875,
      "end": 746.8199920654297,
      "text": " You can read of his life and ministry in the book of Acts, and you can see here in 1 and"
    },
    {
      "id": 35,
      "start": 746.8199920654297,
      "end": 749.4199829101562,
      "text": " 2 Peter how God was using Peter."
    },
    {
      "id": 36,
      "start": 749.4199829101562,
      "end": 753.1399841308594,
      "text": " But the reality is that Peter would soon die."
    },
    {
      "id": 37,
      "start": 753.1399841308594,
      "end": 759.3799896240234,
      "text": " Peter was not going to last forever on this earth, and none of us will either."
    },
    {
      "id": 38,
      "start": 759.3799896240234,
      "end": 760.6599884033203,
      "text": " And so what is Peter doing?"
    },
    {
      "id": 39,
      "start": 760.6599884033203,
      "end": 763.97998046875,
      "text": " Well, Peter is pointing them to the Word of God."
    },
    {
      "id": 40,
      "start": 763.97998046875,
      "end": 767.739990234375,
      "text": " He's helping them to understand the sufficiency of God's Word."
    },
    {
      "id": 41,
      "start": 767.739990234375,
      "end": 772.0999908447266,
      "text": " He's helping them to understand here in this passage of Scripture, listen, you're not just"
    },
    {
      "id": 42,
      "start": 772.0999908447266,
      "end": 775.4199829101562,
      "text": " following me as an individual that was an apostle, you're not just following me as an"
    },
    {
      "id": 43,
      "start": 775.4199829101562,
      "end": 780.0599822998047,
      "text": " individual that walked with the Lord Jesus Christ, that even had the opportunity to go"
    },
    {
      "id": 44,
      "start": 780.0599822998047,
      "end": 785.0199890136719,
      "text": " to the Mount of Transfiguration and to hear the voice of the Father."
    },
    {
      "id": 45,
      "start": 785.0199890136719,
      "end": 793.5999908447266,
      "text": " No, I want to point you to the sufficiency of Scripture, because he says we have also"
    },
    {
      "id": 46,
      "start": 793.5999908447266,
      "end": 799.3999938964844,
      "text": " a more sure word of prophecy."
    },
    {
      "id": 47,
      "start": 799.3999938964844,
      "end": 806.0399932861328,
      "text": " That's a blessed truth and a blessed thought this morning, because people tend to gravitate"
    },
    {
      "id": 48,
      "start": 806.0399932861328,
      "end": 808.3599853515625,
      "text": " towards individuals that have experiences."
    },
    {
      "id": 49,
      "start": 808.3599853515625,
      "end": 815.0399932861328,
      "text": " They begin to put a certain amount of trust and confidence in an individual, and we could"
    },
    {
      "id": 50,
      "start": 815.0399932861328,
      "end": 820.239990234375,
      "text": " think about these that are being ministered here in 2 Peter, these believers that are"
    },
    {
      "id": 51,
      "start": 820.239990234375,
      "end": 825.1199951171875,
      "text": " being ministered to, and how they would possibly gravitate to Peter and want to hear what Peter"
    },
    {
      "id": 52,
      "start": 825.1199951171875,
      "end": 826.1199951171875,
      "text": " says."
    },
    {
      "id": 53,
      "start": 826.1199951171875,
      "end": 830.9599914550781,
      "text": " But Peter says, no, no, God's Word is sufficient, and I want to point you to God's Word."
    },
    {
      "id": 54,
      "start": 830.9599914550781,
      "end": 836.8799896240234,
      "text": " Notice back just earlier in chapter number 1, go back to verse number 3, if you will,"
    },
    {
      "id": 55,
      "start": 836.8799896240234,
      "end": 840.6799926757812,
      "text": " and notice what Peter says at the beginning of this book, again, under the inspiration"
    },
    {
      "id": 56,
      "start": 840.6799926757812,
      "end": 845.8799896240234,
      "text": " of the Holy Spirit of God, notice what the Bible says in verse number 3, according as"
    },
    {
      "id": 57,
      "start": 845.8799896240234,
      "end": 854.7199859619141,
      "text": " His divine power, notice what it says, hath given unto us all things that pertain unto"
    },
    {
      "id": 58,
      "start": 854.7199859619141,
      "end": 862.4400024414062,
      "text": " life and godliness, through the knowledge of Him that hath called us to glory and virtue."
    },
    {
      "id": 59,
      "start": 862.4400024414062,
      "end": 866.7999877929688,
      "text": " I'm thankful that God's given us all things that pertain unto life and godliness."
    },
    {
      "id": 60,
      "start": 866.7999877929688,
      "end": 872.8599853515625,
      "text": " I'm thankful the Bible says, according as His divine power hath given unto us all things"
    },
    {
      "id": 61,
      "start": 872.8599853515625,
      "end": 877.97998046875,
      "text": " that pertain unto life and godliness, and we find that in verse number 4, He says, whereby"
    },
    {
      "id": 62,
      "start": 877.97998046875,
      "end": 885.739990234375,
      "text": " are given unto us exceeding great and precious promises, that by these ye might be partakers"
    },
    {
      "id": 63,
      "start": 885.739990234375,
      "end": 890.7799987792969,
      "text": " of the divine nature, having escaped the corruption that is in the world through lust."
    },
    {
      "id": 64,
      "start": 890.7799987792969,
      "end": 895.2200012207031,
      "text": " Now let me ask you, in verse number 4, as we look at this, how is it this morning that"
    },
    {
      "id": 65,
      "start": 895.2200012207031,
      "end": 901.0599975585938,
      "text": " we know about these exceeding great and precious promises that God has given?"
    },
    {
      "id": 66,
      "start": 901.0599975585938,
      "end": 904.5,
      "text": " He's recorded them for us in the Word of God."
    },
    {
      "id": 67,
      "start": 904.5,
      "end": 908.2999877929688,
      "text": " Oftentimes we'll sing the song, Standing on the Promises, and what a great song it is,"
    },
    {
      "id": 68,
      "start": 908.2999877929688,
      "end": 913.0999755859375,
      "text": " and as we sing that song, we're reminded, perhaps, our minds as we're singing and meditating"
    },
    {
      "id": 69,
      "start": 913.0999755859375,
      "end": 918.0599975585938,
      "text": " upon the words of that song, our minds are filled with promises from God's Word."
    },
    {
      "id": 70,
      "start": 918.0599975585938,
      "end": 922.0599975585938,
      "text": " In fact, there are times that in our service, when we sing that song, that I'll come to"
    },
    {
      "id": 71,
      "start": 922.0599975585938,
      "end": 925.8599853515625,
      "text": " the pulpit and I'll say, who's got a promise that they're thankful for?"
    },
    {
      "id": 72,
      "start": 925.8599853515625,
      "end": 928.8999938964844,
      "text": " And someone will share a promise, and another promise, and another promise."
    },
    {
      "id": 73,
      "start": 928.8999938964844,
      "end": 934.1399841308594,
      "text": " Listen, I'm thankful that God said, for whosoever shall call upon the name of the Lord shall"
    },
    {
      "id": 74,
      "start": 934.1399841308594,
      "end": 935.1399841308594,
      "text": " be saved."
    },
    {
      "id": 75,
      "start": 935.1399841308594,
      "end": 939.2200012207031,
      "text": " That's a wonderful promise in Romans chapter 10 and verse number 13, and we ought to be"
    },
    {
      "id": 76,
      "start": 939.2200012207031,
      "end": 944.6599731445312,
      "text": " grateful for that, but the reality is that God has given us so many promises, and as"
    },
    {
      "id": 77,
      "start": 944.6599731445312,
      "end": 950.739990234375,
      "text": " we look into God's precious Word, we read of those promises and we can say, yes, they're"
    },
    {
      "id": 78,
      "start": 950.739990234375,
      "end": 954.8199768066406,
      "text": " exceeding great and precious."
    },
    {
      "id": 79,
      "start": 954.8199768066406,
      "end": 960.8999938964844,
      "text": " This morning, in Sunday school, someone said, I'm thankful that God's always with us."
    },
    {
      "id": 80,
      "start": 960.8999938964844,
      "end": 963.8599853515625,
      "text": " He said, I will never leave thee nor forsake thee."
    },
    {
      "id": 81,
      "start": 963.8599853515625,
      "end": 966.97998046875,
      "text": " It's a precious promise."
    },
    {
      "id": 82,
      "start": 966.97998046875,
      "end": 971.2200012207031,
      "text": " What about this promise in John 14 when he says, I will come again?"
    },
    {
      "id": 83,
      "start": 971.2200012207031,
      "end": 974.6599731445312,
      "text": " Aren't you thankful that Jesus is coming again?"
    },
    {
      "id": 84,
      "start": 974.6599731445312,
      "end": 981.1799926757812,
      "text": " I mean, we could spend the remainder of our time this morning speaking about the promises"
    },
    {
      "id": 85,
      "start": 981.1799926757812,
      "end": 985.0599975585938,
      "text": " that God has given, but as we're looking at this passage of Scripture and considering"
    },
    {
      "id": 86,
      "start": 985.0599975585938,
      "end": 991.0999755859375,
      "text": " this more sure Word and the sufficiency of God's Word that Peter says to these believers"
    },
    {
      "id": 87,
      "start": 991.0999755859375,
      "end": 995.2799987792969,
      "text": " in the beginning of this passage of Scripture, he says, listen, God's given us all things"
    },
    {
      "id": 88,
      "start": 995.2799987792969,
      "end": 997.6199951171875,
      "text": " that pertain unto life and godliness."
    },
    {
      "id": 89,
      "start": 997.6199951171875,
      "end": 1004.1799926757812,
      "text": " He's given us exceeding great and precious promises, and how thankful we ought to be."
    },
    {
      "id": 90,
      "start": 1004.1799926757812,
      "end": 1009.2599792480469,
      "text": " But notice he says this also at the end of verse number four, having escaped the corruption"
    },
    {
      "id": 91,
      "start": 1009.2599792480469,
      "end": 1010.97998046875,
      "text": " that is in the world through lust."
    },
    {
      "id": 92,
      "start": 1010.97998046875,
      "end": 1012.6199951171875,
      "text": " How do we escape that corruption?"
    },
    {
      "id": 93,
      "start": 1012.6199951171875,
      "end": 1017.2599792480469,
      "text": " Again, through the cleansing of God's Word."
    },
    {
      "id": 94,
      "start": 1017.2599792480469,
      "end": 1022.3399963378906,
      "text": " You read the book of Ephesians, and you read about the cleansing of the Word in the fifth"
    },
    {
      "id": 95,
      "start": 1022.3399963378906,
      "end": 1026.8599853515625,
      "text": " chapter, and what a blessing to think about the fact that we can escape that corruption"
    },
    {
      "id": 96,
      "start": 1026.8599853515625,
      "end": 1027.8599853515625,
      "text": " that is in the world."
    },
    {
      "id": 97,
      "start": 1027.8599853515625,
      "end": 1032.0999755859375,
      "text": " Listen, we acknowledge this morning that there's corruption in the world."
    },
    {
      "id": 98,
      "start": 1032.0999755859375,
      "end": 1034.6999816894531,
      "text": " We can escape that corruption that is in the world."
    },
    {
      "id": 99,
      "start": 1034.6999816894531,
      "end": 1035.6999816894531,
      "text": " Why?"
    },
    {
      "id": 100,
      "start": 1035.6999816894531,
      "end": 1038.1799926757812,
      "text": " Because God's given us a book, the Bible."
    },
    {
      "id": 101,
      "start": 1038.1799926757812,
      "end": 1039.1799926757812,
      "text": " The Bible is sufficient."
    },
    {
      "id": 102,
      "start": 1039.1799926757812,
      "end": 1045.4400024414062,
      "text": " Turn over to the book of Luke, if you will."
    },
    {
      "id": 103,
      "start": 1045.4400024414062,
      "end": 1051.8999938964844,
      "text": " No doubt as you're turning to the book of Luke, Peter knew, and those that he's writing"
    },
    {
      "id": 104,
      "start": 1051.8999938964844,
      "end": 1058.8599853515625,
      "text": " to in 2 Peter were familiar with the first epistle that he wrote to them."
    },
    {
      "id": 105,
      "start": 1058.8599853515625,
      "end": 1063.8599853515625,
      "text": " And of course, in that particular epistle, as we studied last week in chapter one in"
    },
    {
      "id": 106,
      "start": 1063.8599853515625,
      "end": 1070.3199768066406,
      "text": " verse 23 and 25, he spoke about the Word of God, which liveth and abideth forever."
    },
    {
      "id": 107,
      "start": 1070.3199768066406,
      "end": 1075.0199890136719,
      "text": " And as he spoke of that in the first epistle, then in the second epistle he's saying we"
    },
    {
      "id": 108,
      "start": 1075.0199890136719,
      "end": 1078.5399780273438,
      "text": " have a more sure Word."
    },
    {
      "id": 109,
      "start": 1078.5399780273438,
      "end": 1082.739990234375,
      "text": " He's helping these believers to understand the sufficiency of God's Word."
    },
    {
      "id": 110,
      "start": 1082.739990234375,
      "end": 1085.7799987792969,
      "text": " Look in the book of Luke, if you will, in the 16th chapter, beginning in verse number"
    },
    {
      "id": 111,
      "start": 1085.7799987792969,
      "end": 1086.7799987792969,
      "text": " 19."
    },
    {
      "id": 112,
      "start": 1086.7799987792969,
      "end": 1094.6599731445312,
      "text": " In Luke 16, in verse number 19, this is what the Bible says, and there was a certain rich"
    },
    {
      "id": 113,
      "start": 1094.6599731445312,
      "end": 1101.1399841308594,
      "text": " man which was clothed in purple and fine linen and fared sumptuously every day."
    },
    {
      "id": 114,
      "start": 1101.1399841308594,
      "end": 1106.8199768066406,
      "text": " There was a certain beggar named Lazarus which was laid at his gate full of sores."
    },
    {
      "id": 115,
      "start": 1106.8199768066406,
      "end": 1110.5399780273438,
      "text": " Desiring to be fed with the crumbs which fell from the rich man's table, moreover, the dogs"
    },
    {
      "id": 116,
      "start": 1110.5399780273438,
      "end": 1112.1400146484375,
      "text": " came and licked his sores."
    },
    {
      "id": 117,
      "start": 1112.1400146484375,
      "end": 1117.4599609375,
      "text": " And it came to pass, in verse 22, the Bible says, the beggar died and was carried by the"
    },
    {
      "id": 118,
      "start": 1117.4599609375,
      "end": 1118.8999633789062,
      "text": " angels in Abraham's bosom."
    },
    {
      "id": 119,
      "start": 1118.8999633789062,
      "end": 1120.5,
      "text": " The rich man also died and was buried."
    },
    {
      "id": 120,
      "start": 1120.5,
      "end": 1124.4199829101562,
      "text": " Now, let me say this, and I'm not preaching from this entire passage this morning, I'm"
    },
    {
      "id": 121,
      "start": 1124.4199829101562,
      "end": 1130.0199584960938,
      "text": " using it as a reference point, but understand this morning that as of the point of demand"
    },
    {
      "id": 122,
      "start": 1130.0199584960938,
      "end": 1131.0199584960938,
      "text": " wants to die."
    },
    {
      "id": 123,
      "start": 1131.0199584960938,
      "end": 1132.7000122070312,
      "text": " And after this, the judgment."
    },
    {
      "id": 124,
      "start": 1132.7000122070312,
      "end": 1134.5800170898438,
      "text": " The beggar died and the rich man died."
    },
    {
      "id": 125,
      "start": 1134.5800170898438,
      "end": 1135.97998046875,
      "text": " The Bible tells us that."
    },
    {
      "id": 126,
      "start": 1135.97998046875,
      "end": 1138.5800170898438,
      "text": " Listen, every person is going to die."
    },
    {
      "id": 127,
      "start": 1138.5800170898438,
      "end": 1144.3399658203125,
      "text": " As we look here and we notice the Bible says that, speaking of the beggar that he was carried"
    },
    {
      "id": 128,
      "start": 1144.3399658203125,
      "end": 1148.4599609375,
      "text": " by the angels in Abraham's bosom, and then it says that the rich man also died and was"
    },
    {
      "id": 129,
      "start": 1148.4599609375,
      "end": 1150.4199829101562,
      "text": " buried and in hell he lifted up his eyes."
    },
    {
      "id": 130,
      "start": 1150.4199829101562,
      "end": 1155.4199829101562,
      "text": " I want you to understand this, that the poor man, the beggar, he didn't go to Abraham's"
    },
    {
      "id": 131,
      "start": 1155.4199829101562,
      "end": 1158.4599609375,
      "text": " bosom because he was poor."
    },
    {
      "id": 132,
      "start": 1158.4599609375,
      "end": 1162.3399658203125,
      "text": " Nor did the rich man go to hell because he was rich."
    },
    {
      "id": 133,
      "start": 1162.3399658203125,
      "end": 1167.2999877929688,
      "text": " We find that what determines our eternal destination is what we do with Christ."
    },
    {
      "id": 134,
      "start": 1167.2999877929688,
      "end": 1171.739990234375,
      "text": " And whether we accept the Lord Jesus Christ as our personal Savior."
    },
    {
      "id": 135,
      "start": 1171.739990234375,
      "end": 1175.2999877929688,
      "text": " Understanding that I'm a sinner in need of the Savior, and He is the only Savior, and"
    },
    {
      "id": 136,
      "start": 1175.2999877929688,
      "end": 1176.2999877929688,
      "text": " we understand that."
    },
    {
      "id": 137,
      "start": 1176.2999877929688,
      "end": 1181.2999877929688,
      "text": " Listen, the law in life for these individuals, the one being a beggar and the one being rich,"
    },
    {
      "id": 138,
      "start": 1181.2999877929688,
      "end": 1184.9400024414062,
      "text": " has zero to do with where they end up in eternity."
    },
    {
      "id": 139,
      "start": 1184.9400024414062,
      "end": 1189.4599609375,
      "text": " God's providing with us the backdrop and helping us understand this, and it's important for"
    },
    {
      "id": 140,
      "start": 1189.4599609375,
      "end": 1191.1400146484375,
      "text": " us to recognize that truth."
    },
    {
      "id": 141,
      "start": 1191.1400146484375,
      "end": 1195.0199584960938,
      "text": " It tells us that in hell he lift up his eyes, in verse 23, being in torments, and seeth"
    },
    {
      "id": 142,
      "start": 1195.0199584960938,
      "end": 1199.3800048828125,
      "text": " Abraham afar off, and Lazarus in his bosom, and he cried and said, Father Abraham, have"
    },
    {
      "id": 143,
      "start": 1199.3800048828125,
      "end": 1199.8200073242188,
      "text": " mercy on me."
    },
    {
      "id": 0,
      "start": 1199.8200073242188,
      "end": 1203.9400072097778,
      "text": " on me, and send Lazarus, that he may dip the tip of his finger in water, and cool my tongue."
    },
    {
      "id": 1,
      "start": 1203.9400072097778,
      "end": 1207.2600073814392,
      "text": " Notice what he says, for I am tormented in this flame."
    },
    {
      "id": 2,
      "start": 1207.2600073814392,
      "end": 1210.3800077438354,
      "text": " Next time somebody tells you that they're going to go to hell and they're going to enjoy"
    },
    {
      "id": 3,
      "start": 1210.3800077438354,
      "end": 1213.4200077056885,
      "text": " it and have a party, you just remind them of Luke 16."
    },
    {
      "id": 4,
      "start": 1213.4200077056885,
      "end": 1216.3400077819824,
      "text": " I've had many people tell me that over the years."
    },
    {
      "id": 5,
      "start": 1216.3400077819824,
      "end": 1219.4600067138672,
      "text": " It's a lie of the devil."
    },
    {
      "id": 6,
      "start": 1219.4600067138672,
      "end": 1223.1800079345703,
      "text": " Hell is a terrible place."
    },
    {
      "id": 7,
      "start": 1223.1800079345703,
      "end": 1226.640007019043,
      "text": " The Bible tells us in verse 25, but Abraham said, Son, remember that thou in thy lifetime"
    },
    {
      "id": 8,
      "start": 1226.640007019043,
      "end": 1229.720006942749,
      "text": " receivest thy good things, and likewise Lazarus evil things."
    },
    {
      "id": 9,
      "start": 1229.720006942749,
      "end": 1231.800006866455,
      "text": " But now he is comforted, and thou art tormented."
    },
    {
      "id": 10,
      "start": 1231.800006866455,
      "end": 1235.9600067138672,
      "text": " And beside all this, between us and you, there's a great gulf thick, so that they which would"
    },
    {
      "id": 11,
      "start": 1235.9600067138672,
      "end": 1240.5200080871582,
      "text": " pass from hence to you cannot, neither can they pass to us that would come from thence."
    },
    {
      "id": 12,
      "start": 1240.5200080871582,
      "end": 1247.240005493164,
      "text": " Verse 26 helps us to understand the fact that what you do with Christ in this life, once"
    },
    {
      "id": 13,
      "start": 1247.240005493164,
      "end": 1249.7600059509277,
      "text": " you die, it's too late."
    },
    {
      "id": 14,
      "start": 1249.7600059509277,
      "end": 1253.800006866455,
      "text": " I've often said from the book of Philippians, the Bible says that every knee should bow"
    },
    {
      "id": 15,
      "start": 1253.800006866455,
      "end": 1256.200008392334,
      "text": " and every tongue should confess."
    },
    {
      "id": 16,
      "start": 1256.7600059509277,
      "end": 1259.0000076293945,
      "text": " And I've said this often as I've looked at that passage of Scripture, it's not a matter"
    },
    {
      "id": 17,
      "start": 1259.0000076293945,
      "end": 1261.0400085449219,
      "text": " of if, it's a matter of when."
    },
    {
      "id": 18,
      "start": 1261.0400085449219,
      "end": 1263.4400062561035,
      "text": " And when makes all the difference."
    },
    {
      "id": 19,
      "start": 1263.4400062561035,
      "end": 1267.6000061035156,
      "text": " It says in verse number 27, then he said, I pray thee, therefore, Father, that thou"
    },
    {
      "id": 20,
      "start": 1267.6000061035156,
      "end": 1270.9600067138672,
      "text": " wouldest send him to my father's house."
    },
    {
      "id": 21,
      "start": 1270.9600067138672,
      "end": 1275.5600051879883,
      "text": " Now it's very interesting as we look at the end of chapter 16, the concern of this rich"
    },
    {
      "id": 22,
      "start": 1275.5600051879883,
      "end": 1276.5600051879883,
      "text": " man."
    },
    {
      "id": 23,
      "start": 1276.5600051879883,
      "end": 1280.1200103759766,
      "text": " Initially, the concern of the rich man is his own comfort."
    },
    {
      "id": 24,
      "start": 1280.1200103759766,
      "end": 1285.760009765625,
      "text": " He's tormented in this flame and he's desiring that there'd be opportunity for the tip of"
    },
    {
      "id": 25,
      "start": 1286.3200073242188,
      "end": 1290.8800048828125,
      "text": " the finger of this beggar to be in water and to cool his tongue."
    },
    {
      "id": 26,
      "start": 1290.8800048828125,
      "end": 1295.3200073242188,
      "text": " But we find that after he finds out that it's just not possible, that he says, listen, I"
    },
    {
      "id": 27,
      "start": 1295.3200073242188,
      "end": 1300.8400039672852,
      "text": " pray thee, therefore, Father, that thou wouldest send him to my father's house."
    },
    {
      "id": 28,
      "start": 1300.8400039672852,
      "end": 1301.8400039672852,
      "text": " Why?"
    },
    {
      "id": 29,
      "start": 1301.8400039672852,
      "end": 1313.1200103759766,
      "text": " For I have five brethren that he may testify unto them, lest they also come into this place"
    },
    {
      "id": 30,
      "start": 1313.1200103759766,
      "end": 1317.9200057983398,
      "text": " of torment."
    },
    {
      "id": 31,
      "start": 1317.9200057983398,
      "end": 1323.360008239746,
      "text": " The truth of verse number 28 should be impactful in our lives."
    },
    {
      "id": 32,
      "start": 1323.360008239746,
      "end": 1325.9000091552734,
      "text": " This rich man died."
    },
    {
      "id": 33,
      "start": 1325.9000091552734,
      "end": 1331.6400146484375,
      "text": " Because he had not trusted the Lord Jesus Christ as his personal Savior, he's in hell."
    },
    {
      "id": 34,
      "start": 1331.6400146484375,
      "end": 1341.0800018310547,
      "text": " The Bible tells us that he's got great concern for his brethren, lest they come into this"
    },
    {
      "id": 35,
      "start": 1341.0800018310547,
      "end": 1344.7200012207031,
      "text": " place of torment."
    },
    {
      "id": 36,
      "start": 1344.7200012207031,
      "end": 1347.760009765625,
      "text": " He knew his brothers."
    },
    {
      "id": 37,
      "start": 1347.760009765625,
      "end": 1353.7200012207031,
      "text": " Seems quite obvious to me that he knew that they were headed to the same destination and"
    },
    {
      "id": 38,
      "start": 1353.7200012207031,
      "end": 1356.0800018310547,
      "text": " had a great concern for them."
    },
    {
      "id": 39,
      "start": 1356.0800018310547,
      "end": 1362.9600067138672,
      "text": " Verse 29, notice what the Bible says, Abraham saith unto him, they, the five brothers from"
    },
    {
      "id": 40,
      "start": 1362.9600067138672,
      "end": 1368.9200134277344,
      "text": " verse 28, they have Moses and the prophets."
    },
    {
      "id": 41,
      "start": 1368.9200134277344,
      "end": 1372.4400024414062,
      "text": " Let them hear them."
    },
    {
      "id": 42,
      "start": 1372.4400024414062,
      "end": 1376.280014038086,
      "text": " What is he saying in verse 29?"
    },
    {
      "id": 43,
      "start": 1376.280014038086,
      "end": 1378.6800079345703,
      "text": " They have the Scriptures."
    },
    {
      "id": 44,
      "start": 1378.6800079345703,
      "end": 1380.6400146484375,
      "text": " They have the Word of God."
    },
    {
      "id": 45,
      "start": 1380.6400146484375,
      "end": 1384.6400146484375,
      "text": " Remember in the book of 2 Timothy, we looked at it two weeks ago that all Scripture is"
    },
    {
      "id": 46,
      "start": 1384.6400146484375,
      "end": 1386.260009765625,
      "text": " given by inspiration of God."
    },
    {
      "id": 47,
      "start": 1386.260009765625,
      "end": 1389.4800109863281,
      "text": " But before that, we find that Paul says to Timothy that from a child thou hast known"
    },
    {
      "id": 48,
      "start": 1389.4800109863281,
      "end": 1394.4000091552734,
      "text": " the Holy Scriptures, which are able to make thee wise unto salvation."
    },
    {
      "id": 49,
      "start": 1394.4000091552734,
      "end": 1397.4400024414062,
      "text": " And then he says all Scripture is given by inspiration of God, is profitable for doctrine,"
    },
    {
      "id": 50,
      "start": 1397.4400024414062,
      "end": 1400.760009765625,
      "text": " for reproof, for correction, for instruction in righteousness, that the man of God might"
    },
    {
      "id": 51,
      "start": 1400.760009765625,
      "end": 1404.3600006103516,
      "text": " be perfect, truly furnished unto all good works."
    },
    {
      "id": 52,
      "start": 1404.3600006103516,
      "end": 1411.0400085449219,
      "text": " And so we find that here, that Abraham's response to this man, he wants this beggar that's died,"
    },
    {
      "id": 53,
      "start": 1411.0400085449219,
      "end": 1416.6400146484375,
      "text": " he wants him to go back to his brother's house, and Abraham says, no, they have the Scriptures."
    },
    {
      "id": 54,
      "start": 1416.6400146484375,
      "end": 1418.760009765625,
      "text": " They have Moses and the prophets."
    },
    {
      "id": 55,
      "start": 1418.760009765625,
      "end": 1419.8000030517578,
      "text": " Let them hear them."
    },
    {
      "id": 56,
      "start": 1419.8000030517578,
      "end": 1424.4000091552734,
      "text": " Notice the response in verse 30, and he said, nay, father Abraham, but if one went unto"
    },
    {
      "id": 57,
      "start": 1424.4000091552734,
      "end": 1427.8400115966797,
      "text": " them from the dead, they will repent."
    },
    {
      "id": 58,
      "start": 1427.8400115966797,
      "end": 1432.6000061035156,
      "text": " Now I think he believed that."
    },
    {
      "id": 59,
      "start": 1432.6000061035156,
      "end": 1435.4400024414062,
      "text": " I want you to notice how the text ends."
    },
    {
      "id": 60,
      "start": 1435.4400024414062,
      "end": 1444.0400085449219,
      "text": " And he said unto him, if they hear not Moses and the prophets, neither will they be persuaded"
    },
    {
      "id": 61,
      "start": 1444.0400085449219,
      "end": 1447.4400024414062,
      "text": " the one rose from the dead."
    },
    {
      "id": 62,
      "start": 1447.4400024414062,
      "end": 1454.9200134277344,
      "text": " A lot of people today looking for some great miracle, kind of like Naaman."
    },
    {
      "id": 63,
      "start": 1454.9200134277344,
      "end": 1461.8800048828125,
      "text": " But God said, my word is sufficient, and I've given my word."
    },
    {
      "id": 64,
      "start": 1461.8800048828125,
      "end": 1467.4800109863281,
      "text": " And Peter, though he had walked with the Lord Jesus Christ, though he had been at the Mount"
    },
    {
      "id": 65,
      "start": 1467.4800109863281,
      "end": 1473.0800170898438,
      "text": " of Transfiguration, though he had heard the voice of God, he understood that his time"
    },
    {
      "id": 66,
      "start": 1473.0800170898438,
      "end": 1476.7400207519531,
      "text": " on earth was coming to an end."
    },
    {
      "id": 67,
      "start": 1476.7400207519531,
      "end": 1482.8200073242188,
      "text": " And he says to these believers that I want to remind you of some things, I want to teach"
    },
    {
      "id": 68,
      "start": 1482.8200073242188,
      "end": 1485.4200134277344,
      "text": " you some things, I want to give you the truth."
    },
    {
      "id": 69,
      "start": 1485.4200134277344,
      "end": 1486.4200134277344,
      "text": " Why?"
    },
    {
      "id": 70,
      "start": 1486.4200134277344,
      "end": 1491.1400146484375,
      "text": " Because after I'm departed, after my decease, I want you to be able to remember and to continue."
    },
    {
      "id": 71,
      "start": 1491.1400146484375,
      "end": 1498.9800109863281,
      "text": " And we find that, he says, we have also a more sure word of prophecy."
    },
    {
      "id": 72,
      "start": 1498.9800109863281,
      "end": 1504.4600219726562,
      "text": " I can imagine, I've alluded to this already this morning, but I can imagine how there"
    },
    {
      "id": 73,
      "start": 1504.4600219726562,
      "end": 1512.260009765625,
      "text": " were some that would like to just hear Peter because of what he had experienced, because"
    },
    {
      "id": 74,
      "start": 1512.260009765625,
      "end": 1516.3000183105469,
      "text": " of what his life experience had been."
    },
    {
      "id": 75,
      "start": 1516.3000183105469,
      "end": 1522.7000122070312,
      "text": " But we find that Peter says we have also a more sure word of prophecy."
    },
    {
      "id": 76,
      "start": 1522.7000122070312,
      "end": 1526.2200012207031,
      "text": " We note this morning the sufficiency of God's word."
    },
    {
      "id": 77,
      "start": 1526.2200012207031,
      "end": 1531.8200073242188,
      "text": " Number two, I want you to consider with me the superiority of God's word."
    },
    {
      "id": 78,
      "start": 1531.8200073242188,
      "end": 1533.5400085449219,
      "text": " God's word is superior."
    },
    {
      "id": 79,
      "start": 1533.6199951171875,
      "end": 1537.5800170898438,
      "text": " Of course, we find the Bible says we have also, picking up in verse 19, back in 2 Peter"
    },
    {
      "id": 80,
      "start": 1537.5800170898438,
      "end": 1543.1000061035156,
      "text": " chapter number 1, we have also a more sure word of prophecy, whereunto you do well that"
    },
    {
      "id": 81,
      "start": 1543.1000061035156,
      "end": 1547.4200134277344,
      "text": " you take heed, as unto a light that shineth in a dark place unto the day dawn and the"
    },
    {
      "id": 82,
      "start": 1547.4200134277344,
      "end": 1549.5400085449219,
      "text": " day star arise in your hearts."
    },
    {
      "id": 83,
      "start": 1549.5400085449219,
      "end": 1552.3399963378906,
      "text": " By the way, the end of verse number 19 is going to be the subject matter that we'll"
    },
    {
      "id": 84,
      "start": 1552.3399963378906,
      "end": 1554.02001953125,
      "text": " deal with next week."
    },
    {
      "id": 85,
      "start": 1554.02001953125,
      "end": 1558.9800109863281,
      "text": " Now that we understand that God's given his word by inspiration, he's promised to preserve"
    },
    {
      "id": 86,
      "start": 1558.9800109863281,
      "end": 1565.4600219726562,
      "text": " his word, we have a more sure word, what's my approach to this book?"
    },
    {
      "id": 87,
      "start": 1565.4600219726562,
      "end": 1571.1400146484375,
      "text": " How do those truths that we've just established over these last few weeks, how do those truths"
    },
    {
      "id": 88,
      "start": 1571.1400146484375,
      "end": 1574.9800109863281,
      "text": " impact my approach to the word of God?"
    },
    {
      "id": 89,
      "start": 1574.9800109863281,
      "end": 1580.9800109863281,
      "text": " And we find that verse 20, he says, knowing this first, that no prophecy of the scripture"
    },
    {
      "id": 90,
      "start": 1580.9800109863281,
      "end": 1585.3399963378906,
      "text": " is of any private interpretation, for the prophecy came not in old time by the will"
    },
    {
      "id": 91,
      "start": 1585.3399963378906,
      "end": 1590.4400024414062,
      "text": " of man, but holy men of God spake as they were moved by the Holy Ghost."
    },
    {
      "id": 92,
      "start": 1590.4400024414062,
      "end": 1595.5,
      "text": " The word of God is superior because it is given by inspiration and is providentially"
    },
    {
      "id": 93,
      "start": 1595.5,
      "end": 1596.5,
      "text": " preserved."
    },
    {
      "id": 94,
      "start": 1596.5,
      "end": 1598.3800048828125,
      "text": " We see that in verse 20 and 21."
    },
    {
      "id": 95,
      "start": 1598.3800048828125,
      "end": 1602.8600158691406,
      "text": " The reality this morning is that when we think about this truth that says that no prophecy"
    },
    {
      "id": 96,
      "start": 1602.8600158691406,
      "end": 1606.9800109863281,
      "text": " of scripture is of any private interpretation, the prophecy came not in old time by the will"
    },
    {
      "id": 97,
      "start": 1606.9800109863281,
      "end": 1607.9800109863281,
      "text": " of man."
    },
    {
      "id": 98,
      "start": 1607.9800109863281,
      "end": 1611.02001953125,
      "text": " I've said this before, Isaiah didn't just decide he was going to sit down and write"
    },
    {
      "id": 99,
      "start": 1611.02001953125,
      "end": 1612.02001953125,
      "text": " scripture."
    },
    {
      "id": 100,
      "start": 1612.02001953125,
      "end": 1615.260009765625,
      "text": " Ezekiel didn't just decide he was going to sit down and write scripture."
    },
    {
      "id": 101,
      "start": 1615.260009765625,
      "end": 1621.1400146484375,
      "text": " No, the Holy Spirit, the Holy Ghost moved these men and they spake as they were moved"
    },
    {
      "id": 102,
      "start": 1621.1400146484375,
      "end": 1623.4200134277344,
      "text": " by the Holy Ghost."
    },
    {
      "id": 103,
      "start": 1623.4200134277344,
      "end": 1627.1000061035156,
      "text": " And it's all scripture is given by inspiration of God."
    },
    {
      "id": 104,
      "start": 1627.1000061035156,
      "end": 1632.2200012207031,
      "text": " And that in itself is what sets the Bible apart from any other book."
    },
    {
      "id": 105,
      "start": 1632.2200012207031,
      "end": 1637.8200073242188,
      "text": " That's why we find that Peter is saying we have also a more sure word."
    },
    {
      "id": 106,
      "start": 1637.8200073242188,
      "end": 1642.9200134277344,
      "text": " Not only is the Bible sufficient, but the Bible is superior."
    },
    {
      "id": 107,
      "start": 1642.9200134277344,
      "end": 1648.52001953125,
      "text": " When we look to the truth that's contained within this book and we rest in the truth"
    },
    {
      "id": 108,
      "start": 1648.52001953125,
      "end": 1650.9200134277344,
      "text": " that's contained within this book, why?"
    },
    {
      "id": 109,
      "start": 1650.9200134277344,
      "end": 1653.2000122070312,
      "text": " Because it's God's word."
    },
    {
      "id": 110,
      "start": 1653.2000122070312,
      "end": 1654.2000122070312,
      "text": " And it's superior."
    },
    {
      "id": 111,
      "start": 1654.2000122070312,
      "end": 1661.0,
      "text": " Listen, when you have thoughts in your mind, when you have ideas, when you have philosophies,"
    },
    {
      "id": 112,
      "start": 1661.0,
      "end": 1668.3999938964844,
      "text": " you better bring those things into agreement with God's word because God's word is superior."
    },
    {
      "id": 113,
      "start": 1668.3999938964844,
      "end": 1674.6799926757812,
      "text": " See when my philosophy, when my worldview is wrong, when I'm in error, I must get into"
    },
    {
      "id": 114,
      "start": 1674.6799926757812,
      "end": 1680.0400085449219,
      "text": " the Bible to have that corrected so that I have a biblical perspective, so that I have"
    },
    {
      "id": 115,
      "start": 1680.0400085449219,
      "end": 1683.7400207519531,
      "text": " a biblical foundation."
    },
    {
      "id": 116,
      "start": 1683.7400207519531,
      "end": 1687.9200134277344,
      "text": " As we look at this passage of scripture and we think about the word of God being superior,"
    },
    {
      "id": 117,
      "start": 1687.9200134277344,
      "end": 1692.1600036621094,
      "text": " we understand that it's superior because of what it is, because of it being God's word."
    },
    {
      "id": 118,
      "start": 1692.1600036621094,
      "end": 1698.0599975585938,
      "text": " But I want you to notice from the text of scripture two thoughts with regard to God's"
    },
    {
      "id": 119,
      "start": 1698.2200012207031,
      "end": 1699.2200012207031,
      "text": " word being superior."
    },
    {
      "id": 120,
      "start": 1699.2200012207031,
      "end": 1703.7799987792969,
      "text": " I would say this, God's word is superior to leadership."
    },
    {
      "id": 121,
      "start": 1703.7799987792969,
      "end": 1706.6199951171875,
      "text": " The word of God is superior to leadership."
    },
    {
      "id": 122,
      "start": 1706.6199951171875,
      "end": 1708.8600158691406,
      "text": " What do I mean by that?"
    },
    {
      "id": 123,
      "start": 1708.8600158691406,
      "end": 1713.780029296875,
      "text": " Well sometimes people look at a leader kind of like they would look at Peter."
    },
    {
      "id": 124,
      "start": 1713.780029296875,
      "end": 1719.9400024414062,
      "text": " And all of a sudden what that leader says begins to carry great weight, begins to have"
    },
    {
      "id": 125,
      "start": 1719.9400024414062,
      "end": 1724.02001953125,
      "text": " some level of influence in the lives of individuals."
    },
    {
      "id": 126,
      "start": 1724.02001953125,
      "end": 1728.1400146484375,
      "text": " But God's word is superior to leadership."
    },
    {
      "id": 127,
      "start": 1728.1400146484375,
      "end": 1730.5800170898438,
      "text": " God's word is superior to leadership."
    },
    {
      "id": 128,
      "start": 1730.5800170898438,
      "end": 1735.0599975585938,
      "text": " Listen, today we have people that would talk about the church fathers."
    },
    {
      "id": 129,
      "start": 1735.0599975585938,
      "end": 1737.5800170898438,
      "text": " What would they mean by that?"
    },
    {
      "id": 130,
      "start": 1737.5800170898438,
      "end": 1741.97998046875,
      "text": " Well they're meaning by individuals that have gone on before us and they reference some"
    },
    {
      "id": 131,
      "start": 1741.97998046875,
      "end": 1747.260009765625,
      "text": " of the writings of the church fathers and they'll say, well we'll reference those writings"
    },
    {
      "id": 132,
      "start": 1747.260009765625,
      "end": 1753.780029296875,
      "text": " of the church fathers and those writings have some level of credibility."
    },
    {
      "id": 133,
      "start": 1753.780029296875,
      "end": 1761.1400146484375,
      "text": " Those writings have some level of superiority with regard to whatever matter they deal with."
    },
    {
      "id": 134,
      "start": 1761.1400146484375,
      "end": 1766.1000366210938,
      "text": " But I would contend that God's word is superior."
    },
    {
      "id": 135,
      "start": 1766.1000366210938,
      "end": 1770.739990234375,
      "text": " There are some church fathers that wrote things that are consistent with what's found in the"
    },
    {
      "id": 136,
      "start": 1770.739990234375,
      "end": 1772.6600341796875,
      "text": " Bible."
    },
    {
      "id": 137,
      "start": 1772.6600341796875,
      "end": 1777.02001953125,
      "text": " But we must always take those writings and filter them through the Bible."
    },
    {
      "id": 138,
      "start": 1777.02001953125,
      "end": 1778.02001953125,
      "text": " Why?"
    },
    {
      "id": 139,
      "start": 1778.02001953125,
      "end": 1779.4600219726562,
      "text": " Because the Bible is true."
    },
    {
      "id": 140,
      "start": 1779.4600219726562,
      "end": 1780.8599853515625,
      "text": " The Bible is God's word."
    },
    {
      "id": 141,
      "start": 1780.8599853515625,
      "end": 1784.0599975585938,
      "text": " The Bible is superior to leadership."
    },
    {
      "id": 142,
      "start": 1784.0599975585938,
      "end": 1787.739990234375,
      "text": " Peter was in a place of leadership and as we've looked and we've already read the verses"
    },
    {
      "id": 143,
      "start": 1787.739990234375,
      "end": 1793.9400024414062,
      "text": " in verses 12 through 15 and thinking about his leadership and the place where God has"
    },
    {
      "id": 144,
      "start": 1793.9400024414062,
      "end": 1799.8599853515625,
      "text": " put him in this time in his life and he says, listen, as he's pointing these beliefs."
    },
    {
      "id": 0,
      "start": 1799.8599853515625,
      "end": 1805.839985370636,
      "text": " believers to the more sure word of prophecy, to the word of God, he's saying, listen, the"
    },
    {
      "id": 1,
      "start": 1805.839985370636,
      "end": 1810.1999855041504,
      "text": " Bible is superior to me as a leader."
    },
    {
      "id": 2,
      "start": 1810.1999855041504,
      "end": 1815.2399854660034,
      "text": " There are leaders that go astray."
    },
    {
      "id": 3,
      "start": 1815.2399854660034,
      "end": 1818.559986114502,
      "text": " There are churches that go astray."
    },
    {
      "id": 4,
      "start": 1818.559986114502,
      "end": 1821.7999858856201,
      "text": " It happens."
    },
    {
      "id": 5,
      "start": 1821.7999858856201,
      "end": 1826.159984588623,
      "text": " They leave this book."
    },
    {
      "id": 6,
      "start": 1826.159984588623,
      "end": 1833.0399856567383,
      "text": " If a leader, if I, as the pastor of Fellowship Baptist Church, begin teaching something that"
    },
    {
      "id": 7,
      "start": 1833.0399856567383,
      "end": 1839.2799835205078,
      "text": " is contrary to this book, this book is superior to leadership."
    },
    {
      "id": 8,
      "start": 1839.2799835205078,
      "end": 1842.7999839782715,
      "text": " And you ought to get a new leader, amen?"
    },
    {
      "id": 9,
      "start": 1842.7999839782715,
      "end": 1846.0399856567383,
      "text": " And that's me as the pastor saying that."
    },
    {
      "id": 10,
      "start": 1846.0399856567383,
      "end": 1854.8799858093262,
      "text": " What happens so often is churches get hijacked, is the term that I'll use, and as they get"
    },
    {
      "id": 11,
      "start": 1854.8799858093262,
      "end": 1860.999984741211,
      "text": " hijacked, good, solid people within those churches say, well, I guess we're going to"
    },
    {
      "id": 12,
      "start": 1860.999984741211,
      "end": 1863.2799835205078,
      "text": " go find another church."
    },
    {
      "id": 13,
      "start": 1863.2799835205078,
      "end": 1867.1999816894531,
      "text": " And they allow the church to be hijacked."
    },
    {
      "id": 14,
      "start": 1867.1999816894531,
      "end": 1871.0799865722656,
      "text": " But the Bible is superior to leadership."
    },
    {
      "id": 15,
      "start": 1871.0799865722656,
      "end": 1872.4399871826172,
      "text": " We use the King James Bible."
    },
    {
      "id": 16,
      "start": 1872.4399871826172,
      "end": 1873.9199829101562,
      "text": " There's an issue going on right now in America."
    },
    {
      "id": 17,
      "start": 1873.9199829101562,
      "end": 1875.1599884033203,
      "text": " I'm not sure if you're aware of it."
    },
    {
      "id": 18,
      "start": 1875.1599884033203,
      "end": 1879.719985961914,
      "text": " There's an issue over the King James Bible right now that's probably as big as it was"
    },
    {
      "id": 19,
      "start": 1879.719985961914,
      "end": 1881.719985961914,
      "text": " 50 years ago."
    },
    {
      "id": 20,
      "start": 1881.719985961914,
      "end": 1885.6799850463867,
      "text": " For a long period of time, the King James Bible kind of battle kind of simmered a little"
    },
    {
      "id": 21,
      "start": 1885.6799850463867,
      "end": 1891.6399841308594,
      "text": " bit broadly speaking, but we've got a group of people today, I mean, this just happened"
    },
    {
      "id": 22,
      "start": 1891.6399841308594,
      "end": 1899.1999816894531,
      "text": " two weeks ago, group of people today that are taking churches like ours that are King"
    },
    {
      "id": 23,
      "start": 1899.1999816894531,
      "end": 1905.5599822998047,
      "text": " James and they're leading them to a different modern translation."
    },
    {
      "id": 24,
      "start": 1905.5599822998047,
      "end": 1912.2799835205078,
      "text": " And then they had, on February 8th and 9th, I think it was, they had a conference and"
    },
    {
      "id": 25,
      "start": 1912.2799835205078,
      "end": 1917.7999877929688,
      "text": " invited other pastors to come to teach them how to lead your church away from the King"
    },
    {
      "id": 26,
      "start": 1917.7999877929688,
      "end": 1924.2799835205078,
      "text": " James, yeah, just a few weeks ago."
    },
    {
      "id": 27,
      "start": 1924.2799835205078,
      "end": 1931.7599792480469,
      "text": " And what I'd say this morning is that we have a more sure word and God's Word is not only"
    },
    {
      "id": 28,
      "start": 1931.7599792480469,
      "end": 1937.5199890136719,
      "text": " sufficient but God's Word is superior and it's superior to leadership."
    },
    {
      "id": 29,
      "start": 1937.5199890136719,
      "end": 1943.3999786376953,
      "text": " By the way, let me say this, the integrity of an individual is to be questioned when"
    },
    {
      "id": 30,
      "start": 1943.3999786376953,
      "end": 1947.9599914550781,
      "text": " they take over a ministry with the intent of leading it in a different direction."
    },
    {
      "id": 31,
      "start": 1947.9599914550781,
      "end": 1952.3599853515625,
      "text": " It's an integrity issue and it's unfortunate."
    },
    {
      "id": 32,
      "start": 1952.3599853515625,
      "end": 1956.0799865722656,
      "text": " But this morning, what do we see Peter saying?"
    },
    {
      "id": 33,
      "start": 1956.0799865722656,
      "end": 1963.7999877929688,
      "text": " Peter's saying, we have a more sure word, the superiority of God's Word."
    },
    {
      "id": 34,
      "start": 1963.7999877929688,
      "end": 1965.9199829101562,
      "text": " But Peter, you walked with Christ."
    },
    {
      "id": 35,
      "start": 1965.9199829101562,
      "end": 1968.3199920654297,
      "text": " But Peter, you were at the Mount of Transfiguration."
    },
    {
      "id": 36,
      "start": 1968.3199920654297,
      "end": 1973.6799926757812,
      "text": " But Peter, you heard the voice of the Father."
    },
    {
      "id": 37,
      "start": 1973.6799926757812,
      "end": 1978.1199798583984,
      "text": " God's Word is superior, God's Word is superior than leadership."
    },
    {
      "id": 38,
      "start": 1978.1199798583984,
      "end": 1983.0399780273438,
      "text": " Let me say this, not only is God's Word superior to leadership, but God's Word is superior"
    },
    {
      "id": 39,
      "start": 1983.0399780273438,
      "end": 1985.7599792480469,
      "text": " to experience."
    },
    {
      "id": 40,
      "start": 1985.7599792480469,
      "end": 1987.3599853515625,
      "text": " God's Word is superior to experience."
    },
    {
      "id": 41,
      "start": 1987.3599853515625,
      "end": 1991.999984741211,
      "text": " Now this is something that is very important for us to understand."
    },
    {
      "id": 42,
      "start": 1991.999984741211,
      "end": 1997.239990234375,
      "text": " Peter had these great experiences and, of course, I've mentioned already about him walking"
    },
    {
      "id": 43,
      "start": 1997.239990234375,
      "end": 2001.6199798583984,
      "text": " with the Lord Jesus Christ and we've mentioned about the Mount of Transfiguration, specifically"
    },
    {
      "id": 44,
      "start": 2001.6199798583984,
      "end": 2007.1199798583984,
      "text": " that he mentions here within this text of Scripture, and though he had these great experiences,"
    },
    {
      "id": 45,
      "start": 2007.1199798583984,
      "end": 2011.8799896240234,
      "text": " he's going to point the believers that he's ministering to, to the fact that we have also"
    },
    {
      "id": 46,
      "start": 2011.8799896240234,
      "end": 2014.0799865722656,
      "text": " a more sure word of prophecy."
    },
    {
      "id": 47,
      "start": 2014.3999786376953,
      "end": 2020.5199890136719,
      "text": " See, there are people today that would elevate experience over God's Word."
    },
    {
      "id": 48,
      "start": 2020.5199890136719,
      "end": 2023.3999786376953,
      "text": " It's happening all over the place today."
    },
    {
      "id": 49,
      "start": 2023.3999786376953,
      "end": 2025.999984741211,
      "text": " They would elevate experience over God's Word."
    },
    {
      "id": 50,
      "start": 2025.999984741211,
      "end": 2029.1199798583984,
      "text": " And what happens in our lives is we have some experience."
    },
    {
      "id": 51,
      "start": 2029.1199798583984,
      "end": 2033.999984741211,
      "text": " Listen, experience is real."
    },
    {
      "id": 52,
      "start": 2033.999984741211,
      "end": 2039.239990234375,
      "text": " When you have somebody that's experienced something, it is almost impossible to convince"
    },
    {
      "id": 53,
      "start": 2039.239990234375,
      "end": 2042.5199890136719,
      "text": " them they've not had that experience."
    },
    {
      "id": 54,
      "start": 2042.5199890136719,
      "end": 2046.6399841308594,
      "text": " I spoke with a man years ago, he said, I saw a vision, and I mean, he was absolutely"
    },
    {
      "id": 55,
      "start": 2046.6399841308594,
      "end": 2049.3999786376953,
      "text": " 100% convinced that he saw a vision."
    },
    {
      "id": 56,
      "start": 2049.3999786376953,
      "end": 2054.0399780273438,
      "text": " And I was just a young man, I was probably 19, 20 years old, 20, maybe 21, just in that"
    },
    {
      "id": 57,
      "start": 2054.0399780273438,
      "end": 2057.5999755859375,
      "text": " ballpark, a young man, and I thought, this guy's crazy."
    },
    {
      "id": 58,
      "start": 2057.5999755859375,
      "end": 2059.6799926757812,
      "text": " That's my initial thought when he was explaining this to me."
    },
    {
      "id": 59,
      "start": 2059.6799926757812,
      "end": 2063.0,
      "text": " But then as I listened to him, I didn't tell him he was crazy, that's just what I thought,"
    },
    {
      "id": 60,
      "start": 2063.0,
      "end": 2066.6399841308594,
      "text": " and then as I listened to him, I realized he was absolutely certain that he had this"
    },
    {
      "id": 61,
      "start": 2066.6399841308594,
      "end": 2067.6399841308594,
      "text": " experience."
    },
    {
      "id": 62,
      "start": 2068.239990234375,
      "end": 2073.4199829101562,
      "text": " There was absolutely nothing I was going to do to tell him he didn't have that experience."
    },
    {
      "id": 63,
      "start": 2073.4199829101562,
      "end": 2077.9199829101562,
      "text": " There are people today that are having experiences, and they're experiences that are contrary"
    },
    {
      "id": 64,
      "start": 2077.9199829101562,
      "end": 2080.1199951171875,
      "text": " to God's Word."
    },
    {
      "id": 65,
      "start": 2080.1199951171875,
      "end": 2084.519989013672,
      "text": " And what happens is when they have an experience that's contrary to God's Word, unfortunately,"
    },
    {
      "id": 66,
      "start": 2084.519989013672,
      "end": 2088.719970703125,
      "text": " there are many people that take and they say, well, that was my experience, and all of a"
    },
    {
      "id": 67,
      "start": 2088.719970703125,
      "end": 2095.1199951171875,
      "text": " sudden their experience trumps the Word of God."
    },
    {
      "id": 68,
      "start": 2095.1199951171875,
      "end": 2101.8799743652344,
      "text": " But Peter's saying, no, no, no, listen, God's Word is sufficient and God's Word is superior,"
    },
    {
      "id": 69,
      "start": 2101.8799743652344,
      "end": 2107.439971923828,
      "text": " and God's Word is superior to leadership, but it's also superior to experience."
    },
    {
      "id": 70,
      "start": 2107.439971923828,
      "end": 2113.7999877929688,
      "text": " Turn over to the book of 2 Corinthians, if you will, and let me read a passage of Scripture"
    },
    {
      "id": 71,
      "start": 2113.7999877929688,
      "end": 2120.1199951171875,
      "text": " to you as we consider this thought that God's Word is superior to experience."
    },
    {
      "id": 72,
      "start": 2120.1199951171875,
      "end": 2125.3999938964844,
      "text": " God's Word is superior to experience."
    },
    {
      "id": 73,
      "start": 2125.3999938964844,
      "end": 2129.9199829101562,
      "text": " People today say, well, I want to figure out, I want to understand what it is that I experienced."
    },
    {
      "id": 74,
      "start": 2129.9199829101562,
      "end": 2136.0799865722656,
      "text": " I want to have an understanding as I look to the Bible and I see the truth of the Word"
    },
    {
      "id": 75,
      "start": 2136.0799865722656,
      "end": 2141.3999938964844,
      "text": " of God, but yet I had this experience and I want to try to understand how does that"
    },
    {
      "id": 76,
      "start": 2141.3999938964844,
      "end": 2142.3999938964844,
      "text": " jive?"
    },
    {
      "id": 77,
      "start": 2142.3999938964844,
      "end": 2144.1199951171875,
      "text": " What did that really mean?"
    },
    {
      "id": 78,
      "start": 2144.1199951171875,
      "end": 2148.3599853515625,
      "text": " We must dig into the Bible, we must dig into the Bible."
    },
    {
      "id": 79,
      "start": 2148.3599853515625,
      "end": 2158.6399841308594,
      "text": " The Bible tells us in verse number 13 of 2 Corinthians chapter number 11, 2 Corinthians"
    },
    {
      "id": 80,
      "start": 2158.6399841308594,
      "end": 2166.759979248047,
      "text": " chapter number 11 beginning in verse number 13, the Bible says, for such are false apostles,"
    },
    {
      "id": 81,
      "start": 2166.759979248047,
      "end": 2174.0799865722656,
      "text": " deceitful workers, transforming themselves into the apostles of Christ."
    },
    {
      "id": 82,
      "start": 2174.0799865722656,
      "end": 2182.1199951171875,
      "text": " I want you to notice verse 14, it says, in no marvel, for Satan himself is transformed"
    },
    {
      "id": 83,
      "start": 2182.1199951171875,
      "end": 2190.699981689453,
      "text": " into an angel of light, therefore, it's no great thing if his ministers also be transformed"
    },
    {
      "id": 84,
      "start": 2190.699981689453,
      "end": 2197.3999938964844,
      "text": " as the ministers of righteousness whose end shall be according to their works."
    },
    {
      "id": 85,
      "start": 2197.3999938964844,
      "end": 2205.1599731445312,
      "text": " These verses of Scripture in 2 Corinthians 11 are verses that should cause us to be sober,"
    },
    {
      "id": 86,
      "start": 2205.1599731445312,
      "end": 2212.699981689453,
      "text": " to understand the spiritual battle that we're engaged in and the tactics of the enemy."
    },
    {
      "id": 87,
      "start": 2212.699981689453,
      "end": 2216.3599853515625,
      "text": " In fact, earlier in this book, and you don't need to turn back, but in 2 Corinthians chapter"
    },
    {
      "id": 88,
      "start": 2216.3599853515625,
      "end": 2221.6399841308594,
      "text": " number 2 and verse number 11, Paul says this, lest Satan should get an advantage of us for"
    },
    {
      "id": 89,
      "start": 2221.6399841308594,
      "end": 2225.6399841308594,
      "text": " we are not ignorant of his devices."
    },
    {
      "id": 90,
      "start": 2225.6399841308594,
      "end": 2229.5999755859375,
      "text": " And as we look at this 11th chapter of the book of 2 Corinthians, we find that God is"
    },
    {
      "id": 91,
      "start": 2229.5999755859375,
      "end": 2234.279998779297,
      "text": " revealing to us some of how it is that the enemy works."
    },
    {
      "id": 92,
      "start": 2234.279998779297,
      "end": 2239.759979248047,
      "text": " And he says, no marvel, for Satan himself is transformed into an angel of light, and"
    },
    {
      "id": 93,
      "start": 2239.759979248047,
      "end": 2245.1599731445312,
      "text": " if he is, it says, therefore, it's no great thing if his ministers also be transformed"
    },
    {
      "id": 94,
      "start": 2245.1599731445312,
      "end": 2252.279998779297,
      "text": " as the ministers of righteousness whose end shall be according to their works."
    },
    {
      "id": 95,
      "start": 2252.279998779297,
      "end": 2255.0399780273438,
      "text": " So the Word of God is superior to experience."
    },
    {
      "id": 96,
      "start": 2255.0399780273438,
      "end": 2260.519989013672,
      "text": " You say, well, I experienced such and such, and I had this experience."
    },
    {
      "id": 97,
      "start": 2260.519989013672,
      "end": 2264.7999877929688,
      "text": " I talk to people and ask them about being saved, are you sure that heaven's your home?"
    },
    {
      "id": 98,
      "start": 2264.7999877929688,
      "end": 2267.1199951171875,
      "text": " Well, this is my experience."
    },
    {
      "id": 99,
      "start": 2267.1199951171875,
      "end": 2271.5599975585938,
      "text": " I'm not asking you about your experience, I'm asking if you've trusted Christ as your"
    },
    {
      "id": 100,
      "start": 2271.5599975585938,
      "end": 2272.5599975585938,
      "text": " Savior."
    },
    {
      "id": 101,
      "start": 2272.5599975585938,
      "end": 2276.9199829101562,
      "text": " I've had people say, in fact, I've seen a number of videos in the past week about this"
    },
    {
      "id": 102,
      "start": 2276.9199829101562,
      "end": 2281.9199829101562,
      "text": " very thing, that people have said, well, I've spoken in tongues."
    },
    {
      "id": 103,
      "start": 2282.5599975585938,
      "end": 2285.0,
      "text": " And they begin to try to say that speaking in tongues is the evidence of either being"
    },
    {
      "id": 104,
      "start": 2285.0,
      "end": 2288.519989013672,
      "text": " saved or being filled with the Holy Spirit of God, but as you look at the Bible, it's"
    },
    {
      "id": 105,
      "start": 2288.519989013672,
      "end": 2292.8399963378906,
      "text": " not always that…yes, there's a biblical truth of tongues, but they always speak in"
    },
    {
      "id": 106,
      "start": 2292.8399963378906,
      "end": 2293.8399963378906,
      "text": " a known language."
    },
    {
      "id": 107,
      "start": 2293.8399963378906,
      "end": 2299.0799865722656,
      "text": " It's a sign for the unbelievers, the Bible tells us, for the Jews."
    },
    {
      "id": 108,
      "start": 2299.0799865722656,
      "end": 2304.6799926757812,
      "text": " And begin to have this experience, and they cannot understand their experience with regard"
    },
    {
      "id": 109,
      "start": 2304.6799926757812,
      "end": 2306.959991455078,
      "text": " to what does the Bible say, why?"
    },
    {
      "id": 110,
      "start": 2306.959991455078,
      "end": 2314.1199951171875,
      "text": " Because what happens, we begin to elevate our experience over what God said in His Word."
    },
    {
      "id": 111,
      "start": 2314.1199951171875,
      "end": 2318.760009765625,
      "text": " But God's Word is superior to experience."
    },
    {
      "id": 112,
      "start": 2318.760009765625,
      "end": 2325.0799560546875,
      "text": " And we must understand that we bring every…in fact, in this same passage in chapter number"
    },
    {
      "id": 113,
      "start": 2325.0799560546875,
      "end": 2331.2799682617188,
      "text": " 10, look back actually at 2 Corinthians chapter number 10, notice what he says in verse number"
    },
    {
      "id": 114,
      "start": 2331.2799682617188,
      "end": 2332.2799682617188,
      "text": " five."
    },
    {
      "id": 115,
      "start": 2332.2799682617188,
      "end": 2336.2799682617188,
      "text": " This is…it goes right together with this when you think about experience, in 2 Corinthians"
    },
    {
      "id": 116,
      "start": 2336.2799682617188,
      "end": 2340.47998046875,
      "text": " 10, in verse number five, he says, casting down imaginations and every high thing that"
    },
    {
      "id": 117,
      "start": 2340.47998046875,
      "end": 2344.7999877929688,
      "text": " exalted itself against the knowledge of God, and bringing into captivity every thought"
    },
    {
      "id": 118,
      "start": 2344.7999877929688,
      "end": 2346.0799560546875,
      "text": " to the obedience of Christ."
    },
    {
      "id": 119,
      "start": 2346.0799560546875,
      "end": 2349.3800048828125,
      "text": " I would say this, not only bringing every thought into obedience of Christ, but every"
    },
    {
      "id": 120,
      "start": 2349.3800048828125,
      "end": 2351.8800048828125,
      "text": " experience of the obedience of Christ."
    },
    {
      "id": 121,
      "start": 2351.8800048828125,
      "end": 2353.0799560546875,
      "text": " What is this that happened?"
    },
    {
      "id": 122,
      "start": 2353.0799560546875,
      "end": 2355.719970703125,
      "text": " What did I experience here, there, or somewhere else?"
    },
    {
      "id": 123,
      "start": 2355.719970703125,
      "end": 2363.2000122070312,
      "text": " But we say God's Word is superior to our experiences, it's superior."
    },
    {
      "id": 124,
      "start": 2363.2000122070312,
      "end": 2373.5599975585938,
      "text": " So Peter, he's about to die, he says, I must put off this, my earthly tabernacle."
    },
    {
      "id": 125,
      "start": 2373.5599975585938,
      "end": 2377.8800048828125,
      "text": " But though this is going to happen shortly, I want to give you some truth."
    },
    {
      "id": 126,
      "start": 2377.8800048828125,
      "end": 2383.1199951171875,
      "text": " I want to help you, I want to instruct you, and influence you, and impact you, and I want"
    },
    {
      "id": 127,
      "start": 2383.1199951171875,
      "end": 2394.3599853515625,
      "text": " to point you to the Word of God, because we have also a more sure word of prophecy."
    },
    {
      "id": 128,
      "start": 2394.3599853515625,
      "end": 2399.719970703125,
      "text": " Listen, this book, because of what it is, is so precious."
    },
    {
      "id": 0,
      "start": 2399.719970703125,
      "end": 2407.679970741272,
      "text": " And we must elevate the Lord Jesus Christ, and we must place a priority on the preaching"
    },
    {
      "id": 1,
      "start": 2407.679970741272,
      "end": 2409.719970703125,
      "text": " of God's Word."
    },
    {
      "id": 2,
      "start": 2409.719970703125,
      "end": 2415.399971008301,
      "text": " And understanding, even as we look next week, why are we taking three weeks to set the foundation"
    },
    {
      "id": 3,
      "start": 2415.399971008301,
      "end": 2417.9199714660645,
      "text": " for how it is that I approach the Bible?"
    },
    {
      "id": 4,
      "start": 2417.9199714660645,
      "end": 2422.639970779419,
      "text": " Because we will never, I will never, and you will never approach the Bible in the way that"
    },
    {
      "id": 5,
      "start": 2422.639970779419,
      "end": 2428.5999698638916,
      "text": " we should if we don't first understand what it is."
    },
    {
      "id": 6,
      "start": 2428.5999698638916,
      "end": 2434.119972229004,
      "text": " If we don't first have an understanding of what this book is, we're not going to approach"
    },
    {
      "id": 7,
      "start": 2434.119972229004,
      "end": 2437.039970397949,
      "text": " it the way that we should."
    },
    {
      "id": 8,
      "start": 2437.039970397949,
      "end": 2442.439971923828,
      "text": " It's no longer going to be a situation of, I'll read it if I get around to it."
    },
    {
      "id": 9,
      "start": 2442.439971923828,
      "end": 2446.9199714660645,
      "text": " No, it's going to take a place of priority."
    },
    {
      "id": 10,
      "start": 2446.9199714660645,
      "end": 2447.9199714660645,
      "text": " I must."
    },
    {
      "id": 11,
      "start": 2447.9199714660645,
      "end": 2456.039970397949,
      "text": " We'll say, as Job said, the words of thy mouth are more necessary than my food."
    },
    {
      "id": 12,
      "start": 2456.039970397949,
      "end": 2457.8599700927734,
      "text": " You think about that."
    },
    {
      "id": 13,
      "start": 2457.8599700927734,
      "end": 2462.059970855713,
      "text": " Most of us aren't skipping any meals, I haven't skipped any recently at least, and the reality"
    },
    {
      "id": 14,
      "start": 2462.059970855713,
      "end": 2466.6999740600586,
      "text": " is that we get hungry for sustenance."
    },
    {
      "id": 15,
      "start": 2466.6999740600586,
      "end": 2472.8599700927734,
      "text": " I wonder how often we get hungry for God's Word."
    },
    {
      "id": 16,
      "start": 2472.8599700927734,
      "end": 2475.5799713134766,
      "text": " I just need to get in the Bible."
    },
    {
      "id": 17,
      "start": 2475.5799713134766,
      "end": 2477.9799728393555,
      "text": " I just can't wait to read."
    },
    {
      "id": 18,
      "start": 2477.9799728393555,
      "end": 2484.539970397949,
      "text": " I'm so excited for what God's going to show me, what God's going to reveal to me."
    },
    {
      "id": 19,
      "start": 2484.539970397949,
      "end": 2491.5799713134766,
      "text": " You see, when we understand what this book is, it will impact greatly what our approach"
    },
    {
      "id": 20,
      "start": 2491.5799713134766,
      "end": 2494.219970703125,
      "text": " to this book is."
    },
    {
      "id": 21,
      "start": 2494.219970703125,
      "end": 2498.8599700927734,
      "text": " He says in the same passage of Scripture, we have a more sure word of prophecy."
    },
    {
      "id": 22,
      "start": 2498.8599700927734,
      "end": 2503.1399688720703,
      "text": " He says this, and I love the imagery, and I'll give you a sneak peek the next week."
    },
    {
      "id": 23,
      "start": 2503.1399688720703,
      "end": 2507.6999740600586,
      "text": " He says, whereunto ye do well that ye take heed."
    },
    {
      "id": 24,
      "start": 2507.6999740600586,
      "end": 2513.6599731445312,
      "text": " It is in our best interest to take heed to God's Word because of what it is."
    },
    {
      "id": 25,
      "start": 2513.7799682617188,
      "end": 2522.1799697875977,
      "text": " Then he uses an illustration, as unto a light that shineth in a dark place."
    },
    {
      "id": 26,
      "start": 2522.1799697875977,
      "end": 2525.339973449707,
      "text": " Have you ever been in a dark place?"
    },
    {
      "id": 27,
      "start": 2525.339973449707,
      "end": 2528.6199645996094,
      "text": " I mean, today it's light out, if we turn all the lights off in here, you'd still be able"
    },
    {
      "id": 28,
      "start": 2528.6199645996094,
      "end": 2529.6199645996094,
      "text": " to see perfectly fine."
    },
    {
      "id": 29,
      "start": 2529.6199645996094,
      "end": 2533.6599731445312,
      "text": " How many of you have ever been to the caverns out in Shenandoah?"
    },
    {
      "id": 30,
      "start": 2533.6599731445312,
      "end": 2536.8599700927734,
      "text": " I don't know if they still do this or not, but the last time I was there, they turned"
    },
    {
      "id": 31,
      "start": 2536.8599700927734,
      "end": 2539.2999725341797,
      "text": " all the lights off."
    },
    {
      "id": 32,
      "start": 2539.2999725341797,
      "end": 2542.179977416992,
      "text": " Anyone have that experience when you went to the caverns and they turn all the lights"
    },
    {
      "id": 33,
      "start": 2542.179977416992,
      "end": 2546.3799743652344,
      "text": " off and they said, wave your hand in front of you, and you can't see anything?"
    },
    {
      "id": 34,
      "start": 2546.3799743652344,
      "end": 2549.8599700927734,
      "text": " I mean, it is dark, right?"
    },
    {
      "id": 35,
      "start": 2549.8599700927734,
      "end": 2553.459976196289,
      "text": " You experienced it?"
    },
    {
      "id": 36,
      "start": 2553.459976196289,
      "end": 2558.8599700927734,
      "text": " So if we're in that place and it's dark like that, and you pull out a handy Fellowship"
    },
    {
      "id": 37,
      "start": 2558.8599700927734,
      "end": 2565.019973754883,
      "text": " Baptist Church key chain flashlight, because we give those things out every year, but you"
    },
    {
      "id": 38,
      "start": 2565.019973754883,
      "end": 2570.6199645996094,
      "text": " grab one of those things and you're in the room down there with 50 people, and you turn"
    },
    {
      "id": 39,
      "start": 2570.6199645996094,
      "end": 2572.5799713134766,
      "text": " that light on, what do you think is going to happen?"
    },
    {
      "id": 40,
      "start": 2572.5799713134766,
      "end": 2574.979965209961,
      "text": " It's going to get people's attention."
    },
    {
      "id": 41,
      "start": 2574.979965209961,
      "end": 2577.8599700927734,
      "text": " You're going to look to that light."
    },
    {
      "id": 42,
      "start": 2577.8599700927734,
      "end": 2580.179977416992,
      "text": " I mean, without thinking about it."
    },
    {
      "id": 43,
      "start": 2580.179977416992,
      "end": 2583.5799713134766,
      "text": " In fact, if you're knowledgeable that somebody is going to turn on a light and you try to"
    },
    {
      "id": 44,
      "start": 2583.5799713134766,
      "end": 2586.3399658203125,
      "text": " tell yourself, don't look, don't look, don't you ever do that?"
    },
    {
      "id": 45,
      "start": 2586.3399658203125,
      "end": 2588.0399780273438,
      "text": " Don't do it, don't do it, don't do it."
    },
    {
      "id": 46,
      "start": 2588.0399780273438,
      "end": 2591.7799682617188,
      "text": " But man, that light comes on and it's just an instinct."
    },
    {
      "id": 47,
      "start": 2591.7799682617188,
      "end": 2595.6199645996094,
      "text": " That's the illustration that Peter uses."
    },
    {
      "id": 48,
      "start": 2595.6199645996094,
      "end": 2601.019973754883,
      "text": " And we do well that we take heed, and he says that as we're looking at a light that"
    },
    {
      "id": 49,
      "start": 2601.019973754883,
      "end": 2607.979965209961,
      "text": " shineth in a dark place, but we understand this morning, God's Word is sufficient."
    },
    {
      "id": 50,
      "start": 2607.979965209961,
      "end": 2612.5799713134766,
      "text": " People today are running around looking for some kind of new revelation, looking for some"
    },
    {
      "id": 51,
      "start": 2612.5799713134766,
      "end": 2617.8199768066406,
      "text": " new experience, while at the same time they're neglecting this book."
    },
    {
      "id": 52,
      "start": 2617.8199768066406,
      "end": 2625.179977416992,
      "text": " I don't know, God said, I've given you the Bible, and it's a more sure word of prophecy."
    },
    {
      "id": 53,
      "start": 2625.739974975586,
      "end": 2627.259963989258,
      "text": " It is sufficient."
    },
    {
      "id": 54,
      "start": 2627.259963989258,
      "end": 2631.0999755859375,
      "text": " Peter says, I want to point you to the Word of God."
    },
    {
      "id": 55,
      "start": 2631.0999755859375,
      "end": 2632.0999755859375,
      "text": " It's sufficient."
    },
    {
      "id": 56,
      "start": 2632.0999755859375,
      "end": 2639.219970703125,
      "text": " And then he says, it's superior, superior to leadership."
    },
    {
      "id": 57,
      "start": 2639.219970703125,
      "end": 2640.699966430664,
      "text": " Leaders can be wrong."
    },
    {
      "id": 58,
      "start": 2640.699966430664,
      "end": 2643.5399780273438,
      "text": " I've been wrong."
    },
    {
      "id": 59,
      "start": 2643.5399780273438,
      "end": 2644.5399780273438,
      "text": " Leaders can be wrong."
    },
    {
      "id": 60,
      "start": 2644.5399780273438,
      "end": 2646.5399780273438,
      "text": " We are humans."
    },
    {
      "id": 61,
      "start": 2646.5399780273438,
      "end": 2654.219970703125,
      "text": " Peter can be wrong, not as he's penning Scripture, but in his leadership, but God's Word is never"
    },
    {
      "id": 62,
      "start": 2654.219970703125,
      "end": 2655.739959716797,
      "text": " wrong."
    },
    {
      "id": 63,
      "start": 2655.739959716797,
      "end": 2663.699981689453,
      "text": " It's incapable of error, and therefore, Peter says it's superior to leadership."
    },
    {
      "id": 64,
      "start": 2663.699981689453,
      "end": 2665.2999572753906,
      "text": " It's superior to your leadership."
    }
  ],
  "processed_at": "2025-04-16T10:28:18.651174"
}