{
  "video_id": "QRU69F1M_PA",
  "text": "here, and I thought it appropriate this evening to review this passage of Scripture. I'm thankful, as I've often said over the years, that God's Word all at the same time will convict us, it will comfort us, and it'll correct us, change us. I'm so thankful for the power of God's Word. The Bible, we often say as Baptist people, the Bible is our sole authority for faith and practice, and that is so vital, and it's important that we understand this evening that it's the Lord that established the local church, it's the Lord who has provided for us in His precious Word the instruction that we need with regard to how the church is to function, and how's the church supposed to operate, and we could ask questions this evening, perhaps some have been asked these questions by others, why is the church structured the way that it is? Well, we ought to be able to go to God's Word, and we ought to be able to describe from the pages of this precious book that the Lord is the head of the church. Amen? It is His church, He's the head of it, and He has ordained that there would be pastors. It's an office that He's established, the office of a pastor, a bishop, the words used interchangeably, of course, dealing with a little bit different aspect of that same office, but we find the office of the pastor. Then we say, well, why do we have deacons? Well, because the Bible says that you ought to have deacons, and there are qualifications. Someone says, I want to be a pastor. Okay, well, there are qualifications that God gives in His Word, with being a deacon. We find those truths in the pages of Scripture. There's a problem in America right now, there's some large Southern Baptist churches actually that are ordaining women to be pastors, and there's some people that say, well, you know, it's the 21st century, and so on and so forth. Well, God's Word is settled forever, and God said that if a man desire the office of a bishop, he desireth a good thing, and one of the requirements is that he be the husband of one wife. And for a long time, we were able to say, that's possible only for a man to be the husband of one wife, and no matter what our society would say about redefining terms, it is still only a male that can be the husband of one wife. And so we find that the Bible gives us the answers for how the church is established and how it is structured, and why do we operate the way that we operate. We could ask the question, what is the purpose of the church? Why do we gather together? What's the purpose? And we understand that our purpose is to glorify God, and we're to lift up the Lord Jesus Christ and exalt Him. We understand the importance of edifying one another. You read through the New Testament, and you see all of the instruction that God gives to His disciples and you see all of the instruction that God gives with regard to one another commands. And then we could ask this question that's pertinent to our subject this evening, why is it that we observe the Lord's Supper? Why do we observe the Lord's Supper? And we find that it's not because of tradition, it's not because of some religious father, forefathers, and so on and so forth. No, it's because God has established that the local church should observe the Lord's Supper. We find that the Lord's Supper was instituted by the Lord Jesus Christ before His crucifixion. And we can read of that in the gospel accounts and we understand that He instituted it. And then as we look to the New Testament, we find that God provides instruction to the churches with regard to the observance of the Lord's Supper. I believe this evening that this passage here in 1 Corinthians 11, which is written to the local church there at Corinth, is probably the most complete teaching on the subject that is before us with regard to the Lord's Supper that you're going to find within the New Testament. It's interesting and it's worth noting that this instruction that is provided to the church at Corinth in 1 Corinthians 11, this instruction is given in order to correct the way in which they were observing the Lord's Supper. They weren't doing it properly and so therefore God provides them with instruction. He's correcting that which they were doing that was incorrect. In fact, in verse 17 and again in verse 22, you will see the phrase where the Bible says, I praise you not. They weren't doing the things that they were supposed to or they weren't observing it the way that they were supposed to. So we pick it up in verse number 23 and the Bible says this, for I have received of the Lord that which also I delivered unto you. I'm thankful that the Apostle Paul, as he's writing to this local church, of course we understand that all Scripture is given by inspiration of God, but Paul isn't just sitting there saying, well let me give you my opinion on how this is supposed to work and this is probably the most practical way. No, he says, I'm telling you I have received of the Lord that which also I delivered unto you. Notice he says that the Lord Jesus, the same night which he was betrayed, took bread. So what's he referring back to is referring back to as we would study in the gospel records where this, the Lord's Supper, was instituted by Christ before his crucifixion. Verse 24, when he had given thanks, he break it, that bread, and said, take ye, this is my body which is broken for you, this do in remembrance of me. After the same manner also he took the cup when he had supped, saying, this cup is the New Testament in my blood, this do ye as often as you drink it in remembrance of me. We've seen in verse number 24 and again in verse number 25 that phrase of in remembrance of me. In verse number 26 the Bible says for as often as you eat this bread and drink this cup you do show the Lord's death till he come. I can't tell you how many times I've been asked over the years is how often are we supposed to observe the Lord's Supper. Well, the Bible just says as often as you do and there is no prescribed time frame in which you are to do to observe the Lord's Supper and so you'll find that there are churches that observe it on varying schedules and calendars and what have you. But we find that the instruction is for as often as you eat this bread and drink this cup you do show the Lord's death till he come. Notice verse 27, wherefore, whosoever shall eat this bread and drink this cup of the Lord unworthily shall be guilty of the body and blood of the Lord. See, this is exactly what the church was doing in Corinth. They were not approaching the Lord's table in a reverent manner in the manner in which they were supposed to. And so Paul is dealing with them and he's saying that you've eaten this, you're unworthy in your approach and he says that you're guilty of the body and blood of the Lord. Notice, but let a man examine himself. And so let him eat of that bread and drink of that cup for he that eateth and drinketh unworthily eateth and drinketh damnation to himself not discerning the Lord's body. For this cause many are weak and sickly among you and many sleep. For if we would judge ourselves we should not be judged but when we are judged we are chastened of the Lord that we should not be condemned with the world. It's important by way of introduction that we understand this evening that this instruction with regard to the Lord's Supper is written to the local church. We'd understand this evening that the local church is made up of individuals that are saved and baptized. So I become a member of a church. You know, I have somebody come and say, hey, I want to join the church. Okay, that's wonderful. First, talk to me about when you got saved. Why? Well, because church membership requires, the prerequisite for church membership is that you're saved and that you're scripturally baptized. And so we find that he is writing here, under the inspiration of the Holy Spirit of God, he's writing to a church that's made up of believers. So we understand that the Lord's Supper is for God's people. The Lord's Supper is not for everyone. The Lord's Supper is not for lost people. Amen? The Lord's Supper is for saved people. And not only is the Lord's Supper for saved people, it's not for lost people, but we'd also say this, that the Lord's Supper is a memorial. It cannot save you. It cannot, there's no extra grace. There's nothing that happens to these elements when we pray here in just a little while and all that takes place, no, they still remain the same elements that they are, but they're a picture, they're a memorial. Jesus said, this is my body when he took that bread, and he said, take, eat, this is my body, which is broken for you, this do in remembrance of me. Then when he speaks about the cup, he says, this cup is the New Testament in my blood, this do ye as often as you drink it in remembrance of me. And so we understand this evening, we speak about the Lord's Supper, the Lord's table, that there's no saving grace in these elements. There's no ability for these elements to do anything to help you get to heaven. That's all been settled at Calvary. Amen. I'm thankful for the finished work of Christ at Calvary, the death, burial, and glorious resurrection of our Savior. And we understand this evening that this is a memorial. It's a picture. It's important. It's necessary. We find that there are two ordinances that God has given us as New Testament churches. One, the Lord's Supper. The other is baptism. Isn't it interesting that both of them remind us of the... death, burial, and resurrection of our Lord and Savior Jesus Christ. Why? Because without that truth we have nothing. If Christ did not... somebody asked this question during Easter. A question was posed to a number of people and I was one of them. What's more important, Christmas or Easter? And I said the answer is yes. Listen, if he wasn't born he couldn't die. Right? He was born to die. If he didn't die he couldn't rise. Right? They're all... they're equally necessary. And in God's infinite wisdom he sent forth his Son, born of a virgin, for what purpose? To redeem mankind. And both of the ordinances that the Lord has given to the local church remind us of that which is so important to our faith, the death, burial, and resurrection. It is our faith. And we find this evening that this do in remembrance of me. So we're going to think about the Lord's Supper, the Lord's Table, as we observe it this evening. Just a few thoughts for you tonight. Number one, if you are taking notes, it is a time to remember. It's a time to remember. I started to use the word reflect and I think that it could be an appropriate word as well. But I think about the word remember and the context in which we find in the Old Testament where so often the people of God were given this bit of instruction of beware lest thou forget. And we find over and over, as you would look at the nation of Israel, the children of Israel, how that they would receive that reminder that they would beware lest they forget. And then you would find the indictment that is brought against the children of Israel where they're told that you have forgotten God days without number. Begin to think about this truth of a time to remember. So often in our society today things go so quickly and our pace of life is so rapid and there's just our schedules are so packed and I understand how busy it is. We think about this truth of Psalms where the psalmist says be still and know that I'm God. And I think about the Lord's Supper provides for us a time to remember. A time to remember what? Well, I believe that what we would remember is the greatest sacrifice that it was ever made. Sometimes we talk about sacrifice. In fact, there are times in which people will speak about those that are servants of the Lord and they'll speak about their sacrifice of service or duty. There's a preacher of yesteryear that said, do not call my duty for God's service, it's but a privilege. What a great perspective. But there are some that use that term sacrifice and I would say that the greatest sacrifice of all time, of all of the history of humankind, the greatest sacrifice is when the Lord Jesus Christ went up a hill called Calvary. When God in flesh took your place and my place on the cross, it's the greatest sacrifice. And I'm so thankful that this, the Lord's Supper, gives us an opportunity to remember what he did for us. I would say this evening that that greatest sacrifice was a sacrifice that was motivated by love. For God so loved the world that he gave his only begotten son, that whosoever believeth in him should not perish but have everlasting life, whosoever believeth in him should not perish but have everlasting life. And this greatest sacrifice was motivated by love and I'm thankful for his great love. This evening we read in verses 24 and 25 how that we remember that great sacrifice. Notice the Bible says, and when he had given thanks, he break it and said, take, eat, notice this is my body which is broken for you. You see the personal aspect, it was broken for you. I'm thankful that the Lord Jesus Christ was willing to endure such pain and suffering. It says that his body was broken for you. We understand that his bones were not broken. You can read of the prophecy in the Psalms about not a bone being broken, but they were out of joint and we can see the great suffering in how his body, you think about the cat of nine tails and how they would whip him and they buffeted him and all that they did and he says, this is my body which is broken for you. And then he speaks about the blood. As Baptists we've often said it's the book, the blood and the blessed hope. And I'm so thankful for the blood of Christ. And he says in verse 25, and after the same manner also he took the cup when he had stopped saying this cup is the New Testament in my blood, this do you as often as you drink it in remembrance of me. Listen, without the shedding of blood there is no remission. That's what God says in the book of Hebrews. And the blood is absolutely necessary. The blood is the only way to have forgiveness. You know that there are some modern translations that take the blood out of the scriptures. A passage of scripture, you don't need to turn there, that's so vital and so important that we'd understand the teaching of forgiveness and reconciliation. Colossians in chapter number 1 and verse number 14, the Bible says in whom we have redemption through his blood even the forgiveness of sins. What a powerful verse of scripture. What a simple truth of God's word but how powerful it is. And yet we find that many of the modern translations today, you know what they take out of that verse of scripture? Through his blood. There's no way to have redemption or forgiveness if there's no mention of the blood. Without the shedding of blood there is no remission. We find that as we observe the Lord's table, this opportunity for us to have a time to remember, to remember the great price that was paid for our salvation. Listen, salvation is a free gift for us. It cost our Savior everything. You think about buying a gift for someone and you buy a gift for them, they give you the gift, you're the recipient of a gift, it didn't cost you anything. But it cost the individual that gave you that gift a certain sum of money. We find that as we think of this gift, it did not cost money, it was not purchased with gold and silver, with corruptible things. But according to what Peter says, we find that it was paid for, it was purchased with the precious blood of Christ. No wonder that John, he says, John the Baptist as he sees Jesus, behold the Lamb of God which taketh away the sin of the world. This greatest sacrifice was motivated by love but this greatest sacrifice results in reconciliation. It's a wonderful thing to be reconciled to God. We're in enmity with God, we were separated from God, we were His enemies, we could not approach God but because of Jesus, because of what He did on that cross, He offers that forgiveness. That which was not possible of our own merit, of our own work, is now possible through the blood of Christ, reconciled, that work of reconciliation. What a blessing. The Lord's Table gives us an opportunity for a time to remember. I would say number two this evening, if you're taking notes, a time not only to remember but a time to rejoice. Time to rejoice. I'm so thankful that Jesus was willing to go to that cross. Aren't you? I mean, we ought to rejoice greatly for the great salvation that we have through Jesus Christ. What a blessing to know that He was willing and He went to the cruel cross, He paid the awful price, the awful penalty so that we could be redeemed and we rejoice in the finished work of Christ. He said on the cross, it is finished. Hallelujah. What a blessing. I hope that regularly in your life that you rejoice to know that you're saved. You rejoice in remembering what Christ did for you on the cross of Calvary. I would say this evening that not only would it be a time to rejoice because of the finished work of Christ at Calvary, but we'd find from verse number 26, continue reading with me there in 1 Corinthians 11, the Bible says for as often as you eat this bread and drink this cup, notice ye do show the Lord's death till He come. I hope that you're rejoicing in that wonderful promise. We say that we rejoice because of the finished work of Christ and we should rejoice because of the future coming of Christ. It says that ye do show His death till He come. I don't know when He's going to come, but I know He's coming. Amen? I don't know the date nor the hour and neither do you. No man does, but we can rest assured that God always does what He says He's going to do. And we find that He gave that wonderful promise that He's coming again and He wants the church to be reminded that time of remembrance, that time of reflection. He wants us to rejoice in understanding that He finished, He completed the work for our redemption there at the cross of Calvary, but He wants us to understand and to rejoice in His future coming. You think about the motivation of the coming of Christ, the promise of His coming and what it should do. in the life of a believer and how it should motivate us to live for Jesus every single day. We'd live with that awareness, that understanding that today could be the day. The reality is that we understand that the Bible teaches that there's the imminent return of the Lord Jesus Christ, that the rapture could take place at any moment. But the Bible also teaches, as I mentioned this morning, that our life is but a vapor that appears for a little time and then vanisheth away. And so really there are two factors that we should consider every single day. Number one, Jesus could come back. Number two, I could take my final breath and depart this world in death every single day. Those two truths are great motivators for God's people to live every day for His honor and for His glory. Because what if today were the last day? What if you knew that today was the last day you'd ever live upon this earth? What is it that you would do? There are people that receive medical diagnosis of cancer and various ailments and what have you, and doctors will give estimates with regard to how much time they believe they would have to live upon this earth. And they begin to talk, and you've heard the term, I've heard the term. People talk about having a bucket list, a list of things they'd like to do while they have time here upon this earth. So many of the things that would fill people's bucket lists for God's people are not even things that we should really even... I mean, they don't take that priority, that level of importance. See, this evening, Jesus is coming again. I'm rejoicing in that truth. Jesus said, I will come again and receive you unto myself that where I am there you may be also. Listen for the trumpet. The songwriter said, Jesus is coming. And 1 John 3 says it this way. I think about John writing, and John had heard that wonderful promise of Jesus when he said, I will come again. And in 1 John 3, John the Apostle, he says this in verse number 1, Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God. Therefore the world knoweth us not, because it knew him not, beloved, now are we the sons of God. Notice in verse 2, it says, And it doth not yet appear what we shall be, but we know that when he shall appear we shall be like him, for we shall see him as he is. It's interesting, I'll read verse number 3 in just a moment, but if you were to go back to verse number 28 of chapter number 2 and notice this truth that is given, he says, And now, little children, abide in him. We just sang a song about abiding. That when he shall appear, not if he shall appear, it's a certain truth, it's a fact to be understood. When he shall appear, we may have confidence, and notice what it says, and not be ashamed before him it is coming. You know, I believe, certainly possible, likely, that there will be some of God's people that are going to be ashamed at the appearing of Jesus Christ. I don't want to be in that company. I really don't. And he says, in verse number 3 of chapter number 3, when he talks about, again, he said in verse number 2, when he shall appear, we see that in verse 28 of chapter 2, and now he says in chapter 3, in verse number 3, And every man that hath this hope in him. We're talking about the book, the blood, and the blessed hope, and he says, every man that hath this hope in him. Remember, hope, biblically speaking, the biblical definition of hope is that confident expectation. It's not the hope that the world talks about. I hope this is going to happen. I hope I get this, or I hope this. No, no, no. This is confident expectation. Every man that hath this hope in him, notice what it says, purifieth himself, even as he is pure. We know that he is holy. He is pure. We find that we are to purify ourselves. We find that the Bible teaches us, the Bible says this, that we are to be holy. Why? For he is holy. Be holy, for I am holy. That's what the Lord says in all manner of conversation. We see that there's a time to remember, a time to rejoice, and oh, how we should rejoice greatly when we partake of the Lord's Supper, reminded of the finished work of Christ, reminded of the future coming of Christ, and it causes the people of God to rejoice greatly. But I would say number three this evening, not only a time to remember, a time to rejoice, but I would say it's a time to repent. A time to repent. This is what the Bible says in verse number 27. Wherefore, whosoever shall eat this bread and drink this cup of the Lord unworthily shall be guilty of the body and blood of the Lord. If you were to go back into verse number 17 of this chapter, you'd note that the Bible says, Now in this that I declare unto you, I praise you not, that ye come together, not for the better, but for the worse. He's talking about what they were doing, what their behavior was, and he's saying, I praise you not, you're not doing what you're supposed to be doing, so he's going to correct them. Notice in verse 18, For first of all, when ye come together in the church, I hear that there be divisions among you, and I partly believe it. For there must be also heresies among you, that they which are approved may be made manifest among you. When ye come together, therefore, into one place, this is not to eat the Lord's Supper. For in eating everyone taketh before other his own supper, and one is hungry, and another is drunken. What? Have ye not houses to eat and to drink in? Or despise ye the church of God, and shame them that have not? What shall I say to you? Shall I praise you in this? I praise you not. And so then he says in verse number 27, when he's giving this instruction, Wherefore, whosoever shall eat this bread and drink this cup of the Lord unworthily, shall be guilty of the body and blood of the Lord. This is a serious matter. It's not something to take lightly. It's time to repent. Notice he says this in verse 28, But let a man examine himself. Let a man examine himself. And so let him eat of that bread and drink of that cup. As we look at this passage of Scripture, we find that this idea of this time to repent, or to not partake unworthily, and so what is the remedy? He says that we're to let a man examine himself. Self-examination is necessary. It's important. I would say it's a missing practice in many of our lives. We find that the Bible teaches this truth of self-examination, and it's so imperative that we get and we understand and grasp this teaching that we would examine ourselves. I've often said this over the years, Self-examination is going to require honesty. It's going to require honesty. Self-examination is going to require humility. Listen, I had lunch with a man on Friday, a man that our families prayed for the whole month of April. Love thy neighbor. I've tried to encourage you to pray for or choose a neighbor. Prayed for their family the entire month of April. Had lunch with him on Friday for the purpose of sharing the Gospel with them. He's a different world religion, doesn't matter. Sharing the Gospel with them, trying to give them the truth. Here's what he said to me. He looked at me and this is what he said. I'm better than 90% of the people in the world. That's what he said. That's what he said. Self-examination requires humility. Requires honesty. And here's the reality. It doesn't matter if you're better than everybody that you can think about all the people. And you know who we like to compare ourselves to? The real bad people. You know how many people have told me over the years I've never killed anybody? Seriously. You start asking people if they know for sure they're going to go to heaven when they die. Because the common thought amongst people is that, well, if I'm better than others, if my good is more than my bad. I've had countless number of people say, I've never killed anybody. You know what I say? Well, that's good. I'm glad. But the standard is Jesus. And he's perfect. He's perfect. But let a man examine himself. Listen, this process of self-examination requires honesty and humility. It's an important process. We could call it a discipline this evening and we could think about this discipline or this process and this self-examination. Understanding that one day we're going to stand before the judge of all the earth. We find that the Bible says, but let a man examine himself and so let him eat of that bread and drink of that cup. So as we understand contextually what's taking place, he's saying, listen, you're not doing things right. I praise you not. So here's the instruction for how you do it. Don't partake of it unworthily. And the way that you prevent partaking of it unworthily is to examine yourself. Then he says, but let a man examine himself. examine themselves, and so let him eat of that bread and drink of that cup.\" So what's the process? Well, the process is not to say, well, I'm unworthy so I'm not going to partake. That's why I've titled it, given the third point here, that it's a time to repent. A time to repent. Listen, when we examine ourselves and we get alone with God and we say as the psalmist said, search me, O God. Show me if there be any wicked way in me. God's going to point out some things in our lives. You know why? We all got this flesh. There's not one of us tonight that's perfect. Not one of us. There's sins of omission, there's sins of commission. You know how easy, listen, the Bible says what's not a faith is sin. How many times we can sin with our tongue? Tongue's a little member. Oh, it causes so many problems, James chapter number 3. Right? Be angry and sin not. I shared that verse last Sunday night. Jesus, the Son of God, God in flesh, he was angry, he didn't sin, but the problem is that many of us, we don't really know how to do that. Many times our anger turns into sinful behavior. This evening, this idea of let a man examine himself, the purpose I would say of self-examination is repentance. That we would get that thing right, that we would have that, as the songwriter said, there's nothing between my soul and my Savior. That we would be in that place of that self-examination. He says, so let him eat of that bread and drink of that cup. Notice what he says in verse 29, for he that eateth and drinketh unworthily eateth and drinketh damnation to himself, not discerning the Lord's body. And if you look within context here, it's interesting because the damnation to himself that's mentioned in verse number 29, it's given further explanation I believe in verse number 32 when the Bible says that when we are judged, we are chastened of the Lord. Again, the truth that we find in this passage of Scripture that this Lord's table, the Lord's supper is for God's people, it's not for lost people, it's for saved people. And here's what God said, for whom the Lord loveth, he chasteneth. Listen, we ought to thank God when He chastens us. You know why? It's a birthmark of belonging to Jesus. Because He says, if He doesn't chasten you, then you don't belong to Him. And so guess what? Our good Heavenly Father does. Sometimes He has to correct us. He chastens us. We find here that He says that that individual, that believer that is eating and drinking unworthily, he's eating and drinking damnation to himself, not discerning the Lord's body. And then Paul goes on to say, for this cause, because the behavior there in Corinth and the way in which they were observing the Lord's table, the Lord's supper, the manner that he's speaking of, he says, for this cause, many are weak and sickly among you and many sleep. That word sleep is the same way that Jesus used it speaking about Lazarus. Remember He said to the disciples, he's asleep. And, well, if he's asleep, I mean, let him be. And Jesus said, he's dead. So, He says here, listen, every sickness in the life of a believer is not chastening. It's important for us to understand that. Every sickness is not chastening. But you know what happens in my life? If I got some sickness going on, I'm, Lord, self-examination time. It's a good practice. Lord, is there something I, are you chastening me? Is there something I need to, but when we understand this truth of chastening, He says, for many are sick, weak, excuse me, and sickly among you and many sleep. Then He says this, if we would judge ourselves, we should not be judged. For when we are judged, we are chastened to the Lord that we should not be condemned with the world. So, we would understand this evening as we've titled this point a time to repent, where to not eat unworthily, the process of self-examination leads us to repentance. Listen, when we get alone with God and we go through that process of self-examination, Lord, search me, show me if there'd be any wicked way in me. When God shows it to us, guess what? We confess it. We confess it. He that covereth his sin, the Bible says, shall not prosper. By the way, who knows about your sin? God. Right? No one's ever pulled anything over on God. Right? Adam, where are you? Did God know where he was? Sure He did. Did God know why He had the leaves on? Sure He did. Adam wasn't hiding anything from God. He hid from God, but God knew all about it. We could speak of so many examples. Achan, the one that troubleth Israel, he hid some things, but God systematically brought Achan to the very forefront of Joshua to see who it was that was the troubler of Israel. You could go on and on. You can look through the pages of Scripture. Listen, God knows about our sin. Sometimes people think, well, nobody else knows about this. He that covereth his sin shall not prosper, but whoso confesseth and forsaketh shall, they shall have forgiveness. The Bible says in 1 John chapter 1 and verse number 9, the Bible says that if we confess our sins, He is faithful and just to forgive us and to cleanse us from all unrighteousness. That's a wonderful promise of God's Word. What a wonderful promise. This evening, listen, it's foolish, it's foolish to try to hide our sin. We can't do it. The Word is that they should have mercy. Aren't you thankful for God's mercy? God's mercy. He that covereth his sin shall not prosper, but whoso confesseth and forsaketh them, his sin, shall have mercy. Listen, our God is a merciful God. He's a gracious God. He's a God that is described this way. He is ready to pardon. He is ready to forgive. So if I have sin in my life, this evening if you have sin in your life, we think about this Lord's Supper, this Lord's table. It's a time to repent. Get right with God. I want nothing between my soul and my Savior. I want to be right with God. The Lord's Supper is a precious time for believers. A time to remember, to remember of the greatest sacrifice that was motivated by love that results in reconciliation. That great sacrifice. What an important thing that we remember what Christ did for us. The time to rejoice. I hope tonight that you rejoice in the finished work of Christ. I hope tonight that you rejoice in the future coming of Christ. He's coming again. Oh how that wonderful truth should motivate us daily to live for Him, to serve Him every day of our lives. But it's a time to repent. Time to repent. God, search me. Show me. Reveal in my life. Uncover those things in my life where I've sinned, where I need to get it right with You, Lord. Help me not to have a hard heart. I close with this thought from the Apostle Paul as he's standing and giving defense before Felix in Acts 24. In verse number 16, the Bible says that he, Paul, says this, and herein do I exercise myself to have always a conscience void of offense toward God and toward men. He says, I exercise myself. I'm laboring. I'm striving. For what purpose to have always a conscience that is void of offense? I don't believe Paul wanted to have sin in his life. He wanted to be clean. He understood, oh, wretched man that I am. I mean, he understood that he still had the flesh. But he says, I die daily. I'm crucified with Christ. Why did God use Paul the way that He did? Well, there's so many answers to that question, but I believe that this is one of them, that he sought to walk and live a clean life, pure in the eyes of God. This evening is a time to repent. I don't know what you have to repent of, but I know that we're all sinners. I know that we all ought to say, God, search me, show me, help me, Lord, to honestly, humbly evaluate, examine my life. God, as you show me, I'm so thankful that you're a God who's gracious and merciful and ready to pardon. I can get that right with you, Lord. I can have forgiveness because we're going to partake of the Lord's Supper and I want to do it with joy. I want to do it with that rejoicing and that remembering. Why? Because I've done that process of repenting and preparing my heart to be able to partake of the Lord's Table. Let's pray together. Father, we love you. How we thank you for loving us. We thank you for the precious Word of God. We thank you for the instruction that you provide us with in your Word regarding the Christian life and the church and the Lord's Supper. God, I pray that as we have a moment of invitation, as we proceed into the next phase of our service of observing the Lord's Supper, I pray, God, that you'd help us to examine ourselves. I pray that we do business with you, Lord. I pray that as we would have this time of examination, perhaps… Perhaps there'd be some that would come to this old-fashioned altar, maybe we'd make our own pew and altar. God help us. Help us, Lord, to have this time of examination. Help us to be right with you, Lord. I pray that you'd use us, Lord, for honor and for your glory. Help us to rejoice as we remember what you've done for us to provide us with salvation full and free. Thank you for the promise that you're soon going to come again, pray that you'd help us to be found faithful. Lord, would you move and work in hearts and lives as only you can. We'll thank you for it. In Christ's name we pray, this evening.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 7.0,
      "text": " here, and I thought it appropriate this evening to review this passage of Scripture. I'm"
    },
    {
      "id": 1,
      "start": 7.0,
      "end": 12.960000038146973,
      "text": " thankful, as I've often said over the years, that God's Word all at the same time will"
    },
    {
      "id": 2,
      "start": 12.960000038146973,
      "end": 21.68000030517578,
      "text": " convict us, it will comfort us, and it'll correct us, change us. I'm so thankful for"
    },
    {
      "id": 3,
      "start": 21.68000030517578,
      "end": 27.1200008392334,
      "text": " the power of God's Word. The Bible, we often say as Baptist people, the Bible is our sole"
    },
    {
      "id": 4,
      "start": 27.1200008392334,
      "end": 34.52000045776367,
      "text": " authority for faith and practice, and that is so vital, and it's important that we understand"
    },
    {
      "id": 5,
      "start": 34.52000045776367,
      "end": 40.560001373291016,
      "text": " this evening that it's the Lord that established the local church, it's the Lord who has provided"
    },
    {
      "id": 6,
      "start": 40.560001373291016,
      "end": 46.91999816894531,
      "text": " for us in His precious Word the instruction that we need with regard to how the church"
    },
    {
      "id": 7,
      "start": 46.91999816894531,
      "end": 53.79999923706055,
      "text": " is to function, and how's the church supposed to operate, and we could ask questions this"
    },
    {
      "id": 8,
      "start": 53.79999923706055,
      "end": 59.79999923706055,
      "text": " evening, perhaps some have been asked these questions by others, why is the church structured"
    },
    {
      "id": 9,
      "start": 59.79999923706055,
      "end": 64.12000274658203,
      "text": " the way that it is? Well, we ought to be able to go to God's Word, and we ought to be able"
    },
    {
      "id": 10,
      "start": 64.12000274658203,
      "end": 70.95999908447266,
      "text": " to describe from the pages of this precious book that the Lord is the head of the church."
    },
    {
      "id": 11,
      "start": 70.95999908447266,
      "end": 78.36000061035156,
      "text": " Amen? It is His church, He's the head of it, and He has ordained that there would be pastors."
    },
    {
      "id": 12,
      "start": 78.36000061035156,
      "end": 83.31999969482422,
      "text": " It's an office that He's established, the office of a pastor, a bishop, the words used"
    },
    {
      "id": 13,
      "start": 83.31999969482422,
      "end": 88.83999633789062,
      "text": " interchangeably, of course, dealing with a little bit different aspect of that same office,"
    },
    {
      "id": 14,
      "start": 88.83999633789062,
      "end": 93.44000244140625,
      "text": " but we find the office of the pastor. Then we say, well, why do we have deacons? Well,"
    },
    {
      "id": 15,
      "start": 93.44000244140625,
      "end": 98.4800033569336,
      "text": " because the Bible says that you ought to have deacons, and there are qualifications. Someone"
    },
    {
      "id": 16,
      "start": 98.4800033569336,
      "end": 103.31999969482422,
      "text": " says, I want to be a pastor. Okay, well, there are qualifications that God gives in His Word,"
    },
    {
      "id": 17,
      "start": 103.31999969482422,
      "end": 109.08000183105469,
      "text": " with being a deacon. We find those truths in the pages of Scripture. There's a problem"
    },
    {
      "id": 18,
      "start": 109.08000183105469,
      "end": 114.0,
      "text": " in America right now, there's some large Southern Baptist churches actually that are ordaining"
    },
    {
      "id": 19,
      "start": 114.0,
      "end": 118.95999908447266,
      "text": " women to be pastors, and there's some people that say, well, you know, it's the 21st century,"
    },
    {
      "id": 20,
      "start": 118.95999908447266,
      "end": 124.31999969482422,
      "text": " and so on and so forth. Well, God's Word is settled forever, and God said that if a man"
    },
    {
      "id": 21,
      "start": 124.31999969482422,
      "end": 129.32000732421875,
      "text": " desire the office of a bishop, he desireth a good thing, and one of the requirements"
    },
    {
      "id": 22,
      "start": 130.32000732421875,
      "end": 135.32000732421875,
      "text": " is that he be the husband of one wife. And for a long time, we were able to say, that's"
    },
    {
      "id": 23,
      "start": 135.32000732421875,
      "end": 141.32000732421875,
      "text": " possible only for a man to be the husband of one wife, and no matter what our society"
    },
    {
      "id": 24,
      "start": 141.32000732421875,
      "end": 147.32000732421875,
      "text": " would say about redefining terms, it is still only a male that can be the husband of one"
    },
    {
      "id": 25,
      "start": 147.32000732421875,
      "end": 153.32000732421875,
      "text": " wife. And so we find that the Bible gives us the answers for how the church is established"
    },
    {
      "id": 26,
      "start": 154.32000732421875,
      "end": 159.32000732421875,
      "text": " and how it is structured, and why do we operate the way that we operate. We could ask the"
    },
    {
      "id": 27,
      "start": 159.32000732421875,
      "end": 165.32000732421875,
      "text": " question, what is the purpose of the church? Why do we gather together? What's the purpose?"
    },
    {
      "id": 28,
      "start": 165.32000732421875,
      "end": 171.32000732421875,
      "text": " And we understand that our purpose is to glorify God, and we're to lift up the Lord Jesus Christ"
    },
    {
      "id": 29,
      "start": 171.32000732421875,
      "end": 175.32000732421875,
      "text": " and exalt Him. We understand the importance of edifying one another. You read through"
    },
    {
      "id": 30,
      "start": 175.32000732421875,
      "end": 180.32000732421875,
      "text": " the New Testament, and you see all of the instruction that God gives to His disciples"
    },
    {
      "id": 31,
      "start": 180.32000732421875,
      "end": 186.32000732421875,
      "text": " and you see all of the instruction that God gives with regard to one another commands."
    },
    {
      "id": 32,
      "start": 186.32000732421875,
      "end": 190.32000732421875,
      "text": " And then we could ask this question that's pertinent to our subject this evening, why"
    },
    {
      "id": 33,
      "start": 190.32000732421875,
      "end": 197.32000732421875,
      "text": " is it that we observe the Lord's Supper? Why do we observe the Lord's Supper? And we find"
    },
    {
      "id": 34,
      "start": 197.32000732421875,
      "end": 205.32000732421875,
      "text": " that it's not because of tradition, it's not because of some religious father, forefathers,"
    },
    {
      "id": 35,
      "start": 205.32000732421875,
      "end": 211.32000732421875,
      "text": " and so on and so forth. No, it's because God has established that the local church"
    },
    {
      "id": 36,
      "start": 211.32000732421875,
      "end": 216.32000732421875,
      "text": " should observe the Lord's Supper. We find that the Lord's Supper was instituted by the"
    },
    {
      "id": 37,
      "start": 216.32000732421875,
      "end": 222.32000732421875,
      "text": " Lord Jesus Christ before His crucifixion. And we can read of that in the gospel accounts"
    },
    {
      "id": 38,
      "start": 222.32000732421875,
      "end": 227.32000732421875,
      "text": " and we understand that He instituted it. And then as we look to the New Testament, we find"
    },
    {
      "id": 39,
      "start": 227.32000732421875,
      "end": 233.32000732421875,
      "text": " that God provides instruction to the churches with regard to the observance of the Lord's"
    },
    {
      "id": 40,
      "start": 233.32000732421875,
      "end": 237.32000732421875,
      "text": " Supper. I believe this evening that this passage here in 1 Corinthians 11, which is"
    },
    {
      "id": 41,
      "start": 237.32000732421875,
      "end": 243.32000732421875,
      "text": " written to the local church there at Corinth, is probably the most complete teaching on"
    },
    {
      "id": 42,
      "start": 243.32000732421875,
      "end": 248.32000732421875,
      "text": " the subject that is before us with regard to the Lord's Supper that you're going to"
    },
    {
      "id": 43,
      "start": 248.32000732421875,
      "end": 253.32000732421875,
      "text": " find within the New Testament. It's interesting and it's worth noting that this instruction"
    },
    {
      "id": 44,
      "start": 253.32000732421875,
      "end": 259.32000732421875,
      "text": " that is provided to the church at Corinth in 1 Corinthians 11, this instruction is given"
    },
    {
      "id": 45,
      "start": 259.32000732421875,
      "end": 265.32000732421875,
      "text": " in order to correct the way in which they were observing the Lord's Supper. They weren't"
    },
    {
      "id": 46,
      "start": 265.32000732421875,
      "end": 271.32000732421875,
      "text": " doing it properly and so therefore God provides them with instruction. He's correcting that"
    },
    {
      "id": 47,
      "start": 271.32000732421875,
      "end": 277.32000732421875,
      "text": " which they were doing that was incorrect. In fact, in verse 17 and again in verse 22,"
    },
    {
      "id": 48,
      "start": 277.32000732421875,
      "end": 284.32000732421875,
      "text": " you will see the phrase where the Bible says, I praise you not. They weren't doing the"
    },
    {
      "id": 49,
      "start": 284.32000732421875,
      "end": 287.32000732421875,
      "text": " things that they were supposed to or they weren't observing it the way that they were"
    },
    {
      "id": 50,
      "start": 287.32000732421875,
      "end": 293.32000732421875,
      "text": " supposed to. So we pick it up in verse number 23 and the Bible says this, for I have received"
    },
    {
      "id": 51,
      "start": 293.32000732421875,
      "end": 300.32000732421875,
      "text": " of the Lord that which also I delivered unto you. I'm thankful that the Apostle Paul,"
    },
    {
      "id": 52,
      "start": 300.32000732421875,
      "end": 305.32000732421875,
      "text": " as he's writing to this local church, of course we understand that all Scripture is given"
    },
    {
      "id": 53,
      "start": 305.32000732421875,
      "end": 309.32000732421875,
      "text": " by inspiration of God, but Paul isn't just sitting there saying, well let me give you"
    },
    {
      "id": 54,
      "start": 309.32000732421875,
      "end": 314.32000732421875,
      "text": " my opinion on how this is supposed to work and this is probably the most practical way."
    },
    {
      "id": 55,
      "start": 314.32000732421875,
      "end": 320.32000732421875,
      "text": " No, he says, I'm telling you I have received of the Lord that which also I delivered unto you."
    },
    {
      "id": 56,
      "start": 320.32000732421875,
      "end": 325.32000732421875,
      "text": " Notice he says that the Lord Jesus, the same night which he was betrayed, took bread."
    },
    {
      "id": 57,
      "start": 325.32000732421875,
      "end": 330.32000732421875,
      "text": " So what's he referring back to is referring back to as we would study in the gospel records"
    },
    {
      "id": 58,
      "start": 330.32000732421875,
      "end": 336.32000732421875,
      "text": " where this, the Lord's Supper, was instituted by Christ before his crucifixion."
    },
    {
      "id": 59,
      "start": 336.32000732421875,
      "end": 342.32000732421875,
      "text": " Verse 24, when he had given thanks, he break it, that bread, and said,"
    },
    {
      "id": 60,
      "start": 342.32000732421875,
      "end": 349.32000732421875,
      "text": " take ye, this is my body which is broken for you, this do in remembrance of me."
    },
    {
      "id": 61,
      "start": 349.32000732421875,
      "end": 353.32000732421875,
      "text": " After the same manner also he took the cup when he had supped, saying, this cup is the"
    },
    {
      "id": 62,
      "start": 353.32000732421875,
      "end": 359.32000732421875,
      "text": " New Testament in my blood, this do ye as often as you drink it in remembrance of me."
    },
    {
      "id": 63,
      "start": 359.32000732421875,
      "end": 365.32000732421875,
      "text": " We've seen in verse number 24 and again in verse number 25 that phrase of in remembrance of me."
    },
    {
      "id": 64,
      "start": 365.32000732421875,
      "end": 369.32000732421875,
      "text": " In verse number 26 the Bible says for as often as you eat this bread and drink this cup"
    },
    {
      "id": 65,
      "start": 369.32000732421875,
      "end": 372.32000732421875,
      "text": " you do show the Lord's death till he come."
    },
    {
      "id": 66,
      "start": 372.32000732421875,
      "end": 377.32000732421875,
      "text": " I can't tell you how many times I've been asked over the years is how often are we supposed"
    },
    {
      "id": 67,
      "start": 377.32000732421875,
      "end": 379.32000732421875,
      "text": " to observe the Lord's Supper."
    },
    {
      "id": 68,
      "start": 379.32000732421875,
      "end": 385.32000732421875,
      "text": " Well, the Bible just says as often as you do and there is no prescribed time frame"
    },
    {
      "id": 69,
      "start": 385.32000732421875,
      "end": 390.32000732421875,
      "text": " in which you are to do to observe the Lord's Supper and so you'll find that there are churches"
    },
    {
      "id": 70,
      "start": 390.32000732421875,
      "end": 394.32000732421875,
      "text": " that observe it on varying schedules and calendars and what have you."
    },
    {
      "id": 71,
      "start": 394.32000732421875,
      "end": 399.32000732421875,
      "text": " But we find that the instruction is for as often as you eat this bread and drink this cup"
    },
    {
      "id": 72,
      "start": 399.32000732421875,
      "end": 402.32000732421875,
      "text": " you do show the Lord's death till he come."
    },
    {
      "id": 73,
      "start": 402.32000732421875,
      "end": 408.32000732421875,
      "text": " Notice verse 27, wherefore, whosoever shall eat this bread and drink this cup of the Lord"
    },
    {
      "id": 74,
      "start": 408.32000732421875,
      "end": 414.32000732421875,
      "text": " unworthily shall be guilty of the body and blood of the Lord."
    },
    {
      "id": 75,
      "start": 414.32000732421875,
      "end": 416.32000732421875,
      "text": " See, this is exactly what the church was doing in Corinth."
    },
    {
      "id": 76,
      "start": 416.32000732421875,
      "end": 421.32000732421875,
      "text": " They were not approaching the Lord's table in a reverent manner in the manner in which"
    },
    {
      "id": 77,
      "start": 421.32000732421875,
      "end": 422.32000732421875,
      "text": " they were supposed to."
    },
    {
      "id": 78,
      "start": 422.32000732421875,
      "end": 428.32000732421875,
      "text": " And so Paul is dealing with them and he's saying that you've eaten this, you're unworthy"
    },
    {
      "id": 79,
      "start": 428.32000732421875,
      "end": 431.32000732421875,
      "text": " in your approach and he says that you're guilty of the body and blood of the Lord."
    },
    {
      "id": 80,
      "start": 431.32000732421875,
      "end": 434.32000732421875,
      "text": " Notice, but let a man examine himself."
    },
    {
      "id": 81,
      "start": 434.32000732421875,
      "end": 439.32000732421875,
      "text": " And so let him eat of that bread and drink of that cup for he that eateth and drinketh"
    },
    {
      "id": 82,
      "start": 439.32000732421875,
      "end": 446.32000732421875,
      "text": " unworthily eateth and drinketh damnation to himself not discerning the Lord's body."
    },
    {
      "id": 83,
      "start": 446.32000732421875,
      "end": 450.32000732421875,
      "text": " For this cause many are weak and sickly among you and many sleep."
    },
    {
      "id": 84,
      "start": 450.32000732421875,
      "end": 454.32000732421875,
      "text": " For if we would judge ourselves we should not be judged but when we are judged we are"
    },
    {
      "id": 85,
      "start": 454.32000732421875,
      "end": 459.32000732421875,
      "text": " chastened of the Lord that we should not be condemned with the world."
    },
    {
      "id": 86,
      "start": 459.32000732421875,
      "end": 464.32000732421875,
      "text": " It's important by way of introduction that we understand this evening that this instruction"
    },
    {
      "id": 87,
      "start": 464.32000732421875,
      "end": 467.32000732421875,
      "text": " with regard to the Lord's Supper is written to the local church."
    },
    {
      "id": 88,
      "start": 467.32000732421875,
      "end": 473.32000732421875,
      "text": " We'd understand this evening that the local church is made up of individuals that are"
    },
    {
      "id": 89,
      "start": 473.32000732421875,
      "end": 476.32000732421875,
      "text": " saved and baptized."
    },
    {
      "id": 90,
      "start": 476.32000732421875,
      "end": 478.32000732421875,
      "text": " So I become a member of a church."
    },
    {
      "id": 91,
      "start": 478.32000732421875,
      "end": 481.32000732421875,
      "text": " You know, I have somebody come and say, hey, I want to join the church."
    },
    {
      "id": 92,
      "start": 481.32000732421875,
      "end": 483.32000732421875,
      "text": " Okay, that's wonderful."
    },
    {
      "id": 93,
      "start": 483.32000732421875,
      "end": 485.32000732421875,
      "text": " First, talk to me about when you got saved."
    },
    {
      "id": 94,
      "start": 485.32000732421875,
      "end": 486.32000732421875,
      "text": " Why?"
    },
    {
      "id": 95,
      "start": 486.32000732421875,
      "end": 491.32000732421875,
      "text": " Well, because church membership requires, the prerequisite for church membership is"
    },
    {
      "id": 96,
      "start": 491.32000732421875,
      "end": 495.32000732421875,
      "text": " that you're saved and that you're scripturally baptized."
    },
    {
      "id": 97,
      "start": 495.32000732421875,
      "end": 500.32000732421875,
      "text": " And so we find that he is writing here, under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 98,
      "start": 500.32000732421875,
      "end": 504.32000732421875,
      "text": " he's writing to a church that's made up of believers."
    },
    {
      "id": 99,
      "start": 504.32000732421875,
      "end": 509.32000732421875,
      "text": " So we understand that the Lord's Supper is for God's people."
    },
    {
      "id": 100,
      "start": 509.32000732421875,
      "end": 511.32000732421875,
      "text": " The Lord's Supper is not for everyone."
    },
    {
      "id": 101,
      "start": 511.32000732421875,
      "end": 513.3200073242188,
      "text": " The Lord's Supper is not for lost people."
    },
    {
      "id": 102,
      "start": 513.3200073242188,
      "end": 514.3200073242188,
      "text": " Amen?"
    },
    {
      "id": 103,
      "start": 514.3200073242188,
      "end": 516.3200073242188,
      "text": " The Lord's Supper is for saved people."
    },
    {
      "id": 104,
      "start": 516.3200073242188,
      "end": 519.3200073242188,
      "text": " And not only is the Lord's Supper for saved people, it's not for lost people, but we'd"
    },
    {
      "id": 105,
      "start": 519.3200073242188,
      "end": 524.3200073242188,
      "text": " also say this, that the Lord's Supper is a memorial."
    },
    {
      "id": 106,
      "start": 524.3200073242188,
      "end": 525.3200073242188,
      "text": " It cannot save you."
    },
    {
      "id": 107,
      "start": 525.3200073242188,
      "end": 528.3200073242188,
      "text": " It cannot, there's no extra grace."
    },
    {
      "id": 108,
      "start": 528.3200073242188,
      "end": 533.3200073242188,
      "text": " There's nothing that happens to these elements when we pray here in just a little while and"
    },
    {
      "id": 109,
      "start": 533.3200073242188,
      "end": 538.3200073242188,
      "text": " all that takes place, no, they still remain the same elements that they are, but they're"
    },
    {
      "id": 110,
      "start": 538.3200073242188,
      "end": 540.3200073242188,
      "text": " a picture, they're a memorial."
    },
    {
      "id": 111,
      "start": 540.3200073242188,
      "end": 545.3200073242188,
      "text": " Jesus said, this is my body when he took that bread, and he said, take, eat, this is my"
    },
    {
      "id": 112,
      "start": 545.3200073242188,
      "end": 549.3200073242188,
      "text": " body, which is broken for you, this do in remembrance of me."
    },
    {
      "id": 113,
      "start": 549.3200073242188,
      "end": 554.3200073242188,
      "text": " Then when he speaks about the cup, he says, this cup is the New Testament in my blood,"
    },
    {
      "id": 114,
      "start": 554.3200073242188,
      "end": 557.3200073242188,
      "text": " this do ye as often as you drink it in remembrance of me."
    },
    {
      "id": 115,
      "start": 557.3200073242188,
      "end": 562.3200073242188,
      "text": " And so we understand this evening, we speak about the Lord's Supper, the Lord's table,"
    },
    {
      "id": 116,
      "start": 562.3200073242188,
      "end": 566.3200073242188,
      "text": " that there's no saving grace in these elements."
    },
    {
      "id": 117,
      "start": 566.3200073242188,
      "end": 571.3200073242188,
      "text": " There's no ability for these elements to do anything to help you get to heaven."
    },
    {
      "id": 118,
      "start": 571.3200073242188,
      "end": 574.3200073242188,
      "text": " That's all been settled at Calvary."
    },
    {
      "id": 119,
      "start": 574.3200073242188,
      "end": 575.3200073242188,
      "text": " Amen."
    },
    {
      "id": 120,
      "start": 575.3200073242188,
      "end": 579.3200073242188,
      "text": " I'm thankful for the finished work of Christ at Calvary, the death, burial, and glorious"
    },
    {
      "id": 121,
      "start": 579.3200073242188,
      "end": 581.3200073242188,
      "text": " resurrection of our Savior."
    },
    {
      "id": 122,
      "start": 581.3200073242188,
      "end": 584.3200073242188,
      "text": " And we understand this evening that this is a memorial."
    },
    {
      "id": 123,
      "start": 584.3200073242188,
      "end": 585.3200073242188,
      "text": " It's a picture."
    },
    {
      "id": 124,
      "start": 585.3200073242188,
      "end": 586.3200073242188,
      "text": " It's important."
    },
    {
      "id": 125,
      "start": 586.3200073242188,
      "end": 587.3200073242188,
      "text": " It's necessary."
    },
    {
      "id": 126,
      "start": 587.3200073242188,
      "end": 592.3200073242188,
      "text": " We find that there are two ordinances that God has given us as New Testament churches."
    },
    {
      "id": 127,
      "start": 592.3200073242188,
      "end": 594.3200073242188,
      "text": " One, the Lord's Supper."
    },
    {
      "id": 128,
      "start": 594.3200073242188,
      "end": 596.3200073242188,
      "text": " The other is baptism."
    },
    {
      "id": 129,
      "start": 596.3200073242188,
      "end": 599.3200073242188,
      "text": " Isn't it interesting that both of them remind us of the..."
    },
    {
      "id": 0,
      "start": 599.3200073242188,
      "end": 604.2800073623657,
      "text": " death, burial, and resurrection of our Lord and Savior Jesus Christ."
    },
    {
      "id": 1,
      "start": 604.2800073623657,
      "end": 609.1600074768066,
      "text": " Why? Because without that truth we have nothing."
    },
    {
      "id": 2,
      "start": 609.1600074768066,
      "end": 612.3600072860718,
      "text": " If Christ did not... somebody asked this question during Easter."
    },
    {
      "id": 3,
      "start": 612.3600072860718,
      "end": 616.3600082397461,
      "text": " A question was posed to a number of people and I was one of them."
    },
    {
      "id": 4,
      "start": 616.3600082397461,
      "end": 622.7600078582764,
      "text": " What's more important, Christmas or Easter? And I said the answer is yes."
    },
    {
      "id": 5,
      "start": 623.8000068664551,
      "end": 628.3600082397461,
      "text": " Listen, if he wasn't born he couldn't die."
    },
    {
      "id": 6,
      "start": 628.6800079345703,
      "end": 633.640007019043,
      "text": " Right? He was born to die. If he didn't die he couldn't rise."
    },
    {
      "id": 7,
      "start": 635.080005645752,
      "end": 637.4800071716309,
      "text": " Right? They're all... they're equally necessary."
    },
    {
      "id": 8,
      "start": 638.1200065612793,
      "end": 643.1600074768066,
      "text": " And in God's infinite wisdom he sent forth his Son, born of a virgin,"
    },
    {
      "id": 9,
      "start": 643.1600074768066,
      "end": 646.3600082397461,
      "text": " for what purpose? To redeem mankind."
    },
    {
      "id": 10,
      "start": 646.3600082397461,
      "end": 651.8800086975098,
      "text": " And both of the ordinances that the Lord has given to the local church remind us"
    },
    {
      "id": 11,
      "start": 651.8800086975098,
      "end": 655.1600074768066,
      "text": " of that which is so important to our faith,"
    },
    {
      "id": 12,
      "start": 655.1600074768066,
      "end": 658.6800079345703,
      "text": " the death, burial, and resurrection. It is our faith."
    },
    {
      "id": 13,
      "start": 658.6800079345703,
      "end": 663.5600051879883,
      "text": " And we find this evening that this do in remembrance of me."
    },
    {
      "id": 14,
      "start": 663.5600051879883,
      "end": 665.8800048828125,
      "text": " So we're going to think about the Lord's Supper, the Lord's Table,"
    },
    {
      "id": 15,
      "start": 665.8800048828125,
      "end": 669.2400054931641,
      "text": " as we observe it this evening. Just a few thoughts for you tonight."
    },
    {
      "id": 16,
      "start": 669.2400054931641,
      "end": 673.0000076293945,
      "text": " Number one, if you are taking notes, it is a time to remember."
    },
    {
      "id": 17,
      "start": 673.8800048828125,
      "end": 677.4800109863281,
      "text": " It's a time to remember. I started to use the word reflect"
    },
    {
      "id": 18,
      "start": 677.4800109863281,
      "end": 681.0800094604492,
      "text": " and I think that it could be an appropriate word as well."
    },
    {
      "id": 19,
      "start": 681.7200088500977,
      "end": 687.5600051879883,
      "text": " But I think about the word remember and the context in which we find in the Old Testament"
    },
    {
      "id": 20,
      "start": 687.5600051879883,
      "end": 693.1600036621094,
      "text": " where so often the people of God were given this bit of instruction of"
    },
    {
      "id": 21,
      "start": 693.1600036621094,
      "end": 697.4800109863281,
      "text": " beware lest thou forget. And we find over and over,"
    },
    {
      "id": 22,
      "start": 698.6800079345703,
      "end": 702.4400100708008,
      "text": " as you would look at the nation of Israel, the children of Israel,"
    },
    {
      "id": 23,
      "start": 702.4400100708008,
      "end": 707.8800048828125,
      "text": " how that they would receive that reminder that they would beware lest they forget."
    },
    {
      "id": 24,
      "start": 707.8800048828125,
      "end": 711.8000106811523,
      "text": " And then you would find the indictment that is brought against the children of Israel"
    },
    {
      "id": 25,
      "start": 711.8000106811523,
      "end": 715.4000091552734,
      "text": " where they're told that you have forgotten God days without number."
    },
    {
      "id": 26,
      "start": 716.5200042724609,
      "end": 720.1200103759766,
      "text": " Begin to think about this truth of a time to remember."
    },
    {
      "id": 27,
      "start": 720.1200103759766,
      "end": 726.2000045776367,
      "text": " So often in our society today things go so quickly and our pace of life is so rapid"
    },
    {
      "id": 28,
      "start": 726.2000045776367,
      "end": 731.8800048828125,
      "text": " and there's just our schedules are so packed and I understand how busy it is."
    },
    {
      "id": 29,
      "start": 732.0400085449219,
      "end": 738.8400115966797,
      "text": " We think about this truth of Psalms where the psalmist says be still and know that I'm God."
    },
    {
      "id": 30,
      "start": 740.0400085449219,
      "end": 745.7200012207031,
      "text": " And I think about the Lord's Supper provides for us a time to remember."
    },
    {
      "id": 31,
      "start": 745.7200012207031,
      "end": 749.9600067138672,
      "text": " A time to remember what? Well, I believe that what we would remember"
    },
    {
      "id": 32,
      "start": 749.9600067138672,
      "end": 754.6000061035156,
      "text": " is the greatest sacrifice that it was ever made. Sometimes we talk about sacrifice."
    },
    {
      "id": 33,
      "start": 754.6000061035156,
      "end": 760.2000122070312,
      "text": " In fact, there are times in which people will speak about those that are servants of the Lord"
    },
    {
      "id": 34,
      "start": 760.2000122070312,
      "end": 764.5200042724609,
      "text": " and they'll speak about their sacrifice of service or duty."
    },
    {
      "id": 35,
      "start": 764.5200042724609,
      "end": 766.760009765625,
      "text": " There's a preacher of yesteryear that said,"
    },
    {
      "id": 36,
      "start": 766.760009765625,
      "end": 770.6000061035156,
      "text": " do not call my duty for God's service, it's but a privilege."
    },
    {
      "id": 37,
      "start": 771.3200073242188,
      "end": 775.3200073242188,
      "text": " What a great perspective. But there are some that use that term sacrifice"
    },
    {
      "id": 38,
      "start": 775.3200073242188,
      "end": 781.8000030517578,
      "text": " and I would say that the greatest sacrifice of all time, of all of the history of humankind,"
    },
    {
      "id": 39,
      "start": 781.8000030517578,
      "end": 786.2000122070312,
      "text": " the greatest sacrifice is when the Lord Jesus Christ went up a hill called Calvary."
    },
    {
      "id": 40,
      "start": 786.9200134277344,
      "end": 792.4400024414062,
      "text": " When God in flesh took your place and my place on the cross, it's the greatest sacrifice."
    },
    {
      "id": 41,
      "start": 793.3200073242188,
      "end": 799.0800018310547,
      "text": " And I'm so thankful that this, the Lord's Supper, gives us an opportunity to remember"
    },
    {
      "id": 42,
      "start": 799.0800018310547,
      "end": 804.1200103759766,
      "text": " what he did for us. I would say this evening that that greatest sacrifice was a sacrifice"
    },
    {
      "id": 43,
      "start": 804.1200103759766,
      "end": 810.1200103759766,
      "text": " that was motivated by love. For God so loved the world that he gave his only begotten son,"
    },
    {
      "id": 44,
      "start": 810.1200103759766,
      "end": 813.4800109863281,
      "text": " that whosoever believeth in him should not perish but have everlasting life,"
    },
    {
      "id": 45,
      "start": 813.4800109863281,
      "end": 816.2800140380859,
      "text": " whosoever believeth in him should not perish but have everlasting life."
    },
    {
      "id": 46,
      "start": 816.2800140380859,
      "end": 823.4000091552734,
      "text": " And this greatest sacrifice was motivated by love and I'm thankful for his great love."
    },
    {
      "id": 47,
      "start": 824.9200134277344,
      "end": 830.9200134277344,
      "text": " This evening we read in verses 24 and 25 how that we remember that great sacrifice."
    },
    {
      "id": 48,
      "start": 830.9200134277344,
      "end": 834.6000061035156,
      "text": " Notice the Bible says, and when he had given thanks, he break it and said,"
    },
    {
      "id": 49,
      "start": 834.6000061035156,
      "end": 839.4000091552734,
      "text": " take, eat, notice this is my body which is broken for you."
    },
    {
      "id": 50,
      "start": 839.9600067138672,
      "end": 847.1600036621094,
      "text": " You see the personal aspect, it was broken for you. I'm thankful that the Lord Jesus Christ was"
    },
    {
      "id": 51,
      "start": 847.1600036621094,
      "end": 855.8800048828125,
      "text": " willing to endure such pain and suffering. It says that his body was broken for you."
    },
    {
      "id": 52,
      "start": 855.8800048828125,
      "end": 861.4800109863281,
      "text": " We understand that his bones were not broken. You can read of the prophecy in the Psalms about not"
    },
    {
      "id": 53,
      "start": 861.4800109863281,
      "end": 866.9200134277344,
      "text": " a bone being broken, but they were out of joint and we can see the great suffering in how his"
    },
    {
      "id": 54,
      "start": 866.9200134277344,
      "end": 871.9600219726562,
      "text": " body, you think about the cat of nine tails and how they would whip him and they buffeted him and"
    },
    {
      "id": 55,
      "start": 871.9600219726562,
      "end": 877.2400207519531,
      "text": " all that they did and he says, this is my body which is broken for you. And then he speaks about"
    },
    {
      "id": 56,
      "start": 877.2400207519531,
      "end": 883.6400146484375,
      "text": " the blood. As Baptists we've often said it's the book, the blood and the blessed hope. And I'm so"
    },
    {
      "id": 57,
      "start": 883.6400146484375,
      "end": 889.0,
      "text": " thankful for the blood of Christ. And he says in verse 25, and after the same manner also he took"
    },
    {
      "id": 58,
      "start": 889.0,
      "end": 893.5599975585938,
      "text": " the cup when he had stopped saying this cup is the New Testament in my blood, this do you as"
    },
    {
      "id": 59,
      "start": 893.5599975585938,
      "end": 899.6400146484375,
      "text": " often as you drink it in remembrance of me. Listen, without the shedding of blood there is no remission."
    },
    {
      "id": 60,
      "start": 899.6400146484375,
      "end": 904.6799926757812,
      "text": " That's what God says in the book of Hebrews. And the blood is absolutely necessary. The blood is"
    },
    {
      "id": 61,
      "start": 904.6799926757812,
      "end": 909.5599975585938,
      "text": " the only way to have forgiveness. You know that there are some modern translations that take the"
    },
    {
      "id": 62,
      "start": 909.5599975585938,
      "end": 915.7200012207031,
      "text": " blood out of the scriptures. A passage of scripture, you don't need to turn there, that's so"
    },
    {
      "id": 63,
      "start": 915.7200012207031,
      "end": 921.7200012207031,
      "text": " vital and so important that we'd understand the teaching of forgiveness and reconciliation."
    },
    {
      "id": 64,
      "start": 921.7200012207031,
      "end": 927.5599975585938,
      "text": " Colossians in chapter number 1 and verse number 14, the Bible says in whom we have redemption"
    },
    {
      "id": 65,
      "start": 928.1199951171875,
      "end": 936.52001953125,
      "text": " through his blood even the forgiveness of sins. What a powerful verse of scripture. What a"
    },
    {
      "id": 66,
      "start": 936.52001953125,
      "end": 942.1199951171875,
      "text": " simple truth of God's word but how powerful it is. And yet we find that many of the modern"
    },
    {
      "id": 67,
      "start": 942.1199951171875,
      "end": 947.7200012207031,
      "text": " translations today, you know what they take out of that verse of scripture? Through his blood."
    },
    {
      "id": 68,
      "start": 947.7200012207031,
      "end": 952.6799926757812,
      "text": " There's no way to have redemption or forgiveness if there's no mention of the blood."
    },
    {
      "id": 69,
      "start": 953.4800109863281,
      "end": 958.6799926757812,
      "text": " Without the shedding of blood there is no remission. We find that as we observe the"
    },
    {
      "id": 70,
      "start": 958.6799926757812,
      "end": 965.9600219726562,
      "text": " Lord's table, this opportunity for us to have a time to remember, to remember the great price"
    },
    {
      "id": 71,
      "start": 965.9600219726562,
      "end": 977.0,
      "text": " that was paid for our salvation. Listen, salvation is a free gift for us. It cost our Savior everything."
    },
    {
      "id": 72,
      "start": 977.9600219726562,
      "end": 984.8399963378906,
      "text": " You think about buying a gift for someone and you buy a gift for them, they give you the gift,"
    },
    {
      "id": 73,
      "start": 984.8399963378906,
      "end": 990.760009765625,
      "text": " you're the recipient of a gift, it didn't cost you anything. But it cost the individual that gave you"
    },
    {
      "id": 74,
      "start": 990.760009765625,
      "end": 997.8000183105469,
      "text": " that gift a certain sum of money. We find that as we think of this gift, it did not cost money,"
    },
    {
      "id": 75,
      "start": 997.8000183105469,
      "end": 1004.3600158691406,
      "text": " it was not purchased with gold and silver, with corruptible things. But according to what Peter"
    },
    {
      "id": 76,
      "start": 1004.3600158691406,
      "end": 1011.3200073242188,
      "text": " says, we find that it was paid for, it was purchased with the precious blood of Christ."
    },
    {
      "id": 77,
      "start": 1012.0400085449219,
      "end": 1017.2400207519531,
      "text": " No wonder that John, he says, John the Baptist as he sees Jesus,"
    },
    {
      "id": 78,
      "start": 1017.2400207519531,
      "end": 1026.4400024414062,
      "text": " behold the Lamb of God which taketh away the sin of the world. This greatest sacrifice was"
    },
    {
      "id": 79,
      "start": 1026.4400024414062,
      "end": 1032.9200134277344,
      "text": " motivated by love but this greatest sacrifice results in reconciliation. It's a wonderful thing"
    },
    {
      "id": 80,
      "start": 1032.9200134277344,
      "end": 1040.0400085449219,
      "text": " to be reconciled to God. We're in enmity with God, we were separated from God, we were His enemies,"
    },
    {
      "id": 81,
      "start": 1040.0400085449219,
      "end": 1045.4800109863281,
      "text": " we could not approach God but because of Jesus, because of what He did on that cross,"
    },
    {
      "id": 82,
      "start": 1046.6000061035156,
      "end": 1055.3999938964844,
      "text": " He offers that forgiveness. That which was not possible of our own merit, of our own work,"
    },
    {
      "id": 83,
      "start": 1055.3999938964844,
      "end": 1061.0,
      "text": " is now possible through the blood of Christ, reconciled, that work of reconciliation."
    },
    {
      "id": 84,
      "start": 1061.6400146484375,
      "end": 1067.5599975585938,
      "text": " What a blessing. The Lord's Table gives us an opportunity for a time to remember. I would say"
    },
    {
      "id": 85,
      "start": 1067.5599975585938,
      "end": 1072.760009765625,
      "text": " number two this evening, if you're taking notes, a time not only to remember but a time to rejoice."
    },
    {
      "id": 86,
      "start": 1073.4800109863281,
      "end": 1079.4800109863281,
      "text": " Time to rejoice. I'm so thankful that Jesus was willing to go to that cross. Aren't you? I mean,"
    },
    {
      "id": 87,
      "start": 1079.4800109863281,
      "end": 1084.1199951171875,
      "text": " we ought to rejoice greatly for the great salvation that we have through Jesus Christ."
    },
    {
      "id": 88,
      "start": 1084.1199951171875,
      "end": 1089.9600219726562,
      "text": " What a blessing to know that He was willing and He went to the cruel cross, He paid the"
    },
    {
      "id": 89,
      "start": 1089.9600219726562,
      "end": 1097.6400146484375,
      "text": " awful price, the awful penalty so that we could be redeemed and we rejoice in the finished work"
    },
    {
      "id": 90,
      "start": 1097.6400146484375,
      "end": 1108.52001953125,
      "text": " of Christ. He said on the cross, it is finished. Hallelujah. What a blessing. I hope that regularly"
    },
    {
      "id": 91,
      "start": 1108.52001953125,
      "end": 1118.0399780273438,
      "text": " in your life that you rejoice to know that you're saved. You rejoice in remembering what Christ did"
    },
    {
      "id": 92,
      "start": 1118.0399780273438,
      "end": 1124.6000366210938,
      "text": " for you on the cross of Calvary. I would say this evening that not only would it be a time to rejoice"
    },
    {
      "id": 93,
      "start": 1124.6000366210938,
      "end": 1129.6400146484375,
      "text": " because of the finished work of Christ at Calvary, but we'd find from verse number 26, continue"
    },
    {
      "id": 94,
      "start": 1129.6400146484375,
      "end": 1134.2000122070312,
      "text": " reading with me there in 1 Corinthians 11, the Bible says for as often as you eat this bread"
    },
    {
      "id": 95,
      "start": 1134.2000122070312,
      "end": 1144.1199951171875,
      "text": " and drink this cup, notice ye do show the Lord's death till He come. I hope that you're rejoicing"
    },
    {
      "id": 96,
      "start": 1144.1199951171875,
      "end": 1148.280029296875,
      "text": " in that wonderful promise. We say that we rejoice because of the finished work of Christ"
    },
    {
      "id": 97,
      "start": 1148.280029296875,
      "end": 1155.0,
      "text": " and we should rejoice because of the future coming of Christ. It says that ye do show His death"
    },
    {
      "id": 98,
      "start": 1155.0,
      "end": 1162.1199951171875,
      "text": " till He come. I don't know when He's going to come, but I know He's coming. Amen? I don't know"
    },
    {
      "id": 99,
      "start": 1162.1199951171875,
      "end": 1169.8800048828125,
      "text": " the date nor the hour and neither do you. No man does, but we can rest assured that God always does"
    },
    {
      "id": 100,
      "start": 1169.8800048828125,
      "end": 1174.280029296875,
      "text": " what He says He's going to do. And we find that He gave that wonderful promise that He's coming"
    },
    {
      "id": 101,
      "start": 1174.280029296875,
      "end": 1180.760009765625,
      "text": " again and He wants the church to be reminded that time of remembrance, that time of reflection."
    },
    {
      "id": 102,
      "start": 1180.760009765625,
      "end": 1186.8400268554688,
      "text": " He wants us to rejoice in understanding that He finished, He completed the work for our redemption"
    },
    {
      "id": 103,
      "start": 1187.5599975585938,
      "end": 1192.9199829101562,
      "text": " there at the cross of Calvary, but He wants us to understand and to rejoice in His future coming."
    },
    {
      "id": 104,
      "start": 1193.6400146484375,
      "end": 1198.760009765625,
      "text": " You think about the motivation of the coming of Christ, the promise of His coming and what it"
    },
    {
      "id": 105,
      "start": 1198.760009765625,
      "end": 1199.239990234375,
      "text": " should do."
    },
    {
      "id": 0,
      "start": 1199.239990234375,
      "end": 1206.5199904441833,
      "text": " in the life of a believer and how it should motivate us to live for Jesus every single day."
    },
    {
      "id": 1,
      "start": 1206.5199904441833,
      "end": 1213.359990119934,
      "text": " We'd live with that awareness, that understanding that today could be the day."
    },
    {
      "id": 2,
      "start": 1213.359990119934,
      "end": 1220.7799911499023,
      "text": " The reality is that we understand that the Bible teaches that there's the imminent return of the Lord Jesus Christ,"
    },
    {
      "id": 3,
      "start": 1220.7799911499023,
      "end": 1223.7799911499023,
      "text": " that the rapture could take place at any moment."
    },
    {
      "id": 4,
      "start": 1223.7799911499023,
      "end": 1229.4799900054932,
      "text": " But the Bible also teaches, as I mentioned this morning, that our life is but a vapor"
    },
    {
      "id": 5,
      "start": 1229.4799900054932,
      "end": 1234.0199890136719,
      "text": " that appears for a little time and then vanisheth away."
    },
    {
      "id": 6,
      "start": 1234.0199890136719,
      "end": 1237.8599891662598,
      "text": " And so really there are two factors that we should consider every single day."
    },
    {
      "id": 7,
      "start": 1237.8599891662598,
      "end": 1239.9799919128418,
      "text": " Number one, Jesus could come back."
    },
    {
      "id": 8,
      "start": 1239.9799919128418,
      "end": 1246.3199920654297,
      "text": " Number two, I could take my final breath and depart this world in death every single day."
    },
    {
      "id": 9,
      "start": 1246.3199920654297,
      "end": 1255.239990234375,
      "text": " Those two truths are great motivators for God's people to live every day for His honor and for His glory."
    },
    {
      "id": 10,
      "start": 1255.239990234375,
      "end": 1258.4799919128418,
      "text": " Because what if today were the last day?"
    },
    {
      "id": 11,
      "start": 1258.4799919128418,
      "end": 1263.739990234375,
      "text": " What if you knew that today was the last day you'd ever live upon this earth?"
    },
    {
      "id": 12,
      "start": 1263.739990234375,
      "end": 1266.1999893188477,
      "text": " What is it that you would do?"
    },
    {
      "id": 13,
      "start": 1266.1999893188477,
      "end": 1272.6599884033203,
      "text": " There are people that receive medical diagnosis of cancer and various ailments and what have you,"
    },
    {
      "id": 14,
      "start": 1272.6599884033203,
      "end": 1279.0799865722656,
      "text": " and doctors will give estimates with regard to how much time they believe they would have to live upon this earth."
    },
    {
      "id": 15,
      "start": 1279.0799865722656,
      "end": 1282.6599884033203,
      "text": " And they begin to talk, and you've heard the term, I've heard the term."
    },
    {
      "id": 16,
      "start": 1282.6599884033203,
      "end": 1291.5399932861328,
      "text": " People talk about having a bucket list, a list of things they'd like to do while they have time here upon this earth."
    },
    {
      "id": 17,
      "start": 1291.5399932861328,
      "end": 1300.4999923706055,
      "text": " So many of the things that would fill people's bucket lists for God's people are not even things that we should really even..."
    },
    {
      "id": 18,
      "start": 1300.4999923706055,
      "end": 1306.0399932861328,
      "text": " I mean, they don't take that priority, that level of importance."
    },
    {
      "id": 19,
      "start": 1306.0399932861328,
      "end": 1310.2599868774414,
      "text": " See, this evening, Jesus is coming again."
    },
    {
      "id": 20,
      "start": 1310.2599868774414,
      "end": 1312.2599868774414,
      "text": " I'm rejoicing in that truth."
    },
    {
      "id": 21,
      "start": 1312.2599868774414,
      "end": 1318.2599868774414,
      "text": " Jesus said, I will come again and receive you unto myself that where I am there you may be also."
    },
    {
      "id": 22,
      "start": 1318.2599868774414,
      "end": 1319.2599868774414,
      "text": " Listen for the trumpet."
    },
    {
      "id": 23,
      "start": 1319.2599868774414,
      "end": 1322.0399932861328,
      "text": " The songwriter said, Jesus is coming."
    },
    {
      "id": 24,
      "start": 1322.0399932861328,
      "end": 1327.8399963378906,
      "text": " And 1 John 3 says it this way."
    },
    {
      "id": 25,
      "start": 1328.1799926757812,
      "end": 1336.1799926757812,
      "text": " I think about John writing, and John had heard that wonderful promise of Jesus when he said, I will come again."
    },
    {
      "id": 26,
      "start": 1336.1799926757812,
      "end": 1342.1799926757812,
      "text": " And in 1 John 3, John the Apostle, he says this in verse number 1,"
    },
    {
      "id": 27,
      "start": 1342.1799926757812,
      "end": 1348.1799926757812,
      "text": " Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God."
    },
    {
      "id": 28,
      "start": 1348.1799926757812,
      "end": 1354.1799926757812,
      "text": " Therefore the world knoweth us not, because it knew him not, beloved, now are we the sons of God."
    },
    {
      "id": 29,
      "start": 1354.5199890136719,
      "end": 1358.5199890136719,
      "text": " Notice in verse 2, it says, And it doth not yet appear what we shall be,"
    },
    {
      "id": 30,
      "start": 1358.5199890136719,
      "end": 1366.5199890136719,
      "text": " but we know that when he shall appear we shall be like him, for we shall see him as he is."
    },
    {
      "id": 31,
      "start": 1366.5199890136719,
      "end": 1372.5199890136719,
      "text": " It's interesting, I'll read verse number 3 in just a moment, but if you were to go back to verse number 28 of chapter number 2"
    },
    {
      "id": 32,
      "start": 1372.5199890136719,
      "end": 1378.5199890136719,
      "text": " and notice this truth that is given, he says, And now, little children, abide in him."
    },
    {
      "id": 33,
      "start": 1378.5199890136719,
      "end": 1381.5199890136719,
      "text": " We just sang a song about abiding."
    },
    {
      "id": 34,
      "start": 1381.8599853515625,
      "end": 1389.8599853515625,
      "text": " That when he shall appear, not if he shall appear, it's a certain truth, it's a fact to be understood."
    },
    {
      "id": 35,
      "start": 1389.8599853515625,
      "end": 1395.8599853515625,
      "text": " When he shall appear, we may have confidence, and notice what it says,"
    },
    {
      "id": 36,
      "start": 1395.8599853515625,
      "end": 1402.8599853515625,
      "text": " and not be ashamed before him it is coming."
    },
    {
      "id": 37,
      "start": 1402.8599853515625,
      "end": 1408.8599853515625,
      "text": " You know, I believe, certainly possible, likely,"
    },
    {
      "id": 38,
      "start": 1409.1999969482422,
      "end": 1415.1999969482422,
      "text": " that there will be some of God's people that are going to be ashamed at the appearing of Jesus Christ."
    },
    {
      "id": 39,
      "start": 1415.1999969482422,
      "end": 1419.1999969482422,
      "text": " I don't want to be in that company. I really don't."
    },
    {
      "id": 40,
      "start": 1419.1999969482422,
      "end": 1425.1999969482422,
      "text": " And he says, in verse number 3 of chapter number 3, when he talks about, again, he said in verse number 2,"
    },
    {
      "id": 41,
      "start": 1425.1999969482422,
      "end": 1430.1999969482422,
      "text": " when he shall appear, we see that in verse 28 of chapter 2, and now he says in chapter 3, in verse number 3,"
    },
    {
      "id": 42,
      "start": 1430.1999969482422,
      "end": 1434.1999969482422,
      "text": " And every man that hath this hope in him."
    },
    {
      "id": 43,
      "start": 1434.5399932861328,
      "end": 1438.5399932861328,
      "text": " We're talking about the book, the blood, and the blessed hope,"
    },
    {
      "id": 44,
      "start": 1438.5399932861328,
      "end": 1441.5399932861328,
      "text": " and he says, every man that hath this hope in him."
    },
    {
      "id": 45,
      "start": 1441.5399932861328,
      "end": 1451.5399932861328,
      "text": " Remember, hope, biblically speaking, the biblical definition of hope is that confident expectation."
    },
    {
      "id": 46,
      "start": 1451.5399932861328,
      "end": 1454.5399932861328,
      "text": " It's not the hope that the world talks about."
    },
    {
      "id": 47,
      "start": 1454.5399932861328,
      "end": 1457.5399780273438,
      "text": " I hope this is going to happen. I hope I get this, or I hope this."
    },
    {
      "id": 48,
      "start": 1457.5399780273438,
      "end": 1460.5399780273438,
      "text": " No, no, no. This is confident expectation."
    },
    {
      "id": 49,
      "start": 1460.5399780273438,
      "end": 1470.5399780273438,
      "text": " Every man that hath this hope in him, notice what it says, purifieth himself, even as he is pure."
    },
    {
      "id": 50,
      "start": 1470.5399780273438,
      "end": 1474.5399780273438,
      "text": " We know that he is holy. He is pure."
    },
    {
      "id": 51,
      "start": 1474.5399780273438,
      "end": 1476.5399780273438,
      "text": " We find that we are to purify ourselves."
    },
    {
      "id": 52,
      "start": 1476.5399780273438,
      "end": 1481.5399780273438,
      "text": " We find that the Bible teaches us, the Bible says this, that we are to be holy. Why?"
    },
    {
      "id": 53,
      "start": 1481.5399780273438,
      "end": 1484.5399780273438,
      "text": " For he is holy. Be holy, for I am holy."
    },
    {
      "id": 54,
      "start": 1484.5399780273438,
      "end": 1489.5399780273438,
      "text": " That's what the Lord says in all manner of conversation."
    },
    {
      "id": 55,
      "start": 1489.5399780273438,
      "end": 1492.5399780273438,
      "text": " We see that there's a time to remember, a time to rejoice,"
    },
    {
      "id": 56,
      "start": 1492.5399780273438,
      "end": 1497.5399780273438,
      "text": " and oh, how we should rejoice greatly when we partake of the Lord's Supper,"
    },
    {
      "id": 57,
      "start": 1497.5399780273438,
      "end": 1501.5399780273438,
      "text": " reminded of the finished work of Christ,"
    },
    {
      "id": 58,
      "start": 1501.5399780273438,
      "end": 1507.5399780273438,
      "text": " reminded of the future coming of Christ, and it causes the people of God to rejoice greatly."
    },
    {
      "id": 59,
      "start": 1507.5399780273438,
      "end": 1514.5399780273438,
      "text": " But I would say number three this evening, not only a time to remember, a time to rejoice,"
    },
    {
      "id": 60,
      "start": 1514.5399780273438,
      "end": 1518.5399780273438,
      "text": " but I would say it's a time to repent. A time to repent."
    },
    {
      "id": 61,
      "start": 1518.5399780273438,
      "end": 1521.5399780273438,
      "text": " This is what the Bible says in verse number 27."
    },
    {
      "id": 62,
      "start": 1521.5399780273438,
      "end": 1525.5399780273438,
      "text": " Wherefore, whosoever shall eat this bread and drink this cup of the Lord unworthily"
    },
    {
      "id": 63,
      "start": 1525.5399780273438,
      "end": 1528.5399780273438,
      "text": " shall be guilty of the body and blood of the Lord."
    },
    {
      "id": 64,
      "start": 1528.5399780273438,
      "end": 1532.5399780273438,
      "text": " If you were to go back into verse number 17 of this chapter, you'd note that the Bible says,"
    },
    {
      "id": 65,
      "start": 1532.5399780273438,
      "end": 1536.5399780273438,
      "text": " Now in this that I declare unto you, I praise you not,"
    },
    {
      "id": 66,
      "start": 1536.5399780273438,
      "end": 1540.5399780273438,
      "text": " that ye come together, not for the better, but for the worse."
    },
    {
      "id": 67,
      "start": 1540.5399780273438,
      "end": 1544.5399780273438,
      "text": " He's talking about what they were doing, what their behavior was,"
    },
    {
      "id": 68,
      "start": 1544.5399780273438,
      "end": 1548.5399780273438,
      "text": " and he's saying, I praise you not, you're not doing what you're supposed to be doing,"
    },
    {
      "id": 69,
      "start": 1548.5399780273438,
      "end": 1550.5399780273438,
      "text": " so he's going to correct them. Notice in verse 18,"
    },
    {
      "id": 70,
      "start": 1550.5399780273438,
      "end": 1553.5399780273438,
      "text": " For first of all, when ye come together in the church,"
    },
    {
      "id": 71,
      "start": 1553.5399780273438,
      "end": 1557.5399780273438,
      "text": " I hear that there be divisions among you, and I partly believe it."
    },
    {
      "id": 72,
      "start": 1557.5399780273438,
      "end": 1560.5399780273438,
      "text": " For there must be also heresies among you,"
    },
    {
      "id": 73,
      "start": 1560.5399780273438,
      "end": 1564.5399780273438,
      "text": " that they which are approved may be made manifest among you."
    },
    {
      "id": 74,
      "start": 1564.5399780273438,
      "end": 1568.5399780273438,
      "text": " When ye come together, therefore, into one place, this is not to eat the Lord's Supper."
    },
    {
      "id": 75,
      "start": 1568.5399780273438,
      "end": 1571.5399780273438,
      "text": " For in eating everyone taketh before other his own supper,"
    },
    {
      "id": 76,
      "start": 1571.5399780273438,
      "end": 1574.5399780273438,
      "text": " and one is hungry, and another is drunken. What?"
    },
    {
      "id": 77,
      "start": 1574.5399780273438,
      "end": 1577.5399780273438,
      "text": " Have ye not houses to eat and to drink in?"
    },
    {
      "id": 78,
      "start": 1577.5399780273438,
      "end": 1581.5399780273438,
      "text": " Or despise ye the church of God, and shame them that have not?"
    },
    {
      "id": 79,
      "start": 1581.5399780273438,
      "end": 1587.5399780273438,
      "text": " What shall I say to you? Shall I praise you in this? I praise you not."
    },
    {
      "id": 80,
      "start": 1587.5399780273438,
      "end": 1590.5399780273438,
      "text": " And so then he says in verse number 27, when he's giving this instruction,"
    },
    {
      "id": 81,
      "start": 1590.5399780273438,
      "end": 1594.5399780273438,
      "text": " Wherefore, whosoever shall eat this bread and drink this cup of the Lord unworthily,"
    },
    {
      "id": 82,
      "start": 1594.5399780273438,
      "end": 1597.5399780273438,
      "text": " shall be guilty of the body and blood of the Lord."
    },
    {
      "id": 83,
      "start": 1597.5399780273438,
      "end": 1599.5399780273438,
      "text": " This is a serious matter."
    },
    {
      "id": 84,
      "start": 1599.5399780273438,
      "end": 1601.5399780273438,
      "text": " It's not something to take lightly."
    },
    {
      "id": 85,
      "start": 1601.5399780273438,
      "end": 1603.5399780273438,
      "text": " It's time to repent."
    },
    {
      "id": 86,
      "start": 1603.5399780273438,
      "end": 1605.5399780273438,
      "text": " Notice he says this in verse 28,"
    },
    {
      "id": 87,
      "start": 1605.5399780273438,
      "end": 1608.5399780273438,
      "text": " But let a man examine himself."
    },
    {
      "id": 88,
      "start": 1608.5399780273438,
      "end": 1610.5399780273438,
      "text": " Let a man examine himself."
    },
    {
      "id": 89,
      "start": 1610.5399780273438,
      "end": 1618.5399780273438,
      "text": " And so let him eat of that bread and drink of that cup."
    },
    {
      "id": 90,
      "start": 1618.5399780273438,
      "end": 1620.5399780273438,
      "text": " As we look at this passage of Scripture,"
    },
    {
      "id": 91,
      "start": 1620.5399780273438,
      "end": 1623.5399780273438,
      "text": " we find that this idea of this time to repent,"
    },
    {
      "id": 92,
      "start": 1623.5399780273438,
      "end": 1626.5399780273438,
      "text": " or to not partake unworthily,"
    },
    {
      "id": 93,
      "start": 1626.5399780273438,
      "end": 1628.5399780273438,
      "text": " and so what is the remedy?"
    },
    {
      "id": 94,
      "start": 1628.5399780273438,
      "end": 1631.5399780273438,
      "text": " He says that we're to let a man examine himself."
    },
    {
      "id": 95,
      "start": 1631.5399780273438,
      "end": 1634.5399780273438,
      "text": " Self-examination is necessary. It's important."
    },
    {
      "id": 96,
      "start": 1634.5399780273438,
      "end": 1639.5399780273438,
      "text": " I would say it's a missing practice in many of our lives."
    },
    {
      "id": 97,
      "start": 1639.5399780273438,
      "end": 1643.5399780273438,
      "text": " We find that the Bible teaches this truth of self-examination,"
    },
    {
      "id": 98,
      "start": 1643.5399780273438,
      "end": 1649.5399780273438,
      "text": " and it's so imperative that we get and we understand and grasp this teaching"
    },
    {
      "id": 99,
      "start": 1649.5399780273438,
      "end": 1651.5399780273438,
      "text": " that we would examine ourselves."
    },
    {
      "id": 100,
      "start": 1651.5399780273438,
      "end": 1653.5399780273438,
      "text": " I've often said this over the years,"
    },
    {
      "id": 101,
      "start": 1653.5399780273438,
      "end": 1657.5399780273438,
      "text": " Self-examination is going to require honesty."
    },
    {
      "id": 102,
      "start": 1657.5399780273438,
      "end": 1660.5399780273438,
      "text": " It's going to require honesty."
    },
    {
      "id": 103,
      "start": 1660.5399780273438,
      "end": 1663.5399780273438,
      "text": " Self-examination is going to require humility."
    },
    {
      "id": 104,
      "start": 1663.5399780273438,
      "end": 1666.5399780273438,
      "text": " Listen, I had lunch with a man on Friday,"
    },
    {
      "id": 105,
      "start": 1666.5399780273438,
      "end": 1670.5399780273438,
      "text": " a man that our families prayed for the whole month of April."
    },
    {
      "id": 106,
      "start": 1670.5399780273438,
      "end": 1671.5399780273438,
      "text": " Love thy neighbor."
    },
    {
      "id": 107,
      "start": 1671.5399780273438,
      "end": 1674.5399780273438,
      "text": " I've tried to encourage you to pray for or choose a neighbor."
    },
    {
      "id": 108,
      "start": 1674.5399780273438,
      "end": 1676.5399780273438,
      "text": " Prayed for their family the entire month of April."
    },
    {
      "id": 109,
      "start": 1676.5399780273438,
      "end": 1679.5399780273438,
      "text": " Had lunch with him on Friday"
    },
    {
      "id": 110,
      "start": 1679.5399780273438,
      "end": 1682.5399780273438,
      "text": " for the purpose of sharing the Gospel with them."
    },
    {
      "id": 111,
      "start": 1682.5399780273438,
      "end": 1684.5399780273438,
      "text": " He's a different world religion, doesn't matter."
    },
    {
      "id": 112,
      "start": 1684.5399780273438,
      "end": 1686.5399780273438,
      "text": " Sharing the Gospel with them, trying to give them the truth."
    },
    {
      "id": 113,
      "start": 1686.5399780273438,
      "end": 1687.5399780273438,
      "text": " Here's what he said to me."
    },
    {
      "id": 114,
      "start": 1687.5399780273438,
      "end": 1689.5399780273438,
      "text": " He looked at me and this is what he said."
    },
    {
      "id": 115,
      "start": 1689.5399780273438,
      "end": 1692.5399780273438,
      "text": " I'm better than 90% of the people in the world."
    },
    {
      "id": 116,
      "start": 1692.5399780273438,
      "end": 1694.5399780273438,
      "text": " That's what he said."
    },
    {
      "id": 117,
      "start": 1694.5399780273438,
      "end": 1697.5399780273438,
      "text": " That's what he said."
    },
    {
      "id": 118,
      "start": 1697.5399780273438,
      "end": 1700.5399780273438,
      "text": " Self-examination requires humility."
    },
    {
      "id": 119,
      "start": 1700.5399780273438,
      "end": 1702.5399780273438,
      "text": " Requires honesty."
    },
    {
      "id": 120,
      "start": 1702.5399780273438,
      "end": 1703.5399780273438,
      "text": " And here's the reality."
    },
    {
      "id": 121,
      "start": 1703.5399780273438,
      "end": 1705.5399780273438,
      "text": " It doesn't matter if you're better than everybody"
    },
    {
      "id": 122,
      "start": 1705.5399780273438,
      "end": 1707.5399780273438,
      "text": " that you can think about all the people."
    },
    {
      "id": 123,
      "start": 1707.5399780273438,
      "end": 1709.5399780273438,
      "text": " And you know who we like to compare ourselves to?"
    },
    {
      "id": 124,
      "start": 1709.5399780273438,
      "end": 1712.5399780273438,
      "text": " The real bad people."
    },
    {
      "id": 125,
      "start": 1712.5399780273438,
      "end": 1713.5399780273438,
      "text": " You know how many people have told me over the years"
    },
    {
      "id": 126,
      "start": 1713.5399780273438,
      "end": 1715.5399780273438,
      "text": " I've never killed anybody?"
    },
    {
      "id": 127,
      "start": 1715.5399780273438,
      "end": 1716.5399780273438,
      "text": " Seriously."
    },
    {
      "id": 128,
      "start": 1716.5399780273438,
      "end": 1718.5399780273438,
      "text": " You start asking people if they know for sure"
    },
    {
      "id": 129,
      "start": 1718.5399780273438,
      "end": 1720.5399780273438,
      "text": " they're going to go to heaven when they die."
    },
    {
      "id": 130,
      "start": 1720.5399780273438,
      "end": 1723.5399780273438,
      "text": " Because the common thought amongst people"
    },
    {
      "id": 131,
      "start": 1723.5399780273438,
      "end": 1725.5399780273438,
      "text": " is that, well, if I'm better than others,"
    },
    {
      "id": 132,
      "start": 1725.5399780273438,
      "end": 1728.5399780273438,
      "text": " if my good is more than my bad."
    },
    {
      "id": 133,
      "start": 1728.5399780273438,
      "end": 1730.5399780273438,
      "text": " I've had countless number of people say,"
    },
    {
      "id": 134,
      "start": 1730.5399780273438,
      "end": 1732.5399780273438,
      "text": " I've never killed anybody."
    },
    {
      "id": 135,
      "start": 1732.5399780273438,
      "end": 1733.5399780273438,
      "text": " You know what I say?"
    },
    {
      "id": 136,
      "start": 1733.5399780273438,
      "end": 1734.5399780273438,
      "text": " Well, that's good."
    },
    {
      "id": 137,
      "start": 1734.5399780273438,
      "end": 1738.5399780273438,
      "text": " I'm glad."
    },
    {
      "id": 138,
      "start": 1738.5399780273438,
      "end": 1741.5399780273438,
      "text": " But the standard is Jesus."
    },
    {
      "id": 139,
      "start": 1741.5399780273438,
      "end": 1743.5399780273438,
      "text": " And he's perfect."
    },
    {
      "id": 140,
      "start": 1743.5399780273438,
      "end": 1744.5399780273438,
      "text": " He's perfect."
    },
    {
      "id": 141,
      "start": 1744.5399780273438,
      "end": 1747.5399780273438,
      "text": " But let a man examine himself."
    },
    {
      "id": 142,
      "start": 1747.5399780273438,
      "end": 1750.5399780273438,
      "text": " Listen, this process of self-examination"
    },
    {
      "id": 143,
      "start": 1750.5399780273438,
      "end": 1753.5399780273438,
      "text": " requires honesty and humility."
    },
    {
      "id": 144,
      "start": 1753.5399780273438,
      "end": 1756.5399780273438,
      "text": " It's an important process."
    },
    {
      "id": 145,
      "start": 1756.5399780273438,
      "end": 1758.5399780273438,
      "text": " We could call it a discipline this evening"
    },
    {
      "id": 146,
      "start": 1758.5399780273438,
      "end": 1760.5399780273438,
      "text": " and we could think about this discipline"
    },
    {
      "id": 147,
      "start": 1760.5399780273438,
      "end": 1764.5399780273438,
      "text": " or this process and this self-examination."
    },
    {
      "id": 148,
      "start": 1764.5399780273438,
      "end": 1766.5399780273438,
      "text": " Understanding that one day we're going to stand"
    },
    {
      "id": 149,
      "start": 1766.5399780273438,
      "end": 1770.5399780273438,
      "text": " before the judge of all the earth."
    },
    {
      "id": 150,
      "start": 1770.5399780273438,
      "end": 1772.5399780273438,
      "text": " We find that the Bible says,"
    },
    {
      "id": 151,
      "start": 1772.5399780273438,
      "end": 1774.5399780273438,
      "text": " but let a man examine himself"
    },
    {
      "id": 152,
      "start": 1774.5399780273438,
      "end": 1778.5399780273438,
      "text": " and so let him eat of that bread and drink of that cup."
    },
    {
      "id": 153,
      "start": 1778.5399780273438,
      "end": 1781.5399780273438,
      "text": " So as we understand contextually what's taking place,"
    },
    {
      "id": 154,
      "start": 1781.5399780273438,
      "end": 1784.5399780273438,
      "text": " he's saying, listen, you're not doing things right."
    },
    {
      "id": 155,
      "start": 1784.5399780273438,
      "end": 1785.5399780273438,
      "text": " I praise you not."
    },
    {
      "id": 156,
      "start": 1785.5399780273438,
      "end": 1788.5399780273438,
      "text": " So here's the instruction for how you do it."
    },
    {
      "id": 157,
      "start": 1788.5399780273438,
      "end": 1790.5399780273438,
      "text": " Don't partake of it unworthily."
    },
    {
      "id": 158,
      "start": 1790.5399780273438,
      "end": 1794.5399780273438,
      "text": " And the way that you prevent partaking of it unworthily"
    },
    {
      "id": 159,
      "start": 1794.5399780273438,
      "end": 1796.5399780273438,
      "text": " is to examine yourself."
    },
    {
      "id": 160,
      "start": 1796.5399780273438,
      "end": 1799.5399780273438,
      "text": " Then he says, but let a man examine himself."
    },
    {
      "id": 0,
      "start": 1799.5399780273438,
      "end": 1803.5399780273438,
      "text": " examine themselves, and so let him eat of that bread and drink of that cup.\" So what's"
    },
    {
      "id": 1,
      "start": 1803.5399780273438,
      "end": 1809.01997756958,
      "text": " the process? Well, the process is not to say, well, I'm unworthy so I'm not going to partake."
    },
    {
      "id": 2,
      "start": 1809.01997756958,
      "end": 1814.1799783706665,
      "text": " That's why I've titled it, given the third point here, that it's a time to repent. A"
    },
    {
      "id": 3,
      "start": 1814.1799783706665,
      "end": 1819.4199771881104,
      "text": " time to repent. Listen, when we examine ourselves and we get alone with God and we say as the"
    },
    {
      "id": 4,
      "start": 1819.4199771881104,
      "end": 1830.8399772644043,
      "text": " psalmist said, search me, O God. Show me if there be any wicked way in me. God's going"
    },
    {
      "id": 5,
      "start": 1830.8399772644043,
      "end": 1836.5599784851074,
      "text": " to point out some things in our lives. You know why? We all got this flesh. There's not"
    },
    {
      "id": 6,
      "start": 1836.5599784851074,
      "end": 1844.6599769592285,
      "text": " one of us tonight that's perfect. Not one of us. There's sins of omission, there's sins"
    },
    {
      "id": 7,
      "start": 1844.6599769592285,
      "end": 1852.2799797058105,
      "text": " of commission. You know how easy, listen, the Bible says what's not a faith is sin."
    },
    {
      "id": 8,
      "start": 1852.2799797058105,
      "end": 1859.3799781799316,
      "text": " How many times we can sin with our tongue? Tongue's a little member. Oh, it causes so"
    },
    {
      "id": 9,
      "start": 1859.3799781799316,
      "end": 1867.6599807739258,
      "text": " many problems, James chapter number 3. Right? Be angry and sin not. I shared that verse"
    },
    {
      "id": 10,
      "start": 1867.6599807739258,
      "end": 1873.5599746704102,
      "text": " last Sunday night. Jesus, the Son of God, God in flesh, he was angry, he didn't sin,"
    },
    {
      "id": 11,
      "start": 1873.5599746704102,
      "end": 1878.6399765014648,
      "text": " but the problem is that many of us, we don't really know how to do that. Many times our"
    },
    {
      "id": 12,
      "start": 1878.6399765014648,
      "end": 1885.7199783325195,
      "text": " anger turns into sinful behavior. This evening, this idea of let a man examine himself, the"
    },
    {
      "id": 13,
      "start": 1885.7199783325195,
      "end": 1891.2799758911133,
      "text": " purpose I would say of self-examination is repentance. That we would get that thing right,"
    },
    {
      "id": 14,
      "start": 1891.2799758911133,
      "end": 1896.239974975586,
      "text": " that we would have that, as the songwriter said, there's nothing between my soul and"
    },
    {
      "id": 15,
      "start": 1896.239974975586,
      "end": 1902.0399780273438,
      "text": " my Savior. That we would be in that place of that self-examination. He says, so let"
    },
    {
      "id": 16,
      "start": 1902.0399780273438,
      "end": 1906.7999801635742,
      "text": " him eat of that bread and drink of that cup. Notice what he says in verse 29, for he that"
    },
    {
      "id": 17,
      "start": 1906.7999801635742,
      "end": 1911.7599792480469,
      "text": " eateth and drinketh unworthily eateth and drinketh damnation to himself, not discerning"
    },
    {
      "id": 18,
      "start": 1911.7599792480469,
      "end": 1918.3199768066406,
      "text": " the Lord's body. And if you look within context here, it's interesting because the damnation"
    },
    {
      "id": 19,
      "start": 1918.3199768066406,
      "end": 1923.1999816894531,
      "text": " to himself that's mentioned in verse number 29, it's given further explanation I believe"
    },
    {
      "id": 20,
      "start": 1923.1999816894531,
      "end": 1928.9199829101562,
      "text": " in verse number 32 when the Bible says that when we are judged, we are chastened of the"
    },
    {
      "id": 21,
      "start": 1928.9199829101562,
      "end": 1934.239974975586,
      "text": " Lord. Again, the truth that we find in this passage of Scripture that this Lord's table,"
    },
    {
      "id": 22,
      "start": 1934.239974975586,
      "end": 1938.8399810791016,
      "text": " the Lord's supper is for God's people, it's not for lost people, it's for saved people."
    },
    {
      "id": 23,
      "start": 1938.8399810791016,
      "end": 1945.7599792480469,
      "text": " And here's what God said, for whom the Lord loveth, he chasteneth. Listen, we ought to"
    },
    {
      "id": 24,
      "start": 1945.7599792480469,
      "end": 1953.0799713134766,
      "text": " thank God when He chastens us. You know why? It's a birthmark of belonging to Jesus. Because"
    },
    {
      "id": 25,
      "start": 1953.0799713134766,
      "end": 1959.8799743652344,
      "text": " He says, if He doesn't chasten you, then you don't belong to Him. And so guess what?"
    },
    {
      "id": 26,
      "start": 1959.8799743652344,
      "end": 1968.6399841308594,
      "text": " Our good Heavenly Father does. Sometimes He has to correct us. He chastens us. We find"
    },
    {
      "id": 27,
      "start": 1968.6399841308594,
      "end": 1974.9199829101562,
      "text": " here that He says that that individual, that believer that is eating and drinking unworthily,"
    },
    {
      "id": 28,
      "start": 1974.9199829101562,
      "end": 1978.8799743652344,
      "text": " he's eating and drinking damnation to himself, not discerning the Lord's body. And then Paul"
    },
    {
      "id": 29,
      "start": 1978.9199829101562,
      "end": 1984.8799743652344,
      "text": " goes on to say, for this cause, because the behavior there in Corinth and the way in which"
    },
    {
      "id": 30,
      "start": 1984.8799743652344,
      "end": 1988.999984741211,
      "text": " they were observing the Lord's table, the Lord's supper, the manner that he's speaking of,"
    },
    {
      "id": 31,
      "start": 1988.999984741211,
      "end": 1994.3599853515625,
      "text": " he says, for this cause, many are weak and sickly among you and many sleep. That word"
    },
    {
      "id": 32,
      "start": 1994.3599853515625,
      "end": 1999.3599853515625,
      "text": " sleep is the same way that Jesus used it speaking about Lazarus. Remember He said to the disciples,"
    },
    {
      "id": 33,
      "start": 1999.3599853515625,
      "end": 2003.47998046875,
      "text": " he's asleep. And, well, if he's asleep, I mean, let him be. And Jesus said, he's dead."
    },
    {
      "id": 34,
      "start": 2003.47998046875,
      "end": 2012.7999725341797,
      "text": " So, He says here, listen, every sickness in the life of a believer is not chastening. It's"
    },
    {
      "id": 35,
      "start": 2012.7999725341797,
      "end": 2017.2799835205078,
      "text": " important for us to understand that. Every sickness is not chastening. But you know what"
    },
    {
      "id": 36,
      "start": 2017.2799835205078,
      "end": 2024.999984741211,
      "text": " happens in my life? If I got some sickness going on, I'm, Lord, self-examination time. It's a good"
    },
    {
      "id": 37,
      "start": 2024.999984741211,
      "end": 2030.3999786376953,
      "text": " practice. Lord, is there something I, are you chastening me? Is there something I need to,"
    },
    {
      "id": 38,
      "start": 2030.7599792480469,
      "end": 2035.719970703125,
      "text": " but when we understand this truth of chastening, He says, for many are sick, weak, excuse me,"
    },
    {
      "id": 39,
      "start": 2035.719970703125,
      "end": 2039.5999755859375,
      "text": " and sickly among you and many sleep. Then He says this, if we would judge ourselves,"
    },
    {
      "id": 40,
      "start": 2039.5999755859375,
      "end": 2044.6799774169922,
      "text": " we should not be judged. For when we are judged, we are chastened to the Lord that we should not"
    },
    {
      "id": 41,
      "start": 2044.6799774169922,
      "end": 2049.3599853515625,
      "text": " be condemned with the world. So, we would understand this evening as we've titled this"
    },
    {
      "id": 42,
      "start": 2049.3599853515625,
      "end": 2055.439971923828,
      "text": " point a time to repent, where to not eat unworthily, the process of self-examination leads us to"
    },
    {
      "id": 43,
      "start": 2055.439971923828,
      "end": 2060.6799926757812,
      "text": " repentance. Listen, when we get alone with God and we go through that process of self-examination,"
    },
    {
      "id": 44,
      "start": 2060.6799926757812,
      "end": 2064.759979248047,
      "text": " Lord, search me, show me if there'd be any wicked way in me. When God shows it to us,"
    },
    {
      "id": 45,
      "start": 2064.759979248047,
      "end": 2071.5599670410156,
      "text": " guess what? We confess it. We confess it. He that covereth his sin, the Bible says,"
    },
    {
      "id": 46,
      "start": 2071.5599670410156,
      "end": 2081.239990234375,
      "text": " shall not prosper. By the way, who knows about your sin? God. Right? No one's ever pulled"
    },
    {
      "id": 47,
      "start": 2081.239990234375,
      "end": 2094.5599670410156,
      "text": " anything over on God. Right? Adam, where are you? Did God know where he was? Sure He"
    },
    {
      "id": 48,
      "start": 2094.5599670410156,
      "end": 2101.3599853515625,
      "text": " did. Did God know why He had the leaves on? Sure He did. Adam wasn't hiding anything from"
    },
    {
      "id": 49,
      "start": 2101.3599853515625,
      "end": 2108.3199768066406,
      "text": " God. He hid from God, but God knew all about it. We could speak of so many examples. Achan,"
    },
    {
      "id": 50,
      "start": 2108.3199768066406,
      "end": 2116.199981689453,
      "text": " the one that troubleth Israel, he hid some things, but God systematically brought Achan"
    },
    {
      "id": 51,
      "start": 2116.199981689453,
      "end": 2123.2799682617188,
      "text": " to the very forefront of Joshua to see who it was that was the troubler of Israel. You"
    },
    {
      "id": 52,
      "start": 2123.2799682617188,
      "end": 2126.1599731445312,
      "text": " could go on and on. You can look through the pages of Scripture. Listen, God knows about"
    },
    {
      "id": 53,
      "start": 2126.1599731445312,
      "end": 2131.719970703125,
      "text": " our sin. Sometimes people think, well, nobody else knows about this. He that covereth his"
    },
    {
      "id": 54,
      "start": 2131.719970703125,
      "end": 2138.439971923828,
      "text": " sin shall not prosper, but whoso confesseth and forsaketh shall, they shall have forgiveness."
    },
    {
      "id": 55,
      "start": 2138.439971923828,
      "end": 2142.759979248047,
      "text": " The Bible says in 1 John chapter 1 and verse number 9, the Bible says that if we confess"
    },
    {
      "id": 56,
      "start": 2142.759979248047,
      "end": 2147.8399658203125,
      "text": " our sins, He is faithful and just to forgive us and to cleanse us from all unrighteousness."
    },
    {
      "id": 57,
      "start": 2147.8399658203125,
      "end": 2154.439971923828,
      "text": " That's a wonderful promise of God's Word. What a wonderful promise. This evening, listen,"
    },
    {
      "id": 58,
      "start": 2154.439971923828,
      "end": 2161.719970703125,
      "text": " it's foolish, it's foolish to try to hide our sin. We can't do it. The Word is that"
    },
    {
      "id": 59,
      "start": 2161.719970703125,
      "end": 2167.719970703125,
      "text": " they should have mercy. Aren't you thankful for God's mercy? God's mercy. He that covereth"
    },
    {
      "id": 60,
      "start": 2167.719970703125,
      "end": 2174.2799682617188,
      "text": " his sin shall not prosper, but whoso confesseth and forsaketh them, his sin, shall have mercy."
    },
    {
      "id": 61,
      "start": 2174.2799682617188,
      "end": 2180.47998046875,
      "text": " Listen, our God is a merciful God. He's a gracious God. He's a God that is described"
    },
    {
      "id": 62,
      "start": 2180.47998046875,
      "end": 2189.9199829101562,
      "text": " this way. He is ready to pardon. He is ready to forgive. So if I have sin in my life, this"
    },
    {
      "id": 63,
      "start": 2189.9199829101562,
      "end": 2194.1199645996094,
      "text": " evening if you have sin in your life, we think about this Lord's Supper, this Lord's table."
    },
    {
      "id": 64,
      "start": 2194.1199645996094,
      "end": 2200.519989013672,
      "text": " It's a time to repent. Get right with God. I want nothing between my soul and my Savior."
    },
    {
      "id": 65,
      "start": 2200.519989013672,
      "end": 2211.199981689453,
      "text": " I want to be right with God. The Lord's Supper is a precious time for believers. A time to"
    },
    {
      "id": 66,
      "start": 2211.199981689453,
      "end": 2218.3999633789062,
      "text": " remember, to remember of the greatest sacrifice that was motivated by love that results in"
    },
    {
      "id": 67,
      "start": 2218.3999633789062,
      "end": 2224.199981689453,
      "text": " reconciliation. That great sacrifice. What an important thing that we remember what Christ"
    },
    {
      "id": 68,
      "start": 2224.199981689453,
      "end": 2231.3199768066406,
      "text": " did for us. The time to rejoice. I hope tonight that you rejoice in the finished work of Christ."
    },
    {
      "id": 69,
      "start": 2231.3199768066406,
      "end": 2237.47998046875,
      "text": " I hope tonight that you rejoice in the future coming of Christ. He's coming again. Oh how"
    },
    {
      "id": 70,
      "start": 2237.47998046875,
      "end": 2242.6399841308594,
      "text": " that wonderful truth should motivate us daily to live for Him, to serve Him every day of"
    },
    {
      "id": 71,
      "start": 2242.6399841308594,
      "end": 2252.6799926757812,
      "text": " our lives. But it's a time to repent. Time to repent. God, search me. Show me. Reveal"
    },
    {
      "id": 72,
      "start": 2252.6799926757812,
      "end": 2257.239990234375,
      "text": " in my life. Uncover those things in my life where I've sinned, where I need to get it"
    },
    {
      "id": 73,
      "start": 2257.239990234375,
      "end": 2263.9199829101562,
      "text": " right with You, Lord. Help me not to have a hard heart. I close with this thought from"
    },
    {
      "id": 74,
      "start": 2263.9199829101562,
      "end": 2269.439971923828,
      "text": " the Apostle Paul as he's standing and giving defense before Felix in Acts 24. In verse"
    },
    {
      "id": 75,
      "start": 2269.439971923828,
      "end": 2276.2799682617188,
      "text": " number 16, the Bible says that he, Paul, says this, and herein do I exercise myself to have"
    },
    {
      "id": 76,
      "start": 2276.2799682617188,
      "end": 2287.47998046875,
      "text": " always a conscience void of offense toward God and toward men. He says, I exercise myself."
    },
    {
      "id": 77,
      "start": 2287.47998046875,
      "end": 2292.1199645996094,
      "text": " I'm laboring. I'm striving. For what purpose to have always a conscience that is void of"
    },
    {
      "id": 78,
      "start": 2292.1199645996094,
      "end": 2298.959991455078,
      "text": " offense? I don't believe Paul wanted to have sin in his life. He wanted to be clean. He"
    },
    {
      "id": 79,
      "start": 2298.959991455078,
      "end": 2302.199981689453,
      "text": " understood, oh, wretched man that I am. I mean, he understood that he still had the"
    },
    {
      "id": 80,
      "start": 2302.199981689453,
      "end": 2309.3599853515625,
      "text": " flesh. But he says, I die daily. I'm crucified with Christ. Why did God use Paul the way"
    },
    {
      "id": 81,
      "start": 2309.3599853515625,
      "end": 2313.0,
      "text": " that He did? Well, there's so many answers to that question, but I believe that this"
    },
    {
      "id": 82,
      "start": 2313.0,
      "end": 2321.1599731445312,
      "text": " is one of them, that he sought to walk and live a clean life, pure in the eyes of God."
    },
    {
      "id": 83,
      "start": 2321.1599731445312,
      "end": 2326.0799560546875,
      "text": " This evening is a time to repent. I don't know what you have to repent of, but I know"
    },
    {
      "id": 84,
      "start": 2326.0799560546875,
      "end": 2332.5199584960938,
      "text": " that we're all sinners. I know that we all ought to say, God, search me, show me, help"
    },
    {
      "id": 85,
      "start": 2332.5199584960938,
      "end": 2339.8399658203125,
      "text": " me, Lord, to honestly, humbly evaluate, examine my life. God, as you show me, I'm so thankful"
    },
    {
      "id": 86,
      "start": 2339.8399658203125,
      "end": 2344.2799682617188,
      "text": " that you're a God who's gracious and merciful and ready to pardon. I can get that right"
    },
    {
      "id": 87,
      "start": 2344.2799682617188,
      "end": 2349.47998046875,
      "text": " with you, Lord. I can have forgiveness because we're going to partake of the Lord's Supper"
    },
    {
      "id": 88,
      "start": 2349.47998046875,
      "end": 2356.0399780273438,
      "text": " and I want to do it with joy. I want to do it with that rejoicing and that remembering."
    },
    {
      "id": 89,
      "start": 2356.0399780273438,
      "end": 2362.8399658203125,
      "text": " Why? Because I've done that process of repenting and preparing my heart to be able to partake"
    },
    {
      "id": 90,
      "start": 2362.8399658203125,
      "end": 2368.0799560546875,
      "text": " of the Lord's Table. Let's pray together. Father, we love you. How we thank you for"
    },
    {
      "id": 91,
      "start": 2368.0799560546875,
      "end": 2373.5999755859375,
      "text": " loving us. We thank you for the precious Word of God. We thank you for the instruction that"
    },
    {
      "id": 92,
      "start": 2373.5999755859375,
      "end": 2380.0,
      "text": " you provide us with in your Word regarding the Christian life and the church and the"
    },
    {
      "id": 93,
      "start": 2380.0,
      "end": 2387.0,
      "text": " Lord's Supper. God, I pray that as we have a moment of invitation, as we proceed into"
    },
    {
      "id": 94,
      "start": 2387.0,
      "end": 2390.5199584960938,
      "text": " the next phase of our service of observing the Lord's Supper, I pray, God, that you'd"
    },
    {
      "id": 95,
      "start": 2390.5199584960938,
      "end": 2395.8800048828125,
      "text": " help us to examine ourselves. I pray that we do business with you, Lord. I pray that"
    },
    {
      "id": 96,
      "start": 2395.8800048828125,
      "end": 2399.5999755859375,
      "text": " as we would have this time of examination, perhaps…"
    },
    {
      "id": 0,
      "start": 2399.5999755859375,
      "end": 2402.999975681305,
      "text": " Perhaps there'd be some that would come to this old-fashioned altar, maybe we'd make"
    },
    {
      "id": 1,
      "start": 2402.999975681305,
      "end": 2405.419975757599,
      "text": " our own pew and altar."
    },
    {
      "id": 2,
      "start": 2405.419975757599,
      "end": 2408.199975967407,
      "text": " God help us."
    },
    {
      "id": 3,
      "start": 2408.199975967407,
      "end": 2411.7999753952026,
      "text": " Help us, Lord, to have this time of examination."
    },
    {
      "id": 4,
      "start": 2411.7999753952026,
      "end": 2414.159976005554,
      "text": " Help us to be right with you, Lord."
    },
    {
      "id": 5,
      "start": 2414.159976005554,
      "end": 2417.2799758911133,
      "text": " I pray that you'd use us, Lord, for honor and for your glory."
    },
    {
      "id": 6,
      "start": 2417.2799758911133,
      "end": 2424.319974899292,
      "text": " Help us to rejoice as we remember what you've done for us to provide us with salvation full"
    },
    {
      "id": 7,
      "start": 2424.319974899292,
      "end": 2425.959976196289,
      "text": " and free."
    },
    {
      "id": 8,
      "start": 2425.959976196289,
      "end": 2429.9199752807617,
      "text": " Thank you for the promise that you're soon going to come again, pray that you'd help"
    },
    {
      "id": 9,
      "start": 2429.9199752807617,
      "end": 2431.4399757385254,
      "text": " us to be found faithful."
    },
    {
      "id": 10,
      "start": 2431.4399757385254,
      "end": 2436.3599739074707,
      "text": " Lord, would you move and work in hearts and lives as only you can."
    },
    {
      "id": 11,
      "start": 2436.3599739074707,
      "end": 2437.3599739074707,
      "text": " We'll thank you for it."
    },
    {
      "id": 12,
      "start": 2437.3599739074707,
      "end": 2440.3199768066406,
      "text": " In Christ's name we pray, this evening."
    }
  ],
  "processed_at": "2025-04-16T09:19:29.709823"
}