{
  "video_id": "qwt_XuUQD9E",
  "text": "number 1, 1 Peter chapter number 1, be looking at verses 3 through 9, and hold your place and I'm going to reference a couple of other portions of Scripture before we get to 1 Peter chapter 1, but 1 Peter chapter number 1 will be our text this morning, and the title, if you've already looked at the back of the bulletin, Rejoicing Through Trials, Rejoicing Through Trials, tonight we're going to look at Genesis chapter number 40 and look at this subject of faithful through trials, and that's why I said they're complementary, one to the other, and I believe, to just give a quick snippet with regard to the message this evening, I believe that a great key to being faithful through trials is learning what we're going to look at this morning, and that is rejoicing through trials, because if we can learn to rejoice through trials, it's going to go a long way to help us be faithful through trials. I believe the enemy wants us to quit, I believe the enemy wants us to give up, and we have trials that we face in this world and this earth, and I believe the enemy wants us to quit and just turn back and not live for the Lord, but we understand this morning, even as we'll look at this message and then look at the message this evening, that all of us have personally experienced trials. And you might say this morning, Pastor, you have no idea, I'm in the midst of a trial right now, and I understand, a preacher of yesteryear said you're either in the midst of one, you've just come out of one, or there's one on the horizon, and for many we can say that's pretty true with regard to trials in our lives. We may not always respond properly in the midst of a trial. I'm sure that if you were to evaluate your life, if I were to evaluate my life, there are times in the midst of a trial that we do not respond appropriately, we do not respond biblically. We find, however, that God has given us in His Word the instruction that we are to rejoice always, not just to rejoice when things go well, when things are the way that we desire for them to be, but we find that we've been given that instruction, rejoice in the Lord always, Philippians 4 and verse number 4, and again I say unto thee, rejoice. The psalmist said it this way in Psalm 118 and verse 24, this is the day the Lord hath made, we will rejoice and be glad in it. And it's a determination, it's being purposed in the fact that we're going to rejoice no matter what comes our way in that particular day, we're going to rejoice in the Lord. And we have to be intentional about it, we have to be purposed in it, and we find that God will bless. Not only have we been given instruction with regard to rejoicing through trials, but we find that as we study through the pages of this precious book that we can read the record that God has given us of many who have rejoiced in the midst of great trials. Their behavior in the midst of trials was appropriate and I would say was exemplary as we have the opportunity to be able to study those portions of Scripture. I know in my life that I will face more trials. The reality this morning is that I know in your life that you will face more trials. We will face trials collectively, corporately as a church, and we understand that we will face trials. The question really this morning is not, will I face a trial? The question this morning is this, how will I behave in the midst of the trial? Maybe I'll turn it this way to go along with the title this morning, will I rejoice through trials? Will I rejoice through trials? And I told you to look at 1 Peter and I would get there in a moment, but I want to read three portions of Scripture very quickly this morning. The first one is from the book of Habakkuk, and I want to read Habakkuk chapter number three. And as we look in Habakkuk chapter number three and look at what the prophet of old says with regard to rejoicing, again we'll look at two other examples in the New Testament as we get into the message this morning, and understanding that we've been given that command that we are to rejoice in the Lord always. Again, as we mentioned, the psalmist made that great declaration in Psalm 118. We sing the song, but it says, this is the day which the Lord hath made. We will rejoice and be glad in it. And we find here that Habakkuk, if you found your place there in Habakkuk chapter number three, notice in verse 17, notice what the Bible says, although the fig tree shall not blossom. That's not a good situation. The fig tree is supposed to blossom, amen, produce fruit. Neither shall fruit be in the vines. That's unfortunate. The labor of the olive shall fail, and the fields shall yield no meat. The flock shall be cut off from the fold, and there shall be no herd in the stalls. If you read Habakkuk 3 in verse 17, that paints a very, very dim picture. Would you agree? The Bible says that the fig tree shall not blossom, the fruit shall not be on the vines, the labor of the olive shall fail, the field shall yield no meat, the flock shall be cut off from the fold, and there shall be no herd in the stalls. And yet the writer says, yet I will rejoice in the Lord. Habakkuk, did you see what you just wrote in verse 17? Yeah. That's why I said it's purposed, it's intentional. It's a, I'm going to rejoice in the Lord always. I'm going to determine, even in the midst, going through the trials of life, I'm going to determine that I'm going to rejoice. He says, yet I will rejoice in the Lord. I will joy in the God of my salvation. The Lord God is my strength and He will make my feet like Heinz feet and He will make me to walk upon mine high places to the chief singer on my stringed instruments. And I want you to just see the determination, the resolve, if you will, of Habakkuk in verse 18, yet I will rejoice in the Lord. Listen, God is good. God is good. God is good all of the time. God is not good based on your circumstances, based on what you're dealing with in life. No, God is good. Taste and see that the Lord is good. He is gracious. We can look and we'll mention as we get through the message this morning about what Peter says with regard to this subject there in 1 Peter chapter number one with rejoicing through trials. But we understand that even as Peter would be writing, he says in the second chapter, you don't need to turn there, but he says, if so be that you have tasted that the Lord is gracious. God is gracious. He's good. He's a great God. Notice in Acts chapter number five, we see the first example. We find that God's given us the command that we're to rejoice in the Lord all way. We find there in the book of Habakkuk that Habakkuk says, yet I will rejoice in the Lord. Though all of those negatives that are mentioned in verse 17, yet I will rejoice. Notice in Acts chapter number five, we do not have the time this morning to develop all that is taking place in Acts chapter number five, but let me say this, the disciples are facing some real difficulty in Acts chapter number five. They have been in a position where they've been preaching the gospel after the ascension of the Lord Jesus Christ and after the day of Pentecost and they're facing the persecution. The religious leaders are not happy with the growth of the New Testament church and all that's taking place. In fact, they tell them that they're not to speak anymore in the name of the Lord Jesus Christ and yet when they're standing in Acts five before this religious group of leaders, they say that you've filled Jerusalem with your doctrine and they're trying to figure out what they can do to stop these individuals from continuing to preach the gospel. And after they're having this conversation and all that's taking place, we find that Gamaliel stands up. He's a doctor of the law, according to verse number 34, and he gives his opinion, he gives his counsel with regard to the circumstances and we find that in verse 38 it says, And now I say unto you, refrain from these men, and let them alone. For if this counsel or this work be of men, it will come to naught. But if it be of God, ye cannot overthrow it, lest happily ye be found even to fight against God. Listen, I'm thankful this morning that we're not just, it's not my cause. It's not your cause. It's the cause of Christ. And that ought to cause us to rejoice greatly. It's not a work of just men. It's the cause of Christ. And notice it says, And to him they agreed. They as the religious leaders and him as Gamaliel. And they agreed with his counsel. They agreed with what he says. And it says in verse 40, And when they had called the apostles, and notice these three words and beaten them, and beaten them, the Bible says they commanded that they should not speak in the name of Jesus and let them go. And they departed from the presence of the council. Notice this next phrase, rejoicing that they were counted worthy to suffer shame for his name. You know what they were doing? They were rejoicing through trials. They were beaten, and yet they left rejoicing. They were commanded, and yet the Bible says that they daily in verse 42 and in the temple and every house, they cease not to teach and preach Jesus Christ. The very thing that caused them to be beaten, they said, no, we're going to keep on doing that. Why? Because we are his witnesses. We find that here in Acts chapter 16, another example, we find specifically in Acts 16 that of Paul and Silas. And again, we won't take the time to read the entire context of what's taking place, but we know that in Acts 16, they come to Philippi. The work of the Lord is going on. And we know that there was that demon-possessed girl, and we find that Paul gave command, and she… the owners, they were going to lose gain, and so they're very angry, and they cause for Paul and Silas to be imprisoned and to be beaten. The Bible tells us in verse 22, \"...until the multitude rose up together against them, and the magistrates rent off their clothes and commanded to beat them. When they had laid many stripes upon them, they cast them into prison, charging the jailer to keep them safely. Who having received such a charge, thrust them into the inner prison, and made the feet fast in the stocks…\" Notice verse 25, \"...and at midnight Paul and Silas prayed and sang praises unto God, and the prisoners heard them.\" You know, they were still in the midst of their trial. They'd been beaten, they were still in prison, they weren't released yet. We know that they will be miraculously released as we read the text of Scripture, but even as we'll mention tonight in the life of Joseph, we don't always know, or they didn't always know, though we have the record of Scripture and we can read the next event, we can read what happens. Paul and Silas, they just knew that they had been beaten and they were in prison, but they chose to rejoice through the trial. And at midnight, the Bible says that they prayed and sang praises unto God. Can you imagine rejoicing through the trials? I want you to notice with me very quickly, at the end of verse 25, it says, \"...and the prisoners heard them, and the prisoners heard them.\" I would submit to you this morning, it's actually a message that I hope to develop in the future in more detail and looking at some passages in the Old Testament as well, but I would submit to you this morning just a thought that they were, those prisoners were going to hear Paul and Silas regardless of what they said. They were going to hear them if they complained, and they were going to hear them if they rejoiced. You know what? There's some people that hear us. I wonder what they hear. What do they hear from us? When we're going through trials, when we're going through difficulties, what do they hear? What do they learn about our God as we go through trials? As we look at 1 Peter chapter number 1 and look at verse 3 through 9 this morning, get to our text, I believe that as we consider three truths really from this portion of Scripture that I believe this morning will enable us to rejoice through trials. Again, I know that I will face trials. I know that you will face trials. We understand that to be the case. And what is it that God teaches us in His Word that will enable us to rejoice in the midst of trials? The question is not, will I face a trial? The question is, how will I behave through the trial? Notice in verse number 3 of 1 Peter 1, the Bible says, blessed be the God and Father of our Lord Jesus Christ, which according to His abundant mercy hath begotten us again into a lively hope by the resurrection of Jesus Christ from the dead, to an inheritance incorruptible and undefiled, and that fadeth not away, reserved in heaven for you, who are kept by the power of God through faith unto salvation, ready to be revealed in the last time. Notice in verse number 6, wherein ye greatly rejoice, though now for a season, if need be, ye are in heaviness through manifold temptations, that the trial of your faith, being much more precious than of gold that perisheth, though it be tried with fire, might be found unto praise and honor and glory at the appearing of Jesus Christ, whom, having not seen, ye love, and whom, though now ye see Him not yet believing, ye rejoice with joy unspeakable and full of glory, receiving the end of your faith, even the salvation of your souls. As we look at this portion of Scripture this morning, I believe that God gives us three truths that will enable us, enable you, enable me, to rejoice through trials. If you're taking notes with me this morning, I would say, number one, we can rejoice through trials because of our position in Christ. What is it that will enable me to rejoice in the midst of trials? It's when I remember my position in Christ. Peter is writing to believers here in the book of 1 Peter. Notice in verse 1, the Bible says, Peter, an apostle of Jesus Christ to the strangers scattered throughout Pontus, Galatia, Cappadocia, Asia, and Bithynia, elect according to the foreknowledge of God the Father through sanctification of the Spirit unto obedience and sprinkling of the blood of Jesus Christ, grace unto you, and peace be multiplied. He then tells them and speaks to them in verses 3 and 4 and verse number 5 as well about their position in Christ. I want you to understand that these believers that Peter is writing to here in 1 Peter, these are believers that are facing great difficulty. These are believers that are living during the time of the Emperor Nero's rule and reign and what a wicked and ungodly man he was and so cruel. And we find that they're living at that particular time and they're facing great difficulties. The Bible says to the strangers scattered throughout. Why were they scattered? Well, because of the persecution that was intensifying under the rule and reign of the Emperor Nero. And we find that as these believers are being written to that God in His grace and His mercy is going to help them understand truth that will enable them even in the midst of this great difficulty, even in the midst of this trial, that they can not only rejoice but according to verse number 6, greatly rejoice. Not only greatly rejoice, but we find that in verse number 8 that ye rejoice with joy unspeakable and full of glory. Now there is a truth that is given to us in these first few verses of chapter number 1 that enables us to understand our position in Christ. I'm so thankful to be washed in the blood. We sang that song this morning, are you washed in the blood, and how appropriate as we think about that song, and often I will say as we're singing the chorus of that song, when it says are you washed in the blood, I'll say yes I am. Dean hollers out something else when he's leading it, I don't even know half the time what he's saying, but I'm sitting here saying yes I am, amen? I am washed in the blood, and I'm so thankful that my position in Christ is settled. If you're a believer this morning, if you've trusted the Lord Jesus Christ as your personal Savior, you understood that you were a sinner, and that Christ is the only Savior, and that He offers you a gift, and that gift is eternal life through Jesus Christ our Lord, then you have been born again, you have been born of the Spirit, and your position in Christ is settled, and we can rejoice in that. Listen, nobody can take your salvation. I'm thankful for that. The Bible says in John chapter number 10, my sheep hear my voice and I know them and I give unto them eternal life, and they shall never perish, neither shall any man pluck them from my hand, and we see the security of the believer. We see it here in 1 Peter 1 as well, but we understand this morning that there is no trial that you can go through, there is no trial that I can go through that will alter my position in Christ. That should cause us to rejoice. You say, but pastor, let me tell you about this trial. I'm just trying to remind you of your position in Christ. I'm trying to help you understand that yes, the trials will vary, and some are going to be harder than others, and more intense, and maybe longer, and whatever it might be, but the reality is that nothing, no trial here on earth can alter your position in Christ. So when I'm going through that trial, I remind myself I'm a child of the King. I belong to the Lord Jesus Christ. My standing is settled, it's sure. I'm heaven-bound. All these other things are just temporary. In fact, look at it with me in verse number three. It says, blessed be the God and Father of our Lord Jesus Christ, notice it says, which according to His abundant mercy, aren't you thankful that our God is merciful? His mercy is everlasting. His mercy is abundant. He is rich in mercy. It says that He hath begotten us again unto a lively hope by the resurrection of Jesus Christ from the dead. Listen, if Christ be not risen, then our faith is vain, and our preaching is vain, but now is Christ risen from the dead. He is the firstfruits of them which slept, and the Bible tells us, and we understand this morning, that I serve a risen Savior, and He lives, and how precious that is. We understand this morning because He lives because of the resurrection and my understanding of my position in Christ. He goes on to explain it in verse number four, notice, to an inheritance incorruptible and undefiled, notice this, and fadeth not away, reserved in heaven for you. Every word of God is pure. I love the way that He explains that in verse number four. He could have just said that you have an inheritance. And by the way, that would have been sufficient because of the sufficiency of Scripture. But we find that He wanted us to really understand this inheritance that we have, that it's incorruptible, that it's undefiled, that it fadeth not away, that it's reserved in heaven for us. I want you to notice that phrase in verse number four where it says, fadeth not away. I want you to understand this morning that the gift of God is eternal life. Listen, I'm going to spend forever with my Savior. My position in Christ settles that because I've been born again, because I heard the gospel and I recognized I was a sinner and He's the only Savior. I was guilty. Listen, it wasn't that I was just, oh, I wasn't that bad. No, I was guilty. And by the way, if you don't recognize… recognize that you're guilty, you're never going to recognize that you need a Savior. And I knew I was guilty. I was condemned. But He loved me. And He died for me. And He saved me. And I'm going to heaven. And I have this inheritance. If you're saved this morning, you have this. And it says, fadeth not away. Now, I want you to keep that in mind and look at verse number six, and we'll get further into verse number six as we get through the message this morning. But I want to point this out to you with regard to our position in Christ. It says this, the position, the fact that we have an inheritance that fadeth not away in verse number four, but then look at verse six. It says wherein ye greatly rejoice. Then notice this, though now for a season. Listen, I'm thankful that a season doesn't define us. A season's not forever. You say, how long's a season? I don't know. I have no idea. It's as long as God wants it to be. In fact, in 1 Peter chapter number 5 and verse number 10, it says, but the God of all grace, who hath caught us into His eternal glory by Christ Jesus, after that ye have suffered a while, make ye perfect, establish, strengthen, and excel you. To Him be glory and dominion forever and ever. Amen. I don't know how long a while is either, but I know that a season pales in comparison to fadeth not away. Amen? See, we've got to keep that eternal perspective. Sometimes in the midst of the trial, we have that temporal perspective, and we're so focused on the season that we're not focused on the eternal, on the fadeth not away. And here, these believers that are facing this great persecution and all this difficulty, these trials that they're going through, Peter says to them, listen, if you're going to rejoice and if you're going to greatly rejoice through these trials, I believe that one of the truths that he shares here that will enable these believers, that will enable you and I this morning to rejoice through trials, is that we must remember our position in Christ. I'm a child of the King. Remember what Jesus said in Luke chapter number 10? These fellows come back and they're rejoicing because the spirits are in subject to them, and they're coming back and they're rejoicing over these things. And we find that in Luke chapter number 10 and verse 17, the Bible says that the 70 returned, they returned with joy. And they're talking about what happened and what transpired and what they experienced, but Jesus says to them in Luke 10 and verse number 20, notwithstanding in this and what they had experienced, he says, in this rejoice not that the spirits are subject unto you, but rather rejoice because your names are written in heaven. We sing that song, there's a new name written down in glory. And it's mine. Oh yes, it's mine. And we sing that song and it reminds us of the day that we trusted the Lord Jesus Christ as our personal Savior. And Jesus says to these 70 that returned, they came back with joy. And Jesus says, listen, don't rejoice because the spirits are made subject to you. Rather rejoice because your names are written in heaven. I'm so thankful that on, for me, August 31st, 1997, my name was written down in that book. I was born again. I was saved by the grace of God. And my position in Christ allows me to rejoice through the trials. Number two, we can rejoice through trials because of God's great power. I'm thankful for my position in Christ and I'm thankful that I serve the omnipotent God. I think about the power of God here in verse number five, continuing really with the thought of our position in Christ and the inheritance that we have. He says, who are kept by the power of God through faith unto salvation, ready to be revealed in the last time. This morning I am so thankful that our God is the omnipotent God. I am thankful that I am kept by the power of God. I'm thankful that there's nothing that's too hard for my God. I'm thankful this morning that in the midst of a trial, in the midst of a difficulty, that God did not lose any power. That God is not, it's not that a matter of His ability or inability. No, we find that God is able. And we find that in the midst of that trial, when we focus and understand that my God has all power and my God is able, that enables me to rejoice. I think about Abraham and there in Genesis, when he's being spoken to by the Lord. And Abraham is told by God that his name, one of his names is El Shaddai, the Lord God Almighty. I love that name of the Lord that he shares with Abraham there. And we find that he says, my name, it's El Shaddai, I'm the Lord God Almighty. And then right after he reveals that to him, he asks him, is there anything too hard for me? We find that Jeremiah is asked a similar question as Jeremiah is prophesying on the eve of captivity. In fact, he's prophesying and the Babylonians have already laid siege against the city. And he can see, he knows, he's the one that's been prophesying that they're going to take us captive. And then God comes to Jeremiah and says that he's supposed to buy a piece of property, buy the field, buy the field. But they're going to come and take, buy the field. And God explains to him about the remnant that's going to return, the 70 year captivity and all that's going to transpire and that they would dwell in that land again. And you know what? You know what he understood? He understood that there's nothing too hard for God. God is all powerful. Listen as we look at the examples that we looked at this morning in the book of Habakkuk and two examples in the book of Acts, they served, Habakkuk, the disciples and Paul and Silas, they served the same God that we serve, the Lord God Omnipotent. He rules and he reigns. And this morning I am so thankful that his power is never lacking, that it's never a situation when you're going through a trial, when I'm going through a trial, it's understood that it's allowed by God. And God can change that thing at any time because he has all power. I'm thankful to know the Omnipotent God, aren't you? I'm thankful to know the God that said let there be light and there was light. I'm thankful that though today they're still trying to determine with some level of accuracy the total number of stars and all of the things of our galaxies and what have you, and the scriptures simply say and he made the stars also. This is a little thing for God because he has all power. And that's your God and that's my God. When I'm in the midst of the trial, when I'm in the midst of the difficulty and I remind myself of my position in Christ, that I'm saved by the blood of the Lamb, that I'm going to heaven one day, that nothing can alter my position in Christ, it causes me to rejoice. When I recognize and I'm reminded of the great power of my God, that he is the Lord God Omnipotent, that he's able to do exceeding abundantly above all that we ask or think, that's my God. And when I remind myself of that, I can rejoice in the midst of the trial. Number three, we can rejoice through trials because of God's purpose. Because of God's purpose. We see that we rejoice through trials because of my position in Christ. We rejoice through trials because of God's great power. But you and I this morning, we can rejoice through trials because of God's purpose. Let me remind you this morning that God always has purpose. He moves with purpose. And we find that God is a God of purpose and everything that happens in your life and everything that happens in my life is for a purpose. Notice in verse number six of our text of Scripture, in 1 Peter 1 and verse number six, the Bible says this, wherein ye greatly rejoice, though now for a season. Listen, your home is in heaven, you have this inheritance and your position in Christ is settled, but before you get there, you might have this trial for a season. And then notice these words, if need be. If need be. Ye are in heaviness through manifold temptations. As we see this phrase, if need be, in verse number six, it reminds me of God's purpose. It reminds me this morning, and it's important for each of us to understand. Listen, I believe it's imperative that we each understand this morning that God always has a purpose. If need be. Who determines that? Not you and not me. God. If it were up to me, I'd never need be. Amen? And if it were up to you, you probably would never need be either because we just don't really like trials. But God has a purpose. God has a purpose. And there are times in your life and there are times in my life that God allows a trial and we're reminded of our position in Christ, we're reminded of God's power. Those are going to enable us to rejoice, but when we're reminded that God has a purpose in this. This didn't happen by accident. This was not some situation that caught God off guard. It was not a situation... Listen, has anything ever caught you off guard? You're working, you're doing something, you say, man, I didn't see that coming. I didn't expect that. It doesn't matter how well you are at what you do. It doesn't matter how skillful you are. It doesn't matter how much you've planned and... prepared and so on and so forth, there are things that might happen that you say, man, I didn't plan for that. I didn't think that was going to happen. That never happens to God. God knows everything. And God does all things well. Our God is perfect. In this morning when we are reminded that we can rejoice through trials because God has a purpose, we find that it says, if need be, ye are in heaviness through manifold temptations. Notice that the trial of your faith, being much more precious than of gold that perisheth, though it be tried with fire, might be found unto praise and honor and glory at the appearing of Jesus Christ, whom having not seen, ye love, and whom though now ye see him not, yet believing, ye rejoice with joy unspeakable and full of glory, receiving the end of your faith, even the salvation of your souls. I'll read also in 1 Peter 5, I read these verses a moment ago, but notice in verse 10 and 11 of 1 Peter 5, it says, but the God of all grace who hath called us unto his eternal glory by Christ Jesus, after that ye have suffered a while, make you perfect, establish, strengthen, settle you. To him be glory and dominion forever and ever. Amen. From these two portions of Scripture in 1 Peter 1, verses 6 through 9, and in 1 Peter 5, verses 10 and 11, we really have the opportunity through these two portions of Scripture in 1 Peter to understand two purposes that God has. First and foremost, I believe that God's purpose is to bring honor and glory to himself. That's the primary purpose, is for God to be honored and glorified. And we find that at times God will allow a trial in your life and he'll allow a trial in my life, and as we are reminded of God's, of our position in Christ and of God's power and understanding his purpose, and we understand that through this God is to be honored and glorified. I may not see at the start of the trial exactly how it is that God's going to be honored and glorified, but I can understand and I can rest assured that God has a purpose in the midst of that trial. And I'm so thankful that God in the midst of the trial is to be honored and glorified. Notice if you will, take your Bibles and turn back to the book of John if you will, and I want to show you a thought here in John chapter number 11, and I want you to see, I'm in Luke, I better get over to John, I went too far. In John chapter number 11, it's a familiar passage of Scripture. The Bible tells us in John chapter 11 that near the end of the passage that Jesus stands and says, Lazarus, come forth. And we all know what happens in this portion of Scripture. Lazarus comes walking out of the grave. He was dead for four days, and the concern was that he surely stinketh by now. But we find at the very beginning of this passage of Scripture in John chapter 11 that Lazarus falls sick, and Mary and Martha, they believed not only that the Lord Jesus Christ loved their brother, but I believe that they, and you study through the passage of Scripture, they believed that Jesus had the ability to heal Lazarus of whatever the sickness was. In fact, they both protest when Jesus arrives that if thou hadst been here, my brother had not died. Not only did Mary and Martha believe that, but I would say to you that the Jews that were gathered together that were wailing and that were mourning with the family, that they also say in verse number 37, could not this man which opened the eyes of the blind have caused that even this man should not have died? They believe. Listen, the account in John chapter 10 of the pool of Bethesda and the eyes being open, I mean, that's an amazing truth that is given to us, and we find that there as we look at what's happening and looking at that context that now, John chapter number 9, excuse me, we find that there this man that was born blind, he was blind from his birth, that these Jews, they say, could not this man that healed that man that was blind, could not, he could have healed this man. And so Mary and Martha believe that Jesus was able, and therefore they send for him. Now, we believe that Jesus is able, so what do we do? We pray. Jesus is not here physically with us as he was in John chapter 11, the earthly ministry of the Lord Jesus Christ, when he took on the form of a man, he never ceased being God, he's the God-man, and we find that at the incarnation he comes in this ministry of the Lord Jesus Christ's earthly ministry in John chapter 11, we find that they were able to send physically for Jesus to come. Jesus is not here physically anymore. We understand that we have the Holy Spirit of God that indwells us, we understand the Bible says that he ascended to heaven, and one day, one glorious day, he's coming back for us and how we should rejoice in that, but he's at the right hand of the Father, he ever liveth, the Bible says, to make intercession for us. And we cannot go call for Jesus that he's down at the, the, the wherever he is and bring him here physically like they could, but we pray. Why do we pray? Well, because we believe that Jesus is able. But when Jesus finds out about he whom thou lovest is sick, Jesus didn't immediately go. He tarried because he had a purpose. Notice in verse number 4 of John 11, the Bible says when Jesus heard that, heard what? That Lazarus was sick, he said, the sickness is not unto death, but then notice these words, but for the glory of God, but for the glory of God, that the Son of God might be glorified thereby. Listen, in your life and in my life, we go through trials. One of the purposes that God has is that he would receive the honor and glory. You say, man, this trial is just, it's just overwhelming and I can't, how's God going to get glory through it? If we're complaining and murmuring and we're just kind of, it's going to make it pretty tough. But when we understand that he has a purpose, we say, God, I'm not sure what you're doing here, but I know that you do all things well. I know, God, that you make no mistakes. God, I know that you have a purpose in this. And God, I pray that through this somehow you would receive the honor and the glory, that your name would be exalted, that you would be magnified through this trial. Not only is he seeking to bring honor and glory to himself, but he's seeking to develop you and I spiritually. He's seeking to develop us spiritually. You know, growth has challenges. You ever hear somebody speak medically about physical growth and they talk about growing pains? You ever hear somebody use that phraseology? My brother, he grew about six inches one summer and he had terrible pain in his knees for several months because of what the doctor said is that he grew so fast that all those ligaments and what have you were stretched out and it was just causing him pain. And they said, just bear with it for a little while and it will go away. And eventually that kind of happened. But you hear that thing of growing pains. Listen, when you grow, if you want to go work out, I was working out with Joseph and he's at that age where he wants to start lifting weights and so I'm lifting weights with Joseph. And guess what happens after you lift weights when you haven't done it for a while? You're sore. And so you know what Joseph likes to do, Tim? He likes to come over to me and he likes to do this right here. How's that feel, daddy? How's this feel, daddy? Why? Because he knows that that's sore because of the muscles that we worked. It's just how it works. Sometimes the growth spiritually requires a trial. But God's developing us. You say, but I don't want that pain. I don't want that. But God's growing you. You're going to learn something that you would not learn under any other circumstance. Notice here in John 11, after Jesus delays, he tells the disciples that we're going to go. And he says in verse number 11, these things said he, and after that he saith unto them, Our friend Lazarus sleepeth, but I go that I may wake him out of sleep. Then said his disciples, Lord, if he sleep, he shall do well. Howbeit Jesus spake of his death, but they thought that he had spoken of taking a rest and sleep. Then said Jesus unto them plainly, Lazarus is dead. But then I want you to catch verse 15. Jesus says this, I am glad for your sakes that I was not there, to the intent you may believe. Nevertheless, let us go unto him. He says, I am glad for your sakes that I was not there. Listen, there's some things that God's going to teach us in the midst of trials that we're only going to learn through the trial. It's just the way it works. Some of you do various things for a living that require certain types of training. And there are times in which you engage in training that you hope you never have to use. But you learn some things through that process. And God, as he's bringing, as he's allowing trials in your life and in my life, I am able to rejoice. I'm able to have joy unspeakable and full of glory. I'm able to rejoice greatly. in the midst of the trial, why? Because I understand my position in Christ. This trial that I'm going through is not going to change my position in Christ. It's not gonna alter it one bit. It's not gonna change that I'm going to heaven one day. This trial that I'm going through, I know that my God has all power, and I know that my God is able, and I know that he is able to do something amazing, and I trust him, and I'm following him, and I'm rejoicing because it's kind of that idea of anticipating and expecting what's God going to do. You remember the disciples when they're in the midst of the storm on the boat? By the way, they were in the midst of the storm because Jesus told them, go to the other side. This idea this morning that trials are always, 100% of the time, a result of your sin or my sin is not biblical. Now there are some times that, the way of the transgressor is hard. There are some times that sin results in some hardship and some difficulty, but I would submit to you this morning that there are times in which you, there are times that I may be right in the midst of a great storm of a trial simply because I'm obeying God, simply because I'm following the leadership of the Holy Spirit of God, and I find myself in the midst of a trial. Such was the case for the disciples on that day, and they find themselves in the midst of a great storm, and Jesus then says, peace be still, and the storm is calm. They got to see the power. What manner of man is this that even the winds and the waves obey him? They get to learn some things. Listen, if there was never a storm, they never would have seen that power. If there was never a storm, you would never be able to read the account. I'd never be able to preach or teach the account of Jesus demonstrating his power over the storm. They needed to go through a storm. This morning, God has a purpose. His purpose, first and foremost, is to bring honor and glory to himself. Secondly, it's to develop us spiritually. Notice, it says that the trial of your faith in 1 Peter 1 and verse number seven, being much more precious than of gold that perisheth. That'll put some things in perspective as to what is important and what's the priority. He says, though it be tried with fire, might be found in the praise and honor and glory at the appearing of Jesus Christ. Listen, one day, he's coming back. One day, I'm going to see him. We sang last week, face to face, I shall behold him. One day, I'm going to see my savior. Man, that should encourage every single believer this morning, I'm going to see him. We find, it says that we can have this joy, unspeakable and full of glory in 1 Peter 5 and verse 10. It says that after you've suffered a while, that he will make you perfect, establish, strengthen, and settle you. I want you to think about that work that God's doing through the trial and developing us spiritually. No doubt that we could stand here this morning and we could give testimonies. We could open up for opportunity for some to give some testimonies this morning of, listen, how has God taught you certain things? How has God grown you spiritually? And I can guarantee you that there will be some trials that are referenced as to how God developed us. Job said it this way in Job 23. Verse number 10, but he knoweth the way that I take. When he hath tried me, I shall come forth as gold. As gold. I want you to think about Job just for a moment. You say, man, I had a bad day. Read Job. Seriously. How many of you have read Job before? Okay. If you've read Job, I'm guessing that you've never had a day like Job had. And Job says, he knoweth the way that I take. When he hath tried me, I shall come forth as gold. Ron Hamilton wrote a song that goes along with this verse of Scripture. Man, what a powerful truth. James says it this way, and we'll close with this in James one, verses two through four. Notice here, James says, my brethren, count it all joy when you fall into divers temptations. Rejoicing through trials. Count it all joy. Temptations, trials, divers, various sorts. Then notice these two words, and I think they're so important. Knowing this. There's some things that God wants his people to know. Knowing this, that the trying of your faith worketh patience, but let patience have her perfect work, that ye may be perfect and entire, wanting nothing. That's maturity, Christian maturity, perfect. Not sinless, but complete, that idea of maturity. And it says that knowing this, this morning, the question is not whether you'll have a trial. The question really for us this morning is how do we respond in the midst of the trial? Can we rejoice through trials? We're commanded to do so. Rejoice in the Lord always, and again I say rejoice. This is the day the Lord hath made. We will rejoice and be glad in it. We can see some people in the pages of scripture, I've just looked at three references this morning, that face great difficulty, and yet they rejoiced. So absolutely we can rejoice through trials. This is not an exhaustive list this morning, but from 1 Peter 1, just three simple thoughts, truths that will enable you, that will enable me to rejoice in the midst of trial. Number one, remember your position in Christ. What a joy to be saved, what a joy. No man, no thing can alter your position in Christ. Remember the power of God in the midst of your trial. Remember God's power. We serve the Lord God omnipotent. He's able to do exceeding abundantly above all that we ask or think. And then finally this morning, remember that God has a purpose. It's never by accident. It's never for naught. It's not just an exercise to, well we got nothing else to do today, so we're just gonna have you do this. It's not busy work, it's not, no, no, no. There's a purpose. First and foremost, that God will be glorified. And secondly, that we'd be developed, that we'd grow spiritually, that we'd come to that place of spiritual maturity. Trials, rejoicing through trials. Let's pray. Father, we love you. We thank you for loving us. We thank you for the opportunity that you've given us this morning to gather together. We thank you for the word of God. We thank you for the truth. God, I know that I will face trials. I know that each one that sits here this morning will face trials. And God, I pray that you would enable us to rejoice through trials, that these three truths from 1 Peter 1 would just permeate our minds, that we'd be reminded in the midst of trial of our position in Christ, of your great power and of your purpose. Lord, maybe this morning there's some that are just going through trials, difficulties. Lord, I pray that you'd help them this morning. Lord, for one that says, man, I have nothing, no trial right now. God, help them to store this and to be ready to return to it when that trial does come. Lord, that you'd help us to rejoice through trials. There's one that's not sure of heaven, they've never been saved. Lord, I pray that today they'd be saved so they'd know that position that they have in Christ. I pray that you'd move and work as only you can and we'll give you the glory for it. It's in Christ's name we pray. Would you stand with me? Heads or backs?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.519999980926514,
      "text": " number 1, 1 Peter chapter number 1, be looking at verses 3 through 9, and hold your place"
    },
    {
      "id": 1,
      "start": 5.519999980926514,
      "end": 9.15999984741211,
      "text": " and I'm going to reference a couple of other portions of Scripture before we get to 1 Peter"
    },
    {
      "id": 2,
      "start": 9.15999984741211,
      "end": 15.199999809265137,
      "text": " chapter 1, but 1 Peter chapter number 1 will be our text this morning, and the title, if"
    },
    {
      "id": 3,
      "start": 15.199999809265137,
      "end": 20.68000030517578,
      "text": " you've already looked at the back of the bulletin, Rejoicing Through Trials, Rejoicing Through"
    },
    {
      "id": 4,
      "start": 20.68000030517578,
      "end": 25.15999984741211,
      "text": " Trials, tonight we're going to look at Genesis chapter number 40 and look at this subject"
    },
    {
      "id": 5,
      "start": 25.15999984741211,
      "end": 30.360000610351562,
      "text": " of faithful through trials, and that's why I said they're complementary, one to the other,"
    },
    {
      "id": 6,
      "start": 30.360000610351562,
      "end": 35.7599983215332,
      "text": " and I believe, to just give a quick snippet with regard to the message this evening, I"
    },
    {
      "id": 7,
      "start": 35.7599983215332,
      "end": 39.959999084472656,
      "text": " believe that a great key to being faithful through trials is learning what we're going"
    },
    {
      "id": 8,
      "start": 39.959999084472656,
      "end": 43.959999084472656,
      "text": " to look at this morning, and that is rejoicing through trials, because if we can learn to"
    },
    {
      "id": 9,
      "start": 43.959999084472656,
      "end": 48.880001068115234,
      "text": " rejoice through trials, it's going to go a long way to help us be faithful through trials."
    },
    {
      "id": 10,
      "start": 48.880001068115234,
      "end": 52.84000015258789,
      "text": " I believe the enemy wants us to quit, I believe the enemy wants us to give up, and we have"
    },
    {
      "id": 11,
      "start": 52.84000015258789,
      "end": 57.31999969482422,
      "text": " trials that we face in this world and this earth, and I believe the enemy wants us to"
    },
    {
      "id": 12,
      "start": 57.31999969482422,
      "end": 62.15999984741211,
      "text": " quit and just turn back and not live for the Lord, but we understand this morning, even"
    },
    {
      "id": 13,
      "start": 62.15999984741211,
      "end": 66.87999725341797,
      "text": " as we'll look at this message and then look at the message this evening, that all of us"
    },
    {
      "id": 14,
      "start": 66.87999725341797,
      "end": 70.0,
      "text": " have personally experienced trials."
    },
    {
      "id": 15,
      "start": 70.0,
      "end": 73.19999694824219,
      "text": " And you might say this morning, Pastor, you have no idea, I'm in the midst of a trial"
    },
    {
      "id": 16,
      "start": 73.19999694824219,
      "end": 77.37999725341797,
      "text": " right now, and I understand, a preacher of yesteryear said you're either in the midst"
    },
    {
      "id": 17,
      "start": 77.37999725341797,
      "end": 82.16000366210938,
      "text": " of one, you've just come out of one, or there's one on the horizon, and for many we can say"
    },
    {
      "id": 18,
      "start": 82.4800033569336,
      "end": 87.23999786376953,
      "text": " that's pretty true with regard to trials in our lives."
    },
    {
      "id": 19,
      "start": 87.23999786376953,
      "end": 93.23999786376953,
      "text": " We may not always respond properly in the midst of a trial."
    },
    {
      "id": 20,
      "start": 93.23999786376953,
      "end": 97.12000274658203,
      "text": " I'm sure that if you were to evaluate your life, if I were to evaluate my life, there"
    },
    {
      "id": 21,
      "start": 97.12000274658203,
      "end": 102.55999755859375,
      "text": " are times in the midst of a trial that we do not respond appropriately, we do not respond"
    },
    {
      "id": 22,
      "start": 102.55999755859375,
      "end": 103.72000122070312,
      "text": " biblically."
    },
    {
      "id": 23,
      "start": 103.72000122070312,
      "end": 108.95999908447266,
      "text": " We find, however, that God has given us in His Word the instruction that we are to rejoice"
    },
    {
      "id": 24,
      "start": 108.95999908447266,
      "end": 114.95999908447266,
      "text": " always, not just to rejoice when things go well, when things are the way that we desire"
    },
    {
      "id": 25,
      "start": 114.95999908447266,
      "end": 119.4000015258789,
      "text": " for them to be, but we find that we've been given that instruction, rejoice in the Lord"
    },
    {
      "id": 26,
      "start": 119.4000015258789,
      "end": 124.80000305175781,
      "text": " always, Philippians 4 and verse number 4, and again I say unto thee, rejoice."
    },
    {
      "id": 27,
      "start": 124.80000305175781,
      "end": 128.16000366210938,
      "text": " The psalmist said it this way in Psalm 118 and verse 24, this is the day the Lord hath"
    },
    {
      "id": 28,
      "start": 128.16000366210938,
      "end": 132.0800018310547,
      "text": " made, we will rejoice and be glad in it."
    },
    {
      "id": 29,
      "start": 132.0800018310547,
      "end": 138.27999877929688,
      "text": " And it's a determination, it's being purposed in the fact that we're going to rejoice no"
    },
    {
      "id": 30,
      "start": 138.27999877929688,
      "end": 146.1199951171875,
      "text": " matter what comes our way in that particular day, we're going to rejoice in the Lord."
    },
    {
      "id": 31,
      "start": 146.1199951171875,
      "end": 150.52000427246094,
      "text": " And we have to be intentional about it, we have to be purposed in it, and we find that"
    },
    {
      "id": 32,
      "start": 150.52000427246094,
      "end": 152.67999267578125,
      "text": " God will bless."
    },
    {
      "id": 33,
      "start": 152.67999267578125,
      "end": 156.72000122070312,
      "text": " Not only have we been given instruction with regard to rejoicing through trials, but we"
    },
    {
      "id": 34,
      "start": 156.72000122070312,
      "end": 161.63999938964844,
      "text": " find that as we study through the pages of this precious book that we can read the record"
    },
    {
      "id": 35,
      "start": 161.63999938964844,
      "end": 168.47999572753906,
      "text": " that God has given us of many who have rejoiced in the midst of great trials."
    },
    {
      "id": 36,
      "start": 168.47999572753906,
      "end": 174.0399932861328,
      "text": " Their behavior in the midst of trials was appropriate and I would say was exemplary"
    },
    {
      "id": 37,
      "start": 174.0399932861328,
      "end": 178.60000610351562,
      "text": " as we have the opportunity to be able to study those portions of Scripture."
    },
    {
      "id": 38,
      "start": 178.60000610351562,
      "end": 183.0,
      "text": " I know in my life that I will face more trials."
    },
    {
      "id": 39,
      "start": 183.0,
      "end": 188.16000366210938,
      "text": " The reality this morning is that I know in your life that you will face more trials."
    },
    {
      "id": 40,
      "start": 188.16000366210938,
      "end": 193.75999450683594,
      "text": " We will face trials collectively, corporately as a church, and we understand that we will"
    },
    {
      "id": 41,
      "start": 193.75999450683594,
      "end": 195.25999450683594,
      "text": " face trials."
    },
    {
      "id": 42,
      "start": 195.25999450683594,
      "end": 198.75999450683594,
      "text": " The question really this morning is not, will I face a trial?"
    },
    {
      "id": 43,
      "start": 198.75999450683594,
      "end": 206.16000366210938,
      "text": " The question this morning is this, how will I behave in the midst of the trial?"
    },
    {
      "id": 44,
      "start": 206.16000366210938,
      "end": 212.24000549316406,
      "text": " Maybe I'll turn it this way to go along with the title this morning, will I rejoice through"
    },
    {
      "id": 45,
      "start": 212.24000549316406,
      "end": 213.24000549316406,
      "text": " trials?"
    },
    {
      "id": 46,
      "start": 213.24000549316406,
      "end": 215.1199951171875,
      "text": " Will I rejoice through trials?"
    },
    {
      "id": 47,
      "start": 215.1199951171875,
      "end": 218.32000732421875,
      "text": " And I told you to look at 1 Peter and I would get there in a moment, but I want to read"
    },
    {
      "id": 48,
      "start": 218.32000732421875,
      "end": 221.8000030517578,
      "text": " three portions of Scripture very quickly this morning."
    },
    {
      "id": 49,
      "start": 221.8000030517578,
      "end": 225.63999938964844,
      "text": " The first one is from the book of Habakkuk, and I want to read Habakkuk chapter number"
    },
    {
      "id": 50,
      "start": 225.63999938964844,
      "end": 226.8000030517578,
      "text": " three."
    },
    {
      "id": 51,
      "start": 226.8000030517578,
      "end": 232.16000366210938,
      "text": " And as we look in Habakkuk chapter number three and look at what the prophet of old"
    },
    {
      "id": 52,
      "start": 232.16000366210938,
      "end": 237.0800018310547,
      "text": " says with regard to rejoicing, again we'll look at two other examples in the New Testament"
    },
    {
      "id": 53,
      "start": 237.0800018310547,
      "end": 241.82000732421875,
      "text": " as we get into the message this morning, and understanding that we've been given that command"
    },
    {
      "id": 54,
      "start": 241.82000732421875,
      "end": 244.3000030517578,
      "text": " that we are to rejoice in the Lord always."
    },
    {
      "id": 55,
      "start": 244.3000030517578,
      "end": 249.94000244140625,
      "text": " Again, as we mentioned, the psalmist made that great declaration in Psalm 118."
    },
    {
      "id": 56,
      "start": 249.94000244140625,
      "end": 253.6999969482422,
      "text": " We sing the song, but it says, this is the day which the Lord hath made."
    },
    {
      "id": 57,
      "start": 253.6999969482422,
      "end": 257.6600036621094,
      "text": " We will rejoice and be glad in it."
    },
    {
      "id": 58,
      "start": 257.6600036621094,
      "end": 261.4599914550781,
      "text": " And we find here that Habakkuk, if you found your place there in Habakkuk chapter number"
    },
    {
      "id": 59,
      "start": 261.4599914550781,
      "end": 267.29998779296875,
      "text": " three, notice in verse 17, notice what the Bible says, although the fig tree shall not"
    },
    {
      "id": 60,
      "start": 267.29998779296875,
      "end": 268.29998779296875,
      "text": " blossom."
    },
    {
      "id": 61,
      "start": 268.29998779296875,
      "end": 270.3399963378906,
      "text": " That's not a good situation."
    },
    {
      "id": 62,
      "start": 270.3399963378906,
      "end": 274.94000244140625,
      "text": " The fig tree is supposed to blossom, amen, produce fruit."
    },
    {
      "id": 63,
      "start": 274.94000244140625,
      "end": 278.17999267578125,
      "text": " Neither shall fruit be in the vines."
    },
    {
      "id": 64,
      "start": 278.17999267578125,
      "end": 281.239990234375,
      "text": " That's unfortunate."
    },
    {
      "id": 65,
      "start": 281.239990234375,
      "end": 288.1000061035156,
      "text": " The labor of the olive shall fail, and the fields shall yield no meat."
    },
    {
      "id": 66,
      "start": 288.1000061035156,
      "end": 294.4200134277344,
      "text": " The flock shall be cut off from the fold, and there shall be no herd in the stalls."
    },
    {
      "id": 67,
      "start": 294.4200134277344,
      "end": 299.4200134277344,
      "text": " If you read Habakkuk 3 in verse 17, that paints a very, very dim picture."
    },
    {
      "id": 68,
      "start": 299.4200134277344,
      "end": 301.260009765625,
      "text": " Would you agree?"
    },
    {
      "id": 69,
      "start": 301.260009765625,
      "end": 305.94000244140625,
      "text": " The Bible says that the fig tree shall not blossom, the fruit shall not be on the vines,"
    },
    {
      "id": 70,
      "start": 305.94000244140625,
      "end": 309.6400146484375,
      "text": " the labor of the olive shall fail, the field shall yield no meat, the flock shall be cut"
    },
    {
      "id": 71,
      "start": 309.6400146484375,
      "end": 313.1000061035156,
      "text": " off from the fold, and there shall be no herd in the stalls."
    },
    {
      "id": 72,
      "start": 313.1000061035156,
      "end": 322.5400085449219,
      "text": " And yet the writer says, yet I will rejoice in the Lord."
    },
    {
      "id": 73,
      "start": 322.5400085449219,
      "end": 327.260009765625,
      "text": " Habakkuk, did you see what you just wrote in verse 17?"
    },
    {
      "id": 74,
      "start": 327.260009765625,
      "end": 328.260009765625,
      "text": " Yeah."
    },
    {
      "id": 75,
      "start": 328.8599853515625,
      "end": 332.5400085449219,
      "text": " That's why I said it's purposed, it's intentional."
    },
    {
      "id": 76,
      "start": 332.5400085449219,
      "end": 336.1000061035156,
      "text": " It's a, I'm going to rejoice in the Lord always."
    },
    {
      "id": 77,
      "start": 336.1000061035156,
      "end": 341.3399963378906,
      "text": " I'm going to determine, even in the midst, going through the trials of life, I'm going"
    },
    {
      "id": 78,
      "start": 341.3399963378906,
      "end": 343.739990234375,
      "text": " to determine that I'm going to rejoice."
    },
    {
      "id": 79,
      "start": 343.739990234375,
      "end": 347.3800048828125,
      "text": " He says, yet I will rejoice in the Lord."
    },
    {
      "id": 80,
      "start": 347.3800048828125,
      "end": 351.8999938964844,
      "text": " I will joy in the God of my salvation."
    },
    {
      "id": 81,
      "start": 351.8999938964844,
      "end": 358.9800109863281,
      "text": " The Lord God is my strength and He will make my feet like Heinz feet and He will make me"
    },
    {
      "id": 82,
      "start": 358.9800109863281,
      "end": 365.0199890136719,
      "text": " to walk upon mine high places to the chief singer on my stringed instruments."
    },
    {
      "id": 83,
      "start": 365.0199890136719,
      "end": 369.4200134277344,
      "text": " And I want you to just see the determination, the resolve, if you will, of Habakkuk in verse"
    },
    {
      "id": 84,
      "start": 369.4200134277344,
      "end": 372.94000244140625,
      "text": " 18, yet I will rejoice in the Lord."
    },
    {
      "id": 85,
      "start": 372.94000244140625,
      "end": 375.70001220703125,
      "text": " Listen, God is good."
    },
    {
      "id": 86,
      "start": 375.70001220703125,
      "end": 377.32000732421875,
      "text": " God is good."
    },
    {
      "id": 87,
      "start": 377.32000732421875,
      "end": 380.1000061035156,
      "text": " God is good all of the time."
    },
    {
      "id": 88,
      "start": 380.1000061035156,
      "end": 384.9800109863281,
      "text": " God is not good based on your circumstances, based on what you're dealing with in life."
    },
    {
      "id": 89,
      "start": 384.9800109863281,
      "end": 387.5,
      "text": " No, God is good."
    },
    {
      "id": 90,
      "start": 387.5,
      "end": 390.2200012207031,
      "text": " Taste and see that the Lord is good."
    },
    {
      "id": 91,
      "start": 390.2200012207031,
      "end": 391.2200012207031,
      "text": " He is gracious."
    },
    {
      "id": 92,
      "start": 391.2200012207031,
      "end": 395.70001220703125,
      "text": " We can look and we'll mention as we get through the message this morning about what Peter"
    },
    {
      "id": 93,
      "start": 395.70001220703125,
      "end": 400.7799987792969,
      "text": " says with regard to this subject there in 1 Peter chapter number one with rejoicing"
    },
    {
      "id": 94,
      "start": 400.7799987792969,
      "end": 401.7799987792969,
      "text": " through trials."
    },
    {
      "id": 95,
      "start": 401.7799987792969,
      "end": 407.8599853515625,
      "text": " But we understand that even as Peter would be writing, he says in the second chapter,"
    },
    {
      "id": 96,
      "start": 407.8599853515625,
      "end": 411.2200012207031,
      "text": " you don't need to turn there, but he says, if so be that you have tasted that the Lord"
    },
    {
      "id": 97,
      "start": 411.2200012207031,
      "end": 412.2200012207031,
      "text": " is gracious."
    },
    {
      "id": 98,
      "start": 412.2200012207031,
      "end": 413.2200012207031,
      "text": " God is gracious."
    },
    {
      "id": 99,
      "start": 413.2200012207031,
      "end": 414.2200012207031,
      "text": " He's good."
    },
    {
      "id": 100,
      "start": 414.2200012207031,
      "end": 418.3399963378906,
      "text": " He's a great God."
    },
    {
      "id": 101,
      "start": 418.3399963378906,
      "end": 421.4200134277344,
      "text": " Notice in Acts chapter number five, we see the first example."
    },
    {
      "id": 102,
      "start": 421.4200134277344,
      "end": 425.9800109863281,
      "text": " We find that God's given us the command that we're to rejoice in the Lord all way."
    },
    {
      "id": 103,
      "start": 425.9800109863281,
      "end": 431.70001220703125,
      "text": " We find there in the book of Habakkuk that Habakkuk says, yet I will rejoice in the Lord."
    },
    {
      "id": 104,
      "start": 431.70001220703125,
      "end": 437.3800048828125,
      "text": " Though all of those negatives that are mentioned in verse 17, yet I will rejoice."
    },
    {
      "id": 105,
      "start": 437.3800048828125,
      "end": 441.29998779296875,
      "text": " Notice in Acts chapter number five, we do not have the time this morning to develop"
    },
    {
      "id": 106,
      "start": 441.29998779296875,
      "end": 445.82000732421875,
      "text": " all that is taking place in Acts chapter number five, but let me say this, the disciples are"
    },
    {
      "id": 107,
      "start": 445.82000732421875,
      "end": 448.94000244140625,
      "text": " facing some real difficulty in Acts chapter number five."
    },
    {
      "id": 108,
      "start": 448.94000244140625,
      "end": 453.260009765625,
      "text": " They have been in a position where they've been preaching the gospel after the ascension"
    },
    {
      "id": 109,
      "start": 453.260009765625,
      "end": 457.5799865722656,
      "text": " of the Lord Jesus Christ and after the day of Pentecost and they're facing the persecution."
    },
    {
      "id": 110,
      "start": 457.5799865722656,
      "end": 461.4200134277344,
      "text": " The religious leaders are not happy with the growth of the New Testament church and all"
    },
    {
      "id": 111,
      "start": 461.4200134277344,
      "end": 462.4200134277344,
      "text": " that's taking place."
    },
    {
      "id": 112,
      "start": 462.4200134277344,
      "end": 466.6600036621094,
      "text": " In fact, they tell them that they're not to speak anymore in the name of the Lord Jesus"
    },
    {
      "id": 113,
      "start": 466.6600036621094,
      "end": 472.5799865722656,
      "text": " Christ and yet when they're standing in Acts five before this religious group of leaders,"
    },
    {
      "id": 114,
      "start": 472.5799865722656,
      "end": 476.4200134277344,
      "text": " they say that you've filled Jerusalem with your doctrine and they're trying to figure"
    },
    {
      "id": 115,
      "start": 476.4200134277344,
      "end": 482.94000244140625,
      "text": " out what they can do to stop these individuals from continuing to preach the gospel."
    },
    {
      "id": 116,
      "start": 482.94000244140625,
      "end": 487.1400146484375,
      "text": " And after they're having this conversation and all that's taking place, we find that"
    },
    {
      "id": 117,
      "start": 487.1400146484375,
      "end": 488.3399963378906,
      "text": " Gamaliel stands up."
    },
    {
      "id": 118,
      "start": 488.3399963378906,
      "end": 493.0199890136719,
      "text": " He's a doctor of the law, according to verse number 34, and he gives his opinion, he gives"
    },
    {
      "id": 119,
      "start": 493.0199890136719,
      "end": 498.1000061035156,
      "text": " his counsel with regard to the circumstances and we find that in verse 38 it says,"
    },
    {
      "id": 120,
      "start": 498.1000061035156,
      "end": 502.94000244140625,
      "text": " And now I say unto you, refrain from these men, and let them alone."
    },
    {
      "id": 121,
      "start": 502.94000244140625,
      "end": 507.1400146484375,
      "text": " For if this counsel or this work be of men, it will come to naught."
    },
    {
      "id": 122,
      "start": 507.1400146484375,
      "end": 511.3800048828125,
      "text": " But if it be of God, ye cannot overthrow it, lest happily ye be found even to fight against"
    },
    {
      "id": 123,
      "start": 511.3800048828125,
      "end": 512.3800048828125,
      "text": " God."
    },
    {
      "id": 124,
      "start": 512.3800048828125,
      "end": 515.4199829101562,
      "text": " Listen, I'm thankful this morning that we're not just, it's not my cause."
    },
    {
      "id": 125,
      "start": 515.4199829101562,
      "end": 516.4199829101562,
      "text": " It's not your cause."
    },
    {
      "id": 126,
      "start": 516.4199829101562,
      "end": 517.4199829101562,
      "text": " It's the cause of Christ."
    },
    {
      "id": 127,
      "start": 517.4199829101562,
      "end": 521.0999755859375,
      "text": " And that ought to cause us to rejoice greatly."
    },
    {
      "id": 128,
      "start": 521.0999755859375,
      "end": 522.8200073242188,
      "text": " It's not a work of just men."
    },
    {
      "id": 129,
      "start": 522.8200073242188,
      "end": 525.260009765625,
      "text": " It's the cause of Christ."
    },
    {
      "id": 130,
      "start": 525.260009765625,
      "end": 527.9400024414062,
      "text": " And notice it says, And to him they agreed."
    },
    {
      "id": 131,
      "start": 527.9400024414062,
      "end": 531.739990234375,
      "text": " They as the religious leaders and him as Gamaliel."
    },
    {
      "id": 132,
      "start": 531.739990234375,
      "end": 533.0999755859375,
      "text": " And they agreed with his counsel."
    },
    {
      "id": 133,
      "start": 533.0999755859375,
      "end": 534.0999755859375,
      "text": " They agreed with what he says."
    },
    {
      "id": 134,
      "start": 534.0999755859375,
      "end": 537.7000122070312,
      "text": " And it says in verse 40, And when they had called the apostles, and notice these three"
    },
    {
      "id": 135,
      "start": 537.7000122070312,
      "end": 544.3800048828125,
      "text": " words and beaten them, and beaten them, the Bible says they commanded that they should"
    },
    {
      "id": 136,
      "start": 544.3800048828125,
      "end": 547.4600219726562,
      "text": " not speak in the name of Jesus and let them go."
    },
    {
      "id": 137,
      "start": 547.4600219726562,
      "end": 549.3800048828125,
      "text": " And they departed from the presence of the council."
    },
    {
      "id": 138,
      "start": 549.3800048828125,
      "end": 556.0999755859375,
      "text": " Notice this next phrase, rejoicing that they were counted worthy to suffer shame for his"
    },
    {
      "id": 139,
      "start": 556.0999755859375,
      "end": 557.0999755859375,
      "text": " name."
    },
    {
      "id": 140,
      "start": 557.0999755859375,
      "end": 558.0999755859375,
      "text": " You know what they were doing?"
    },
    {
      "id": 141,
      "start": 558.0999755859375,
      "end": 560.5800170898438,
      "text": " They were rejoicing through trials."
    },
    {
      "id": 142,
      "start": 560.5800170898438,
      "end": 565.6199951171875,
      "text": " They were beaten, and yet they left rejoicing."
    },
    {
      "id": 143,
      "start": 565.6199951171875,
      "end": 569.9400024414062,
      "text": " They were commanded, and yet the Bible says that they daily in verse 42 and in the temple"
    },
    {
      "id": 144,
      "start": 569.9400024414062,
      "end": 575.0599975585938,
      "text": " and every house, they cease not to teach and preach Jesus Christ."
    },
    {
      "id": 145,
      "start": 575.0599975585938,
      "end": 579.3599853515625,
      "text": " The very thing that caused them to be beaten, they said, no, we're going to keep on doing"
    },
    {
      "id": 146,
      "start": 579.3599853515625,
      "end": 580.3599853515625,
      "text": " that."
    },
    {
      "id": 147,
      "start": 580.3599853515625,
      "end": 581.3599853515625,
      "text": " Why?"
    },
    {
      "id": 148,
      "start": 581.3599853515625,
      "end": 583.3599853515625,
      "text": " Because we are his witnesses."
    },
    {
      "id": 149,
      "start": 583.3599853515625,
      "end": 588.9600219726562,
      "text": " We find that here in Acts chapter 16, another example, we find specifically in Acts 16 that"
    },
    {
      "id": 150,
      "start": 588.9600219726562,
      "end": 590.3200073242188,
      "text": " of Paul and Silas."
    },
    {
      "id": 151,
      "start": 590.3200073242188,
      "end": 594.4000244140625,
      "text": " And again, we won't take the time to read the entire context of what's taking place,"
    },
    {
      "id": 152,
      "start": 594.4000244140625,
      "end": 597.9199829101562,
      "text": " but we know that in Acts 16, they come to Philippi."
    },
    {
      "id": 153,
      "start": 597.9199829101562,
      "end": 599.9600219726562,
      "text": " The work of the Lord is going on."
    },
    {
      "id": 0,
      "start": 599.9600219726562,
      "end": 606.3600220680237,
      "text": " And we know that there was that demon-possessed girl, and we find that Paul gave command,"
    },
    {
      "id": 1,
      "start": 606.3600220680237,
      "end": 610.9600219726562,
      "text": " and she… the owners, they were going to lose gain, and so they're very angry, and"
    },
    {
      "id": 2,
      "start": 610.9600219726562,
      "end": 614.560022354126,
      "text": " they cause for Paul and Silas to be imprisoned and to be beaten."
    },
    {
      "id": 3,
      "start": 614.560022354126,
      "end": 619.0000228881836,
      "text": " The Bible tells us in verse 22, \"...until the multitude rose up together against them,"
    },
    {
      "id": 4,
      "start": 619.0000228881836,
      "end": 624.3600215911865,
      "text": " and the magistrates rent off their clothes and commanded to beat them."
    },
    {
      "id": 5,
      "start": 624.3600215911865,
      "end": 629.0800228118896,
      "text": " When they had laid many stripes upon them, they cast them into prison, charging the jailer"
    },
    {
      "id": 6,
      "start": 629.0800228118896,
      "end": 631.2400226593018,
      "text": " to keep them safely."
    },
    {
      "id": 7,
      "start": 631.2400226593018,
      "end": 634.5600204467773,
      "text": " Who having received such a charge, thrust them into the inner prison, and made the feet"
    },
    {
      "id": 8,
      "start": 634.5600204467773,
      "end": 635.5600204467773,
      "text": " fast in the stocks…\""
    },
    {
      "id": 9,
      "start": 635.5600204467773,
      "end": 642.4400215148926,
      "text": " Notice verse 25, \"...and at midnight Paul and Silas prayed and sang praises unto God,"
    },
    {
      "id": 10,
      "start": 642.4400215148926,
      "end": 644.640022277832,
      "text": " and the prisoners heard them.\""
    },
    {
      "id": 11,
      "start": 644.640022277832,
      "end": 647.0400238037109,
      "text": " You know, they were still in the midst of their trial."
    },
    {
      "id": 12,
      "start": 647.0400238037109,
      "end": 652.4200210571289,
      "text": " They'd been beaten, they were still in prison, they weren't released yet."
    },
    {
      "id": 13,
      "start": 652.4200210571289,
      "end": 657.1600227355957,
      "text": " We know that they will be miraculously released as we read the text of Scripture, but even"
    },
    {
      "id": 14,
      "start": 657.1600227355957,
      "end": 661.8400230407715,
      "text": " as we'll mention tonight in the life of Joseph, we don't always know, or they didn't"
    },
    {
      "id": 15,
      "start": 661.8400230407715,
      "end": 666.8400192260742,
      "text": " always know, though we have the record of Scripture and we can read the next event,"
    },
    {
      "id": 16,
      "start": 666.8400192260742,
      "end": 668.8800201416016,
      "text": " we can read what happens."
    },
    {
      "id": 17,
      "start": 668.8800201416016,
      "end": 672.6000213623047,
      "text": " Paul and Silas, they just knew that they had been beaten and they were in prison, but they"
    },
    {
      "id": 18,
      "start": 672.6000213623047,
      "end": 675.4400253295898,
      "text": " chose to rejoice through the trial."
    },
    {
      "id": 19,
      "start": 675.4400253295898,
      "end": 680.0000228881836,
      "text": " And at midnight, the Bible says that they prayed and sang praises unto God."
    },
    {
      "id": 20,
      "start": 680.0000228881836,
      "end": 682.0800247192383,
      "text": " Can you imagine rejoicing through the trials?"
    },
    {
      "id": 21,
      "start": 682.0800247192383,
      "end": 686.3200225830078,
      "text": " I want you to notice with me very quickly, at the end of verse 25, it says, \"...and the"
    },
    {
      "id": 22,
      "start": 686.3200225830078,
      "end": 689.8400192260742,
      "text": " prisoners heard them, and the prisoners heard them.\""
    },
    {
      "id": 23,
      "start": 689.8400192260742,
      "end": 693.640022277832,
      "text": " I would submit to you this morning, it's actually a message that I hope to develop in the future"
    },
    {
      "id": 24,
      "start": 693.640022277832,
      "end": 697.0000228881836,
      "text": " in more detail and looking at some passages in the Old Testament as well, but I would"
    },
    {
      "id": 25,
      "start": 697.0000228881836,
      "end": 700.4000244140625,
      "text": " submit to you this morning just a thought that they were, those prisoners were going"
    },
    {
      "id": 26,
      "start": 700.4000244140625,
      "end": 705.0800247192383,
      "text": " to hear Paul and Silas regardless of what they said."
    },
    {
      "id": 27,
      "start": 705.0800247192383,
      "end": 709.7200241088867,
      "text": " They were going to hear them if they complained, and they were going to hear them if they rejoiced."
    },
    {
      "id": 28,
      "start": 709.7200241088867,
      "end": 710.7200241088867,
      "text": " You know what?"
    },
    {
      "id": 29,
      "start": 710.7200241088867,
      "end": 711.7200241088867,
      "text": " There's some people that hear us."
    },
    {
      "id": 30,
      "start": 712.3600234985352,
      "end": 713.3600234985352,
      "text": " I wonder what they hear."
    },
    {
      "id": 31,
      "start": 713.3600234985352,
      "end": 714.3600234985352,
      "text": " What do they hear from us?"
    },
    {
      "id": 32,
      "start": 714.3600234985352,
      "end": 719.4800186157227,
      "text": " When we're going through trials, when we're going through difficulties, what do they hear?"
    },
    {
      "id": 33,
      "start": 719.4800186157227,
      "end": 723.8000183105469,
      "text": " What do they learn about our God as we go through trials?"
    },
    {
      "id": 34,
      "start": 723.8000183105469,
      "end": 727.7600250244141,
      "text": " As we look at 1 Peter chapter number 1 and look at verse 3 through 9 this morning, get"
    },
    {
      "id": 35,
      "start": 727.7600250244141,
      "end": 733.3600158691406,
      "text": " to our text, I believe that as we consider three truths really from this portion of Scripture"
    },
    {
      "id": 36,
      "start": 733.3600158691406,
      "end": 739.0400238037109,
      "text": " that I believe this morning will enable us to rejoice through trials."
    },
    {
      "id": 37,
      "start": 739.0400238037109,
      "end": 741.4400177001953,
      "text": " Again, I know that I will face trials."
    },
    {
      "id": 38,
      "start": 741.4400177001953,
      "end": 743.5600280761719,
      "text": " I know that you will face trials."
    },
    {
      "id": 39,
      "start": 743.5600280761719,
      "end": 745.8800201416016,
      "text": " We understand that to be the case."
    },
    {
      "id": 40,
      "start": 745.8800201416016,
      "end": 750.4800262451172,
      "text": " And what is it that God teaches us in His Word that will enable us to rejoice in the"
    },
    {
      "id": 41,
      "start": 750.4800262451172,
      "end": 751.9400177001953,
      "text": " midst of trials?"
    },
    {
      "id": 42,
      "start": 751.9400177001953,
      "end": 754.1600189208984,
      "text": " The question is not, will I face a trial?"
    },
    {
      "id": 43,
      "start": 754.1600189208984,
      "end": 758.6400146484375,
      "text": " The question is, how will I behave through the trial?"
    },
    {
      "id": 44,
      "start": 758.6400146484375,
      "end": 762.9000244140625,
      "text": " Notice in verse number 3 of 1 Peter 1, the Bible says, blessed be the God and Father"
    },
    {
      "id": 45,
      "start": 762.9000244140625,
      "end": 767.8000183105469,
      "text": " of our Lord Jesus Christ, which according to His abundant mercy hath begotten us again"
    },
    {
      "id": 46,
      "start": 767.8000183105469,
      "end": 773.0000152587891,
      "text": " into a lively hope by the resurrection of Jesus Christ from the dead, to an inheritance"
    },
    {
      "id": 47,
      "start": 773.0000152587891,
      "end": 777.8400268554688,
      "text": " incorruptible and undefiled, and that fadeth not away, reserved in heaven for you, who"
    },
    {
      "id": 48,
      "start": 777.8400268554688,
      "end": 782.52001953125,
      "text": " are kept by the power of God through faith unto salvation, ready to be revealed in the"
    },
    {
      "id": 49,
      "start": 782.52001953125,
      "end": 783.8400268554688,
      "text": " last time."
    },
    {
      "id": 50,
      "start": 783.8400268554688,
      "end": 790.3600158691406,
      "text": " Notice in verse number 6, wherein ye greatly rejoice, though now for a season, if need"
    },
    {
      "id": 51,
      "start": 790.3600158691406,
      "end": 795.5400238037109,
      "text": " be, ye are in heaviness through manifold temptations, that the trial of your faith, being much more"
    },
    {
      "id": 52,
      "start": 795.5400238037109,
      "end": 799.6200256347656,
      "text": " precious than of gold that perisheth, though it be tried with fire, might be found unto"
    },
    {
      "id": 53,
      "start": 799.6200256347656,
      "end": 805.1400146484375,
      "text": " praise and honor and glory at the appearing of Jesus Christ, whom, having not seen, ye"
    },
    {
      "id": 54,
      "start": 805.1400146484375,
      "end": 811.2200164794922,
      "text": " love, and whom, though now ye see Him not yet believing, ye rejoice with joy unspeakable"
    },
    {
      "id": 55,
      "start": 811.2200164794922,
      "end": 817.6600189208984,
      "text": " and full of glory, receiving the end of your faith, even the salvation of your souls."
    },
    {
      "id": 56,
      "start": 817.6600189208984,
      "end": 821.8200225830078,
      "text": " As we look at this portion of Scripture this morning, I believe that God gives us three"
    },
    {
      "id": 57,
      "start": 821.8200225830078,
      "end": 827.9200286865234,
      "text": " truths that will enable us, enable you, enable me, to rejoice through trials."
    },
    {
      "id": 58,
      "start": 827.9200286865234,
      "end": 831.3400268554688,
      "text": " If you're taking notes with me this morning, I would say, number one, we can rejoice through"
    },
    {
      "id": 59,
      "start": 831.3400268554688,
      "end": 836.2400207519531,
      "text": " trials because of our position in Christ."
    },
    {
      "id": 60,
      "start": 836.2400207519531,
      "end": 839.4200286865234,
      "text": " What is it that will enable me to rejoice in the midst of trials?"
    },
    {
      "id": 61,
      "start": 839.4200286865234,
      "end": 843.1200256347656,
      "text": " It's when I remember my position in Christ."
    },
    {
      "id": 62,
      "start": 843.1200256347656,
      "end": 846.52001953125,
      "text": " Peter is writing to believers here in the book of 1 Peter."
    },
    {
      "id": 63,
      "start": 846.52001953125,
      "end": 851.8200225830078,
      "text": " Notice in verse 1, the Bible says, Peter, an apostle of Jesus Christ to the strangers"
    },
    {
      "id": 64,
      "start": 851.8200225830078,
      "end": 857.4400329589844,
      "text": " scattered throughout Pontus, Galatia, Cappadocia, Asia, and Bithynia, elect according to the"
    },
    {
      "id": 65,
      "start": 857.4400329589844,
      "end": 862.5400085449219,
      "text": " foreknowledge of God the Father through sanctification of the Spirit unto obedience and sprinkling"
    },
    {
      "id": 66,
      "start": 862.5400085449219,
      "end": 866.7400207519531,
      "text": " of the blood of Jesus Christ, grace unto you, and peace be multiplied."
    },
    {
      "id": 67,
      "start": 866.7400207519531,
      "end": 871.4600219726562,
      "text": " He then tells them and speaks to them in verses 3 and 4 and verse number 5 as well about their"
    },
    {
      "id": 68,
      "start": 871.4600219726562,
      "end": 873.0600280761719,
      "text": " position in Christ."
    },
    {
      "id": 69,
      "start": 873.0600280761719,
      "end": 878.6400146484375,
      "text": " I want you to understand that these believers that Peter is writing to here in 1 Peter,"
    },
    {
      "id": 70,
      "start": 878.6400146484375,
      "end": 882.3200073242188,
      "text": " these are believers that are facing great difficulty."
    },
    {
      "id": 71,
      "start": 882.3200073242188,
      "end": 887.9200134277344,
      "text": " These are believers that are living during the time of the Emperor Nero's rule and reign"
    },
    {
      "id": 72,
      "start": 887.9200134277344,
      "end": 892.0000305175781,
      "text": " and what a wicked and ungodly man he was and so cruel."
    },
    {
      "id": 73,
      "start": 892.0000305175781,
      "end": 897.8000183105469,
      "text": " And we find that they're living at that particular time and they're facing great difficulties."
    },
    {
      "id": 74,
      "start": 897.8000183105469,
      "end": 900.7200317382812,
      "text": " The Bible says to the strangers scattered throughout."
    },
    {
      "id": 75,
      "start": 900.7200317382812,
      "end": 901.7200317382812,
      "text": " Why were they scattered?"
    },
    {
      "id": 76,
      "start": 901.8600158691406,
      "end": 906.4200134277344,
      "text": " Well, because of the persecution that was intensifying under the rule and reign of the"
    },
    {
      "id": 77,
      "start": 906.4200134277344,
      "end": 908.0800170898438,
      "text": " Emperor Nero."
    },
    {
      "id": 78,
      "start": 908.0800170898438,
      "end": 914.1400146484375,
      "text": " And we find that as these believers are being written to that God in His grace and His mercy"
    },
    {
      "id": 79,
      "start": 914.1400146484375,
      "end": 919.7400207519531,
      "text": " is going to help them understand truth that will enable them even in the midst of this"
    },
    {
      "id": 80,
      "start": 919.7400207519531,
      "end": 925.1000366210938,
      "text": " great difficulty, even in the midst of this trial, that they can not only rejoice but"
    },
    {
      "id": 81,
      "start": 925.1000366210938,
      "end": 929.8200073242188,
      "text": " according to verse number 6, greatly rejoice."
    },
    {
      "id": 82,
      "start": 929.8200073242188,
      "end": 935.1800231933594,
      "text": " Not only greatly rejoice, but we find that in verse number 8 that ye rejoice with joy"
    },
    {
      "id": 83,
      "start": 935.1800231933594,
      "end": 939.6200256347656,
      "text": " unspeakable and full of glory."
    },
    {
      "id": 84,
      "start": 939.6200256347656,
      "end": 944.9400329589844,
      "text": " Now there is a truth that is given to us in these first few verses of chapter number 1"
    },
    {
      "id": 85,
      "start": 944.9400329589844,
      "end": 949.7400207519531,
      "text": " that enables us to understand our position in Christ."
    },
    {
      "id": 86,
      "start": 949.7400207519531,
      "end": 952.3800354003906,
      "text": " I'm so thankful to be washed in the blood."
    },
    {
      "id": 87,
      "start": 952.3800354003906,
      "end": 957.0000305175781,
      "text": " We sang that song this morning, are you washed in the blood, and how appropriate as we think"
    },
    {
      "id": 88,
      "start": 957.0000305175781,
      "end": 961.1200256347656,
      "text": " about that song, and often I will say as we're singing the chorus of that song, when"
    },
    {
      "id": 89,
      "start": 961.1200256347656,
      "end": 965.2400207519531,
      "text": " it says are you washed in the blood, I'll say yes I am."
    },
    {
      "id": 90,
      "start": 965.2400207519531,
      "end": 968.9600219726562,
      "text": " Dean hollers out something else when he's leading it, I don't even know half the time"
    },
    {
      "id": 91,
      "start": 968.9600219726562,
      "end": 972.6000366210938,
      "text": " what he's saying, but I'm sitting here saying yes I am, amen?"
    },
    {
      "id": 92,
      "start": 972.6000366210938,
      "end": 979.7200317382812,
      "text": " I am washed in the blood, and I'm so thankful that my position in Christ is settled."
    },
    {
      "id": 93,
      "start": 979.7200317382812,
      "end": 983.52001953125,
      "text": " If you're a believer this morning, if you've trusted the Lord Jesus Christ as your personal"
    },
    {
      "id": 94,
      "start": 983.52001953125,
      "end": 988.0000305175781,
      "text": " Savior, you understood that you were a sinner, and that Christ is the only Savior, and that"
    },
    {
      "id": 95,
      "start": 988.0000305175781,
      "end": 993.0400085449219,
      "text": " He offers you a gift, and that gift is eternal life through Jesus Christ our Lord, then you"
    },
    {
      "id": 96,
      "start": 993.0400085449219,
      "end": 998.4400329589844,
      "text": " have been born again, you have been born of the Spirit, and your position in Christ is"
    },
    {
      "id": 97,
      "start": 998.4400329589844,
      "end": 1001.760009765625,
      "text": " settled, and we can rejoice in that."
    },
    {
      "id": 98,
      "start": 1001.760009765625,
      "end": 1006.1600341796875,
      "text": " Listen, nobody can take your salvation."
    },
    {
      "id": 99,
      "start": 1006.1600341796875,
      "end": 1007.9200134277344,
      "text": " I'm thankful for that."
    },
    {
      "id": 100,
      "start": 1007.9200134277344,
      "end": 1011.8800354003906,
      "text": " The Bible says in John chapter number 10, my sheep hear my voice and I know them and"
    },
    {
      "id": 101,
      "start": 1011.8800354003906,
      "end": 1017.760009765625,
      "text": " I give unto them eternal life, and they shall never perish, neither shall any man pluck"
    },
    {
      "id": 102,
      "start": 1017.760009765625,
      "end": 1021.260009765625,
      "text": " them from my hand, and we see the security of the believer."
    },
    {
      "id": 103,
      "start": 1021.260009765625,
      "end": 1027.0800170898438,
      "text": " We see it here in 1 Peter 1 as well, but we understand this morning that there is no trial"
    },
    {
      "id": 104,
      "start": 1027.0800170898438,
      "end": 1033.8000183105469,
      "text": " that you can go through, there is no trial that I can go through that will alter my position"
    },
    {
      "id": 105,
      "start": 1033.8000183105469,
      "end": 1036.5600280761719,
      "text": " in Christ."
    },
    {
      "id": 106,
      "start": 1036.5600280761719,
      "end": 1038.760009765625,
      "text": " That should cause us to rejoice."
    },
    {
      "id": 107,
      "start": 1038.760009765625,
      "end": 1041.1200256347656,
      "text": " You say, but pastor, let me tell you about this trial."
    },
    {
      "id": 108,
      "start": 1041.1200256347656,
      "end": 1044.5600280761719,
      "text": " I'm just trying to remind you of your position in Christ."
    },
    {
      "id": 109,
      "start": 1044.5600280761719,
      "end": 1048.9200134277344,
      "text": " I'm trying to help you understand that yes, the trials will vary, and some are going to"
    },
    {
      "id": 110,
      "start": 1048.9200134277344,
      "end": 1053.4000244140625,
      "text": " be harder than others, and more intense, and maybe longer, and whatever it might be, but"
    },
    {
      "id": 111,
      "start": 1053.4000244140625,
      "end": 1061.8400268554688,
      "text": " the reality is that nothing, no trial here on earth can alter your position in Christ."
    },
    {
      "id": 112,
      "start": 1061.8400268554688,
      "end": 1066.280029296875,
      "text": " So when I'm going through that trial, I remind myself I'm a child of the King."
    },
    {
      "id": 113,
      "start": 1066.280029296875,
      "end": 1067.9200134277344,
      "text": " I belong to the Lord Jesus Christ."
    },
    {
      "id": 114,
      "start": 1068.0800170898438,
      "end": 1070.8000183105469,
      "text": " My standing is settled, it's sure."
    },
    {
      "id": 115,
      "start": 1070.8000183105469,
      "end": 1073.760009765625,
      "text": " I'm heaven-bound."
    },
    {
      "id": 116,
      "start": 1073.760009765625,
      "end": 1075.760009765625,
      "text": " All these other things are just temporary."
    },
    {
      "id": 117,
      "start": 1075.760009765625,
      "end": 1077.4400329589844,
      "text": " In fact, look at it with me in verse number three."
    },
    {
      "id": 118,
      "start": 1077.4400329589844,
      "end": 1081.9200134277344,
      "text": " It says, blessed be the God and Father of our Lord Jesus Christ, notice it says, which"
    },
    {
      "id": 119,
      "start": 1081.9200134277344,
      "end": 1088.52001953125,
      "text": " according to His abundant mercy, aren't you thankful that our God is merciful?"
    },
    {
      "id": 120,
      "start": 1088.52001953125,
      "end": 1090.9200134277344,
      "text": " His mercy is everlasting."
    },
    {
      "id": 121,
      "start": 1090.9200134277344,
      "end": 1092.260009765625,
      "text": " His mercy is abundant."
    },
    {
      "id": 122,
      "start": 1092.260009765625,
      "end": 1094.0400085449219,
      "text": " He is rich in mercy."
    },
    {
      "id": 123,
      "start": 1094.0400085449219,
      "end": 1099.8400268554688,
      "text": " It says that He hath begotten us again unto a lively hope by the resurrection of Jesus"
    },
    {
      "id": 124,
      "start": 1099.8400268554688,
      "end": 1101.0400085449219,
      "text": " Christ from the dead."
    },
    {
      "id": 125,
      "start": 1101.0400085449219,
      "end": 1106.5600280761719,
      "text": " Listen, if Christ be not risen, then our faith is vain, and our preaching is vain, but now"
    },
    {
      "id": 126,
      "start": 1106.5600280761719,
      "end": 1108.7200317382812,
      "text": " is Christ risen from the dead."
    },
    {
      "id": 127,
      "start": 1108.7200317382812,
      "end": 1112.4800415039062,
      "text": " He is the firstfruits of them which slept, and the Bible tells us, and we understand"
    },
    {
      "id": 128,
      "start": 1112.4800415039062,
      "end": 1119.1600341796875,
      "text": " this morning, that I serve a risen Savior, and He lives, and how precious that is."
    },
    {
      "id": 129,
      "start": 1119.1600341796875,
      "end": 1123.2000122070312,
      "text": " We understand this morning because He lives because of the resurrection and my understanding"
    },
    {
      "id": 130,
      "start": 1123.2000122070312,
      "end": 1125.6400146484375,
      "text": " of my position in Christ."
    },
    {
      "id": 131,
      "start": 1125.6400146484375,
      "end": 1132.6799926757812,
      "text": " He goes on to explain it in verse number four, notice, to an inheritance incorruptible and"
    },
    {
      "id": 132,
      "start": 1132.6799926757812,
      "end": 1143.1600341796875,
      "text": " undefiled, notice this, and fadeth not away, reserved in heaven for you."
    },
    {
      "id": 133,
      "start": 1143.1600341796875,
      "end": 1145.3600463867188,
      "text": " Every word of God is pure."
    },
    {
      "id": 134,
      "start": 1145.3600463867188,
      "end": 1148.4400024414062,
      "text": " I love the way that He explains that in verse number four."
    },
    {
      "id": 135,
      "start": 1148.4400024414062,
      "end": 1152.0,
      "text": " He could have just said that you have an inheritance."
    },
    {
      "id": 136,
      "start": 1152.0,
      "end": 1156.8400268554688,
      "text": " And by the way, that would have been sufficient because of the sufficiency of Scripture."
    },
    {
      "id": 137,
      "start": 1156.8400268554688,
      "end": 1163.4800415039062,
      "text": " But we find that He wanted us to really understand this inheritance that we have, that it's incorruptible,"
    },
    {
      "id": 138,
      "start": 1163.4800415039062,
      "end": 1169.4400024414062,
      "text": " that it's undefiled, that it fadeth not away, that it's reserved in heaven for us."
    },
    {
      "id": 139,
      "start": 1169.4400024414062,
      "end": 1176.0400390625,
      "text": " I want you to notice that phrase in verse number four where it says, fadeth not away."
    },
    {
      "id": 140,
      "start": 1176.0400390625,
      "end": 1180.8400268554688,
      "text": " I want you to understand this morning that the gift of God is eternal life."
    },
    {
      "id": 141,
      "start": 1180.8400268554688,
      "end": 1185.52001953125,
      "text": " Listen, I'm going to spend forever with my Savior."
    },
    {
      "id": 142,
      "start": 1185.52001953125,
      "end": 1190.5599975585938,
      "text": " My position in Christ settles that because I've been born again, because I heard the"
    },
    {
      "id": 143,
      "start": 1190.5599975585938,
      "end": 1193.9600219726562,
      "text": " gospel and I recognized I was a sinner and He's the only Savior."
    },
    {
      "id": 144,
      "start": 1193.9600219726562,
      "end": 1194.9600219726562,
      "text": " I was guilty."
    },
    {
      "id": 145,
      "start": 1194.9600219726562,
      "end": 1197.3600463867188,
      "text": " Listen, it wasn't that I was just, oh, I wasn't that bad."
    },
    {
      "id": 146,
      "start": 1197.3600463867188,
      "end": 1198.9600219726562,
      "text": " No, I was guilty."
    },
    {
      "id": 147,
      "start": 1198.9600219726562,
      "end": 1200.0,
      "text": " And by the way, if you don't recognize…"
    },
    {
      "id": 0,
      "start": 1200.0,
      "end": 1204.2800002098083,
      "text": " recognize that you're guilty, you're never going to recognize that you need a Savior."
    },
    {
      "id": 1,
      "start": 1204.2800002098083,
      "end": 1213.2799997329712,
      "text": " And I knew I was guilty. I was condemned. But He loved me. And He died for me. And He"
    },
    {
      "id": 2,
      "start": 1213.2799997329712,
      "end": 1219.0,
      "text": " saved me. And I'm going to heaven. And I have this inheritance. If you're saved this morning,"
    },
    {
      "id": 3,
      "start": 1219.0,
      "end": 1224.3999996185303,
      "text": " you have this. And it says, fadeth not away. Now, I want you to keep that in mind and look"
    },
    {
      "id": 4,
      "start": 1224.3999996185303,
      "end": 1227.9599990844727,
      "text": " at verse number six, and we'll get further into verse number six as we get through the"
    },
    {
      "id": 5,
      "start": 1227.9599990844727,
      "end": 1231.2399997711182,
      "text": " message this morning. But I want to point this out to you with regard to our position"
    },
    {
      "id": 6,
      "start": 1231.2399997711182,
      "end": 1236.3600006103516,
      "text": " in Christ. It says this, the position, the fact that we have an inheritance that fadeth"
    },
    {
      "id": 7,
      "start": 1236.3600006103516,
      "end": 1242.560001373291,
      "text": " not away in verse number four, but then look at verse six. It says wherein ye greatly rejoice."
    },
    {
      "id": 8,
      "start": 1242.560001373291,
      "end": 1249.6800003051758,
      "text": " Then notice this, though now for a season. Listen, I'm thankful that a season doesn't"
    },
    {
      "id": 9,
      "start": 1249.6800003051758,
      "end": 1258.9199981689453,
      "text": " define us. A season's not forever. You say, how long's a season? I don't know. I have"
    },
    {
      "id": 10,
      "start": 1258.9199981689453,
      "end": 1267.2399978637695,
      "text": " no idea. It's as long as God wants it to be. In fact, in 1 Peter chapter number 5 and verse"
    },
    {
      "id": 11,
      "start": 1267.2399978637695,
      "end": 1271.0400009155273,
      "text": " number 10, it says, but the God of all grace, who hath caught us into His eternal glory"
    },
    {
      "id": 12,
      "start": 1271.0400009155273,
      "end": 1278.2399978637695,
      "text": " by Christ Jesus, after that ye have suffered a while, make ye perfect, establish, strengthen,"
    },
    {
      "id": 13,
      "start": 1278.2399978637695,
      "end": 1281.5599975585938,
      "text": " and excel you. To Him be glory and dominion forever and ever. Amen. I don't know how long"
    },
    {
      "id": 14,
      "start": 1281.5599975585938,
      "end": 1290.6800003051758,
      "text": " a while is either, but I know that a season pales in comparison to fadeth not away. Amen?"
    },
    {
      "id": 15,
      "start": 1290.6800003051758,
      "end": 1296.4800033569336,
      "text": " See, we've got to keep that eternal perspective. Sometimes in the midst of the trial, we have"
    },
    {
      "id": 16,
      "start": 1296.4800033569336,
      "end": 1301.6399993896484,
      "text": " that temporal perspective, and we're so focused on the season that we're not focused on the"
    },
    {
      "id": 17,
      "start": 1301.6399993896484,
      "end": 1308.2799987792969,
      "text": " eternal, on the fadeth not away. And here, these believers that are facing this great"
    },
    {
      "id": 18,
      "start": 1308.2799987792969,
      "end": 1312.8399963378906,
      "text": " persecution and all this difficulty, these trials that they're going through, Peter says"
    },
    {
      "id": 19,
      "start": 1312.8399963378906,
      "end": 1317.2799987792969,
      "text": " to them, listen, if you're going to rejoice and if you're going to greatly rejoice through"
    },
    {
      "id": 20,
      "start": 1317.2799987792969,
      "end": 1322.4400024414062,
      "text": " these trials, I believe that one of the truths that he shares here that will enable these"
    },
    {
      "id": 21,
      "start": 1322.4400024414062,
      "end": 1326.6800003051758,
      "text": " believers, that will enable you and I this morning to rejoice through trials, is that"
    },
    {
      "id": 22,
      "start": 1326.7200012207031,
      "end": 1334.3999938964844,
      "text": " we must remember our position in Christ. I'm a child of the King. Remember what Jesus said"
    },
    {
      "id": 23,
      "start": 1334.3999938964844,
      "end": 1340.3200073242188,
      "text": " in Luke chapter number 10? These fellows come back and they're rejoicing because the spirits"
    },
    {
      "id": 24,
      "start": 1340.3200073242188,
      "end": 1346.240005493164,
      "text": " are in subject to them, and they're coming back and they're rejoicing over these things."
    },
    {
      "id": 25,
      "start": 1346.240005493164,
      "end": 1350.3200073242188,
      "text": " And we find that in Luke chapter number 10 and verse 17, the Bible says that the 70 returned,"
    },
    {
      "id": 26,
      "start": 1350.3200073242188,
      "end": 1353.9199981689453,
      "text": " they returned with joy. And they're talking about what happened and what transpired and"
    },
    {
      "id": 27,
      "start": 1353.9199981689453,
      "end": 1358.8800048828125,
      "text": " what they experienced, but Jesus says to them in Luke 10 and verse number 20, notwithstanding"
    },
    {
      "id": 28,
      "start": 1358.8800048828125,
      "end": 1366.6600036621094,
      "text": " in this and what they had experienced, he says, in this rejoice not that the spirits"
    },
    {
      "id": 29,
      "start": 1366.6600036621094,
      "end": 1375.6399993896484,
      "text": " are subject unto you, but rather rejoice because your names are written in heaven. We sing"
    },
    {
      "id": 30,
      "start": 1375.6399993896484,
      "end": 1382.1799926757812,
      "text": " that song, there's a new name written down in glory. And it's mine. Oh yes, it's mine."
    },
    {
      "id": 31,
      "start": 1382.1799926757812,
      "end": 1385.8600006103516,
      "text": " And we sing that song and it reminds us of the day that we trusted the Lord Jesus Christ"
    },
    {
      "id": 32,
      "start": 1385.8600006103516,
      "end": 1390.979995727539,
      "text": " as our personal Savior. And Jesus says to these 70 that returned, they came back with"
    },
    {
      "id": 33,
      "start": 1390.979995727539,
      "end": 1396.1799926757812,
      "text": " joy. And Jesus says, listen, don't rejoice because the spirits are made subject to you."
    },
    {
      "id": 34,
      "start": 1396.1799926757812,
      "end": 1402.4199981689453,
      "text": " Rather rejoice because your names are written in heaven. I'm so thankful that on, for me,"
    },
    {
      "id": 35,
      "start": 1402.4199981689453,
      "end": 1408.3000030517578,
      "text": " August 31st, 1997, my name was written down in that book. I was born again. I was saved"
    },
    {
      "id": 36,
      "start": 1408.3000030517578,
      "end": 1416.979995727539,
      "text": " by the grace of God. And my position in Christ allows me to rejoice through the trials."
    },
    {
      "id": 37,
      "start": 1416.979995727539,
      "end": 1423.0,
      "text": " Number two, we can rejoice through trials because of God's great power. I'm thankful"
    },
    {
      "id": 38,
      "start": 1423.0,
      "end": 1427.8600006103516,
      "text": " for my position in Christ and I'm thankful that I serve the omnipotent God. I think about"
    },
    {
      "id": 39,
      "start": 1427.8600006103516,
      "end": 1431.8399963378906,
      "text": " the power of God here in verse number five, continuing really with the thought of our"
    },
    {
      "id": 40,
      "start": 1431.8399963378906,
      "end": 1436.5800018310547,
      "text": " position in Christ and the inheritance that we have. He says, who are kept by the power"
    },
    {
      "id": 41,
      "start": 1436.5800018310547,
      "end": 1443.1199951171875,
      "text": " of God through faith unto salvation, ready to be revealed in the last time. This morning"
    },
    {
      "id": 42,
      "start": 1443.1199951171875,
      "end": 1448.2799987792969,
      "text": " I am so thankful that our God is the omnipotent God. I am thankful that I am kept by the power"
    },
    {
      "id": 43,
      "start": 1448.2799987792969,
      "end": 1452.4400024414062,
      "text": " of God. I'm thankful that there's nothing that's too hard for my God. I'm thankful this"
    },
    {
      "id": 44,
      "start": 1452.4400024414062,
      "end": 1457.2799987792969,
      "text": " morning that in the midst of a trial, in the midst of a difficulty, that God did not lose"
    },
    {
      "id": 45,
      "start": 1457.2799987792969,
      "end": 1463.0799865722656,
      "text": " any power. That God is not, it's not that a matter of His ability or inability. No,"
    },
    {
      "id": 46,
      "start": 1463.0799865722656,
      "end": 1468.7999877929688,
      "text": " we find that God is able. And we find that in the midst of that trial, when we focus"
    },
    {
      "id": 47,
      "start": 1468.7999877929688,
      "end": 1476.3999938964844,
      "text": " and understand that my God has all power and my God is able, that enables me to rejoice."
    },
    {
      "id": 48,
      "start": 1476.3999938964844,
      "end": 1482.760009765625,
      "text": " I think about Abraham and there in Genesis, when he's being spoken to by the Lord. And"
    },
    {
      "id": 49,
      "start": 1482.760009765625,
      "end": 1490.2000122070312,
      "text": " Abraham is told by God that his name, one of his names is El Shaddai, the Lord God Almighty."
    },
    {
      "id": 50,
      "start": 1490.2000122070312,
      "end": 1496.5599975585938,
      "text": " I love that name of the Lord that he shares with Abraham there. And we find that he says,"
    },
    {
      "id": 51,
      "start": 1496.5599975585938,
      "end": 1501.2000122070312,
      "text": " my name, it's El Shaddai, I'm the Lord God Almighty. And then right after he reveals"
    },
    {
      "id": 52,
      "start": 1501.2000122070312,
      "end": 1505.5199890136719,
      "text": " that to him, he asks him, is there anything too hard for me? We find that Jeremiah is"
    },
    {
      "id": 53,
      "start": 1505.5199890136719,
      "end": 1512.4400024414062,
      "text": " asked a similar question as Jeremiah is prophesying on the eve of captivity. In fact, he's prophesying"
    },
    {
      "id": 54,
      "start": 1512.4400024414062,
      "end": 1516.8399963378906,
      "text": " and the Babylonians have already laid siege against the city. And he can see, he knows,"
    },
    {
      "id": 55,
      "start": 1516.8399963378906,
      "end": 1522.3200073242188,
      "text": " he's the one that's been prophesying that they're going to take us captive. And then"
    },
    {
      "id": 56,
      "start": 1522.3200073242188,
      "end": 1529.8399963378906,
      "text": " God comes to Jeremiah and says that he's supposed to buy a piece of property, buy the field,"
    },
    {
      "id": 57,
      "start": 1529.8399963378906,
      "end": 1537.5199890136719,
      "text": " buy the field. But they're going to come and take, buy the field. And God explains to him"
    },
    {
      "id": 58,
      "start": 1537.5199890136719,
      "end": 1541.3200073242188,
      "text": " about the remnant that's going to return, the 70 year captivity and all that's going"
    },
    {
      "id": 59,
      "start": 1541.3200073242188,
      "end": 1545.5599975585938,
      "text": " to transpire and that they would dwell in that land again. And you know what? You know"
    },
    {
      "id": 60,
      "start": 1545.5599975585938,
      "end": 1552.239990234375,
      "text": " what he understood? He understood that there's nothing too hard for God. God is all powerful."
    },
    {
      "id": 61,
      "start": 1552.239990234375,
      "end": 1555.5599975585938,
      "text": " Listen as we look at the examples that we looked at this morning in the book of Habakkuk"
    },
    {
      "id": 62,
      "start": 1555.5599975585938,
      "end": 1560.9200134277344,
      "text": " and two examples in the book of Acts, they served, Habakkuk, the disciples and Paul and"
    },
    {
      "id": 63,
      "start": 1560.9200134277344,
      "end": 1567.760009765625,
      "text": " Silas, they served the same God that we serve, the Lord God Omnipotent. He rules and he reigns."
    },
    {
      "id": 64,
      "start": 1567.760009765625,
      "end": 1572.3599853515625,
      "text": " And this morning I am so thankful that his power is never lacking, that it's never a"
    },
    {
      "id": 65,
      "start": 1572.3599853515625,
      "end": 1576.7999877929688,
      "text": " situation when you're going through a trial, when I'm going through a trial, it's understood"
    },
    {
      "id": 66,
      "start": 1576.7999877929688,
      "end": 1582.2000122070312,
      "text": " that it's allowed by God. And God can change that thing at any time because he has all"
    },
    {
      "id": 67,
      "start": 1582.2000122070312,
      "end": 1588.6000061035156,
      "text": " power. I'm thankful to know the Omnipotent God, aren't you? I'm thankful to know the"
    },
    {
      "id": 68,
      "start": 1588.6000061035156,
      "end": 1594.239990234375,
      "text": " God that said let there be light and there was light. I'm thankful that though today"
    },
    {
      "id": 69,
      "start": 1594.239990234375,
      "end": 1599.7999877929688,
      "text": " they're still trying to determine with some level of accuracy the total number of stars"
    },
    {
      "id": 70,
      "start": 1599.7999877929688,
      "end": 1604.1600036621094,
      "text": " and all of the things of our galaxies and what have you, and the scriptures simply say"
    },
    {
      "id": 71,
      "start": 1604.1600036621094,
      "end": 1611.2799987792969,
      "text": " and he made the stars also. This is a little thing for God because he has all power. And"
    },
    {
      "id": 72,
      "start": 1611.2799987792969,
      "end": 1615.760009765625,
      "text": " that's your God and that's my God. When I'm in the midst of the trial, when I'm in the"
    },
    {
      "id": 73,
      "start": 1615.760009765625,
      "end": 1621.7999877929688,
      "text": " midst of the difficulty and I remind myself of my position in Christ, that I'm saved by"
    },
    {
      "id": 74,
      "start": 1621.7999877929688,
      "end": 1627.9200134277344,
      "text": " the blood of the Lamb, that I'm going to heaven one day, that nothing can alter my position"
    },
    {
      "id": 75,
      "start": 1627.9200134277344,
      "end": 1632.2000122070312,
      "text": " in Christ, it causes me to rejoice. When I recognize and I'm reminded of the great"
    },
    {
      "id": 76,
      "start": 1632.2000122070312,
      "end": 1637.6799926757812,
      "text": " power of my God, that he is the Lord God Omnipotent, that he's able to do exceeding abundantly"
    },
    {
      "id": 77,
      "start": 1637.6799926757812,
      "end": 1645.5599975585938,
      "text": " above all that we ask or think, that's my God. And when I remind myself of that, I can"
    },
    {
      "id": 78,
      "start": 1645.5599975585938,
      "end": 1656.0799865722656,
      "text": " rejoice in the midst of the trial. Number three, we can rejoice through trials because"
    },
    {
      "id": 79,
      "start": 1656.0799865722656,
      "end": 1662.3599853515625,
      "text": " of God's purpose. Because of God's purpose. We see that we rejoice through trials because"
    },
    {
      "id": 80,
      "start": 1662.3599853515625,
      "end": 1667.6000061035156,
      "text": " of my position in Christ. We rejoice through trials because of God's great power. But you"
    },
    {
      "id": 81,
      "start": 1667.6000061035156,
      "end": 1672.6000061035156,
      "text": " and I this morning, we can rejoice through trials because of God's purpose. Let me remind"
    },
    {
      "id": 82,
      "start": 1672.6000061035156,
      "end": 1680.7999877929688,
      "text": " you this morning that God always has purpose. He moves with purpose. And we find that God"
    },
    {
      "id": 83,
      "start": 1680.7999877929688,
      "end": 1685.760009765625,
      "text": " is a God of purpose and everything that happens in your life and everything that happens in"
    },
    {
      "id": 84,
      "start": 1685.760009765625,
      "end": 1691.760009765625,
      "text": " my life is for a purpose. Notice in verse number six of our text of Scripture, in 1"
    },
    {
      "id": 85,
      "start": 1691.760009765625,
      "end": 1698.6400146484375,
      "text": " Peter 1 and verse number six, the Bible says this, wherein ye greatly rejoice, though now"
    },
    {
      "id": 86,
      "start": 1698.6400146484375,
      "end": 1703.3999938964844,
      "text": " for a season. Listen, your home is in heaven, you have this inheritance and your position"
    },
    {
      "id": 87,
      "start": 1703.3999938964844,
      "end": 1710.8800048828125,
      "text": " in Christ is settled, but before you get there, you might have this trial for a season. And"
    },
    {
      "id": 88,
      "start": 1710.8800048828125,
      "end": 1722.719970703125,
      "text": " then notice these words, if need be. If need be. Ye are in heaviness through manifold temptations."
    },
    {
      "id": 89,
      "start": 1722.719970703125,
      "end": 1729.760009765625,
      "text": " As we see this phrase, if need be, in verse number six, it reminds me of God's purpose."
    },
    {
      "id": 90,
      "start": 1729.760009765625,
      "end": 1734.47998046875,
      "text": " It reminds me this morning, and it's important for each of us to understand. Listen, I believe"
    },
    {
      "id": 91,
      "start": 1734.47998046875,
      "end": 1739.9199829101562,
      "text": " it's imperative that we each understand this morning that God always has a purpose. If"
    },
    {
      "id": 92,
      "start": 1739.9600219726562,
      "end": 1746.719970703125,
      "text": " need be. Who determines that? Not you and not me. God. If it were up to me, I'd never"
    },
    {
      "id": 93,
      "start": 1746.719970703125,
      "end": 1753.1599731445312,
      "text": " need be. Amen? And if it were up to you, you probably would never need be either because"
    },
    {
      "id": 94,
      "start": 1753.1599731445312,
      "end": 1761.47998046875,
      "text": " we just don't really like trials. But God has a purpose. God has a purpose. And there"
    },
    {
      "id": 95,
      "start": 1761.47998046875,
      "end": 1768.719970703125,
      "text": " are times in your life and there are times in my life that God allows a trial and we're"
    },
    {
      "id": 96,
      "start": 1768.719970703125,
      "end": 1773.760009765625,
      "text": " reminded of our position in Christ, we're reminded of God's power. Those are going to"
    },
    {
      "id": 97,
      "start": 1773.760009765625,
      "end": 1777.9600219726562,
      "text": " enable us to rejoice, but when we're reminded that God has a purpose in this. This didn't"
    },
    {
      "id": 98,
      "start": 1777.9600219726562,
      "end": 1784.4000244140625,
      "text": " happen by accident. This was not some situation that caught God off guard. It was not a situation..."
    },
    {
      "id": 99,
      "start": 1784.4000244140625,
      "end": 1788.0399780273438,
      "text": " Listen, has anything ever caught you off guard? You're working, you're doing something, you"
    },
    {
      "id": 100,
      "start": 1788.0399780273438,
      "end": 1793.9600219726562,
      "text": " say, man, I didn't see that coming. I didn't expect that. It doesn't matter how well you"
    },
    {
      "id": 101,
      "start": 1793.9600219726562,
      "end": 1799.1599731445312,
      "text": " are at what you do. It doesn't matter how skillful you are. It doesn't matter how much"
    },
    {
      "id": 102,
      "start": 1799.1599731445312,
      "end": 1800.0399780273438,
      "text": " you've planned and..."
    },
    {
      "id": 0,
      "start": 1800.0399780273438,
      "end": 1804.3999781608582,
      "text": " prepared and so on and so forth, there are things that might happen that you say, man,"
    },
    {
      "id": 1,
      "start": 1804.3999781608582,
      "end": 1809.479977607727,
      "text": " I didn't plan for that. I didn't think that was going to happen. That never happens to"
    },
    {
      "id": 2,
      "start": 1809.479977607727,
      "end": 1819.4799785614014,
      "text": " God. God knows everything. And God does all things well. Our God is perfect."
    },
    {
      "id": 3,
      "start": 1819.4799785614014,
      "end": 1824.5999774932861,
      "text": " In this morning when we are reminded that we can rejoice through trials because God"
    },
    {
      "id": 4,
      "start": 1824.5999774932861,
      "end": 1833.9999771118164,
      "text": " has a purpose, we find that it says, if need be, ye are in heaviness through manifold temptations."
    },
    {
      "id": 5,
      "start": 1833.9999771118164,
      "end": 1840.5599784851074,
      "text": " Notice that the trial of your faith, being much more precious than of gold that perisheth,"
    },
    {
      "id": 6,
      "start": 1840.5599784851074,
      "end": 1848.8399772644043,
      "text": " though it be tried with fire, might be found unto praise and honor and glory at the appearing"
    },
    {
      "id": 7,
      "start": 1848.8399772644043,
      "end": 1854.7199783325195,
      "text": " of Jesus Christ, whom having not seen, ye love, and whom though now ye see him not,"
    },
    {
      "id": 8,
      "start": 1854.7199783325195,
      "end": 1859.7199783325195,
      "text": " yet believing, ye rejoice with joy unspeakable and full of glory, receiving the end of your"
    },
    {
      "id": 9,
      "start": 1859.7199783325195,
      "end": 1864.47998046875,
      "text": " faith, even the salvation of your souls. I'll read also in 1 Peter 5, I read these verses"
    },
    {
      "id": 10,
      "start": 1864.47998046875,
      "end": 1871.079978942871,
      "text": " a moment ago, but notice in verse 10 and 11 of 1 Peter 5, it says, but the God of all"
    },
    {
      "id": 11,
      "start": 1871.079978942871,
      "end": 1876.7599792480469,
      "text": " grace who hath called us unto his eternal glory by Christ Jesus, after that ye have"
    },
    {
      "id": 12,
      "start": 1876.7599792480469,
      "end": 1884.1599807739258,
      "text": " suffered a while, make you perfect, establish, strengthen, settle you. To him be glory and"
    },
    {
      "id": 13,
      "start": 1884.1599807739258,
      "end": 1892.1599807739258,
      "text": " dominion forever and ever. Amen. From these two portions of Scripture in 1 Peter 1, verses"
    },
    {
      "id": 14,
      "start": 1892.1599807739258,
      "end": 1897.47998046875,
      "text": " 6 through 9, and in 1 Peter 5, verses 10 and 11, we really have the opportunity through"
    },
    {
      "id": 15,
      "start": 1897.47998046875,
      "end": 1904.959976196289,
      "text": " these two portions of Scripture in 1 Peter to understand two purposes that God has. First"
    },
    {
      "id": 16,
      "start": 1904.959976196289,
      "end": 1911.1199798583984,
      "text": " and foremost, I believe that God's purpose is to bring honor and glory to himself. That's"
    },
    {
      "id": 17,
      "start": 1911.1199798583984,
      "end": 1919.7599792480469,
      "text": " the primary purpose, is for God to be honored and glorified. And we find that at times God"
    },
    {
      "id": 18,
      "start": 1919.7599792480469,
      "end": 1926.959976196289,
      "text": " will allow a trial in your life and he'll allow a trial in my life, and as we are reminded"
    },
    {
      "id": 19,
      "start": 1926.959976196289,
      "end": 1932.1599731445312,
      "text": " of God's, of our position in Christ and of God's power and understanding his purpose,"
    },
    {
      "id": 20,
      "start": 1932.2799835205078,
      "end": 1936.3599853515625,
      "text": " and we understand that through this God is to be honored and glorified. I may not see"
    },
    {
      "id": 21,
      "start": 1936.3599853515625,
      "end": 1940.719970703125,
      "text": " at the start of the trial exactly how it is that God's going to be honored and glorified,"
    },
    {
      "id": 22,
      "start": 1940.719970703125,
      "end": 1946.3599853515625,
      "text": " but I can understand and I can rest assured that God has a purpose in the midst of that"
    },
    {
      "id": 23,
      "start": 1946.3599853515625,
      "end": 1953.8799743652344,
      "text": " trial. And I'm so thankful that God in the midst of the trial is to be honored and glorified."
    },
    {
      "id": 24,
      "start": 1953.8799743652344,
      "end": 1957.4399719238281,
      "text": " Notice if you will, take your Bibles and turn back to the book of John if you will, and"
    },
    {
      "id": 25,
      "start": 1957.4399719238281,
      "end": 1964.1199798583984,
      "text": " I want to show you a thought here in John chapter number 11, and I want you to see,"
    },
    {
      "id": 26,
      "start": 1964.1199798583984,
      "end": 1969.8799743652344,
      "text": " I'm in Luke, I better get over to John, I went too far. In John chapter number 11, it's"
    },
    {
      "id": 27,
      "start": 1969.8799743652344,
      "end": 1975.719970703125,
      "text": " a familiar passage of Scripture. The Bible tells us in John chapter 11 that near the"
    },
    {
      "id": 28,
      "start": 1975.719970703125,
      "end": 1980.7999725341797,
      "text": " end of the passage that Jesus stands and says, Lazarus, come forth. And we all know what"
    },
    {
      "id": 29,
      "start": 1980.7999725341797,
      "end": 1986.1599731445312,
      "text": " happens in this portion of Scripture. Lazarus comes walking out of the grave. He was dead"
    },
    {
      "id": 30,
      "start": 1986.1599731445312,
      "end": 1994.6799774169922,
      "text": " for four days, and the concern was that he surely stinketh by now. But we find at the"
    },
    {
      "id": 31,
      "start": 1994.6799774169922,
      "end": 2000.6799774169922,
      "text": " very beginning of this passage of Scripture in John chapter 11 that Lazarus falls sick,"
    },
    {
      "id": 32,
      "start": 2000.6799774169922,
      "end": 2006.8799743652344,
      "text": " and Mary and Martha, they believed not only that the Lord Jesus Christ loved their brother,"
    },
    {
      "id": 33,
      "start": 2006.8799743652344,
      "end": 2011.0799713134766,
      "text": " but I believe that they, and you study through the passage of Scripture, they believed that"
    },
    {
      "id": 34,
      "start": 2011.0799713134766,
      "end": 2017.0399780273438,
      "text": " Jesus had the ability to heal Lazarus of whatever the sickness was. In fact, they both"
    },
    {
      "id": 35,
      "start": 2017.0399780273438,
      "end": 2024.239974975586,
      "text": " protest when Jesus arrives that if thou hadst been here, my brother had not died. Not only"
    },
    {
      "id": 36,
      "start": 2024.239974975586,
      "end": 2028.3199768066406,
      "text": " did Mary and Martha believe that, but I would say to you that the Jews that were gathered"
    },
    {
      "id": 37,
      "start": 2028.3199768066406,
      "end": 2034.2799835205078,
      "text": " together that were wailing and that were mourning with the family, that they also say in verse"
    },
    {
      "id": 38,
      "start": 2034.2799835205078,
      "end": 2038.4399719238281,
      "text": " number 37, could not this man which opened the eyes of the blind have caused that even"
    },
    {
      "id": 39,
      "start": 2038.4399719238281,
      "end": 2044.6799774169922,
      "text": " this man should not have died? They believe. Listen, the account in John chapter 10 of"
    },
    {
      "id": 40,
      "start": 2044.6799774169922,
      "end": 2049.3199768066406,
      "text": " the pool of Bethesda and the eyes being open, I mean, that's an amazing truth that is given"
    },
    {
      "id": 41,
      "start": 2049.3199768066406,
      "end": 2054.999984741211,
      "text": " to us, and we find that there as we look at what's happening and looking at that context"
    },
    {
      "id": 42,
      "start": 2054.999984741211,
      "end": 2060.2799682617188,
      "text": " that now, John chapter number 9, excuse me, we find that there this man that was born"
    },
    {
      "id": 43,
      "start": 2060.2799682617188,
      "end": 2065.6799926757812,
      "text": " blind, he was blind from his birth, that these Jews, they say, could not this man that healed"
    },
    {
      "id": 44,
      "start": 2065.6799926757812,
      "end": 2073.1599731445312,
      "text": " that man that was blind, could not, he could have healed this man. And so Mary and Martha"
    },
    {
      "id": 45,
      "start": 2073.1599731445312,
      "end": 2080.439971923828,
      "text": " believe that Jesus was able, and therefore they send for him. Now, we believe that Jesus"
    },
    {
      "id": 46,
      "start": 2080.439971923828,
      "end": 2086.759979248047,
      "text": " is able, so what do we do? We pray. Jesus is not here physically with us as he was in"
    },
    {
      "id": 47,
      "start": 2086.759979248047,
      "end": 2091.759979248047,
      "text": " John chapter 11, the earthly ministry of the Lord Jesus Christ, when he took on the form"
    },
    {
      "id": 48,
      "start": 2091.759979248047,
      "end": 2097.5599670410156,
      "text": " of a man, he never ceased being God, he's the God-man, and we find that at the incarnation"
    },
    {
      "id": 49,
      "start": 2097.5599670410156,
      "end": 2102.0799865722656,
      "text": " he comes in this ministry of the Lord Jesus Christ's earthly ministry in John chapter"
    },
    {
      "id": 50,
      "start": 2102.0799865722656,
      "end": 2109.8399658203125,
      "text": " 11, we find that they were able to send physically for Jesus to come. Jesus is not here physically"
    },
    {
      "id": 51,
      "start": 2109.8399658203125,
      "end": 2114.47998046875,
      "text": " anymore. We understand that we have the Holy Spirit of God that indwells us, we understand"
    },
    {
      "id": 52,
      "start": 2114.47998046875,
      "end": 2118.239990234375,
      "text": " the Bible says that he ascended to heaven, and one day, one glorious day, he's coming"
    },
    {
      "id": 53,
      "start": 2118.239990234375,
      "end": 2123.3399658203125,
      "text": " back for us and how we should rejoice in that, but he's at the right hand of the Father,"
    },
    {
      "id": 54,
      "start": 2123.3399658203125,
      "end": 2129.7999877929688,
      "text": " he ever liveth, the Bible says, to make intercession for us. And we cannot go call for Jesus that"
    },
    {
      "id": 55,
      "start": 2129.7999877929688,
      "end": 2134.5999755859375,
      "text": " he's down at the, the, the wherever he is and bring him here physically like they could,"
    },
    {
      "id": 56,
      "start": 2134.5999755859375,
      "end": 2140.0399780273438,
      "text": " but we pray. Why do we pray? Well, because we believe that Jesus is able. But when Jesus"
    },
    {
      "id": 57,
      "start": 2140.0399780273438,
      "end": 2148.9199829101562,
      "text": " finds out about he whom thou lovest is sick, Jesus didn't immediately go. He tarried because"
    },
    {
      "id": 58,
      "start": 2148.9199829101562,
      "end": 2154.999969482422,
      "text": " he had a purpose. Notice in verse number 4 of John 11, the Bible says when Jesus heard"
    },
    {
      "id": 59,
      "start": 2154.999969482422,
      "end": 2162.0399780273438,
      "text": " that, heard what? That Lazarus was sick, he said, the sickness is not unto death, but"
    },
    {
      "id": 60,
      "start": 2162.0399780273438,
      "end": 2169.3999633789062,
      "text": " then notice these words, but for the glory of God, but for the glory of God, that the"
    },
    {
      "id": 61,
      "start": 2169.3999633789062,
      "end": 2175.3199768066406,
      "text": " Son of God might be glorified thereby. Listen, in your life and in my life, we go through"
    },
    {
      "id": 62,
      "start": 2175.3199768066406,
      "end": 2180.439971923828,
      "text": " trials. One of the purposes that God has is that he would receive the honor and glory."
    },
    {
      "id": 63,
      "start": 2180.439971923828,
      "end": 2186.5999755859375,
      "text": " You say, man, this trial is just, it's just overwhelming and I can't, how's God going"
    },
    {
      "id": 64,
      "start": 2186.5999755859375,
      "end": 2192.759979248047,
      "text": " to get glory through it? If we're complaining and murmuring and we're just kind of, it's"
    },
    {
      "id": 65,
      "start": 2192.759979248047,
      "end": 2197.719970703125,
      "text": " going to make it pretty tough. But when we understand that he has a purpose, we say,"
    },
    {
      "id": 66,
      "start": 2197.719970703125,
      "end": 2201.47998046875,
      "text": " God, I'm not sure what you're doing here, but I know that you do all things well. I"
    },
    {
      "id": 67,
      "start": 2201.47998046875,
      "end": 2205.8799743652344,
      "text": " know, God, that you make no mistakes. God, I know that you have a purpose in this. And"
    },
    {
      "id": 68,
      "start": 2205.8799743652344,
      "end": 2211.3999633789062,
      "text": " God, I pray that through this somehow you would receive the honor and the glory, that"
    },
    {
      "id": 69,
      "start": 2211.3999633789062,
      "end": 2221.8799743652344,
      "text": " your name would be exalted, that you would be magnified through this trial. Not only"
    },
    {
      "id": 70,
      "start": 2221.8799743652344,
      "end": 2225.0799865722656,
      "text": " is he seeking to bring honor and glory to himself, but he's seeking to develop you and"
    },
    {
      "id": 71,
      "start": 2225.0799865722656,
      "end": 2234.9199829101562,
      "text": " I spiritually. He's seeking to develop us spiritually. You know, growth has challenges."
    },
    {
      "id": 72,
      "start": 2234.9199829101562,
      "end": 2238.7999877929688,
      "text": " You ever hear somebody speak medically about physical growth and they talk about growing"
    },
    {
      "id": 73,
      "start": 2238.7999877929688,
      "end": 2244.719970703125,
      "text": " pains? You ever hear somebody use that phraseology? My brother, he grew about six inches one summer"
    },
    {
      "id": 74,
      "start": 2244.719970703125,
      "end": 2250.0799865722656,
      "text": " and he had terrible pain in his knees for several months because of what the doctor"
    },
    {
      "id": 75,
      "start": 2250.0799865722656,
      "end": 2254.6399841308594,
      "text": " said is that he grew so fast that all those ligaments and what have you were stretched"
    },
    {
      "id": 76,
      "start": 2254.6399841308594,
      "end": 2257.719970703125,
      "text": " out and it was just causing him pain. And they said, just bear with it for a little"
    },
    {
      "id": 77,
      "start": 2257.719970703125,
      "end": 2262.3599853515625,
      "text": " while and it will go away. And eventually that kind of happened. But you hear that thing"
    },
    {
      "id": 78,
      "start": 2262.3599853515625,
      "end": 2265.9199829101562,
      "text": " of growing pains. Listen, when you grow, if you want to go work out, I was working out"
    },
    {
      "id": 79,
      "start": 2265.9199829101562,
      "end": 2269.5999755859375,
      "text": " with Joseph and he's at that age where he wants to start lifting weights and so I'm"
    },
    {
      "id": 80,
      "start": 2269.5999755859375,
      "end": 2273.1599731445312,
      "text": " lifting weights with Joseph. And guess what happens after you lift weights when you haven't"
    },
    {
      "id": 81,
      "start": 2273.1599731445312,
      "end": 2278.5599670410156,
      "text": " done it for a while? You're sore. And so you know what Joseph likes to do, Tim? He likes"
    },
    {
      "id": 82,
      "start": 2278.5599670410156,
      "end": 2282.519989013672,
      "text": " to come over to me and he likes to do this right here. How's that feel, daddy? How's"
    },
    {
      "id": 83,
      "start": 2282.519989013672,
      "end": 2286.3199768066406,
      "text": " this feel, daddy? Why? Because he knows that that's sore because of the muscles that we"
    },
    {
      "id": 84,
      "start": 2286.3199768066406,
      "end": 2295.439971923828,
      "text": " worked. It's just how it works. Sometimes the growth spiritually requires a trial. But"
    },
    {
      "id": 85,
      "start": 2295.439971923828,
      "end": 2300.199981689453,
      "text": " God's developing us. You say, but I don't want that pain. I don't want that. But God's"
    },
    {
      "id": 86,
      "start": 2300.199981689453,
      "end": 2305.8399658203125,
      "text": " growing you. You're going to learn something that you would not learn under any other circumstance."
    },
    {
      "id": 87,
      "start": 2305.8399658203125,
      "end": 2313.5999755859375,
      "text": " Notice here in John 11, after Jesus delays, he tells the disciples that we're going to"
    },
    {
      "id": 88,
      "start": 2313.5999755859375,
      "end": 2319.4400024414062,
      "text": " go. And he says in verse number 11, these things said he, and after that he saith unto"
    },
    {
      "id": 89,
      "start": 2319.4400024414062,
      "end": 2324.1199951171875,
      "text": " them, Our friend Lazarus sleepeth, but I go that I may wake him out of sleep. Then said"
    },
    {
      "id": 90,
      "start": 2324.1199951171875,
      "end": 2329.5199584960938,
      "text": " his disciples, Lord, if he sleep, he shall do well. Howbeit Jesus spake of his death,"
    },
    {
      "id": 91,
      "start": 2329.5199584960938,
      "end": 2334.1199951171875,
      "text": " but they thought that he had spoken of taking a rest and sleep. Then said Jesus unto them"
    },
    {
      "id": 92,
      "start": 2334.1199951171875,
      "end": 2342.199951171875,
      "text": " plainly, Lazarus is dead. But then I want you to catch verse 15. Jesus says this, I"
    },
    {
      "id": 93,
      "start": 2342.199951171875,
      "end": 2353.6799926757812,
      "text": " am glad for your sakes that I was not there, to the intent you may believe. Nevertheless,"
    },
    {
      "id": 94,
      "start": 2353.6799926757812,
      "end": 2361.8399658203125,
      "text": " let us go unto him. He says, I am glad for your sakes that I was not there. Listen, there's"
    },
    {
      "id": 95,
      "start": 2361.8399658203125,
      "end": 2366.719970703125,
      "text": " some things that God's going to teach us in the midst of trials that we're only going"
    },
    {
      "id": 96,
      "start": 2366.719970703125,
      "end": 2373.5999755859375,
      "text": " to learn through the trial. It's just the way it works. Some of you do various things"
    },
    {
      "id": 97,
      "start": 2373.5999755859375,
      "end": 2380.239990234375,
      "text": " for a living that require certain types of training. And there are times in which you"
    },
    {
      "id": 98,
      "start": 2380.239990234375,
      "end": 2386.5999755859375,
      "text": " engage in training that you hope you never have to use. But you learn some things through"
    },
    {
      "id": 99,
      "start": 2386.6399536132812,
      "end": 2393.5999755859375,
      "text": " that process. And God, as he's bringing, as he's allowing trials in your life and in my"
    },
    {
      "id": 100,
      "start": 2393.5999755859375,
      "end": 2399.1199951171875,
      "text": " life, I am able to rejoice. I'm able to have joy unspeakable and full of glory. I'm able"
    },
    {
      "id": 101,
      "start": 2399.1199951171875,
      "end": 2400.0799560546875,
      "text": " to rejoice greatly."
    },
    {
      "id": 0,
      "start": 2400.0799560546875,
      "end": 2402.5799560546875,
      "text": " in the midst of the trial, why?"
    },
    {
      "id": 1,
      "start": 2402.5799560546875,
      "end": 2405.479956150055,
      "text": " Because I understand my position in Christ."
    },
    {
      "id": 2,
      "start": 2405.479956150055,
      "end": 2407.559956073761,
      "text": " This trial that I'm going through"
    },
    {
      "id": 3,
      "start": 2407.559956073761,
      "end": 2410.7999563217163,
      "text": " is not going to change my position in Christ."
    },
    {
      "id": 4,
      "start": 2410.7999563217163,
      "end": 2412.7199563980103,
      "text": " It's not gonna alter it one bit."
    },
    {
      "id": 5,
      "start": 2412.7199563980103,
      "end": 2415.559955596924,
      "text": " It's not gonna change that I'm going to heaven one day."
    },
    {
      "id": 6,
      "start": 2415.559955596924,
      "end": 2417.119956970215,
      "text": " This trial that I'm going through,"
    },
    {
      "id": 7,
      "start": 2417.119956970215,
      "end": 2419.2399559020996,
      "text": " I know that my God has all power,"
    },
    {
      "id": 8,
      "start": 2419.2399559020996,
      "end": 2420.8199558258057,
      "text": " and I know that my God is able,"
    },
    {
      "id": 9,
      "start": 2420.8199558258057,
      "end": 2423.279956817627,
      "text": " and I know that he is able to do something amazing,"
    },
    {
      "id": 10,
      "start": 2423.279956817627,
      "end": 2425.7599563598633,
      "text": " and I trust him, and I'm following him,"
    },
    {
      "id": 11,
      "start": 2425.7599563598633,
      "end": 2428.519956588745,
      "text": " and I'm rejoicing because it's kind of that idea"
    },
    {
      "id": 12,
      "start": 2428.519956588745,
      "end": 2431.879955291748,
      "text": " of anticipating and expecting what's God going to do."
    },
    {
      "id": 13,
      "start": 2433.6399574279785,
      "end": 2434.8399543762207,
      "text": " You remember the disciples when they're"
    },
    {
      "id": 14,
      "start": 2434.8399543762207,
      "end": 2437.3399543762207,
      "text": " in the midst of the storm on the boat?"
    },
    {
      "id": 15,
      "start": 2437.3399543762207,
      "end": 2438.9199562072754,
      "text": " By the way, they were in the midst of the storm"
    },
    {
      "id": 16,
      "start": 2438.9199562072754,
      "end": 2441.6399574279785,
      "text": " because Jesus told them, go to the other side."
    },
    {
      "id": 17,
      "start": 2443.879955291748,
      "end": 2447.059955596924,
      "text": " This idea this morning that trials are always,"
    },
    {
      "id": 18,
      "start": 2447.059955596924,
      "end": 2449.3199577331543,
      "text": " 100% of the time, a result of your sin"
    },
    {
      "id": 19,
      "start": 2449.3199577331543,
      "end": 2451.7999572753906,
      "text": " or my sin is not biblical."
    },
    {
      "id": 20,
      "start": 2451.7999572753906,
      "end": 2453.7599563598633,
      "text": " Now there are some times that,"
    },
    {
      "id": 21,
      "start": 2453.7599563598633,
      "end": 2454.999954223633,
      "text": " the way of the transgressor is hard."
    },
    {
      "id": 22,
      "start": 2454.999954223633,
      "end": 2456.7599563598633,
      "text": " There are some times that sin results"
    },
    {
      "id": 23,
      "start": 2456.7599563598633,
      "end": 2458.9199562072754,
      "text": " in some hardship and some difficulty,"
    },
    {
      "id": 24,
      "start": 2458.9199562072754,
      "end": 2460.719955444336,
      "text": " but I would submit to you this morning"
    },
    {
      "id": 25,
      "start": 2460.719955444336,
      "end": 2462.559955596924,
      "text": " that there are times in which you,"
    },
    {
      "id": 26,
      "start": 2462.559955596924,
      "end": 2464.999954223633,
      "text": " there are times that I may be right in the midst"
    },
    {
      "id": 27,
      "start": 2464.999954223633,
      "end": 2468.6399536132812,
      "text": " of a great storm of a trial simply because I'm obeying God,"
    },
    {
      "id": 28,
      "start": 2470.439956665039,
      "end": 2472.6399536132812,
      "text": " simply because I'm following the leadership"
    },
    {
      "id": 29,
      "start": 2472.6399536132812,
      "end": 2474.319953918457,
      "text": " of the Holy Spirit of God,"
    },
    {
      "id": 30,
      "start": 2474.319953918457,
      "end": 2477.839958190918,
      "text": " and I find myself in the midst of a trial."
    },
    {
      "id": 31,
      "start": 2477.839958190918,
      "end": 2480.3999557495117,
      "text": " Such was the case for the disciples on that day,"
    },
    {
      "id": 32,
      "start": 2480.3999557495117,
      "end": 2482.7599563598633,
      "text": " and they find themselves in the midst of a great storm,"
    },
    {
      "id": 33,
      "start": 2482.7599563598633,
      "end": 2485.8799591064453,
      "text": " and Jesus then says, peace be still, and the storm is calm."
    },
    {
      "id": 34,
      "start": 2485.8799591064453,
      "end": 2487.9599533081055,
      "text": " They got to see the power."
    },
    {
      "id": 35,
      "start": 2489.599952697754,
      "end": 2491.5199584960938,
      "text": " What manner of man is this"
    },
    {
      "id": 36,
      "start": 2491.5199584960938,
      "end": 2494.0799560546875,
      "text": " that even the winds and the waves obey him?"
    },
    {
      "id": 37,
      "start": 2494.0799560546875,
      "end": 2495.439956665039,
      "text": " They get to learn some things."
    },
    {
      "id": 38,
      "start": 2495.439956665039,
      "end": 2496.719955444336,
      "text": " Listen, if there was never a storm,"
    },
    {
      "id": 39,
      "start": 2496.719955444336,
      "end": 2499.319953918457,
      "text": " they never would have seen that power."
    },
    {
      "id": 40,
      "start": 2499.319953918457,
      "end": 2500.3999557495117,
      "text": " If there was never a storm,"
    },
    {
      "id": 41,
      "start": 2500.3999557495117,
      "end": 2502.6399536132812,
      "text": " you would never be able to read the account."
    },
    {
      "id": 42,
      "start": 2502.6399536132812,
      "end": 2504.8799591064453,
      "text": " I'd never be able to preach or teach the account"
    },
    {
      "id": 43,
      "start": 2504.8799591064453,
      "end": 2508.2799530029297,
      "text": " of Jesus demonstrating his power over the storm."
    },
    {
      "id": 44,
      "start": 2509.1999588012695,
      "end": 2510.8999557495117,
      "text": " They needed to go through a storm."
    },
    {
      "id": 45,
      "start": 2510.8999557495117,
      "end": 2515.8999557495117,
      "text": " This morning, God has a purpose."
    },
    {
      "id": 46,
      "start": 2517.339958190918,
      "end": 2519.9799575805664,
      "text": " His purpose, first and foremost,"
    },
    {
      "id": 47,
      "start": 2519.9799575805664,
      "end": 2522.339958190918,
      "text": " is to bring honor and glory to himself."
    },
    {
      "id": 48,
      "start": 2522.339958190918,
      "end": 2524.939956665039,
      "text": " Secondly, it's to develop us spiritually."
    },
    {
      "id": 49,
      "start": 2524.939956665039,
      "end": 2527.419952392578,
      "text": " Notice, it says that the trial of your faith"
    },
    {
      "id": 50,
      "start": 2527.419952392578,
      "end": 2528.739959716797,
      "text": " in 1 Peter 1 and verse number seven,"
    },
    {
      "id": 51,
      "start": 2528.739959716797,
      "end": 2532.0999603271484,
      "text": " being much more precious than of gold that perisheth."
    },
    {
      "id": 52,
      "start": 2532.0999603271484,
      "end": 2533.999954223633,
      "text": " That'll put some things in perspective"
    },
    {
      "id": 53,
      "start": 2535.739959716797,
      "end": 2538.1399536132812,
      "text": " as to what is important and what's the priority."
    },
    {
      "id": 54,
      "start": 2539.1399536132812,
      "end": 2542.659957885742,
      "text": " He says, though it be tried with fire,"
    },
    {
      "id": 55,
      "start": 2542.659957885742,
      "end": 2544.8999633789062,
      "text": " might be found in the praise and honor and glory"
    },
    {
      "id": 56,
      "start": 2544.8999633789062,
      "end": 2546.3399505615234,
      "text": " at the appearing of Jesus Christ."
    },
    {
      "id": 57,
      "start": 2546.3399505615234,
      "end": 2548.8999633789062,
      "text": " Listen, one day, he's coming back."
    },
    {
      "id": 58,
      "start": 2548.8999633789062,
      "end": 2549.8199615478516,
      "text": " One day, I'm going to see him."
    },
    {
      "id": 59,
      "start": 2549.8199615478516,
      "end": 2554.2999572753906,
      "text": " We sang last week, face to face, I shall behold him."
    },
    {
      "id": 60,
      "start": 2554.2999572753906,
      "end": 2556.0999603271484,
      "text": " One day, I'm going to see my savior."
    },
    {
      "id": 61,
      "start": 2557.0199584960938,
      "end": 2559.0999603271484,
      "text": " Man, that should encourage every single believer"
    },
    {
      "id": 62,
      "start": 2559.0999603271484,
      "end": 2560.8599548339844,
      "text": " this morning, I'm going to see him."
    },
    {
      "id": 63,
      "start": 2562.8599548339844,
      "end": 2565.6199493408203,
      "text": " We find, it says that we can have this joy,"
    },
    {
      "id": 64,
      "start": 2565.6199493408203,
      "end": 2566.979949951172,
      "text": " unspeakable and full of glory"
    },
    {
      "id": 65,
      "start": 2566.979949951172,
      "end": 2568.739959716797,
      "text": " in 1 Peter 5 and verse 10."
    },
    {
      "id": 66,
      "start": 2568.739959716797,
      "end": 2570.2599487304688,
      "text": " It says that after you've suffered a while,"
    },
    {
      "id": 67,
      "start": 2570.2599487304688,
      "end": 2572.0599517822266,
      "text": " that he will make you perfect,"
    },
    {
      "id": 68,
      "start": 2572.0599517822266,
      "end": 2575.0599517822266,
      "text": " establish, strengthen, and settle you."
    },
    {
      "id": 69,
      "start": 2575.0599517822266,
      "end": 2576.2999572753906,
      "text": " I want you to think about that work"
    },
    {
      "id": 70,
      "start": 2576.2999572753906,
      "end": 2577.939956665039,
      "text": " that God's doing through the trial"
    },
    {
      "id": 71,
      "start": 2577.939956665039,
      "end": 2580.5399627685547,
      "text": " and developing us spiritually."
    },
    {
      "id": 72,
      "start": 2580.5399627685547,
      "end": 2582.979949951172,
      "text": " No doubt that we could stand here this morning"
    },
    {
      "id": 73,
      "start": 2582.979949951172,
      "end": 2584.2599487304688,
      "text": " and we could give testimonies."
    },
    {
      "id": 74,
      "start": 2584.2599487304688,
      "end": 2585.8999633789062,
      "text": " We could open up for opportunity"
    },
    {
      "id": 75,
      "start": 2585.8999633789062,
      "end": 2588.179962158203,
      "text": " for some to give some testimonies this morning"
    },
    {
      "id": 76,
      "start": 2588.179962158203,
      "end": 2591.0599517822266,
      "text": " of, listen, how has God taught you certain things?"
    },
    {
      "id": 77,
      "start": 2591.0599517822266,
      "end": 2593.0599517822266,
      "text": " How has God grown you spiritually?"
    },
    {
      "id": 78,
      "start": 2593.0599517822266,
      "end": 2596.1399536132812,
      "text": " And I can guarantee you that there will be some trials"
    },
    {
      "id": 79,
      "start": 2596.179962158203,
      "end": 2599.419952392578,
      "text": " that are referenced as to how God developed us."
    },
    {
      "id": 80,
      "start": 2603.7799530029297,
      "end": 2606.979949951172,
      "text": " Job said it this way in Job 23."
    },
    {
      "id": 81,
      "start": 2613.2599487304688,
      "end": 2616.499954223633,
      "text": " Verse number 10, but he knoweth the way that I take."
    },
    {
      "id": 82,
      "start": 2617.5399627685547,
      "end": 2622.5399627685547,
      "text": " When he hath tried me, I shall come forth as gold."
    },
    {
      "id": 83,
      "start": 2623.219955444336,
      "end": 2624.0599517822266,
      "text": " As gold."
    },
    {
      "id": 84,
      "start": 2625.4599609375,
      "end": 2627.8599548339844,
      "text": " I want you to think about Job just for a moment."
    },
    {
      "id": 85,
      "start": 2629.5399627685547,
      "end": 2631.3399505615234,
      "text": " You say, man, I had a bad day."
    },
    {
      "id": 86,
      "start": 2631.3399505615234,
      "end": 2632.2999572753906,
      "text": " Read Job."
    },
    {
      "id": 87,
      "start": 2635.939956665039,
      "end": 2637.1399536132812,
      "text": " Seriously."
    },
    {
      "id": 88,
      "start": 2637.1399536132812,
      "end": 2639.0199584960938,
      "text": " How many of you have read Job before?"
    },
    {
      "id": 89,
      "start": 2640.1399536132812,
      "end": 2641.659957885742,
      "text": " Okay."
    },
    {
      "id": 90,
      "start": 2641.659957885742,
      "end": 2643.2999572753906,
      "text": " If you've read Job,"
    },
    {
      "id": 91,
      "start": 2645.979949951172,
      "end": 2648.939956665039,
      "text": " I'm guessing that you've never had a day like Job had."
    },
    {
      "id": 92,
      "start": 2653.5399627685547,
      "end": 2658.5399475097656,
      "text": " And Job says, he knoweth the way that I take."
    },
    {
      "id": 93,
      "start": 2659.179962158203,
      "end": 2664.179962158203,
      "text": " When he hath tried me, I shall come forth as gold."
    },
    {
      "id": 94,
      "start": 2665.979949951172,
      "end": 2667.6199645996094,
      "text": " Ron Hamilton wrote a song"
    },
    {
      "id": 95,
      "start": 2668.8199462890625,
      "end": 2671.0599670410156,
      "text": " that goes along with this verse of Scripture."
    },
    {
      "id": 96,
      "start": 2672.1399536132812,
      "end": 2674.6199645996094,
      "text": " Man, what a powerful truth."
    },
    {
      "id": 97,
      "start": 2674.6199645996094,
      "end": 2678.0999450683594,
      "text": " James says it this way, and we'll close with this"
    },
    {
      "id": 98,
      "start": 2678.0999450683594,
      "end": 2681.6199645996094,
      "text": " in James one, verses two through four."
    },
    {
      "id": 99,
      "start": 2683.5399475097656,
      "end": 2686.0999450683594,
      "text": " Notice here,"
    },
    {
      "id": 100,
      "start": 2690.0999450683594,
      "end": 2694.8199462890625,
      "text": " James says, my brethren, count it all joy"
    },
    {
      "id": 101,
      "start": 2695.739959716797,
      "end": 2698.2999572753906,
      "text": " when you fall into divers temptations."
    },
    {
      "id": 102,
      "start": 2699.739959716797,
      "end": 2702.5399475097656,
      "text": " Rejoicing through trials."
    },
    {
      "id": 103,
      "start": 2702.5399475097656,
      "end": 2704.8599548339844,
      "text": " Count it all joy."
    },
    {
      "id": 104,
      "start": 2704.8599548339844,
      "end": 2708.179962158203,
      "text": " Temptations, trials, divers, various sorts."
    },
    {
      "id": 105,
      "start": 2709.179962158203,
      "end": 2711.2999572753906,
      "text": " Then notice these two words,"
    },
    {
      "id": 106,
      "start": 2711.2999572753906,
      "end": 2712.8199462890625,
      "text": " and I think they're so important."
    },
    {
      "id": 107,
      "start": 2712.8199462890625,
      "end": 2715.0599670410156,
      "text": " Knowing this."
    },
    {
      "id": 108,
      "start": 2716.219970703125,
      "end": 2719.499969482422,
      "text": " There's some things that God wants his people to know."
    },
    {
      "id": 109,
      "start": 2719.499969482422,
      "end": 2724.499969482422,
      "text": " Knowing this, that the trying of your faith"
    },
    {
      "id": 110,
      "start": 2724.499969482422,
      "end": 2729.499969482422,
      "text": " worketh patience, but let patience have her perfect work,"
    },
    {
      "id": 111,
      "start": 2730.419952392578,
      "end": 2735.419952392578,
      "text": " that ye may be perfect and entire, wanting nothing."
    },
    {
      "id": 112,
      "start": 2738.419952392578,
      "end": 2742.6199645996094,
      "text": " That's maturity, Christian maturity, perfect."
    },
    {
      "id": 113,
      "start": 2742.6199645996094,
      "end": 2747.6199645996094,
      "text": " Not sinless, but complete, that idea of maturity."
    },
    {
      "id": 114,
      "start": 2748.699951171875,
      "end": 2753.699951171875,
      "text": " And it says that knowing this, this morning,"
    },
    {
      "id": 115,
      "start": 2753.7799682617188,
      "end": 2756.219970703125,
      "text": " the question is not whether you'll have a trial."
    },
    {
      "id": 116,
      "start": 2757.419952392578,
      "end": 2758.8999633789062,
      "text": " The question really for us this morning"
    },
    {
      "id": 117,
      "start": 2758.8999633789062,
      "end": 2762.1399536132812,
      "text": " is how do we respond in the midst of the trial?"
    },
    {
      "id": 118,
      "start": 2762.1399536132812,
      "end": 2767.1399536132812,
      "text": " Can we rejoice through trials?"
    },
    {
      "id": 119,
      "start": 2769.7799682617188,
      "end": 2771.7799682617188,
      "text": " We're commanded to do so."
    },
    {
      "id": 120,
      "start": 2771.7799682617188,
      "end": 2775.419952392578,
      "text": " Rejoice in the Lord always, and again I say rejoice."
    },
    {
      "id": 121,
      "start": 2775.419952392578,
      "end": 2777.7799682617188,
      "text": " This is the day the Lord hath made."
    },
    {
      "id": 122,
      "start": 2777.7799682617188,
      "end": 2781.0999450683594,
      "text": " We will rejoice and be glad in it."
    },
    {
      "id": 123,
      "start": 2782.0199584960938,
      "end": 2784.7799682617188,
      "text": " We can see some people in the pages of scripture,"
    },
    {
      "id": 124,
      "start": 2784.7799682617188,
      "end": 2786.93994140625,
      "text": " I've just looked at three references this morning,"
    },
    {
      "id": 125,
      "start": 2786.93994140625,
      "end": 2790.0999450683594,
      "text": " that face great difficulty, and yet they rejoiced."
    },
    {
      "id": 126,
      "start": 2791.0599670410156,
      "end": 2796.0599670410156,
      "text": " So absolutely we can rejoice through trials."
    },
    {
      "id": 127,
      "start": 2796.1399536132812,
      "end": 2798.219970703125,
      "text": " This is not an exhaustive list this morning,"
    },
    {
      "id": 128,
      "start": 2798.219970703125,
      "end": 2801.7799682617188,
      "text": " but from 1 Peter 1, just three simple thoughts,"
    },
    {
      "id": 129,
      "start": 2801.7799682617188,
      "end": 2806.0999450683594,
      "text": " truths that will enable you, that will enable me"
    },
    {
      "id": 130,
      "start": 2806.0999450683594,
      "end": 2808.8999633789062,
      "text": " to rejoice in the midst of trial."
    },
    {
      "id": 131,
      "start": 2808.8999633789062,
      "end": 2812.499969482422,
      "text": " Number one, remember your position in Christ."
    },
    {
      "id": 132,
      "start": 2812.499969482422,
      "end": 2815.739959716797,
      "text": " What a joy to be saved, what a joy."
    },
    {
      "id": 133,
      "start": 2815.739959716797,
      "end": 2820.739959716797,
      "text": " No man, no thing can alter your position in Christ."
    },
    {
      "id": 134,
      "start": 2822.2999572753906,
      "end": 2825.4599609375,
      "text": " Remember the power of God in the midst of your trial."
    },
    {
      "id": 135,
      "start": 2825.4599609375,
      "end": 2826.8199462890625,
      "text": " Remember God's power."
    },
    {
      "id": 136,
      "start": 2826.8199462890625,
      "end": 2828.739959716797,
      "text": " We serve the Lord God omnipotent."
    },
    {
      "id": 137,
      "start": 2828.739959716797,
      "end": 2830.4599609375,
      "text": " He's able to do exceeding abundantly above"
    },
    {
      "id": 138,
      "start": 2830.4599609375,
      "end": 2832.5799560546875,
      "text": " all that we ask or think."
    },
    {
      "id": 139,
      "start": 2832.5799560546875,
      "end": 2833.5399475097656,
      "text": " And then finally this morning,"
    },
    {
      "id": 140,
      "start": 2833.5399475097656,
      "end": 2835.8199462890625,
      "text": " remember that God has a purpose."
    },
    {
      "id": 141,
      "start": 2835.8199462890625,
      "end": 2837.699951171875,
      "text": " It's never by accident."
    },
    {
      "id": 142,
      "start": 2837.699951171875,
      "end": 2839.5999450683594,
      "text": " It's never for naught."
    },
    {
      "id": 143,
      "start": 2839.5999450683594,
      "end": 2842.8999633789062,
      "text": " It's not just an exercise to,"
    },
    {
      "id": 144,
      "start": 2842.8999633789062,
      "end": 2844.159942626953,
      "text": " well we got nothing else to do today,"
    },
    {
      "id": 145,
      "start": 2844.159942626953,
      "end": 2845.3199462890625,
      "text": " so we're just gonna have you do this."
    },
    {
      "id": 146,
      "start": 2845.8399658203125,
      "end": 2847.5199584960938,
      "text": " It's not busy work, it's not, no, no, no."
    },
    {
      "id": 147,
      "start": 2847.5199584960938,
      "end": 2848.5999450683594,
      "text": " There's a purpose."
    },
    {
      "id": 148,
      "start": 2850.43994140625,
      "end": 2853.199951171875,
      "text": " First and foremost, that God will be glorified."
    },
    {
      "id": 149,
      "start": 2853.199951171875,
      "end": 2855.3199462890625,
      "text": " And secondly, that we'd be developed,"
    },
    {
      "id": 150,
      "start": 2855.3199462890625,
      "end": 2857.3199462890625,
      "text": " that we'd grow spiritually,"
    },
    {
      "id": 151,
      "start": 2857.3199462890625,
      "end": 2861.3399658203125,
      "text": " that we'd come to that place of spiritual maturity."
    },
    {
      "id": 152,
      "start": 2862.43994140625,
      "end": 2866.199951171875,
      "text": " Trials, rejoicing through trials."
    },
    {
      "id": 153,
      "start": 2866.199951171875,
      "end": 2867.0399475097656,
      "text": " Let's pray."
    },
    {
      "id": 154,
      "start": 2867.0399475097656,
      "end": 2868.0799560546875,
      "text": " Father, we love you."
    },
    {
      "id": 155,
      "start": 2868.0799560546875,
      "end": 2869.7599487304688,
      "text": " We thank you for loving us."
    },
    {
      "id": 156,
      "start": 2869.7599487304688,
      "end": 2871.8399658203125,
      "text": " We thank you for the opportunity that you've given us"
    },
    {
      "id": 157,
      "start": 2871.8399658203125,
      "end": 2874.1199645996094,
      "text": " this morning to gather together."
    },
    {
      "id": 158,
      "start": 2874.1199645996094,
      "end": 2877.5199584960938,
      "text": " We thank you for the word of God."
    },
    {
      "id": 159,
      "start": 2877.5199584960938,
      "end": 2878.979949951172,
      "text": " We thank you for the truth."
    },
    {
      "id": 160,
      "start": 2879.999969482422,
      "end": 2884.2799682617188,
      "text": " God, I know that I will face trials."
    },
    {
      "id": 161,
      "start": 2884.2799682617188,
      "end": 2886.159942626953,
      "text": " I know that each one that sits here this morning"
    },
    {
      "id": 162,
      "start": 2886.159942626953,
      "end": 2887.43994140625,
      "text": " will face trials."
    },
    {
      "id": 163,
      "start": 2888.3599548339844,
      "end": 2891.659942626953,
      "text": " And God, I pray that you would enable us"
    },
    {
      "id": 164,
      "start": 2891.659942626953,
      "end": 2893.0399475097656,
      "text": " to rejoice through trials,"
    },
    {
      "id": 165,
      "start": 2893.0399475097656,
      "end": 2895.8799438476562,
      "text": " that these three truths from 1 Peter 1"
    },
    {
      "id": 166,
      "start": 2895.8799438476562,
      "end": 2898.3599548339844,
      "text": " would just permeate our minds,"
    },
    {
      "id": 167,
      "start": 2898.3599548339844,
      "end": 2901.43994140625,
      "text": " that we'd be reminded in the midst of trial"
    },
    {
      "id": 168,
      "start": 2902.2799682617188,
      "end": 2904.479949951172,
      "text": " of our position in Christ,"
    },
    {
      "id": 169,
      "start": 2904.479949951172,
      "end": 2907.9599609375,
      "text": " of your great power and of your purpose."
    },
    {
      "id": 170,
      "start": 2907.9599609375,
      "end": 2909.43994140625,
      "text": " Lord, maybe this morning there's some"
    },
    {
      "id": 171,
      "start": 2909.43994140625,
      "end": 2913.8799438476562,
      "text": " that are just going through trials, difficulties."
    },
    {
      "id": 172,
      "start": 2913.8799438476562,
      "end": 2916.5999755859375,
      "text": " Lord, I pray that you'd help them this morning."
    },
    {
      "id": 173,
      "start": 2916.5999755859375,
      "end": 2918.6399536132812,
      "text": " Lord, for one that says, man, I have nothing,"
    },
    {
      "id": 174,
      "start": 2918.6399536132812,
      "end": 2919.5999755859375,
      "text": " no trial right now."
    },
    {
      "id": 175,
      "start": 2919.5999755859375,
      "end": 2922.2799682617188,
      "text": " God, help them to store this"
    },
    {
      "id": 176,
      "start": 2922.2799682617188,
      "end": 2927.2799682617188,
      "text": " and to be ready to return to it when that trial does come."
    },
    {
      "id": 177,
      "start": 2928.199951171875,
      "end": 2931.679931640625,
      "text": " Lord, that you'd help us to rejoice through trials."
    },
    {
      "id": 178,
      "start": 2931.679931640625,
      "end": 2933.1199340820312,
      "text": " There's one that's not sure of heaven,"
    },
    {
      "id": 179,
      "start": 2933.1199340820312,
      "end": 2933.9999389648438,
      "text": " they've never been saved."
    },
    {
      "id": 180,
      "start": 2933.9999389648438,
      "end": 2935.9599609375,
      "text": " Lord, I pray that today they'd be saved"
    },
    {
      "id": 181,
      "start": 2937.179931640625,
      "end": 2940.3999633789062,
      "text": " so they'd know that position that they have in Christ."
    },
    {
      "id": 182,
      "start": 2940.3999633789062,
      "end": 2942.5199584960938,
      "text": " I pray that you'd move and work as only you can"
    },
    {
      "id": 183,
      "start": 2942.5199584960938,
      "end": 2944.5999755859375,
      "text": " and we'll give you the glory for it."
    },
    {
      "id": 184,
      "start": 2944.5999755859375,
      "end": 2945.719970703125,
      "text": " It's in Christ's name we pray."
    },
    {
      "id": 185,
      "start": 2945.719970703125,
      "end": 2946.5599365234375,
      "text": " Would you stand with me?"
    },
    {
      "id": 186,
      "start": 2946.5599365234375,
      "end": 2947.3999633789062,
      "text": " Heads or backs?"
    }
  ],
  "processed_at": "2025-04-15T23:54:35.833924"
}