{
  "video_id": "R5uUKjkYSvg",
  "text": "And for obvious reasons, perhaps, I've been reminded in recent days, recent months, of the brevity of life. And you say, Pastor, you're young. I do feel like I'm still young. But the reality is that just recently I celebrated my 42nd birthday. And you say, I wish I were 42. I understand. But here's what the psalmist says, that we spend our years as a tale that is told. The days of our years are three score years and ten. And so if I have 70 or 80 years, I've already expended half of those. And some of you said, I'm living on borrowed time. Amen. And the reality, though, is when you see your daughter married, it makes you all of a sudden think, man, life is going fast. And I can remember bringing Juliana home from the hospital. And I can remember walking through our house at the time and showing her all of the rooms and acting like she could understand what I was telling her and telling her where her bedroom would be and so on and so forth. And then I remember the first evening, and Josh and Aaron, not to discourage you, but I remember the first evening at home, she didn't sleep a wink. And it was just cry, cry, cry. And she had slept good at the hospital. And Holly was just not getting any sleep whatsoever. And there was a good husband. I said, I got it. Blake, amen, right? I said, I got it. I can handle this. And I took Juliana out in the living room. And I bet you, I mean, I don't think it was five minutes. Five minutes is dad time for sure. And I went back into the room and Holly sat straight up in the bed and she said, what's wrong? And I said, I don't know. I think she needs to go back to the hospital. And that was my medical training kicking into high gear. And there's no other option here. She must go back to the hospital. And obviously Holly was able to handle things. But the reality is that all of a sudden you start thinking about life and the brevity of life. And life is short. James tells us, what is your life? It's a vapor that appears for a little time and then vanisheth away. As we're going to think about the just life in general, and I begin to think about the New Testament and obviously having Acts 20, we're going to look at a number of passages this morning. But I think about our life as God would use in the New Testament, really as an analogy of our life, that of a race. It's likened to a race. We think about this analogy that God would use, and we'd often say over the years that this race is more like a marathon than it is a sprint. But you think about a race and there's a finish line. And for us, we understand that's when we will take our last breath upon this earth and see our Savior, and what a wonderful joy that will be. But the reality is that we don't know where the finish line is. We understand, as I've read there from Psalm 90, the 70 or 80 years. And yet we find that if we were to visit a cemetery, a graveyard today, that you will find as you walk through those rows of headstones, you will find a variety of ages of those that have deceased. And we find that though I may think at 42 years old that I have many years until I reach my finish line, the fact of the matter is that my finish line could be before yours. I sat in the room of a lady that was dying with cancer several years ago, and the doctors had told her it would just be a couple of days before she would leave this earth, and her husband was lost. And I sat in that room with the husband and the wife and another family member, and she had a testimony of salvation, the lady with cancer, but the husband was lost. And I looked at that man and I said, you understand that the doctors have said that within just a few days your wife is going to pass from this earth, but the reality, sir, is that you could possibly die before her. I don't have anything wrong. You know how many people go on the highway every day? I don't think they have anything wrong. And bam, they're in eternity. So we think about this truth of our lives, and we think about seeking to reach that finish line, and really some have said it this way, finishing is more important, or how you finish is more important than how you start. I never ran in track. It was never my, I don't have the build for track, obviously. I played baseball and football, but I understood some things about track and field, and one of the things, you're going to run a race, you know, the guy that starts out 100 miles an hour to start, he may run out of steam pretty quick. And we look at the Christian life, and as I consider the remarks of Paul here in Acts chapter number 20, as he's speaking to the leaders of the church at Ephesus, and he's called them together to where he is as he's on his way to Jerusalem, and he's going to give them some parting statements, he's going to seek to encourage them, but Paul makes a statement in Acts 20 and verse 24 that really just grabs my attention. And the Bible tells us that Paul says, but none of these things move me, neither count I my life dear unto myself, so that I might finish my course with joy. And the ministry which I have received of the Lord Jesus to testify the gospel of the grace of God. As Paul is speaking to these leaders of the church at Ephesus, he is going to tell them of his own desire that he wants to finish his course with joy. And I read that statement here in Acts 20 and verse number 24, and many of us are familiar with 2 Timothy chapter number 4, turn over there if you will, in 2 Timothy chapter number 4, and I want you to notice that Paul now is writing to his son in the faith, and of course if we could have the picture of a race and really this marathon, we find that Paul is seeking to instruct Timothy and to give Timothy, really kind of pass that baton, if you will, to Timothy. In fact, in the second chapter of the book of 2 Timothy, he says, the things that thou hast heard of me among many witnesses, the same commit thou to faithful men who shall be able to teach others also. Though Paul's race was nearing the end, his life here on earth was nearing the end, he was seeking to invest and influence Timothy, who would still continue to run his leg of the race, if you will, that he would have that responsibility. But we come to the fourth chapter, and Paul says this in verse number 6, under the inspiration of the Holy Spirit of God, for I am now ready to be offered. The time of my departure is at hand. Notice when he says, I have fought a good fight, I have finished my course, I have kept the faith. As I look at the statement in verse number 7, he says, I have finished my course, and then he says, I have kept the faith. I really believe that those two statements are really dependent upon one another, and they really reveal to us what we find in Acts 20 and verse number 24, when he says that I might finish my course with joy. The keeping the faith was the joyful part of finishing his course. And we find here this morning that as we look at the statement of Paul in Acts 20 and verse number 24, and we read 2 Timothy 4 and verses 6 and 7, the big question in my mind is, how do we get from Acts 20 and 24 to 2 Timothy 4, 6 and 7? How do we get from, I want to finish my course with joy, to, I have finished. I've kept the faith. How do we get there? Let me say this, right at the beginning, it's not going to happen by chance. It's not going to happen on accident. And I've titled the message, Finish with No Regrets. Finish with No Regrets. I want you to think about this if you're taking notes this morning from Acts 20 and verse number 24. I would say this, there is a stated purpose. A stated purpose. Paul was very clear on what his purpose was. You think about people today that are trying to find purpose in their life. They're looking all over the place of, why am I here? What am I supposed to do? What is the purpose? And Paul has a stated purpose in Acts 20 and verse number 24. He said, but none of these things move me, neither count I my life dear unto myself. And then he makes the statement that we've used and really focusing on this morning, that I might finish my course with joy. That's a great purpose statement, is it not? You think about the life of a believer, someone that's been born again, someone that's been saved by the wonderful grace of God, that we would have as our purpose statement, that we seek to bring honor and glory to God, that we seek to finish our course with joy, that we would do all that God has called us to do. That's a great mission statement. It's a stated purpose. I find that Paul doesn't just say, yeah, I want to finish. He says, no. He said that I might finish my course with joy. The reality is that each of us will take a final breath. As Brother Mershon often says, I'm looking for the upper taker, not the undertaker. I'd love to hear the trumpet of the Lord sound and to be transported and meet the Lord in the air at the rapture, amen? Wouldn't that be wonderful? But the reality is that if the Lord does not come in our lifetime, we're going to take our final breath one day. And Paul says, I want to finish with joy. I think about this stated purpose, not only finishing with joy, but I really get the idea of finishing strong. says in verse 24, that I might finish my course with joy and the ministry which I have received of the Lord Jesus to testify the gospel of the grace of God. He understood that he'd been given a ministry, been given a responsibility, and Paul says I want to finish. And I don't want to just finish, I want to finish with joy, but I think also about this aspect of finishing strong. You think about a race and you think about the the the participants as they're running a race. They want to kick it in for that last period of time. They want to finish strong as they're reaching that finish line. They're gonna give it all. They don't want to finish the race and be like I could go run a couple more miles. No, I want to be poured out. I want to leave it all. I want to finish strong. Not necessarily talking about physical strength, though in a race we might talk about physical strength, but this morning we think about the illustration of the race, the analogy that God would use really of our spiritual life, that we would finish with spiritual strength. That we would pray and ask God to give us the the spiritual strength that we need. That we could be strong in the Lord and in the power of His might. That in the evil day that we could stand, not in our own strength, not our own power, but in God's strength and in God's power. And Paul says I want to finish my course. I want to finish with joy. I want to finish with strength. I have this idea that I'd like to finish pleasing the one for whom I live. You think about those that run a race. Physically speaking, many times there are spectators. There are people that are applauding as they get to the finish line. There may be medals that are presented to those that finished in a medal category. But I want to finish my race. I want to finish my life pleasing the one who died for me. The one for whom we live. And we find that Paul is recognizing that the Lord Jesus Christ saved him, gave him a ministry, and I believe that he took the responsibility seriously. He clearly indicates and he wants others to know what his desire is. He's not keeping this private. He's saying publicly to these leaders of the church at Ephesus, he says, listen, I want to finish my course with joy. I want to do what God's called me to do. A stated purpose. A stated purpose is important. Any successful corporation or any corporation who desires to be successful is going to have a mission statement. When they have that mission statement, it clearly sets what the goal, the objective is. What is their purpose? Why are they in business? What are they seeking to accomplish? And as a child of God, when we consider this stated purpose this morning, it's good for us to have a stated purpose. It'd be good for everyone to leave here and say, I want to finish my course with joy. But the truth of the matter is that a stated purpose requires, number two, a strategic plan because it will not happen by chance. It will not happen on accident that we finish with joy, that we finish with no regrets. We think about the purpose that we would stay as Paul did in Acts 20 and verse 24. It's important that we would have such a purpose. It's imperative, however, that we would have a plan that would help us get to that desired end. That's why we read Acts 20 and then read 2 Timothy chapter number 4 because we find that it's in Acts 20 that Paul makes this declaration, but we find that it's in 2 Timothy 4. He comes to the end of his life and he says, I finished. I've kept the faith. How did he get there? How did he get there? As we begin to develop a strategic plan for our own lives, we remember and we're mindful of the fact that we have an enemy who wants to devour us. We have an enemy that wants to destroy us. We have an enemy that wants to hinder us from doing what God's called us to do. In fact, Paul says it this way to the believers in Galatia. Those were the churches that were established during that first missionary journey. What a joy to see how the church at Antioch sent out Paul and Barnabas and they went. And you think about those four churches that were established in those cities, but Paul says, ye did run well. Who did hinder you that you should not obey the truth? In Galatians 5 and verse number 7. See, there's an enemy and the enemy wants to hinder us. The enemy wants to keep us from trying to reach that stated purpose, that goal, and we find it as we have the opportunity to develop a strategic plan that God would help us to reach that stated purpose, to accomplish the goal that we've stated. I have five thoughts for you on how we could develop a strategic plan. This is not an exhaustive plan, just five thoughts, but I think first and foremost we must develop a proper view of God. If we don't see God in his rightful place, everything else is going to kind of fall apart. I think about Isaiah in Isaiah chapter number 6. In the year that King Uzziah died, Isaiah saw the Lord high and lifted up. His train did fill the temple. Heard the angels say, holy, holy, holy. Our God is holy. And as we see our God in his rightful place, as we understand and we develop that proper view of who God is, it really sets everything else in order. And if we do not have that established up front, if we do not develop that proper view of God, it's going to be very challenging for us to have a proper view of anything else in life. We must understand and acknowledge that he is King of Kings, and he is Lord of Lords, that he is the Lord God omnipotent, and he reigns, he rules. And we find that he's our Savior, he's our Redeemer, he is our Lord. We develop that proper view of God, we see him high, holy, and lifted up, and we find that, listen, the only way this morning for you to develop a proper view of God is going to be by getting into this book. You understand this morning that Congress isn't going to give you a proper view of who God is. You understand this morning that the entertainment business is not going to give you a proper view of who God is. You understand this morning that the school house is not going to give you a proper view of who God is. We find that as you look at society as a whole, they want to present God differently than how the Bible describes who God is. Let God be true and every man a liar. We find this morning that we must dig into the Word of God if we're going to develop a proper view of who God is. By the way, aren't you thankful that God revealed himself to us in his precious Word? What a joy! Without the Bible, I would not know that God loves me. Without the Bible, I would not know God's plan of redemption. Without the Bible, we could go on and on and on, because everything that I know about God has come from this precious book. It's true that the heavens declare the glory of God. The firmament showeth forth his handiwork. But those people that are in remote areas of the world that only see the heavens and they don't have this book, they understand that somebody had to do this, but they don't know who that somebody is. They can't know him intimately if they do not have the Word of God. And so we develop that proper view of who God is. After developing a proper view of who God is, number two, we would develop a proper view of self. I will never have a proper view of myself if I do not first have a proper view of God, because until I have that proper view of God, my view of self is skewed. We think of ourselves a lot better than we should. Amen? We really do. I am so thankful to be a child of God, to be joint heirs with Jesus Christ. What a joy! I'm heaven-bound, amen? But the reality is it's all because of His grace. The choir sang it this morning. It's only because of God's grace. And we begin to think about that proper view of myself. I think about the Apostle Paul in 1 Corinthians chapter number 15. Paul says this when he's acknowledging the work of God in his own life and in what God has done. You think about him declaring the gospel in the great resurrection chapter in 1 Corinthians 15, but in verse number 7 he says, after that he was seen of James, then of all the Apostles, and in verse number 8 he begins to speak about himself. He says, and last of all he was seen of me also, as of one born out of due time. For I am the least of the Apostles. Let him not meet to be called an Apostle, because I persecuted the church of God, but by the grace of God I am what I am. Man, that's good. We could read 2 Corinthians chapter number 12 and see Paul understanding how he's developing a proper view of himself. I think about what Paul says in 1 Timothy 1 in verse number 15, and again we've looked at this verse in previous messages, but the reality in 1 Timothy 1 and verse number 15 is that Paul says this is a faithful saying and worthy of all acceptation that Christ Jesus came into the world to save sinners. By the way, aren't you thankful for for that.\" But then Paul says this, \"...of whom I am chief.\" Wow, that's a good view of self. I understand I'm not going to go anywhere and give a self-esteem talk and really help people with that kind of a message, but it's all about God, it's all about God. Paul says, \"...I was a sinner in need of a Savior, and that was my greatest need. And Christ Jesus came into the world to save sinners, of whom I am chief.\" What a joy. We develop that proper view of God, we develop that proper view of self, and then I believe we must, if you are going to have this strategic plan to get from Acts 20 to 2 Timothy 4, we must develop an eternal perspective. So often I feel like we, if we're not careful, we can get so bogged down with the temporal things. And I understand that we live within the constraints of time, but one day time is going to be no more. And eternity is our future. And that little hyphen or dash on the headstone between the year of birth and the year of death, that's just this long in light of eternity. It's just a vapor, as James says, that appeareth for a little time and then vanisheth away. And we think about developing this eternal perspective, Paul says this in 2 Corinthians chapter number 4, we're familiar with this declaration. He tells us, it's interesting, you think about Paul and all of the things that he encountered and all of the opposition in which he faced as he sought to serve the Lord, and he talks about these things and he refers to them this way in 2 Corinthians 4 and verse number 17. He says, for our light affliction, which is but for a moment. Every time I read verse 17 of 2 Corinthians 4, I wonder how Paul has the perspective that he has, because when you read the life of Paul, if I were going to describe it, I wouldn't describe it as a light affliction. I'm just being honest. And especially if I was writing about my own problems, I wouldn't write it as a light affliction. But he's writing on the inspiration of the Holy Spirit of God, and he believes this, no doubt. He's seeking to communicate truth to these that he's ministering to. And he says, but which is, which is but for a moment. You know, it seems like when Paul saw God saved, his troubles started. And he goes on the missionary journey, and the troubles follow him. And he's kicked out, and he's beaten, and he's stoned, and he's shipwrecked, and he talks about all these things that he encountered. And it just seems like just issue after issue. And Paul says it's a light affliction, and it's just for a moment. Notice why. It says, worketh for us a far more exceeding and eternal weight of glory, while we look not at the things which are seen, but of the things which are not seen. For the things which are not seen are temporal, but the things which are not seen are eternal. Oh, that God would help us to develop a proper view, an eternal perspective, a proper view of who God is, a proper view of who we are, but then that eternal perspective that we're not just so constrained to this life, but we're constantly aware of eternity. You've heard me say it before. There's so many today, and I understand it. There's so many today that are focused on retirement planning, and it's something that we deal with in our society, and it's something that we hear from HR folks, and so on and so forth. And there are folks that, listen, there are organizations that exist today just for the purpose of retirement planning. And if we're not careful, even as the people of God, we will spend more time and more focus on retirement planning than we will on eternity planning. And the reality is that retirement is not certain, but eternity is. The person that purchased and owned this piece of property that's adjacent to our property, they bought that property in 1978 for, like, $6,500. Man, we should have bought it, amen? Let's retire and build a house on that property. You guys see a house out there? There's no house. You know why? She never retired. She died. I don't know her, never met her, but she died. She never retired. But that was the purpose of buying the piece of property. There are people today, listen, I think it's important to be prudent, to think about the future. There are biblical truths that we must look to and understand that, but we must not get out of balance. We must maintain that eternal perspective. Number four, this strategic plan. I'm going to develop a proper view of who God is, a proper view of myself, an eternal perspective. I would say this, we must regularly remind ourselves of the goal. What's our purpose? When I worked at Sikorsky, we had regular reminders of what our goal was. We had weekly meetings. We had monthly meetings. We understood what our stated objectives were and what it was that we're trying to accomplish, and they were always before us, and we had something that we called ACE, Achieving Competitive Excellence. Some of you are familiar with Six Sigma. It's something that's in the corporate world, and it's very similar to this thing that we had at Sikorsky, Achieving Competitive Excellence, and so we would have these goals regularly before us, and we'd have the metrics. How are we doing with reaching our goals? What are the metrics telling us? I believe that as a child of God, if my stated purpose is to finish my course with joy, if I want to finish with no regrets, I better be reminding myself of what my goal is, what my purpose is. Why? Because if I'm not careful, I can get distracted from what my purpose is, and I begin to regularly remind myself. Think about what Paul says. Let's look at a couple of verses in 1 Corinthians 9. Notice what Paul says here in 1 Corinthians 9. He understood the responsibility that had been given to him. In fact, in verse 16 of 1 Corinthians 9, he shares that responsibility. He says, For though I preach the gospel, I have nothing to glory of. For necessity is laid upon me, yea, woe is unto me if I preach not the gospel. Look at verse 23. And this I do for the gospel's sake, that I might be partaker thereof with you. Know ye not that they which run in a race run all, but one receiveth the prize? So run that ye may obtain. And every man that striveth for the mastery is temperate in all things. Now they do it to obtain a corruptible crown, but we, an incorruptible. We're going to stand before Jesus Christ one day, absolutely. Every single person upon this earth will stand before Jesus Christ one day. Now, I'm thankful as a saved person that the second death has no power over me, and I will not stand at the great white throne judgment, but I'll stand at the bema seat of Christ. And if you're saved this morning, so will you. And Paul is saying, we do it, listen, they're running to win. By the way, that's how I grew up, you play to win. No participation trophies, just play to win. They do it to obtain a corruptible crown, a wreath of evergreen, but we, an incorruptible. You know what we're going to do with those crowns? We're not going to walk around in glory and say, look at these crowns I have. You read Revelation, we're going to cast them at the throne. Amen? Notice what he says in the book of Philippians, turn there if you will, Philippians chapter number three. I want you to see that Paul, as he's said in Acts chapter number 20 to these leaders of the church at Ephesus, I have this desire, none of these things move me, neither count I my life dear unto myself. He says, but I might finish my course with joy. If I'm going to do that, if that's my stated purpose, I must have a strategic plan. And now he's writing to the believers in Philippi and he's reminding as he's writing them, I believe it also serves as a reminder to himself as to what his stated purpose is. Notice in verse number 12, the Bible says, not as though I had already attained, either were already perfect, but I follow after. With that, I may apprehend that for which also I am apprehended of Christ Jesus. Brethren, I count not myself to have apprehended, but this one thing I do, forgetting those things which are behind and reaching forth unto those things which are before, I press toward the mark for the prize of the high calling of God in Christ Jesus. Wow. A powerful reminder, not only a challenge to the believers at Philippi, but a reminder for himself. In 2 Timothy 2, I read verse 2 already, where Paul is instructing Timothy to this truth, this pattern of discipleship. He then tells Timothy that he's a good soldier, that he's to endure hardness as a good soldier of Jesus Christ. Notice what he says, no man that woreth, in 2 Timothy 2 and verse number 4, entangleth himself with the affairs of this life, and then notice the statement, that he may please him who hath chosen him to be a soldier. I want to please him. You know what happens in life is sometimes we get so busy trying to please other people. If we just set out our goal to please Jesus, the reality is that if somebody else isn't pleased with our life but Jesus is, that's okay. I'd much rather Jesus be pleased with my life than someone else be pleased with my life, and I certainly don't want you to be pleased with my life and Jesus not to be pleased with my life. Amen? And so we find that I believe that as Paul is used of God to write these challenges to these believers, they also serve as a reminder to himself. Number five, simple, keep your eyes on Jesus. Hebrews 12, looking unto Jesus, the author and finisher of our faith. You know, it helps us when we keep our eyes on Jesus to avoid distractions. How many of you know there are a lot of distractions in the world today? How many of you ever drive on the highway and you see some distracted drivers? Yeah? I had this guy the other day, Holly was with me, she's down in the nursery. This guy was all over the road, man. You know why he was all over the road? Because he was doing this right here. Driving me crazy. So I got up next to him and I blew my horn, pow, startled that guy. I wish I had one of those, brrr, that'd be awesome. I'd probably go to jail, man. I'm not even joking. I'd try to get my truck outfitted with one of them bad boys, that'd be great. But I got up next to that guy and I blew the horn, why? I really wasn't mad at him, he just needed to put his phone down. Stop being distracted, right? Distracted drivers are dangerous. You know what? Distractions are dangerous for us, for finishing our goal, reaching that stated purpose, that I might finish with joy, that I might finish with no regrets. All of a sudden there are distractions in life and I find myself over here doing this and it has nothing to do with what my stated purpose was. How many of you ever told your child to clean their room? And then all of a sudden you go in there and they're playing with some kind of toy. What did I tell you to do? What was the purpose of you being sent to your room? To clean your room. Pierre's smiling. He got two boys, amen? Ari came in here. This is just a side note, it'll only take a minute. I'm going to chase the rabbit. I'm going to kill him and I'm going to get back to the message. Ari came in here Friday night for the rehearsal and he had a gun, this dart gun, not a really dart gun, what's it called? A Nerf gun, a Nerf gun. And he had a wristband with all kinds of extra Nerf bullets, it was cool. And so I went to Ari and I said, listen, tomorrow at the wedding when Evan tries to kiss Juliana, you just unload on him. Just unload. And Pierre and Kimberly are like, what are you doing? I'm like, it'd be awesome, man. And so Ari comes in here yesterday for the wedding and I'm like, where's your gun? Pierre and Kimberly are like, right? I can just see it. Ari's like, pastor said so, right? Distractions, distractions, listen, distractions abound. I think about Peter. He said, I go fishing. Jesus showed up, John 21 if you want to read it. John says, it's Jesus because Jesus says, do you have any fish? Did you catch anything? Caught nothing. And Jesus gives them instruction, they get a great, great harvest of fish. John says, it's Jesus. And Peter, he gets out there and he gets to the Lord. And Jesus, after they have some food, just begins to speak to Peter, Peter, do you love me? Peter, do you love me? Peter, do you love me? You know what Peter says? What about John? What's he going to do? It's not about John because Jesus said to Peter, follow me. Jesus said, follow me. And Jesus says, if I will that he lives until I come, what does that matter to you? Right? Then they all said, John's not going to die. That's not what Jesus said. But listen, we can be so easily distracted in life. And so if I have a stated purpose, I must develop a strategic plan. In closing, number three, a spectacular proclamation. We read it already by way of introduction, but turn to 2 Timothy chapter number four. Let me say this, Paul was not perfect and neither are you, neither am I. Paul's not perfect, only Jesus is perfect. However, Paul had a stated purpose for his life. He had developed a strategic plan for his life. And then he was able to come to the end of his life and make this spectacular proclamation that we read in 2 Timothy 4 in verses six and seven. He says, for I am now ready to be offered and the time of my departure is at hand. I have fought a good fight. I have finished my course. I have kept the faith. Notice in verse eight, henceforth, there is laid up for me a crown of righteousness. That's not pride. He's not being prideful in saying that. Which the Lord, the righteous judge, shall give me at that day, and not to me only, but unto all them also that love His appearing. That's a spectacular proclamation. You can read books that have been written about deathbed confessions. You can interact with people that have lived life and they get near the end of their life and their life is full of regrets. Sometimes you hear people say, I wish I would have, right? I wish I would have done this. I wish I would have done that. I wish I would have... But you come to that point where you're just moments from eternity and there's nothing you can do about it at that point. In a certain sense, it's too late. And so if I want to get from Acts 20 and verse number 24 to 2 Timothy chapter 4, verses six through eight, it's the middle of that strategic plan that is so critical. I understand that none of us are perfect, but I understand this morning that as I look at the truth of God's Word, that I want to get to the place where I can have this spectacular proclamation that God has enabled me to finish what He's called me to do, that He's enabled me to finish my course with joy, that I've kept the faith, that I finished strong, that I finished by pleasing the one for whom I live. To develop that strategic plan, developing that proper view of God and self and eternity and reminding myself and keeping my eyes on Jesus this morning, finish with no regrets. You say, well, the finish line is far away. If you think that way, it's unlikely that you will finish with no regrets because the reality is that the finish line may be closer than you think it is. It may be closer than you think it is. With God's help and by God's grace, we can have that same testimony that Paul has and we can have that spectacular proclamation that I finished. I did what God called me to do. I kept the faith and I'm going to receive a crown. Again, not pridefully speaking, just understanding what God has said in His Word. Finish with no regrets, let us pray. Father, how we love You. How we thank You for loving us. We thank You for Your precious Word. God, I pray this morning that You've used Your Word to help someone. The reality this morning is that none of us know exactly where we are in our race, how many days we actually have left upon this earth. Not only is our life a vapor, but Your return is imminent. God, I pray that You'd help us this morning to have this same. stated purpose of Paul. God, would you help us to develop a strategic plan in our lives that we may be able to make the same type of declaration, this spectacular proclamation of Paul. Help us, Lord. There's one that's present that's not sure of heaven. They've never trusted the Lord Jesus Christ as their personal Savior. God, I pray that today the Holy Spirit of God would convict them of their sin of Christ's righteousness and of judgment to come. I pray that before they would leave this place that they would get their salvation settled. I pray for every child of God. Would you help us, Lord, to develop this proper view, to have this strategic plan that we might finish with no regrets. As we have a few moments of invitation, I pray, God, that you'd move and work as only you can. Help us to take this time to do business with you, that we would truly allow you to have your way in our lives, that we'd leave here different than we arrived, that we'd be doers of the Word and not hearers only. We'll give you the glory for what you'll do, for it's in Christ's name we pray. Would you stand with us?",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 9.0,
      "text": " And for obvious reasons, perhaps, I've been reminded in recent days, recent months, of the brevity of life."
    },
    {
      "id": 1,
      "start": 9.0,
      "end": 13.0,
      "text": " And you say, Pastor, you're young. I do feel like I'm still young."
    },
    {
      "id": 2,
      "start": 13.0,
      "end": 17.0,
      "text": " But the reality is that just recently I celebrated my 42nd birthday."
    },
    {
      "id": 3,
      "start": 17.0,
      "end": 20.0,
      "text": " And you say, I wish I were 42. I understand."
    },
    {
      "id": 4,
      "start": 20.0,
      "end": 24.0,
      "text": " But here's what the psalmist says, that we spend our years as a tale that is told."
    },
    {
      "id": 5,
      "start": 24.0,
      "end": 27.0,
      "text": " The days of our years are three score years and ten."
    },
    {
      "id": 6,
      "start": 27.0,
      "end": 38.0,
      "text": " And so if I have 70 or 80 years, I've already expended half of those."
    },
    {
      "id": 7,
      "start": 38.0,
      "end": 41.0,
      "text": " And some of you said, I'm living on borrowed time. Amen."
    },
    {
      "id": 8,
      "start": 41.0,
      "end": 46.0,
      "text": " And the reality, though, is when you see your daughter married,"
    },
    {
      "id": 9,
      "start": 46.0,
      "end": 50.0,
      "text": " it makes you all of a sudden think, man, life is going fast."
    },
    {
      "id": 10,
      "start": 50.0,
      "end": 54.0,
      "text": " And I can remember bringing Juliana home from the hospital."
    },
    {
      "id": 11,
      "start": 54.0,
      "end": 59.0,
      "text": " And I can remember walking through our house at the time and showing her all of the rooms"
    },
    {
      "id": 12,
      "start": 59.0,
      "end": 62.0,
      "text": " and acting like she could understand what I was telling her"
    },
    {
      "id": 13,
      "start": 62.0,
      "end": 65.0,
      "text": " and telling her where her bedroom would be and so on and so forth."
    },
    {
      "id": 14,
      "start": 65.0,
      "end": 69.0,
      "text": " And then I remember the first evening, and Josh and Aaron, not to discourage you,"
    },
    {
      "id": 15,
      "start": 69.0,
      "end": 73.0,
      "text": " but I remember the first evening at home, she didn't sleep a wink."
    },
    {
      "id": 16,
      "start": 73.0,
      "end": 78.0,
      "text": " And it was just cry, cry, cry. And she had slept good at the hospital."
    },
    {
      "id": 17,
      "start": 78.0,
      "end": 82.0,
      "text": " And Holly was just not getting any sleep whatsoever."
    },
    {
      "id": 18,
      "start": 82.0,
      "end": 86.0,
      "text": " And there was a good husband. I said, I got it."
    },
    {
      "id": 19,
      "start": 86.0,
      "end": 92.0,
      "text": " Blake, amen, right? I said, I got it. I can handle this."
    },
    {
      "id": 20,
      "start": 92.0,
      "end": 97.0,
      "text": " And I took Juliana out in the living room. And I bet you, I mean, I don't think it was five minutes."
    },
    {
      "id": 21,
      "start": 97.0,
      "end": 100.0,
      "text": " Five minutes is dad time for sure."
    },
    {
      "id": 22,
      "start": 100.0,
      "end": 104.0,
      "text": " And I went back into the room and Holly sat straight up in the bed and she said, what's wrong?"
    },
    {
      "id": 23,
      "start": 104.0,
      "end": 107.0,
      "text": " And I said, I don't know. I think she needs to go back to the hospital."
    },
    {
      "id": 24,
      "start": 107.0,
      "end": 111.0,
      "text": " And that was my medical training kicking into high gear."
    },
    {
      "id": 25,
      "start": 111.0,
      "end": 115.0,
      "text": " And there's no other option here. She must go back to the hospital."
    },
    {
      "id": 26,
      "start": 115.0,
      "end": 118.0,
      "text": " And obviously Holly was able to handle things."
    },
    {
      "id": 27,
      "start": 118.0,
      "end": 123.0,
      "text": " But the reality is that all of a sudden you start thinking about life and the brevity of life."
    },
    {
      "id": 28,
      "start": 123.0,
      "end": 127.0,
      "text": " And life is short. James tells us, what is your life?"
    },
    {
      "id": 29,
      "start": 127.0,
      "end": 130.0,
      "text": " It's a vapor that appears for a little time and then vanisheth away."
    },
    {
      "id": 30,
      "start": 130.0,
      "end": 134.0,
      "text": " As we're going to think about the just life in general,"
    },
    {
      "id": 31,
      "start": 134.0,
      "end": 139.0,
      "text": " and I begin to think about the New Testament and obviously having Acts 20,"
    },
    {
      "id": 32,
      "start": 139.0,
      "end": 141.0,
      "text": " we're going to look at a number of passages this morning."
    },
    {
      "id": 33,
      "start": 141.0,
      "end": 145.0,
      "text": " But I think about our life as God would use in the New Testament,"
    },
    {
      "id": 34,
      "start": 145.0,
      "end": 150.0,
      "text": " really as an analogy of our life, that of a race. It's likened to a race."
    },
    {
      "id": 35,
      "start": 150.0,
      "end": 153.0,
      "text": " We think about this analogy that God would use,"
    },
    {
      "id": 36,
      "start": 153.0,
      "end": 158.0,
      "text": " and we'd often say over the years that this race is more like a marathon than it is a sprint."
    },
    {
      "id": 37,
      "start": 158.0,
      "end": 161.0,
      "text": " But you think about a race and there's a finish line."
    },
    {
      "id": 38,
      "start": 161.0,
      "end": 166.0,
      "text": " And for us, we understand that's when we will take our last breath upon this earth"
    },
    {
      "id": 39,
      "start": 166.0,
      "end": 170.0,
      "text": " and see our Savior, and what a wonderful joy that will be."
    },
    {
      "id": 40,
      "start": 170.0,
      "end": 174.0,
      "text": " But the reality is that we don't know where the finish line is."
    },
    {
      "id": 41,
      "start": 174.0,
      "end": 179.0,
      "text": " We understand, as I've read there from Psalm 90, the 70 or 80 years."
    },
    {
      "id": 42,
      "start": 179.0,
      "end": 184.0,
      "text": " And yet we find that if we were to visit a cemetery, a graveyard today,"
    },
    {
      "id": 43,
      "start": 184.0,
      "end": 189.0,
      "text": " that you will find as you walk through those rows of headstones,"
    },
    {
      "id": 44,
      "start": 189.0,
      "end": 193.0,
      "text": " you will find a variety of ages of those that have deceased."
    },
    {
      "id": 45,
      "start": 193.0,
      "end": 200.0,
      "text": " And we find that though I may think at 42 years old that I have many years until I reach my finish line,"
    },
    {
      "id": 46,
      "start": 200.0,
      "end": 204.0,
      "text": " the fact of the matter is that my finish line could be before yours."
    },
    {
      "id": 47,
      "start": 204.0,
      "end": 209.0,
      "text": " I sat in the room of a lady that was dying with cancer several years ago,"
    },
    {
      "id": 48,
      "start": 209.0,
      "end": 213.0,
      "text": " and the doctors had told her it would just be a couple of days before she would leave this earth,"
    },
    {
      "id": 49,
      "start": 213.0,
      "end": 215.0,
      "text": " and her husband was lost."
    },
    {
      "id": 50,
      "start": 215.0,
      "end": 220.0,
      "text": " And I sat in that room with the husband and the wife and another family member,"
    },
    {
      "id": 51,
      "start": 220.0,
      "end": 225.0,
      "text": " and she had a testimony of salvation, the lady with cancer, but the husband was lost."
    },
    {
      "id": 52,
      "start": 225.0,
      "end": 227.0,
      "text": " And I looked at that man and I said,"
    },
    {
      "id": 53,
      "start": 227.0,
      "end": 233.0,
      "text": " you understand that the doctors have said that within just a few days your wife is going to pass from this earth,"
    },
    {
      "id": 54,
      "start": 233.0,
      "end": 239.0,
      "text": " but the reality, sir, is that you could possibly die before her."
    },
    {
      "id": 55,
      "start": 239.0,
      "end": 241.0,
      "text": " I don't have anything wrong."
    },
    {
      "id": 56,
      "start": 241.0,
      "end": 243.0,
      "text": " You know how many people go on the highway every day?"
    },
    {
      "id": 57,
      "start": 243.0,
      "end": 246.0,
      "text": " I don't think they have anything wrong."
    },
    {
      "id": 58,
      "start": 246.0,
      "end": 248.0,
      "text": " And bam, they're in eternity."
    },
    {
      "id": 59,
      "start": 248.0,
      "end": 253.0,
      "text": " So we think about this truth of our lives, and we think about seeking to reach that finish line,"
    },
    {
      "id": 60,
      "start": 253.0,
      "end": 257.0,
      "text": " and really some have said it this way,"
    },
    {
      "id": 61,
      "start": 257.0,
      "end": 262.0,
      "text": " finishing is more important, or how you finish is more important than how you start."
    },
    {
      "id": 62,
      "start": 262.0,
      "end": 267.0,
      "text": " I never ran in track. It was never my, I don't have the build for track, obviously."
    },
    {
      "id": 63,
      "start": 267.0,
      "end": 271.0,
      "text": " I played baseball and football, but I understood some things about track and field,"
    },
    {
      "id": 64,
      "start": 271.0,
      "end": 273.0,
      "text": " and one of the things, you're going to run a race,"
    },
    {
      "id": 65,
      "start": 273.0,
      "end": 277.0,
      "text": " you know, the guy that starts out 100 miles an hour to start,"
    },
    {
      "id": 66,
      "start": 277.0,
      "end": 281.0,
      "text": " he may run out of steam pretty quick."
    },
    {
      "id": 67,
      "start": 281.0,
      "end": 287.0,
      "text": " And we look at the Christian life, and as I consider the remarks of Paul here in Acts chapter number 20,"
    },
    {
      "id": 68,
      "start": 287.0,
      "end": 291.0,
      "text": " as he's speaking to the leaders of the church at Ephesus,"
    },
    {
      "id": 69,
      "start": 291.0,
      "end": 296.0,
      "text": " and he's called them together to where he is as he's on his way to Jerusalem,"
    },
    {
      "id": 70,
      "start": 296.0,
      "end": 300.0,
      "text": " and he's going to give them some parting statements, he's going to seek to encourage them,"
    },
    {
      "id": 71,
      "start": 301.0,
      "end": 307.0,
      "text": " but Paul makes a statement in Acts 20 and verse 24 that really just grabs my attention."
    },
    {
      "id": 72,
      "start": 307.0,
      "end": 309.0,
      "text": " And the Bible tells us that Paul says,"
    },
    {
      "id": 73,
      "start": 309.0,
      "end": 316.0,
      "text": " but none of these things move me, neither count I my life dear unto myself,"
    },
    {
      "id": 74,
      "start": 316.0,
      "end": 321.0,
      "text": " so that I might finish my course with joy."
    },
    {
      "id": 75,
      "start": 321.0,
      "end": 325.0,
      "text": " And the ministry which I have received of the Lord Jesus"
    },
    {
      "id": 76,
      "start": 325.0,
      "end": 330.0,
      "text": " to testify the gospel of the grace of God."
    },
    {
      "id": 77,
      "start": 330.0,
      "end": 333.0,
      "text": " As Paul is speaking to these leaders of the church at Ephesus,"
    },
    {
      "id": 78,
      "start": 333.0,
      "end": 341.0,
      "text": " he is going to tell them of his own desire that he wants to finish his course with joy."
    },
    {
      "id": 79,
      "start": 341.0,
      "end": 344.0,
      "text": " And I read that statement here in Acts 20 and verse number 24,"
    },
    {
      "id": 80,
      "start": 344.0,
      "end": 347.0,
      "text": " and many of us are familiar with 2 Timothy chapter number 4,"
    },
    {
      "id": 81,
      "start": 347.0,
      "end": 350.0,
      "text": " turn over there if you will, in 2 Timothy chapter number 4,"
    },
    {
      "id": 82,
      "start": 350.0,
      "end": 354.0,
      "text": " and I want you to notice that Paul now is writing to his son in the faith,"
    },
    {
      "id": 83,
      "start": 354.0,
      "end": 358.0,
      "text": " and of course if we could have the picture of a race and really this marathon,"
    },
    {
      "id": 84,
      "start": 358.0,
      "end": 363.0,
      "text": " we find that Paul is seeking to instruct Timothy and to give Timothy,"
    },
    {
      "id": 85,
      "start": 363.0,
      "end": 367.0,
      "text": " really kind of pass that baton, if you will, to Timothy."
    },
    {
      "id": 86,
      "start": 367.0,
      "end": 370.0,
      "text": " In fact, in the second chapter of the book of 2 Timothy,"
    },
    {
      "id": 87,
      "start": 370.0,
      "end": 374.0,
      "text": " he says, the things that thou hast heard of me among many witnesses,"
    },
    {
      "id": 88,
      "start": 374.0,
      "end": 380.0,
      "text": " the same commit thou to faithful men who shall be able to teach others also."
    },
    {
      "id": 89,
      "start": 380.0,
      "end": 385.0,
      "text": " Though Paul's race was nearing the end, his life here on earth was nearing the end,"
    },
    {
      "id": 90,
      "start": 385.0,
      "end": 388.0,
      "text": " he was seeking to invest and influence Timothy,"
    },
    {
      "id": 91,
      "start": 388.0,
      "end": 392.0,
      "text": " who would still continue to run his leg of the race, if you will,"
    },
    {
      "id": 92,
      "start": 392.0,
      "end": 395.0,
      "text": " that he would have that responsibility."
    },
    {
      "id": 93,
      "start": 395.0,
      "end": 399.0,
      "text": " But we come to the fourth chapter, and Paul says this in verse number 6,"
    },
    {
      "id": 94,
      "start": 399.0,
      "end": 401.0,
      "text": " under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 95,
      "start": 401.0,
      "end": 404.0,
      "text": " for I am now ready to be offered."
    },
    {
      "id": 96,
      "start": 404.0,
      "end": 407.0,
      "text": " The time of my departure is at hand."
    },
    {
      "id": 97,
      "start": 407.0,
      "end": 410.0,
      "text": " Notice when he says, I have fought a good fight,"
    },
    {
      "id": 98,
      "start": 410.0,
      "end": 413.0,
      "text": " I have finished my course,"
    },
    {
      "id": 99,
      "start": 413.0,
      "end": 417.0,
      "text": " I have kept the faith."
    },
    {
      "id": 100,
      "start": 417.0,
      "end": 420.0,
      "text": " As I look at the statement in verse number 7,"
    },
    {
      "id": 101,
      "start": 420.0,
      "end": 423.0,
      "text": " he says, I have finished my course,"
    },
    {
      "id": 102,
      "start": 423.0,
      "end": 425.0,
      "text": " and then he says, I have kept the faith."
    },
    {
      "id": 103,
      "start": 425.0,
      "end": 429.0,
      "text": " I really believe that those two statements are really dependent upon one another,"
    },
    {
      "id": 104,
      "start": 429.0,
      "end": 433.0,
      "text": " and they really reveal to us what we find in Acts 20 and verse number 24,"
    },
    {
      "id": 105,
      "start": 433.0,
      "end": 438.0,
      "text": " when he says that I might finish my course with joy."
    },
    {
      "id": 106,
      "start": 438.0,
      "end": 442.0,
      "text": " The keeping the faith was the joyful part of finishing his course."
    },
    {
      "id": 107,
      "start": 442.0,
      "end": 448.0,
      "text": " And we find here this morning that as we look at the statement of Paul in Acts 20 and verse number 24,"
    },
    {
      "id": 108,
      "start": 448.0,
      "end": 452.0,
      "text": " and we read 2 Timothy 4 and verses 6 and 7,"
    },
    {
      "id": 109,
      "start": 452.0,
      "end": 454.0,
      "text": " the big question in my mind is,"
    },
    {
      "id": 110,
      "start": 454.0,
      "end": 462.0,
      "text": " how do we get from Acts 20 and 24 to 2 Timothy 4, 6 and 7?"
    },
    {
      "id": 111,
      "start": 462.0,
      "end": 470.0,
      "text": " How do we get from, I want to finish my course with joy,"
    },
    {
      "id": 112,
      "start": 470.0,
      "end": 474.0,
      "text": " to, I have finished."
    },
    {
      "id": 113,
      "start": 474.0,
      "end": 476.0,
      "text": " I've kept the faith."
    },
    {
      "id": 114,
      "start": 476.0,
      "end": 477.0,
      "text": " How do we get there?"
    },
    {
      "id": 115,
      "start": 477.0,
      "end": 481.0,
      "text": " Let me say this, right at the beginning, it's not going to happen by chance."
    },
    {
      "id": 116,
      "start": 481.0,
      "end": 483.0,
      "text": " It's not going to happen on accident."
    },
    {
      "id": 117,
      "start": 483.0,
      "end": 488.0,
      "text": " And I've titled the message, Finish with No Regrets."
    },
    {
      "id": 118,
      "start": 488.0,
      "end": 490.0,
      "text": " Finish with No Regrets."
    },
    {
      "id": 119,
      "start": 490.0,
      "end": 494.0,
      "text": " I want you to think about this if you're taking notes this morning from Acts 20 and verse number 24."
    },
    {
      "id": 120,
      "start": 494.0,
      "end": 497.0,
      "text": " I would say this, there is a stated purpose."
    },
    {
      "id": 121,
      "start": 497.0,
      "end": 498.0,
      "text": " A stated purpose."
    },
    {
      "id": 122,
      "start": 498.0,
      "end": 500.0,
      "text": " Paul was very clear on what his purpose was."
    },
    {
      "id": 123,
      "start": 500.0,
      "end": 504.0,
      "text": " You think about people today that are trying to find purpose in their life."
    },
    {
      "id": 124,
      "start": 504.0,
      "end": 507.0,
      "text": " They're looking all over the place of, why am I here?"
    },
    {
      "id": 125,
      "start": 507.0,
      "end": 508.0,
      "text": " What am I supposed to do?"
    },
    {
      "id": 126,
      "start": 508.0,
      "end": 509.0,
      "text": " What is the purpose?"
    },
    {
      "id": 127,
      "start": 509.0,
      "end": 513.0,
      "text": " And Paul has a stated purpose in Acts 20 and verse number 24."
    },
    {
      "id": 128,
      "start": 513.0,
      "end": 515.0,
      "text": " He said, but none of these things move me,"
    },
    {
      "id": 129,
      "start": 515.0,
      "end": 518.0,
      "text": " neither count I my life dear unto myself."
    },
    {
      "id": 130,
      "start": 518.0,
      "end": 522.0,
      "text": " And then he makes the statement that we've used and really focusing on this morning,"
    },
    {
      "id": 131,
      "start": 522.0,
      "end": 526.0,
      "text": " that I might finish my course with joy."
    },
    {
      "id": 132,
      "start": 526.0,
      "end": 529.0,
      "text": " That's a great purpose statement, is it not?"
    },
    {
      "id": 133,
      "start": 529.0,
      "end": 533.0,
      "text": " You think about the life of a believer, someone that's been born again,"
    },
    {
      "id": 134,
      "start": 533.0,
      "end": 536.0,
      "text": " someone that's been saved by the wonderful grace of God,"
    },
    {
      "id": 135,
      "start": 536.0,
      "end": 539.0,
      "text": " that we would have as our purpose statement,"
    },
    {
      "id": 136,
      "start": 539.0,
      "end": 541.0,
      "text": " that we seek to bring honor and glory to God,"
    },
    {
      "id": 137,
      "start": 541.0,
      "end": 545.0,
      "text": " that we seek to finish our course with joy,"
    },
    {
      "id": 138,
      "start": 545.0,
      "end": 549.0,
      "text": " that we would do all that God has called us to do."
    },
    {
      "id": 139,
      "start": 549.0,
      "end": 551.0,
      "text": " That's a great mission statement."
    },
    {
      "id": 140,
      "start": 551.0,
      "end": 552.0,
      "text": " It's a stated purpose."
    },
    {
      "id": 141,
      "start": 552.0,
      "end": 556.0,
      "text": " I find that Paul doesn't just say, yeah, I want to finish."
    },
    {
      "id": 142,
      "start": 556.0,
      "end": 557.0,
      "text": " He says, no."
    },
    {
      "id": 143,
      "start": 557.0,
      "end": 562.0,
      "text": " He said that I might finish my course with joy."
    },
    {
      "id": 144,
      "start": 562.0,
      "end": 568.0,
      "text": " The reality is that each of us will take a final breath."
    },
    {
      "id": 145,
      "start": 568.0,
      "end": 570.0,
      "text": " As Brother Mershon often says,"
    },
    {
      "id": 146,
      "start": 570.0,
      "end": 573.0,
      "text": " I'm looking for the upper taker, not the undertaker."
    },
    {
      "id": 147,
      "start": 573.0,
      "end": 576.0,
      "text": " I'd love to hear the trumpet of the Lord sound"
    },
    {
      "id": 148,
      "start": 576.0,
      "end": 581.0,
      "text": " and to be transported and meet the Lord in the air at the rapture, amen?"
    },
    {
      "id": 149,
      "start": 581.0,
      "end": 584.0,
      "text": " Wouldn't that be wonderful?"
    },
    {
      "id": 150,
      "start": 584.0,
      "end": 589.0,
      "text": " But the reality is that if the Lord does not come in our lifetime,"
    },
    {
      "id": 151,
      "start": 589.0,
      "end": 592.0,
      "text": " we're going to take our final breath one day."
    },
    {
      "id": 152,
      "start": 592.0,
      "end": 594.0,
      "text": " And Paul says, I want to finish with joy."
    },
    {
      "id": 153,
      "start": 594.0,
      "end": 597.0,
      "text": " I think about this stated purpose, not only finishing with joy,"
    },
    {
      "id": 154,
      "start": 597.0,
      "end": 600.0,
      "text": " but I really get the idea of finishing strong."
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 605.579999923706,
      "text": " says in verse 24, that I might finish my course with joy and the ministry which I"
    },
    {
      "id": 1,
      "start": 605.579999923706,
      "end": 610.2600002288818,
      "text": " have received of the Lord Jesus to testify the gospel of the grace of God."
    },
    {
      "id": 2,
      "start": 610.2600002288818,
      "end": 614.8599996566772,
      "text": " He understood that he'd been given a ministry, been given a responsibility, and"
    },
    {
      "id": 3,
      "start": 614.8599996566772,
      "end": 618.1200008392334,
      "text": " Paul says I want to finish. And I don't want to just finish, I want to finish"
    },
    {
      "id": 4,
      "start": 618.1200008392334,
      "end": 622.7800006866455,
      "text": " with joy, but I think also about this aspect of finishing strong. You think"
    },
    {
      "id": 5,
      "start": 622.7800006866455,
      "end": 626.2999992370605,
      "text": " about a race and you think about the the the participants as they're running a"
    },
    {
      "id": 6,
      "start": 626.2999992370605,
      "end": 630.3999996185303,
      "text": " race. They want to kick it in for that last period of time. They want to finish"
    },
    {
      "id": 7,
      "start": 630.3999996185303,
      "end": 636.0,
      "text": " strong as they're reaching that finish line. They're gonna give it all. They"
    },
    {
      "id": 8,
      "start": 636.0,
      "end": 640.0400009155273,
      "text": " don't want to finish the race and be like I could go run a couple more miles."
    },
    {
      "id": 9,
      "start": 640.0400009155273,
      "end": 647.560001373291,
      "text": " No, I want to be poured out. I want to leave it all. I want to finish strong. Not"
    },
    {
      "id": 10,
      "start": 647.560001373291,
      "end": 650.9599990844727,
      "text": " necessarily talking about physical strength, though in a race we might talk"
    },
    {
      "id": 11,
      "start": 650.9599990844727,
      "end": 655.7999992370605,
      "text": " about physical strength, but this morning we think about the illustration of the"
    },
    {
      "id": 12,
      "start": 655.7999992370605,
      "end": 659.7799987792969,
      "text": " race, the analogy that God would use really of our spiritual life, that we"
    },
    {
      "id": 13,
      "start": 659.7799987792969,
      "end": 665.3000030517578,
      "text": " would finish with spiritual strength. That we would pray and ask God to give"
    },
    {
      "id": 14,
      "start": 665.3000030517578,
      "end": 670.5599975585938,
      "text": " us the the spiritual strength that we need. That we could be strong in the Lord"
    },
    {
      "id": 15,
      "start": 670.5599975585938,
      "end": 676.4599990844727,
      "text": " and in the power of His might. That in the evil day that we could stand, not in"
    },
    {
      "id": 16,
      "start": 676.4599990844727,
      "end": 681.8199996948242,
      "text": " our own strength, not our own power, but in God's strength and in God's power. And"
    },
    {
      "id": 17,
      "start": 681.9599990844727,
      "end": 686.879997253418,
      "text": " Paul says I want to finish my course. I want to finish with joy. I want to finish"
    },
    {
      "id": 18,
      "start": 686.879997253418,
      "end": 693.0,
      "text": " with strength. I have this idea that I'd like to finish pleasing the one for whom"
    },
    {
      "id": 19,
      "start": 693.0,
      "end": 700.0400009155273,
      "text": " I live. You think about those that run a race. Physically speaking, many times"
    },
    {
      "id": 20,
      "start": 700.0400009155273,
      "end": 704.3199996948242,
      "text": " there are spectators. There are people that are applauding as they get to the"
    },
    {
      "id": 21,
      "start": 704.3199996948242,
      "end": 708.8199996948242,
      "text": " finish line. There may be medals that are presented to those that finished in a"
    },
    {
      "id": 22,
      "start": 708.8199996948242,
      "end": 715.1800003051758,
      "text": " medal category. But I want to finish my race. I want to finish my life pleasing"
    },
    {
      "id": 23,
      "start": 715.1800003051758,
      "end": 723.9400024414062,
      "text": " the one who died for me. The one for whom we live. And we find that Paul is"
    },
    {
      "id": 24,
      "start": 723.9400024414062,
      "end": 729.6999969482422,
      "text": " recognizing that the Lord Jesus Christ saved him, gave him a ministry, and I"
    },
    {
      "id": 25,
      "start": 729.6999969482422,
      "end": 735.3000030517578,
      "text": " believe that he took the responsibility seriously. He clearly indicates and he"
    },
    {
      "id": 26,
      "start": 735.3000030517578,
      "end": 741.2599945068359,
      "text": " wants others to know what his desire is. He's not keeping this private. He's"
    },
    {
      "id": 27,
      "start": 741.2599945068359,
      "end": 746.7400054931641,
      "text": " saying publicly to these leaders of the church at Ephesus, he says, listen, I want"
    },
    {
      "id": 28,
      "start": 746.7400054931641,
      "end": 752.8600006103516,
      "text": " to finish my course with joy. I want to do what God's called me to do. A stated"
    },
    {
      "id": 29,
      "start": 752.8600006103516,
      "end": 759.8200073242188,
      "text": " purpose. A stated purpose is important. Any successful corporation or any"
    },
    {
      "id": 30,
      "start": 759.8600006103516,
      "end": 765.1399993896484,
      "text": " corporation who desires to be successful is going to have a mission statement."
    },
    {
      "id": 31,
      "start": 765.1399993896484,
      "end": 770.3399963378906,
      "text": " When they have that mission statement, it clearly sets what the goal, the objective"
    },
    {
      "id": 32,
      "start": 770.3399963378906,
      "end": 774.5,
      "text": " is. What is their purpose? Why are they in business? What are they seeking to"
    },
    {
      "id": 33,
      "start": 774.5,
      "end": 779.7400054931641,
      "text": " accomplish? And as a child of God, when we consider this stated purpose this"
    },
    {
      "id": 34,
      "start": 779.7400054931641,
      "end": 783.3800048828125,
      "text": " morning, it's good for us to have a stated purpose. It'd be good for everyone"
    },
    {
      "id": 35,
      "start": 783.3800048828125,
      "end": 787.8999938964844,
      "text": " to leave here and say, I want to finish my course with joy. But the truth of the"
    },
    {
      "id": 36,
      "start": 787.8999938964844,
      "end": 794.5399932861328,
      "text": " matter is that a stated purpose requires, number two, a strategic plan because it"
    },
    {
      "id": 37,
      "start": 794.5399932861328,
      "end": 800.9799957275391,
      "text": " will not happen by chance. It will not happen on accident that we finish with"
    },
    {
      "id": 38,
      "start": 800.9799957275391,
      "end": 806.9400024414062,
      "text": " joy, that we finish with no regrets. We think about the purpose that we"
    },
    {
      "id": 39,
      "start": 806.9400024414062,
      "end": 811.4600067138672,
      "text": " would stay as Paul did in Acts 20 and verse 24. It's important that we would"
    },
    {
      "id": 40,
      "start": 811.4600067138672,
      "end": 816.4199981689453,
      "text": " have such a purpose. It's imperative, however, that we would have a plan that"
    },
    {
      "id": 41,
      "start": 816.4199981689453,
      "end": 822.0200042724609,
      "text": " would help us get to that desired end. That's why we read Acts 20 and then read"
    },
    {
      "id": 42,
      "start": 822.0200042724609,
      "end": 825.8600006103516,
      "text": " 2 Timothy chapter number 4 because we find that it's in Acts 20 that Paul"
    },
    {
      "id": 43,
      "start": 825.8600006103516,
      "end": 831.1799926757812,
      "text": " makes this declaration, but we find that it's in 2 Timothy 4. He comes to the"
    },
    {
      "id": 44,
      "start": 831.1799926757812,
      "end": 835.6199951171875,
      "text": " end of his life and he says, I finished. I've kept the faith. How did he get there?"
    },
    {
      "id": 45,
      "start": 835.6199951171875,
      "end": 841.6199951171875,
      "text": " How did he get there? As we begin to develop a strategic plan for our own lives, we"
    },
    {
      "id": 46,
      "start": 841.6199951171875,
      "end": 845.6600036621094,
      "text": " remember and we're mindful of the fact that we have an enemy who wants to"
    },
    {
      "id": 47,
      "start": 845.6999969482422,
      "end": 849.9400024414062,
      "text": " devour us. We have an enemy that wants to destroy us. We have an enemy that wants"
    },
    {
      "id": 48,
      "start": 849.9400024414062,
      "end": 855.3000030517578,
      "text": " to hinder us from doing what God's called us to do. In fact, Paul says it"
    },
    {
      "id": 49,
      "start": 855.3000030517578,
      "end": 858.9400024414062,
      "text": " this way to the believers in Galatia. Those were the churches that were"
    },
    {
      "id": 50,
      "start": 858.9400024414062,
      "end": 863.2999877929688,
      "text": " established during that first missionary journey. What a joy to see how the"
    },
    {
      "id": 51,
      "start": 863.2999877929688,
      "end": 868.260009765625,
      "text": " church at Antioch sent out Paul and Barnabas and they went. And you think"
    },
    {
      "id": 52,
      "start": 868.260009765625,
      "end": 871.7000122070312,
      "text": " about those four churches that were established in those cities, but Paul"
    },
    {
      "id": 53,
      "start": 871.8200073242188,
      "end": 879.0199890136719,
      "text": " says, ye did run well. Who did hinder you that you should not obey the truth? In"
    },
    {
      "id": 54,
      "start": 879.0199890136719,
      "end": 884.8200073242188,
      "text": " Galatians 5 and verse number 7. See, there's an enemy and the enemy wants to"
    },
    {
      "id": 55,
      "start": 884.8200073242188,
      "end": 891.739990234375,
      "text": " hinder us. The enemy wants to keep us from trying to reach that stated purpose,"
    },
    {
      "id": 56,
      "start": 891.739990234375,
      "end": 897.0599975585938,
      "text": " that goal, and we find it as we have the opportunity to develop a strategic plan"
    },
    {
      "id": 57,
      "start": 897.1000061035156,
      "end": 903.5400085449219,
      "text": " that God would help us to reach that stated purpose, to accomplish the"
    },
    {
      "id": 58,
      "start": 903.5400085449219,
      "end": 907.6600036621094,
      "text": " goal that we've stated. I have five thoughts for you on how we could develop"
    },
    {
      "id": 59,
      "start": 907.6600036621094,
      "end": 914.2200012207031,
      "text": " a strategic plan. This is not an exhaustive plan, just five thoughts, but I"
    },
    {
      "id": 60,
      "start": 914.2200012207031,
      "end": 919.0599975585938,
      "text": " think first and foremost we must develop a proper view of God. If we don't see God"
    },
    {
      "id": 61,
      "start": 919.0599975585938,
      "end": 923.9800109863281,
      "text": " in his rightful place, everything else is going to kind of fall apart. I think"
    },
    {
      "id": 62,
      "start": 923.9800109863281,
      "end": 928.8999938964844,
      "text": " about Isaiah in Isaiah chapter number 6. In the year that King Uzziah died, Isaiah saw"
    },
    {
      "id": 63,
      "start": 928.8999938964844,
      "end": 935.7799987792969,
      "text": " the Lord high and lifted up. His train did fill the temple. Heard the angels say,"
    },
    {
      "id": 64,
      "start": 935.7799987792969,
      "end": 943.739990234375,
      "text": " holy, holy, holy. Our God is holy. And as we see our God in his rightful place, as"
    },
    {
      "id": 65,
      "start": 943.739990234375,
      "end": 948.7000122070312,
      "text": " we understand and we develop that proper view of who God is, it really sets"
    },
    {
      "id": 66,
      "start": 948.7000122070312,
      "end": 953.5799865722656,
      "text": " everything else in order. And if we do not have that established up front, if we"
    },
    {
      "id": 67,
      "start": 953.5799865722656,
      "end": 957.6600036621094,
      "text": " do not develop that proper view of God, it's going to be very challenging for us"
    },
    {
      "id": 68,
      "start": 957.6600036621094,
      "end": 962.0199890136719,
      "text": " to have a proper view of anything else in life. We must understand and"
    },
    {
      "id": 69,
      "start": 962.0199890136719,
      "end": 967.3399963378906,
      "text": " acknowledge that he is King of Kings, and he is Lord of Lords, that he is the Lord"
    },
    {
      "id": 70,
      "start": 967.3399963378906,
      "end": 973.2999877929688,
      "text": " God omnipotent, and he reigns, he rules. And we find that he's our Savior, he's"
    },
    {
      "id": 71,
      "start": 973.2999877929688,
      "end": 978.3800048828125,
      "text": " our Redeemer, he is our Lord. We develop that proper view of God, we see him high,"
    },
    {
      "id": 72,
      "start": 978.3800048828125,
      "end": 983.4599914550781,
      "text": " holy, and lifted up, and we find that, listen, the only way this morning for you"
    },
    {
      "id": 73,
      "start": 983.4599914550781,
      "end": 988.3399963378906,
      "text": " to develop a proper view of God is going to be by getting into this book."
    },
    {
      "id": 74,
      "start": 988.3399963378906,
      "end": 992.260009765625,
      "text": " You understand this morning that Congress isn't going to give you a"
    },
    {
      "id": 75,
      "start": 992.260009765625,
      "end": 995.3399963378906,
      "text": " proper view of who God is. You understand this morning that the"
    },
    {
      "id": 76,
      "start": 995.3399963378906,
      "end": 999.1400146484375,
      "text": " entertainment business is not going to give you a proper view of who God is. You"
    },
    {
      "id": 77,
      "start": 999.1400146484375,
      "end": 1002.6199951171875,
      "text": " understand this morning that the school house is not going to give you a"
    },
    {
      "id": 78,
      "start": 1002.6199951171875,
      "end": 1008.1400146484375,
      "text": " proper view of who God is. We find that as you look at society as a whole, they"
    },
    {
      "id": 79,
      "start": 1008.1400146484375,
      "end": 1014.8599853515625,
      "text": " want to present God differently than how the Bible describes who God is. Let"
    },
    {
      "id": 80,
      "start": 1014.8599853515625,
      "end": 1021.8599853515625,
      "text": " God be true and every man a liar. We find this morning that we must dig into the"
    },
    {
      "id": 81,
      "start": 1021.8599853515625,
      "end": 1027.1000061035156,
      "text": " Word of God if we're going to develop a proper view of who God is. By the way,"
    },
    {
      "id": 82,
      "start": 1027.1000061035156,
      "end": 1031.9400024414062,
      "text": " aren't you thankful that God revealed himself to us in his precious Word? What"
    },
    {
      "id": 83,
      "start": 1031.9400024414062,
      "end": 1040.2999877929688,
      "text": " a joy! Without the Bible, I would not know that God loves me. Without the Bible, I"
    },
    {
      "id": 84,
      "start": 1040.2999877929688,
      "end": 1046.8999938964844,
      "text": " would not know God's plan of redemption. Without the Bible, we could go on and on"
    },
    {
      "id": 85,
      "start": 1046.8999938964844,
      "end": 1052.6199951171875,
      "text": " and on, because everything that I know about God has come from this precious"
    },
    {
      "id": 86,
      "start": 1052.6199951171875,
      "end": 1057.7000122070312,
      "text": " book. It's true that the heavens declare the glory of God. The firmament showeth"
    },
    {
      "id": 87,
      "start": 1057.7000122070312,
      "end": 1062.3800048828125,
      "text": " forth his handiwork. But those people that are in remote areas of the world"
    },
    {
      "id": 88,
      "start": 1062.3800048828125,
      "end": 1066.8200073242188,
      "text": " that only see the heavens and they don't have this book, they"
    },
    {
      "id": 89,
      "start": 1066.8200073242188,
      "end": 1072.3800048828125,
      "text": " understand that somebody had to do this, but they don't know who that somebody is."
    },
    {
      "id": 90,
      "start": 1072.3800048828125,
      "end": 1077.8999938964844,
      "text": " They can't know him intimately if they do not have the Word of God. And so we"
    },
    {
      "id": 91,
      "start": 1077.8999938964844,
      "end": 1082.7000122070312,
      "text": " develop that proper view of who God is. After developing a proper view of who"
    },
    {
      "id": 92,
      "start": 1082.7000122070312,
      "end": 1088.1000061035156,
      "text": " God is, number two, we would develop a proper view of self. I will never have a"
    },
    {
      "id": 93,
      "start": 1088.1000061035156,
      "end": 1093.0599975585938,
      "text": " proper view of myself if I do not first have a proper view of God, because until"
    },
    {
      "id": 94,
      "start": 1093.0599975585938,
      "end": 1097.9800109863281,
      "text": " I have that proper view of God, my view of self is skewed. We think of ourselves"
    },
    {
      "id": 95,
      "start": 1097.9800109863281,
      "end": 1105.8200073242188,
      "text": " a lot better than we should. Amen? We really do. I am so thankful to be a child"
    },
    {
      "id": 96,
      "start": 1105.8200073242188,
      "end": 1111.4599914550781,
      "text": " of God, to be joint heirs with Jesus Christ. What a joy! I'm heaven-bound, amen?"
    },
    {
      "id": 97,
      "start": 1111.4599914550781,
      "end": 1115.739990234375,
      "text": " But the reality is it's all because of His grace. The choir sang it this morning."
    },
    {
      "id": 98,
      "start": 1115.739990234375,
      "end": 1121.780029296875,
      "text": " It's only because of God's grace. And we begin to think about that proper view of"
    },
    {
      "id": 99,
      "start": 1121.780029296875,
      "end": 1126.260009765625,
      "text": " myself. I think about the Apostle Paul in 1 Corinthians chapter number 15. Paul"
    },
    {
      "id": 100,
      "start": 1126.260009765625,
      "end": 1132.1400146484375,
      "text": " says this when he's acknowledging the work of God in his own life and in what"
    },
    {
      "id": 101,
      "start": 1132.1400146484375,
      "end": 1136.739990234375,
      "text": " God has done. You think about him declaring the gospel in the great"
    },
    {
      "id": 102,
      "start": 1136.8599853515625,
      "end": 1141.4600219726562,
      "text": " resurrection chapter in 1 Corinthians 15, but in verse number 7 he says,"
    },
    {
      "id": 103,
      "start": 1141.4600219726562,
      "end": 1145.6199951171875,
      "text": " after that he was seen of James, then of all the Apostles, and in verse number 8"
    },
    {
      "id": 104,
      "start": 1145.6199951171875,
      "end": 1150.3400268554688,
      "text": " he begins to speak about himself. He says, and last of all he was seen of me also,"
    },
    {
      "id": 105,
      "start": 1150.3400268554688,
      "end": 1159.6599731445312,
      "text": " as of one born out of due time. For I am the least of the Apostles. Let him not"
    },
    {
      "id": 106,
      "start": 1159.6599731445312,
      "end": 1164.7000122070312,
      "text": " meet to be called an Apostle, because I persecuted the church of God, but by the"
    },
    {
      "id": 107,
      "start": 1164.739990234375,
      "end": 1173.8599853515625,
      "text": " grace of God I am what I am. Man, that's good. We could read 2 Corinthians"
    },
    {
      "id": 108,
      "start": 1173.8599853515625,
      "end": 1177.5399780273438,
      "text": " chapter number 12 and see Paul understanding how he's developing a"
    },
    {
      "id": 109,
      "start": 1177.5399780273438,
      "end": 1181.739990234375,
      "text": " proper view of himself. I think about what Paul says in 1 Timothy 1 in"
    },
    {
      "id": 110,
      "start": 1181.739990234375,
      "end": 1186.9000244140625,
      "text": " verse number 15, and again we've looked at this verse in previous messages, but"
    },
    {
      "id": 111,
      "start": 1186.9000244140625,
      "end": 1191.0599975585938,
      "text": " the reality in 1 Timothy 1 and verse number 15 is that Paul says this is a"
    },
    {
      "id": 112,
      "start": 1191.4199829101562,
      "end": 1197.3400268554688,
      "text": " faithful saying and worthy of all acceptation that Christ Jesus came into"
    },
    {
      "id": 113,
      "start": 1197.3400268554688,
      "end": 1202.0999755859375,
      "text": " the world to save sinners. By the way, aren't you thankful for"
    },
    {
      "id": 0,
      "start": 1202.0999755859375,
      "end": 1203.0999755859375,
      "text": " for that.\""
    },
    {
      "id": 1,
      "start": 1203.0999755859375,
      "end": 1206.69997549057,
      "text": " But then Paul says this, \"...of whom I am chief.\""
    },
    {
      "id": 2,
      "start": 1206.69997549057,
      "end": 1213.4599752426147,
      "text": " Wow, that's a good view of self."
    },
    {
      "id": 3,
      "start": 1213.4599752426147,
      "end": 1219.1599750518799,
      "text": " I understand I'm not going to go anywhere and give a self-esteem talk and really help"
    },
    {
      "id": 4,
      "start": 1219.1599750518799,
      "end": 1225.739974975586,
      "text": " people with that kind of a message, but it's all about God, it's all about God."
    },
    {
      "id": 5,
      "start": 1225.739974975586,
      "end": 1232.379976272583,
      "text": " Paul says, \"...I was a sinner in need of a Savior, and that was my greatest need."
    },
    {
      "id": 6,
      "start": 1232.379976272583,
      "end": 1238.4999771118164,
      "text": " And Christ Jesus came into the world to save sinners, of whom I am chief.\""
    },
    {
      "id": 7,
      "start": 1238.4999771118164,
      "end": 1240.4199752807617,
      "text": " What a joy."
    },
    {
      "id": 8,
      "start": 1240.4199752807617,
      "end": 1246.2199745178223,
      "text": " We develop that proper view of God, we develop that proper view of self, and then I believe"
    },
    {
      "id": 9,
      "start": 1246.2199745178223,
      "end": 1253.0599746704102,
      "text": " we must, if you are going to have this strategic plan to get from Acts 20 to 2 Timothy 4, we"
    },
    {
      "id": 10,
      "start": 1253.0599746704102,
      "end": 1256.6199760437012,
      "text": " must develop an eternal perspective."
    },
    {
      "id": 11,
      "start": 1256.6199760437012,
      "end": 1262.739974975586,
      "text": " So often I feel like we, if we're not careful, we can get so bogged down with the temporal"
    },
    {
      "id": 12,
      "start": 1262.739974975586,
      "end": 1264.6999740600586,
      "text": " things."
    },
    {
      "id": 13,
      "start": 1264.6999740600586,
      "end": 1270.9799728393555,
      "text": " And I understand that we live within the constraints of time, but one day time is going to be no"
    },
    {
      "id": 14,
      "start": 1270.9799728393555,
      "end": 1271.9799728393555,
      "text": " more."
    },
    {
      "id": 15,
      "start": 1271.9799728393555,
      "end": 1275.4399719238281,
      "text": " And eternity is our future."
    },
    {
      "id": 16,
      "start": 1275.4399719238281,
      "end": 1281.9399719238281,
      "text": " And that little hyphen or dash on the headstone between the year of birth and the year of"
    },
    {
      "id": 17,
      "start": 1282.0199737548828,
      "end": 1287.0199737548828,
      "text": " death, that's just this long in light of eternity."
    },
    {
      "id": 18,
      "start": 1287.0199737548828,
      "end": 1292.579978942871,
      "text": " It's just a vapor, as James says, that appeareth for a little time and then vanisheth away."
    },
    {
      "id": 19,
      "start": 1292.579978942871,
      "end": 1297.339973449707,
      "text": " And we think about developing this eternal perspective, Paul says this in 2 Corinthians"
    },
    {
      "id": 20,
      "start": 1297.339973449707,
      "end": 1302.0199737548828,
      "text": " chapter number 4, we're familiar with this declaration."
    },
    {
      "id": 21,
      "start": 1302.0199737548828,
      "end": 1307.239974975586,
      "text": " He tells us, it's interesting, you think about Paul and all of the things that he encountered"
    },
    {
      "id": 22,
      "start": 1307.239974975586,
      "end": 1312.239974975586,
      "text": " and all of the opposition in which he faced as he sought to serve the Lord, and he talks"
    },
    {
      "id": 23,
      "start": 1312.239974975586,
      "end": 1319.7999725341797,
      "text": " about these things and he refers to them this way in 2 Corinthians 4 and verse number 17."
    },
    {
      "id": 24,
      "start": 1319.7999725341797,
      "end": 1324.8999786376953,
      "text": " He says, for our light affliction, which is but for a moment."
    },
    {
      "id": 25,
      "start": 1324.8999786376953,
      "end": 1330.6999816894531,
      "text": " Every time I read verse 17 of 2 Corinthians 4, I wonder how Paul has the perspective that"
    },
    {
      "id": 26,
      "start": 1330.6999816894531,
      "end": 1336.3999786376953,
      "text": " he has, because when you read the life of Paul, if I were going to describe it, I wouldn't"
    },
    {
      "id": 27,
      "start": 1336.3999786376953,
      "end": 1338.3199768066406,
      "text": " describe it as a light affliction."
    },
    {
      "id": 28,
      "start": 1338.3199768066406,
      "end": 1340.5199737548828,
      "text": " I'm just being honest."
    },
    {
      "id": 29,
      "start": 1340.5199737548828,
      "end": 1345.0399780273438,
      "text": " And especially if I was writing about my own problems, I wouldn't write it as a light affliction."
    },
    {
      "id": 30,
      "start": 1345.0399780273438,
      "end": 1348.0799713134766,
      "text": " But he's writing on the inspiration of the Holy Spirit of God, and he believes this,"
    },
    {
      "id": 31,
      "start": 1348.0799713134766,
      "end": 1349.0799713134766,
      "text": " no doubt."
    },
    {
      "id": 32,
      "start": 1349.0799713134766,
      "end": 1352.6399688720703,
      "text": " He's seeking to communicate truth to these that he's ministering to."
    },
    {
      "id": 33,
      "start": 1352.6399688720703,
      "end": 1357.0199737548828,
      "text": " And he says, but which is, which is but for a moment."
    },
    {
      "id": 34,
      "start": 1357.0199737548828,
      "end": 1365.3999786376953,
      "text": " You know, it seems like when Paul saw God saved, his troubles started."
    },
    {
      "id": 35,
      "start": 1365.3999786376953,
      "end": 1370.5599822998047,
      "text": " And he goes on the missionary journey, and the troubles follow him."
    },
    {
      "id": 36,
      "start": 1370.5599822998047,
      "end": 1376.6399688720703,
      "text": " And he's kicked out, and he's beaten, and he's stoned, and he's shipwrecked, and he"
    },
    {
      "id": 37,
      "start": 1376.6399688720703,
      "end": 1379.0799713134766,
      "text": " talks about all these things that he encountered."
    },
    {
      "id": 38,
      "start": 1379.0799713134766,
      "end": 1383.3199768066406,
      "text": " And it just seems like just issue after issue."
    },
    {
      "id": 39,
      "start": 1383.3199768066406,
      "end": 1387.9999694824219,
      "text": " And Paul says it's a light affliction, and it's just for a moment."
    },
    {
      "id": 40,
      "start": 1387.9999694824219,
      "end": 1388.9999694824219,
      "text": " Notice why."
    },
    {
      "id": 41,
      "start": 1388.9999694824219,
      "end": 1402.0399780273438,
      "text": " It says, worketh for us a far more exceeding and eternal weight of glory, while we look"
    },
    {
      "id": 42,
      "start": 1402.0399780273438,
      "end": 1407.3999786376953,
      "text": " not at the things which are seen, but of the things which are not seen."
    },
    {
      "id": 43,
      "start": 1407.3999786376953,
      "end": 1414.239974975586,
      "text": " For the things which are not seen are temporal, but the things which are not seen are eternal."
    },
    {
      "id": 44,
      "start": 1415.239974975586,
      "end": 1423.5999755859375,
      "text": " Oh, that God would help us to develop a proper view, an eternal perspective, a proper view"
    },
    {
      "id": 45,
      "start": 1423.5999755859375,
      "end": 1429.5599822998047,
      "text": " of who God is, a proper view of who we are, but then that eternal perspective that we're"
    },
    {
      "id": 46,
      "start": 1429.5599822998047,
      "end": 1437.7599792480469,
      "text": " not just so constrained to this life, but we're constantly aware of eternity."
    },
    {
      "id": 47,
      "start": 1437.7599792480469,
      "end": 1439.5999755859375,
      "text": " You've heard me say it before."
    },
    {
      "id": 48,
      "start": 1439.5999755859375,
      "end": 1442.8799743652344,
      "text": " There's so many today, and I understand it."
    },
    {
      "id": 49,
      "start": 1442.8799743652344,
      "end": 1449.0399780273438,
      "text": " There's so many today that are focused on retirement planning, and it's something that"
    },
    {
      "id": 50,
      "start": 1449.0399780273438,
      "end": 1454.2799682617188,
      "text": " we deal with in our society, and it's something that we hear from HR folks, and so on and"
    },
    {
      "id": 51,
      "start": 1454.2799682617188,
      "end": 1455.2799682617188,
      "text": " so forth."
    },
    {
      "id": 52,
      "start": 1455.2799682617188,
      "end": 1458.8799743652344,
      "text": " And there are folks that, listen, there are organizations that exist today just for the"
    },
    {
      "id": 53,
      "start": 1458.8799743652344,
      "end": 1461.47998046875,
      "text": " purpose of retirement planning."
    },
    {
      "id": 54,
      "start": 1461.47998046875,
      "end": 1469.0399780273438,
      "text": " And if we're not careful, even as the people of God, we will spend more time and more focus"
    },
    {
      "id": 55,
      "start": 1469.0399780273438,
      "end": 1473.6399841308594,
      "text": " on retirement planning than we will on eternity planning."
    },
    {
      "id": 56,
      "start": 1473.6399841308594,
      "end": 1482.1599731445312,
      "text": " And the reality is that retirement is not certain, but eternity is."
    },
    {
      "id": 57,
      "start": 1482.1599731445312,
      "end": 1487.3999633789062,
      "text": " The person that purchased and owned this piece of property that's adjacent to our property,"
    },
    {
      "id": 58,
      "start": 1487.3999633789062,
      "end": 1491.3599853515625,
      "text": " they bought that property in 1978 for, like, $6,500."
    },
    {
      "id": 59,
      "start": 1491.3599853515625,
      "end": 1498.5999755859375,
      "text": " Man, we should have bought it, amen?"
    },
    {
      "id": 60,
      "start": 1498.5999755859375,
      "end": 1505.2799682617188,
      "text": " Let's retire and build a house on that property."
    },
    {
      "id": 61,
      "start": 1505.2799682617188,
      "end": 1506.9199829101562,
      "text": " You guys see a house out there?"
    },
    {
      "id": 62,
      "start": 1506.9199829101562,
      "end": 1508.7599792480469,
      "text": " There's no house."
    },
    {
      "id": 63,
      "start": 1508.7599792480469,
      "end": 1510.239990234375,
      "text": " You know why?"
    },
    {
      "id": 64,
      "start": 1510.239990234375,
      "end": 1511.7599792480469,
      "text": " She never retired."
    },
    {
      "id": 65,
      "start": 1511.7599792480469,
      "end": 1513.4399719238281,
      "text": " She died."
    },
    {
      "id": 66,
      "start": 1513.4399719238281,
      "end": 1518.719970703125,
      "text": " I don't know her, never met her, but she died."
    },
    {
      "id": 67,
      "start": 1518.719970703125,
      "end": 1519.719970703125,
      "text": " She never retired."
    },
    {
      "id": 68,
      "start": 1519.719970703125,
      "end": 1525.3599853515625,
      "text": " But that was the purpose of buying the piece of property."
    },
    {
      "id": 69,
      "start": 1525.3599853515625,
      "end": 1531.3999633789062,
      "text": " There are people today, listen, I think it's important to be prudent, to think about the"
    },
    {
      "id": 70,
      "start": 1531.3999633789062,
      "end": 1532.3999633789062,
      "text": " future."
    },
    {
      "id": 71,
      "start": 1532.3999633789062,
      "end": 1539.6399841308594,
      "text": " There are biblical truths that we must look to and understand that, but we must not get"
    },
    {
      "id": 72,
      "start": 1539.6399841308594,
      "end": 1541.8799743652344,
      "text": " out of balance."
    },
    {
      "id": 73,
      "start": 1541.8799743652344,
      "end": 1545.239990234375,
      "text": " We must maintain that eternal perspective."
    },
    {
      "id": 74,
      "start": 1545.239990234375,
      "end": 1548.9599609375,
      "text": " Number four, this strategic plan."
    },
    {
      "id": 75,
      "start": 1548.9599609375,
      "end": 1553.9599609375,
      "text": " I'm going to develop a proper view of who God is, a proper view of myself, an eternal"
    },
    {
      "id": 76,
      "start": 1553.9599609375,
      "end": 1554.9599609375,
      "text": " perspective."
    },
    {
      "id": 77,
      "start": 1555.5599670410156,
      "end": 1559.8399658203125,
      "text": " I would say this, we must regularly remind ourselves of the goal."
    },
    {
      "id": 78,
      "start": 1559.8399658203125,
      "end": 1561.2799682617188,
      "text": " What's our purpose?"
    },
    {
      "id": 79,
      "start": 1561.2799682617188,
      "end": 1566.3199768066406,
      "text": " When I worked at Sikorsky, we had regular reminders of what our goal was."
    },
    {
      "id": 80,
      "start": 1566.3199768066406,
      "end": 1567.7999877929688,
      "text": " We had weekly meetings."
    },
    {
      "id": 81,
      "start": 1567.7999877929688,
      "end": 1568.9999694824219,
      "text": " We had monthly meetings."
    },
    {
      "id": 82,
      "start": 1568.9999694824219,
      "end": 1573.9599609375,
      "text": " We understood what our stated objectives were and what it was that we're trying to accomplish,"
    },
    {
      "id": 83,
      "start": 1573.9599609375,
      "end": 1579.1199645996094,
      "text": " and they were always before us, and we had something that we called ACE, Achieving Competitive"
    },
    {
      "id": 84,
      "start": 1579.1199645996094,
      "end": 1580.1199645996094,
      "text": " Excellence."
    },
    {
      "id": 85,
      "start": 1580.1199645996094,
      "end": 1583.0799865722656,
      "text": " Some of you are familiar with Six Sigma."
    },
    {
      "id": 86,
      "start": 1583.1999816894531,
      "end": 1587.7999877929688,
      "text": " It's something that's in the corporate world, and it's very similar to this thing that we"
    },
    {
      "id": 87,
      "start": 1587.7999877929688,
      "end": 1592.7999877929688,
      "text": " had at Sikorsky, Achieving Competitive Excellence, and so we would have these goals regularly"
    },
    {
      "id": 88,
      "start": 1592.7999877929688,
      "end": 1594.9199829101562,
      "text": " before us, and we'd have the metrics."
    },
    {
      "id": 89,
      "start": 1594.9199829101562,
      "end": 1596.9199829101562,
      "text": " How are we doing with reaching our goals?"
    },
    {
      "id": 90,
      "start": 1596.9199829101562,
      "end": 1598.9599609375,
      "text": " What are the metrics telling us?"
    },
    {
      "id": 91,
      "start": 1598.9599609375,
      "end": 1605.5199890136719,
      "text": " I believe that as a child of God, if my stated purpose is to finish my course with joy, if"
    },
    {
      "id": 92,
      "start": 1605.5199890136719,
      "end": 1609.9199829101562,
      "text": " I want to finish with no regrets, I better be reminding myself of what my goal is, what"
    },
    {
      "id": 93,
      "start": 1609.9199829101562,
      "end": 1610.9199829101562,
      "text": " my purpose is."
    },
    {
      "id": 94,
      "start": 1610.9199829101562,
      "end": 1611.9199829101562,
      "text": " Why?"
    },
    {
      "id": 95,
      "start": 1611.9199829101562,
      "end": 1619.1199645996094,
      "text": " Because if I'm not careful, I can get distracted from what my purpose is, and I begin to regularly"
    },
    {
      "id": 96,
      "start": 1619.1199645996094,
      "end": 1620.1199645996094,
      "text": " remind myself."
    },
    {
      "id": 97,
      "start": 1620.1199645996094,
      "end": 1621.1199645996094,
      "text": " Think about what Paul says."
    },
    {
      "id": 98,
      "start": 1621.1199645996094,
      "end": 1624.4399719238281,
      "text": " Let's look at a couple of verses in 1 Corinthians 9."
    },
    {
      "id": 99,
      "start": 1624.4399719238281,
      "end": 1630.5999755859375,
      "text": " Notice what Paul says here in 1 Corinthians 9."
    },
    {
      "id": 100,
      "start": 1630.5999755859375,
      "end": 1634.1599731445312,
      "text": " He understood the responsibility that had been given to him."
    },
    {
      "id": 101,
      "start": 1634.1599731445312,
      "end": 1638.0799865722656,
      "text": " In fact, in verse 16 of 1 Corinthians 9, he shares that responsibility."
    },
    {
      "id": 102,
      "start": 1638.0799865722656,
      "end": 1639.0799865722656,
      "text": " He says,"
    },
    {
      "id": 103,
      "start": 1639.0799865722656,
      "end": 1643.3599853515625,
      "text": " For though I preach the gospel, I have nothing to glory of."
    },
    {
      "id": 104,
      "start": 1643.3599853515625,
      "end": 1647.5999755859375,
      "text": " For necessity is laid upon me, yea, woe is unto me if I preach not the gospel."
    },
    {
      "id": 105,
      "start": 1647.5999755859375,
      "end": 1648.5999755859375,
      "text": " Look at verse 23."
    },
    {
      "id": 106,
      "start": 1648.5999755859375,
      "end": 1653.9199829101562,
      "text": " And this I do for the gospel's sake, that I might be partaker thereof with you."
    },
    {
      "id": 107,
      "start": 1653.9199829101562,
      "end": 1658.3199768066406,
      "text": " Know ye not that they which run in a race run all, but one receiveth the prize?"
    },
    {
      "id": 108,
      "start": 1658.3199768066406,
      "end": 1660.3999633789062,
      "text": " So run that ye may obtain."
    },
    {
      "id": 109,
      "start": 1660.3999633789062,
      "end": 1665.9199829101562,
      "text": " And every man that striveth for the mastery is temperate in all things."
    },
    {
      "id": 110,
      "start": 1665.9199829101562,
      "end": 1675.5999755859375,
      "text": " Now they do it to obtain a corruptible crown, but we, an incorruptible."
    },
    {
      "id": 111,
      "start": 1675.5999755859375,
      "end": 1680.9599609375,
      "text": " We're going to stand before Jesus Christ one day, absolutely."
    },
    {
      "id": 112,
      "start": 1680.9599609375,
      "end": 1684.0799865722656,
      "text": " Every single person upon this earth will stand before Jesus Christ one day."
    },
    {
      "id": 113,
      "start": 1684.0799865722656,
      "end": 1688.47998046875,
      "text": " Now, I'm thankful as a saved person that the second death has no power over me, and I will"
    },
    {
      "id": 114,
      "start": 1688.47998046875,
      "end": 1693.6799621582031,
      "text": " not stand at the great white throne judgment, but I'll stand at the bema seat of Christ."
    },
    {
      "id": 115,
      "start": 1693.6799621582031,
      "end": 1696.5199890136719,
      "text": " And if you're saved this morning, so will you."
    },
    {
      "id": 116,
      "start": 1696.5199890136719,
      "end": 1700.3199768066406,
      "text": " And Paul is saying, we do it, listen, they're running to win."
    },
    {
      "id": 117,
      "start": 1700.3199768066406,
      "end": 1703.9399719238281,
      "text": " By the way, that's how I grew up, you play to win."
    },
    {
      "id": 118,
      "start": 1703.9399719238281,
      "end": 1708.8999633789062,
      "text": " No participation trophies, just play to win."
    },
    {
      "id": 119,
      "start": 1708.8999633789062,
      "end": 1719.199951171875,
      "text": " They do it to obtain a corruptible crown, a wreath of evergreen, but we, an incorruptible."
    },
    {
      "id": 120,
      "start": 1719.199951171875,
      "end": 1720.199951171875,
      "text": " You know what we're going to do with those crowns?"
    },
    {
      "id": 121,
      "start": 1720.199951171875,
      "end": 1726.47998046875,
      "text": " We're not going to walk around in glory and say, look at these crowns I have."
    },
    {
      "id": 122,
      "start": 1726.47998046875,
      "end": 1732.199951171875,
      "text": " You read Revelation, we're going to cast them at the throne."
    },
    {
      "id": 123,
      "start": 1732.199951171875,
      "end": 1734.5199584960938,
      "text": " Amen?"
    },
    {
      "id": 124,
      "start": 1734.5199584960938,
      "end": 1737.3999633789062,
      "text": " Notice what he says in the book of Philippians, turn there if you will, Philippians chapter"
    },
    {
      "id": 125,
      "start": 1737.3999633789062,
      "end": 1738.3999633789062,
      "text": " number three."
    },
    {
      "id": 126,
      "start": 1738.3999633789062,
      "end": 1745.2799682617188,
      "text": " I want you to see that Paul, as he's said in Acts chapter number 20 to these leaders"
    },
    {
      "id": 127,
      "start": 1745.2799682617188,
      "end": 1749.5999755859375,
      "text": " of the church at Ephesus, I have this desire, none of these things move me, neither count"
    },
    {
      "id": 128,
      "start": 1749.5999755859375,
      "end": 1751.3999633789062,
      "text": " I my life dear unto myself."
    },
    {
      "id": 129,
      "start": 1751.3999633789062,
      "end": 1756.4400024414062,
      "text": " He says, but I might finish my course with joy."
    },
    {
      "id": 130,
      "start": 1756.4400024414062,
      "end": 1761.2799682617188,
      "text": " If I'm going to do that, if that's my stated purpose, I must have a strategic plan."
    },
    {
      "id": 131,
      "start": 1761.2799682617188,
      "end": 1765.719970703125,
      "text": " And now he's writing to the believers in Philippi and he's reminding as he's writing them, I"
    },
    {
      "id": 132,
      "start": 1765.719970703125,
      "end": 1770.3199462890625,
      "text": " believe it also serves as a reminder to himself as to what his stated purpose is."
    },
    {
      "id": 133,
      "start": 1770.3199462890625,
      "end": 1774.47998046875,
      "text": " Notice in verse number 12, the Bible says, not as though I had already attained, either"
    },
    {
      "id": 134,
      "start": 1774.47998046875,
      "end": 1778.1799926757812,
      "text": " were already perfect, but I follow after."
    },
    {
      "id": 135,
      "start": 1778.1799926757812,
      "end": 1784.4599609375,
      "text": " With that, I may apprehend that for which also I am apprehended of Christ Jesus."
    },
    {
      "id": 136,
      "start": 1784.4599609375,
      "end": 1790.1799926757812,
      "text": " Brethren, I count not myself to have apprehended, but this one thing I do, forgetting those"
    },
    {
      "id": 137,
      "start": 1790.1799926757812,
      "end": 1795.1799926757812,
      "text": " things which are behind and reaching forth unto those things which are before, I press"
    },
    {
      "id": 138,
      "start": 1795.1799926757812,
      "end": 1801.1399536132812,
      "text": " toward the mark for the prize of the high calling of God in Christ Jesus."
    },
    {
      "id": 139,
      "start": 1801.1399536132812,
      "end": 1802.0999755859375,
      "text": " Wow."
    },
    {
      "id": 0,
      "start": 1802.0999755859375,
      "end": 1808.69997549057,
      "text": " A powerful reminder, not only a challenge to the believers at Philippi, but a reminder"
    },
    {
      "id": 1,
      "start": 1808.69997549057,
      "end": 1811.6599760055542,
      "text": " for himself."
    },
    {
      "id": 2,
      "start": 1811.6599760055542,
      "end": 1818.6599750518799,
      "text": " In 2 Timothy 2, I read verse 2 already, where Paul is instructing Timothy to this truth,"
    },
    {
      "id": 3,
      "start": 1818.6599750518799,
      "end": 1820.8399753570557,
      "text": " this pattern of discipleship."
    },
    {
      "id": 4,
      "start": 1820.8399753570557,
      "end": 1826.219976425171,
      "text": " He then tells Timothy that he's a good soldier, that he's to endure hardness as a good soldier"
    },
    {
      "id": 5,
      "start": 1826.219976425171,
      "end": 1828.899974822998,
      "text": " of Jesus Christ."
    },
    {
      "id": 6,
      "start": 1828.899974822998,
      "end": 1833.299976348877,
      "text": " Notice what he says, no man that woreth, in 2 Timothy 2 and verse number 4, entangleth"
    },
    {
      "id": 7,
      "start": 1833.299976348877,
      "end": 1837.459976196289,
      "text": " himself with the affairs of this life, and then notice the statement, that he may please"
    },
    {
      "id": 8,
      "start": 1837.459976196289,
      "end": 1839.8599739074707,
      "text": " him who hath chosen him to be a soldier."
    },
    {
      "id": 9,
      "start": 1839.8599739074707,
      "end": 1841.899974822998,
      "text": " I want to please him."
    },
    {
      "id": 10,
      "start": 1841.899974822998,
      "end": 1851.1799774169922,
      "text": " You know what happens in life is sometimes we get so busy trying to please other people."
    },
    {
      "id": 11,
      "start": 1851.1799774169922,
      "end": 1857.459976196289,
      "text": " If we just set out our goal to please Jesus, the reality is that if somebody else isn't"
    },
    {
      "id": 12,
      "start": 1857.459976196289,
      "end": 1861.7799758911133,
      "text": " pleased with our life but Jesus is, that's okay."
    },
    {
      "id": 13,
      "start": 1861.7799758911133,
      "end": 1866.0999755859375,
      "text": " I'd much rather Jesus be pleased with my life than someone else be pleased with my life,"
    },
    {
      "id": 14,
      "start": 1866.0999755859375,
      "end": 1869.4199752807617,
      "text": " and I certainly don't want you to be pleased with my life and Jesus not to be pleased with"
    },
    {
      "id": 15,
      "start": 1869.4199752807617,
      "end": 1870.4199752807617,
      "text": " my life."
    },
    {
      "id": 16,
      "start": 1870.4199752807617,
      "end": 1871.4199752807617,
      "text": " Amen?"
    },
    {
      "id": 17,
      "start": 1871.4199752807617,
      "end": 1877.6599731445312,
      "text": " And so we find that I believe that as Paul is used of God to write these challenges to"
    },
    {
      "id": 18,
      "start": 1877.6599731445312,
      "end": 1882.6599731445312,
      "text": " these believers, they also serve as a reminder to himself."
    },
    {
      "id": 19,
      "start": 1882.6599731445312,
      "end": 1888.9799728393555,
      "text": " Number five, simple, keep your eyes on Jesus."
    },
    {
      "id": 20,
      "start": 1888.9799728393555,
      "end": 1896.339973449707,
      "text": " Hebrews 12, looking unto Jesus, the author and finisher of our faith."
    },
    {
      "id": 21,
      "start": 1896.339973449707,
      "end": 1903.2599792480469,
      "text": " You know, it helps us when we keep our eyes on Jesus to avoid distractions."
    },
    {
      "id": 22,
      "start": 1903.2599792480469,
      "end": 1906.4199752807617,
      "text": " How many of you know there are a lot of distractions in the world today?"
    },
    {
      "id": 23,
      "start": 1906.4199752807617,
      "end": 1909.859977722168,
      "text": " How many of you ever drive on the highway and you see some distracted drivers?"
    },
    {
      "id": 24,
      "start": 1909.859977722168,
      "end": 1910.859977722168,
      "text": " Yeah?"
    },
    {
      "id": 25,
      "start": 1911.0599746704102,
      "end": 1915.6999740600586,
      "text": " I had this guy the other day, Holly was with me, she's down in the nursery."
    },
    {
      "id": 26,
      "start": 1915.6999740600586,
      "end": 1918.0199737548828,
      "text": " This guy was all over the road, man."
    },
    {
      "id": 27,
      "start": 1918.0199737548828,
      "end": 1919.2199783325195,
      "text": " You know why he was all over the road?"
    },
    {
      "id": 28,
      "start": 1919.2199783325195,
      "end": 1924.4999771118164,
      "text": " Because he was doing this right here."
    },
    {
      "id": 29,
      "start": 1924.4999771118164,
      "end": 1925.9399719238281,
      "text": " Driving me crazy."
    },
    {
      "id": 30,
      "start": 1925.9399719238281,
      "end": 1929.0999755859375,
      "text": " So I got up next to him and I blew my horn, pow, startled that guy."
    },
    {
      "id": 31,
      "start": 1929.0999755859375,
      "end": 1932.3399810791016,
      "text": " I wish I had one of those, brrr, that'd be awesome."
    },
    {
      "id": 32,
      "start": 1932.3399810791016,
      "end": 1934.2999725341797,
      "text": " I'd probably go to jail, man."
    },
    {
      "id": 33,
      "start": 1934.2999725341797,
      "end": 1936.6999816894531,
      "text": " I'm not even joking."
    },
    {
      "id": 34,
      "start": 1936.6999816894531,
      "end": 1940.5799713134766,
      "text": " I'd try to get my truck outfitted with one of them bad boys, that'd be great."
    },
    {
      "id": 35,
      "start": 1941.2999725341797,
      "end": 1943.3799743652344,
      "text": " But I got up next to that guy and I blew the horn, why?"
    },
    {
      "id": 36,
      "start": 1943.3799743652344,
      "end": 1947.219970703125,
      "text": " I really wasn't mad at him, he just needed to put his phone down."
    },
    {
      "id": 37,
      "start": 1947.219970703125,
      "end": 1949.8199768066406,
      "text": " Stop being distracted, right?"
    },
    {
      "id": 38,
      "start": 1949.8199768066406,
      "end": 1953.4199829101562,
      "text": " Distracted drivers are dangerous."
    },
    {
      "id": 39,
      "start": 1953.4199829101562,
      "end": 1954.4199829101562,
      "text": " You know what?"
    },
    {
      "id": 40,
      "start": 1954.4199829101562,
      "end": 1960.8199768066406,
      "text": " Distractions are dangerous for us, for finishing our goal, reaching that stated purpose, that"
    },
    {
      "id": 41,
      "start": 1960.8199768066406,
      "end": 1964.739974975586,
      "text": " I might finish with joy, that I might finish with no regrets."
    },
    {
      "id": 42,
      "start": 1964.739974975586,
      "end": 1969.0599822998047,
      "text": " All of a sudden there are distractions in life and I find myself over here doing this"
    },
    {
      "id": 43,
      "start": 1969.0599822998047,
      "end": 1974.4199829101562,
      "text": " and it has nothing to do with what my stated purpose was."
    },
    {
      "id": 44,
      "start": 1974.4199829101562,
      "end": 1980.0999755859375,
      "text": " How many of you ever told your child to clean their room?"
    },
    {
      "id": 45,
      "start": 1980.0999755859375,
      "end": 1984.739974975586,
      "text": " And then all of a sudden you go in there and they're playing with some kind of toy."
    },
    {
      "id": 46,
      "start": 1984.739974975586,
      "end": 1985.739974975586,
      "text": " What did I tell you to do?"
    },
    {
      "id": 47,
      "start": 1985.739974975586,
      "end": 1989.6999816894531,
      "text": " What was the purpose of you being sent to your room?"
    },
    {
      "id": 48,
      "start": 1989.6999816894531,
      "end": 1990.6999816894531,
      "text": " To clean your room."
    },
    {
      "id": 49,
      "start": 1990.6999816894531,
      "end": 1991.6999816894531,
      "text": " Pierre's smiling."
    },
    {
      "id": 50,
      "start": 1991.6999816894531,
      "end": 1996.1799774169922,
      "text": " He got two boys, amen?"
    },
    {
      "id": 51,
      "start": 1996.1799774169922,
      "end": 1997.1799774169922,
      "text": " Ari came in here."
    },
    {
      "id": 52,
      "start": 1997.2999725341797,
      "end": 1999.0199737548828,
      "text": " This is just a side note, it'll only take a minute."
    },
    {
      "id": 53,
      "start": 1999.0199737548828,
      "end": 2000.0199737548828,
      "text": " I'm going to chase the rabbit."
    },
    {
      "id": 54,
      "start": 2000.0199737548828,
      "end": 2002.2999725341797,
      "text": " I'm going to kill him and I'm going to get back to the message."
    },
    {
      "id": 55,
      "start": 2002.2999725341797,
      "end": 2009.6599731445312,
      "text": " Ari came in here Friday night for the rehearsal and he had a gun, this dart gun, not a really"
    },
    {
      "id": 56,
      "start": 2009.6599731445312,
      "end": 2010.6599731445312,
      "text": " dart gun, what's it called?"
    },
    {
      "id": 57,
      "start": 2010.6599731445312,
      "end": 2012.8599700927734,
      "text": " A Nerf gun, a Nerf gun."
    },
    {
      "id": 58,
      "start": 2012.8599700927734,
      "end": 2017.8999786376953,
      "text": " And he had a wristband with all kinds of extra Nerf bullets, it was cool."
    },
    {
      "id": 59,
      "start": 2017.8999786376953,
      "end": 2025.2999725341797,
      "text": " And so I went to Ari and I said, listen, tomorrow at the wedding when Evan tries to kiss Juliana,"
    },
    {
      "id": 60,
      "start": 2025.2999725341797,
      "end": 2027.7799682617188,
      "text": " you just unload on him."
    },
    {
      "id": 61,
      "start": 2027.7799682617188,
      "end": 2028.7799682617188,
      "text": " Just unload."
    },
    {
      "id": 62,
      "start": 2028.7799682617188,
      "end": 2032.0599822998047,
      "text": " And Pierre and Kimberly are like, what are you doing?"
    },
    {
      "id": 63,
      "start": 2032.0599822998047,
      "end": 2035.6999816894531,
      "text": " I'm like, it'd be awesome, man."
    },
    {
      "id": 64,
      "start": 2035.6999816894531,
      "end": 2040.5799713134766,
      "text": " And so Ari comes in here yesterday for the wedding and I'm like, where's your gun?"
    },
    {
      "id": 65,
      "start": 2040.5799713134766,
      "end": 2045.1799774169922,
      "text": " Pierre and Kimberly are like, right?"
    },
    {
      "id": 66,
      "start": 2045.1799774169922,
      "end": 2046.1799774169922,
      "text": " I can just see it."
    },
    {
      "id": 67,
      "start": 2046.1799774169922,
      "end": 2051.8599700927734,
      "text": " Ari's like, pastor said so, right?"
    },
    {
      "id": 68,
      "start": 2051.8599700927734,
      "end": 2058.939971923828,
      "text": " Distractions, distractions, listen, distractions abound."
    },
    {
      "id": 69,
      "start": 2058.939971923828,
      "end": 2059.939971923828,
      "text": " I think about Peter."
    },
    {
      "id": 70,
      "start": 2059.939971923828,
      "end": 2063.499969482422,
      "text": " He said, I go fishing."
    },
    {
      "id": 71,
      "start": 2063.499969482422,
      "end": 2069.4599609375,
      "text": " Jesus showed up, John 21 if you want to read it."
    },
    {
      "id": 72,
      "start": 2069.4599609375,
      "end": 2075.0599670410156,
      "text": " John says, it's Jesus because Jesus says, do you have any fish?"
    },
    {
      "id": 73,
      "start": 2075.0599670410156,
      "end": 2076.699981689453,
      "text": " Did you catch anything?"
    },
    {
      "id": 74,
      "start": 2076.699981689453,
      "end": 2078.259979248047,
      "text": " Caught nothing."
    },
    {
      "id": 75,
      "start": 2078.259979248047,
      "end": 2084.8199768066406,
      "text": " And Jesus gives them instruction, they get a great, great harvest of fish."
    },
    {
      "id": 76,
      "start": 2084.8199768066406,
      "end": 2085.8199768066406,
      "text": " John says, it's Jesus."
    },
    {
      "id": 77,
      "start": 2085.8199768066406,
      "end": 2091.3399658203125,
      "text": " And Peter, he gets out there and he gets to the Lord."
    },
    {
      "id": 78,
      "start": 2091.3399658203125,
      "end": 2097.019989013672,
      "text": " And Jesus, after they have some food, just begins to speak to Peter, Peter, do you love"
    },
    {
      "id": 79,
      "start": 2097.019989013672,
      "end": 2098.019989013672,
      "text": " me?"
    },
    {
      "id": 80,
      "start": 2098.019989013672,
      "end": 2101.019989013672,
      "text": " Peter, do you love me?"
    },
    {
      "id": 81,
      "start": 2101.019989013672,
      "end": 2104.019989013672,
      "text": " Peter, do you love me?"
    },
    {
      "id": 82,
      "start": 2104.019989013672,
      "end": 2105.739990234375,
      "text": " You know what Peter says?"
    },
    {
      "id": 83,
      "start": 2105.739990234375,
      "end": 2107.8599853515625,
      "text": " What about John?"
    },
    {
      "id": 84,
      "start": 2107.8599853515625,
      "end": 2110.219970703125,
      "text": " What's he going to do?"
    },
    {
      "id": 85,
      "start": 2110.219970703125,
      "end": 2116.5399780273438,
      "text": " It's not about John because Jesus said to Peter, follow me."
    },
    {
      "id": 86,
      "start": 2116.5399780273438,
      "end": 2119.6599731445312,
      "text": " Jesus said, follow me."
    },
    {
      "id": 87,
      "start": 2119.6599731445312,
      "end": 2124.219970703125,
      "text": " And Jesus says, if I will that he lives until I come, what does that matter to you?"
    },
    {
      "id": 88,
      "start": 2124.219970703125,
      "end": 2125.219970703125,
      "text": " Right?"
    },
    {
      "id": 89,
      "start": 2125.219970703125,
      "end": 2127.739990234375,
      "text": " Then they all said, John's not going to die."
    },
    {
      "id": 90,
      "start": 2127.739990234375,
      "end": 2130.3399658203125,
      "text": " That's not what Jesus said."
    },
    {
      "id": 91,
      "start": 2130.3399658203125,
      "end": 2138.6199645996094,
      "text": " But listen, we can be so easily distracted in life."
    },
    {
      "id": 92,
      "start": 2138.6199645996094,
      "end": 2143.219970703125,
      "text": " And so if I have a stated purpose, I must develop a strategic plan."
    },
    {
      "id": 93,
      "start": 2143.219970703125,
      "end": 2147.4599609375,
      "text": " In closing, number three, a spectacular proclamation."
    },
    {
      "id": 94,
      "start": 2147.4599609375,
      "end": 2154.0999755859375,
      "text": " We read it already by way of introduction, but turn to 2 Timothy chapter number four."
    },
    {
      "id": 95,
      "start": 2154.0999755859375,
      "end": 2159.3799743652344,
      "text": " Let me say this, Paul was not perfect and neither are you, neither am I."
    },
    {
      "id": 96,
      "start": 2159.3799743652344,
      "end": 2162.6599731445312,
      "text": " Paul's not perfect, only Jesus is perfect."
    },
    {
      "id": 97,
      "start": 2162.6599731445312,
      "end": 2166.8999633789062,
      "text": " However, Paul had a stated purpose for his life."
    },
    {
      "id": 98,
      "start": 2166.8999633789062,
      "end": 2170.5399780273438,
      "text": " He had developed a strategic plan for his life."
    },
    {
      "id": 99,
      "start": 2170.5399780273438,
      "end": 2175.1599731445312,
      "text": " And then he was able to come to the end of his life and make this spectacular proclamation"
    },
    {
      "id": 100,
      "start": 2175.1599731445312,
      "end": 2179.179962158203,
      "text": " that we read in 2 Timothy 4 in verses six and seven."
    },
    {
      "id": 101,
      "start": 2179.179962158203,
      "end": 2184.6199645996094,
      "text": " He says, for I am now ready to be offered and the time of my departure is at hand."
    },
    {
      "id": 102,
      "start": 2184.6199645996094,
      "end": 2187.019989013672,
      "text": " I have fought a good fight."
    },
    {
      "id": 103,
      "start": 2187.019989013672,
      "end": 2188.939971923828,
      "text": " I have finished my course."
    },
    {
      "id": 104,
      "start": 2188.939971923828,
      "end": 2190.2999877929688,
      "text": " I have kept the faith."
    },
    {
      "id": 105,
      "start": 2190.2999877929688,
      "end": 2196.8199768066406,
      "text": " Notice in verse eight, henceforth, there is laid up for me a crown of righteousness."
    },
    {
      "id": 106,
      "start": 2196.8199768066406,
      "end": 2198.699981689453,
      "text": " That's not pride."
    },
    {
      "id": 107,
      "start": 2198.699981689453,
      "end": 2201.8599853515625,
      "text": " He's not being prideful in saying that."
    },
    {
      "id": 108,
      "start": 2201.8599853515625,
      "end": 2205.9599609375,
      "text": " Which the Lord, the righteous judge, shall give me at that day, and not to me only, but"
    },
    {
      "id": 109,
      "start": 2205.9599609375,
      "end": 2211.4199829101562,
      "text": " unto all them also that love His appearing."
    },
    {
      "id": 110,
      "start": 2211.4199829101562,
      "end": 2214.499969482422,
      "text": " That's a spectacular proclamation."
    },
    {
      "id": 111,
      "start": 2214.499969482422,
      "end": 2220.6599731445312,
      "text": " You can read books that have been written about deathbed confessions."
    },
    {
      "id": 112,
      "start": 2220.6599731445312,
      "end": 2224.6599731445312,
      "text": " You can interact with people that have lived life and they get near the end of their life"
    },
    {
      "id": 113,
      "start": 2224.6599731445312,
      "end": 2229.499969482422,
      "text": " and their life is full of regrets."
    },
    {
      "id": 114,
      "start": 2229.499969482422,
      "end": 2234.2999877929688,
      "text": " Sometimes you hear people say, I wish I would have, right?"
    },
    {
      "id": 115,
      "start": 2234.2999877929688,
      "end": 2235.5399780273438,
      "text": " I wish I would have done this."
    },
    {
      "id": 116,
      "start": 2235.5399780273438,
      "end": 2236.6199645996094,
      "text": " I wish I would have done that."
    },
    {
      "id": 117,
      "start": 2236.6199645996094,
      "end": 2237.6199645996094,
      "text": " I wish I would have..."
    },
    {
      "id": 118,
      "start": 2237.6199645996094,
      "end": 2243.8199768066406,
      "text": " But you come to that point where you're just moments from eternity and there's nothing"
    },
    {
      "id": 119,
      "start": 2243.8199768066406,
      "end": 2246.5399780273438,
      "text": " you can do about it at that point."
    },
    {
      "id": 120,
      "start": 2246.5399780273438,
      "end": 2250.97998046875,
      "text": " In a certain sense, it's too late."
    },
    {
      "id": 121,
      "start": 2250.97998046875,
      "end": 2257.1399841308594,
      "text": " And so if I want to get from Acts 20 and verse number 24 to 2 Timothy chapter 4, verses six"
    },
    {
      "id": 122,
      "start": 2257.1399841308594,
      "end": 2264.179962158203,
      "text": " through eight, it's the middle of that strategic plan that is so critical."
    },
    {
      "id": 123,
      "start": 2264.179962158203,
      "end": 2269.8599853515625,
      "text": " I understand that none of us are perfect, but I understand this morning that as I look"
    },
    {
      "id": 124,
      "start": 2269.8599853515625,
      "end": 2276.8199768066406,
      "text": " at the truth of God's Word, that I want to get to the place where I can have this spectacular"
    },
    {
      "id": 125,
      "start": 2276.8199768066406,
      "end": 2285.7799682617188,
      "text": " proclamation that God has enabled me to finish what He's called me to do, that He's enabled"
    },
    {
      "id": 126,
      "start": 2285.7799682617188,
      "end": 2294.8599853515625,
      "text": " me to finish my course with joy, that I've kept the faith, that I finished strong, that"
    },
    {
      "id": 127,
      "start": 2294.8599853515625,
      "end": 2299.499969482422,
      "text": " I finished by pleasing the one for whom I live."
    },
    {
      "id": 128,
      "start": 2299.499969482422,
      "end": 2307.499969482422,
      "text": " To develop that strategic plan, developing that proper view of God and self and eternity"
    },
    {
      "id": 129,
      "start": 2307.499969482422,
      "end": 2318.0199584960938,
      "text": " and reminding myself and keeping my eyes on Jesus this morning, finish with no regrets."
    },
    {
      "id": 130,
      "start": 2318.0199584960938,
      "end": 2320.5799560546875,
      "text": " You say, well, the finish line is far away."
    },
    {
      "id": 131,
      "start": 2320.5799560546875,
      "end": 2326.4400024414062,
      "text": " If you think that way, it's unlikely that you will finish with no regrets because the"
    },
    {
      "id": 132,
      "start": 2326.4400024414062,
      "end": 2330.3199462890625,
      "text": " reality is that the finish line may be closer than you think it is."
    },
    {
      "id": 133,
      "start": 2330.3199462890625,
      "end": 2333.5,
      "text": " It may be closer than you think it is."
    },
    {
      "id": 134,
      "start": 2333.5,
      "end": 2340.3599853515625,
      "text": " With God's help and by God's grace, we can have that same testimony that Paul has and"
    },
    {
      "id": 135,
      "start": 2340.3599853515625,
      "end": 2345.47998046875,
      "text": " we can have that spectacular proclamation that I finished."
    },
    {
      "id": 136,
      "start": 2345.47998046875,
      "end": 2348.9599609375,
      "text": " I did what God called me to do."
    },
    {
      "id": 137,
      "start": 2348.9599609375,
      "end": 2353.719970703125,
      "text": " I kept the faith and I'm going to receive a crown."
    },
    {
      "id": 138,
      "start": 2354.199951171875,
      "end": 2361.3199462890625,
      "text": " Again, not pridefully speaking, just understanding what God has said in His Word."
    },
    {
      "id": 139,
      "start": 2361.3199462890625,
      "end": 2363.4400024414062,
      "text": " Finish with no regrets, let us pray."
    },
    {
      "id": 140,
      "start": 2363.4400024414062,
      "end": 2366.0399780273438,
      "text": " Father, how we love You."
    },
    {
      "id": 141,
      "start": 2366.0399780273438,
      "end": 2368.5399780273438,
      "text": " How we thank You for loving us."
    },
    {
      "id": 142,
      "start": 2368.5399780273438,
      "end": 2370.47998046875,
      "text": " We thank You for Your precious Word."
    },
    {
      "id": 143,
      "start": 2370.47998046875,
      "end": 2377.3999633789062,
      "text": " God, I pray this morning that You've used Your Word to help someone."
    },
    {
      "id": 144,
      "start": 2377.3999633789062,
      "end": 2386.9199829101562,
      "text": " The reality this morning is that none of us know exactly where we are in our race,"
    },
    {
      "id": 145,
      "start": 2386.9199829101562,
      "end": 2391.5399780273438,
      "text": " how many days we actually have left upon this earth."
    },
    {
      "id": 146,
      "start": 2391.5399780273438,
      "end": 2397.6399536132812,
      "text": " Not only is our life a vapor, but Your return is imminent."
    },
    {
      "id": 147,
      "start": 2397.6399536132812,
      "end": 2402.1599731445312,
      "text": " God, I pray that You'd help us this morning to have this same."
    },
    {
      "id": 0,
      "start": 2402.1599731445312,
      "end": 2409.119973182678,
      "text": " stated purpose of Paul. God, would you help us to develop a strategic plan in"
    },
    {
      "id": 1,
      "start": 2409.119973182678,
      "end": 2414.3599729537964,
      "text": " our lives that we may be able to make the same type of declaration, this"
    },
    {
      "id": 2,
      "start": 2414.3599729537964,
      "end": 2420.519973754883,
      "text": " spectacular proclamation of Paul. Help us, Lord. There's one that's present that's"
    },
    {
      "id": 3,
      "start": 2420.519973754883,
      "end": 2424.999973297119,
      "text": " not sure of heaven. They've never trusted the Lord Jesus Christ as their personal"
    },
    {
      "id": 4,
      "start": 2424.999973297119,
      "end": 2429.1599731445312,
      "text": " Savior. God, I pray that today the Holy Spirit of God would convict them of"
    },
    {
      "id": 5,
      "start": 2429.1599731445312,
      "end": 2433.4799728393555,
      "text": " their sin of Christ's righteousness and of judgment to come. I pray that before"
    },
    {
      "id": 6,
      "start": 2433.4799728393555,
      "end": 2440.679973602295,
      "text": " they would leave this place that they would get their salvation settled. I pray"
    },
    {
      "id": 7,
      "start": 2440.679973602295,
      "end": 2451.2999725341797,
      "text": " for every child of God. Would you help us, Lord, to develop this proper view, to have"
    },
    {
      "id": 8,
      "start": 2451.2999725341797,
      "end": 2457.8799743652344,
      "text": " this strategic plan that we might finish with no regrets. As we have a few moments"
    },
    {
      "id": 9,
      "start": 2457.8799743652344,
      "end": 2464.019973754883,
      "text": " of invitation, I pray, God, that you'd move and work as only you can. Help us to"
    },
    {
      "id": 10,
      "start": 2464.019973754883,
      "end": 2469.6599731445312,
      "text": " take this time to do business with you, that we would truly allow you to have"
    },
    {
      "id": 11,
      "start": 2469.6599731445312,
      "end": 2475.1799697875977,
      "text": " your way in our lives, that we'd leave here different than we arrived, that we'd"
    },
    {
      "id": 12,
      "start": 2475.1799697875977,
      "end": 2479.339973449707,
      "text": " be doers of the Word and not hearers only. We'll give you the glory for what"
    },
    {
      "id": 13,
      "start": 2479.339973449707,
      "end": 2481.8199768066406,
      "text": " you'll do, for it's in Christ's name we pray. Would you stand with us?"
    }
  ],
  "processed_at": "2025-04-16T13:33:12.878929"
}