{
  "video_id": "rAbk_dVtRjc",
  "text": "the last 11 weeks on Sunday evenings. Well, 11 weeks of messages, so not 11 calendar weeks, but 11 services that we have had a message from these seven churches. And so 11 messages on the seven churches, and what a blessing to have the opportunity to study them and to be encouraged by them, to be challenged. And I am thankful for each of these letters and for God preserving his word for us. And as I mentioned this morning, in summary, if you will, I'd like to consider, I've titled the message this evening, Seven Lessons from Seven Churches. I wanna remind you this evening, as we begin to look at Revelation 2 and 3, that these are seven local churches. They are churches that existed in the first century. They are churches in which the Lord Jesus Christ instructs John to write these letters to them. And we find that these churches were in existence at that time. Obviously, there were many more than these seven churches. There were a lot more churches that were around that were definitely capable of receiving a letter, but these are the seven churches that the Lord in his wisdom chose to have these letters written to. I believe that these churches are representative of all churches throughout the church age. What do I mean by that? Well, we find that these churches are not necessarily representative of a certain section or period of time within the broad sense of the church age. In other words, the first church that is referenced, the church at Ephesus, not every church in the first and second or however long you wanna divide up the timeline were like the church at Ephesus. And not every church today, as we're nearing the end of the church age, we see the day approaching, not every church today has to model what is said about the church of the Laodiceans. I believe that in every era of church history, there have been churches that could, as you evaluate them, they align with maybe the church at Smyrna or they align with the church in Sardis. And maybe there's an element of this church and that church that are combined within the church. And so there are some that take the approach that we're living in the Laodicean period of the church age. And therefore, basically they'd say there's no hope, we're all just the church of the Laodiceans and that's what our lot is and that's what it is. In fact, many of them that would have that approach would say there's not even a hope for revival. That's a sad outlook, is it not? Not only do I not believe that it's biblical, but the reality is that I believe that our God can send revival. I believe that our God wants to send revival. I believe that we can be a church, as I've mentioned multiple times throughout the series, that we can be a church that is God honoring, that is doing God's work God's way. And what a blessing. In Sunday school this morning, I dealt a little bit with the idea of the church and what is the church and what's the importance of the church. And those of you that were in Sunday school got to hear some of that lesson. It was very interactive on purpose and getting some feedback. And I mentioned something that happened in 2020. I did not include this part of it. I wanted to be able to include it this morning, but if you were there this evening, if you were there this morning, you would be able to connect these dots. But in 2019, so something very significant happened in 2020. We know what that was. It was COVID, all right? It is probably etched in our minds forever and ever that 2020, someone mentions the year and immediately you're gonna think you're gonna be reminded of the COVID year. And all of the differences and changes and all the things that we went through. And by the way, I hope that we never go through something like that again. And for many of us, it was the first time we ever went through it. I remember sitting around having conversations with different people. I remember being on calls with lawyers and others. And there more than one time that a preacher would say, they didn't teach us this in Bible college. And we'd say, that's right, man. They didn't teach us anything about this in Bible college, right? But the reality is that that was a significant event in 2020. What I mentioned in Sunday school this morning was that in 2020, our government and many governments around the world began to categorize businesses or institutions. And they used this word essential. You obviously remember that. It's not been that long ago. And you remember how they would categorize certain things as being essential while others were non-essential. We had it not only for businesses and organizations, we had it for personnel. There was essential personnel and there was non-essential personnel. And we understand all of that. We lived through it. And we asked the question in Sunday school this morning, why is it that the government for the most part was willing to say and to look at an establishment such as a liquor store and say that they're essential, but yet they would look at the church and say that they're non-essential? That's what happened. Yeah. So let me tell you of something that happened in 2019. We asked the question in Sunday school, why is it that they said that the church was not essential? There were some answers that were provided. And really, we said that really what has to happen is we as the people of God have to stand up and take responsibility that we stopped for decades, for generations, making the church vital. We'll skip church for all sorts of things. So through our negligence to church and our behavior saying that church isn't essential, though we wouldn't use those words, we're communicating to a lost world that the church really isn't essential. So in 2019, Barna did a study. And some of you are familiar with Barna studies, the Barna Group, so on and so forth. And I understand statistics, they can be kind of skewed and what have you. But I'm just gonna tell you what the study revealed in 2019. So this is prior to COVID. In 2019, 44%, that's almost half, 44% of Americans that claimed to be Christian. Now understand that's a broad category, okay? I get it. I understand that there are people that claim to be Christian, but that doesn't truly mean they're born again. I understand all of that. But these are at least people that said, I'm a Christian. They identified with that as they took this survey. And of those that claim to be Christians, 44% of them said church is not essential. 44% said church is not essential. Now that was answering a survey. I wonder what the percentage is of those that would never actually say the words, but their behavior says church is not essential. Do you understand what I'm saying this evening? The Lord Jesus Christ gave to us in his word, and we dealt with this in Sunday school a bit, and it segues with the message this evening. He revealed to us in his word, what the value or the worth of the church is. The Bible tells us that Jesus said, after he asked the question to the disciples, whom do men say that I, the son of man am? Whom say ye that I am? We find that Jesus then makes this great declaration, I will build my church. And he gives to us, he reveals to us in that single statement, the fact that he is going to be actively engaged in working and building his church. It is his church. It's not my church. It's not our church. It is his church. I understand sometimes we use the vernacular, and we'll use the phraseology that this is my church, or will you come to my church or our church. But I think for the most part, we understand biblically that Christ is the head of the church. And when we use that terminology, we're not claiming that we're the head of it. We're simply saying this is the church that I'm part of. But we understand that Jesus said, I will build my church. Then in Acts 20 and verse 28, and also in Ephesians five and verse 25, the Bible tells us that Christ valued the church so much that he gave his life for it. He bought the church with his own blood, according to Acts 20 and verse 28. So how do we value something? How do we set a value or a worth on something? How vital is church to us? Well, we understand how important church is to God. Church is not man's idea. Church is God's idea. Amen? It's not man's idea. Church didn't begin with man having this idea that we're going to have this thing called. No, God, the Lord Jesus Christ, he's the one that instituted, he's the one that instructed, and he gives to us the local church and what a blessing. And so these seven churches that are written to, that are given these chapters, Revelation two and three, as we have the opportunity to go through them, we see that these are churches. Why does God even care to write to these churches? Because he loves the church. Because he loves the church. And I wonder this evening, I hope tonight that if we were to take a survey amongst those that are present, that the numbers would be nowhere near. or what the Barna study was in 2019. But does it not reveal to you an element this evening as to why the government would say in 2020 that the church is not essential if 44% of those that claim to be Christians in 2019 said the church is not essential? What does it mean when they say the church is not essential? Well, basically, if it fits my schedule, I'll attend. If nothing else interferes, I'll attend. If something else comes up that's more important that takes precedence, then, well, you know, it's not really important. That's a bad perspective because the church is the bride of Christ. Amen? Is that biblically that we'll study as we get through the book of Revelation? It's gonna be months and months and months from now. We talk about the marriage supper of the Lamb. The church is the bride of Christ. God has no other option, quote unquote, for this era. It's the church. It's the church. There's no backup plan. There's no plan B. There's the church. And why is it that he writes to these churches is because he loves them, because he's concerned about what's going on in the churches. He's actively involved in the churches, and he sees, and so why does God take the time to write and to commend and also to correct and to give instruction? Why? Because he loves the church. And tonight, if we could just grasp that truth, that we could understand this evening that God gives us these truths in his word because he loves us, because he wants us to know the right way and the best way, and he wants us to know how that we're to behave and how that we're to live, and he wants us to have that same level of valuing the church like he does. The church is known as the body of Christ. The bride of Christ, but also the body of Christ. I don't know how many of us this evening, thinking about the picture of the body of Christ, I don't think any of us would say, you know, go ahead and cut my right arm off, I'm gonna do without it. You'd be crazy, right? What about the body of Christ? How do we function? How do we fulfill the purpose that God has for us? Does that make sense to you this evening? I read years ago, and I don't remember the exact source, it just came to my mind right now of the fact that I read this and I didn't prepare to say this, so I don't have the source in my notes, but I read years ago that there were churches prior to the time of electricity. We come in here, we have central air conditioning, we have lights that turn on with a switch and so on and so forth. Every now and then we get a power outage and it's like, what are we gonna do, right? And I say, folks on livestream, we got a serious thunderstorm coming through, you might lose us, but we're gonna just keep having church. But I read this account prior to the time in which electricity was available and prevalent, where in the church house, an individual went in and they saw these pews and on the end of each pew, there was a hook on the end that was about this high. And they walked into the church and it had been years later and they were not familiar with the era and what was going on and they said, what are these about? That's a valid question, is it not? And the individual said, well, here's how it worked prior to electricity, when you came into church, you would hang your lantern on the hook. And he went on to say this, when people were missing, it really affected the whole. Why? Well, because you sit over there by yourself and it's only as bright as your one lantern produces light. But when everyone's in their place and all the lanterns are, now all of a sudden the whole building is illuminated. I thought, man, that's powerful, that's powerful. This evening, the church is the body of Christ, it's the bride of Christ. The church is precious. I don't know if you've ever been in a place where there's no local church. I mean, a good local church. I live in a place in Nevada where there was no good local church, 70 miles from where we live. There was nowhere, no good local church. Went to the best one we could go to. I talked to Dean this afternoon after the Sunday school lesson, he came to me and he said, you know, I was in Colorado working for a number of years. And for those, I think he said it was 11 years that he was working there. From this date to this date is when he worked out in Colorado. And so for all those months, five months out of the year, he said the closest good church was 150 miles away, one direction. Can you imagine? You know how difficult that is for your Christian life, your Christian walk? You can't come to church. We choose not to go to church for certain reasons, whatever they are, but then you talk to people that are not able to go to church and how they desperately wish they could be in church. Someone has wisely said over the years and they've applied it to a number of things. Oftentimes we don't know, we don't appreciate something the way that we should until we no longer have it. And this evening, as we look at these seven lessons from seven churches, we've dealt with 11 weeks of going through these. So I'm not gonna belabor any of the points specifically, but I wanna share seven thoughts with you. Number one, God knows our works. To every single church, all seven churches, Jesus says, I know thy works. It reveals to us his omniscience. It reveals to us that he knows everything. He knows not only our, excuse me, not only our work, but our motive behind our work. He knows why we're doing it. And we find that in each of these letters, he says to these churches, I know thy works. I wonder this evening, as we consider just that simple truth that's revealed to each of these seven churches, I wonder if we were in a position as these churches are this evening that had these letters written, I wonder tonight if God were to write a letter about us as a local church, Fellowship Baptist Church in Oakton, Virginia, or I wonder if God were to give some level of writing with regard to our lives as individuals, what would God say about our works? Because God knows our works. And I understand that even as the church of the Laodiceans, oftentimes we have a perspective and it can be skewed. God knows our works. Let me say this, number two, activity doesn't equal spirituality. Activity doesn't equal spirituality. There's a number of these churches as we studied through them, we said this, Ephesus is a great example, there's others that are great examples as well. We said this, if I move to a new town, if I move to a new location and I was looking for a church, man, that church hits all the things that I'm looking for. They got this program and that program and they got this thing going on and they got activity after activity after activity. But Jesus says to the church there in Ephesus, you've left your first love. We find here this evening in chapter number three with the church in Sardis, he says to them, I know thy works, he says this in verse number one at the end of the verse, that thou hast a name that thou livest, noticed, and are dead. Activity can never be a substitute for spirituality. Activity doesn't equal spirituality. There's some times in which we wanna be busy, busy, busy, busy, busy, but we're neglecting our time with God. We're neglecting that true spiritual aspect of our walk with God and our growth in Christ and it's absolutely important this evening that we recognize that activity doesn't substitute for spirituality, it does not equal spirituality. You can be busy, but not be spiritual. You can be busy, but not doing the most important thing. Do you remember this? We looked at this here in some of these churches. I just referenced the church in Sardis there in chapter number two to the church at Ephesus and nevertheless in verse four, I have somewhat against thee because thou hast left thy first love, but I wanna remind you of Mary and Martha. You're familiar with it, no doubt, Luke chapter number 10, and it's a familiar passage of scripture. In Luke chapter number 10, we find that they're gathered together here and Jesus is there and we find that the Bible tells us in Luke chapter 10, beginning in verse number 38, now it came to pass as they went that he, Christ, entered into a certain village and a certain woman named Martha received him into her house and she had a sister called Mary, which also, notice what the Bible says of Mary, sat at Jesus' feet and heard his word. She was sitting at the feet of Christ. She's hearing the word. We find that verse 40 says, but Martha was cumbered about much serving. You know what she was doing? She was busy, she was active. She was doing, doing, doing, right? And the Bible says, and came to him, came to Jesus, and said, Lord, dost thou not care that my sister hath left me to serve alone? Bid her therefore that she help me. Jesus answered and said unto her, I can almost hear the voice of Christ when I read this verse. I don't think Christ was rebuking her in a very stern way. I think Jesus Christ, in a very compassionate tone, said, Martha, Martha, Martha, I mean just very compassionately, thou art careful and troubled about many things. But then what does he say in verse number 42? But one thing is needful, one thing is needful, and Mary hath chosen that good part which shall not be taken away from her. Does it mean that we don't serve? No, it doesn't mean that we don't serve, but you better get it in the right order. You can't serve in your own power. You need the power of Christ. You need the grace of God. We need to be good stewards of the manifold grace of God. You need his enabling and his empowerment. And we understand this evening that when we look at this passage in this illustration in Luke chapter number 10, that Jesus says to Martha, she's cumbered about with all these things. He says, listen, there's one thing that is needful. You can do a whole lot for God after you spend time with God, amen? But don't try to neglect that time with God and say, I'm just going to get busy doing this stuff and I'm going to be busy and busy and busy and busy and all this activity and I think that I'm some spiritual giant. No, we need to recognize that activity does not equal spirituality. It does not replace, it does not substitute spirituality. Can I say this number three tonight? Doctrine matters. Doctrine matters. We live in a time today in our era of church history where so many people are so concerned about unity and they think that if they could just set aside some differences and just kind of be passive with regard to doctrinal matters, that they could somehow have this unity, this ecumenical type of approach to ministry. And I want you to know this evening that doctrine matters. How are we to walk together if we're not in agreement, right? Is that not what the minor prophet asks us, that question? And we find this evening that as we look at the various texts of Scripture here in Revelation chapter 2 and verse number 15, notice what the Bible says here in Revelation chapter 2 and verse 14, he says, I have a few things against thee. In verse number 15 he says, so hast thou also them that hold the doctrine of the Nicolaitans, which thing I hate. This is not John saying I hate this. This is not Paul. This is the Lord Jesus Christ, God, the amen, the one that what he says is true and he says, you have this doctrine, there's some people there that are holding to this doctrine and I hate that. Why? Because it's not sound doctrine. We find that here, we see it in Revelation 2 and verse 15. Notice in chapter number 2, here as we continue to go forward in this chapter, notice in verse number 20, notwithstanding, now he's talking to the church in Thyatira, I have a few things against thee because thou sufferest that woman Jezebel, which calleth herself a prophetess, to teach and to seduce my servants, to commit fornication and to eat things sacrificed unto idols. God says, listen, I'm not, I'm not pleased with this. In Revelation chapter 3, as he's talking to the church in Sardis, in verse number 3, he says, remember therefore, notice what he says to them, how thou hast received and heard and hold fast. Jude will write in that short epistle and he says that we're to earnestly contend for the faith that was once delivered to the saints. The reality is that God has given us sound doctrine in his word and doctrine matters. We must be people of the Bible. I had a conversation with someone yesterday as I was out doing some visitation and I, a guy was out in his yard and he began to chat with me and I had this conversation with him and I asked him if he had a church that he attended. He said, oh yeah, and he began to share some things about the church and I asked him if he knew for sure that heaven was his home and he said, oh, I know who died for me and I've trusted Christ as my Savior and it was exciting to hear that. But then he began to tell me about being part of a church and he's been a part of this church for decades and they're basically, how I would describe it, is they're apostate. He said, I go to a church that doesn't believe the book anymore. That's what he said. He said, it's so hard for me. He's got a really close relationship with the pastor and he's torn over what to do. Doctrine matters. It matters. We find that Paul says to Titus, flip over very quickly in Titus chapter 1 and notice as Paul is instructing, he refers to Titus just as he does to Timothy as being his son in the faith and we find that in Titus chapter 1 and 2, in verse 5 of chapter 1, God gives us specifically the purpose in which Titus was left in Crete. The Bible says in Titus 1 and verse 5, for this cause left I thee in Crete that thou shouldest set in order the things that are wanting and ordain elders in every city as I had appointed thee. But then notice the references in verse number 9, holding fast the faithful word as he hath been taught that he may be able, notice, by sound doctrine, both to exhort and to convince the gainsayers. Notice with me in verse number 13, this witness is true, wherefore rebuke them sharply that they may be, notice what it says, sound in the faith. In chapter 2 and verse number 1, Paul says this to Titus, he says, but speak thou the things which become sound doctrine. He speaks to Timothy about sound doctrine. Doctrine matters this evening. The reality is that we ought to be able to take our Bibles and prove why we believe the things that we believe and we ought to be able to compare Scripture with Scripture. The reality is that if someone wants to come in and just argue and they don't have an agreement that they're going to agree with God and with his word and they're just going to attack, attack, attack, well that's a different kind of a situation. I sat in my office on Friday and someone began to ask questions as we're having this discipleship and all kinds of questions, I love questions, they're wonderful. Man, we were all over the Bible and the questions that we were dealing with weren't even part of the subject matter for the discipleship class, but what about this and what about that? Yeah, look, let's look over here at this passage, let's look at this passage, here's what the Bible says here. Doctrine matters. It's important for us to understand that. Number four, separation is necessary. Separation is necessary. In Revelation 2, as the Lord is speaking here to the church at Pergamos in verse number 13, he says, I know thy works and where thou dwellest, even where Satan's seed is, and thou holdest fast my name and hast not denied my faith, even in those days where Antipas was my faithful martyr, who was slain among you where Satan dwelleth. Verse number 15, notice here, it says, so that has that we read it just a moment ago, hast thou also them that hold the doctrine of the Nicolaitans, which thing I hate. So what does he tell him? What's the remedy? Repent. Repent. We see it in verse 16, listen, you need to change course. There are times in which you need to separate from someone. In verse number 24, as he's talking, speaking here to the church in Thyatira, he says this, but unto you I say and unto the rest in Thyatira, as many as have not this doctrine and which have not known the depths of Satan as they speak, I will put upon you none other burden. And so there were some that didn't have the doctrine that is spoken of there in Thyatira, speaking of Jezebel the prophetess and all that's going on there in those preceding verses that we spoke of. And we find this evening that there are times in which separation is necessary. Can I remind you of 2 Corinthians chapter number 6, where the Bible says, what concord hath Christ with Belial, light with darkness, so on and so forth, and he comes to verse 17 and he says, come out from among them and be ye separate, saith the Lord. You know what I've learned in life? More than me having to separate from someone else, if I live godly, if I live by the book and I do what I'm supposed to do, they're going to separate from me. You know why? The light reproves their wickedness. Amen. That's how it works. You walk in the light, you live the life that you're supposed to live, and all of a sudden those people that you used to run with and all that kind of thing, they separate from you because you reproved their wicked behavior with your testimony. Here we find this evening that not only personal separation, but even at times ecclesiastical separation. Church, listen, why do we not go and hold hands with certain denominations, certain groups of people? Listen, you're never going to come in here, as long as I'm the pastor of this church, you're never going to come in here and find people on this platform that are Catholic and a Presbyterian and a, why? Because there's ecclesiastical separation. We don't agree. They don't believe the book the way that we believe the book, and so therefore, listen, I don't believe some of what they teach. I believe that there's only one way to heaven, amen? I don't believe there's a purgatory. I don't believe, why? Because of the Bible. And so sometimes there's not only personal separation, but there's church separation. Say, I can't, we can't join together. We can't yoke together because there's differences. And if the trumpet doesn't sound properly, the people don't know how to respond. It's an Old Testament truth. And all of a sudden, even if you're, listen, I understand some of the benefits of Billy Graham's ministry, but Billy Graham started doing some of that ecumenical nonsense. And all of a sudden, there was an uncertain sound, why? Because what he was preaching about salvation differed from what the other people on the platform preached about salvation. They believed you could go to heaven by the sacraments. That's not what the Bible teaches, right? And so all of a sudden, because of joining together, you send an uncertain sound. You say, yeah, but we filled up a stadium. But there's a measure of confusion because of that ecumenical joining. So at times, we got to separate. Number five, remain faithful even in times of great difficulty. Remain faithful. I am resolved, we sang this evening, to start the service. Revelation 2 and verse number 10, the Bible says to the church in Smyrna, fear none of those things which thou shalt suffer. Isn't that interesting? God tells them they're going to suffer. God tells us in 2 Timothy chapter 3, yea, all those that live godly in Christ Jesus shall suffer persecution. And here he tells the church in Smyrna, you're going to suffer. But he says, fear none of those things which thou shalt suffer. Behold, the devil shall cast some of you into prison, that ye may be tried, and ye shall have tribulation ten days. Notice this, be thou faithful unto death, and I will give thee a crown of life. Faithfulness, faithfulness. It's required in a steward that a man be found faithful. Be faithful even in times of great difficulty. Be steadfast, 1 Corinthians 15 and verse 58, be steadfast, unmovable, always abounding in the work of the Lord. Why? For you know that your labor is not in vain in the Lord. We just remain faithful. I was having a conversation with a missionary not long ago, and as you, it wasn't with Brother Brown, it was with a different missionary, but you heard Brother Brown share some of his testimony in Sunday school. If you were here last week in Sunday school, you heard him share some of that testimony about how to pray for a missionary effectively, and I appreciate his transparency. He said this while he was giving that message, he said, listen, there was a season in which we had great discouragement. He said, I was talking to a preacher friend, and they said if you leave there tomorrow, you leave Cambodia tomorrow, don't feel like you, you don't have to feel like you'd be a failure. And here's what he said back to that man, according to what he said from this pulpit last Sunday morning, if you were here, he said, I don't have to leave Cambodia to feel like I'm a failure. What was he saying by that? He already felt like he was a failure. Discouragement. I had a conversation with another missionary this week after he was here with us, and we had this conversation about being faithful, and the reality is that sometimes it's a lot more difficult to be faithful when you don't see results, you don't see things happening. It's hard to stay faithful. You can get discouraged. Give up. Leave the place. Why? Because you're not seeing it. And on the flip side of that, if you're in a place where there's a lot of stuff going on and there's a lot of results, quote-unquote, it might be a little easier to stay faithful in that thing. But God tells us to be faithful, be faithful. Number six, maintain close fellowship with your Lord. The church in Ephesus left their first love. What a sad commentary. We have to cultivate and be purposed about our walk with God. We have to have that close fellowship. In Revelation chapter 3, speaking of the church of the Laodiceans, we find that Jesus says to them in verse 15, I know thy works that thou art neither cold nor hot. I would thou work cold or hot, so then because thou art lukewarm and neither cold nor hot, I will spew thee out of thy mouth, out of my mouth. God's saying, listen, you're lukewarm. And we find that as Christ would speak about their condition, they were compromising and accommodating. We said of the church of the Laodiceans that they were indifferent and apathetic, and the reality is that their walk, their fellowship with God was not what it should be. We find later in the passage in verse 20 that Jesus is on the outside of the church knocking, saying, if any man will open, if anyone will hear my voice and open the door, I will come into him and will sup with him and he with me. I wonder this evening, do we have a plan to grow spiritually? I remember being in the corporate world and I understand some of those things, been a number of years now, but I remember having development plans on how you were going to progress in your career and how you were going to grow in your area and so on and so forth and different classes you could take and better yourself to be better to the company and also to obviously gain value for yourself to the company. But I wonder this evening, do we have a plan to grow spiritually? Do we consider, do we think about, do we spend time with regard to how our spiritual walk is? Do we have that time in God's Word each day, that time in prayer each day that's a priority? Because one thing is needful. And we find this evening that we must not only have a plan to grow, but we must evaluate our growth. We must refuse to be comfortable or to be content with where we are. We must continue to press on to grow in a deeper, more intimate walk with our Lord. I think of Moses and I think of Paul. Both of those men made these statements that they would know God. We begin to think about both of those men making the statements in the time that they did, Exodus 33. You know Moses had spent time with God, I mean on the mount, spent time with God. He'd been in God's presence. He was there at the burning bush. He was there and saw all of the amazing miracles of the plagues. He experienced that. He had this closeness with God so much so that he could say to Pharaoh, okay, when I leave I'm going to raise my hand and God's going to, I mean he knew God, but he says in Exodus 33 that he wanted to know God. Paul, in the book of Philippians, he says that I may know Him. He's in jail ready to face a martyr's death. He'd walked with God. He'd seen God do amazing things. He says that I may know Him, that I never get content in my spiritual growth, that I continue to have that thirsting and that hungering because the reality this evening is that as much as you know about God today, He's so far greater than what your mind can even comprehend. Listen, I look at my own life. I look back 10 years, 20 years in my walk with Christ and listen, if you would have asked me 20 years ago, is God great, I would have said yes. And I would have had two or three things probably to tell you on why I thought God was great. Now you ask me why God's great, I got a whole lot more things to tell you and I say, listen, as much as I could agree with the psalmist when the psalmist says I know that the Lord is great and then I say, but His greatness is unsearchable. We keep that desire that we walk with God. I would say this, number seven to finish, determine to heed God's counsel. The first lesson was that God knows our works and I use that first because to every church He says I know thy works. The seventh lesson, again I said this morning there could be 30, 40 lessons that we could look at, determine to heed God's counsel, I choose it as the seventh one this evening because also to every church He finishes by saying, he that hath an ear, let him hear what the Spirit saith unto the churches. At some point we have to determine that we're going to heed God's counsel. We have to acknowledge this evening we need to get our feelings out of the way and not be hurt over our toes being stepped on spiritually so to speak. Listen conviction's good for us. It is absolutely good for us. I don't know about you but all week I was convicted about the message I preached this morning and then I was convicted again as I preached it this morning. Who am I living for? Who am I living for? Conviction's good for us. The problem is that we can get under conviction and we can get so resistant to that thing and say I'm not going to change, I got my feelings hurt and I got white knuckle syndrome and so on and so forth. No, we just take heed to God's counsel. God loves me and that's why He's correcting me. He's saying take heed. He tells us in Psalm 19 and verse number 11 that it's a benefit for us that as we take heed to His words in them that thy servant is warned. He tells us we're warned and in keeping of them there is great reward. Paul in Colossians 1, he's saying that night and day he's warning everyone. Why? Why is he warning? Why is the message going forth? Because he wants to present them perfect or complete knowing that they'll stand before Christ one day. I was singing this morning. morning, sitting up here on the platform, I was singing that little chorus that some of you might know. I'll say, yes, Lord, yes. As I was singing through that little chorus, as I was spending time in prayer this morning, I thought about what a precious truth it is when God's Spirit speaks to us. We ought to expect it. We ought to long for it. God, what do you have for me? What do you teach in me? What do I need to change in my life? What needs to be altered? Where can I grow? What do I—and God speaks to me. When your Spirit speaks to me, with my whole heart, I'll agree. It's what the song says. And my answer will be, yes, Lord, yes. You know, God gives us counsel in His Word about every area of life. James 1.22, we're to be doers of the Word, not hearers only. You have relational problems. God's Word gives us counsel for how to deal with that. But will we heed God's counsel? Well, you don't know what they did to us. No, no, no. Will we heed God's counsel? Will we follow God's plan? Will we follow what God said? I'm just not going to do that. What did God say? See, sometimes we can dig our heels in, and we can be so concerned about how we think or what we have experienced, and we don't take heed to God's Word. And yet God so faithfully and graciously gives us counsel. He gives us counsel. He's given to us His Word, and He says, listen, obey. Have you ever read Jeremiah, Isaiah, many of the other prophets as well? But I think about those two prophets, and again many others, how God says, I sent my prophets to you, but you would not hear them. You would not hear them. Did it mean that they didn't hear the words audibly? No, that's not necessarily what it means, because they no doubt heard the words audibly. You remember Ahab's relationship with Micaiah? I don't like that guy. He always prophesies negative about me. They're going to go into battle, and Joshua says, isn't there an actual prophet of God here? You bring all these prophets of Baal, but isn't there a prophet of God? Yeah, but I don't like that guy because he always prophesies negative. He heard what he said, but he didn't heed what he said. There's a difference in hearing and heeding. And He says to every church, he that hath an ear, let him hear what the Spirit saith unto the churches. Why are we hearing it? So that we could apply it, so that we could do it. We could spend the entire, we could spend the next hour talking about all of the areas of life that God gives us counsel for the arena in which you're dealing with and what your troubles are and your situations and God gives counsel. But the question is, will we heed it? Will we heed it? These churches, God loved them. He loves the church. And He loves us so much that He gives us truth, and He wants us to apply truth so that we could be pleasing in His sight. So that we could accomplish what He intends for us to accomplish. Seven lessons from seven churches. Let's pray. Father, we love You. We thank You for loving us. We thank You for Your Word and for the truth contained therein. We thank You, God, for the value that You've placed upon the local church. We're thankful for the instruction that You've given. Lord, I pray tonight that You would just help us to be doers of the Word. Help us to take these lessons and apply them in our lives. God, if there's any conviction, I pray that we'd respond in obedience, that we would not be resistant to the moving of Your Spirit, that we would not quench or grieve the Holy Spirit of God. We thank You that You've given us free will. God, I pray that You'd help us to make the right choice and the right decision that we'd surrender and submit. God, You'd do a work that only You could do. I pray that You'd have Your will and way in these moments of imitation. For it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Lennon's going to play quietly on the piano. And as she does, the altar is open.",
  "processed_at": "2025-04-14T17:06:13.216296"
}