{
  "video_id": "RDBub5zwffE",
  "text": "and we have an opportunity this morning as we look at this portion of scripture to be reminded of what Christ did for us so that we could be heaven bound, amen? And I'm so thankful that heaven is my home. If you do not know with certainty this morning, with 100% confidence that if you were to die today, that heaven is your home, I hope that you would not leave here this morning without having that settled, that you can know for sure that heaven is your home. We're knocking doors last week and I talked to a younger fella and he said, you know, I don't know for sure, but I'm trying to figure it out. And he was searching, I shared some scripture with him. He said, you know, I just don't know that you can really know. And I said, well, I'm thankful that the Bible tells us that we can know that we know that we know that heaven is our home, amen? And what a blessing that is, able to share some scripture, plant some seed. Remember, God gives the increase. We have the responsibility of sowing the seed and what a blessing. And so this morning, as we look at this portion of scripture, we'll get there in just a moment in Matthew 27, but I wanna remind you that back in Genesis chapter 22 in verse number 18, God gave a promise to Abraham. And here's the promise that he says, in thy seed shall all the nations of the earth be blessed because thou hast obeyed my voice. We find that the apostle Paul references this promise that God gave to Abraham in Genesis 22 in verse 18. He references that promise in Galatians three and verse number 16. And here's what he says. He says this, he says that it's the seed, not seeds plural, but the seed. And he makes this great statement that seed is Christ. We find that a few verses earlier in Galatians three and verse number 13, the Bible says, Christ hath redeemed us from the curse of the law being made a curse for us, for it is written, cursed is everyone that hangeth on a tree. We read in Hebrews nine, verses 16 and 17, for where a testament is, there must also of necessity be the death of the testator. For a testament is a force after men are dead. Otherwise it is of no strength at all while the testator liveth. I referenced those verses of scripture this morning in Genesis and Galatians and Hebrews as really a way of introduction to our text in Matthew 27. See the seed of Abraham that would bring a blessing to all nations is Jesus Christ. We find that the means by which this blessing would be made available to all human beings would be through the death, his death on the cross of Calvary. We understand that his subsequent glorious resurrection, and we'll focus on that next week, is evidence that his death was sufficient payment for the sin of the world. See, it was absolutely necessary that Jesus go to a cruel cross. It was prophesied, in fact, in Genesis three in verse number 15 is the very first reference that you find in all of the Bible that's a prophecy that one day Messiah would come and he would die. We find that Peter, he mentions that Jesus is the Lamb of God that was slain before the foundation of the world. Jesus said during his earthly ministry, I'm come to seek and to save that which was lost. And he came seeking sinners and he was coming to save sinners. We sing often, it's been normally a Christmas type of a song that the choir might sing, but born to die. Yes, Jesus, he was born to die and he had to go to that cruel cross so that mankind could be redeemed. See, so often as we have an opportunity to give the gospel, so often as we have the opportunity to be a representative, an ambassador for the Lord Jesus Christ, we often mention something like this, that the Lord offers a free gift of eternal life salvation. The Bible says that the wage of sin is death, but the gift of God is eternal life through Jesus Christ, our Lord. The gift of God is free to the recipient because it was paid for by the blood of Jesus Christ. And as we look at the text of scripture this morning, we are reminded of all that Jesus endured so that you and I could go to heaven, so that we could understand this morning that heaven is our home. See, we're all sinners, all mankind have sinned. The Bible says there's none righteous, no, not one. And we come to a passage of scripture and we can read of the crucifixion. I've titled the message this morning from Matthew 27, they crucified him. Notice in verse number 35, we'll read all of the text as we get through it. Actually, let's just begin reading in verse 27. The Bible says, then the soldiers of the governor took Jesus into the common hall and gathered unto him the whole band of soldiers. And they stripped him and put on him a scarlet robe. When they had plotted a crown of thorns, they put it upon his head. And a reed in his right hand. And they bowed the knee before him and mocked him, saying, hail, king of the Jews. And they spit upon him and took the reed and smote him on the head. And after that, they had mocked him. They took the robe off from him and put his own raiment on him and led him away to crucify him. And as they came out, they found a man of Cyrene, Simon by name. Him they compelled to bear his cross. When they were come unto a place called Golgotha, that is to say a place of a skull, they gave him vinegar to drink mingled with gall. And when he had tasted thereof, he would not drink. And notice verse 35, and they crucified him. And parted his garments, casting lots that it might be fulfilled, which was spoken by the prophet. They parted my garments among them. And upon my vesture did they cast lots. And sitting down, they watched him there. And set up over his head his accusation written, this is Jesus, the king of the Jews. Then were there two thieves crucified with him, one on the right hand and another on the left. They that passed by reviled him, wagging their heads. And saying, thou that destroyest the temple and buildest it in three days, save thyself. If thou be the son of God, come down from the cross. I'm thankful that he is the son of God and I'm thankful that he stayed on the cross. Amen. Likewise also, the chief priests mocking him with the scribes and elders said, he saved others. Himself he cannot save. If he be the king of Israel, let him now come down from the cross and we will believe him. He trusted in God, let him deliver him now if he will have him. For he said, I am the son of God. The thieves also which were crucified with him cast the same in his teeth. And it says in verse 45, now from the sixth hour, there was darkness over all the land until the ninth hour. About the ninth hour, Jesus cried with a loud voice saying, Eli, Eli, lama sabachthani, that is to say, my God, my God, why hast thou forsaken me? Some of them stood there. When they heard that, they said, this man calleth for Elias. And straightway, one of them ran and took a sponge and filled it with vinegar and put it on a reed and gave him to drink. The rest said, let be, let us see whether Elias will come to save him. Jesus, when he had cried again with a loud voice, yielded up the ghost. We see in verse number 50 that the Bible says that Jesus cried with a loud voice. If you look at the Gospel of John, we won't turn there at this point, but in 19 and verse 30, we know that that cry was this, it is finished. It is finished. I'm thankful this morning that as we look at this portion of Scripture and honestly, what a heart-wrenching passage of Scripture to read when we consider all that our God, all that he suffered so that we could go to heaven, so that we could be redeemed. See, redemption is only through the blood of Christ. Forgiveness of sins is only through the blood of Christ. And as we look at this passage of Scripture, I want you to consider four thoughts this morning. Number one, if you're taking notes, the death of Christ was a violent death. The death of Christ was a violent death. Why do we bring that up? Why is it that we would discuss this morning the violence that surrounded the death of Christ? Because it's important for us to understand that our Savior suffered greatly so that we could be redeemed. Even before the passage of Scripture that I've read for you this morning, beginning in verse 27 of chapter 27 and reading down through verse number 50, we find that there were trials that led to the crucifixion. Jesus stood before the high priest. He stood before the Sanhedrin. He stood before Pilate. In each of those circumstances, we find that he endured some measure of cruelty. And we find that at the end of his time. there before Pilate that the Bible says that they scourged him, literally the idea is to whip severely. We find that as we enter into the text of Scripture that we've read this morning, beginning in verse 27, that we see the violence with regard to the death of our Savior on the cross of Talvary. It begins in verse 29 by telling us about a crown of thorns. We understand that as we look at this passage of Scripture in verse 29 and how they were mocking him and even to consider the ridicule that would be evidence there through their mocking but the pain that was inflicted with this crown of thorns that was, the Bible tells us they made it and they plaited it upon his head. No doubt as they did so the thorns would pierce into the flesh and the blood would begin to stream down the face and we begin to see how that they were mocking him and they were bowing before him and they were saying, hail, king of the Jews. We find in verse number 30 that the Bible tells us that they spit upon him. It's hard for me to even comprehend. I believe it's probably one of the lowest things you could ever do to a human being is to spit in their face. It's absolutely disrespectful. It's literally the worst thing I can think of, just humiliating someone to spit in their face and here Jesus, the Son of God, God in flesh, to pay for the sins of these people that are crucifying him, to pay for our sins, they place that crown upon his head. They spit in his face. According to verse number 30, the Bible says that they smoke him on the head. The word smite, it literally means to strike with fierceness, but also with passion. Now we understand as we look at the whole of the story of the account that God gives us here in the gospel records and we don't have time to read all of it in one service, but we understand the passion by which the Jews cried out, crucify him, crucify him, and now as Pilate delivered him. When they begin this, the Bible says that they smoke him on the head to strike, not only with fierceness or force, but with passion. The anger that was evidenced, the Bible tells us, it summarizes in verse 35 and says, they crucified him. You could do a study through just historical means and study the craft, if you will. It's a bad word to use, but it's the best word that I know to use with regard to crucifixion. It was really a craft or an art that they tried to master, to inflict as much pain on an individual as humanly possible. They wanted the death of one that was to be crucified to be as slow and as agonizing and as painful as possible. They did not want to just have the individual that was being crucified die quickly, no, they wanted it to prolong. In fact, many times crucifixion, those that would be crucified, they would spend a couple of days on the cross as they were suffering in torment and agony. And as we find with the two thieves that are crucified with Christ because of the timing of the crucifixion of the Lord, we find that their legs were broken. Eventually that would happen if someone, if they wanted to expedite the process of the individual dying, they would, they would break their legs. Why? Because then they could no longer hold themselves up and they would die of asphyxiation. We find that Jesus, he did not have his legs broken, in fact that's a fulfillment of prophecy. We find that as we look at this passage of scripture again, I'm thankful that I don't have to pay for my own sin, I'm thankful that Jesus paid for it. But we must understand this morning that the death of Christ was a violent death. He was violent as he hung upon that cross, all that they sought to inflict upon him. And even as I read the text of scripture where they said, if you are who you say you are, come down, you said that destroy this temple and that you would build it in three days and we know that he was referring to his resurrection and thank God for the resurrection. We find that they said he saved others, but himself he cannot save. It was not a matter of cannot, it was a matter of he would not. He would not come off that cross, why? Because he had, you and I, and all of human history in mind, that this was what was necessary in order for the sin of the human race to be paid for. It was a violent death, number two. Bear with me, not only that it was a violent death, but the death of Christ was a voluntary death. It was a voluntary death. I'm thankful that Jesus willingly went to the cross of Calvary. I'm thankful that Jesus, the God in flesh, that when he came to this earth, he knew that he was born for a purpose and that he would go to that cross of Calvary. If you study the gospel of John, you'll read repeatedly through that gospel this phrase with regard to the hour. And referencing to the hour in which Jesus would go to the cross and pay for the sin of mankind, eventually it starts in John chapter number two that the hour has not yet come. And we find in John 17 that the hour is now come, and Jesus would go to that cruel cross. I want you to notice that it's a voluntary death in Matthew 26. Notice in verse 26 through 28, right there, just a page or two prior to the text that we're looking at this morning. Notice what the Bible says, and this is referenced with regard to often as we'd refer to it as the Last Supper. We reference this passage of Scripture when we observe the Lord's Supper, and notice in Matthew 26 and verse 26, the Bible says, and as they were eating, Jesus took bread and blessed it and break it and gave it to the disciples and said, take ye, this is my body. He took the cup and gave thanks and gave it to them saying, drink ye all of it, for this is my blood of the New Testament which is shed for many for the remission of sins. And so we find that in these verses of Scripture, the Bible speaks about how he gave thanks when they had this Lord's Supper. The bread representing his body that would be beaten and broken and torn. The juice representing his blood that would be shed. And he gave thanks. It was a voluntary death. We read already in chapter 26, look if you will, in verse number 47, look down, it says, and while he yet spake, this is after the time in the garden, and the Bible says he yet spake, lo, Judas, one of the twelve, came and with him a great multitude with swords and staves from the chief priests and elders of the people. Now he that betrayed him gave them a sign saying, whomsoever I shall kiss, the same is he, hold him fast. And forthwith, he came to Jesus and said, Hail, Master, and kissed him. Notice what Jesus says in verse 50. Jesus said unto him, Friend, friend, the one who betrayed him with a kiss, friend, wherefore art thou come? Of course, Jesus knew why he came. Jesus knew all that was going on. Then came they and laid hands on Jesus and took him. And behold, one of them, which were with Jesus, stretched out his hand and drew his sword and struck a servant of the high priest and smote off his ear. That's Peter. Some of you say, I could see myself in Peter. But notice what Jesus says in verse 52, he says, put up again thy sword into his place, for all they that take the sword shall perish with the sword. Notice what he says. In verse 53, thinkest thou that I cannot now pray to my Father, and he shall presently give me more than twelve legions of angels? But how then shall the Scriptures be fulfilled that thus it must be? That same hour said Jesus to the multitudes, are you come out as against a thief with swords and staves for to take me? I sat daily with you teaching in the temple, and you laid no hold on me. But all this was done that the Scriptures of the prophets might be fulfilled. Then all the disciples forsook him and fled. Jesus said, Peter, no, no, no, I have to go to the cross. Remember for much time now, Jesus had been teaching his disciples that he was going to go to Jerusalem and he was going to be slain. He tells them he's going to rise again, he's going to be crucified, he's going to rise again. And as he gave that instruction, remember Peter in Matthew 16, he says, oh, no, no. And Jesus says, get thee behind me, Satan. See because Jesus knew he had to go to the cross, it was a voluntary death. He says, Peter, don't you know that I could pray and I could have twelve legions of angels? angels. But then he asked this question in verse 54, but how then shall the scriptures be fulfilled? That thus it must be. In John chapter 10, we're told about the Lord being our shepherd. In this particular passage in John chapter 10, we're told that he's our good shepherd. And the Bible tells us of the good shepherd in John chapter number 10 that one of the characteristics of Jesus being the good shepherd is that he layeth down his life for the sheep. We find that in John chapter number 10 and verse number 11, he says, I am the good shepherd. The good shepherd giveth his life for the sheep. In verse 17, the Bible says, therefore, doth my father love me because I laid down my life. Notice that I might take it again. Then notice these words in John 10 and verse 18, no man taketh it, my life, from me, but I lay it down of myself. The death of the Lord Jesus Christ was a violent death, but I want you to understand it was a voluntary death. He willingly went to the cross of Calvary. He willingly endured all that he did. Why? Because he loved us. Because he loved us. It was voluntary. He laid down his life. In verse 18, it says, I have power to lay it down and I have power to take it again. This commandment have I received of my father. And we find that here as Jesus, he says, I'm the good shepherd, but I laid down my life. We're not going to look at the verses, but in Galatians 1, maybe you want to reference it, Paul says in Galatians 1, in verse number 4, again in Galatians 2, in verse number 20, he uses this phraseology that he gave himself. He gave himself. Someone told me, I remember one of the first people I ever witnessed to after I got saved. I remember I got saved when I was 17, entering into my senior year of high school, went to public school my whole life, and I'm going to that public high school in Southern California, just a, just a wicked place, all kinds of immorality and what have you. And I go there and I, I mean, I had no friends whatsoever. It was my first year there. My dad got transferred to a new duty station. We ended up in Southern California, end up going to a high school that has more students than the town that I lived in in Nevada had. I mean, it was a, it was culture shock, but then I got saved by the grace of God just before school started. When I entered into school as a Christian, and I remember in our teen Sunday school class after I got saved, the, the instruction of how we are to be witnesses and we're to be light. And even in the public school, I remember the, the teacher of that teen Sunday school class challenging us to be lights in that place. And I remember the first person, I can't remember what their name is, but I remember the first person I ever tried to witness to after I got saved there in Southern California at Fallbrook High School. And I remember that young man saying to me, Jesus didn't die for me. They took Jesus and they killed him. And I didn't know a whole lot about the Bible, but I knew a few verses and I was able to show him and tell him about some verses where the Bible says that, that he gave himself. That no man taketh it from me, but I lay it down. See, his death was voluntary. It was violent. It was voluntary. In Hebrews chapter 12, it's a passage of scripture that I often reference. In fact, for a number of years, it was one of the verses of scripture that I often would sign after my name in an email or a letter or if I were to sign something, I would use Hebrews 12, 1 and 2, precious verses of scripture. At some point in the last 10 or 12 years, God fixed my attention upon 2 Corinthians 5 and verse 15 and that now is the verse that I always sign my name with. But in Hebrews 12 and verses 1 and 2, the Bible says this, wherefore seeing we also are encompassed about with so great a cloud of witnesses, let us lay aside every weight and the sin which doth so easily beset us and let us run with patience the race that is set before us. Look at verse 2, looking unto Jesus, the author and finisher of our faith and then notice these words, who for the joy that was set before him endured the cross, despising the shame and is set down at the right hand of the throne of God. For the joy that was set before him, he endured the cross. See, it was voluntary. The Bible tells us in 1 Peter that he left us an example that we should follow his steps, but if you look in the text of scripture in 1 Peter chapter number 2, it tells us that the example that he left us is that when he was reviled, he reviled not again. When he suffered, he threatened not. He willingly laid down his life for his sheep. It was a violent death. It was a voluntary death. Number 3 this morning, if you're keeping notes, the death of Christ was a vicarious death. It was a vicarious death. What does that word mean? Well, it means that it was substitutionary. He took my place. We talk about the vicarious atonement. We talk about the substitutionary atonement and I'm thankful this morning that as we look at the scriptures that we understand, even if you look in the gospel records that there was a man that was in prison that Pilate had this discussion with those that brought Jesus before him during the hearing, during the trial and this man Pilate was going to release one and he offers to release Barabbas. Barabbas, I believe because of his own sin, because of his doings, he was guilty of death and he was going to be crucified. In fact, I believe that along with those other two thieves, it was Barabbas that would have hung upon that cross. But word comes and Barabbas is set free and Jesus instead is crucified. In a very real way, we could say that that cross was intended for Barabbas but we understand this morning that that cross was intended for each of us. It was our cross. It was each of us that were guilty, that were guilty of sin. I've said often from the pulpit that the reason that we, as we look at scripture, the reason that we understand the significance of the death of Christ and his glorious resurrection is that we're guilty. We're guilty and we're in need of a savior, a substitute. The vicarious death, he took my place, he took your place on the cross of Calvary. 2 Corinthians 5 and verse number 20 says this, that he made him to be sin for us, who knew no sin, that we might be made the righteousness of God in him. He took your place. What an awesome truth of scripture. I want you to look at 2 Peter, excuse me, 1 Peter in chapter number 3. I just quoted 2 Corinthians 5.20 but I want you to look at 1 Peter chapter 3. As we understand this morning, that Jesus was crucified and the fact that we are guilty sinners, so often when I talk to people I'll ask them, you have to understand that you're lost before you ever realize that you need a savior. Amen? If you don't know that you're lost, if you don't know that you're in judgment because of your sin, then you never recognize your need for a savior. We find, the Bible says all have sin. We're all condemned. He that believeth not, John chapter 3, is condemned already. That's what the Bible tells us. And we find that as we look at the scriptures and we understand that as we talk to people, we say, are you a sinner? Very few times I've had anyone tell me, no, I'm not a sinner. Often I'll have somebody say something like this, well I'm not that bad. How do you determine that? I mean, what is your criteria by you determining that you're really not that bad? And often, well I've never murdered anyone. Well that's a good thing. I'm glad that you've not murdered anyone. Amen? But the reality is that we've all sinned. Sometimes we look at sin and we try to categorize sin and say, well this one's worse than this one and so on and so forth, but sin is sin and we're guilty. In fact, people try to do that with lying. They talk about little white lies. Did you ever hear that phraseology? A lie is a lie. By the way, Revelation says all liars shall have their part in the lake which burneth with fire and brimstone. So we understand this morning that we're guilty. But I want you to see in 1 Peter 3 and verse number 18, the Bible says this, for Christ also hath once suffered for sins. But you understand that he's not a sinner. He never sinned. He's perfect. He's God. In fact, if you were to cross-reference to Hebrews 9 and Hebrews 10, you'll understand that in those passages of Scripture, it's referring to the offering that Christ made once for sin forever. We find that there's a contrast that is made, how in the high priest would enter into the holy of holies, and he would first make an atonement for his own sin, then for the sin the sin of the people. We read that in Hebrews 9 and 10. You can read in the Old Testament and that's the pattern. Why? Because the high priest, though he was in that office, he himself was still a sinner. But Jesus, our great high priest, God in flesh, never sinned. He's perfect. He's just. He, when he made an offering for sin, did not need to make an offering for his own sin. He had no sin. He made an offering for the sin of the world. He took upon us, upon himself, our sins. He took upon himself the sin of the world. The Bible says here that he suffered for sins, the just for the unjust. Then notice this phrase that he might bring us to God. Literally reconciliation. We were at enmity with God. But he provides this way of reconciliation. The Bible says being put to death in the flesh, but quickened by the Spirit, the resurrection. And this morning when we think about, we understand the death of Christ, it was a violent death, it was a voluntary death, it was a vicarious death. Could I say this this morning, number four? The death of Christ was a victorious death. It was a victorious death. I'm thankful for the victory, yes, at the garden with the resurrection and we understand that his death, the death of Christ, does not end the account. Oh, they buried him in a borrowed tomb and three days later he rose conquering sin, death and the grave. But I want you to consider with me, I mentioned earlier that John 19, so turn over there if you will, in John 19 and I want you to see what Jesus says here in this passage of scripture, the record of this, the crucifixion of Christ given by John here. In John chapter 19, you could begin in verse 17 and read throughout this account here that is given with regard to the crucifixion. We're going to jump right in the midst of it. In verse number 28, the Bible says, after this Jesus, knowing that all things were now accomplished that the scripture might be fulfilled, saith I, thirst. Now there was said a vessel full of vinegar and they filled a sponge with vinegar and put it upon hyssop and put it to his mouth. We read of that in Matthew 27 and verse 48. We mentioned that in Matthew 27, the Bible says that he cried. We mentioned it does not tell us exactly. It says in Jesus when he had cried again with a loud voice, yielded up the ghost. In verse 50, but now look in verse 30 here of John 19, it says when Jesus therefore had received the vinegar, he said, it is finished. Aren't those three precious words? It is finished. And he bowed his head and gave up the ghost. He died. He died a real death. There are some false teachers that teach that he didn't really die and he didn't really rise and all those types of things but we see that he died. In fact, the evidence is given in the next few verses, the Jews therefore, because it was the preparation, verse 31, the body should not remain upon the cross on the Sabbath day. For that Sabbath day was a high day, the salt pilot, that their legs might be broken and that they might be taken away. Remember I mentioned that earlier that to expedite the process because they had made it a crucifixion to be such a long drawn out process of great pain and inflict as much pain as possible. But if they needed to expedite the process, they would break the legs and we see that in verse 31. Verse 32, then came the soldiers and break the legs of the first and of the other which was crucified with him. But, notice verse 33, when they came to Jesus and saw that he was dead already. They break not his legs. You can look over at Psalm 34 and verse 20, we won't take the time to do that. But one of the soldiers, verse 34, with a spear pierced his side and forthwith came there out blood and water and he that saw it bare a record and his record is true and he knoweth that he sayeth, and he knoweth that he sayeth true that ye might believe for these things were done that the scripture should be fulfilled. A bone of him shall not be broken and again another scripture saith they shall look on him whom they pierced. It's amazing when you study the prophecies that are fulfilled during the crucifixion and you read of the prophecies, understand that those that are carrying out this crucifixion, they were not aware of the prophecies and saying, okay let's do this so that we can fulfill this. No, they were crucifying him but Jesus, God, gave us those prophecies centuries earlier so that we could understand the fulfillment that he was making when he went to that cross. But we find that he says, it is finished. What a great proclamation of victory. It is finished. I mentioned by way of introduction this morning that there was a promise today as we sit here in 2024, the promise that was given to Abraham in Genesis 22, 18 is 4,000 years ago roughly that that promise was given and we sit here and as we look at the passages of scripture that we've looked at this morning, the time of the Lord Jesus Christ was 2,000, 2,100 years after that promise was given to Abraham and we find that how was it that God could say to Abraham that in thy seed shall the nations, shall all the nations of the earth be blessed because thou hast obeyed my voice and Paul makes it clear that he said seed, not seeds and that the seed is Christ and how is it that Christ would bring that blessing that was made available through his death on the cross of Calvary. His subsequent resurrection that we'll look at next week where he rose in victory conquering sin death in the grave. But I want to remind you of two passages. First turn over to Hebrews 2 if you will. Hebrews chapter number 2 we'll look at a verse of scripture here. In Hebrews chapter number 2 look if you will at verse number 14 the Bible says for as much then as the children are partakers of flesh and blood he also himself likewise took part of the same. Notice what the Bible says at the end of verse number 14 that through death he might destroy him that had the power of death that is the devil. Through death. It was a victorious death. I mean it was a violent death. We've read in the passage of scripture in Matthew 27 the violence that surrounded the death of our savior of Christ. We understand it was a voluntary death that he went willingly to the cross. It was vicarious. He took my place. He suffered and bled and died for me and for you and for all of humankind. We find however it's a victorious death. You know the sin of mankind could not be paid for simply through the birth of Christ. No that's not sufficient. We don't read in Hebrews 2 that through his birth he, no through his death. Yes we read of the glorious resurrection and again I mentioned that the resurrection is evidence that his death was sufficient payment for the sin of mankind. But we look here and it says in Hebrews 2 remember the book of Hebrews is all about Jesus and it's all about how Jesus is better, how he's superior. And notice if you will in the first chapter in Hebrews chapter 1 and verse number 3. Notice what the Bible says and perhaps I should have read this verse before the one in Hebrews 2. But the Bible says of Jesus who being the brightness of his glory and the express image of his person and upholding all things by the word of his power when he had by himself purged our sins sat down on the right hand of the majesty on high. We find that we go through the portion of Hebrews 1 and 2 and we read how Christ is superior and how he's better and he's greater. And we come to chapter 2 and we read this truth that through the death of Christ he might destroy him that had the power of death, that is the devil. First John chapter 3. Look there if you will in first John chapter number 3. In first John chapter 3 in verse number 8 the Bible says he that committed the sins of the devil for the devil sinneth from the beginning. For this purpose the son of God was manifested that he might destroy the works of the devil. There are many people today if you look back at Hebrews 2 and it tells us how Jesus through his death that he had the opportunity to destroy him that had the power of death, that is the devil. But I want you to understand. understand the impact, if you will, the application for us in verse number 15, and deliver them who through fear of death were all their lifetime subject to bondage. There are a lot of people that are afraid of death, afraid of death, the uncertainty of death, what happens. You know, there are some brave people, quote-unquote, that will give you a good talk and they'll say, I'm not afraid to die, and I don't believe in anything, and I'm my own judge, and all these times, I've had people tell me all kinds of crazy stuff. Well, I'll tell you what, when you come face-to-face with death, it's a fearful thing, if you don't know the Lord Jesus Christ, the one who conquered death. We find that He conquered sin, death, and the grave, yes, His death on the cross, His subsequent resurrection, and we look this morning at this text of Scripture during this time of year as we will be celebrating the resurrection, listen, there's no resurrection without a death. The resurrection is the cornerstone of our faith, but there's no resurrection without a death. There's no death without a birth, I mean, all of it is necessary, amen? You can't just take one piece of it, all of it is necessary, and we find it as we come to the Scriptures and we open the Word of God, and we have this great truth of how Jesus, God in flesh, died for us. He died for humanity, and we find that He died for humanity because He loved His creation. He's the Creator, and He loved, for God so loved the world. But God commendeth His love toward us, and that while we're yet sinners, Christ died for us. Two takeaways this morning, number one, I hope that as we look at a passage of Scripture like Matthew 27, as we consider the other verses of Scripture this morning, I hope that you would not be guilty of neglecting so great salvation. I hope this morning that you would rejoice regularly in your salvation, that you would be aware regularly in your daily life of what Christ did so that you could go to heaven. I hope that you understand, I mean, every day of your life, how blessed you are to have been given the truth of the Gospel, to be saved by the blood of Christ. But I hope this morning not only would we rejoice in these wonderful truths, but I hope that we'd be challenged to share this wonderful truth with those that we come into contact with. You know, there are countless people in our community that have no idea why Jesus died. Many that don't even believe in Jesus, I understand that, but even as you begin to have a conversation with them about Jesus, why did He die? You're left with blank stares. You're left with sometimes answers that are not biblical. They do not understand. They do not have the truth that we hold dear today, and so that gives us a responsibility. It gives us an opportunity. I guarantee you this week, as you go throughout your week, that you're going to come in contact with someone. Unless you sit at home all week and do nothing, you're going to come in contact with someone that needs to know the truth that we dealt with today. That God, listen, this time of year, I know it's been overly commercialized and the Easter Bunny and all that nonsense. I understand, it's crazy. It's distracting from the truth. The truth is that we serve a risen Savior. The truth is the resurrection only happens because He died. And we must recognize this morning, it was a violent death. I'm thankful to have free salvation. Some people say, I'm trying to work for it. You can't work for it. It's already been paid for. You know how crazy it is if somebody was trying to give you a gift? I mean, they try to give you a gift and you say, well, I'll take it, but I'll work for it. No, no, no, it's not a gift anymore. Amen? And Jesus said, I have a gift for you. The gift of God's eternal life is a violent death, is a voluntary death, vicarious death, a victorious death. And we sing the victory, we shout the victory, and we proclaim a glorious message to a lost and dying world that Jesus saves, Jesus saves. First Timothy, Paul said this, this is a faithful saying and worthy of all acceptation, that Christ Jesus came into the world to save sinners. He says, of whom I am chief. How did he accomplish that? Through the death on the cross, his subsequent resurrection. I hope this morning that you recognize and appreciate greatly your salvation. You recognize what Christ did so that you could be saved. But I hope also that God would stir us up and give us a passion to tell somebody about Jesus. We sing today about Jesus coming back. If you're looking at things in the world, I mean, listen, it seems like Jesus is coming back soon. I don't know, no man knoweth the hour, but I want to be busy about doing the work of God. Oh, I'll tell them later at a more convenient time. You may not have another opportunity. You may not have a more convenient time. We must redeem the time that God has given us. They crucified him, but he gave up his life for us. Let's pray. Father, we love you. We thank you for loving us. We thank you for your word. We thank you for your substitutionary death on the cross of Calvary. I thank you that you took my place, you took our place. God, it's such a blessing to know that heaven is our home. God, if there's one present that's not sure of heaven, they've never been saved. They've never understood these truths that we looked at this morning. Maybe they're trying to get to heaven on their own by some good works or some other ideas. Lord, I pray that you would help them this morning to understand the truth of your word. They would understand that they're a sinner in need of the only Savior, the Lord Jesus Christ, that he bled and died to take their place. He was buried and he rose, conquering sin, death, and the grave. God, I pray that you would help us to have a passion to reach the lost. Lord, give us a desire to obey, to be willing to go out and tell others. Lord, give us opportunities, give us divine appointments, and I pray that you would help us, Lord, to be faithful. Help us to pray even as the disciples prayed in the book of Acts. God, give us boldness, that we may open our mouth with boldness, that we might speak as we ought to speak. I pray that you'd work and move in the hearts and lives of those that are gathered through this time of invitation. For it's in Christ's name we pray. You just stand with me, heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano as we have a time of invitation, give you an opportunity to respond. If you're not sure of heaven, we'll take a Bible and show you how you can know for sure that heaven's your home. Maybe you just need to come to the Old Fashioned Altar and pray this morning as Kimberly plays The Altar is Open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.2799999713897705,
      "text": " and we have an opportunity this morning"
    },
    {
      "id": 1,
      "start": 2.2799999713897705,
      "end": 3.8399999141693115,
      "text": " as we look at this portion of scripture"
    },
    {
      "id": 2,
      "start": 3.8399999141693115,
      "end": 7.039999961853027,
      "text": " to be reminded of what Christ did for us"
    },
    {
      "id": 3,
      "start": 7.039999961853027,
      "end": 9.600000381469727,
      "text": " so that we could be heaven bound, amen?"
    },
    {
      "id": 4,
      "start": 9.600000381469727,
      "end": 12.039999961853027,
      "text": " And I'm so thankful that heaven is my home."
    },
    {
      "id": 5,
      "start": 12.039999961853027,
      "end": 14.720000267028809,
      "text": " If you do not know with certainty this morning,"
    },
    {
      "id": 6,
      "start": 14.720000267028809,
      "end": 18.079999923706055,
      "text": " with 100% confidence that if you were to die today,"
    },
    {
      "id": 7,
      "start": 18.079999923706055,
      "end": 19.600000381469727,
      "text": " that heaven is your home,"
    },
    {
      "id": 8,
      "start": 19.600000381469727,
      "end": 21.84000015258789,
      "text": " I hope that you would not leave here this morning"
    },
    {
      "id": 9,
      "start": 21.84000015258789,
      "end": 24.1200008392334,
      "text": " without having that settled,"
    },
    {
      "id": 10,
      "start": 24.1200008392334,
      "end": 27.15999984741211,
      "text": " that you can know for sure that heaven is your home."
    },
    {
      "id": 11,
      "start": 27.15999984741211,
      "end": 28.68000030517578,
      "text": " We're knocking doors last week"
    },
    {
      "id": 12,
      "start": 28.68000030517578,
      "end": 31.760000228881836,
      "text": " and I talked to a younger fella and he said,"
    },
    {
      "id": 13,
      "start": 31.760000228881836,
      "end": 33.47999954223633,
      "text": " you know, I don't know for sure,"
    },
    {
      "id": 14,
      "start": 33.47999954223633,
      "end": 35.79999923706055,
      "text": " but I'm trying to figure it out."
    },
    {
      "id": 15,
      "start": 35.79999923706055,
      "end": 38.68000030517578,
      "text": " And he was searching, I shared some scripture with him."
    },
    {
      "id": 16,
      "start": 38.68000030517578,
      "end": 40.7599983215332,
      "text": " He said, you know, I just don't know"
    },
    {
      "id": 17,
      "start": 40.7599983215332,
      "end": 43.47999954223633,
      "text": " that you can really know."
    },
    {
      "id": 18,
      "start": 43.47999954223633,
      "end": 46.63999938964844,
      "text": " And I said, well, I'm thankful that the Bible tells us"
    },
    {
      "id": 19,
      "start": 46.63999938964844,
      "end": 50.439998626708984,
      "text": " that we can know that we know that we know"
    },
    {
      "id": 20,
      "start": 50.439998626708984,
      "end": 53.20000076293945,
      "text": " that heaven is our home, amen?"
    },
    {
      "id": 21,
      "start": 53.20000076293945,
      "end": 54.959999084472656,
      "text": " And what a blessing that is,"
    },
    {
      "id": 22,
      "start": 54.959999084472656,
      "end": 57.2400016784668,
      "text": " able to share some scripture, plant some seed."
    },
    {
      "id": 23,
      "start": 57.31999969482422,
      "end": 59.15999984741211,
      "text": " Remember, God gives the increase."
    },
    {
      "id": 24,
      "start": 59.15999984741211,
      "end": 61.63999938964844,
      "text": " We have the responsibility of sowing the seed"
    },
    {
      "id": 25,
      "start": 61.63999938964844,
      "end": 62.959999084472656,
      "text": " and what a blessing."
    },
    {
      "id": 26,
      "start": 62.959999084472656,
      "end": 63.79999923706055,
      "text": " And so this morning,"
    },
    {
      "id": 27,
      "start": 63.79999923706055,
      "end": 65.23999786376953,
      "text": " as we look at this portion of scripture,"
    },
    {
      "id": 28,
      "start": 65.23999786376953,
      "end": 67.76000213623047,
      "text": " we'll get there in just a moment in Matthew 27,"
    },
    {
      "id": 29,
      "start": 67.76000213623047,
      "end": 70.95999908447266,
      "text": " but I wanna remind you that back in Genesis chapter 22"
    },
    {
      "id": 30,
      "start": 70.95999908447266,
      "end": 74.55999755859375,
      "text": " in verse number 18, God gave a promise to Abraham."
    },
    {
      "id": 31,
      "start": 74.55999755859375,
      "end": 76.23999786376953,
      "text": " And here's the promise that he says,"
    },
    {
      "id": 32,
      "start": 76.23999786376953,
      "end": 81.23999786376953,
      "text": " in thy seed shall all the nations of the earth be blessed"
    },
    {
      "id": 33,
      "start": 82.04000091552734,
      "end": 86.91999816894531,
      "text": " because thou hast obeyed my voice."
    },
    {
      "id": 34,
      "start": 87.5999984741211,
      "end": 90.63999938964844,
      "text": " We find that the apostle Paul references this promise"
    },
    {
      "id": 35,
      "start": 90.63999938964844,
      "end": 94.68000030517578,
      "text": " that God gave to Abraham in Genesis 22 in verse 18."
    },
    {
      "id": 36,
      "start": 94.68000030517578,
      "end": 98.04000091552734,
      "text": " He references that promise in Galatians three"
    },
    {
      "id": 37,
      "start": 98.04000091552734,
      "end": 100.19999694824219,
      "text": " and verse number 16."
    },
    {
      "id": 38,
      "start": 100.19999694824219,
      "end": 101.5999984741211,
      "text": " And here's what he says."
    },
    {
      "id": 39,
      "start": 101.5999984741211,
      "end": 104.91999816894531,
      "text": " He says this, he says that it's the seed,"
    },
    {
      "id": 40,
      "start": 104.91999816894531,
      "end": 108.63999938964844,
      "text": " not seeds plural, but the seed."
    },
    {
      "id": 41,
      "start": 108.63999938964844,
      "end": 113.36000061035156,
      "text": " And he makes this great statement that seed is Christ."
    },
    {
      "id": 42,
      "start": 113.36000061035156,
      "end": 116.4000015258789,
      "text": " We find that a few verses earlier in Galatians three"
    },
    {
      "id": 43,
      "start": 116.91999816894531,
      "end": 119.0,
      "text": " and verse number 13, the Bible says,"
    },
    {
      "id": 44,
      "start": 119.0,
      "end": 124.0,
      "text": " Christ hath redeemed us from the curse of the law"
    },
    {
      "id": 45,
      "start": 124.5999984741211,
      "end": 129.39999389648438,
      "text": " being made a curse for us, for it is written,"
    },
    {
      "id": 46,
      "start": 129.39999389648438,
      "end": 133.39999389648438,
      "text": " cursed is everyone that hangeth on a tree."
    },
    {
      "id": 47,
      "start": 134.32000732421875,
      "end": 138.60000610351562,
      "text": " We read in Hebrews nine, verses 16 and 17,"
    },
    {
      "id": 48,
      "start": 138.60000610351562,
      "end": 141.75999450683594,
      "text": " for where a testament is,"
    },
    {
      "id": 49,
      "start": 141.75999450683594,
      "end": 146.75999450683594,
      "text": " there must also of necessity be the death of the testator."
    },
    {
      "id": 50,
      "start": 149.39999389648438,
      "end": 153.63999938964844,
      "text": " For a testament is a force after men are dead."
    },
    {
      "id": 51,
      "start": 153.63999938964844,
      "end": 156.63999938964844,
      "text": " Otherwise it is of no strength at all"
    },
    {
      "id": 52,
      "start": 156.63999938964844,
      "end": 159.63999938964844,
      "text": " while the testator liveth."
    },
    {
      "id": 53,
      "start": 159.63999938964844,
      "end": 162.60000610351562,
      "text": " I referenced those verses of scripture this morning"
    },
    {
      "id": 54,
      "start": 162.60000610351562,
      "end": 165.16000366210938,
      "text": " in Genesis and Galatians and Hebrews"
    },
    {
      "id": 55,
      "start": 165.16000366210938,
      "end": 169.60000610351562,
      "text": " as really a way of introduction to our text in Matthew 27."
    },
    {
      "id": 56,
      "start": 169.60000610351562,
      "end": 171.9600067138672,
      "text": " See the seed of Abraham that would bring a blessing"
    },
    {
      "id": 57,
      "start": 171.9600067138672,
      "end": 174.67999267578125,
      "text": " to all nations is Jesus Christ."
    },
    {
      "id": 58,
      "start": 174.67999267578125,
      "end": 177.83999633789062,
      "text": " We find that the means by which this blessing"
    },
    {
      "id": 59,
      "start": 177.83999633789062,
      "end": 180.89999389648438,
      "text": " would be made available to all human beings"
    },
    {
      "id": 60,
      "start": 180.89999389648438,
      "end": 184.8000030517578,
      "text": " would be through the death, his death"
    },
    {
      "id": 61,
      "start": 184.8000030517578,
      "end": 186.4199981689453,
      "text": " on the cross of Calvary."
    },
    {
      "id": 62,
      "start": 186.4199981689453,
      "end": 190.32000732421875,
      "text": " We understand that his subsequent glorious resurrection,"
    },
    {
      "id": 63,
      "start": 190.32000732421875,
      "end": 192.36000061035156,
      "text": " and we'll focus on that next week,"
    },
    {
      "id": 64,
      "start": 192.36000061035156,
      "end": 196.9600067138672,
      "text": " is evidence that his death was sufficient payment"
    },
    {
      "id": 65,
      "start": 196.9600067138672,
      "end": 199.82000732421875,
      "text": " for the sin of the world."
    },
    {
      "id": 66,
      "start": 199.82000732421875,
      "end": 201.55999755859375,
      "text": " See, it was absolutely necessary"
    },
    {
      "id": 67,
      "start": 201.55999755859375,
      "end": 203.9600067138672,
      "text": " that Jesus go to a cruel cross."
    },
    {
      "id": 68,
      "start": 203.9600067138672,
      "end": 206.60000610351562,
      "text": " It was prophesied, in fact, in Genesis three"
    },
    {
      "id": 69,
      "start": 206.60000610351562,
      "end": 209.4199981689453,
      "text": " in verse number 15 is the very first reference"
    },
    {
      "id": 70,
      "start": 209.4199981689453,
      "end": 210.9600067138672,
      "text": " that you find in all of the Bible"
    },
    {
      "id": 71,
      "start": 210.9600067138672,
      "end": 213.1999969482422,
      "text": " that's a prophecy that one day"
    },
    {
      "id": 72,
      "start": 213.1999969482422,
      "end": 215.27999877929688,
      "text": " Messiah would come and he would die."
    },
    {
      "id": 73,
      "start": 215.27999877929688,
      "end": 220.27999877929688,
      "text": " We find that Peter, he mentions that Jesus is"
    },
    {
      "id": 74,
      "start": 221.1199951171875,
      "end": 223.16000366210938,
      "text": " the Lamb of God that was slain"
    },
    {
      "id": 75,
      "start": 223.16000366210938,
      "end": 225.32000732421875,
      "text": " before the foundation of the world."
    },
    {
      "id": 76,
      "start": 225.32000732421875,
      "end": 227.36000061035156,
      "text": " Jesus said during his earthly ministry,"
    },
    {
      "id": 77,
      "start": 227.36000061035156,
      "end": 230.63999938964844,
      "text": " I'm come to seek and to save that which was lost."
    },
    {
      "id": 78,
      "start": 230.63999938964844,
      "end": 232.75999450683594,
      "text": " And he came seeking sinners"
    },
    {
      "id": 79,
      "start": 232.75999450683594,
      "end": 235.13999938964844,
      "text": " and he was coming to save sinners."
    },
    {
      "id": 80,
      "start": 235.13999938964844,
      "end": 240.13999938964844,
      "text": " We sing often, it's been normally a Christmas type of a song"
    },
    {
      "id": 81,
      "start": 240.36000061035156,
      "end": 244.67999267578125,
      "text": " that the choir might sing, but born to die."
    },
    {
      "id": 82,
      "start": 244.67999267578125,
      "end": 247.44000244140625,
      "text": " Yes, Jesus, he was born to die"
    },
    {
      "id": 83,
      "start": 247.44000244140625,
      "end": 249.47999572753906,
      "text": " and he had to go to that cruel cross"
    },
    {
      "id": 84,
      "start": 249.47999572753906,
      "end": 252.1999969482422,
      "text": " so that mankind could be redeemed."
    },
    {
      "id": 85,
      "start": 252.1999969482422,
      "end": 254.1199951171875,
      "text": " See, so often as we have an opportunity"
    },
    {
      "id": 86,
      "start": 254.1199951171875,
      "end": 257.0400085449219,
      "text": " to give the gospel, so often as we have the opportunity"
    },
    {
      "id": 87,
      "start": 257.0400085449219,
      "end": 259.55999755859375,
      "text": " to be a representative, an ambassador"
    },
    {
      "id": 88,
      "start": 259.55999755859375,
      "end": 260.9200134277344,
      "text": " for the Lord Jesus Christ,"
    },
    {
      "id": 89,
      "start": 260.9200134277344,
      "end": 262.9599914550781,
      "text": " we often mention something like this,"
    },
    {
      "id": 90,
      "start": 262.9599914550781,
      "end": 266.0799865722656,
      "text": " that the Lord offers a free gift"
    },
    {
      "id": 91,
      "start": 266.0799865722656,
      "end": 268.4800109863281,
      "text": " of eternal life salvation."
    },
    {
      "id": 92,
      "start": 268.4800109863281,
      "end": 270.3999938964844,
      "text": " The Bible says that the wage of sin is death,"
    },
    {
      "id": 93,
      "start": 270.3999938964844,
      "end": 273.6000061035156,
      "text": " but the gift of God is eternal life"
    },
    {
      "id": 94,
      "start": 273.6000061035156,
      "end": 275.8399963378906,
      "text": " through Jesus Christ, our Lord."
    },
    {
      "id": 95,
      "start": 275.8399963378906,
      "end": 278.9599914550781,
      "text": " The gift of God is free to the recipient"
    },
    {
      "id": 96,
      "start": 278.9599914550781,
      "end": 283.1199951171875,
      "text": " because it was paid for by the blood of Jesus Christ."
    },
    {
      "id": 97,
      "start": 283.1199951171875,
      "end": 285.9800109863281,
      "text": " And as we look at the text of scripture this morning,"
    },
    {
      "id": 98,
      "start": 285.9800109863281,
      "end": 290.44000244140625,
      "text": " we are reminded of all that Jesus endured"
    },
    {
      "id": 99,
      "start": 290.44000244140625,
      "end": 292.8800048828125,
      "text": " so that you and I could go to heaven,"
    },
    {
      "id": 100,
      "start": 292.8800048828125,
      "end": 295.1199951171875,
      "text": " so that we could understand this morning"
    },
    {
      "id": 101,
      "start": 295.1199951171875,
      "end": 297.6000061035156,
      "text": " that heaven is our home."
    },
    {
      "id": 102,
      "start": 297.6000061035156,
      "end": 300.2799987792969,
      "text": " See, we're all sinners, all mankind have sinned."
    },
    {
      "id": 103,
      "start": 300.2799987792969,
      "end": 303.0,
      "text": " The Bible says there's none righteous, no, not one."
    },
    {
      "id": 104,
      "start": 303.0,
      "end": 304.8800048828125,
      "text": " And we come to a passage of scripture"
    },
    {
      "id": 105,
      "start": 304.8800048828125,
      "end": 306.7200012207031,
      "text": " and we can read of the crucifixion."
    },
    {
      "id": 106,
      "start": 306.7200012207031,
      "end": 310.1199951171875,
      "text": " I've titled the message this morning from Matthew 27,"
    },
    {
      "id": 107,
      "start": 310.1199951171875,
      "end": 313.3999938964844,
      "text": " they crucified him."
    },
    {
      "id": 108,
      "start": 313.3999938964844,
      "end": 315.20001220703125,
      "text": " Notice in verse number 35,"
    },
    {
      "id": 109,
      "start": 315.20001220703125,
      "end": 316.9200134277344,
      "text": " we'll read all of the text as we get through it."
    },
    {
      "id": 110,
      "start": 316.9200134277344,
      "end": 319.1600036621094,
      "text": " Actually, let's just begin reading in verse 27."
    },
    {
      "id": 111,
      "start": 319.1600036621094,
      "end": 322.55999755859375,
      "text": " The Bible says, then the soldiers of the governor"
    },
    {
      "id": 112,
      "start": 322.55999755859375,
      "end": 324.9200134277344,
      "text": " took Jesus into the common hall"
    },
    {
      "id": 113,
      "start": 324.9200134277344,
      "end": 328.9200134277344,
      "text": " and gathered unto him the whole band of soldiers."
    },
    {
      "id": 114,
      "start": 328.9200134277344,
      "end": 333.3999938964844,
      "text": " And they stripped him and put on him a scarlet robe."
    },
    {
      "id": 115,
      "start": 333.3999938964844,
      "end": 335.7200012207031,
      "text": " When they had plotted a crown of thorns,"
    },
    {
      "id": 116,
      "start": 335.7200012207031,
      "end": 338.4800109863281,
      "text": " they put it upon his head."
    },
    {
      "id": 117,
      "start": 338.5199890136719,
      "end": 340.67999267578125,
      "text": " And a reed in his right hand."
    },
    {
      "id": 118,
      "start": 340.67999267578125,
      "end": 344.239990234375,
      "text": " And they bowed the knee before him and mocked him,"
    },
    {
      "id": 119,
      "start": 344.239990234375,
      "end": 347.5199890136719,
      "text": " saying, hail, king of the Jews."
    },
    {
      "id": 120,
      "start": 347.5199890136719,
      "end": 350.239990234375,
      "text": " And they spit upon him and took the reed"
    },
    {
      "id": 121,
      "start": 350.239990234375,
      "end": 353.0799865722656,
      "text": " and smote him on the head."
    },
    {
      "id": 122,
      "start": 353.0799865722656,
      "end": 355.0799865722656,
      "text": " And after that, they had mocked him."
    },
    {
      "id": 123,
      "start": 355.0799865722656,
      "end": 357.1600036621094,
      "text": " They took the robe off from him"
    },
    {
      "id": 124,
      "start": 357.1600036621094,
      "end": 359.5199890136719,
      "text": " and put his own raiment on him"
    },
    {
      "id": 125,
      "start": 359.5199890136719,
      "end": 363.6400146484375,
      "text": " and led him away to crucify him."
    },
    {
      "id": 126,
      "start": 363.6400146484375,
      "end": 366.0400085449219,
      "text": " And as they came out, they found a man of Cyrene,"
    },
    {
      "id": 127,
      "start": 366.0400085449219,
      "end": 367.6400146484375,
      "text": " Simon by name."
    },
    {
      "id": 128,
      "start": 367.6400146484375,
      "end": 371.55999755859375,
      "text": " Him they compelled to bear his cross."
    },
    {
      "id": 129,
      "start": 371.55999755859375,
      "end": 374.20001220703125,
      "text": " When they were come unto a place called Golgotha,"
    },
    {
      "id": 130,
      "start": 374.20001220703125,
      "end": 376.7200012207031,
      "text": " that is to say a place of a skull,"
    },
    {
      "id": 131,
      "start": 376.7200012207031,
      "end": 379.239990234375,
      "text": " they gave him vinegar to drink mingled with gall."
    },
    {
      "id": 132,
      "start": 379.239990234375,
      "end": 382.9599914550781,
      "text": " And when he had tasted thereof, he would not drink."
    },
    {
      "id": 133,
      "start": 382.9599914550781,
      "end": 386.2799987792969,
      "text": " And notice verse 35, and they crucified him."
    },
    {
      "id": 134,
      "start": 386.2799987792969,
      "end": 388.32000732421875,
      "text": " And parted his garments, casting lots"
    },
    {
      "id": 135,
      "start": 388.32000732421875,
      "end": 391.760009765625,
      "text": " that it might be fulfilled, which was spoken by the prophet."
    },
    {
      "id": 136,
      "start": 391.760009765625,
      "end": 393.9200134277344,
      "text": " They parted my garments among them."
    },
    {
      "id": 137,
      "start": 394.9200134277344,
      "end": 398.1199951171875,
      "text": " And upon my vesture did they cast lots."
    },
    {
      "id": 138,
      "start": 398.1199951171875,
      "end": 401.6400146484375,
      "text": " And sitting down, they watched him there."
    },
    {
      "id": 139,
      "start": 401.6400146484375,
      "end": 405.0799865722656,
      "text": " And set up over his head his accusation written,"
    },
    {
      "id": 140,
      "start": 405.0799865722656,
      "end": 408.1199951171875,
      "text": " this is Jesus, the king of the Jews."
    },
    {
      "id": 141,
      "start": 408.1199951171875,
      "end": 410.9599914550781,
      "text": " Then were there two thieves crucified with him,"
    },
    {
      "id": 142,
      "start": 410.9599914550781,
      "end": 415.239990234375,
      "text": " one on the right hand and another on the left."
    },
    {
      "id": 143,
      "start": 415.239990234375,
      "end": 420.239990234375,
      "text": " They that passed by reviled him, wagging their heads."
    },
    {
      "id": 144,
      "start": 420.8800048828125,
      "end": 424.8399963378906,
      "text": " And saying, thou that destroyest the temple"
    },
    {
      "id": 145,
      "start": 424.8399963378906,
      "end": 429.8399963378906,
      "text": " and buildest it in three days, save thyself."
    },
    {
      "id": 146,
      "start": 430.0799865722656,
      "end": 434.67999267578125,
      "text": " If thou be the son of God, come down from the cross."
    },
    {
      "id": 147,
      "start": 434.67999267578125,
      "end": 436.55999755859375,
      "text": " I'm thankful that he is the son of God"
    },
    {
      "id": 148,
      "start": 436.55999755859375,
      "end": 439.3599853515625,
      "text": " and I'm thankful that he stayed on the cross."
    },
    {
      "id": 149,
      "start": 439.3599853515625,
      "end": 440.20001220703125,
      "text": " Amen."
    },
    {
      "id": 150,
      "start": 441.239990234375,
      "end": 444.8800048828125,
      "text": " Likewise also, the chief priests mocking him"
    },
    {
      "id": 151,
      "start": 444.8800048828125,
      "end": 448.1199951171875,
      "text": " with the scribes and elders said, he saved others."
    },
    {
      "id": 152,
      "start": 448.9599914550781,
      "end": 452.1600036621094,
      "text": " Himself he cannot save."
    },
    {
      "id": 153,
      "start": 452.1600036621094,
      "end": 454.0,
      "text": " If he be the king of Israel,"
    },
    {
      "id": 154,
      "start": 454.0,
      "end": 455.79998779296875,
      "text": " let him now come down from the cross"
    },
    {
      "id": 155,
      "start": 455.79998779296875,
      "end": 458.1199951171875,
      "text": " and we will believe him."
    },
    {
      "id": 156,
      "start": 458.1199951171875,
      "end": 460.20001220703125,
      "text": " He trusted in God, let him deliver him now"
    },
    {
      "id": 157,
      "start": 460.20001220703125,
      "end": 461.4800109863281,
      "text": " if he will have him."
    },
    {
      "id": 158,
      "start": 461.4800109863281,
      "end": 462.8800048828125,
      "text": " For he said, I am the son of God."
    },
    {
      "id": 159,
      "start": 462.8800048828125,
      "end": 465.44000244140625,
      "text": " The thieves also which were crucified with him"
    },
    {
      "id": 160,
      "start": 465.44000244140625,
      "end": 467.1600036621094,
      "text": " cast the same in his teeth."
    },
    {
      "id": 161,
      "start": 467.1600036621094,
      "end": 470.1600036621094,
      "text": " And it says in verse 45, now from the sixth hour,"
    },
    {
      "id": 162,
      "start": 470.1600036621094,
      "end": 474.8800048828125,
      "text": " there was darkness over all the land until the ninth hour."
    },
    {
      "id": 163,
      "start": 474.8800048828125,
      "end": 477.79998779296875,
      "text": " About the ninth hour, Jesus cried with a loud voice saying,"
    },
    {
      "id": 164,
      "start": 478.0799865722656,
      "end": 481.44000244140625,
      "text": " Eli, Eli, lama sabachthani, that is to say,"
    },
    {
      "id": 165,
      "start": 481.44000244140625,
      "end": 485.239990234375,
      "text": " my God, my God, why hast thou forsaken me?"
    },
    {
      "id": 166,
      "start": 485.239990234375,
      "end": 487.3599853515625,
      "text": " Some of them stood there."
    },
    {
      "id": 167,
      "start": 487.3599853515625,
      "end": 489.3999938964844,
      "text": " When they heard that, they said,"
    },
    {
      "id": 168,
      "start": 489.3999938964844,
      "end": 491.1199951171875,
      "text": " this man calleth for Elias."
    },
    {
      "id": 169,
      "start": 491.1199951171875,
      "end": 493.4800109863281,
      "text": " And straightway, one of them ran and took a sponge"
    },
    {
      "id": 170,
      "start": 493.4800109863281,
      "end": 495.760009765625,
      "text": " and filled it with vinegar and put it on a reed"
    },
    {
      "id": 171,
      "start": 495.760009765625,
      "end": 497.4200134277344,
      "text": " and gave him to drink."
    },
    {
      "id": 172,
      "start": 497.4200134277344,
      "end": 500.2799987792969,
      "text": " The rest said, let be, let us see whether Elias"
    },
    {
      "id": 173,
      "start": 500.2799987792969,
      "end": 501.3999938964844,
      "text": " will come to save him."
    },
    {
      "id": 174,
      "start": 501.3999938964844,
      "end": 505.67999267578125,
      "text": " Jesus, when he had cried again with a loud voice,"
    },
    {
      "id": 175,
      "start": 505.67999267578125,
      "end": 509.32000732421875,
      "text": " yielded up the ghost."
    },
    {
      "id": 176,
      "start": 509.32000732421875,
      "end": 511.55999755859375,
      "text": " We see in verse number 50 that the Bible says"
    },
    {
      "id": 177,
      "start": 511.55999755859375,
      "end": 513.9199829101562,
      "text": " that Jesus cried with a loud voice."
    },
    {
      "id": 178,
      "start": 513.9199829101562,
      "end": 515.47998046875,
      "text": " If you look at the Gospel of John,"
    },
    {
      "id": 179,
      "start": 515.47998046875,
      "end": 516.719970703125,
      "text": " we won't turn there at this point,"
    },
    {
      "id": 180,
      "start": 516.719970703125,
      "end": 520.239990234375,
      "text": " but in 19 and verse 30, we know that that cry was this,"
    },
    {
      "id": 181,
      "start": 520.239990234375,
      "end": 522.5599975585938,
      "text": " it is finished."
    },
    {
      "id": 182,
      "start": 524.2000122070312,
      "end": 525.6400146484375,
      "text": " It is finished."
    },
    {
      "id": 183,
      "start": 525.6400146484375,
      "end": 528.0800170898438,
      "text": " I'm thankful this morning that as we look at this portion"
    },
    {
      "id": 184,
      "start": 528.0800170898438,
      "end": 531.760009765625,
      "text": " of Scripture and honestly, what a heart-wrenching passage"
    },
    {
      "id": 185,
      "start": 531.760009765625,
      "end": 535.1599731445312,
      "text": " of Scripture to read when we consider all that our God,"
    },
    {
      "id": 186,
      "start": 535.1599731445312,
      "end": 538.6799926757812,
      "text": " all that he suffered so that we could go to heaven,"
    },
    {
      "id": 187,
      "start": 538.6799926757812,
      "end": 540.2000122070312,
      "text": " so that we could be redeemed."
    },
    {
      "id": 188,
      "start": 540.2000122070312,
      "end": 543.1199951171875,
      "text": " See, redemption is only through the blood of Christ."
    },
    {
      "id": 189,
      "start": 543.1199951171875,
      "end": 546.760009765625,
      "text": " Forgiveness of sins is only through the blood of Christ."
    },
    {
      "id": 190,
      "start": 546.760009765625,
      "end": 549.1599731445312,
      "text": " And as we look at this passage of Scripture,"
    },
    {
      "id": 191,
      "start": 549.1599731445312,
      "end": 551.6799926757812,
      "text": " I want you to consider four thoughts this morning."
    },
    {
      "id": 192,
      "start": 551.6799926757812,
      "end": 553.260009765625,
      "text": " Number one, if you're taking notes,"
    },
    {
      "id": 193,
      "start": 553.260009765625,
      "end": 557.2000122070312,
      "text": " the death of Christ was a violent death."
    },
    {
      "id": 194,
      "start": 557.2000122070312,
      "end": 559.1599731445312,
      "text": " The death of Christ was a violent death."
    },
    {
      "id": 195,
      "start": 559.1599731445312,
      "end": 560.3800048828125,
      "text": " Why do we bring that up?"
    },
    {
      "id": 196,
      "start": 560.3800048828125,
      "end": 562.760009765625,
      "text": " Why is it that we would discuss this morning"
    },
    {
      "id": 197,
      "start": 562.760009765625,
      "end": 566.0800170898438,
      "text": " the violence that surrounded the death of Christ?"
    },
    {
      "id": 198,
      "start": 566.0800170898438,
      "end": 568.2000122070312,
      "text": " Because it's important for us to understand"
    },
    {
      "id": 199,
      "start": 568.2000122070312,
      "end": 572.3200073242188,
      "text": " that our Savior suffered greatly"
    },
    {
      "id": 200,
      "start": 572.3200073242188,
      "end": 574.47998046875,
      "text": " so that we could be redeemed."
    },
    {
      "id": 201,
      "start": 574.47998046875,
      "end": 576.3400268554688,
      "text": " Even before the passage of Scripture"
    },
    {
      "id": 202,
      "start": 576.3400268554688,
      "end": 577.8800048828125,
      "text": " that I've read for you this morning,"
    },
    {
      "id": 203,
      "start": 577.8800048828125,
      "end": 580.280029296875,
      "text": " beginning in verse 27 of chapter 27"
    },
    {
      "id": 204,
      "start": 580.280029296875,
      "end": 582.2000122070312,
      "text": " and reading down through verse number 50,"
    },
    {
      "id": 205,
      "start": 582.2000122070312,
      "end": 583.7999877929688,
      "text": " we find that there were trials"
    },
    {
      "id": 206,
      "start": 583.7999877929688,
      "end": 585.6400146484375,
      "text": " that led to the crucifixion."
    },
    {
      "id": 207,
      "start": 585.6400146484375,
      "end": 587.5999755859375,
      "text": " Jesus stood before the high priest."
    },
    {
      "id": 208,
      "start": 587.5999755859375,
      "end": 590.1199951171875,
      "text": " He stood before the Sanhedrin."
    },
    {
      "id": 209,
      "start": 590.1199951171875,
      "end": 592.0800170898438,
      "text": " He stood before Pilate."
    },
    {
      "id": 210,
      "start": 592.0800170898438,
      "end": 593.5999755859375,
      "text": " In each of those circumstances,"
    },
    {
      "id": 211,
      "start": 593.5999755859375,
      "end": 597.3599853515625,
      "text": " we find that he endured some measure of cruelty."
    },
    {
      "id": 212,
      "start": 597.3599853515625,
      "end": 600.0399780273438,
      "text": " And we find that at the end of his time."
    },
    {
      "id": 0,
      "start": 600.0399780273438,
      "end": 605.4199781417847,
      "text": " there before Pilate that the Bible says that they scourged him, literally the idea is to"
    },
    {
      "id": 1,
      "start": 605.4199781417847,
      "end": 607.7599778175354,
      "text": " whip severely."
    },
    {
      "id": 2,
      "start": 607.7599778175354,
      "end": 612.0799779891968,
      "text": " We find that as we enter into the text of Scripture that we've read this morning, beginning"
    },
    {
      "id": 3,
      "start": 612.0799779891968,
      "end": 618.0599784851074,
      "text": " in verse 27, that we see the violence with regard to the death of our Savior on the cross"
    },
    {
      "id": 4,
      "start": 618.0599784851074,
      "end": 619.2199783325195,
      "text": " of Talvary."
    },
    {
      "id": 5,
      "start": 619.2199783325195,
      "end": 624.9599781036377,
      "text": " It begins in verse 29 by telling us about a crown of thorns."
    },
    {
      "id": 6,
      "start": 624.9599781036377,
      "end": 629.7799777984619,
      "text": " We understand that as we look at this passage of Scripture in verse 29 and how they were"
    },
    {
      "id": 7,
      "start": 629.7799777984619,
      "end": 635.6199798583984,
      "text": " mocking him and even to consider the ridicule that would be evidence there through their"
    },
    {
      "id": 8,
      "start": 635.6199798583984,
      "end": 641.6599769592285,
      "text": " mocking but the pain that was inflicted with this crown of thorns that was, the Bible tells"
    },
    {
      "id": 9,
      "start": 641.6599769592285,
      "end": 646.6199798583984,
      "text": " us they made it and they plaited it upon his head."
    },
    {
      "id": 10,
      "start": 646.6199798583984,
      "end": 653.359977722168,
      "text": " No doubt as they did so the thorns would pierce into the flesh and the blood would begin to"
    },
    {
      "id": 11,
      "start": 653.359977722168,
      "end": 659.0599784851074,
      "text": " stream down the face and we begin to see how that they were mocking him and they were bowing"
    },
    {
      "id": 12,
      "start": 659.0599784851074,
      "end": 664.3999786376953,
      "text": " before him and they were saying, hail, king of the Jews."
    },
    {
      "id": 13,
      "start": 664.3999786376953,
      "end": 671.1999816894531,
      "text": " We find in verse number 30 that the Bible tells us that they spit upon him."
    },
    {
      "id": 14,
      "start": 671.1999816894531,
      "end": 674.2399749755859,
      "text": " It's hard for me to even comprehend."
    },
    {
      "id": 15,
      "start": 674.2399749755859,
      "end": 678.6999816894531,
      "text": " I believe it's probably one of the lowest things you could ever do to a human being"
    },
    {
      "id": 16,
      "start": 678.6999816894531,
      "end": 682.1599807739258,
      "text": " is to spit in their face."
    },
    {
      "id": 17,
      "start": 682.1599807739258,
      "end": 685.3199768066406,
      "text": " It's absolutely disrespectful."
    },
    {
      "id": 18,
      "start": 685.3199768066406,
      "end": 690.4199752807617,
      "text": " It's literally the worst thing I can think of, just humiliating someone to spit in their"
    },
    {
      "id": 19,
      "start": 690.4199752807617,
      "end": 699.8799743652344,
      "text": " face and here Jesus, the Son of God, God in flesh, to pay for the sins of these people"
    },
    {
      "id": 20,
      "start": 699.8799743652344,
      "end": 706.9399795532227,
      "text": " that are crucifying him, to pay for our sins, they place that crown upon his head."
    },
    {
      "id": 21,
      "start": 706.9399795532227,
      "end": 709.2199783325195,
      "text": " They spit in his face."
    },
    {
      "id": 22,
      "start": 709.2199783325195,
      "end": 714.6399765014648,
      "text": " According to verse number 30, the Bible says that they smoke him on the head."
    },
    {
      "id": 23,
      "start": 714.6399765014648,
      "end": 722.0599746704102,
      "text": " The word smite, it literally means to strike with fierceness, but also with passion."
    },
    {
      "id": 24,
      "start": 722.0599746704102,
      "end": 726.7199783325195,
      "text": " Now we understand as we look at the whole of the story of the account that God gives"
    },
    {
      "id": 25,
      "start": 726.7199783325195,
      "end": 732.219970703125,
      "text": " us here in the gospel records and we don't have time to read all of it in one service,"
    },
    {
      "id": 26,
      "start": 732.219970703125,
      "end": 738.8599853515625,
      "text": " but we understand the passion by which the Jews cried out, crucify him, crucify him,"
    },
    {
      "id": 27,
      "start": 738.8599853515625,
      "end": 741.3399810791016,
      "text": " and now as Pilate delivered him."
    },
    {
      "id": 28,
      "start": 741.3399810791016,
      "end": 748.7999725341797,
      "text": " When they begin this, the Bible says that they smoke him on the head to strike, not"
    },
    {
      "id": 29,
      "start": 748.7999725341797,
      "end": 754.7999725341797,
      "text": " only with fierceness or force, but with passion."
    },
    {
      "id": 30,
      "start": 754.7999725341797,
      "end": 763.4399719238281,
      "text": " The anger that was evidenced, the Bible tells us, it summarizes in verse 35 and says, they"
    },
    {
      "id": 31,
      "start": 763.4399719238281,
      "end": 766.1999816894531,
      "text": " crucified him."
    },
    {
      "id": 32,
      "start": 766.1999816894531,
      "end": 773.3599853515625,
      "text": " You could do a study through just historical means and study the craft, if you will."
    },
    {
      "id": 33,
      "start": 773.3599853515625,
      "end": 779.8999786376953,
      "text": " It's a bad word to use, but it's the best word that I know to use with regard to crucifixion."
    },
    {
      "id": 34,
      "start": 779.8999786376953,
      "end": 788.1199798583984,
      "text": " It was really a craft or an art that they tried to master, to inflict as much pain on"
    },
    {
      "id": 35,
      "start": 788.1199798583984,
      "end": 791.2799835205078,
      "text": " an individual as humanly possible."
    },
    {
      "id": 36,
      "start": 791.2799835205078,
      "end": 797.7999725341797,
      "text": " They wanted the death of one that was to be crucified to be as slow and as agonizing"
    },
    {
      "id": 37,
      "start": 797.7999725341797,
      "end": 800.4999847412109,
      "text": " and as painful as possible."
    },
    {
      "id": 38,
      "start": 800.4999847412109,
      "end": 805.47998046875,
      "text": " They did not want to just have the individual that was being crucified die quickly, no,"
    },
    {
      "id": 39,
      "start": 805.47998046875,
      "end": 807.4399719238281,
      "text": " they wanted it to prolong."
    },
    {
      "id": 40,
      "start": 807.4399719238281,
      "end": 812.8399810791016,
      "text": " In fact, many times crucifixion, those that would be crucified, they would spend a couple"
    },
    {
      "id": 41,
      "start": 812.8399810791016,
      "end": 819.9599761962891,
      "text": " of days on the cross as they were suffering in torment and agony."
    },
    {
      "id": 42,
      "start": 819.9599761962891,
      "end": 824.9599761962891,
      "text": " And as we find with the two thieves that are crucified with Christ because of the timing"
    },
    {
      "id": 43,
      "start": 824.9599761962891,
      "end": 831.0799713134766,
      "text": " of the crucifixion of the Lord, we find that their legs were broken."
    },
    {
      "id": 44,
      "start": 831.0799713134766,
      "end": 835.5999755859375,
      "text": " Eventually that would happen if someone, if they wanted to expedite the process of the"
    },
    {
      "id": 45,
      "start": 835.5999755859375,
      "end": 838.9999847412109,
      "text": " individual dying, they would, they would break their legs."
    },
    {
      "id": 46,
      "start": 838.9999847412109,
      "end": 839.9999847412109,
      "text": " Why?"
    },
    {
      "id": 47,
      "start": 839.9999847412109,
      "end": 845.719970703125,
      "text": " Because then they could no longer hold themselves up and they would die of asphyxiation."
    },
    {
      "id": 48,
      "start": 845.719970703125,
      "end": 854.1199798583984,
      "text": " We find that Jesus, he did not have his legs broken, in fact that's a fulfillment of prophecy."
    },
    {
      "id": 49,
      "start": 854.1199798583984,
      "end": 859.1599731445312,
      "text": " We find that as we look at this passage of scripture again, I'm thankful that I don't"
    },
    {
      "id": 50,
      "start": 859.1599731445312,
      "end": 864.3199768066406,
      "text": " have to pay for my own sin, I'm thankful that Jesus paid for it."
    },
    {
      "id": 51,
      "start": 864.3199768066406,
      "end": 869.1199645996094,
      "text": " But we must understand this morning that the death of Christ was a violent death."
    },
    {
      "id": 52,
      "start": 869.1199645996094,
      "end": 876.3199768066406,
      "text": " He was violent as he hung upon that cross, all that they sought to inflict upon him."
    },
    {
      "id": 53,
      "start": 876.3199768066406,
      "end": 881.7599792480469,
      "text": " And even as I read the text of scripture where they said, if you are who you say you are,"
    },
    {
      "id": 54,
      "start": 881.7599792480469,
      "end": 887.1199645996094,
      "text": " come down, you said that destroy this temple and that you would build it in three days"
    },
    {
      "id": 55,
      "start": 887.1199645996094,
      "end": 893.5199890136719,
      "text": " and we know that he was referring to his resurrection and thank God for the resurrection."
    },
    {
      "id": 56,
      "start": 893.5199890136719,
      "end": 899.1199645996094,
      "text": " We find that they said he saved others, but himself he cannot save."
    },
    {
      "id": 57,
      "start": 899.1199645996094,
      "end": 904.5999755859375,
      "text": " It was not a matter of cannot, it was a matter of he would not."
    },
    {
      "id": 58,
      "start": 904.5999755859375,
      "end": 907.5599670410156,
      "text": " He would not come off that cross, why?"
    },
    {
      "id": 59,
      "start": 907.5599670410156,
      "end": 914.5599670410156,
      "text": " Because he had, you and I, and all of human history in mind, that this was what was necessary"
    },
    {
      "id": 60,
      "start": 914.5599670410156,
      "end": 918.9599914550781,
      "text": " in order for the sin of the human race to be paid for."
    },
    {
      "id": 61,
      "start": 918.9599914550781,
      "end": 922.239990234375,
      "text": " It was a violent death, number two."
    },
    {
      "id": 62,
      "start": 922.239990234375,
      "end": 926.8799743652344,
      "text": " Bear with me, not only that it was a violent death, but the death of Christ was a voluntary"
    },
    {
      "id": 63,
      "start": 926.8799743652344,
      "end": 927.8799743652344,
      "text": " death."
    },
    {
      "id": 64,
      "start": 927.8799743652344,
      "end": 929.3599853515625,
      "text": " It was a voluntary death."
    },
    {
      "id": 65,
      "start": 929.3599853515625,
      "end": 933.3599853515625,
      "text": " I'm thankful that Jesus willingly went to the cross of Calvary."
    },
    {
      "id": 66,
      "start": 933.3599853515625,
      "end": 939.719970703125,
      "text": " I'm thankful that Jesus, the God in flesh, that when he came to this earth, he knew that"
    },
    {
      "id": 67,
      "start": 939.719970703125,
      "end": 943.7599792480469,
      "text": " he was born for a purpose and that he would go to that cross of Calvary."
    },
    {
      "id": 68,
      "start": 943.7599792480469,
      "end": 948.8799743652344,
      "text": " If you study the gospel of John, you'll read repeatedly through that gospel this phrase"
    },
    {
      "id": 69,
      "start": 948.8799743652344,
      "end": 950.8799743652344,
      "text": " with regard to the hour."
    },
    {
      "id": 70,
      "start": 950.8799743652344,
      "end": 955.8799743652344,
      "text": " And referencing to the hour in which Jesus would go to the cross and pay for the sin"
    },
    {
      "id": 71,
      "start": 955.8799743652344,
      "end": 961.0799865722656,
      "text": " of mankind, eventually it starts in John chapter number two that the hour has not yet come."
    },
    {
      "id": 72,
      "start": 961.0799865722656,
      "end": 968.5599670410156,
      "text": " And we find in John 17 that the hour is now come, and Jesus would go to that cruel cross."
    },
    {
      "id": 73,
      "start": 968.5599670410156,
      "end": 972.5999755859375,
      "text": " I want you to notice that it's a voluntary death in Matthew 26."
    },
    {
      "id": 74,
      "start": 972.5999755859375,
      "end": 977.1999816894531,
      "text": " Notice in verse 26 through 28, right there, just a page or two prior to the text that"
    },
    {
      "id": 75,
      "start": 977.1999816894531,
      "end": 978.8799743652344,
      "text": " we're looking at this morning."
    },
    {
      "id": 76,
      "start": 978.8799743652344,
      "end": 984.7599792480469,
      "text": " Notice what the Bible says, and this is referenced with regard to often as we'd refer to it as"
    },
    {
      "id": 77,
      "start": 984.7599792480469,
      "end": 985.9999694824219,
      "text": " the Last Supper."
    },
    {
      "id": 78,
      "start": 985.9999694824219,
      "end": 990.3999633789062,
      "text": " We reference this passage of Scripture when we observe the Lord's Supper, and notice"
    },
    {
      "id": 79,
      "start": 990.3999633789062,
      "end": 996.8399658203125,
      "text": " in Matthew 26 and verse 26, the Bible says, and as they were eating, Jesus took bread"
    },
    {
      "id": 80,
      "start": 996.8399658203125,
      "end": 1005.5599670410156,
      "text": " and blessed it and break it and gave it to the disciples and said, take ye, this is my"
    },
    {
      "id": 81,
      "start": 1005.5599670410156,
      "end": 1006.5599670410156,
      "text": " body."
    },
    {
      "id": 82,
      "start": 1007.47998046875,
      "end": 1012.5599670410156,
      "text": " He took the cup and gave thanks and gave it to them saying, drink ye all of it, for this"
    },
    {
      "id": 83,
      "start": 1012.5599670410156,
      "end": 1017.719970703125,
      "text": " is my blood of the New Testament which is shed for many for the remission of sins."
    },
    {
      "id": 84,
      "start": 1017.719970703125,
      "end": 1024.2799682617188,
      "text": " And so we find that in these verses of Scripture, the Bible speaks about how he gave thanks"
    },
    {
      "id": 85,
      "start": 1024.2799682617188,
      "end": 1025.8799743652344,
      "text": " when they had this Lord's Supper."
    },
    {
      "id": 86,
      "start": 1025.8799743652344,
      "end": 1031.9599914550781,
      "text": " The bread representing his body that would be beaten and broken and torn."
    },
    {
      "id": 87,
      "start": 1031.9599914550781,
      "end": 1035.8399658203125,
      "text": " The juice representing his blood that would be shed."
    },
    {
      "id": 88,
      "start": 1036.1199645996094,
      "end": 1037.1199645996094,
      "text": " And he gave thanks."
    },
    {
      "id": 89,
      "start": 1037.1199645996094,
      "end": 1038.1199645996094,
      "text": " It was a voluntary death."
    },
    {
      "id": 90,
      "start": 1038.1199645996094,
      "end": 1043.7999877929688,
      "text": " We read already in chapter 26, look if you will, in verse number 47, look down, it says,"
    },
    {
      "id": 91,
      "start": 1043.7999877929688,
      "end": 1050.6799926757812,
      "text": " and while he yet spake, this is after the time in the garden, and the Bible says he"
    },
    {
      "id": 92,
      "start": 1050.6799926757812,
      "end": 1056.3599853515625,
      "text": " yet spake, lo, Judas, one of the twelve, came and with him a great multitude with swords"
    },
    {
      "id": 93,
      "start": 1056.3599853515625,
      "end": 1059.7599792480469,
      "text": " and staves from the chief priests and elders of the people."
    },
    {
      "id": 94,
      "start": 1059.7599792480469,
      "end": 1064.9599914550781,
      "text": " Now he that betrayed him gave them a sign saying, whomsoever I shall kiss, the same"
    },
    {
      "id": 95,
      "start": 1065.0799865722656,
      "end": 1068.8399658203125,
      "text": " is he, hold him fast."
    },
    {
      "id": 96,
      "start": 1068.8399658203125,
      "end": 1075.239990234375,
      "text": " And forthwith, he came to Jesus and said, Hail, Master, and kissed him."
    },
    {
      "id": 97,
      "start": 1075.239990234375,
      "end": 1077.9599914550781,
      "text": " Notice what Jesus says in verse 50."
    },
    {
      "id": 98,
      "start": 1077.9599914550781,
      "end": 1087.3599853515625,
      "text": " Jesus said unto him, Friend, friend, the one who betrayed him with a kiss, friend, wherefore"
    },
    {
      "id": 99,
      "start": 1087.3599853515625,
      "end": 1088.3599853515625,
      "text": " art thou come?"
    },
    {
      "id": 100,
      "start": 1088.3599853515625,
      "end": 1090.4399719238281,
      "text": " Of course, Jesus knew why he came."
    },
    {
      "id": 101,
      "start": 1090.4399719238281,
      "end": 1093.2799682617188,
      "text": " Jesus knew all that was going on."
    },
    {
      "id": 102,
      "start": 1093.2799682617188,
      "end": 1096.47998046875,
      "text": " Then came they and laid hands on Jesus and took him."
    },
    {
      "id": 103,
      "start": 1096.47998046875,
      "end": 1101.0799865722656,
      "text": " And behold, one of them, which were with Jesus, stretched out his hand and drew his sword"
    },
    {
      "id": 104,
      "start": 1101.0799865722656,
      "end": 1105.1199645996094,
      "text": " and struck a servant of the high priest and smote off his ear."
    },
    {
      "id": 105,
      "start": 1105.1199645996094,
      "end": 1106.1199645996094,
      "text": " That's Peter."
    },
    {
      "id": 106,
      "start": 1106.1199645996094,
      "end": 1110.8399658203125,
      "text": " Some of you say, I could see myself in Peter."
    },
    {
      "id": 107,
      "start": 1110.8399658203125,
      "end": 1116.5999755859375,
      "text": " But notice what Jesus says in verse 52, he says, put up again thy sword into his place,"
    },
    {
      "id": 108,
      "start": 1116.5999755859375,
      "end": 1120.9599609375,
      "text": " for all they that take the sword shall perish with the sword."
    },
    {
      "id": 109,
      "start": 1120.9599609375,
      "end": 1122.739990234375,
      "text": " Notice what he says."
    },
    {
      "id": 110,
      "start": 1122.739990234375,
      "end": 1129.739990234375,
      "text": " In verse 53, thinkest thou that I cannot now pray to my Father, and he shall presently"
    },
    {
      "id": 111,
      "start": 1129.739990234375,
      "end": 1134.219970703125,
      "text": " give me more than twelve legions of angels?"
    },
    {
      "id": 112,
      "start": 1134.219970703125,
      "end": 1142.9400024414062,
      "text": " But how then shall the Scriptures be fulfilled that thus it must be?"
    },
    {
      "id": 113,
      "start": 1142.9400024414062,
      "end": 1148.5599975585938,
      "text": " That same hour said Jesus to the multitudes, are you come out as against a thief with swords"
    },
    {
      "id": 114,
      "start": 1148.5599975585938,
      "end": 1149.97998046875,
      "text": " and staves for to take me?"
    },
    {
      "id": 115,
      "start": 1149.97998046875,
      "end": 1154.6199951171875,
      "text": " I sat daily with you teaching in the temple, and you laid no hold on me."
    },
    {
      "id": 116,
      "start": 1154.6199951171875,
      "end": 1159.1799926757812,
      "text": " But all this was done that the Scriptures of the prophets might be fulfilled."
    },
    {
      "id": 117,
      "start": 1159.1799926757812,
      "end": 1164.5399780273438,
      "text": " Then all the disciples forsook him and fled."
    },
    {
      "id": 118,
      "start": 1164.5399780273438,
      "end": 1169.8999633789062,
      "text": " Jesus said, Peter, no, no, no, I have to go to the cross."
    },
    {
      "id": 119,
      "start": 1169.8999633789062,
      "end": 1175.4199829101562,
      "text": " Remember for much time now, Jesus had been teaching his disciples that he was going to"
    },
    {
      "id": 120,
      "start": 1175.4199829101562,
      "end": 1179.5999755859375,
      "text": " go to Jerusalem and he was going to be slain."
    },
    {
      "id": 121,
      "start": 1179.5999755859375,
      "end": 1182.5199584960938,
      "text": " He tells them he's going to rise again, he's going to be crucified, he's going to rise"
    },
    {
      "id": 122,
      "start": 1182.5199584960938,
      "end": 1183.5199584960938,
      "text": " again."
    },
    {
      "id": 123,
      "start": 1183.5199584960938,
      "end": 1187.8399658203125,
      "text": " And as he gave that instruction, remember Peter in Matthew 16, he says, oh, no, no."
    },
    {
      "id": 124,
      "start": 1187.8399658203125,
      "end": 1190.8399658203125,
      "text": " And Jesus says, get thee behind me, Satan."
    },
    {
      "id": 125,
      "start": 1190.8399658203125,
      "end": 1194.2799682617188,
      "text": " See because Jesus knew he had to go to the cross, it was a voluntary death."
    },
    {
      "id": 126,
      "start": 1194.2799682617188,
      "end": 1200.0799560546875,
      "text": " He says, Peter, don't you know that I could pray and I could have twelve legions of angels?"
    },
    {
      "id": 0,
      "start": 1200.0799560546875,
      "end": 1207.9199562072754,
      "text": " angels. But then he asked this question in verse 54, but how then shall the scriptures"
    },
    {
      "id": 1,
      "start": 1207.9199562072754,
      "end": 1216.279956817627,
      "text": " be fulfilled? That thus it must be. In John chapter 10, we're told about the Lord being"
    },
    {
      "id": 2,
      "start": 1216.279956817627,
      "end": 1221.959955215454,
      "text": " our shepherd. In this particular passage in John chapter 10, we're told that he's our"
    },
    {
      "id": 3,
      "start": 1221.959955215454,
      "end": 1226.6799564361572,
      "text": " good shepherd. And the Bible tells us of the good shepherd in John chapter number 10 that"
    },
    {
      "id": 4,
      "start": 1226.6799564361572,
      "end": 1231.7599563598633,
      "text": " one of the characteristics of Jesus being the good shepherd is that he layeth down his"
    },
    {
      "id": 5,
      "start": 1231.7599563598633,
      "end": 1238.3199577331543,
      "text": " life for the sheep. We find that in John chapter number 10 and verse number 11, he says, I"
    },
    {
      "id": 6,
      "start": 1238.3199577331543,
      "end": 1247.3199577331543,
      "text": " am the good shepherd. The good shepherd giveth his life for the sheep. In verse 17, the Bible"
    },
    {
      "id": 7,
      "start": 1247.3199577331543,
      "end": 1252.3599548339844,
      "text": " says, therefore, doth my father love me because I laid down my life. Notice that I might take"
    },
    {
      "id": 8,
      "start": 1252.3599548339844,
      "end": 1262.1999549865723,
      "text": " it again. Then notice these words in John 10 and verse 18, no man taketh it, my life,"
    },
    {
      "id": 9,
      "start": 1262.1999549865723,
      "end": 1272.1599578857422,
      "text": " from me, but I lay it down of myself. The death of the Lord Jesus Christ was a violent"
    },
    {
      "id": 10,
      "start": 1272.1599578857422,
      "end": 1276.6799545288086,
      "text": " death, but I want you to understand it was a voluntary death. He willingly went to the"
    },
    {
      "id": 11,
      "start": 1276.6799545288086,
      "end": 1284.6399536132812,
      "text": " cross of Calvary. He willingly endured all that he did. Why? Because he loved us. Because"
    },
    {
      "id": 12,
      "start": 1284.6399536132812,
      "end": 1289.8799591064453,
      "text": " he loved us. It was voluntary. He laid down his life. In verse 18, it says, I have power"
    },
    {
      "id": 13,
      "start": 1289.8799591064453,
      "end": 1294.9999542236328,
      "text": " to lay it down and I have power to take it again. This commandment have I received of"
    },
    {
      "id": 14,
      "start": 1294.9999542236328,
      "end": 1301.3599548339844,
      "text": " my father. And we find that here as Jesus, he says, I'm the good shepherd, but I laid"
    },
    {
      "id": 15,
      "start": 1301.3599548339844,
      "end": 1305.839958190918,
      "text": " down my life. We're not going to look at the verses, but in Galatians 1, maybe you want"
    },
    {
      "id": 16,
      "start": 1305.839958190918,
      "end": 1311.2799530029297,
      "text": " to reference it, Paul says in Galatians 1, in verse number 4, again in Galatians 2,"
    },
    {
      "id": 17,
      "start": 1311.2799530029297,
      "end": 1319.5199584960938,
      "text": " in verse number 20, he uses this phraseology that he gave himself. He gave himself. Someone"
    },
    {
      "id": 18,
      "start": 1319.5199584960938,
      "end": 1323.439956665039,
      "text": " told me, I remember one of the first people I ever witnessed to after I got saved. I remember"
    },
    {
      "id": 19,
      "start": 1323.439956665039,
      "end": 1327.1999588012695,
      "text": " I got saved when I was 17, entering into my senior year of high school, went to public"
    },
    {
      "id": 20,
      "start": 1327.1999588012695,
      "end": 1331.7999572753906,
      "text": " school my whole life, and I'm going to that public high school in Southern California,"
    },
    {
      "id": 21,
      "start": 1331.7999572753906,
      "end": 1336.6399536132812,
      "text": " just a, just a wicked place, all kinds of immorality and what have you. And I go there"
    },
    {
      "id": 22,
      "start": 1336.6399536132812,
      "end": 1342.3199615478516,
      "text": " and I, I mean, I had no friends whatsoever. It was my first year there. My dad got transferred"
    },
    {
      "id": 23,
      "start": 1342.3199615478516,
      "end": 1347.439956665039,
      "text": " to a new duty station. We ended up in Southern California, end up going to a high school"
    },
    {
      "id": 24,
      "start": 1347.439956665039,
      "end": 1352.439956665039,
      "text": " that has more students than the town that I lived in in Nevada had. I mean, it was a,"
    },
    {
      "id": 25,
      "start": 1352.439956665039,
      "end": 1357.9199523925781,
      "text": " it was culture shock, but then I got saved by the grace of God just before school started."
    },
    {
      "id": 26,
      "start": 1357.9199523925781,
      "end": 1363.0799560546875,
      "text": " When I entered into school as a Christian, and I remember in our teen Sunday school class"
    },
    {
      "id": 27,
      "start": 1363.0799560546875,
      "end": 1369.0399627685547,
      "text": " after I got saved, the, the instruction of how we are to be witnesses and we're to be"
    },
    {
      "id": 28,
      "start": 1369.0399627685547,
      "end": 1374.5599517822266,
      "text": " light. And even in the public school, I remember the, the teacher of that teen Sunday school"
    },
    {
      "id": 29,
      "start": 1374.5599517822266,
      "end": 1380.5999603271484,
      "text": " class challenging us to be lights in that place. And I remember the first person, I"
    },
    {
      "id": 30,
      "start": 1380.5999603271484,
      "end": 1383.9999542236328,
      "text": " can't remember what their name is, but I remember the first person I ever tried to witness to"
    },
    {
      "id": 31,
      "start": 1384.0399627685547,
      "end": 1389.439956665039,
      "text": " after I got saved there in Southern California at Fallbrook High School. And I remember that"
    },
    {
      "id": 32,
      "start": 1389.439956665039,
      "end": 1396.439956665039,
      "text": " young man saying to me, Jesus didn't die for me. They took Jesus and they killed him. And"
    },
    {
      "id": 33,
      "start": 1396.5199584960938,
      "end": 1400.5199584960938,
      "text": " I didn't know a whole lot about the Bible, but I knew a few verses and I was able to"
    },
    {
      "id": 34,
      "start": 1400.5199584960938,
      "end": 1407.3199615478516,
      "text": " show him and tell him about some verses where the Bible says that, that he gave himself."
    },
    {
      "id": 35,
      "start": 1407.3199615478516,
      "end": 1414.3199615478516,
      "text": " That no man taketh it from me, but I lay it down. See, his death was voluntary. It"
    },
    {
      "id": 36,
      "start": 1415.7599487304688,
      "end": 1422.7599487304688,
      "text": " was violent. It was voluntary. In Hebrews chapter 12, it's a passage of scripture that"
    },
    {
      "id": 37,
      "start": 1423.0399627685547,
      "end": 1429.5199584960938,
      "text": " I often reference. In fact, for a number of years, it was one of the verses of scripture"
    },
    {
      "id": 38,
      "start": 1429.5199584960938,
      "end": 1435.6799621582031,
      "text": " that I often would sign after my name in an email or a letter or if I were to sign something,"
    },
    {
      "id": 39,
      "start": 1435.6799621582031,
      "end": 1441.2399597167969,
      "text": " I would use Hebrews 12, 1 and 2, precious verses of scripture. At some point in the"
    },
    {
      "id": 40,
      "start": 1441.2399597167969,
      "end": 1448.2399597167969,
      "text": " last 10 or 12 years, God fixed my attention upon 2 Corinthians 5 and verse 15 and that"
    },
    {
      "id": 41,
      "start": 1448.7999572753906,
      "end": 1455.3199615478516,
      "text": " now is the verse that I always sign my name with. But in Hebrews 12 and verses 1 and 2,"
    },
    {
      "id": 42,
      "start": 1455.3199615478516,
      "end": 1461.7599487304688,
      "text": " the Bible says this, wherefore seeing we also are encompassed about with so great a cloud"
    },
    {
      "id": 43,
      "start": 1461.7599487304688,
      "end": 1466.3199462890625,
      "text": " of witnesses, let us lay aside every weight and the sin which doth so easily beset us"
    },
    {
      "id": 44,
      "start": 1466.3199462890625,
      "end": 1473.0799560546875,
      "text": " and let us run with patience the race that is set before us. Look at verse 2, looking"
    },
    {
      "id": 45,
      "start": 1473.0799560546875,
      "end": 1479.8799438476562,
      "text": " unto Jesus, the author and finisher of our faith and then notice these words, who for"
    },
    {
      "id": 46,
      "start": 1479.8799438476562,
      "end": 1486.8799438476562,
      "text": " the joy that was set before him endured the cross, despising the shame and is set down"
    },
    {
      "id": 47,
      "start": 1487.8799438476562,
      "end": 1494.8799438476562,
      "text": " at the right hand of the throne of God. For the joy that was set before him, he endured"
    },
    {
      "id": 48,
      "start": 1497.9999694824219,
      "end": 1504.3199462890625,
      "text": " the cross. See, it was voluntary. The Bible tells us in 1 Peter that he left us an example"
    },
    {
      "id": 49,
      "start": 1504.3199462890625,
      "end": 1508.3999633789062,
      "text": " that we should follow his steps, but if you look in the text of scripture in 1 Peter chapter"
    },
    {
      "id": 50,
      "start": 1508.3999633789062,
      "end": 1513.3999633789062,
      "text": " number 2, it tells us that the example that he left us is that when he was reviled, he"
    },
    {
      "id": 51,
      "start": 1513.43994140625,
      "end": 1520.199951171875,
      "text": " reviled not again. When he suffered, he threatened not. He willingly laid down his life for his"
    },
    {
      "id": 52,
      "start": 1520.199951171875,
      "end": 1526.2799682617188,
      "text": " sheep. It was a violent death. It was a voluntary death. Number 3 this morning, if you're keeping"
    },
    {
      "id": 53,
      "start": 1526.2799682617188,
      "end": 1531.3999633789062,
      "text": " notes, the death of Christ was a vicarious death. It was a vicarious death. What does"
    },
    {
      "id": 54,
      "start": 1531.3999633789062,
      "end": 1536.3599548339844,
      "text": " that word mean? Well, it means that it was substitutionary. He took my place. We talk"
    },
    {
      "id": 55,
      "start": 1536.3599548339844,
      "end": 1541.199951171875,
      "text": " about the vicarious atonement. We talk about the substitutionary atonement and I'm thankful"
    },
    {
      "id": 56,
      "start": 1541.199951171875,
      "end": 1545.8799438476562,
      "text": " this morning that as we look at the scriptures that we understand, even if you look in the"
    },
    {
      "id": 57,
      "start": 1545.8799438476562,
      "end": 1551.7399597167969,
      "text": " gospel records that there was a man that was in prison that Pilate had this discussion"
    },
    {
      "id": 58,
      "start": 1551.7399597167969,
      "end": 1558.2399597167969,
      "text": " with those that brought Jesus before him during the hearing, during the trial and this man"
    },
    {
      "id": 59,
      "start": 1558.2399597167969,
      "end": 1565.2399597167969,
      "text": " Pilate was going to release one and he offers to release Barabbas. Barabbas, I believe because"
    },
    {
      "id": 60,
      "start": 1565.5599670410156,
      "end": 1571.8399658203125,
      "text": " of his own sin, because of his doings, he was guilty of death and he was going to be"
    },
    {
      "id": 61,
      "start": 1571.8399658203125,
      "end": 1577.8799438476562,
      "text": " crucified. In fact, I believe that along with those other two thieves, it was Barabbas that"
    },
    {
      "id": 62,
      "start": 1577.8799438476562,
      "end": 1584.8799438476562,
      "text": " would have hung upon that cross. But word comes and Barabbas is set free and Jesus instead"
    },
    {
      "id": 63,
      "start": 1585.8799438476562,
      "end": 1592.8799438476562,
      "text": " is crucified. In a very real way, we could say that that cross was intended for Barabbas"
    },
    {
      "id": 64,
      "start": 1595.5799560546875,
      "end": 1601.7999572753906,
      "text": " but we understand this morning that that cross was intended for each of us. It was our cross."
    },
    {
      "id": 65,
      "start": 1601.7999572753906,
      "end": 1608.7999572753906,
      "text": " It was each of us that were guilty, that were guilty of sin. I've said often from the pulpit"
    },
    {
      "id": 66,
      "start": 1609.4799499511719,
      "end": 1616.2399597167969,
      "text": " that the reason that we, as we look at scripture, the reason that we understand the significance"
    },
    {
      "id": 67,
      "start": 1616.2399597167969,
      "end": 1623.2399597167969,
      "text": " of the death of Christ and his glorious resurrection is that we're guilty. We're guilty and we're"
    },
    {
      "id": 68,
      "start": 1624.3599548339844,
      "end": 1631.199951171875,
      "text": " in need of a savior, a substitute. The vicarious death, he took my place, he took your place"
    },
    {
      "id": 69,
      "start": 1631.199951171875,
      "end": 1637.2399597167969,
      "text": " on the cross of Calvary. 2 Corinthians 5 and verse number 20 says this, that he made him"
    },
    {
      "id": 70,
      "start": 1637.2399597167969,
      "end": 1644.2399597167969,
      "text": " to be sin for us, who knew no sin, that we might be made the righteousness of God in"
    },
    {
      "id": 71,
      "start": 1645.7999572753906,
      "end": 1652.7999572753906,
      "text": " him. He took your place. What an awesome truth of scripture. I want you to look at 2 Peter,"
    },
    {
      "id": 72,
      "start": 1653.8799438476562,
      "end": 1659.9999694824219,
      "text": " excuse me, 1 Peter in chapter number 3. I just quoted 2 Corinthians 5.20 but I want"
    },
    {
      "id": 73,
      "start": 1659.9999694824219,
      "end": 1666.9999694824219,
      "text": " you to look at 1 Peter chapter 3. As we understand this morning, that Jesus was crucified and"
    },
    {
      "id": 74,
      "start": 1667.5599670410156,
      "end": 1673.0399475097656,
      "text": " the fact that we are guilty sinners, so often when I talk to people I'll ask them, you have"
    },
    {
      "id": 75,
      "start": 1673.0399475097656,
      "end": 1679.199951171875,
      "text": " to understand that you're lost before you ever realize that you need a savior. Amen?"
    },
    {
      "id": 76,
      "start": 1679.199951171875,
      "end": 1684.2799682617188,
      "text": " If you don't know that you're lost, if you don't know that you're in judgment because"
    },
    {
      "id": 77,
      "start": 1684.2799682617188,
      "end": 1689.9599609375,
      "text": " of your sin, then you never recognize your need for a savior. We find, the Bible says"
    },
    {
      "id": 78,
      "start": 1689.9599609375,
      "end": 1695.7999572753906,
      "text": " all have sin. We're all condemned. He that believeth not, John chapter 3, is condemned"
    },
    {
      "id": 79,
      "start": 1695.7999572753906,
      "end": 1701.9999694824219,
      "text": " already. That's what the Bible tells us. And we find that as we look at the scriptures"
    },
    {
      "id": 80,
      "start": 1701.9999694824219,
      "end": 1708.5999450683594,
      "text": " and we understand that as we talk to people, we say, are you a sinner? Very few times I've"
    },
    {
      "id": 81,
      "start": 1708.5999450683594,
      "end": 1714.199951171875,
      "text": " had anyone tell me, no, I'm not a sinner. Often I'll have somebody say something like"
    },
    {
      "id": 82,
      "start": 1714.199951171875,
      "end": 1721.199951171875,
      "text": " this, well I'm not that bad. How do you determine that? I mean, what is your criteria by you"
    },
    {
      "id": 83,
      "start": 1722.199951171875,
      "end": 1727.7599487304688,
      "text": " determining that you're really not that bad? And often, well I've never murdered anyone."
    },
    {
      "id": 84,
      "start": 1727.7599487304688,
      "end": 1732.9999389648438,
      "text": " Well that's a good thing. I'm glad that you've not murdered anyone. Amen? But the reality"
    },
    {
      "id": 85,
      "start": 1732.9999389648438,
      "end": 1739.679931640625,
      "text": " is that we've all sinned. Sometimes we look at sin and we try to categorize sin and say,"
    },
    {
      "id": 86,
      "start": 1739.679931640625,
      "end": 1743.679931640625,
      "text": " well this one's worse than this one and so on and so forth, but sin is sin and we're"
    },
    {
      "id": 87,
      "start": 1743.679931640625,
      "end": 1748.6399536132812,
      "text": " guilty. In fact, people try to do that with lying. They talk about little white lies."
    },
    {
      "id": 88,
      "start": 1748.6399536132812,
      "end": 1753.7599487304688,
      "text": " Did you ever hear that phraseology? A lie is a lie. By the way, Revelation says all"
    },
    {
      "id": 89,
      "start": 1753.7599487304688,
      "end": 1759.3599853515625,
      "text": " liars shall have their part in the lake which burneth with fire and brimstone. So we understand"
    },
    {
      "id": 90,
      "start": 1759.3599853515625,
      "end": 1764.3999633789062,
      "text": " this morning that we're guilty. But I want you to see in 1 Peter 3 and verse number 18,"
    },
    {
      "id": 91,
      "start": 1764.3999633789062,
      "end": 1771.6399536132812,
      "text": " the Bible says this, for Christ also hath once suffered for sins. But you understand"
    },
    {
      "id": 92,
      "start": 1771.6399536132812,
      "end": 1776.47998046875,
      "text": " that he's not a sinner. He never sinned. He's perfect. He's God. In fact, if you were to"
    },
    {
      "id": 93,
      "start": 1776.47998046875,
      "end": 1781.2399291992188,
      "text": " cross-reference to Hebrews 9 and Hebrews 10, you'll understand that in those passages"
    },
    {
      "id": 94,
      "start": 1781.2399291992188,
      "end": 1789.0799560546875,
      "text": " of Scripture, it's referring to the offering that Christ made once for sin forever. We"
    },
    {
      "id": 95,
      "start": 1789.0799560546875,
      "end": 1793.1199340820312,
      "text": " find that there's a contrast that is made, how in the high priest would enter into the"
    },
    {
      "id": 96,
      "start": 1793.1199340820312,
      "end": 1800.1199340820312,
      "text": " holy of holies, and he would first make an atonement for his own sin, then for the sin"
    },
    {
      "id": 0,
      "start": 1800.1199340820312,
      "end": 1805.1999340057373,
      "text": " the sin of the people. We read that in Hebrews 9 and 10. You can read in the Old Testament"
    },
    {
      "id": 1,
      "start": 1805.1999340057373,
      "end": 1808.799934387207,
      "text": " and that's the pattern. Why? Because the high priest, though he was in that office,"
    },
    {
      "id": 2,
      "start": 1808.799934387207,
      "end": 1816.1199340820312,
      "text": " he himself was still a sinner. But Jesus, our great high priest, God in flesh, never"
    },
    {
      "id": 3,
      "start": 1816.1199340820312,
      "end": 1821.8599338531494,
      "text": " sinned. He's perfect. He's just. He, when he made an offering for sin, did not need"
    },
    {
      "id": 4,
      "start": 1821.8599338531494,
      "end": 1828.3999347686768,
      "text": " to make an offering for his own sin. He had no sin. He made an offering for the sin of"
    },
    {
      "id": 5,
      "start": 1828.3999347686768,
      "end": 1834.7199325561523,
      "text": " the world. He took upon us, upon himself, our sins. He took upon himself the sin of"
    },
    {
      "id": 6,
      "start": 1834.7199325561523,
      "end": 1842.5999336242676,
      "text": " the world. The Bible says here that he suffered for sins, the just for the unjust. Then notice"
    },
    {
      "id": 7,
      "start": 1842.5999336242676,
      "end": 1851.7599334716797,
      "text": " this phrase that he might bring us to God. Literally reconciliation. We were at enmity"
    },
    {
      "id": 8,
      "start": 1851.7599334716797,
      "end": 1860.199935913086,
      "text": " with God. But he provides this way of reconciliation. The Bible says being put to death in the flesh,"
    },
    {
      "id": 9,
      "start": 1860.199935913086,
      "end": 1868.3199310302734,
      "text": " but quickened by the Spirit, the resurrection. And this morning when we think about, we understand"
    },
    {
      "id": 10,
      "start": 1868.3199310302734,
      "end": 1874.1199340820312,
      "text": " the death of Christ, it was a violent death, it was a voluntary death, it was a vicarious"
    },
    {
      "id": 11,
      "start": 1874.1199340820312,
      "end": 1879.2799377441406,
      "text": " death. Could I say this this morning, number four? The death of Christ was a victorious"
    },
    {
      "id": 12,
      "start": 1879.2799377441406,
      "end": 1885.7599334716797,
      "text": " death. It was a victorious death. I'm thankful for the victory, yes, at the garden with the"
    },
    {
      "id": 13,
      "start": 1885.7599334716797,
      "end": 1894.5199356079102,
      "text": " resurrection and we understand that his death, the death of Christ, does not end the account."
    },
    {
      "id": 14,
      "start": 1894.5199356079102,
      "end": 1901.0399322509766,
      "text": " Oh, they buried him in a borrowed tomb and three days later he rose conquering sin, death"
    },
    {
      "id": 15,
      "start": 1901.0399322509766,
      "end": 1906.1399307250977,
      "text": " and the grave. But I want you to consider with me, I mentioned earlier that John 19,"
    },
    {
      "id": 16,
      "start": 1906.1399307250977,
      "end": 1910.8599319458008,
      "text": " so turn over there if you will, in John 19 and I want you to see what Jesus says here"
    },
    {
      "id": 17,
      "start": 1910.8599319458008,
      "end": 1917.1399307250977,
      "text": " in this passage of scripture, the record of this, the crucifixion of Christ given by John"
    },
    {
      "id": 18,
      "start": 1917.1399307250977,
      "end": 1923.9399337768555,
      "text": " here. In John chapter 19, you could begin in verse 17 and read throughout this account"
    },
    {
      "id": 19,
      "start": 1923.9399337768555,
      "end": 1928.699935913086,
      "text": " here that is given with regard to the crucifixion. We're going to jump right in the midst of"
    },
    {
      "id": 20,
      "start": 1928.699935913086,
      "end": 1937.4599304199219,
      "text": " it. In verse number 28, the Bible says, after this Jesus, knowing that all things were now"
    },
    {
      "id": 21,
      "start": 1937.4599304199219,
      "end": 1943.4999389648438,
      "text": " accomplished that the scripture might be fulfilled, saith I, thirst. Now there was said a vessel"
    },
    {
      "id": 22,
      "start": 1943.4999389648438,
      "end": 1948.179931640625,
      "text": " full of vinegar and they filled a sponge with vinegar and put it upon hyssop and put it"
    },
    {
      "id": 23,
      "start": 1948.179931640625,
      "end": 1954.8199310302734,
      "text": " to his mouth. We read of that in Matthew 27 and verse 48. We mentioned that in Matthew"
    },
    {
      "id": 24,
      "start": 1954.8199310302734,
      "end": 1962.1399383544922,
      "text": " 27, the Bible says that he cried. We mentioned it does not tell us exactly. It says in Jesus"
    },
    {
      "id": 25,
      "start": 1962.1399383544922,
      "end": 1966.4599304199219,
      "text": " when he had cried again with a loud voice, yielded up the ghost. In verse 50, but now"
    },
    {
      "id": 26,
      "start": 1966.4599304199219,
      "end": 1971.8199310302734,
      "text": " look in verse 30 here of John 19, it says when Jesus therefore had received the vinegar,"
    },
    {
      "id": 27,
      "start": 1971.8199310302734,
      "end": 1982.179931640625,
      "text": " he said, it is finished. Aren't those three precious words? It is finished. And he bowed"
    },
    {
      "id": 28,
      "start": 1982.179931640625,
      "end": 1992.7799377441406,
      "text": " his head and gave up the ghost. He died. He died a real death. There are some false teachers"
    },
    {
      "id": 29,
      "start": 1992.7799377441406,
      "end": 1997.5399322509766,
      "text": " that teach that he didn't really die and he didn't really rise and all those types of"
    },
    {
      "id": 30,
      "start": 1997.5399322509766,
      "end": 2004.659927368164,
      "text": " things but we see that he died. In fact, the evidence is given in the next few verses,"
    },
    {
      "id": 31,
      "start": 2004.659927368164,
      "end": 2009.1399383544922,
      "text": " the Jews therefore, because it was the preparation, verse 31, the body should not remain upon"
    },
    {
      "id": 32,
      "start": 2009.1399383544922,
      "end": 2013.8199310302734,
      "text": " the cross on the Sabbath day. For that Sabbath day was a high day, the salt pilot, that their"
    },
    {
      "id": 33,
      "start": 2013.8199310302734,
      "end": 2017.8999328613281,
      "text": " legs might be broken and that they might be taken away. Remember I mentioned that earlier"
    },
    {
      "id": 34,
      "start": 2017.8999328613281,
      "end": 2024.659927368164,
      "text": " that to expedite the process because they had made it a crucifixion to be such a long"
    },
    {
      "id": 35,
      "start": 2024.659927368164,
      "end": 2031.8199310302734,
      "text": " drawn out process of great pain and inflict as much pain as possible. But if they needed"
    },
    {
      "id": 36,
      "start": 2031.8199310302734,
      "end": 2036.4599304199219,
      "text": " to expedite the process, they would break the legs and we see that in verse 31. Verse"
    },
    {
      "id": 37,
      "start": 2036.4599304199219,
      "end": 2041.1399383544922,
      "text": " 32, then came the soldiers and break the legs of the first and of the other which was"
    },
    {
      "id": 38,
      "start": 2041.1399383544922,
      "end": 2048.979934692383,
      "text": " crucified with him. But, notice verse 33, when they came to Jesus and saw that he was"
    },
    {
      "id": 39,
      "start": 2048.979934692383,
      "end": 2055.0599365234375,
      "text": " dead already. They break not his legs. You can look over at Psalm 34 and verse 20, we"
    },
    {
      "id": 40,
      "start": 2055.0599365234375,
      "end": 2059.179931640625,
      "text": " won't take the time to do that. But one of the soldiers, verse 34, with a spear pierced"
    },
    {
      "id": 41,
      "start": 2059.179931640625,
      "end": 2063.93994140625,
      "text": " his side and forthwith came there out blood and water and he that saw it bare a record"
    },
    {
      "id": 42,
      "start": 2063.93994140625,
      "end": 2069.699920654297,
      "text": " and his record is true and he knoweth that he sayeth, and he knoweth that he sayeth true"
    },
    {
      "id": 43,
      "start": 2069.699920654297,
      "end": 2073.699920654297,
      "text": " that ye might believe for these things were done that the scripture should be fulfilled."
    },
    {
      "id": 44,
      "start": 2073.699920654297,
      "end": 2079.0999450683594,
      "text": " A bone of him shall not be broken and again another scripture saith they shall look on"
    },
    {
      "id": 45,
      "start": 2079.0999450683594,
      "end": 2085.0599365234375,
      "text": " him whom they pierced. It's amazing when you study the prophecies that are fulfilled during"
    },
    {
      "id": 46,
      "start": 2085.0599365234375,
      "end": 2090.3799438476562,
      "text": " the crucifixion and you read of the prophecies, understand that those that are carrying out"
    },
    {
      "id": 47,
      "start": 2090.3799438476562,
      "end": 2095.139923095703,
      "text": " this crucifixion, they were not aware of the prophecies and saying, okay let's do this"
    },
    {
      "id": 48,
      "start": 2095.139923095703,
      "end": 2100.899932861328,
      "text": " so that we can fulfill this. No, they were crucifying him but Jesus, God, gave us those"
    },
    {
      "id": 49,
      "start": 2100.899932861328,
      "end": 2107.459930419922,
      "text": " prophecies centuries earlier so that we could understand the fulfillment that he was making"
    },
    {
      "id": 50,
      "start": 2107.459930419922,
      "end": 2118.0199279785156,
      "text": " when he went to that cross. But we find that he says, it is finished. What a great proclamation"
    },
    {
      "id": 51,
      "start": 2118.0199279785156,
      "end": 2124.6199340820312,
      "text": " of victory. It is finished. I mentioned by way of introduction this morning that there"
    },
    {
      "id": 52,
      "start": 2124.6199340820312,
      "end": 2130.93994140625,
      "text": " was a promise today as we sit here in 2024, the promise that was given to Abraham in Genesis"
    },
    {
      "id": 53,
      "start": 2130.93994140625,
      "end": 2138.2999267578125,
      "text": " 22, 18 is 4,000 years ago roughly that that promise was given and we sit here and as we"
    },
    {
      "id": 54,
      "start": 2138.2999267578125,
      "end": 2142.7799377441406,
      "text": " look at the passages of scripture that we've looked at this morning, the time of the Lord"
    },
    {
      "id": 55,
      "start": 2142.7799377441406,
      "end": 2150.6199340820312,
      "text": " Jesus Christ was 2,000, 2,100 years after that promise was given to Abraham and we find"
    },
    {
      "id": 56,
      "start": 2150.6199340820312,
      "end": 2159.5399475097656,
      "text": " that how was it that God could say to Abraham that in thy seed shall the nations, shall"
    },
    {
      "id": 57,
      "start": 2159.5399475097656,
      "end": 2165.139923095703,
      "text": " all the nations of the earth be blessed because thou hast obeyed my voice and Paul makes it"
    },
    {
      "id": 58,
      "start": 2165.139923095703,
      "end": 2172.3399353027344,
      "text": " clear that he said seed, not seeds and that the seed is Christ and how is it that Christ"
    },
    {
      "id": 59,
      "start": 2172.93994140625,
      "end": 2179.419921875,
      "text": " would bring that blessing that was made available through his death on the cross of Calvary."
    },
    {
      "id": 60,
      "start": 2179.419921875,
      "end": 2184.7799377441406,
      "text": " His subsequent resurrection that we'll look at next week where he rose in victory conquering"
    },
    {
      "id": 61,
      "start": 2184.7799377441406,
      "end": 2189.9799194335938,
      "text": " sin death in the grave. But I want to remind you of two passages. First turn over to Hebrews"
    },
    {
      "id": 62,
      "start": 2189.9799194335938,
      "end": 2211.8399353027344,
      "text": " 2 if you will. Hebrews chapter number 2 we'll look at a verse of scripture here. In Hebrews"
    },
    {
      "id": 63,
      "start": 2211.8399353027344,
      "end": 2216.459930419922,
      "text": " chapter number 2 look if you will at verse number 14 the Bible says for as much then"
    },
    {
      "id": 64,
      "start": 2216.459930419922,
      "end": 2222.8599243164062,
      "text": " as the children are partakers of flesh and blood he also himself likewise took part"
    },
    {
      "id": 65,
      "start": 2222.8599243164062,
      "end": 2231.899932861328,
      "text": " of the same. Notice what the Bible says at the end of verse number 14 that through death"
    },
    {
      "id": 66,
      "start": 2231.899932861328,
      "end": 2242.2999267578125,
      "text": " he might destroy him that had the power of death that is the devil. Through death. It"
    },
    {
      "id": 67,
      "start": 2242.2999267578125,
      "end": 2247.699920654297,
      "text": " was a victorious death. I mean it was a violent death. We've read in the passage of scripture"
    },
    {
      "id": 68,
      "start": 2247.699920654297,
      "end": 2253.8599243164062,
      "text": " in Matthew 27 the violence that surrounded the death of our savior of Christ. We understand"
    },
    {
      "id": 69,
      "start": 2253.8599243164062,
      "end": 2258.179931640625,
      "text": " it was a voluntary death that he went willingly to the cross. It was vicarious. He took my"
    },
    {
      "id": 70,
      "start": 2258.179931640625,
      "end": 2263.9799194335938,
      "text": " place. He suffered and bled and died for me and for you and for all of humankind. We find"
    },
    {
      "id": 71,
      "start": 2263.9799194335938,
      "end": 2272.9799194335938,
      "text": " however it's a victorious death. You know the sin of mankind could not be paid for simply"
    },
    {
      "id": 72,
      "start": 2272.9799194335938,
      "end": 2279.3399353027344,
      "text": " through the birth of Christ. No that's not sufficient. We don't read in Hebrews 2 that"
    },
    {
      "id": 73,
      "start": 2279.3399353027344,
      "end": 2286.8599243164062,
      "text": " through his birth he, no through his death. Yes we read of the glorious resurrection and"
    },
    {
      "id": 74,
      "start": 2286.8599243164062,
      "end": 2291.7399291992188,
      "text": " again I mentioned that the resurrection is evidence that his death was sufficient payment"
    },
    {
      "id": 75,
      "start": 2291.7399291992188,
      "end": 2296.0199279785156,
      "text": " for the sin of mankind. But we look here and it says in Hebrews 2 remember the book"
    },
    {
      "id": 76,
      "start": 2296.0199279785156,
      "end": 2302.7799377441406,
      "text": " of Hebrews is all about Jesus and it's all about how Jesus is better, how he's superior."
    },
    {
      "id": 77,
      "start": 2302.7799377441406,
      "end": 2308.419921875,
      "text": " And notice if you will in the first chapter in Hebrews chapter 1 and verse number 3. Notice"
    },
    {
      "id": 78,
      "start": 2308.419921875,
      "end": 2312.1399536132812,
      "text": " what the Bible says and perhaps I should have read this verse before the one in Hebrews"
    },
    {
      "id": 79,
      "start": 2312.1399536132812,
      "end": 2318.0399169921875,
      "text": " 2. But the Bible says of Jesus who being the brightness of his glory and the express image"
    },
    {
      "id": 80,
      "start": 2318.0399169921875,
      "end": 2324.8999633789062,
      "text": " of his person and upholding all things by the word of his power when he had by himself"
    },
    {
      "id": 81,
      "start": 2324.8999633789062,
      "end": 2333.1199340820312,
      "text": " purged our sins sat down on the right hand of the majesty on high. We find that we go"
    },
    {
      "id": 82,
      "start": 2333.1199340820312,
      "end": 2339.0599365234375,
      "text": " through the portion of Hebrews 1 and 2 and we read how Christ is superior and how he's"
    },
    {
      "id": 83,
      "start": 2339.0599365234375,
      "end": 2344.4599609375,
      "text": " better and he's greater. And we come to chapter 2 and we read this truth that through the"
    },
    {
      "id": 84,
      "start": 2344.4599609375,
      "end": 2352.419921875,
      "text": " death of Christ he might destroy him that had the power of death, that is the devil."
    },
    {
      "id": 85,
      "start": 2352.419921875,
      "end": 2371.2599487304688,
      "text": " First John chapter 3. Look there if you will in first John chapter number 3. In first John"
    },
    {
      "id": 86,
      "start": 2371.2599487304688,
      "end": 2375.0599365234375,
      "text": " chapter 3 in verse number 8 the Bible says he that committed the sins of the devil for"
    },
    {
      "id": 87,
      "start": 2375.0599365234375,
      "end": 2380.3399047851562,
      "text": " the devil sinneth from the beginning. For this purpose the son of God was manifested"
    },
    {
      "id": 88,
      "start": 2380.3399047851562,
      "end": 2388.5399169921875,
      "text": " that he might destroy the works of the devil. There are many people today if you look back"
    },
    {
      "id": 89,
      "start": 2388.5399169921875,
      "end": 2396.2999267578125,
      "text": " at Hebrews 2 and it tells us how Jesus through his death that he had the opportunity to destroy"
    },
    {
      "id": 90,
      "start": 2396.2999267578125,
      "end": 2400.1399536132812,
      "text": " him that had the power of death, that is the devil. But I want you to understand."
    },
    {
      "id": 0,
      "start": 2400.1399536132812,
      "end": 2406.1399536132812,
      "text": " understand the impact, if you will, the application for us in verse number 15, and deliver them"
    },
    {
      "id": 1,
      "start": 2406.1399536132812,
      "end": 2412.5799531936646,
      "text": " who through fear of death were all their lifetime subject to bondage."
    },
    {
      "id": 2,
      "start": 2412.5799531936646,
      "end": 2420.2999534606934,
      "text": " There are a lot of people that are afraid of death, afraid of death, the uncertainty"
    },
    {
      "id": 3,
      "start": 2420.2999534606934,
      "end": 2423.3799533843994,
      "text": " of death, what happens."
    },
    {
      "id": 4,
      "start": 2423.3799533843994,
      "end": 2428.3399543762207,
      "text": " You know, there are some brave people, quote-unquote, that will give you a good talk and they'll"
    },
    {
      "id": 5,
      "start": 2428.3399543762207,
      "end": 2432.7799530029297,
      "text": " say, I'm not afraid to die, and I don't believe in anything, and I'm my own judge, and all"
    },
    {
      "id": 6,
      "start": 2432.7799530029297,
      "end": 2435.379955291748,
      "text": " these times, I've had people tell me all kinds of crazy stuff."
    },
    {
      "id": 7,
      "start": 2435.379955291748,
      "end": 2442.8599548339844,
      "text": " Well, I'll tell you what, when you come face-to-face with death, it's a fearful thing, if you don't"
    },
    {
      "id": 8,
      "start": 2442.8599548339844,
      "end": 2448.0199546813965,
      "text": " know the Lord Jesus Christ, the one who conquered death."
    },
    {
      "id": 9,
      "start": 2448.0199546813965,
      "end": 2452.419952392578,
      "text": " We find that He conquered sin, death, and the grave, yes, His death on the cross, His"
    },
    {
      "id": 10,
      "start": 2452.419952392578,
      "end": 2457.219955444336,
      "text": " subsequent resurrection, and we look this morning at this text of Scripture during this"
    },
    {
      "id": 11,
      "start": 2457.2999534606934,
      "end": 2461.8599548339844,
      "text": " time of year as we will be celebrating the resurrection, listen, there's no resurrection"
    },
    {
      "id": 12,
      "start": 2461.8599548339844,
      "end": 2465.1799545288086,
      "text": " without a death."
    },
    {
      "id": 13,
      "start": 2465.1799545288086,
      "end": 2469.1399536132812,
      "text": " The resurrection is the cornerstone of our faith, but there's no resurrection without"
    },
    {
      "id": 14,
      "start": 2469.1399536132812,
      "end": 2470.5599517822266,
      "text": " a death."
    },
    {
      "id": 15,
      "start": 2470.5599517822266,
      "end": 2473.939956665039,
      "text": " There's no death without a birth, I mean, all of it is necessary, amen?"
    },
    {
      "id": 16,
      "start": 2473.939956665039,
      "end": 2477.979949951172,
      "text": " You can't just take one piece of it, all of it is necessary, and we find it as we come"
    },
    {
      "id": 17,
      "start": 2477.979949951172,
      "end": 2484.619956970215,
      "text": " to the Scriptures and we open the Word of God, and we have this great truth of how Jesus,"
    },
    {
      "id": 18,
      "start": 2484.619956970215,
      "end": 2488.979949951172,
      "text": " God in flesh, died for us."
    },
    {
      "id": 19,
      "start": 2488.979949951172,
      "end": 2496.7799530029297,
      "text": " He died for humanity, and we find that He died for humanity because He loved His creation."
    },
    {
      "id": 20,
      "start": 2496.7799530029297,
      "end": 2503.979949951172,
      "text": " He's the Creator, and He loved, for God so loved the world."
    },
    {
      "id": 21,
      "start": 2503.979949951172,
      "end": 2510.819953918457,
      "text": " But God commendeth His love toward us, and that while we're yet sinners, Christ died"
    },
    {
      "id": 22,
      "start": 2510.819953918457,
      "end": 2515.1799545288086,
      "text": " for us."
    },
    {
      "id": 23,
      "start": 2515.1799545288086,
      "end": 2519.619956970215,
      "text": " Two takeaways this morning, number one, I hope that as we look at a passage of Scripture"
    },
    {
      "id": 24,
      "start": 2519.619956970215,
      "end": 2524.699951171875,
      "text": " like Matthew 27, as we consider the other verses of Scripture this morning, I hope that"
    },
    {
      "id": 25,
      "start": 2524.699951171875,
      "end": 2529.219955444336,
      "text": " you would not be guilty of neglecting so great salvation."
    },
    {
      "id": 26,
      "start": 2529.219955444336,
      "end": 2535.939956665039,
      "text": " I hope this morning that you would rejoice regularly in your salvation, that you would"
    },
    {
      "id": 27,
      "start": 2535.939956665039,
      "end": 2543.8199462890625,
      "text": " be aware regularly in your daily life of what Christ did so that you could go to heaven."
    },
    {
      "id": 28,
      "start": 2543.8199462890625,
      "end": 2549.2599487304688,
      "text": " I hope that you understand, I mean, every day of your life, how blessed you are to have"
    },
    {
      "id": 29,
      "start": 2549.2599487304688,
      "end": 2554.4599609375,
      "text": " been given the truth of the Gospel, to be saved by the blood of Christ."
    },
    {
      "id": 30,
      "start": 2554.4599609375,
      "end": 2559.3399505615234,
      "text": " But I hope this morning not only would we rejoice in these wonderful truths, but I hope"
    },
    {
      "id": 31,
      "start": 2559.3399505615234,
      "end": 2564.6199493408203,
      "text": " that we'd be challenged to share this wonderful truth with those that we come into contact"
    },
    {
      "id": 32,
      "start": 2564.6199493408203,
      "end": 2566.0599517822266,
      "text": " with."
    },
    {
      "id": 33,
      "start": 2566.0599517822266,
      "end": 2574.439956665039,
      "text": " You know, there are countless people in our community that have no idea why Jesus died."
    },
    {
      "id": 34,
      "start": 2574.439956665039,
      "end": 2579.979949951172,
      "text": " Many that don't even believe in Jesus, I understand that, but even as you begin to"
    },
    {
      "id": 35,
      "start": 2579.979949951172,
      "end": 2588.8599548339844,
      "text": " have a conversation with them about Jesus, why did He die?"
    },
    {
      "id": 36,
      "start": 2588.8599548339844,
      "end": 2591.8599548339844,
      "text": " You're left with blank stares."
    },
    {
      "id": 37,
      "start": 2591.8599548339844,
      "end": 2597.499954223633,
      "text": " You're left with sometimes answers that are not biblical."
    },
    {
      "id": 38,
      "start": 2597.499954223633,
      "end": 2598.6199493408203,
      "text": " They do not understand."
    },
    {
      "id": 39,
      "start": 2598.6199493408203,
      "end": 2605.8599548339844,
      "text": " They do not have the truth that we hold dear today, and so that gives us a responsibility."
    },
    {
      "id": 40,
      "start": 2605.8599548339844,
      "end": 2607.5399475097656,
      "text": " It gives us an opportunity."
    },
    {
      "id": 41,
      "start": 2607.5399475097656,
      "end": 2611.5399475097656,
      "text": " I guarantee you this week, as you go throughout your week, that you're going to come in contact"
    },
    {
      "id": 42,
      "start": 2611.5399475097656,
      "end": 2613.6199493408203,
      "text": " with someone."
    },
    {
      "id": 43,
      "start": 2613.6199493408203,
      "end": 2618.0999603271484,
      "text": " Unless you sit at home all week and do nothing, you're going to come in contact with someone"
    },
    {
      "id": 44,
      "start": 2619.0999603271484,
      "end": 2622.699951171875,
      "text": " that needs to know the truth that we dealt with today."
    },
    {
      "id": 45,
      "start": 2622.699951171875,
      "end": 2627.499954223633,
      "text": " That God, listen, this time of year, I know it's been overly commercialized and the Easter"
    },
    {
      "id": 46,
      "start": 2627.499954223633,
      "end": 2629.7799530029297,
      "text": " Bunny and all that nonsense."
    },
    {
      "id": 47,
      "start": 2629.7799530029297,
      "end": 2633.7799530029297,
      "text": " I understand, it's crazy."
    },
    {
      "id": 48,
      "start": 2633.7799530029297,
      "end": 2638.5399475097656,
      "text": " It's distracting from the truth."
    },
    {
      "id": 49,
      "start": 2638.5399475097656,
      "end": 2641.179946899414,
      "text": " The truth is that we serve a risen Savior."
    },
    {
      "id": 50,
      "start": 2641.179946899414,
      "end": 2644.8199462890625,
      "text": " The truth is the resurrection only happens because He died."
    },
    {
      "id": 51,
      "start": 2644.8199462890625,
      "end": 2649.0999603271484,
      "text": " And we must recognize this morning, it was a violent death."
    },
    {
      "id": 52,
      "start": 2649.0999603271484,
      "end": 2652.899948120117,
      "text": " I'm thankful to have free salvation."
    },
    {
      "id": 53,
      "start": 2652.899948120117,
      "end": 2654.2599487304688,
      "text": " Some people say, I'm trying to work for it."
    },
    {
      "id": 54,
      "start": 2654.2599487304688,
      "end": 2655.2599487304688,
      "text": " You can't work for it."
    },
    {
      "id": 55,
      "start": 2655.2599487304688,
      "end": 2657.2999572753906,
      "text": " It's already been paid for."
    },
    {
      "id": 56,
      "start": 2657.2999572753906,
      "end": 2660.3799438476562,
      "text": " You know how crazy it is if somebody was trying to give you a gift?"
    },
    {
      "id": 57,
      "start": 2660.3799438476562,
      "end": 2664.179962158203,
      "text": " I mean, they try to give you a gift and you say, well, I'll take it, but I'll work for"
    },
    {
      "id": 58,
      "start": 2664.179962158203,
      "end": 2665.179962158203,
      "text": " it."
    },
    {
      "id": 59,
      "start": 2665.179962158203,
      "end": 2668.659942626953,
      "text": " No, no, no, it's not a gift anymore."
    },
    {
      "id": 60,
      "start": 2668.659942626953,
      "end": 2669.659942626953,
      "text": " Amen?"
    },
    {
      "id": 61,
      "start": 2669.659942626953,
      "end": 2672.739959716797,
      "text": " And Jesus said, I have a gift for you."
    },
    {
      "id": 62,
      "start": 2672.739959716797,
      "end": 2679.419952392578,
      "text": " The gift of God's eternal life is a violent death, is a voluntary death, vicarious death,"
    },
    {
      "id": 63,
      "start": 2679.419952392578,
      "end": 2681.3399658203125,
      "text": " a victorious death."
    },
    {
      "id": 64,
      "start": 2681.3399658203125,
      "end": 2689.3399658203125,
      "text": " And we sing the victory, we shout the victory, and we proclaim a glorious message to a lost"
    },
    {
      "id": 65,
      "start": 2689.3399658203125,
      "end": 2694.3799438476562,
      "text": " and dying world that Jesus saves, Jesus saves."
    },
    {
      "id": 66,
      "start": 2694.3799438476562,
      "end": 2699.979949951172,
      "text": " First Timothy, Paul said this, this is a faithful saying and worthy of all acceptation, that"
    },
    {
      "id": 67,
      "start": 2700.219940185547,
      "end": 2703.979949951172,
      "text": " Christ Jesus came into the world to save sinners."
    },
    {
      "id": 68,
      "start": 2703.979949951172,
      "end": 2706.8999633789062,
      "text": " He says, of whom I am chief."
    },
    {
      "id": 69,
      "start": 2706.8999633789062,
      "end": 2708.699951171875,
      "text": " How did he accomplish that?"
    },
    {
      "id": 70,
      "start": 2708.699951171875,
      "end": 2713.0199584960938,
      "text": " Through the death on the cross, his subsequent resurrection."
    },
    {
      "id": 71,
      "start": 2713.0199584960938,
      "end": 2720.699951171875,
      "text": " I hope this morning that you recognize and appreciate greatly your salvation."
    },
    {
      "id": 72,
      "start": 2720.699951171875,
      "end": 2725.4999389648438,
      "text": " You recognize what Christ did so that you could be saved."
    },
    {
      "id": 73,
      "start": 2725.4999389648438,
      "end": 2732.7799682617188,
      "text": " But I hope also that God would stir us up and give us a passion to tell somebody about"
    },
    {
      "id": 74,
      "start": 2732.7799682617188,
      "end": 2733.8599548339844,
      "text": " Jesus."
    },
    {
      "id": 75,
      "start": 2733.8599548339844,
      "end": 2736.8999633789062,
      "text": " We sing today about Jesus coming back."
    },
    {
      "id": 76,
      "start": 2736.8999633789062,
      "end": 2741.0599670410156,
      "text": " If you're looking at things in the world, I mean, listen, it seems like Jesus is coming"
    },
    {
      "id": 77,
      "start": 2741.0599670410156,
      "end": 2742.0599670410156,
      "text": " back soon."
    },
    {
      "id": 78,
      "start": 2742.0599670410156,
      "end": 2746.3399658203125,
      "text": " I don't know, no man knoweth the hour, but I want to be busy about doing the work of"
    },
    {
      "id": 79,
      "start": 2746.3399658203125,
      "end": 2747.3399658203125,
      "text": " God."
    },
    {
      "id": 80,
      "start": 2747.3399658203125,
      "end": 2752.179962158203,
      "text": " Oh, I'll tell them later at a more convenient time."
    },
    {
      "id": 81,
      "start": 2752.179962158203,
      "end": 2754.8999633789062,
      "text": " You may not have another opportunity."
    },
    {
      "id": 82,
      "start": 2754.8999633789062,
      "end": 2758.0599670410156,
      "text": " You may not have a more convenient time."
    },
    {
      "id": 83,
      "start": 2758.0599670410156,
      "end": 2760.6199645996094,
      "text": " We must redeem the time that God has given us."
    },
    {
      "id": 84,
      "start": 2760.6199645996094,
      "end": 2766.179962158203,
      "text": " They crucified him, but he gave up his life for us."
    },
    {
      "id": 85,
      "start": 2766.179962158203,
      "end": 2767.179962158203,
      "text": " Let's pray."
    },
    {
      "id": 86,
      "start": 2767.179962158203,
      "end": 2768.179962158203,
      "text": " Father, we love you."
    },
    {
      "id": 87,
      "start": 2768.179962158203,
      "end": 2769.179962158203,
      "text": " We thank you for loving us."
    },
    {
      "id": 88,
      "start": 2769.179962158203,
      "end": 2770.8599548339844,
      "text": " We thank you for your word."
    },
    {
      "id": 89,
      "start": 2770.8599548339844,
      "end": 2775.5799560546875,
      "text": " We thank you for your substitutionary death on the cross of Calvary."
    },
    {
      "id": 90,
      "start": 2775.5799560546875,
      "end": 2781.4999389648438,
      "text": " I thank you that you took my place, you took our place."
    },
    {
      "id": 91,
      "start": 2781.4999389648438,
      "end": 2784.7799682617188,
      "text": " God, it's such a blessing to know that heaven is our home."
    },
    {
      "id": 92,
      "start": 2784.7799682617188,
      "end": 2789.8199462890625,
      "text": " God, if there's one present that's not sure of heaven, they've never been saved."
    },
    {
      "id": 93,
      "start": 2789.8199462890625,
      "end": 2793.3799438476562,
      "text": " They've never understood these truths that we looked at this morning."
    },
    {
      "id": 94,
      "start": 2793.3799438476562,
      "end": 2797.659942626953,
      "text": " Maybe they're trying to get to heaven on their own by some good works or some other ideas."
    },
    {
      "id": 95,
      "start": 2797.659942626953,
      "end": 2803.7799682617188,
      "text": " Lord, I pray that you would help them this morning to understand the truth of your word."
    },
    {
      "id": 96,
      "start": 2803.7799682617188,
      "end": 2809.0799560546875,
      "text": " They would understand that they're a sinner in need of the only Savior, the Lord Jesus"
    },
    {
      "id": 97,
      "start": 2809.0799560546875,
      "end": 2812.6399536132812,
      "text": " Christ, that he bled and died to take their place."
    },
    {
      "id": 98,
      "start": 2812.6399536132812,
      "end": 2816.719940185547,
      "text": " He was buried and he rose, conquering sin, death, and the grave."
    },
    {
      "id": 99,
      "start": 2816.719940185547,
      "end": 2822.3999633789062,
      "text": " God, I pray that you would help us to have a passion to reach the lost."
    },
    {
      "id": 100,
      "start": 2822.3999633789062,
      "end": 2833.9999389648438,
      "text": " Lord, give us a desire to obey, to be willing to go out and tell others."
    },
    {
      "id": 101,
      "start": 2834.5199584960938,
      "end": 2840.5599670410156,
      "text": " Lord, give us opportunities, give us divine appointments, and I pray that you would help"
    },
    {
      "id": 102,
      "start": 2840.5599670410156,
      "end": 2842.7599487304688,
      "text": " us, Lord, to be faithful."
    },
    {
      "id": 103,
      "start": 2842.7599487304688,
      "end": 2845.7999572753906,
      "text": " Help us to pray even as the disciples prayed in the book of Acts."
    },
    {
      "id": 104,
      "start": 2845.7999572753906,
      "end": 2852.7599487304688,
      "text": " God, give us boldness, that we may open our mouth with boldness, that we might speak as"
    },
    {
      "id": 105,
      "start": 2852.7599487304688,
      "end": 2854.9599609375,
      "text": " we ought to speak."
    },
    {
      "id": 106,
      "start": 2854.9599609375,
      "end": 2858.9999389648438,
      "text": " I pray that you'd work and move in the hearts and lives of those that are gathered through"
    },
    {
      "id": 107,
      "start": 2858.9999389648438,
      "end": 2861.1199645996094,
      "text": " this time of invitation."
    },
    {
      "id": 108,
      "start": 2861.1199645996094,
      "end": 2862.479949951172,
      "text": " For it's in Christ's name we pray."
    },
    {
      "id": 109,
      "start": 2862.479949951172,
      "end": 2865.3599548339844,
      "text": " You just stand with me, heads are bowed, eyes are closed."
    },
    {
      "id": 110,
      "start": 2865.3599548339844,
      "end": 2868.7599487304688,
      "text": " Kimberly's going to play quietly on the piano as we have a time of invitation, give you"
    },
    {
      "id": 111,
      "start": 2868.7599487304688,
      "end": 2870.159942626953,
      "text": " an opportunity to respond."
    },
    {
      "id": 112,
      "start": 2870.159942626953,
      "end": 2873.0399475097656,
      "text": " If you're not sure of heaven, we'll take a Bible and show you how you can know for sure"
    },
    {
      "id": 113,
      "start": 2873.0399475097656,
      "end": 2874.0399475097656,
      "text": " that heaven's your home."
    },
    {
      "id": 114,
      "start": 2874.0399475097656,
      "end": 2877.479949951172,
      "text": " Maybe you just need to come to the Old Fashioned Altar and pray this morning as Kimberly plays"
    },
    {
      "id": 115,
      "start": 2877.479949951172,
      "end": 2878.479949951172,
      "text": " The Altar is Open."
    }
  ],
  "processed_at": "2025-04-15T08:10:18.375960"
}