{
  "video_id": "rsDeJmgGGS8",
  "text": "I don't know if I'd come back. I didn't do it. No? Good? Got it. Because I plan on getting really loud, so I'm glad. The music has been outstanding. And I don't know that I've ever been a church. I don't ever know who's going to play the piano. There's like a revolving thing there. There's like seven people, I think, that play the piano. And I say this sincerely. I'm not doing this in jest. If I could have chosen my gift, and if I have one, I would have chosen to be able to play the piano and sing. I think that there's a great deal of good that can be done in that and come from that. And I don't mind preaching, but that singing's good stuff. Amen? And when you've got a face like this, singing would help, I think. I don't know. Take your Bible, if you would, and turn with me to chapter 16 of the book of Acts. That's where we're going to start. We won't finish there. We won't end up there. But that's where we're going to start tonight. And I want to preach on this thought tonight, seeing missions in action. Seeing missions in action. And when I say that, we're going to look at it from the perspective of the missionary. We're going to look at it from the perspective of the supporting church. And we're going to look at it from the perspective of the Lord himself. But let's start in Acts chapter 16. And we'll read two verses there. We'll read a number more. But let's start with verses 9 and 10. Acts 16, verses 9 and 10. And a vision appeared to Paul in the night. And there stood a man of Macedonia and prayed him, saying, come over into Macedonia and help us. And after he had seen the vision, immediately we endeavored to go into Macedonia, assuredly gathering that the Lord had called us for to preach the gospel unto them. Let's pray. Father, we're very grateful for this evening to be together. Thank you so much for the blessing of the music that we've heard tonight and been able to sing ourselves. We're thankful for these missionary families, the Alvarez and the Zdarsky families. Thank you for them, for the call that you've placed on their life. Lord, I pray that you'd bless them and then bless us with understanding tonight. And help us to see how important our role is in missions as well. Bless the message and bless our understanding. In Jesus' name, amen. Paul went to Philippi as the result of a missionary call. I don't want to get overly wrapped up in this, but I'm glad that the Bible teaches us that God calls people. And I think it's important that we understand that God calls people. I think he probably calls more people than respond. But God calls us and calls all of us. Not all of us are called to a foreign field. Not all of us are called to fill a pulpit. But God gifts every believer. And I believe God calls every believer to use the gift that he has given them wherever he places them. When we come to Acts chapter 16 and we see that vision appear to Paul, we ask ourselves, what took place there? What's going on? And the truth is that in his companion are Silas and Timothy and Dr. Luke. And they are on a missionary journey. And it was their intention to minister in Asia Minor. They've come through Lystra. And they've visited a couple of other cities. And Paul's desire, Paul's thought is that he wants to continue to minister in the area of Bithynia. You say, where's Bithynia? Where is Troas? Well, think of modern day Turkey. If you have any knowledge of the geography of that area, if you know where the Dardanelles Strait is, right there is Troas. And God has just closed door after door after door. And I think with some frustration, Paul says, OK, let's go down to Troas. We've got friends there. And they're literally being put up for the night. And I don't know where Silas and Timothy and Luke are. But Luke's with them. He's the one writing this. And that night, when Paul finally pillows his head and finally goes to sleep, God speaks to him. And God gives him a vision. I know sometimes we talk about eating pizza and doing things like that and getting visions. Please understand, that's not what's happening here. God is speaking to Paul. And as I alluded to in the Sunday school hour yesterday morning, this is an important moment. Because literally, God is calling Paul and his missionary party not just to another city, but from Asia to the continent of Europe. And when Paul sees this vision and he sees this Macedonian man, understand that Macedonia is in present day Greece. And he wakes up from that vision. And boy, he stirs the party. Timothy, Silas, Luke, we've got to go. I know where God wants us to go. And they book fare on a ship. And the Bible tells us that they leave from Troas, the port. They sail to an island not too far off the coast, Samothracea. When they leave Samothracea, and again, remember, they drop off cargo and they pick up cargo. Where they're actually trying to get is to a small port called Neapolis on the Greek coast. And when they land in Neapolis, Paul makes a beeline for a little town called Philippi. Now, who in the world cares about Philippi? Now, I consider myself an amateur historian. So in just about every sermon, you're going to get a history lesson. And I don't want to see any frowns about it, all right? Sometimes we don't know the background of things and we miss some of the important little things that are said. I want you to understand that Philippi is a very important city from this standpoint. About 100 years before Paul shows up at Philippi, there was a major battle that took place right outside its gates. Two men, men named Brutus and Cassius, you may remember who Brutus is, et tu Brute? Brutus and Cassius were two of those that murdered Julius Caesar, surprised him with the knives and hundreds of knife thrusts into his body. And they killed Julius Caesar, intending to seize the Roman Empire. There were two other important men, one of them Mark Anthony. And he now has left Egypt. And he has sided with Octavian, who is a great Roman general. And those two armies, the armies of Brutus and Cassius, meet the army of Mark Anthony and Octavius right outside of the city of Philippi. The citizens of Philippi decide that they're going to aid and help Octavius and Mark Anthony. And those two win the battle. You say, this is fascinating stuff, preacher. Now, wait a minute. Here's what becomes important. Octavius became Caesar. And he so appreciated what the Philippians did, what that city of Philippi did, that he conferred on them every citizen of Philippi. From that point on, their children were born Roman citizens. Philippi actually becomes a Roman colony and a Roman capital in that area. And those who would have never had any hope of Roman citizenship are now made Roman citizens. You say, why is that important? Well, it's important for a number of reasons. Look at verse 12. And from thence to Philippi, which is the chief city of that part of Macedonia, and a colony, it's a chief city. city, not because of its location, but because Octavius made it a colony and gave them citizenship. Look at verse 21, and teach customs, talking about Paul's preaching. Hey, he's teaching customs which are not lawful for us to receive, neither to observe being Romans. You say, what's the importance here, preacher? They consider themselves Romans. And one of the things that it was very important to do as a Roman citizen was to worship Caesar. Now they had hundreds of gods, maybe thousands. But every year, you were to at least make one small offering to Caesar. And they wanted to protect being a Roman colony, and they wanted to protect being Roman citizens, so when anybody showed up and started saying there was another king, and there was a real, true God, and he started preaching the gospel, brother, opposition was going to be raised. Remember that. Remember that as we go on in this. Well, when the Apostle Paul and Silas and Timothy and Luke arrive at Philippi, there's no synagogue. Paul usually started preaching in a synagogue. But a city had to have a certain number of Jewish men to have a synagogue, and there were no Jewish men, or not many Jewish men that were permanent residents of Philippi. And so what you did, if you were a Hebrew, if you were a Jew, you were instructed that if there was no synagogue, if you were in a city, that on the Sabbath day you were to find a quiet spot by the river, if there was a river or a park, some quiet spot where you worship the Lord. Now isn't that interesting that Paul and his missionary party went to the riverside? They didn't just go to the riverside because there was a park there. They went to the riverside because they knew there would be people who were pious at that riverside. And when they arrive at that riverside, they begin to preach the gospel. They begin to engage with people, and one of the first ones that hear their preaching is a woman named Lydia. And the Bible tells us that Lydia, when she heard the preaching of the Word of God, accepted Christ as her Savior. And her family accepted Christ as her Savior. And so grateful was she that she actually came to the Apostle Paul and said, listen, I've got a place that we can meet. I've got a place where we can teach. Please come to my home and begin, I don't know that she would have understood it as a church, but she wanted her home to be used as a place where he could teach the Word of God. Now, understand this. Whenever you have the gospel being preached, Satan hates it. And you can guarantee that his opposition is going to grow. Notice verse 16, And it came to pass, as we went to prayer, a certain damsel, possessed with a spirit of divination, met us, which brought her masters much gain by soothsaying. The same followed Paul and us, that's Luke writing, and cried, saying, These men are the servants of the Most High God, which show unto us the way of salvation. And this did she many days. But Paul, being grieved, turned and said to the spirit, I command thee in the name of Jesus Christ to come out of her. And he came out the same hour. Now, you say, preacher, why did Paul do that? She was agreeing. She was saying, hey, these men preach the true God. These men are preaching real salvation. Well, please understand that one of Satan's great tactics is to appear to be what we are. All through my ministry, I would have people, preachers and other people, come and say, they would begin something like this, now preacher, we're just like you. And when you've got to tell me you're just like me, you're probably not just like me, alright? What this young lady was doing was subtly building herself up as, listen, these guys are here with my invitation. These guys are here with my approval. These guys are just like me. And the apostle Paul knows that this is a demonic-filled young lady. He knows that this is not the true gospel. And he tries to be kind and finally he understands, no, this is demon activity and this young lady needs freed and this needs to be stopped. And he casts that demon out of that young lady by the power of God. Now again, notice in verse 19. And when her masters saw that the hope of their gains was gone, they caught Paul and Silas, drew them into the marketplace under the rulers, brought them to the magistrates saying, these men being Jews, you wonder why there wasn't a synagogue there? These men being Jews do exceedingly trouble our city. They teach customs which are not lawful for us to receive, neither to observe, being Romans. And the multitudes rose up together against them. And the magistrates rent off their clothes and commanded to beat them. Now for the sake of time I'm not going to read all the rest of the verses. You're very familiar with them. They are unfairly arrested, unjustly arrested. They are handed to the jailer who proceeds to beat them. And I mean when you received a beating in those days, it was a beating. He takes them after beating them mercilessly, not caring about their condition. Takes them to the lowest part of his dungeon. Puts them in the stocks. Doesn't try to treat the stripes on their back. And there in the bottom of his jail comes midnight. And folks, we can't pretty this up. They're in agony. They're in agony. I've got a little hangnail and if I'm a preacher, I'm outwept today for the pain in my finger. I had to actually put peroxide on it. Do you feel sorry for me? No, I'm not trying to be silly, but I'm just trying to tell you these men are in agony. And you know what they do at midnight? They don't curse the jailer. They don't shout to God how unfair they're being treated. They don't sing praises. And you remember what God did, don't you? You're in the bottom of the dungeon and that's when God chooses to send an earthquake. I don't want an earthquake when I'm in the dungeon. But God sends an earthquake. They are set free. The other prisoners are set free. And Paul encourages all to stay there. The jailer, you know what happens. He calls down and he comes up with, what must I do to be saved? And Paul tells him and he gets saved and all his family gets saved. And you know what we just saw? A very successful missions trip. Lydia is saved. Her family is saved. I like to believe this little girl got saved. She was so happy to be free of that demon. I think she left the soothsayers and went over to Lydia's house. The jailer is saved and his family is saved. And Paul and Timothy and Titus and Luke are teaching this little church. And when they showed up, it was a demon filled Roman colony. And when they left, there was a church there. That's missions. Now, what I want to do is I want you to turn with me over to Philippians chapter 4 and understand that as we turn our pages to Philippians chapter 4 10 years have passed. And now the Apostle Paul is not in Philippi. He's sitting in the city of Ephesus. And from the city of Ephesus he wants to write back to that group of people, that church which no doubt has grown and their influence has grown and their ministry has grown. And Paul thinks of them often and is thankful for every time he thinks of them and is grateful for the part that they now play in his life. And he's writing this letter from Ephesus back to this church at Philippi that was started in such a difficult season. Notice it with me starting in verse 10, chapter 4 verse 10. But I rejoiced in the Lord greatly that now at the last your care of me hath flourished again wherein you were all so careful but you lacked opportunity. Not that I speak in respect of want for I have learned. In whatsoever state I am therewith with to be content. I know both how to be abased and I know how to abound everywhere. And in all things I am instructed both to be full and to be hungry, both to abound and to suffer need. I can do all things through Christ which strengtheneth me.\" Boy, don't ever take that verse lightly. You know what that means? That means when your back is bleeding and hurting, you can sing praises. That means when you're taken outside the city of Lystra and stoned and left for dead, you can get up, shake off the dust and not be done with preaching, be committed to preaching. It means you can go into Jerusalem and be smitten by the high priest and hated by them and sent to Rome, and there put in prison, and then put in that filthy mammertine, the rat's nest, and know that the Colosseum is next to you and you hear the screams of the crowd as the Christians are martyred in front of them. Up above you is the Roman circus and you know that in that place they're putting the Christians on the track and running over them with chariots and with horses, and then you can say, I'm ready to be offered. Take me to the Colosseum. Take me to the circus because I can do all things through Christ which strengtheneth me. Sometimes we cheapen that verse. It is not a cheap verse. Not when you understand the man who uttered it. He says, notwithstanding ye have well done that ye did communicate with my affliction. Now ye Philippians know also that in the beginning of the gospel, when I departed from Macedonia, no church communicated with me as concerning giving and receiving, but ye only. For even in Thessalonica ye sent once and again unto my necessity, not because I desire a gift, but I desire fruit that may abound to your account. But I have all and abound. I am full, having received of Epaphroditus the things which were sent from you, an odor of a sweet smell, a sacrifice acceptable, well-pleasing to God. Oh, but my God shall supply all your need according to his riches in glory by Christ Jesus. What a holy passage. Let me very quickly show you missions from the perspective of the missionary, missions from the perspective of the church, and missions from the perspective of the Lord. The role of the missionary in missions. I want you to notice that ultimately the responsibility of a missionary is to know that the Lord is the source of everything he needs. There's an important statement that's made in verse 11. Would you see it? He says, for I have learned. The life of a missionary, if you study the Apostle Paul's life and others, is not an easy one. It's an exciting life, it's a rewarding life, but it is not an easy life. Consider modern-day missionaries, the challenges they face. Most missionaries, I see the Alvarez's and they travel with two beautiful little girls. And those little girls are on duty probably five nights a week in a church. And they better not run the aisle, and they better be perfect in their behavior because the preacher and the deacons are watching. Pastor, that little girl cried. I don't think they'll make it on the field. I'm telling you, it's not easy to pack your family up and travel for two years, thousands upon thousands of miles, staying in places you don't know where you're going to stay, you don't know who you're going to be staying with. Your children are children, and you're human beings too. I guess there's an exciting side to it, but quite frankly I'm glad for them to do it and not me. You're moving to a foreign country. You say, well that's exciting. Yeah, you're not vacationing in a foreign country, you're moving to a foreign country. You're going to learn everything new. You're going to learn a new language. Honestly, I am not trying to be humorous here. That's beyond me. I don't have enough think power to remember English, much less to learn a new language. And listen, not just learn a new language, communicate eternal truth to a soul in that language. Come on, it's not just I want those roles. It's without Christ you're going to hell, and it's an eternal difference in a person's life. It is no light thing. They learn that language. They learn a new culture. They're dependent on exchange rates, churches dropping them. They answer to a hundred bosses with a hundred different perspectives. You say, what do you mean preacher? They got a hundred supporting pastors, and we're Baptists, and every one of those Baptist pastors sees something a little bit different than the other Baptist pastor, and they answer to all of them. You say, are you feeling sorry for missionaries? No, I don't feel sorry for them. I'm just trying to be realistic that when we talk about missionaries, it's not an easy thing to do. Through all that Paul says, I've learned. He learned to be content even when circumstances were difficult, even when churches disappointed him, even when nationals tried to kill him, because the ultimate source of his supply and the ultimate source of the help for his life was not another missionary, not another person, not just a local church. It was God. God had called them, and that's why Paul says, I can do all things through my supporting churches. No, I can do all things through the team I work with here on the field. No, men will fail you, but I can do what God has called me to do through Jesus Christ. Man, that's what Paul says. I've learned that. I've learned that your dependency missionary better be on the Lord. But now, wait a minute. Then he says this in verse 14, notwithstanding. Hey, I've learned how to be content. I've learned how to trust only the Lord, but now look what he says. Notwithstanding, ye have well done, that ye did communicate with my affliction. Hey, God uses churches to do his providing work. And Paul is expressing gratitude for the care of the church at Philippi. What a wonderful partnership when God uses a church to be a blessing to a missionary. Notice with me how the church has a role in these missions outreaches. Number one, this great church at Philippi understood they had a debt they owed. Notice with me in verse 15. Now, ye Philippians know also that in the beginning of the gospel, what is Paul referring to there? Is Paul taking them back to the birth of Christ at Bethlehem? No. Is Paul taking them back to the cross at Calvary? No. You know what Paul is taking them back to? Paul is saying now in the beginning of the gospel, hey, church at Philippi, do you remember when I showed up at that riverside and you had never heard of Jesus? And you didn't know there was a heaven? And you didn't know there was a resurrection? And you didn't know there was one true God? Remember in the beginning of the gospel when we stood at that riverside and told you the truth, and Lydia, you got saved and your household got saved? Hey, jailer. Hey, tough guy. Hey, listen, do you remember when you were ready to put a sword in your own stomach because you thought the prisoners were gone? You remember we told you about Christ? Can I share this with you tonight? One of the essential things for every one of our lives is this. Remember where God got you. I've been preaching for 47 years. I am a good man. No, I'm not. No, I'm not. I'm a sinner saved by grace. And sometimes we've been around church so long that we kind of think of ourselves as maybe a little better than them out there. But for the grace of God, we are out. there, and when God found me and got me, God didn't reach up to a high shelf and find Mike Edwards. Hey, there's a worthy find. God found me in a miry pit where He found you, and He drug us out of that miry pit, and cleaned us up, and saved us, and we are tonight what we are by the grace of God. Get over yourself. We are sinners, saved by God's grace, and what Paul is saying is, listen, do you remember what you were? Do you remember where you were when God found you? And listen, that is motivation to say this, if God can save me, God can save them. God can save that guy with 15 holes in his ear and a big widening. God can save that guy who puts a needle in his arm. God can save that guy who's left his family and deserted his children. I'm just telling you, God can save them, and God help us to get over our sanctified selves. And remember that we've got a debt, a debt that we owe, and they had a plan to pay that debt. Look in verse 14 again. You have well done that you did communicate with me. I love that word communicate. In the Greek it's the word koinonia. We hear that word often. It just simply means to share. It means they took what they had, and they shared it with others. And what a wonderful picture of how the physical can be used to accomplish the spiritual. These people gave. Now understand this, right now in Macedonia things are not going well. The economy is not good, if you will. These folks are suffering much affliction, yet even in the midst of that affliction, you know what they said? We've got to send to Paul, because there are people that need to hear the gospel, and we need to help him reach those people. And in the midst of their affliction, they gave of themselves, and they gave what they had, because they knew they owed a debt. Quickly, I want you to notice how the Lord viewed that. Look again at verse 17. Not because I desire a gift. Can I dispel a notion if it's in this room? You know one of the hardest things for Gary Sadarsky to do? Come to a church and ask for support. Anybody want that job? Anybody want that job where you go from church to church to church, because God has laid a call and a burden on your life, and you go and you say to the pastor, you try to get a meeting at the church, and you say to the church, will you please help us? And you always say, will you pray for us? Because that is valid, but you also know that you need dollars to get to that place. I don't want that job. And yet that's the calling on their life. And Paul says, man, I'm not coming to you by letter or person, because I desire a gift. I'm not a moochinary. I'm not trying to enrich myself on going to the field. By the way, I have never met a rich missionary. I've met missionaries who are barely getting by. I've met missionaries who are begging God to provide the need. I've never met a rich one, and Paul says, I'm not coming because I desire your money, a desire, a gift. I need it, but I'm not trying to enrich myself. I'm coming because I want me and you to bear fruit. Look what he says. Not because I desire a gift, verse 17, but I desire fruit that may abound to your account. I absolutely love that verse, preacher. I don't want to dramatize this too much. I don't want to go overboard, but I'm telling you, heaven is going to be an incredible place. And there from every tribe and every tongue and every color of people, every race, we are going to stand around the throne of God and kind of compete with each other to see who can throw their crown quickest to the Lord, who is deserving. And we are going to sing praises to Him. I think there'll be one language in heaven. But I'm fully expecting someday for somebody to come up to me and say, now I know we've got perfect knowledge, but this is my illustration, so stay out of it. Somebody coming up to me and say, I want you to know, I appreciate the gift that you made that allowed the Sadarskis to come to Poland, that allowed Brother and Mrs. Alvarez to come to Mexico, Monterey, a difficult place. Because when Brother Alvarez preached, when Mrs. Alvarez taught that Sunday school lesson, I was a little girl and I got saved. You think sacrifice will be worth it that day? Fruit that abounds. Listen, he goes on and he says this, but I have all and abound. I am full, having received of Epaphroditus the things which were sent from you, an odor of a sweet smell, a sacrifice acceptable, well-pleasing to God. Hey, listen, they were not a rich church. And there were times of affliction, but they dug into their pockets because they knew they had a debt that there were others who needed Christ like they needed Christ, had needed Him, and now had Him. And so they gave, and Paul says, let me tell you how the Lord views that gift. And again, you forgive me for being a little dramatic. On Sundays we pass the offering plate, or at least give you the opportunity to put something in the offering plate. Somewhere, sometime, some Sunday, you've had a little struggle because you wanted to give something to missions, but you also knew that you could have allocated that money this way. You could have prioritized that money this way, but it's just on your heart to give to the missions program at church. And maybe with a little shaking hand, you put that out, and it drops in the plate, and you know that you can't do the other thing you wanted to do, but you just made a sacrifice and gave it to the Lord. And beyond our vision, beyond our understanding, I think something is true. That from that little offering plate and from your pew, something rises. You say, what is it? It's an odor. An odor of what? An odor that is pleasing to God. An odor that sees you saying, I can do without that. I'd rather meet this need. I'd rather this missionary have his need met. And as that ascends to the Lord, it is pleasing to the Lord. I don't smell it. I don't see it. I understand it. Thanksgiving time, it's a big season at our house, and Christmas. It's actually Christmas when my wife does this. She makes cinnamon rolls, homemade cinnamon rolls. You ever had one? You ever had 30? She makes those cinnamon rolls, and usually I'm in another room in the house, and she bakes for like seven days in a row. I think it's a religious experience, but she bakes and bakes and bakes. And when that oven door first opens up, you know what happens. Those cinnamon rolls and that odor fills the house. And I'm back in the other room, and I go, that's pleasing to me. That's an acceptable offering to me. I don't mean to be silly, but that's the Lord. The Lord loves our willingness to sacrifice. And by the way, when the Lord smells that, you say, well, I'll have to do without. Yeah, maybe. God will give you grace if you do. But can I remind you of the next verse? But my God shall supply all your need according to his riches in glory by Christ Jesus. We read that verse, and we use that verse. Oh, it's on a lot of plaques, and on a lot of cross-stitch, and so on. And it is, in general, true about giving. But I want you to understand this, that that verse is actually in context of missions giving. The actual context is Paul saying back to these poor Philippians, you have done well. You have shared. even when you were short, even when you had needs, but you remembered the change in your life from the gospel, and you understood that others needed that, and you took from the little you had, and you said, I can do this later, I'll put this off. The real priority are the souls of men, and Paul reached souls, and oh goodness, the ones he reaches will abound to our account, and God is pleased, that's missions, that's missions. You wonder why we have revival in our churches when we have missions conferences? Because we finally put ourselves aside and think of others. That's what missions does. I close with this, 1956, four young men, four young men, actually five, a fifth will join them, moved their families to Ecuador, to Quito, Ecuador. One of those men was named Jim Elliott, and he so wanted to reach one particular tribe, the Aucas. They had had some success in reaching other tribes, but the Auca Indians in Ecuador were a serious business. They were killers. They had killed a number of workers on oil plantations. They had killed others who had tried to come into their camp and talk with them and civilize them, if you will. But Jim Elliott and others had a real desire to reach them. They came up with a plan. Nate Saint was a pilot, he had a little plane, and he would fly over and drop gifts, and then they figured out a way to drop a bucket down, and they would put gifts in. And one day, after a couple of weeks of this, the Aucas actually sent a gift back up. And they thought, this is it, we can reach them, they're open to us now. And Nate Saint found a little place, a little strip to land on right by the river, and Jim Elliott went in, he dropped Jim off, and then three more trips to take the other three in. And they at first seemed to be making headway with the Auca Indians. But all of it was a ruse. Not long after that first day, two Auca women came out of the jungle on the other side of the river. And they seemed to be coming in peace and seemed to be offering to talk. And Elliott and another man got into the river and started a cross to them. And as they were doing that, they heard a rustling behind them, and Auca men had jumped out of the woods with spears and bows and arrows, and were coming quickly, and there was no doubt what was in their mind, they were going to kill Jim Elliott, Nate Saint, and the others who were in the river. Now here's the unbelievable thing. Jim Elliott had a pistol in his coat. He reached in to draw the pistol, and someone else looked at him and he looked at them because they had made a pact that the only thing they would use the pistol for was protection from animals. They would not kill an Auca Indian because they knew that soul was lost. Jim Elliott, Nate Saint, and three others were killed in that river that day. When they could have protected themselves. He wrote this, and to me it's incredible. Jim Elliott wrote, he is no fool who gives what he cannot keep to gain what he cannot lose. Sometimes we are so careful about holding on to everything we have here. To making sure that we're cared for here, and I'm a planner, I'm not for just being foolish. But I am saying this to you, that we owe a debt. And missions is the way that we can pay that debt. And God calls missionaries to go into places to do things that I don't want to do. But they're not the only ones who have to live by faith. We are called to live by faith. And we are called to be the rope holders. We are called to be the ones who give so that they can go. And I'm telling you, it takes them to sacrifice home and sacrifice a lot of things with family, sacrifice career. But listen, we are called upon to sacrifice. We are called to prioritize. We are called to set one thing above another. We are called to do without sometimes. Boy, not a message our generation wants to hear. But when God sees us say, there's something more important than filling my need, something more important than satisfying my want, I want to share what I have so that they can go, so that they can preach, so that others can hear. And when we make that choice, God goes, that's pleasing, that's acceptable. You ever heard this? You cannot out give God. Well, the proof of it is there in verse 19. God says, when you've got that kind of heart, here's what I do for you, I'll supply all your need. Big circle. With this, I close. You know, I have never seen a U-Haul at a funeral. You ever seen it? I've never seen a hearse pulling a U-Haul because you don't take it with you and because there is something beyond this life. And what Jim Elliott said was, reprioritize. Really look out there at what really is important. Remember where God got you and how God changed your life and find some portion of your heart that can give. That can give. God may be calling you to give your life. He may want you to go. Next time I preach, I want to preach about that. But God is definitely calling us, church, to set right priorities. And souls are the highest priority that God has. Would you pray with me? Father, help us to see truth. I pray that you would speak to our hearts about the priorities in our lives. I don't think you want anybody to be foolish. I don't think you want missionaries to be foolish. But I do think you want us to be sacrificial. I do think you want us to care about souls. I do think you want us to remember where we were when you found us. I do think you want us to consider how you've made our lives better, how you've promised us beyond this life, eternal life. I do think you want us to remember that just as much as you loved us, you love every person in this world. I do think you want us to remember that you want us to bear fruit. God, would you help us to prioritize? Would you help us to struggle with that in our lives? What could we set aside? What could we do without? What could we change? What desire could we put away? What habit could we undo that would allow us to give so that others can hear, so that others can go? Lord, I pray that you would lay on our hearts tonight that it's not just the missionaries who should pay a price, but we ought to be willing to sacrifice too. So in whatever way you desire, I pray you'd speak into the lives of people. Maybe they just need to struggle with their priorities. Maybe they need to make a commitment that they're going to give more so that more can hear. Maybe there's one here tonight that you've been really, you've been dealing with them in their heart and they know that you're dealing with them. Lord, may they just invite you in. And if it's a call to the field, then may they surrender. If it's a call to prioritize, may they make that choice. Lord, I pray you'd help us to see our need. In Jesus' name I pray, amen. I'm gonna ask you to...",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.400000095367432,
      "text": " I don't know if I'd come back."
    },
    {
      "id": 1,
      "start": 31.0,
      "end": 31.799999237060547,
      "text": " I didn't do it."
    },
    {
      "id": 2,
      "start": 31.799999237060547,
      "end": 32.79999923706055,
      "text": " No?"
    },
    {
      "id": 3,
      "start": 32.79999923706055,
      "end": 33.29999923706055,
      "text": " Good?"
    },
    {
      "id": 4,
      "start": 33.29999923706055,
      "end": 34.68000030517578,
      "text": " Got it."
    },
    {
      "id": 5,
      "start": 34.68000030517578,
      "end": 39.599998474121094,
      "text": " Because I plan on getting really loud, so I'm glad."
    },
    {
      "id": 6,
      "start": 39.599998474121094,
      "end": 41.52000045776367,
      "text": " The music has been outstanding."
    },
    {
      "id": 7,
      "start": 41.52000045776367,
      "end": 44.2400016784668,
      "text": " And I don't know that I've ever been a church."
    },
    {
      "id": 8,
      "start": 44.2400016784668,
      "end": 47.0,
      "text": " I don't ever know who's going to play the piano."
    },
    {
      "id": 9,
      "start": 47.0,
      "end": 49.52000045776367,
      "text": " There's like a revolving thing there."
    },
    {
      "id": 10,
      "start": 49.52000045776367,
      "end": 53.52000045776367,
      "text": " There's like seven people, I think, that play the piano."
    },
    {
      "id": 11,
      "start": 53.52000045776367,
      "end": 54.959999084472656,
      "text": " And I say this sincerely."
    },
    {
      "id": 12,
      "start": 54.959999084472656,
      "end": 57.36000061035156,
      "text": " I'm not doing this in jest."
    },
    {
      "id": 13,
      "start": 57.36000061035156,
      "end": 61.91999816894531,
      "text": " If I could have chosen my gift, and if I have one,"
    },
    {
      "id": 14,
      "start": 61.91999816894531,
      "end": 67.12000274658203,
      "text": " I would have chosen to be able to play the piano and sing."
    },
    {
      "id": 15,
      "start": 67.12000274658203,
      "end": 69.63999938964844,
      "text": " I think that there's a great deal of good"
    },
    {
      "id": 16,
      "start": 69.63999938964844,
      "end": 72.36000061035156,
      "text": " that can be done in that and come from that."
    },
    {
      "id": 17,
      "start": 72.36000061035156,
      "end": 77.04000091552734,
      "text": " And I don't mind preaching, but that singing's good stuff."
    },
    {
      "id": 18,
      "start": 77.04000091552734,
      "end": 79.08000183105469,
      "text": " Amen?"
    },
    {
      "id": 19,
      "start": 79.08000183105469,
      "end": 82.0,
      "text": " And when you've got a face like this, singing would help,"
    },
    {
      "id": 20,
      "start": 82.0,
      "end": 82.5999984741211,
      "text": " I think."
    },
    {
      "id": 21,
      "start": 82.5999984741211,
      "end": 84.16000366210938,
      "text": " I don't know."
    },
    {
      "id": 22,
      "start": 84.16000366210938,
      "end": 87.44000244140625,
      "text": " Take your Bible, if you would, and turn with me to chapter 16"
    },
    {
      "id": 23,
      "start": 87.44000244140625,
      "end": 89.08000183105469,
      "text": " of the book of Acts."
    },
    {
      "id": 24,
      "start": 89.08000183105469,
      "end": 90.4800033569336,
      "text": " That's where we're going to start."
    },
    {
      "id": 25,
      "start": 90.4800033569336,
      "end": 91.63999938964844,
      "text": " We won't finish there."
    },
    {
      "id": 26,
      "start": 91.63999938964844,
      "end": 93.19999694824219,
      "text": " We won't end up there."
    },
    {
      "id": 27,
      "start": 93.19999694824219,
      "end": 95.19999694824219,
      "text": " But that's where we're going to start tonight."
    },
    {
      "id": 28,
      "start": 95.19999694824219,
      "end": 98.08000183105469,
      "text": " And I want to preach on this thought tonight,"
    },
    {
      "id": 29,
      "start": 98.08000183105469,
      "end": 101.76000213623047,
      "text": " seeing missions in action."
    },
    {
      "id": 30,
      "start": 101.76000213623047,
      "end": 104.4000015258789,
      "text": " Seeing missions in action."
    },
    {
      "id": 31,
      "start": 104.4000015258789,
      "end": 107.72000122070312,
      "text": " And when I say that, we're going to look at it"
    },
    {
      "id": 32,
      "start": 107.72000122070312,
      "end": 110.72000122070312,
      "text": " from the perspective of the missionary."
    },
    {
      "id": 33,
      "start": 110.72000122070312,
      "end": 112.5999984741211,
      "text": " We're going to look at it from the perspective"
    },
    {
      "id": 34,
      "start": 112.5999984741211,
      "end": 114.5199966430664,
      "text": " of the supporting church."
    },
    {
      "id": 35,
      "start": 114.5199966430664,
      "end": 116.76000213623047,
      "text": " And we're going to look at it from the perspective"
    },
    {
      "id": 36,
      "start": 116.76000213623047,
      "end": 119.04000091552734,
      "text": " of the Lord himself."
    },
    {
      "id": 37,
      "start": 119.04000091552734,
      "end": 122.4000015258789,
      "text": " But let's start in Acts chapter 16."
    },
    {
      "id": 38,
      "start": 122.4000015258789,
      "end": 124.87999725341797,
      "text": " And we'll read two verses there."
    },
    {
      "id": 39,
      "start": 124.87999725341797,
      "end": 126.08000183105469,
      "text": " We'll read a number more."
    },
    {
      "id": 40,
      "start": 126.08000183105469,
      "end": 129.60000610351562,
      "text": " But let's start with verses 9 and 10."
    },
    {
      "id": 41,
      "start": 129.60000610351562,
      "end": 133.8800048828125,
      "text": " Acts 16, verses 9 and 10."
    },
    {
      "id": 42,
      "start": 133.8800048828125,
      "end": 137.63999938964844,
      "text": " And a vision appeared to Paul in the night."
    },
    {
      "id": 43,
      "start": 137.63999938964844,
      "end": 140.0800018310547,
      "text": " And there stood a man of Macedonia"
    },
    {
      "id": 44,
      "start": 140.0800018310547,
      "end": 145.1199951171875,
      "text": " and prayed him, saying, come over into Macedonia"
    },
    {
      "id": 45,
      "start": 145.1199951171875,
      "end": 146.8800048828125,
      "text": " and help us."
    },
    {
      "id": 46,
      "start": 146.8800048828125,
      "end": 148.75999450683594,
      "text": " And after he had seen the vision,"
    },
    {
      "id": 47,
      "start": 148.75999450683594,
      "end": 153.9600067138672,
      "text": " immediately we endeavored to go into Macedonia,"
    },
    {
      "id": 48,
      "start": 153.9600067138672,
      "end": 160.16000366210938,
      "text": " assuredly gathering that the Lord had called us for to preach"
    },
    {
      "id": 49,
      "start": 160.16000366210938,
      "end": 162.83999633789062,
      "text": " the gospel unto them."
    },
    {
      "id": 50,
      "start": 162.83999633789062,
      "end": 164.16000366210938,
      "text": " Let's pray."
    },
    {
      "id": 51,
      "start": 164.16000366210938,
      "end": 167.60000610351562,
      "text": " Father, we're very grateful for this evening to be together."
    },
    {
      "id": 52,
      "start": 167.60000610351562,
      "end": 171.0800018310547,
      "text": " Thank you so much for the blessing of the music"
    },
    {
      "id": 53,
      "start": 171.0800018310547,
      "end": 175.9600067138672,
      "text": " that we've heard tonight and been able to sing ourselves."
    },
    {
      "id": 54,
      "start": 175.9600067138672,
      "end": 178.1999969482422,
      "text": " We're thankful for these missionary families,"
    },
    {
      "id": 55,
      "start": 178.1999969482422,
      "end": 180.8800048828125,
      "text": " the Alvarez and the Zdarsky families."
    },
    {
      "id": 56,
      "start": 180.8800048828125,
      "end": 183.39999389648438,
      "text": " Thank you for them, for the call that you've"
    },
    {
      "id": 57,
      "start": 183.39999389648438,
      "end": 186.1199951171875,
      "text": " placed on their life."
    },
    {
      "id": 58,
      "start": 186.1199951171875,
      "end": 189.1999969482422,
      "text": " Lord, I pray that you'd bless them and then bless us"
    },
    {
      "id": 59,
      "start": 189.1999969482422,
      "end": 190.75999450683594,
      "text": " with understanding tonight."
    },
    {
      "id": 60,
      "start": 190.75999450683594,
      "end": 196.8000030517578,
      "text": " And help us to see how important our role is in missions"
    },
    {
      "id": 61,
      "start": 196.8000030517578,
      "end": 198.24000549316406,
      "text": " as well."
    },
    {
      "id": 62,
      "start": 198.24000549316406,
      "end": 201.1199951171875,
      "text": " Bless the message and bless our understanding."
    },
    {
      "id": 63,
      "start": 201.1199951171875,
      "end": 204.67999267578125,
      "text": " In Jesus' name, amen."
    },
    {
      "id": 64,
      "start": 204.67999267578125,
      "end": 211.1199951171875,
      "text": " Paul went to Philippi as the result of a missionary call."
    },
    {
      "id": 65,
      "start": 211.1199951171875,
      "end": 214.47999572753906,
      "text": " I don't want to get overly wrapped up in this,"
    },
    {
      "id": 66,
      "start": 214.47999572753906,
      "end": 217.44000244140625,
      "text": " but I'm glad that the Bible teaches us"
    },
    {
      "id": 67,
      "start": 217.44000244140625,
      "end": 220.83999633789062,
      "text": " that God calls people."
    },
    {
      "id": 68,
      "start": 220.83999633789062,
      "end": 223.9600067138672,
      "text": " And I think it's important that we understand"
    },
    {
      "id": 69,
      "start": 223.9600067138672,
      "end": 226.44000244140625,
      "text": " that God calls people."
    },
    {
      "id": 70,
      "start": 226.44000244140625,
      "end": 230.8000030517578,
      "text": " I think he probably calls more people than respond."
    },
    {
      "id": 71,
      "start": 230.8000030517578,
      "end": 235.0,
      "text": " But God calls us and calls all of us."
    },
    {
      "id": 72,
      "start": 235.0,
      "end": 237.16000366210938,
      "text": " Not all of us are called to a foreign field."
    },
    {
      "id": 73,
      "start": 237.16000366210938,
      "end": 239.8800048828125,
      "text": " Not all of us are called to fill a pulpit."
    },
    {
      "id": 74,
      "start": 239.8800048828125,
      "end": 242.9600067138672,
      "text": " But God gifts every believer."
    },
    {
      "id": 75,
      "start": 242.9600067138672,
      "end": 245.27999877929688,
      "text": " And I believe God calls every believer"
    },
    {
      "id": 76,
      "start": 245.27999877929688,
      "end": 249.1199951171875,
      "text": " to use the gift that he has given them"
    },
    {
      "id": 77,
      "start": 249.1199951171875,
      "end": 251.52000427246094,
      "text": " wherever he places them."
    },
    {
      "id": 78,
      "start": 251.52000427246094,
      "end": 253.8800048828125,
      "text": " When we come to Acts chapter 16 and we"
    },
    {
      "id": 79,
      "start": 253.8800048828125,
      "end": 257.67999267578125,
      "text": " see that vision appear to Paul, we"
    },
    {
      "id": 80,
      "start": 257.67999267578125,
      "end": 260.8399963378906,
      "text": " ask ourselves, what took place there?"
    },
    {
      "id": 81,
      "start": 260.8399963378906,
      "end": 262.3599853515625,
      "text": " What's going on?"
    },
    {
      "id": 82,
      "start": 262.3599853515625,
      "end": 265.760009765625,
      "text": " And the truth is that in his companion"
    },
    {
      "id": 83,
      "start": 265.760009765625,
      "end": 269.8399963378906,
      "text": " are Silas and Timothy and Dr. Luke."
    },
    {
      "id": 84,
      "start": 269.8399963378906,
      "end": 272.760009765625,
      "text": " And they are on a missionary journey."
    },
    {
      "id": 85,
      "start": 272.760009765625,
      "end": 278.5199890136719,
      "text": " And it was their intention to minister in Asia Minor."
    },
    {
      "id": 86,
      "start": 278.5199890136719,
      "end": 280.67999267578125,
      "text": " They've come through Lystra."
    },
    {
      "id": 87,
      "start": 280.67999267578125,
      "end": 283.4800109863281,
      "text": " And they've visited a couple of other cities."
    },
    {
      "id": 88,
      "start": 283.4800109863281,
      "end": 286.3599853515625,
      "text": " And Paul's desire, Paul's thought"
    },
    {
      "id": 89,
      "start": 286.3599853515625,
      "end": 289.32000732421875,
      "text": " is that he wants to continue to minister"
    },
    {
      "id": 90,
      "start": 289.32000732421875,
      "end": 291.0799865722656,
      "text": " in the area of Bithynia."
    },
    {
      "id": 91,
      "start": 291.0799865722656,
      "end": 293.0400085449219,
      "text": " You say, where's Bithynia?"
    },
    {
      "id": 92,
      "start": 293.0400085449219,
      "end": 294.760009765625,
      "text": " Where is Troas?"
    },
    {
      "id": 93,
      "start": 294.760009765625,
      "end": 297.3599853515625,
      "text": " Well, think of modern day Turkey."
    },
    {
      "id": 94,
      "start": 297.3599853515625,
      "end": 301.32000732421875,
      "text": " If you have any knowledge of the geography of that area,"
    },
    {
      "id": 95,
      "start": 301.32000732421875,
      "end": 304.9599914550781,
      "text": " if you know where the Dardanelles Strait is,"
    },
    {
      "id": 96,
      "start": 304.9599914550781,
      "end": 307.79998779296875,
      "text": " right there is Troas."
    },
    {
      "id": 97,
      "start": 307.79998779296875,
      "end": 312.239990234375,
      "text": " And God has just closed door after door after door."
    },
    {
      "id": 98,
      "start": 312.239990234375,
      "end": 314.0799865722656,
      "text": " And I think with some frustration,"
    },
    {
      "id": 99,
      "start": 314.0799865722656,
      "end": 317.67999267578125,
      "text": " Paul says, OK, let's go down to Troas."
    },
    {
      "id": 100,
      "start": 317.67999267578125,
      "end": 319.20001220703125,
      "text": " We've got friends there."
    },
    {
      "id": 101,
      "start": 319.20001220703125,
      "end": 322.2799987792969,
      "text": " And they're literally being put up for the night."
    },
    {
      "id": 102,
      "start": 322.2799987792969,
      "end": 325.1199951171875,
      "text": " And I don't know where Silas and Timothy and Luke are."
    },
    {
      "id": 103,
      "start": 325.1199951171875,
      "end": 326.0400085449219,
      "text": " But Luke's with them."
    },
    {
      "id": 104,
      "start": 326.0400085449219,
      "end": 328.32000732421875,
      "text": " He's the one writing this."
    },
    {
      "id": 105,
      "start": 328.32000732421875,
      "end": 333.0400085449219,
      "text": " And that night, when Paul finally pillows his head"
    },
    {
      "id": 106,
      "start": 333.0400085449219,
      "end": 337.9599914550781,
      "text": " and finally goes to sleep, God speaks to him."
    },
    {
      "id": 107,
      "start": 337.9599914550781,
      "end": 341.4800109863281,
      "text": " And God gives him a vision."
    },
    {
      "id": 108,
      "start": 341.4800109863281,
      "end": 345.6000061035156,
      "text": " I know sometimes we talk about eating pizza and doing things"
    },
    {
      "id": 109,
      "start": 345.6000061035156,
      "end": 347.55999755859375,
      "text": " like that and getting visions."
    },
    {
      "id": 110,
      "start": 347.55999755859375,
      "end": 351.1600036621094,
      "text": " Please understand, that's not what's happening here."
    },
    {
      "id": 111,
      "start": 351.1600036621094,
      "end": 353.239990234375,
      "text": " God is speaking to Paul."
    },
    {
      "id": 112,
      "start": 353.239990234375,
      "end": 358.4800109863281,
      "text": " And as I alluded to in the Sunday school hour"
    },
    {
      "id": 113,
      "start": 358.4800109863281,
      "end": 362.8399963378906,
      "text": " yesterday morning, this is an important moment."
    },
    {
      "id": 114,
      "start": 362.8399963378906,
      "end": 366.760009765625,
      "text": " Because literally, God is calling"
    },
    {
      "id": 115,
      "start": 366.760009765625,
      "end": 371.44000244140625,
      "text": " Paul and his missionary party not just to another city,"
    },
    {
      "id": 116,
      "start": 371.44000244140625,
      "end": 377.2799987792969,
      "text": " but from Asia to the continent of Europe."
    },
    {
      "id": 117,
      "start": 377.2799987792969,
      "end": 379.55999755859375,
      "text": " And when Paul sees this vision and he"
    },
    {
      "id": 118,
      "start": 379.55999755859375,
      "end": 383.239990234375,
      "text": " sees this Macedonian man, understand"
    },
    {
      "id": 119,
      "start": 383.239990234375,
      "end": 386.8399963378906,
      "text": " that Macedonia is in present day Greece."
    },
    {
      "id": 120,
      "start": 386.8399963378906,
      "end": 389.6000061035156,
      "text": " And he wakes up from that vision."
    },
    {
      "id": 121,
      "start": 389.6000061035156,
      "end": 391.8399963378906,
      "text": " And boy, he stirs the party."
    },
    {
      "id": 122,
      "start": 391.8399963378906,
      "end": 394.9599914550781,
      "text": " Timothy, Silas, Luke, we've got to go."
    },
    {
      "id": 123,
      "start": 394.9599914550781,
      "end": 397.239990234375,
      "text": " I know where God wants us to go."
    },
    {
      "id": 124,
      "start": 397.239990234375,
      "end": 400.3599853515625,
      "text": " And they book fare on a ship."
    },
    {
      "id": 125,
      "start": 400.3599853515625,
      "end": 404.44000244140625,
      "text": " And the Bible tells us that they leave from Troas,"
    },
    {
      "id": 126,
      "start": 404.44000244140625,
      "end": 405.3999938964844,
      "text": " the port."
    },
    {
      "id": 127,
      "start": 405.3999938964844,
      "end": 410.3999938964844,
      "text": " They sail to an island not too far off the coast, Samothracea."
    },
    {
      "id": 128,
      "start": 410.3999938964844,
      "end": 412.55999755859375,
      "text": " When they leave Samothracea, and again,"
    },
    {
      "id": 129,
      "start": 412.55999755859375,
      "end": 416.79998779296875,
      "text": " remember, they drop off cargo and they pick up cargo."
    },
    {
      "id": 130,
      "start": 416.79998779296875,
      "end": 418.6400146484375,
      "text": " Where they're actually trying to get"
    },
    {
      "id": 131,
      "start": 418.6400146484375,
      "end": 423.6000061035156,
      "text": " is to a small port called Neapolis on the Greek coast."
    },
    {
      "id": 132,
      "start": 423.6000061035156,
      "end": 427.3599853515625,
      "text": " And when they land in Neapolis, Paul"
    },
    {
      "id": 133,
      "start": 427.3599853515625,
      "end": 433.1600036621094,
      "text": " makes a beeline for a little town called Philippi."
    },
    {
      "id": 134,
      "start": 433.1600036621094,
      "end": 436.79998779296875,
      "text": " Now, who in the world cares about Philippi?"
    },
    {
      "id": 135,
      "start": 436.79998779296875,
      "end": 441.0799865722656,
      "text": " Now, I consider myself an amateur historian."
    },
    {
      "id": 136,
      "start": 441.0799865722656,
      "end": 443.0799865722656,
      "text": " So in just about every sermon, you're"
    },
    {
      "id": 137,
      "start": 443.0799865722656,
      "end": 445.20001220703125,
      "text": " going to get a history lesson."
    },
    {
      "id": 138,
      "start": 445.20001220703125,
      "end": 449.7200012207031,
      "text": " And I don't want to see any frowns about it, all right?"
    },
    {
      "id": 139,
      "start": 449.7200012207031,
      "end": 453.0799865722656,
      "text": " Sometimes we don't know the background of things"
    },
    {
      "id": 140,
      "start": 453.0799865722656,
      "end": 456.5199890136719,
      "text": " and we miss some of the important little things that"
    },
    {
      "id": 141,
      "start": 456.5199890136719,
      "end": 457.79998779296875,
      "text": " are said."
    },
    {
      "id": 142,
      "start": 457.79998779296875,
      "end": 460.32000732421875,
      "text": " I want you to understand that Philippi"
    },
    {
      "id": 143,
      "start": 460.32000732421875,
      "end": 465.7200012207031,
      "text": " is a very important city from this standpoint."
    },
    {
      "id": 144,
      "start": 465.7200012207031,
      "end": 472.0799865722656,
      "text": " About 100 years before Paul shows up at Philippi,"
    },
    {
      "id": 145,
      "start": 472.0799865722656,
      "end": 477.0799865722656,
      "text": " there was a major battle that took place right outside"
    },
    {
      "id": 146,
      "start": 477.0799865722656,
      "end": 478.760009765625,
      "text": " its gates."
    },
    {
      "id": 147,
      "start": 478.760009765625,
      "end": 483.3599853515625,
      "text": " Two men, men named Brutus and Cassius,"
    },
    {
      "id": 148,
      "start": 483.3599853515625,
      "end": 486.9599914550781,
      "text": " you may remember who Brutus is, et tu Brute?"
    },
    {
      "id": 149,
      "start": 486.9599914550781,
      "end": 489.67999267578125,
      "text": " Brutus and Cassius were two of those"
    },
    {
      "id": 150,
      "start": 489.67999267578125,
      "end": 494.3999938964844,
      "text": " that murdered Julius Caesar, surprised him with the knives"
    },
    {
      "id": 151,
      "start": 494.3999938964844,
      "end": 498.4800109863281,
      "text": " and hundreds of knife thrusts into his body."
    },
    {
      "id": 152,
      "start": 498.4800109863281,
      "end": 501.20001220703125,
      "text": " And they killed Julius Caesar, intending"
    },
    {
      "id": 153,
      "start": 501.20001220703125,
      "end": 503.3999938964844,
      "text": " to seize the Roman Empire."
    },
    {
      "id": 154,
      "start": 503.3999938964844,
      "end": 507.67999267578125,
      "text": " There were two other important men, one of them Mark Anthony."
    },
    {
      "id": 155,
      "start": 507.67999267578125,
      "end": 510.1600036621094,
      "text": " And he now has left Egypt."
    },
    {
      "id": 156,
      "start": 510.1600036621094,
      "end": 516.0,
      "text": " And he has sided with Octavian, who is a great Roman general."
    },
    {
      "id": 157,
      "start": 516.0,
      "end": 519.9600219726562,
      "text": " And those two armies, the armies of Brutus and Cassius,"
    },
    {
      "id": 158,
      "start": 519.9600219726562,
      "end": 523.9600219726562,
      "text": " meet the army of Mark Anthony and Octavius"
    },
    {
      "id": 159,
      "start": 523.9600219726562,
      "end": 528.0800170898438,
      "text": " right outside of the city of Philippi."
    },
    {
      "id": 160,
      "start": 528.0800170898438,
      "end": 531.3599853515625,
      "text": " The citizens of Philippi decide that they're"
    },
    {
      "id": 161,
      "start": 531.3599853515625,
      "end": 537.1599731445312,
      "text": " going to aid and help Octavius and Mark Anthony."
    },
    {
      "id": 162,
      "start": 537.1599731445312,
      "end": 539.719970703125,
      "text": " And those two win the battle."
    },
    {
      "id": 163,
      "start": 539.780029296875,
      "end": 542.5999755859375,
      "text": " You say, this is fascinating stuff, preacher."
    },
    {
      "id": 164,
      "start": 542.5999755859375,
      "end": 543.719970703125,
      "text": " Now, wait a minute."
    },
    {
      "id": 165,
      "start": 543.719970703125,
      "end": 545.8400268554688,
      "text": " Here's what becomes important."
    },
    {
      "id": 166,
      "start": 545.8400268554688,
      "end": 548.4400024414062,
      "text": " Octavius became Caesar."
    },
    {
      "id": 167,
      "start": 548.4400024414062,
      "end": 552.6799926757812,
      "text": " And he so appreciated what the Philippians did,"
    },
    {
      "id": 168,
      "start": 552.6799926757812,
      "end": 558.4400024414062,
      "text": " what that city of Philippi did, that he conferred on them"
    },
    {
      "id": 169,
      "start": 558.4400024414062,
      "end": 560.6799926757812,
      "text": " every citizen of Philippi."
    },
    {
      "id": 170,
      "start": 560.6799926757812,
      "end": 563.47998046875,
      "text": " From that point on, their children"
    },
    {
      "id": 171,
      "start": 563.47998046875,
      "end": 567.5599975585938,
      "text": " were born Roman citizens."
    },
    {
      "id": 172,
      "start": 567.5599975585938,
      "end": 572.1199951171875,
      "text": " Philippi actually becomes a Roman colony"
    },
    {
      "id": 173,
      "start": 572.1199951171875,
      "end": 575.52001953125,
      "text": " and a Roman capital in that area."
    },
    {
      "id": 174,
      "start": 575.52001953125,
      "end": 579.280029296875,
      "text": " And those who would have never had any hope of Roman"
    },
    {
      "id": 175,
      "start": 579.280029296875,
      "end": 583.7999877929688,
      "text": " citizenship are now made Roman citizens."
    },
    {
      "id": 176,
      "start": 583.7999877929688,
      "end": 585.8400268554688,
      "text": " You say, why is that important?"
    },
    {
      "id": 177,
      "start": 585.8400268554688,
      "end": 587.760009765625,
      "text": " Well, it's important for a number of reasons."
    },
    {
      "id": 178,
      "start": 587.760009765625,
      "end": 589.2000122070312,
      "text": " Look at verse 12."
    },
    {
      "id": 179,
      "start": 589.2000122070312,
      "end": 591.4400024414062,
      "text": " And from thence to Philippi, which"
    },
    {
      "id": 180,
      "start": 591.4400024414062,
      "end": 596.1199951171875,
      "text": " is the chief city of that part of Macedonia,"
    },
    {
      "id": 181,
      "start": 596.1199951171875,
      "end": 601.280029296875,
      "text": " and a colony, it's a chief city."
    },
    {
      "id": 0,
      "start": 601.280029296875,
      "end": 605.280029296875,
      "text": " city, not because of its location, but because Octavius"
    },
    {
      "id": 1,
      "start": 605.280029296875,
      "end": 609.280029296875,
      "text": " made it a colony and gave them citizenship. Look at verse"
    },
    {
      "id": 2,
      "start": 609.280029296875,
      "end": 613.280029296875,
      "text": " 21, and teach customs, talking about Paul's"
    },
    {
      "id": 3,
      "start": 613.280029296875,
      "end": 617.280029296875,
      "text": " preaching. Hey, he's teaching customs which are not"
    },
    {
      "id": 4,
      "start": 617.280029296875,
      "end": 621.280029296875,
      "text": " lawful for us to receive, neither to observe"
    },
    {
      "id": 5,
      "start": 621.280029296875,
      "end": 625.280029296875,
      "text": " being Romans. You say, what's the"
    },
    {
      "id": 6,
      "start": 625.280029296875,
      "end": 629.280029296875,
      "text": " importance here, preacher? They consider themselves Romans."
    },
    {
      "id": 7,
      "start": 629.280029296875,
      "end": 633.280029296875,
      "text": " And one of the things that it was very important"
    },
    {
      "id": 8,
      "start": 633.280029296875,
      "end": 637.280029296875,
      "text": " to do as a Roman citizen was to worship"
    },
    {
      "id": 9,
      "start": 637.280029296875,
      "end": 641.280029296875,
      "text": " Caesar. Now they had hundreds of gods, maybe thousands."
    },
    {
      "id": 10,
      "start": 641.280029296875,
      "end": 645.280029296875,
      "text": " But every year, you were to at least make"
    },
    {
      "id": 11,
      "start": 645.280029296875,
      "end": 649.280029296875,
      "text": " one small offering to Caesar. And they wanted"
    },
    {
      "id": 12,
      "start": 649.280029296875,
      "end": 653.280029296875,
      "text": " to protect being a Roman colony, and they wanted to"
    },
    {
      "id": 13,
      "start": 653.280029296875,
      "end": 657.280029296875,
      "text": " protect being Roman citizens, so when anybody"
    },
    {
      "id": 14,
      "start": 657.280029296875,
      "end": 661.280029296875,
      "text": " showed up and started saying there was another king,"
    },
    {
      "id": 15,
      "start": 661.280029296875,
      "end": 665.280029296875,
      "text": " and there was a real, true God, and he"
    },
    {
      "id": 16,
      "start": 665.280029296875,
      "end": 669.280029296875,
      "text": " started preaching the gospel, brother, opposition was going"
    },
    {
      "id": 17,
      "start": 669.280029296875,
      "end": 673.280029296875,
      "text": " to be raised. Remember that. Remember that as we go"
    },
    {
      "id": 18,
      "start": 673.280029296875,
      "end": 677.280029296875,
      "text": " on in this. Well, when the Apostle Paul and Silas and Timothy"
    },
    {
      "id": 19,
      "start": 677.280029296875,
      "end": 681.280029296875,
      "text": " and Luke arrive at Philippi, there's no synagogue."
    },
    {
      "id": 20,
      "start": 681.280029296875,
      "end": 685.280029296875,
      "text": " Paul usually started preaching"
    },
    {
      "id": 21,
      "start": 685.280029296875,
      "end": 689.280029296875,
      "text": " in a synagogue. But a city had to have a certain number of"
    },
    {
      "id": 22,
      "start": 689.280029296875,
      "end": 693.280029296875,
      "text": " Jewish men to have a synagogue, and there were no"
    },
    {
      "id": 23,
      "start": 693.280029296875,
      "end": 697.280029296875,
      "text": " Jewish men, or not many Jewish men that were permanent residents"
    },
    {
      "id": 24,
      "start": 697.280029296875,
      "end": 701.280029296875,
      "text": " of Philippi. And so what you did, if you were"
    },
    {
      "id": 25,
      "start": 701.280029296875,
      "end": 705.280029296875,
      "text": " a Hebrew, if you were a Jew, you were instructed that if there"
    },
    {
      "id": 26,
      "start": 705.280029296875,
      "end": 709.280029296875,
      "text": " was no synagogue, if you were in a city, that on the Sabbath day"
    },
    {
      "id": 27,
      "start": 709.280029296875,
      "end": 713.280029296875,
      "text": " you were to find a quiet spot by the river, if there was a"
    },
    {
      "id": 28,
      "start": 713.280029296875,
      "end": 717.280029296875,
      "text": " river or a park, some quiet spot where you worship"
    },
    {
      "id": 29,
      "start": 717.280029296875,
      "end": 721.280029296875,
      "text": " the Lord. Now isn't that interesting that Paul and his"
    },
    {
      "id": 30,
      "start": 721.280029296875,
      "end": 725.280029296875,
      "text": " missionary party went to the riverside? They didn't just go to the riverside"
    },
    {
      "id": 31,
      "start": 725.280029296875,
      "end": 729.280029296875,
      "text": " because there was a park there. They went to the riverside because they"
    },
    {
      "id": 32,
      "start": 729.280029296875,
      "end": 733.280029296875,
      "text": " knew there would be people who were pious at that riverside."
    },
    {
      "id": 33,
      "start": 733.280029296875,
      "end": 737.280029296875,
      "text": " And when they arrive at that riverside, they"
    },
    {
      "id": 34,
      "start": 737.280029296875,
      "end": 741.280029296875,
      "text": " begin to preach the gospel. They begin to engage"
    },
    {
      "id": 35,
      "start": 741.280029296875,
      "end": 745.280029296875,
      "text": " with people, and one of the first ones that hear their preaching"
    },
    {
      "id": 36,
      "start": 745.280029296875,
      "end": 749.280029296875,
      "text": " is a woman named Lydia. And the Bible tells us that"
    },
    {
      "id": 37,
      "start": 749.280029296875,
      "end": 753.280029296875,
      "text": " Lydia, when she heard the preaching of the Word of God,"
    },
    {
      "id": 38,
      "start": 753.280029296875,
      "end": 757.280029296875,
      "text": " accepted Christ as her Savior. And her family"
    },
    {
      "id": 39,
      "start": 757.280029296875,
      "end": 761.280029296875,
      "text": " accepted Christ as her Savior. And so grateful was"
    },
    {
      "id": 40,
      "start": 761.280029296875,
      "end": 765.280029296875,
      "text": " she that she actually came to the Apostle Paul and said,"
    },
    {
      "id": 41,
      "start": 765.280029296875,
      "end": 769.280029296875,
      "text": " listen, I've got a place that we can meet. I've got a place"
    },
    {
      "id": 42,
      "start": 769.280029296875,
      "end": 773.280029296875,
      "text": " where we can teach. Please come to my home"
    },
    {
      "id": 43,
      "start": 773.280029296875,
      "end": 777.280029296875,
      "text": " and begin, I don't know that she would have understood it as a"
    },
    {
      "id": 44,
      "start": 777.280029296875,
      "end": 781.280029296875,
      "text": " church, but she wanted her home to be used as a"
    },
    {
      "id": 45,
      "start": 781.280029296875,
      "end": 785.280029296875,
      "text": " place where he could teach the Word of God."
    },
    {
      "id": 46,
      "start": 785.280029296875,
      "end": 789.280029296875,
      "text": " Now, understand this. Whenever you"
    },
    {
      "id": 47,
      "start": 789.280029296875,
      "end": 793.280029296875,
      "text": " have the gospel being preached, Satan"
    },
    {
      "id": 48,
      "start": 793.280029296875,
      "end": 797.280029296875,
      "text": " hates it. And you can guarantee that"
    },
    {
      "id": 49,
      "start": 797.280029296875,
      "end": 801.280029296875,
      "text": " his opposition is going to grow. Notice verse 16,"
    },
    {
      "id": 50,
      "start": 801.280029296875,
      "end": 805.280029296875,
      "text": " And it came to pass, as we went to prayer,"
    },
    {
      "id": 51,
      "start": 805.280029296875,
      "end": 809.280029296875,
      "text": " a certain damsel, possessed with a spirit of divination,"
    },
    {
      "id": 52,
      "start": 809.280029296875,
      "end": 813.280029296875,
      "text": " met us, which brought her masters much gain by"
    },
    {
      "id": 53,
      "start": 813.280029296875,
      "end": 817.280029296875,
      "text": " soothsaying. The same followed Paul and us,"
    },
    {
      "id": 54,
      "start": 817.280029296875,
      "end": 821.280029296875,
      "text": " that's Luke writing, and cried, saying, These men are"
    },
    {
      "id": 55,
      "start": 821.280029296875,
      "end": 825.280029296875,
      "text": " the servants of the Most High God, which show unto us"
    },
    {
      "id": 56,
      "start": 825.280029296875,
      "end": 829.280029296875,
      "text": " the way of salvation. And this did she many days."
    },
    {
      "id": 57,
      "start": 829.280029296875,
      "end": 833.280029296875,
      "text": " But Paul, being grieved, turned and said"
    },
    {
      "id": 58,
      "start": 833.280029296875,
      "end": 837.280029296875,
      "text": " to the spirit, I command thee in the name of Jesus Christ"
    },
    {
      "id": 59,
      "start": 837.280029296875,
      "end": 841.280029296875,
      "text": " to come out of her. And he came out the same hour."
    },
    {
      "id": 60,
      "start": 841.280029296875,
      "end": 845.280029296875,
      "text": " Now, you say, preacher, why did Paul do that?"
    },
    {
      "id": 61,
      "start": 845.280029296875,
      "end": 849.280029296875,
      "text": " She was agreeing. She was saying, hey, these men"
    },
    {
      "id": 62,
      "start": 849.280029296875,
      "end": 853.280029296875,
      "text": " preach the true God. These men are preaching real salvation."
    },
    {
      "id": 63,
      "start": 853.280029296875,
      "end": 857.280029296875,
      "text": " Well, please understand that one of Satan's great"
    },
    {
      "id": 64,
      "start": 857.280029296875,
      "end": 861.280029296875,
      "text": " tactics is to appear to be what we are."
    },
    {
      "id": 65,
      "start": 861.280029296875,
      "end": 865.280029296875,
      "text": " All through my ministry, I would have"
    },
    {
      "id": 66,
      "start": 865.280029296875,
      "end": 869.280029296875,
      "text": " people, preachers and other people, come and say, they would begin"
    },
    {
      "id": 67,
      "start": 869.280029296875,
      "end": 873.280029296875,
      "text": " something like this, now preacher, we're just like you."
    },
    {
      "id": 68,
      "start": 873.280029296875,
      "end": 877.280029296875,
      "text": " And when you've got to tell me you're just like me,"
    },
    {
      "id": 69,
      "start": 877.280029296875,
      "end": 881.280029296875,
      "text": " you're probably not just like me, alright?"
    },
    {
      "id": 70,
      "start": 881.280029296875,
      "end": 885.280029296875,
      "text": " What this young lady was doing was subtly"
    },
    {
      "id": 71,
      "start": 885.280029296875,
      "end": 889.280029296875,
      "text": " building herself up as,"
    },
    {
      "id": 72,
      "start": 889.280029296875,
      "end": 893.280029296875,
      "text": " listen, these guys are here with my invitation."
    },
    {
      "id": 73,
      "start": 893.280029296875,
      "end": 897.280029296875,
      "text": " These guys are here with my approval."
    },
    {
      "id": 74,
      "start": 897.280029296875,
      "end": 901.280029296875,
      "text": " These guys are just like me. And the apostle Paul"
    },
    {
      "id": 75,
      "start": 901.280029296875,
      "end": 905.280029296875,
      "text": " knows that this is a demonic-filled young lady."
    },
    {
      "id": 76,
      "start": 905.280029296875,
      "end": 909.280029296875,
      "text": " He knows that this is not the true gospel."
    },
    {
      "id": 77,
      "start": 909.280029296875,
      "end": 913.280029296875,
      "text": " And he tries to be kind"
    },
    {
      "id": 78,
      "start": 913.280029296875,
      "end": 917.280029296875,
      "text": " and finally he understands, no, this is demon activity"
    },
    {
      "id": 79,
      "start": 917.280029296875,
      "end": 921.280029296875,
      "text": " and this young lady needs freed and this needs to be"
    },
    {
      "id": 80,
      "start": 921.280029296875,
      "end": 925.280029296875,
      "text": " stopped. And he casts that demon out of"
    },
    {
      "id": 81,
      "start": 925.280029296875,
      "end": 929.280029296875,
      "text": " that young lady by the power of God."
    },
    {
      "id": 82,
      "start": 929.280029296875,
      "end": 933.280029296875,
      "text": " Now again, notice in verse 19."
    },
    {
      "id": 83,
      "start": 933.280029296875,
      "end": 937.280029296875,
      "text": " And when her masters saw that the hope of their gains was gone,"
    },
    {
      "id": 84,
      "start": 937.280029296875,
      "end": 941.280029296875,
      "text": " they caught Paul and Silas, drew them into the"
    },
    {
      "id": 85,
      "start": 941.280029296875,
      "end": 945.280029296875,
      "text": " marketplace under the rulers, brought them to the magistrates"
    },
    {
      "id": 86,
      "start": 945.280029296875,
      "end": 949.280029296875,
      "text": " saying, these men being Jews,"
    },
    {
      "id": 87,
      "start": 949.280029296875,
      "end": 953.280029296875,
      "text": " you wonder why there wasn't a synagogue there? These men being"
    },
    {
      "id": 88,
      "start": 953.280029296875,
      "end": 957.280029296875,
      "text": " Jews do exceedingly trouble our city."
    },
    {
      "id": 89,
      "start": 957.280029296875,
      "end": 961.280029296875,
      "text": " They teach customs which are not lawful for us to receive, neither"
    },
    {
      "id": 90,
      "start": 961.280029296875,
      "end": 965.280029296875,
      "text": " to observe, being Romans. And the multitudes rose up"
    },
    {
      "id": 91,
      "start": 965.280029296875,
      "end": 969.280029296875,
      "text": " together against them. And the magistrates rent off their"
    },
    {
      "id": 92,
      "start": 969.280029296875,
      "end": 973.280029296875,
      "text": " clothes and commanded to beat them. Now for the sake of time"
    },
    {
      "id": 93,
      "start": 973.280029296875,
      "end": 977.280029296875,
      "text": " I'm not going to read all the rest of the verses. You're very familiar with them."
    },
    {
      "id": 94,
      "start": 977.280029296875,
      "end": 981.280029296875,
      "text": " They are unfairly arrested, unjustly arrested."
    },
    {
      "id": 95,
      "start": 981.280029296875,
      "end": 985.280029296875,
      "text": " They are handed to the jailer who"
    },
    {
      "id": 96,
      "start": 985.280029296875,
      "end": 989.280029296875,
      "text": " proceeds to beat them. And I mean when you"
    },
    {
      "id": 97,
      "start": 989.280029296875,
      "end": 993.280029296875,
      "text": " received a beating in those days, it was a beating. He takes them"
    },
    {
      "id": 98,
      "start": 993.280029296875,
      "end": 997.280029296875,
      "text": " after beating them mercilessly, not caring about their condition."
    },
    {
      "id": 99,
      "start": 997.280029296875,
      "end": 1001.280029296875,
      "text": " Takes them to the lowest part of his dungeon."
    },
    {
      "id": 100,
      "start": 1001.280029296875,
      "end": 1005.280029296875,
      "text": " Puts them in the stocks. Doesn't try to treat the"
    },
    {
      "id": 101,
      "start": 1005.280029296875,
      "end": 1009.280029296875,
      "text": " stripes on their back. And there in the bottom of his"
    },
    {
      "id": 102,
      "start": 1009.280029296875,
      "end": 1013.280029296875,
      "text": " jail comes midnight. And folks,"
    },
    {
      "id": 103,
      "start": 1013.280029296875,
      "end": 1017.280029296875,
      "text": " we can't pretty this up. They're in agony. They're in agony."
    },
    {
      "id": 104,
      "start": 1017.280029296875,
      "end": 1021.280029296875,
      "text": " I've got a little hangnail and if"
    },
    {
      "id": 105,
      "start": 1021.280029296875,
      "end": 1025.280029296875,
      "text": " I'm a preacher, I'm outwept today for the pain"
    },
    {
      "id": 106,
      "start": 1025.280029296875,
      "end": 1029.280029296875,
      "text": " in my finger. I had to actually put peroxide on it."
    },
    {
      "id": 107,
      "start": 1029.280029296875,
      "end": 1033.280029296875,
      "text": " Do you feel sorry for me? No,"
    },
    {
      "id": 108,
      "start": 1033.280029296875,
      "end": 1037.280029296875,
      "text": " I'm not trying to be silly, but I'm just trying to tell you these men are in agony."
    },
    {
      "id": 109,
      "start": 1037.280029296875,
      "end": 1041.280029296875,
      "text": " And you know what they do at midnight?"
    },
    {
      "id": 110,
      "start": 1041.280029296875,
      "end": 1045.280029296875,
      "text": " They don't curse the jailer."
    },
    {
      "id": 111,
      "start": 1045.280029296875,
      "end": 1049.280029296875,
      "text": " They don't shout to God how unfair they're being treated."
    },
    {
      "id": 112,
      "start": 1049.280029296875,
      "end": 1053.280029296875,
      "text": " They don't sing praises."
    },
    {
      "id": 113,
      "start": 1053.280029296875,
      "end": 1057.280029296875,
      "text": " And you remember what God did, don't you? You're in the bottom of the dungeon"
    },
    {
      "id": 114,
      "start": 1057.280029296875,
      "end": 1061.280029296875,
      "text": " and that's when God chooses to send an earthquake."
    },
    {
      "id": 115,
      "start": 1061.280029296875,
      "end": 1065.280029296875,
      "text": " I don't want an earthquake when I'm in the dungeon."
    },
    {
      "id": 116,
      "start": 1065.280029296875,
      "end": 1069.280029296875,
      "text": " But God sends an earthquake. They are set free. The other prisoners"
    },
    {
      "id": 117,
      "start": 1069.280029296875,
      "end": 1073.280029296875,
      "text": " are set free. And Paul encourages all to stay there."
    },
    {
      "id": 118,
      "start": 1073.280029296875,
      "end": 1077.280029296875,
      "text": " The jailer, you know what happens. He calls down"
    },
    {
      "id": 119,
      "start": 1077.280029296875,
      "end": 1081.280029296875,
      "text": " and he comes up with, what must I do to be saved? And Paul tells him"
    },
    {
      "id": 120,
      "start": 1081.280029296875,
      "end": 1085.280029296875,
      "text": " and he gets saved and all his family gets saved."
    },
    {
      "id": 121,
      "start": 1085.280029296875,
      "end": 1089.280029296875,
      "text": " And you know what we just saw? A very successful missions trip."
    },
    {
      "id": 122,
      "start": 1089.280029296875,
      "end": 1093.280029296875,
      "text": " Lydia is saved. Her family is saved."
    },
    {
      "id": 123,
      "start": 1093.280029296875,
      "end": 1097.280029296875,
      "text": " I like to believe this little girl got saved. She was so happy to be"
    },
    {
      "id": 124,
      "start": 1097.280029296875,
      "end": 1101.280029296875,
      "text": " free of that demon. I think she left the soothsayers and went over to Lydia's house."
    },
    {
      "id": 125,
      "start": 1101.280029296875,
      "end": 1105.280029296875,
      "text": " The jailer is saved and his family is saved."
    },
    {
      "id": 126,
      "start": 1105.280029296875,
      "end": 1109.280029296875,
      "text": " And Paul and Timothy and Titus and Luke are teaching this little church."
    },
    {
      "id": 127,
      "start": 1109.280029296875,
      "end": 1113.280029296875,
      "text": " And when they showed up, it was a demon"
    },
    {
      "id": 128,
      "start": 1113.280029296875,
      "end": 1117.280029296875,
      "text": " filled Roman colony. And when they left, there was a"
    },
    {
      "id": 129,
      "start": 1117.280029296875,
      "end": 1121.280029296875,
      "text": " church there. That's missions."
    },
    {
      "id": 130,
      "start": 1121.280029296875,
      "end": 1125.280029296875,
      "text": " Now, what I want to do is I want you to turn with me over to"
    },
    {
      "id": 131,
      "start": 1125.280029296875,
      "end": 1129.280029296875,
      "text": " Philippians chapter 4 and understand that as we"
    },
    {
      "id": 132,
      "start": 1129.280029296875,
      "end": 1133.280029296875,
      "text": " turn our pages to Philippians chapter 4"
    },
    {
      "id": 133,
      "start": 1133.280029296875,
      "end": 1137.280029296875,
      "text": " 10 years have passed. And now the Apostle"
    },
    {
      "id": 134,
      "start": 1137.280029296875,
      "end": 1141.280029296875,
      "text": " Paul is not in Philippi. He's sitting in the city"
    },
    {
      "id": 135,
      "start": 1141.280029296875,
      "end": 1145.280029296875,
      "text": " of Ephesus. And from the city of Ephesus"
    },
    {
      "id": 136,
      "start": 1145.280029296875,
      "end": 1149.280029296875,
      "text": " he wants to write back to that group of"
    },
    {
      "id": 137,
      "start": 1149.280029296875,
      "end": 1153.280029296875,
      "text": " people, that church which no doubt has grown and their"
    },
    {
      "id": 138,
      "start": 1153.280029296875,
      "end": 1157.280029296875,
      "text": " influence has grown and their ministry has grown. And Paul"
    },
    {
      "id": 139,
      "start": 1157.280029296875,
      "end": 1161.280029296875,
      "text": " thinks of them often and is thankful for every time"
    },
    {
      "id": 140,
      "start": 1161.280029296875,
      "end": 1165.280029296875,
      "text": " he thinks of them and is grateful for the part that they now play"
    },
    {
      "id": 141,
      "start": 1165.280029296875,
      "end": 1169.280029296875,
      "text": " in his life. And he's writing this letter from Ephesus back"
    },
    {
      "id": 142,
      "start": 1169.280029296875,
      "end": 1173.280029296875,
      "text": " to this church at Philippi that was started in"
    },
    {
      "id": 143,
      "start": 1173.280029296875,
      "end": 1177.280029296875,
      "text": " such a difficult season. Notice it with"
    },
    {
      "id": 144,
      "start": 1177.280029296875,
      "end": 1181.280029296875,
      "text": " me starting in verse 10, chapter 4 verse 10."
    },
    {
      "id": 145,
      "start": 1181.280029296875,
      "end": 1185.280029296875,
      "text": " But I rejoiced in the Lord greatly"
    },
    {
      "id": 146,
      "start": 1185.280029296875,
      "end": 1189.280029296875,
      "text": " that now at the last your care of me hath flourished again"
    },
    {
      "id": 147,
      "start": 1189.280029296875,
      "end": 1193.280029296875,
      "text": " wherein you were all so careful but you lacked"
    },
    {
      "id": 148,
      "start": 1193.280029296875,
      "end": 1197.280029296875,
      "text": " opportunity. Not that I speak in respect of want for I have"
    },
    {
      "id": 149,
      "start": 1197.280029296875,
      "end": 1201.280029296875,
      "text": " learned. In whatsoever state I am therewith"
    },
    {
      "id": 0,
      "start": 1201.280029296875,
      "end": 1207.4800291061401,
      "text": " with to be content. I know both how to be abased and I know how to abound everywhere. And in all"
    },
    {
      "id": 1,
      "start": 1207.4800291061401,
      "end": 1215.0800294876099,
      "text": " things I am instructed both to be full and to be hungry, both to abound and to suffer need. I can"
    },
    {
      "id": 2,
      "start": 1215.0800294876099,
      "end": 1221.200029373169,
      "text": " do all things through Christ which strengtheneth me.\" Boy, don't ever take that verse lightly."
    },
    {
      "id": 3,
      "start": 1221.200029373169,
      "end": 1227.7200298309326,
      "text": " You know what that means? That means when your back is bleeding and hurting, you can sing praises."
    },
    {
      "id": 4,
      "start": 1227.7200298309326,
      "end": 1235.1600303649902,
      "text": " That means when you're taken outside the city of Lystra and stoned and left for dead, you can get"
    },
    {
      "id": 5,
      "start": 1235.1600303649902,
      "end": 1241.8000297546387,
      "text": " up, shake off the dust and not be done with preaching, be committed to preaching. It means"
    },
    {
      "id": 6,
      "start": 1241.8000297546387,
      "end": 1248.2000274658203,
      "text": " you can go into Jerusalem and be smitten by the high priest and hated by them and sent to Rome,"
    },
    {
      "id": 7,
      "start": 1248.2000274658203,
      "end": 1255.2000274658203,
      "text": " and there put in prison, and then put in that filthy mammertine, the rat's nest, and know that"
    },
    {
      "id": 8,
      "start": 1255.880027770996,
      "end": 1262.6000289916992,
      "text": " the Colosseum is next to you and you hear the screams of the crowd as the Christians are martyred"
    },
    {
      "id": 9,
      "start": 1262.6000289916992,
      "end": 1269.0000305175781,
      "text": " in front of them. Up above you is the Roman circus and you know that in that place they're putting"
    },
    {
      "id": 10,
      "start": 1269.0000305175781,
      "end": 1275.5600280761719,
      "text": " the Christians on the track and running over them with chariots and with horses, and then you can"
    },
    {
      "id": 11,
      "start": 1275.5600280761719,
      "end": 1283.160026550293,
      "text": " say, I'm ready to be offered. Take me to the Colosseum. Take me to the circus because I can"
    },
    {
      "id": 12,
      "start": 1283.160026550293,
      "end": 1291.7200317382812,
      "text": " do all things through Christ which strengtheneth me. Sometimes we cheapen that verse. It is not a"
    },
    {
      "id": 13,
      "start": 1291.7200317382812,
      "end": 1301.1200256347656,
      "text": " cheap verse. Not when you understand the man who uttered it. He says, notwithstanding ye have well"
    },
    {
      "id": 14,
      "start": 1301.1200256347656,
      "end": 1307.3600311279297,
      "text": " done that ye did communicate with my affliction. Now ye Philippians know also that in the beginning"
    },
    {
      "id": 15,
      "start": 1307.3600311279297,
      "end": 1313.880027770996,
      "text": " of the gospel, when I departed from Macedonia, no church communicated with me as concerning giving"
    },
    {
      "id": 16,
      "start": 1313.880027770996,
      "end": 1322.2000274658203,
      "text": " and receiving, but ye only. For even in Thessalonica ye sent once and again unto my necessity, not"
    },
    {
      "id": 17,
      "start": 1322.2000274658203,
      "end": 1332.3600311279297,
      "text": " because I desire a gift, but I desire fruit that may abound to your account. But I have all and"
    },
    {
      "id": 18,
      "start": 1332.3600311279297,
      "end": 1340.4800262451172,
      "text": " abound. I am full, having received of Epaphroditus the things which were sent from you, an odor of a"
    },
    {
      "id": 19,
      "start": 1340.4800262451172,
      "end": 1350.6000366210938,
      "text": " sweet smell, a sacrifice acceptable, well-pleasing to God. Oh, but my God shall supply all your need"
    },
    {
      "id": 20,
      "start": 1350.6000366210938,
      "end": 1363.8400268554688,
      "text": " according to his riches in glory by Christ Jesus. What a holy passage. Let me very quickly show you"
    },
    {
      "id": 21,
      "start": 1363.8400268554688,
      "end": 1369.2400360107422,
      "text": " missions from the perspective of the missionary, missions from the perspective of the church,"
    },
    {
      "id": 22,
      "start": 1369.2400360107422,
      "end": 1376.8400268554688,
      "text": " and missions from the perspective of the Lord. The role of the missionary in missions. I want"
    },
    {
      "id": 23,
      "start": 1376.8400268554688,
      "end": 1385.3600311279297,
      "text": " you to notice that ultimately the responsibility of a missionary is to know that the Lord is the"
    },
    {
      "id": 24,
      "start": 1385.3600311279297,
      "end": 1391.760025024414,
      "text": " source of everything he needs. There's an important statement that's made in verse 11. Would you see"
    },
    {
      "id": 25,
      "start": 1391.760025024414,
      "end": 1401.5600280761719,
      "text": " it? He says, for I have learned. The life of a missionary, if you study the Apostle Paul's life"
    },
    {
      "id": 26,
      "start": 1401.7200317382812,
      "end": 1411.1200256347656,
      "text": " and others, is not an easy one. It's an exciting life, it's a rewarding life, but it is not an easy"
    },
    {
      "id": 27,
      "start": 1411.1200256347656,
      "end": 1417.6400299072266,
      "text": " life. Consider modern-day missionaries, the challenges they face. Most missionaries, I see"
    },
    {
      "id": 28,
      "start": 1417.6400299072266,
      "end": 1424.6000366210938,
      "text": " the Alvarez's and they travel with two beautiful little girls. And those little girls are on duty"
    },
    {
      "id": 29,
      "start": 1424.6000366210938,
      "end": 1431.7200317382812,
      "text": " probably five nights a week in a church. And they better not run the aisle, and they better be"
    },
    {
      "id": 30,
      "start": 1431.7200317382812,
      "end": 1438.6800231933594,
      "text": " perfect in their behavior because the preacher and the deacons are watching. Pastor, that little girl"
    },
    {
      "id": 31,
      "start": 1438.6800231933594,
      "end": 1447.7200317382812,
      "text": " cried. I don't think they'll make it on the field. I'm telling you, it's not easy to pack your family"
    },
    {
      "id": 32,
      "start": 1447.7200317382812,
      "end": 1457.3200378417969,
      "text": " up and travel for two years, thousands upon thousands of miles, staying in places you don't"
    },
    {
      "id": 33,
      "start": 1457.3200378417969,
      "end": 1461.8000183105469,
      "text": " know where you're going to stay, you don't know who you're going to be staying with. Your children"
    },
    {
      "id": 34,
      "start": 1461.8000183105469,
      "end": 1469.2400207519531,
      "text": " are children, and you're human beings too. I guess there's an exciting side to it, but quite"
    },
    {
      "id": 35,
      "start": 1469.2400207519531,
      "end": 1476.1200256347656,
      "text": " frankly I'm glad for them to do it and not me. You're moving to a foreign country. You say, well"
    },
    {
      "id": 36,
      "start": 1476.1200256347656,
      "end": 1483.8000183105469,
      "text": " that's exciting. Yeah, you're not vacationing in a foreign country, you're moving to a foreign"
    },
    {
      "id": 37,
      "start": 1483.8000183105469,
      "end": 1490.280029296875,
      "text": " country. You're going to learn everything new. You're going to learn a new language. Honestly,"
    },
    {
      "id": 38,
      "start": 1490.280029296875,
      "end": 1499.0000305175781,
      "text": " I am not trying to be humorous here. That's beyond me. I don't have enough think power to remember"
    },
    {
      "id": 39,
      "start": 1499.1600341796875,
      "end": 1506.280029296875,
      "text": " English, much less to learn a new language. And listen, not just learn a new language,"
    },
    {
      "id": 40,
      "start": 1506.8400268554688,
      "end": 1514.6000366210938,
      "text": " communicate eternal truth to a soul in that language. Come on, it's not just I want those"
    },
    {
      "id": 41,
      "start": 1515.3200378417969,
      "end": 1524.4400329589844,
      "text": " roles. It's without Christ you're going to hell, and it's an eternal difference in a person's life."
    },
    {
      "id": 42,
      "start": 1524.4400329589844,
      "end": 1532.6000366210938,
      "text": " It is no light thing. They learn that language. They learn a new culture. They're dependent on"
    },
    {
      "id": 43,
      "start": 1532.6000366210938,
      "end": 1539.2400207519531,
      "text": " exchange rates, churches dropping them. They answer to a hundred bosses with a hundred different"
    },
    {
      "id": 44,
      "start": 1539.2400207519531,
      "end": 1544.0400390625,
      "text": " perspectives. You say, what do you mean preacher? They got a hundred supporting pastors, and we're"
    },
    {
      "id": 45,
      "start": 1544.0400390625,
      "end": 1548.7600402832031,
      "text": " Baptists, and every one of those Baptist pastors sees something a little bit different than the"
    },
    {
      "id": 46,
      "start": 1548.7600402832031,
      "end": 1555.9600219726562,
      "text": " other Baptist pastor, and they answer to all of them. You say, are you feeling sorry for missionaries?"
    },
    {
      "id": 47,
      "start": 1555.9600219726562,
      "end": 1562.6000366210938,
      "text": " No, I don't feel sorry for them. I'm just trying to be realistic that when we talk about missionaries,"
    },
    {
      "id": 48,
      "start": 1562.6000366210938,
      "end": 1572.0400390625,
      "text": " it's not an easy thing to do. Through all that Paul says, I've learned. He learned to be content"
    },
    {
      "id": 49,
      "start": 1572.6000366210938,
      "end": 1579.4800415039062,
      "text": " even when circumstances were difficult, even when churches disappointed him, even when nationals"
    },
    {
      "id": 50,
      "start": 1579.4800415039062,
      "end": 1586.1200256347656,
      "text": " tried to kill him, because the ultimate source of his supply and the ultimate source of the help for"
    },
    {
      "id": 51,
      "start": 1586.1200256347656,
      "end": 1593.3200378417969,
      "text": " his life was not another missionary, not another person, not just a local church. It was God."
    },
    {
      "id": 52,
      "start": 1594.280029296875,
      "end": 1603.4800415039062,
      "text": " God had called them, and that's why Paul says, I can do all things through my supporting churches."
    },
    {
      "id": 53,
      "start": 1603.4800415039062,
      "end": 1612.8400268554688,
      "text": " No, I can do all things through the team I work with here on the field. No, men will fail you,"
    },
    {
      "id": 54,
      "start": 1612.8400268554688,
      "end": 1622.1200256347656,
      "text": " but I can do what God has called me to do through Jesus Christ. Man, that's what Paul says. I've"
    },
    {
      "id": 55,
      "start": 1622.1200256347656,
      "end": 1629.5600280761719,
      "text": " learned that. I've learned that your dependency missionary better be on the Lord. But now,"
    },
    {
      "id": 56,
      "start": 1629.5600280761719,
      "end": 1637.9600219726562,
      "text": " wait a minute. Then he says this in verse 14, notwithstanding. Hey, I've learned how to be"
    },
    {
      "id": 57,
      "start": 1637.9600219726562,
      "end": 1643.8000183105469,
      "text": " content. I've learned how to trust only the Lord, but now look what he says. Notwithstanding,"
    },
    {
      "id": 58,
      "start": 1644.6000366210938,
      "end": 1654.7600402832031,
      "text": " ye have well done, that ye did communicate with my affliction. Hey, God uses churches to do"
    },
    {
      "id": 59,
      "start": 1655.4000244140625,
      "end": 1664.1200256347656,
      "text": " his providing work. And Paul is expressing gratitude for the care of the church at Philippi."
    },
    {
      "id": 60,
      "start": 1664.1200256347656,
      "end": 1670.9200439453125,
      "text": " What a wonderful partnership when God uses a church to be a blessing to a missionary. Notice"
    },
    {
      "id": 61,
      "start": 1670.9200439453125,
      "end": 1679.0000305175781,
      "text": " with me how the church has a role in these missions outreaches. Number one, this great"
    },
    {
      "id": 62,
      "start": 1679.0000305175781,
      "end": 1688.280029296875,
      "text": " church at Philippi understood they had a debt they owed. Notice with me in verse 15. Now,"
    },
    {
      "id": 63,
      "start": 1688.280029296875,
      "end": 1697.2400207519531,
      "text": " ye Philippians know also that in the beginning of the gospel, what is Paul referring to there?"
    },
    {
      "id": 64,
      "start": 1697.9600219726562,
      "end": 1704.4400329589844,
      "text": " Is Paul taking them back to the birth of Christ at Bethlehem? No. Is Paul taking them back to the"
    },
    {
      "id": 65,
      "start": 1704.4400329589844,
      "end": 1710.6000366210938,
      "text": " cross at Calvary? No. You know what Paul is taking them back to? Paul is saying now in the beginning"
    },
    {
      "id": 66,
      "start": 1710.6000366210938,
      "end": 1717.0,
      "text": " of the gospel, hey, church at Philippi, do you remember when I showed up at that riverside"
    },
    {
      "id": 67,
      "start": 1718.3600463867188,
      "end": 1723.4000244140625,
      "text": " and you had never heard of Jesus? And you didn't know there was a heaven?"
    },
    {
      "id": 68,
      "start": 1724.280029296875,
      "end": 1730.0400390625,
      "text": " And you didn't know there was a resurrection? And you didn't know there was one true God?"
    },
    {
      "id": 69,
      "start": 1730.0400390625,
      "end": 1736.6800537109375,
      "text": " Remember in the beginning of the gospel when we stood at that riverside and told you the truth,"
    },
    {
      "id": 70,
      "start": 1736.6800537109375,
      "end": 1743.56005859375,
      "text": " and Lydia, you got saved and your household got saved? Hey, jailer. Hey, tough guy. Hey, listen,"
    },
    {
      "id": 71,
      "start": 1743.56005859375,
      "end": 1749.7200317382812,
      "text": " do you remember when you were ready to put a sword in your own stomach because you thought"
    },
    {
      "id": 72,
      "start": 1749.800048828125,
      "end": 1753.4000244140625,
      "text": " the prisoners were gone? You remember we told you about Christ?"
    },
    {
      "id": 73,
      "start": 1755.4800415039062,
      "end": 1757.9600219726562,
      "text": " Can I share this with you tonight?"
    },
    {
      "id": 74,
      "start": 1760.4400024414062,
      "end": 1770.8400268554688,
      "text": " One of the essential things for every one of our lives is this. Remember where God got you."
    },
    {
      "id": 75,
      "start": 1771.6400146484375,
      "end": 1780.0400390625,
      "text": " I've been preaching for 47 years. I am a good man. No, I'm not."
    },
    {
      "id": 76,
      "start": 1782.0400390625,
      "end": 1790.760009765625,
      "text": " No, I'm not. I'm a sinner saved by grace. And sometimes we've been around church so long that"
    },
    {
      "id": 77,
      "start": 1790.760009765625,
      "end": 1798.2000122070312,
      "text": " we kind of think of ourselves as maybe a little better than them out there. But for the grace of"
    },
    {
      "id": 78,
      "start": 1798.2000122070312,
      "end": 1800.4400024414062,
      "text": " God, we are out."
    },
    {
      "id": 0,
      "start": 1800.4400024414062,
      "end": 1807.9600024223328,
      "text": " there, and when God found me and got me, God didn't reach up to a high shelf and"
    },
    {
      "id": 1,
      "start": 1807.9600024223328,
      "end": 1814.7600021362305,
      "text": " find Mike Edwards. Hey, there's a worthy find. God found me in a miry pit where He"
    },
    {
      "id": 2,
      "start": 1814.7600021362305,
      "end": 1820.6000022888184,
      "text": " found you, and He drug us out of that miry pit, and cleaned us up, and saved us,"
    },
    {
      "id": 3,
      "start": 1820.6000022888184,
      "end": 1830.200002670288,
      "text": " and we are tonight what we are by the grace of God. Get over yourself. We are"
    },
    {
      "id": 4,
      "start": 1830.200002670288,
      "end": 1838.6000022888184,
      "text": " sinners, saved by God's grace, and what Paul is saying is, listen, do you remember"
    },
    {
      "id": 5,
      "start": 1838.6000022888184,
      "end": 1844.8800010681152,
      "text": " what you were? Do you remember where you were when God found you? And listen, that"
    },
    {
      "id": 6,
      "start": 1844.8800010681152,
      "end": 1854.1600036621094,
      "text": " is motivation to say this, if God can save me, God can save them. God can save"
    },
    {
      "id": 7,
      "start": 1854.1600036621094,
      "end": 1862.8800010681152,
      "text": " that guy with 15 holes in his ear and a big widening. God can save that guy who"
    },
    {
      "id": 8,
      "start": 1862.8800010681152,
      "end": 1868.7600021362305,
      "text": " puts a needle in his arm. God can save that guy who's left his family"
    },
    {
      "id": 9,
      "start": 1868.7600021362305,
      "end": 1873.7600021362305,
      "text": " and deserted his children. I'm just telling you, God can save them, and God"
    },
    {
      "id": 10,
      "start": 1873.7600021362305,
      "end": 1880.0,
      "text": " help us to get over our sanctified selves. And remember that we've got a"
    },
    {
      "id": 11,
      "start": 1880.0,
      "end": 1886.6800003051758,
      "text": " debt, a debt that we owe, and they had a plan to pay that debt. Look in verse 14"
    },
    {
      "id": 12,
      "start": 1886.6800003051758,
      "end": 1892.240005493164,
      "text": " again. You have well done that you did communicate with me. I love that word"
    },
    {
      "id": 13,
      "start": 1892.240005493164,
      "end": 1897.7600021362305,
      "text": " communicate. In the Greek it's the word koinonia. We hear that word often. It just"
    },
    {
      "id": 14,
      "start": 1897.7600021362305,
      "end": 1903.3600006103516,
      "text": " simply means to share. It means they took what they had, and they shared it with"
    },
    {
      "id": 15,
      "start": 1903.3600006103516,
      "end": 1908.520004272461,
      "text": " others. And what a wonderful picture of how the physical can be used to"
    },
    {
      "id": 16,
      "start": 1908.520004272461,
      "end": 1917.8400039672852,
      "text": " accomplish the spiritual. These people gave. Now understand this, right now in"
    },
    {
      "id": 17,
      "start": 1917.8400039672852,
      "end": 1926.8400039672852,
      "text": " Macedonia things are not going well. The economy is not good, if you will. These"
    },
    {
      "id": 18,
      "start": 1926.8400039672852,
      "end": 1933.1199951171875,
      "text": " folks are suffering much affliction, yet even in the midst of that affliction, you"
    },
    {
      "id": 19,
      "start": 1933.1199951171875,
      "end": 1937.2799987792969,
      "text": " know what they said? We've got to send to Paul, because there are people that need"
    },
    {
      "id": 20,
      "start": 1937.2799987792969,
      "end": 1942.1600036621094,
      "text": " to hear the gospel, and we need to help him reach those people. And in the"
    },
    {
      "id": 21,
      "start": 1942.1600036621094,
      "end": 1947.1199951171875,
      "text": " midst of their affliction, they gave of themselves, and they gave what they had,"
    },
    {
      "id": 22,
      "start": 1947.1199951171875,
      "end": 1956.0800018310547,
      "text": " because they knew they owed a debt. Quickly, I want you to notice how the"
    },
    {
      "id": 23,
      "start": 1956.0800018310547,
      "end": 1965.1600036621094,
      "text": " Lord viewed that. Look again at verse 17. Not because I desire a gift. Can I dispel"
    },
    {
      "id": 24,
      "start": 1965.1600036621094,
      "end": 1970.1999969482422,
      "text": " a notion if it's in this room? You know one of the hardest things for Gary"
    },
    {
      "id": 25,
      "start": 1970.1999969482422,
      "end": 1978.8399963378906,
      "text": " Sadarsky to do? Come to a church and ask for support. Anybody want that job?"
    },
    {
      "id": 26,
      "start": 1978.8399963378906,
      "end": 1983.520004272461,
      "text": " Anybody want that job where you go from church to church to church, because God"
    },
    {
      "id": 27,
      "start": 1983.520004272461,
      "end": 1988.6399993896484,
      "text": " has laid a call and a burden on your life, and you go and you say to the"
    },
    {
      "id": 28,
      "start": 1988.6399993896484,
      "end": 1992.3600006103516,
      "text": " pastor, you try to get a meeting at the church, and you say to the church, will"
    },
    {
      "id": 29,
      "start": 1992.3600006103516,
      "end": 1996.2799987792969,
      "text": " you please help us? And you always say, will you pray for us? Because that is"
    },
    {
      "id": 30,
      "start": 1996.2799987792969,
      "end": 2003.7200012207031,
      "text": " valid, but you also know that you need dollars to get to that place. I don't"
    },
    {
      "id": 31,
      "start": 2003.7200012207031,
      "end": 2011.6000061035156,
      "text": " want that job. And yet that's the calling on their life. And Paul says, man, I'm not"
    },
    {
      "id": 32,
      "start": 2011.6000061035156,
      "end": 2017.3600006103516,
      "text": " coming to you by letter or person, because I desire a gift. I'm not a"
    },
    {
      "id": 33,
      "start": 2017.3600006103516,
      "end": 2023.6000061035156,
      "text": " moochinary. I'm not trying to enrich myself on going to the field. By the way,"
    },
    {
      "id": 34,
      "start": 2023.6000061035156,
      "end": 2030.3600006103516,
      "text": " I have never met a rich missionary. I've met missionaries who are barely getting"
    },
    {
      "id": 35,
      "start": 2030.3600006103516,
      "end": 2035.6800079345703,
      "text": " by. I've met missionaries who are begging God to provide the need. I've never met a"
    },
    {
      "id": 36,
      "start": 2035.6800079345703,
      "end": 2040.9600067138672,
      "text": " rich one, and Paul says, I'm not coming because I desire your money,"
    },
    {
      "id": 37,
      "start": 2040.9600067138672,
      "end": 2050.760009765625,
      "text": " a desire, a gift. I need it, but I'm not trying to enrich myself. I'm coming"
    },
    {
      "id": 38,
      "start": 2050.760009765625,
      "end": 2057.6799926757812,
      "text": " because I want me and you to bear fruit. Look what he says. Not because I desire a"
    },
    {
      "id": 39,
      "start": 2057.6799926757812,
      "end": 2068.0800170898438,
      "text": " gift, verse 17, but I desire fruit that may abound to your account. I absolutely"
    },
    {
      "id": 40,
      "start": 2068.0800170898438,
      "end": 2073.1199951171875,
      "text": " love that verse, preacher. I don't want to dramatize this too much. I don't want"
    },
    {
      "id": 41,
      "start": 2073.1199951171875,
      "end": 2078.6400146484375,
      "text": " to go overboard, but I'm telling you, heaven is going to be an incredible"
    },
    {
      "id": 42,
      "start": 2078.6400146484375,
      "end": 2087.519989013672,
      "text": " place. And there from every tribe and every tongue and every color of people,"
    },
    {
      "id": 43,
      "start": 2087.519989013672,
      "end": 2094.0800170898438,
      "text": " every race, we are going to stand around the throne of God and kind of compete"
    },
    {
      "id": 44,
      "start": 2094.0800170898438,
      "end": 2098.720001220703,
      "text": " with each other to see who can throw their crown quickest to the Lord, who is"
    },
    {
      "id": 45,
      "start": 2098.720001220703,
      "end": 2102.8399963378906,
      "text": " deserving. And we are going to sing praises to Him. I think there'll be one"
    },
    {
      "id": 46,
      "start": 2102.8399963378906,
      "end": 2111.5599975585938,
      "text": " language in heaven. But I'm fully expecting someday for somebody to come"
    },
    {
      "id": 47,
      "start": 2111.5599975585938,
      "end": 2116.3999938964844,
      "text": " up to me and say, now I know we've got perfect knowledge, but this is my"
    },
    {
      "id": 48,
      "start": 2116.3999938964844,
      "end": 2121.519989013672,
      "text": " illustration, so stay out of it. Somebody coming up to me and say, I want you to"
    },
    {
      "id": 49,
      "start": 2121.519989013672,
      "end": 2129.480010986328,
      "text": " know, I appreciate the gift that you made that allowed the Sadarskis to come"
    },
    {
      "id": 50,
      "start": 2129.480010986328,
      "end": 2136.1199951171875,
      "text": " to Poland, that allowed Brother and Mrs. Alvarez to come to Mexico, Monterey, a"
    },
    {
      "id": 51,
      "start": 2136.1199951171875,
      "end": 2143.3600158691406,
      "text": " difficult place. Because when Brother Alvarez preached, when Mrs. Alvarez taught"
    },
    {
      "id": 52,
      "start": 2143.3600158691406,
      "end": 2151.279998779297,
      "text": " that Sunday school lesson, I was a little girl and I got saved. You think sacrifice"
    },
    {
      "id": 53,
      "start": 2151.279998779297,
      "end": 2157.720001220703,
      "text": " will be worth it that day? Fruit that abounds. Listen, he goes on and he says"
    },
    {
      "id": 54,
      "start": 2157.720001220703,
      "end": 2163.6400146484375,
      "text": " this, but I have all and abound. I am full, having received of Epaphroditus the"
    },
    {
      "id": 55,
      "start": 2163.6400146484375,
      "end": 2169.5599975585938,
      "text": " things which were sent from you, an odor of a sweet smell, a sacrifice acceptable,"
    },
    {
      "id": 56,
      "start": 2169.5599975585938,
      "end": 2176.1199951171875,
      "text": " well-pleasing to God. Hey, listen, they were not a rich church. And there were"
    },
    {
      "id": 57,
      "start": 2176.1199951171875,
      "end": 2182.1600036621094,
      "text": " times of affliction, but they dug into their pockets because they knew they had"
    },
    {
      "id": 58,
      "start": 2182.1600036621094,
      "end": 2186.959991455078,
      "text": " a debt that there were others who needed Christ like they needed Christ, had"
    },
    {
      "id": 59,
      "start": 2186.959991455078,
      "end": 2192.1600036621094,
      "text": " needed Him, and now had Him. And so they gave, and Paul says, let me tell you"
    },
    {
      "id": 60,
      "start": 2192.1600036621094,
      "end": 2197.3999938964844,
      "text": " how the Lord views that gift. And again, you forgive me for being a little"
    },
    {
      "id": 61,
      "start": 2197.3999938964844,
      "end": 2203.480010986328,
      "text": " dramatic. On Sundays we pass the offering plate, or at least give you the"
    },
    {
      "id": 62,
      "start": 2203.480010986328,
      "end": 2209.720001220703,
      "text": " opportunity to put something in the offering plate. Somewhere, sometime, some"
    },
    {
      "id": 63,
      "start": 2209.720001220703,
      "end": 2215.1600036621094,
      "text": " Sunday, you've had a little struggle because you wanted to give something to"
    },
    {
      "id": 64,
      "start": 2215.1600036621094,
      "end": 2219.720001220703,
      "text": " missions, but you also knew that you could have allocated that money this way."
    },
    {
      "id": 65,
      "start": 2219.720001220703,
      "end": 2225.0800170898438,
      "text": " You could have prioritized that money this way, but it's just on your heart to"
    },
    {
      "id": 66,
      "start": 2225.0800170898438,
      "end": 2232.1600036621094,
      "text": " give to the missions program at church. And maybe with a little shaking hand, you"
    },
    {
      "id": 67,
      "start": 2232.1600036621094,
      "end": 2237.3200073242188,
      "text": " put that out, and it drops in the plate, and you know that you can't do the other"
    },
    {
      "id": 68,
      "start": 2237.3200073242188,
      "end": 2242.0,
      "text": " thing you wanted to do, but you just made a sacrifice and gave it to the Lord."
    },
    {
      "id": 69,
      "start": 2242.0,
      "end": 2251.2000122070312,
      "text": " And beyond our vision, beyond our understanding, I think something is true."
    },
    {
      "id": 70,
      "start": 2251.2000122070312,
      "end": 2259.760009765625,
      "text": " That from that little offering plate and from your pew, something rises. You say,"
    },
    {
      "id": 71,
      "start": 2259.760009765625,
      "end": 2268.8399963378906,
      "text": " what is it? It's an odor. An odor of what? An odor that is pleasing to God. An odor"
    },
    {
      "id": 72,
      "start": 2268.8399963378906,
      "end": 2276.1199951171875,
      "text": " that sees you saying, I can do without that. I'd rather meet this need. I'd"
    },
    {
      "id": 73,
      "start": 2276.1199951171875,
      "end": 2282.1600036621094,
      "text": " rather this missionary have his need met. And as that ascends to the Lord, it is"
    },
    {
      "id": 74,
      "start": 2282.1600036621094,
      "end": 2290.2000122070312,
      "text": " pleasing to the Lord. I don't smell it. I don't see it. I understand it."
    },
    {
      "id": 75,
      "start": 2290.2000122070312,
      "end": 2295.8399963378906,
      "text": " Thanksgiving time, it's a big season at our house, and Christmas. It's actually"
    },
    {
      "id": 76,
      "start": 2295.8399963378906,
      "end": 2301.480010986328,
      "text": " Christmas when my wife does this. She makes cinnamon rolls, homemade cinnamon"
    },
    {
      "id": 77,
      "start": 2301.480010986328,
      "end": 2309.3200073242188,
      "text": " rolls. You ever had one? You ever had 30? She makes those cinnamon rolls, and"
    },
    {
      "id": 78,
      "start": 2309.480010986328,
      "end": 2313.8800048828125,
      "text": " usually I'm in another room in the house, and she bakes for like seven days in a"
    },
    {
      "id": 79,
      "start": 2313.8800048828125,
      "end": 2319.0,
      "text": " row. I think it's a religious experience, but she bakes and bakes and bakes. And"
    },
    {
      "id": 80,
      "start": 2319.0,
      "end": 2324.7999877929688,
      "text": " when that oven door first opens up, you know what happens. Those cinnamon rolls"
    },
    {
      "id": 81,
      "start": 2324.7999877929688,
      "end": 2332.9600219726562,
      "text": " and that odor fills the house. And I'm back in the other room, and I go, that's"
    },
    {
      "id": 82,
      "start": 2332.9600219726562,
      "end": 2339.239990234375,
      "text": " pleasing to me. That's an acceptable offering to me. I don't mean to be silly,"
    },
    {
      "id": 83,
      "start": 2339.239990234375,
      "end": 2349.8400268554688,
      "text": " but that's the Lord. The Lord loves our willingness to sacrifice. And by the way,"
    },
    {
      "id": 84,
      "start": 2349.8400268554688,
      "end": 2355.9199829101562,
      "text": " when the Lord smells that, you say, well, I'll have to do without. Yeah, maybe. God"
    },
    {
      "id": 85,
      "start": 2355.9199829101562,
      "end": 2362.4400024414062,
      "text": " will give you grace if you do. But can I remind you of the next verse? But my God"
    },
    {
      "id": 86,
      "start": 2362.4400024414062,
      "end": 2372.2000122070312,
      "text": " shall supply all your need according to his riches in glory by Christ Jesus. We"
    },
    {
      "id": 87,
      "start": 2372.2000122070312,
      "end": 2377.1199951171875,
      "text": " read that verse, and we use that verse. Oh, it's on a lot of plaques, and"
    },
    {
      "id": 88,
      "start": 2377.1199951171875,
      "end": 2382.3599853515625,
      "text": " on a lot of cross-stitch, and so on. And it is, in general, true about giving."
    },
    {
      "id": 89,
      "start": 2382.3599853515625,
      "end": 2388.239990234375,
      "text": " But I want you to understand this, that that verse is actually in context of"
    },
    {
      "id": 90,
      "start": 2388.239990234375,
      "end": 2395.9600219726562,
      "text": " missions giving. The actual context is Paul saying back to these poor Philippians,"
    },
    {
      "id": 91,
      "start": 2395.9600219726562,
      "end": 2401.5999755859375,
      "text": " you have done well. You have shared."
    },
    {
      "id": 0,
      "start": 2401.5999755859375,
      "end": 2405.959975719452,
      "text": " even when you were short, even when you had needs,"
    },
    {
      "id": 1,
      "start": 2405.959975719452,
      "end": 2410.079975128174,
      "text": " but you remembered the change in your life from the gospel,"
    },
    {
      "id": 2,
      "start": 2410.079975128174,
      "end": 2412.8399753570557,
      "text": " and you understood that others needed that,"
    },
    {
      "id": 3,
      "start": 2412.8399753570557,
      "end": 2415.3199758529663,
      "text": " and you took from the little you had,"
    },
    {
      "id": 4,
      "start": 2415.3199758529663,
      "end": 2418.399974822998,
      "text": " and you said, I can do this later, I'll put this off."
    },
    {
      "id": 5,
      "start": 2418.399974822998,
      "end": 2421.959976196289,
      "text": " The real priority are the souls of men,"
    },
    {
      "id": 6,
      "start": 2421.959976196289,
      "end": 2425.7599754333496,
      "text": " and Paul reached souls, and oh goodness,"
    },
    {
      "id": 7,
      "start": 2425.7599754333496,
      "end": 2429.079975128174,
      "text": " the ones he reaches will abound to our account,"
    },
    {
      "id": 8,
      "start": 2429.079975128174,
      "end": 2434.079975128174,
      "text": " and God is pleased, that's missions, that's missions."
    },
    {
      "id": 9,
      "start": 2435.9999771118164,
      "end": 2438.079975128174,
      "text": " You wonder why we have revival in our churches"
    },
    {
      "id": 10,
      "start": 2438.079975128174,
      "end": 2439.7599754333496,
      "text": " when we have missions conferences?"
    },
    {
      "id": 11,
      "start": 2439.7599754333496,
      "end": 2444.7599754333496,
      "text": " Because we finally put ourselves aside and think of others."
    },
    {
      "id": 12,
      "start": 2446.519973754883,
      "end": 2448.1999740600586,
      "text": " That's what missions does."
    },
    {
      "id": 13,
      "start": 2449.1599769592285,
      "end": 2454.1599769592285,
      "text": " I close with this, 1956, four young men,"
    },
    {
      "id": 14,
      "start": 2455.1599769592285,
      "end": 2459.0399742126465,
      "text": " four young men, actually five, a fifth will join them,"
    },
    {
      "id": 15,
      "start": 2459.9199752807617,
      "end": 2463.8399772644043,
      "text": " moved their families to Ecuador, to Quito, Ecuador."
    },
    {
      "id": 16,
      "start": 2465.2799758911133,
      "end": 2467.859977722168,
      "text": " One of those men was named Jim Elliott,"
    },
    {
      "id": 17,
      "start": 2469.079978942871,
      "end": 2474.079978942871,
      "text": " and he so wanted to reach one particular tribe, the Aucas."
    },
    {
      "id": 18,
      "start": 2474.8799743652344,
      "end": 2477.839973449707,
      "text": " They had had some success in reaching other tribes,"
    },
    {
      "id": 19,
      "start": 2477.839973449707,
      "end": 2482.239974975586,
      "text": " but the Auca Indians in Ecuador were a serious business."
    },
    {
      "id": 20,
      "start": 2482.2799758911133,
      "end": 2484.239974975586,
      "text": " They were killers."
    },
    {
      "id": 21,
      "start": 2484.239974975586,
      "end": 2488.359977722168,
      "text": " They had killed a number of workers on oil plantations."
    },
    {
      "id": 22,
      "start": 2488.359977722168,
      "end": 2492.119972229004,
      "text": " They had killed others who had tried to come into their camp"
    },
    {
      "id": 23,
      "start": 2492.119972229004,
      "end": 2495.359977722168,
      "text": " and talk with them and civilize them, if you will."
    },
    {
      "id": 24,
      "start": 2495.359977722168,
      "end": 2500.019973754883,
      "text": " But Jim Elliott and others had a real desire to reach them."
    },
    {
      "id": 25,
      "start": 2500.019973754883,
      "end": 2501.3199768066406,
      "text": " They came up with a plan."
    },
    {
      "id": 26,
      "start": 2501.3199768066406,
      "end": 2504.1999740600586,
      "text": " Nate Saint was a pilot, he had a little plane,"
    },
    {
      "id": 27,
      "start": 2504.1999740600586,
      "end": 2507.239974975586,
      "text": " and he would fly over and drop gifts,"
    },
    {
      "id": 28,
      "start": 2507.239974975586,
      "end": 2510.7199783325195,
      "text": " and then they figured out a way to drop a bucket down,"
    },
    {
      "id": 29,
      "start": 2510.7199783325195,
      "end": 2511.8799743652344,
      "text": " and they would put gifts in."
    },
    {
      "id": 30,
      "start": 2511.8799743652344,
      "end": 2514.519973754883,
      "text": " And one day, after a couple of weeks of this,"
    },
    {
      "id": 31,
      "start": 2514.519973754883,
      "end": 2517.639976501465,
      "text": " the Aucas actually sent a gift back up."
    },
    {
      "id": 32,
      "start": 2518.639976501465,
      "end": 2521.119972229004,
      "text": " And they thought, this is it, we can reach them,"
    },
    {
      "id": 33,
      "start": 2521.119972229004,
      "end": 2522.759979248047,
      "text": " they're open to us now."
    },
    {
      "id": 34,
      "start": 2522.759979248047,
      "end": 2525.3999786376953,
      "text": " And Nate Saint found a little place,"
    },
    {
      "id": 35,
      "start": 2525.3999786376953,
      "end": 2527.9199752807617,
      "text": " a little strip to land on right by the river,"
    },
    {
      "id": 36,
      "start": 2527.9199752807617,
      "end": 2530.759979248047,
      "text": " and Jim Elliott went in, he dropped Jim off,"
    },
    {
      "id": 37,
      "start": 2530.759979248047,
      "end": 2534.439971923828,
      "text": " and then three more trips to take the other three in."
    },
    {
      "id": 38,
      "start": 2534.439971923828,
      "end": 2538.1599731445312,
      "text": " And they at first seemed to be making headway"
    },
    {
      "id": 39,
      "start": 2538.1599731445312,
      "end": 2540.679977416992,
      "text": " with the Auca Indians."
    },
    {
      "id": 40,
      "start": 2541.519973754883,
      "end": 2542.719970703125,
      "text": " But all of it was a ruse."
    },
    {
      "id": 41,
      "start": 2543.719970703125,
      "end": 2546.8399810791016,
      "text": " Not long after that first day,"
    },
    {
      "id": 42,
      "start": 2546.8399810791016,
      "end": 2550.1599731445312,
      "text": " two Auca women came out of the jungle"
    },
    {
      "id": 43,
      "start": 2550.1599731445312,
      "end": 2552.5999755859375,
      "text": " on the other side of the river."
    },
    {
      "id": 44,
      "start": 2552.5999755859375,
      "end": 2554.3599700927734,
      "text": " And they seemed to be coming in peace"
    },
    {
      "id": 45,
      "start": 2554.3599700927734,
      "end": 2557.8799743652344,
      "text": " and seemed to be offering to talk."
    },
    {
      "id": 46,
      "start": 2557.8799743652344,
      "end": 2562.3999786376953,
      "text": " And Elliott and another man got into the river"
    },
    {
      "id": 47,
      "start": 2562.3999786376953,
      "end": 2564.3199768066406,
      "text": " and started a cross to them."
    },
    {
      "id": 48,
      "start": 2564.3199768066406,
      "end": 2565.999969482422,
      "text": " And as they were doing that,"
    },
    {
      "id": 49,
      "start": 2565.999969482422,
      "end": 2567.999969482422,
      "text": " they heard a rustling behind them,"
    },
    {
      "id": 50,
      "start": 2567.999969482422,
      "end": 2572.999969482422,
      "text": " and Auca men had jumped out of the woods"
    },
    {
      "id": 51,
      "start": 2573.47998046875,
      "end": 2576.1599731445312,
      "text": " with spears and bows and arrows,"
    },
    {
      "id": 52,
      "start": 2576.1599731445312,
      "end": 2577.5999755859375,
      "text": " and were coming quickly,"
    },
    {
      "id": 53,
      "start": 2577.5999755859375,
      "end": 2579.679977416992,
      "text": " and there was no doubt what was in their mind,"
    },
    {
      "id": 54,
      "start": 2579.679977416992,
      "end": 2583.5599822998047,
      "text": " they were going to kill Jim Elliott, Nate Saint,"
    },
    {
      "id": 55,
      "start": 2583.5599822998047,
      "end": 2585.3999786376953,
      "text": " and the others who were in the river."
    },
    {
      "id": 56,
      "start": 2586.3199768066406,
      "end": 2588.3999786376953,
      "text": " Now here's the unbelievable thing."
    },
    {
      "id": 57,
      "start": 2589.9199829101562,
      "end": 2593.7999725341797,
      "text": " Jim Elliott had a pistol in his coat."
    },
    {
      "id": 58,
      "start": 2594.7999725341797,
      "end": 2597.759979248047,
      "text": " He reached in to draw the pistol,"
    },
    {
      "id": 59,
      "start": 2598.9199829101562,
      "end": 2601.2799682617188,
      "text": " and someone else looked at him and he looked at them"
    },
    {
      "id": 60,
      "start": 2601.2799682617188,
      "end": 2602.9199829101562,
      "text": " because they had made a pact"
    },
    {
      "id": 61,
      "start": 2604.47998046875,
      "end": 2606.9199829101562,
      "text": " that the only thing they would use the pistol for"
    },
    {
      "id": 62,
      "start": 2606.9199829101562,
      "end": 2609.1599731445312,
      "text": " was protection from animals."
    },
    {
      "id": 63,
      "start": 2609.1599731445312,
      "end": 2613.519973754883,
      "text": " They would not kill an Auca Indian"
    },
    {
      "id": 64,
      "start": 2613.519973754883,
      "end": 2616.679977416992,
      "text": " because they knew that soul was lost."
    },
    {
      "id": 65,
      "start": 2618.679977416992,
      "end": 2621.199981689453,
      "text": " Jim Elliott, Nate Saint, and three others"
    },
    {
      "id": 66,
      "start": 2621.199981689453,
      "end": 2623.2999725341797,
      "text": " were killed in that river that day."
    },
    {
      "id": 67,
      "start": 2624.759979248047,
      "end": 2626.8399810791016,
      "text": " When they could have protected themselves."
    },
    {
      "id": 68,
      "start": 2628.6399688720703,
      "end": 2633.2799682617188,
      "text": " He wrote this, and to me it's incredible."
    },
    {
      "id": 69,
      "start": 2634.6399688720703,
      "end": 2636.9199829101562,
      "text": " Jim Elliott wrote, he is no fool"
    },
    {
      "id": 70,
      "start": 2638.1599731445312,
      "end": 2640.3599700927734,
      "text": " who gives what he cannot keep"
    },
    {
      "id": 71,
      "start": 2641.519973754883,
      "end": 2644.8399810791016,
      "text": " to gain what he cannot lose."
    },
    {
      "id": 72,
      "start": 2647.0799713134766,
      "end": 2649.8399810791016,
      "text": " Sometimes we are so careful"
    },
    {
      "id": 73,
      "start": 2649.8399810791016,
      "end": 2653.3199768066406,
      "text": " about holding on to everything we have here."
    },
    {
      "id": 74,
      "start": 2654.719970703125,
      "end": 2657.8399658203125,
      "text": " To making sure that we're cared for here,"
    },
    {
      "id": 75,
      "start": 2657.8399658203125,
      "end": 2662.7999877929688,
      "text": " and I'm a planner, I'm not for just being foolish."
    },
    {
      "id": 76,
      "start": 2664.3999633789062,
      "end": 2666.3599853515625,
      "text": " But I am saying this to you,"
    },
    {
      "id": 77,
      "start": 2667.719970703125,
      "end": 2668.759979248047,
      "text": " that we owe a debt."
    },
    {
      "id": 78,
      "start": 2670.999969482422,
      "end": 2675.2799682617188,
      "text": " And missions is the way that we can pay that debt."
    },
    {
      "id": 79,
      "start": 2677.519989013672,
      "end": 2680.499969482422,
      "text": " And God calls missionaries to go into places"
    },
    {
      "id": 80,
      "start": 2680.499969482422,
      "end": 2683.0599670410156,
      "text": " to do things that I don't want to do."
    },
    {
      "id": 81,
      "start": 2684.3599853515625,
      "end": 2688.3199768066406,
      "text": " But they're not the only ones who have to live by faith."
    },
    {
      "id": 82,
      "start": 2688.3199768066406,
      "end": 2690.199981689453,
      "text": " We are called to live by faith."
    },
    {
      "id": 83,
      "start": 2691.2799682617188,
      "end": 2693.439971923828,
      "text": " And we are called to be the rope holders."
    },
    {
      "id": 84,
      "start": 2693.439971923828,
      "end": 2696.6399841308594,
      "text": " We are called to be the ones who give"
    },
    {
      "id": 85,
      "start": 2696.6399841308594,
      "end": 2699.2799682617188,
      "text": " so that they can go."
    },
    {
      "id": 86,
      "start": 2699.2799682617188,
      "end": 2703.1599731445312,
      "text": " And I'm telling you, it takes them to sacrifice home"
    },
    {
      "id": 87,
      "start": 2703.1599731445312,
      "end": 2706.1199645996094,
      "text": " and sacrifice a lot of things with family,"
    },
    {
      "id": 88,
      "start": 2706.1199645996094,
      "end": 2707.679962158203,
      "text": " sacrifice career."
    },
    {
      "id": 89,
      "start": 2707.679962158203,
      "end": 2711.9599609375,
      "text": " But listen, we are called upon to sacrifice."
    },
    {
      "id": 90,
      "start": 2711.9599609375,
      "end": 2714.1199645996094,
      "text": " We are called to prioritize."
    },
    {
      "id": 91,
      "start": 2714.1199645996094,
      "end": 2716.9199829101562,
      "text": " We are called to set one thing above another."
    },
    {
      "id": 92,
      "start": 2716.9199829101562,
      "end": 2721.8399658203125,
      "text": " We are called to do without sometimes."
    },
    {
      "id": 93,
      "start": 2721.8399658203125,
      "end": 2725.3999633789062,
      "text": " Boy, not a message our generation wants to hear."
    },
    {
      "id": 94,
      "start": 2727.9199829101562,
      "end": 2731.0399780273438,
      "text": " But when God sees us say,"
    },
    {
      "id": 95,
      "start": 2731.0399780273438,
      "end": 2735.4199829101562,
      "text": " there's something more important than filling my need,"
    },
    {
      "id": 96,
      "start": 2736.6399841308594,
      "end": 2740.239990234375,
      "text": " something more important than satisfying my want,"
    },
    {
      "id": 97,
      "start": 2741.9599609375,
      "end": 2746.259979248047,
      "text": " I want to share what I have so that they can go,"
    },
    {
      "id": 98,
      "start": 2747.3599853515625,
      "end": 2750.999969482422,
      "text": " so that they can preach, so that others can hear."
    },
    {
      "id": 99,
      "start": 2750.999969482422,
      "end": 2755.519989013672,
      "text": " And when we make that choice, God goes,"
    },
    {
      "id": 100,
      "start": 2759.679962158203,
      "end": 2762.5799865722656,
      "text": " that's pleasing, that's acceptable."
    },
    {
      "id": 101,
      "start": 2763.439971923828,
      "end": 2765.239990234375,
      "text": " You ever heard this?"
    },
    {
      "id": 102,
      "start": 2765.239990234375,
      "end": 2766.759979248047,
      "text": " You cannot out give God."
    },
    {
      "id": 103,
      "start": 2767.8399658203125,
      "end": 2770.0999755859375,
      "text": " Well, the proof of it is there in verse 19."
    },
    {
      "id": 104,
      "start": 2771.0999755859375,
      "end": 2773.219970703125,
      "text": " God says, when you've got that kind of heart,"
    },
    {
      "id": 105,
      "start": 2773.219970703125,
      "end": 2776.3799743652344,
      "text": " here's what I do for you, I'll supply all your need."
    },
    {
      "id": 106,
      "start": 2778.8999633789062,
      "end": 2779.7799682617188,
      "text": " Big circle."
    },
    {
      "id": 107,
      "start": 2781.699981689453,
      "end": 2783.5399780273438,
      "text": " With this, I close."
    },
    {
      "id": 108,
      "start": 2783.5399780273438,
      "end": 2787.439971923828,
      "text": " You know, I have never seen a U-Haul at a funeral."
    },
    {
      "id": 109,
      "start": 2789.3799743652344,
      "end": 2790.8199768066406,
      "text": " You ever seen it?"
    },
    {
      "id": 110,
      "start": 2790.8199768066406,
      "end": 2793.2999877929688,
      "text": " I've never seen a hearse pulling a U-Haul"
    },
    {
      "id": 111,
      "start": 2794.4199829101562,
      "end": 2796.699981689453,
      "text": " because you don't take it with you"
    },
    {
      "id": 112,
      "start": 2796.699981689453,
      "end": 2799.0999755859375,
      "text": " and because there is something beyond this life."
    },
    {
      "id": 113,
      "start": 2800.5399780273438,
      "end": 2804.499969482422,
      "text": " And what Jim Elliott said was, reprioritize."
    },
    {
      "id": 114,
      "start": 2805.7799682617188,
      "end": 2808.499969482422,
      "text": " Really look out there at what really is important."
    },
    {
      "id": 115,
      "start": 2808.499969482422,
      "end": 2813.0999755859375,
      "text": " Remember where God got you and how God changed your life"
    },
    {
      "id": 116,
      "start": 2814.1399841308594,
      "end": 2818.6199645996094,
      "text": " and find some portion of your heart that can give."
    },
    {
      "id": 117,
      "start": 2819.6199645996094,
      "end": 2821.0999755859375,
      "text": " That can give."
    },
    {
      "id": 118,
      "start": 2821.0999755859375,
      "end": 2823.519989013672,
      "text": " God may be calling you to give your life."
    },
    {
      "id": 119,
      "start": 2823.519989013672,
      "end": 2825.47998046875,
      "text": " He may want you to go."
    },
    {
      "id": 120,
      "start": 2825.47998046875,
      "end": 2828.0999755859375,
      "text": " Next time I preach, I want to preach about that."
    },
    {
      "id": 121,
      "start": 2829.0999755859375,
      "end": 2832.699981689453,
      "text": " But God is definitely calling us, church,"
    },
    {
      "id": 122,
      "start": 2834.4199829101562,
      "end": 2836.199981689453,
      "text": " to set right priorities."
    },
    {
      "id": 123,
      "start": 2837.4599609375,
      "end": 2842.4599609375,
      "text": " And souls are the highest priority that God has."
    },
    {
      "id": 124,
      "start": 2843.3399658203125,
      "end": 2844.499969482422,
      "text": " Would you pray with me?"
    },
    {
      "id": 125,
      "start": 2845.4199829101562,
      "end": 2847.1399841308594,
      "text": " Father, help us to see truth."
    },
    {
      "id": 126,
      "start": 2848.3799743652344,
      "end": 2850.47998046875,
      "text": " I pray that you would speak to our hearts"
    },
    {
      "id": 127,
      "start": 2850.47998046875,
      "end": 2853.199981689453,
      "text": " about the priorities in our lives."
    },
    {
      "id": 128,
      "start": 2855.179962158203,
      "end": 2857.1399841308594,
      "text": " I don't think you want anybody to be foolish."
    },
    {
      "id": 129,
      "start": 2857.1399841308594,
      "end": 2859.6399841308594,
      "text": " I don't think you want missionaries to be foolish."
    },
    {
      "id": 130,
      "start": 2861.8999633789062,
      "end": 2866.219970703125,
      "text": " But I do think you want us to be sacrificial."
    },
    {
      "id": 131,
      "start": 2867.8199768066406,
      "end": 2870.3799743652344,
      "text": " I do think you want us to care about souls."
    },
    {
      "id": 132,
      "start": 2870.3799743652344,
      "end": 2873.1599731445312,
      "text": " I do think you want us to remember where we were"
    },
    {
      "id": 133,
      "start": 2873.1599731445312,
      "end": 2875.439971923828,
      "text": " when you found us."
    },
    {
      "id": 134,
      "start": 2875.439971923828,
      "end": 2877.2999877929688,
      "text": " I do think you want us to consider"
    },
    {
      "id": 135,
      "start": 2877.2999877929688,
      "end": 2879.8399658203125,
      "text": " how you've made our lives better,"
    },
    {
      "id": 136,
      "start": 2879.8399658203125,
      "end": 2883.3399658203125,
      "text": " how you've promised us beyond this life, eternal life."
    },
    {
      "id": 137,
      "start": 2884.4599609375,
      "end": 2886.6199645996094,
      "text": " I do think you want us to remember"
    },
    {
      "id": 138,
      "start": 2886.6199645996094,
      "end": 2888.5799865722656,
      "text": " that just as much as you loved us,"
    },
    {
      "id": 139,
      "start": 2888.5799865722656,
      "end": 2891.1599731445312,
      "text": " you love every person in this world."
    },
    {
      "id": 140,
      "start": 2892.6599731445312,
      "end": 2894.4199829101562,
      "text": " I do think you want us to remember"
    },
    {
      "id": 141,
      "start": 2894.4199829101562,
      "end": 2896.3799743652344,
      "text": " that you want us to bear fruit."
    },
    {
      "id": 142,
      "start": 2901.1399841308594,
      "end": 2903.3399658203125,
      "text": " God, would you help us to prioritize?"
    },
    {
      "id": 143,
      "start": 2904.6199645996094,
      "end": 2907.2999877929688,
      "text": " Would you help us to struggle with that in our lives?"
    },
    {
      "id": 144,
      "start": 2908.5999755859375,
      "end": 2910.179962158203,
      "text": " What could we set aside?"
    },
    {
      "id": 145,
      "start": 2912.1399841308594,
      "end": 2913.47998046875,
      "text": " What could we do without?"
    },
    {
      "id": 146,
      "start": 2914.47998046875,
      "end": 2917.0,
      "text": " What could we change?"
    },
    {
      "id": 147,
      "start": 2918.3800048828125,
      "end": 2920.5599975585938,
      "text": " What desire could we put away?"
    },
    {
      "id": 148,
      "start": 2921.5999755859375,
      "end": 2923.5599975585938,
      "text": " What habit could we undo"
    },
    {
      "id": 149,
      "start": 2925.239990234375,
      "end": 2930.239990234375,
      "text": " that would allow us to give so that others can hear,"
    },
    {
      "id": 150,
      "start": 2931.199951171875,
      "end": 2932.5799560546875,
      "text": " so that others can go?"
    },
    {
      "id": 151,
      "start": 2934.0799560546875,
      "end": 2937.0,
      "text": " Lord, I pray that you would lay on our hearts tonight"
    },
    {
      "id": 152,
      "start": 2937.0,
      "end": 2940.719970703125,
      "text": " that it's not just the missionaries who should pay a price,"
    },
    {
      "id": 153,
      "start": 2941.719970703125,
      "end": 2944.9599609375,
      "text": " but we ought to be willing to sacrifice too."
    },
    {
      "id": 154,
      "start": 2946.3599853515625,
      "end": 2949.0399780273438,
      "text": " So in whatever way you desire,"
    },
    {
      "id": 155,
      "start": 2949.0399780273438,
      "end": 2951.6399536132812,
      "text": " I pray you'd speak into the lives of people."
    },
    {
      "id": 156,
      "start": 2952.6799926757812,
      "end": 2955.6399536132812,
      "text": " Maybe they just need to struggle with their priorities."
    },
    {
      "id": 157,
      "start": 2957.0399780273438,
      "end": 2959.47998046875,
      "text": " Maybe they need to make a commitment"
    },
    {
      "id": 158,
      "start": 2959.47998046875,
      "end": 2962.3599853515625,
      "text": " that they're going to give more so that more can hear."
    },
    {
      "id": 159,
      "start": 2963.239990234375,
      "end": 2966.6799926757812,
      "text": " Maybe there's one here tonight that you've been really,"
    },
    {
      "id": 160,
      "start": 2966.6799926757812,
      "end": 2968.6799926757812,
      "text": " you've been dealing with them in their heart"
    },
    {
      "id": 161,
      "start": 2968.6799926757812,
      "end": 2970.8800048828125,
      "text": " and they know that you're dealing with them."
    },
    {
      "id": 162,
      "start": 2972.3599853515625,
      "end": 2975.9199829101562,
      "text": " Lord, may they just invite you in."
    },
    {
      "id": 163,
      "start": 2976.7999877929688,
      "end": 2980.719970703125,
      "text": " And if it's a call to the field, then may they surrender."
    },
    {
      "id": 164,
      "start": 2980.719970703125,
      "end": 2984.2799682617188,
      "text": " If it's a call to prioritize, may they make that choice."
    },
    {
      "id": 165,
      "start": 2986.6799926757812,
      "end": 2988.8399658203125,
      "text": " Lord, I pray you'd help us to see our need."
    },
    {
      "id": 166,
      "start": 2989.7799682617188,
      "end": 2992.9199829101562,
      "text": " In Jesus' name I pray, amen."
    },
    {
      "id": 167,
      "start": 2992.9199829101562,
      "end": 2994.0799560546875,
      "text": " I'm gonna ask you to..."
    }
  ],
  "processed_at": "2025-04-16T09:00:53.964588"
}