{
  "video_id": "rwlS36WfLm8",
  "text": "You see in the bulletin this morning that our message for the this morning title is this, Elisha wept, Elisha wept. I am thankful that we serve the creator God, amen. We have been created by God and we understand that he knows everything about us and he's created us as emotional people. And we understand that many of those emotions we could look at, we could speak about many of those emotions this morning, but here with focus on the message, I would say this, that at times our emotions are evidenced through our tears. Sometimes that is tears of gladness and rejoicing. We find that Joseph, in fact, in the book of Genesis, there are many references in which the Bible speaks about Joseph weeping. And you would find that he wept at the sight of his father. After all of those years of being separated, and of course all that had transpired, and those no doubt are tears of rejoicing. We find that we would look at the word of God and we often would refer to Jeremiah as being what? The weeping prophet. That's oftentimes how we would refer to Jeremiah, as you read the book of Jeremiah, but especially as you read the book of Lamentations. The book of Lamentations, God uses Jeremiah to write that book. It's just a short book and we find that he's lamenting over the destruction of Judah because of the captivity of the Babylonians and all that took place. And in Lamentations 1 in verse number 16 we read this, for these things I weep. For these things I weep, mine eye, mine eye runneth down with water because the comforter that should relieve my soul is far from me. My children are desolate because the enemy prevailed. We read also in Lamentations 3 in verse number 51 where the Bible says, mine eye affecteth my heart. We think about that impact that our eye has upon our heart and then sometimes the impact that our heart has on our eye through tears. We find that the Lord Jesus Christ, at His triumphal entry, the Bible tells us that when He seized Jerusalem, He wept over it. You read in the book of Acts in the 20th chapter as Paul is speaking to those religious, or excuse me, to the leaders, the church leaders there at Ephesus, of the church at Ephesus. It's recorded in Acts 20. And as he's describing his ministry, he describes it this way, I cease not to warn everyone night and day with tears, with tears. As we look at 2 Kings chapter number 8, we read, beginning in verse number 7, the Bible says this, and Elisha came to Damascus and Ben-Hadad, the king of Syria, was sick. And it was told him, saying, The man of God has come hither. And the king, that's Ben-Hadad, said unto Haziel, which was one of his servants, Take a present in thine hand, and go, meet the man of God, and inquire of the Lord by him, saying, Shall I recover of this disease? No doubt Ben-Hadad was interested in knowing with this sickness that he had, am I going to recover? Am I going to get well? And we find that Haziel goes to Elisha, the man of God, to meet him, and took a present with him, even of every good thing of Damascus, forty camels' burden, and came and stood before him, and said, Thy son Ben-Hadad, king of Syria, hath sent me to thee, saying, Shall I recover of this disease? You see, in verse number 9, the description of the size of this present, and really the scene is set for us, and Ben-Hadad had inquired through his servant Haziel, and Haziel comes there and he speaks to Elisha, the man of God, and here's what Elisha's message is in verse number 10. He says, Go, say unto him, Thou mayest certainly recover, howbeit the Lord hath showed me that he shall surely die. If you read the entirety of the passage of Scripture, you'll find that Ben-Hadad could have recovered from the sickness that he had, but in fact what happened was Haziel killed him. If you read in verse number 15, it says, And it came to pass in the morrow, that he, Haziel, took a thick cloth, and dipped it in water, and spread it on his face, so that he died. And notice what the last verse, or the end of that verse says, that Haziel reigned in his stead. In the midst of all of this, the verse by which we receive our title this morning in the thought that I want to focus in this morning is in verse number 11. The Bible says, after he had made the declaration, Elisha, to Haziel with regard to the fact that he could recover, but that he would surely die, it says that he settled his countenance steadfastly until he was ashamed. Elisha looks for a lengthy period of time at Haziel, and the Bible says at the end of verse number 11, And the man of God wept. The man of God wept. It's very interesting because in verse number 12, Haziel said, Why weepeth my Lord? And I'm thankful for that question that Haziel asked because it's through that question that we receive insight as to what it was that caused Elisha, the man of God, to weep. If you're taking notes this morning, consider what Elisha recognized. It's provided for us here in verses 12 and 13. The scene is set. We understand the interaction, the dialogue, as I've mentioned already, between Elisha and Haziel with regard specifically to Ben-Hadad, but God had revealed something more to Elisha than just the fact that Ben-Hadad would die. In fact, God had revealed to Elisha that Haziel would reign, and not only would he reign as king of Syria, but the destruction that would be brought upon the people of God. And we find that in verse number 12, when Haziel looks back at Elisha and he sees that Elisha, the man of God, is weeping, he says, Why weepest my Lord? And he answered, here is the response of Elisha, the insight that we receive, and we find that it's through this, what Elisha recognized that caused him to weep. He answered, notice in verse number 12, Because I know the evil that thou wilt do unto the children of Israel. He says, I know the evil, Haziel, that you're going to do to the children of Israel. He says, notice what he says, how he describes it. He says, Their strongholds wilt thou set on fire. Their young men wilt thou slay with the sword, and wilt dash their children and rip up their women with child. Wow. God had revealed this to Elisha, and as Elisha is standing there and answering the question with regard to Ben-Hadad's health, God had not only revealed to Elisha that Haziel would kill Ben-Hadad, but that Haziel would reign as the king, and the destruction that he would bring upon his own people. He says in verse number 13, And Haziel said, But what is thy servant, a dog, that he should do this great thing? And Elisha answered, The Lord hath showed me that thou shalt be king over Syria. I'm thankful this morning that our God is omniscient. We spoke about that a little bit during our Sunday school hour this morning, and how that the Lord knew their thoughts, those that were there seeking to attack and accuse the Lord Jesus Christ. But we find here that God is omniscient. He's also eternal. He knows the end from the beginning. He is able to reveal to Elisha that which would happen in the future. He was able to not only give Elisha wisdom and insight with regard to Ben-Hadad, but also with regard to Haziel. When we find that God had revealed this, Elisha makes it plain that it was the Lord. This was not Elisha just coming up with some idea of what was going to happen. The Lord God Almighty, the eternal Creator God, revealed this information to Elisha. And it was this information, what Elisha had recognized about what Haziel would do that brought him to a place of weeping. It says that the man of God wept. I want you to notice that this information that is given to us, that which Elisha had recognized in verse 12 and 13, it comes to pass. By the way, everything that God says comes to pass. Sometimes you read in the New Testament that phraseology, and it came to pass. You read how that the Lord has given us many promises for which we ought to rejoice and be thankful for, and every one of them has either been fulfilled or will be fulfilled, because God always does what He says He will do. And we find that here in the depth of the destruction and the sorrow that Elisha has, we find that it came to pass. Hold your place here in 2 Kings, but I want you to turn over to chapter 10 in verse number 32. Turn over a few verses or a few pages and look here in 2 Kings chapter number 10. In verse number 32, the Bible says, in those days, the Lord began to cut Israel short, and Haziel smote them in all the coast of Israel from Jordan eastward, all the land of Gilead, the Gadites, the Reubenites, the Manassites from Aurore, which is by the river Arno. on even Gilead and Bashan. We find that, obviously, because of the sin of the people, God is allowing this judgment to take place. And the king of Syria, this Haziel, that is the man that is interacting with Elisha in 2 Kings 8, we find here that he smote them and all the coast of Israel, according to verse 32. Turn over another page or two to chapter 12, and notice as we read here in this passage of Scripture and we notice what's taking place in verse 17. It says, Then Haziel, king of Syria, went up and fought against Gath and took it. And Haziel set his face to go up to Jerusalem. And Jehoash, king of Judah, took all the hallowed things that Jehoshaphat and Jehoram and Ahaziah, his father's kings of Judah, had dedicated, and his own hallowed things and all the gold that was found in the treasures of the house of the Lord and in the king's house, and sent it to Haziel, king of Syria, and he went away from Jerusalem. And so we find at this particular juncture, we find that Haziel had had success there at Gath, and now he sets his army in the direction of going to Jerusalem for the purpose of destroying it and overtaking it. And the king at that time is Jehoash, and he takes all of the goods and he sends all of these goods to Haziel in order to appease him so that he would not come upon Jerusalem. And at that particular time, the Bible tells us that he went away from Jerusalem, but I want you to understand that that did not last, for in chapter number 13, it says this in verse number 6, Nevertheless, they departed not from the sins of the house of Jeroboam, who made Israel sin, but walked therein, and there remained the grove also in Samaria. Neither did he leave of the people of Jehoahaz, but fifty horsemen and ten chariots and ten thousand footmen, for the king of Syria had destroyed them and had made them like the dust by threshing.\" Who is that king of Syria? It's Haziel. God tells us, as we read through the book of 2 Kings, that that which had been revealed, that which was recognized by Elisha did indeed come to pass. We not only note in our text of Scripture in 2 Kings chapter 8 how or what it was that Elisha recognized, but we consider how he responded. We've already made note to this, and so I'll just quickly rehearse it here, where the Bible says that the man of God wept. I want you to think about that just for a moment. I want you to allow the thought of that text of Scripture to really sink deep within your mind this morning and really to impress upon your heart the response of Elisha to that which he had recognized. To weep is to cry, to shed tears, but the reality is that often as we use that word weep or wept, it carries with it a greater context than just someone crying, someone that's just shed a single tear, just got a little emotional or choked up in dealing with something. No, the Bible says that the man of God wept. He wept. His heart was breaking over that which had been revealed to him. And we find that that which had been revealed had a profound impact upon Elisha. The hardship, the brutality, the destruction that would come to pass affected him. It impacted him. And he stood there and wept. I don't know how long he stood there. The Bible tells us in verse number 11 that he settled his countenance steadfastly until he was ashamed. There was a period of time that Elisha stood there staring at Hazio. You ever feel like somebody's staring at you and they're just kind of looking into your soul, so to speak? They're standing there and he begins to weep. He begins to weep. You ever been in a situation where someone's crying and you've asked them, they're weeping, and you say, why are you weeping? That's what happens in verse 12. Why weepeth my Lord? And he gives the answer. We've looked at it already. But when we consider this morning, this text of Scripture from the Old Testament, and we consider what Elisha recognized and how he responded, I want you to consider this morning with me. I'm not going to preach short this morning. I'm just getting to the third point. That's our longest point. I want you to consider this morning, number three, the absence of tears. The absence of tears. I want you to think about this. Turn over to the book of Isaiah, if you will, in the 39th chapter. Isaiah chapter 39. I want you to look at this passage of Scripture with me. We won't take time to read all of it, but I want you to understand what's taking place here. In this passage of Scripture, we read about Hezekiah and his interaction with the man of God, the prophet of God, Isaiah. We find that Hezekiah, we often would say that he would find himself in that category as being basically a good king. And you read about Hezekiah. Remember, it was during his time that the Assyrians were going to come and to try to take captive Judah. They had already been successful in taking captive Israel, the ten tribes of the north. We find that Hezekiah, he receives those letters and he receives all that's taking place. The threats and just the crazy stuff that was being said to him with regard to how they would be destroyed. The people that come from Assyria, they not only try to pressure upon Hezekiah and to cause Hezekiah to fold, but they try to impact the people. They try to cause the people to be afraid. They tell the people, don't trust in Hezekiah. Don't allow him to influence you to trust in God. We are mindful of the fact that Hezekiah takes those papers and he opens them up to the Lord and he prays to God. He understands that God is the Creator and that God is able. And let me say this, God moves and God works miraculously. And the Assyrians are destroyed, but then Hezekiah gets sick. And we read in the beginning of chapter 38 where the Bible says, in those days was Hezekiah sick unto death. And he is told this by the prophet at the end of verse number 1 of Isaiah 38, thus saith the Lord, set thine house in order for thou shalt die and not live. And Hezekiah is saddened at this news and Hezekiah begins to pray and God hears the prayer and God says that He would add 15 years to his life. The worst 15 years of his life. Honestly. Terrible. And here is what happens. The Babylonians send a group of people and Hezekiah welcomes them. And Hezekiah shows them all that he has and all that is there. And after the meeting with the Babylonians, we pick it up in chapter number 39 and it says this in verse 2, and Hezekiah was glad of them. That's the entourage, if you will, that was sent from the king of Babylon according to verse number 1. They had heard that he had been sick and he recovered so they come and they had a present and he said that he was glad and he showed them the house of his precious things, the silver, the gold, the spices, the precious ointment and all the house of his armor and all that was found in his treasures. There was nothing in his house and all his dominion that Hezekiah showed them not. Then Isaiah came. Isaiah came and paid Hezekiah a visit in verse number 3 and it says that Isaiah says unto Hezekiah, what said these men and from whence came they unto thee? And Hezekiah said, they are come from a far country unto me, even from Babylon. Then said he, what have they seen in thine house? And Hezekiah answered, all that is in mine house have they seen. There is nothing among my treasures that I have not showed them. In verse number 4. In verse number 5 the Bible says then said Isaiah to Hezekiah, hear the word of the Lord of hosts. Behold, verse 6, the days come that all that is in thine house and that which thy fathers have laid up in store until this day shall be carried to Babylon. Nothing shall be left, saith the Lord. And of thy sons that shall issue from thee which thou shalt beget shall they take away and they shall be eunuchs in the palace of the king of Babylon. Now verse 6 and 7 is not good news. Right? Verse 6 and 7 we could liken that to what Elisha understood in 2 Kings chapter number 8. How that he understood what Hazael was going to do, the king of Syria to the people of God and the brutality and the destruction, the way in which God reveals to him that the strongholds would be burned, the young men would be slain, the children would be dashed and they would rip up the women with child and God revealed that to him and here Hezekiah the king of Judah is given this revelation, he's given this information from Hezekiah that listen, excuse me, Hezekiah receives it from Isaiah that everything that they've seen is going to be carried to Babylon. Nothing shall be left and by the way your sons that shall issue from you, they're going to become eunuchs in the palace of Babylon. Notice Hezekiah's response in verse number 8. Then said Hezekiah to Isaiah, good is the word of the Lord which thou hast spoken. He said moreover, good is the word of the Lord over, for there shall be peace and truth in my days.\" Does that not bother you? The response of Hezekiah is not to weep. The response of Hezekiah is not to beg God to intercede. Oh, when he was told that he was going to die in Isaiah chapter 38, in verse number four, and let me back up, in verse number three, and said, remember now, oh Lord, he's coming and he's praying to the Lord. According to verse number two, he turned his face to the wall and he prayed unto the Lord and he says this, in verse number three, remember now, oh Lord, I beseech thee, how I have walked before thee in truth and with a perfect heart and have done that which is good in thy sight. And Hezekiah wept sore because he was going to die. God says in verse number three, verse number four, excuse me, then came the word of the Lord unto Isaiah saying, go and show to Hezekiah, say to Hezekiah, thus saith the Lord the God of David thy father, I have heard thy prayer, notice this, I have seen thy tears, behold, I will add unto thy days fifteen years. But in chapter 39, the Babylonians are going to come and they're going to take everything. Nothing is going to be left. Their sons are going to become eunuchs in the palace of Babylon. And Hezekiah says, good is the word of the Lord, there'll be peace in my day. Does that not baffle your mind? The absence of tears on the part of Hezekiah. If we'd be honest this morning, I make the application for us today. I believe in many of our lives, in many of our churches across this land, in fact in many of our churches across this globe, I believe there's an absence of tears. There's an absence of allowing the truth that God has revealed to us to truly impact us. The reality is that Elisha hears about physical destruction that's going to take place at the hands of Hazael, king of Syria. The man of God wept. What was it that caused Hezekiah to weep his own death being announced? But at the destruction of the people and the carrying away into captivity, he wept not. This morning, I think about what God's word has revealed to us as the people of God today, just as God had revealed through the prophets and to Elisha the prophet, and then through the prophet Isaiah to Hezekiah, He had revealed to those men what would happen, what would come to pass. Can I tell you this morning that God has given us truth with regard to what's going to come to pass. As we look to the word of God, and I think this morning specifically about the truth of the reality of the lake of fire. The word of God refers to it as the second death, the great white throne judgment. This morning, the truth is that that will come to pass, and every single lost person that you know and every single lost person that I know is going to stand at the great white throne. Look at it in Revelation 20. I'll be honest with you, I hate reading this passage of Scripture publicly, but I'm going to. I don't much enjoy reading it privately. In Revelation 20 and verse number 11, the Bible begins by saying this, and I saw a great white throne, and him that sat on it from whose face the earth and the heaven fled away, and there was found no place for them. I saw the dead, small and great, stand before God, and the books were opened and another book was opened, which is the book of life, and the dead were judged out of those things which were written in the books according to their works, and the sea gave up the dead which were in it, and death and hell delivered up the dead which were in them, and they were judged every man according to their works. And death and hell were cast in the lake of fire, this is the second death, and whosoever was not found written in the book of life was cast into the lake of fire. Now often this morning as we think about this truth, for ourselves maybe we think about verse number 6 of Revelation 20, but the Bible says, blessed and holy is he that hath part in the first resurrection, on such the second death hath no power, but they shall be priests of God and of Christ and shall reign with him a thousand years. I'm thankful this morning that I've been saved by the blood of Jesus Christ, and I'm thankful this morning that the second death has no power over me, but there are countless millions of people that do not know the Lord Jesus Christ as their personal Savior. Some of the people that you work with, some of the people that you live next to, some of the people that we see throughout the community. The reality is that one day, we don't know the day, we know that the great white throne judgment is at least a thousand and seven years away because of the tribulation and the millennial reign of Christ, but that is if the Lord returned at this moment. So we don't know how long it is until this event takes place, but we know that just as the case was with Hazael, it came to pass. Just as the case is with the Babylonians, you can read of the Babylonian captivity and all that they did in the destruction of Judah and the carrying away of the people. You can understand this morning that this too, this truth of Revelation 20 is going to come to pass. And I want you to think about this as you go into the 21st chapter of the book of Revelation. I'm not going to read much except for one verse here in verse number four, and I just want to read really the first part of the verse because I want you to see what the Bible says. And God shall wipe away all tears from their eyes. Continues and says, there shall be no more death, neither sorrow nor crying, neither shall there be any more pain, for the former things are passed away. I want you to think about that first phrase in verse number four where it says, God shall wipe away all tears from their eyes. I believe that as you look at the text of Scripture and you understand the events that are taking place, I believe that believers will be at the great white throne of judgment not to be judged, but will be there. And why is it that Revelation 21 and verse number four says that God shall wipe away all the tears? Because I think there's going to be a lot of believers that are going to be weeping. The issue is that we ought to be weeping right now. I wonder as we look at our prayer bulletin, when's the last time we've wept over some of the names in that prayer bulletin, people that are lost that we know. We have specific names on our prayer bulletin because they're specific people that we know. Maybe not every single one of us know them personally, but somebody within our congregation knows them personally and we pray for them. I want you to think about this truth as we...I've asked myself this question, how can we have dry eyes? How can we respond like Hezekiah did and say, well, it's good for us? Sometimes we get this perspective of life and maybe we just get so consumed with what's going on and the routine and the monotony of life and just all that's taking place, and we're not even mindful of the fact that these people are going to die and go to a Christless eternity. They're going to be cast into the lake of fire forever, it's not just for a period of time, it's for all of eternity. And how can we that know the truth not really be impacted by it? Should it not cause us as it caused Elisha to weep? I want you to notice the testimony of the Apostle Paul in the book of Romans. Paul, of course, I mentioned already in Acts 20 by way of introduction, how that he speaks about his ministry there in Ephesus and he's speaking to the church leaders of Ephesus and he says that, I cease not to warn everyone night and day with tears. Why did Paul cease not to warn night and day? And why did he have tears? Because God had revealed some things to him. God had revealed to him the truth of salvation through the Lord Jesus Christ. Listen, there's no other name under heaven whereby we must be saved, right? Neither is there salvation in any other name. other name, the name of Jesus. Jesus said, I am the way, the truth, and the life. No man cometh unto the Father but by me. In Romans 9, I want you to see the heart, if you will, of Paul as he's sharing here and speaking about his own perspective. He says, I say the truth in Christ, I lie not, my conscience also bearing me witness in the Holy Ghost. We know that all Scripture is given by inspiration of God, and we understand that God is recording this, and these are the thoughts, this is the heart of Paul as he's sharing with these believers. And he's saying, I'm telling you the truth, I'm not just trying to sound good here. He says that I have, notice what he says in verse number 2, I have great heaviness and continual sorrow in my heart. Why Paul? I know that the word weep or tears is not mentioned there, but in my mind this morning, I think that this man that has great heaviness and continual sorrow in his heart, I believe there were tears that were shed. As he said to the believers at Ephesus, I cease not to warn night and day with tears, no doubt he's got tears. And it tells us in verse number 3, for I could wish that myself were accursed from Christ for my brethren, my kinsmen according to the flesh. Chapter 10 in verse number 1, notice what he says, brethren, my heart's desire and prayer to God for Israel is that they might be saved. Paul's desire was for people to be saved. He has, he's called, he's known as the apostle to the Gentiles, right, to the uncircumcision. We understand that, he mentions that in the book of Galatians, but he himself is Jewish. And being Jewish, he says, I have this great sorrow and this continual sorrow, this heaviness in my heart. Why? Because I want them to be saved. Because I know that just because they're Jewish doesn't mean they're right with God. Just because they have that heritage, just because that's their lineage, that does not give them a free pass. By the way, there are some people today that preach heresy on that subject, and they say just because someone's Jewish means they're going to go to heaven. That is an error, that is not true. The gospel, Paul says, I am not ashamed of the gospel of Christ, it is the power of God unto salvation, to the Jew first and also to the Gentile or to the Greek. Notice the distinction. He's talking about how Jesus came to his own and his own received him not. How many times in Paul's ministry did he go and he went to the synagogue preaching to the Jews, but the Jews didn't want to hear it, so he goes to the Gentiles. Over and over, you read in the book of Acts. And so Paul is sharing his heart here for his kinsmen according to the flesh. Notice the depth of the heartache. He says that I have great heaviness in chapter 9 and verse number 2, continual sorrow in my heart. Notice what he says, I could wish that myself were accursed from Christ for my brethren, my kinsmen, according to the flesh. I cannot fully comprehend the depth of verse number 3, I can't. I can't comprehend the depth of saying that I could wish that myself were accursed from Christ so that somebody else would be saved. Paul had a great desire to see people saved. What caused Paul to continue to go and preach the gospel? He'd go and he'd be beaten and he'd be cast out of town and suffer all sorts of persecution, but he'd go to the next place and he'd preach some more because he understood the truth of the gospel. He understood the need for people to be saved. He said, I'm willing to endure some hardship, I'm willing to endure some opposition, I'm willing to suffer some loss because my focus is on eternity. And these people, they need Christ. This morning as we think about the absence of tears, I've mentioned it by using the illustration of Hezekiah, but I challenge ourselves to look at our own lives. When's the last time we wept over lost souls? When's the last time we wept over our country, our nation, the globe? Millions are dying. Many times they die without Christ. I understand that we can't make anyone get saved. We can't make anyone get saved. In fact, if we can force conversion, I would question if it's actually conversion, right? Because it's a choice. So we can't force anyone, we can't manipulate anyone to trust Christ. But can I tell you this morning that as we look at the life of Hezekiah and we think about that absence of tears in contrast to the life of Elisha and the weeping over what would take place, I want my life to align more with Elisha than with Hezekiah. I don't want my own difficulties. I don't want news of my own health scare to cause me to weep when I won't even weep over lost souls. Does that make sense this morning? But sometimes we get so self-centered and so self-focused that it's just all about what's going on in my life, in my circle. We need to kind of break that down and begin to look and see what's going to happen. Turn over to the book of Psalms, if you will, and we'll close with this passage of Scripture. Psalm 126. I want you to notice what the Bible says in verses 5 and 6. They that sow in tears shall reap in joy. He that goeth forth and weepeth, bearing precious seed, shall doubtless come again with rejoicing, bringing his sheaves with him. They that sow in tears shall reap in joy. I don't remember what year it was. I was just doing a quick search here on my iPad when you were turning to that passage of Scripture. God gave me this poem that I wrote for one of our missions conferences a few years ago. I don't remember the date, but I titled the poem, and I'm not a poet, by the way. This is the only poem I've ever written. We've got some people in our church that have written poems and they could write books of poems. Have I done my part was what I titled the poem. Their names upon my heart, I wonder, have I done my part? Their faces I can see. They will live eternally. For billions have never heard the message from God's Word, how He died upon the tree and rose in triumph on day three. For boldness let us pray as we tell them of the way, the promise we must claim as the gospel we proclaim. And I'd add in that the need to weep. I pray that God would give us tears, seriously. Not to just be some weepy person that's always crying, but to truly have that heart of compassion for lost souls. Listen, I don't want somebody to just think, you're trying to tell me this because you want me to go to your church. I've told people, I don't care if you ever come to our church. I'm most concerned about where you're going to spend eternity. Would I like to see them come to a church that teaches and preaches the Word of God where they can grow and learn to walk with Christ? Absolutely. But most importantly, I'm concerned about their salvation. You know, there's a lot of people today that have the perspective when we invite them to church that they just want us to go to church because we want numbers, or maybe because we're after their purse. We want their money. But no, I don't want your money. I want to tell you what God did for me and what He could do for you. And I believe this morning that if some... I don't want to be a professional Christian, can I use that term this morning? I don't want to just have a Roman's Road memorized that I just kind of wrote memorization. You know what that is? it is, right? Kids in school say the alphabet. Kids in school say this, say that. In some religious organizations, they have catechisms and they ask a question, and it's just rote religion, just rote responses. I don't want to be a rote Christian. I don't want to just go knock on somebody's door, talk to somebody at the coffee shop, interact with somebody at lunch, and just kind of feel like I'm a professional Christian. I want them to see that there's a heart of compassion, because I understand that one day they will stand before God Almighty and should cause us to weep. And perhaps this morning we just need to pray that God would give us some tears. God help us to identify more with Elisha than with Hezekiah, because when God revealed to Elisha what Hazael was going to do, the man of God wept. He wept about some physical destruction. The death of those people is no doubt a sad thing, but I would argue this morning that we're dealing with something on an entirely different plane, because we're not just dealing with physical death, we're dealing with spiritual death. Someone wrote a song a number of years ago, Lord, let us weep again. It's a powerful truth, and I just pray that God would help us. As Elisha wept, that we'd have a renewed focus. Why are we really here? Why did Hezekiah really get 15 more years? Was it just so that he could have peace and safety and have a good life? Unfortunately, he just messed up in those 15 years. Sad. His son that would follow him on the throne was born in those 15 years, who was wicked. This morning, Elisha wept. Oh, that God would help us to weep again. Let's pray. Father, we love You this morning. We thank You for loving us. God, we thank You for salvation through the Lord Jesus Christ. I could speak for myself and for many that are gathered here this morning that we've placed our faith and trust in the finished work of Christ at Calvary. We have confidence that when we take our final breath here upon this earth that we'll be immediately in Your presence, not because of any good works that we've done, not because of any merit of our own, but because Calvary covers it all. There's one here this morning on our property, one that's tuned in via live stream that's not sure of heaven. God, I pray that today they'd get it settled. I pray that You'd give us an opportunity to take a Bible and show somebody how they could know for sure that heaven is their home, not hoping, not thinking, but knowing with certainty, with 100% confidence that heaven is their home. God, I pray for those of us that are here that are saved. God, You've revealed things to us just as You revealed to Elisha and just as You revealed to Hezekiah. That which You've revealed to us is going to come to pass. God, I pray that You'd help us to go onward and forward as we sang this morning how thankful we are that we have Your own promise. You said that You would build Your church and that the gates of hell shall not prevail against it. I'm thankful that as we go onward and forward that we go with the message that Calvary covers it all. God, I just pray this morning that You'd help us to do it with tears, not to just be weepy people, but God, to have a heart of compassion for those that we know have not yet trusted Christ as their Savior. The names in our prayer list, the last time we wept over them, God, would You help us to weep again? I pray that You'd move in a way this morning that would not just have a temporary change or impact in our lives. God, I pray that You'd just renew in us, we sing that song of passion for souls. Help us to have a passion with compassion. We give You the honor and glory for every decision that is made. We pray that You'd move as only You can, for it's in Christ's name we pray. Would You stand with me? Heads are bowed, eyes are closed. We end each service with an invitation. The purpose is to give you an opportunity to respond to how the Holy Spirit has used His Word in your life. Kimberly's going to play quietly on the piano, and as she does, the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.400000095367432,
      "text": " You see in the bulletin this morning that our message for the this morning title is"
    },
    {
      "id": 1,
      "start": 4.400000095367432,
      "end": 8.199999809265137,
      "text": " this, Elisha wept, Elisha wept."
    },
    {
      "id": 2,
      "start": 8.199999809265137,
      "end": 13.359999656677246,
      "text": " I am thankful that we serve the creator God, amen."
    },
    {
      "id": 3,
      "start": 13.359999656677246,
      "end": 17.559999465942383,
      "text": " We have been created by God and we understand that he knows everything about us and he's"
    },
    {
      "id": 4,
      "start": 17.559999465942383,
      "end": 20.479999542236328,
      "text": " created us as emotional people."
    },
    {
      "id": 5,
      "start": 20.479999542236328,
      "end": 24.440000534057617,
      "text": " And we understand that many of those emotions we could look at, we could speak about many"
    },
    {
      "id": 6,
      "start": 24.440000534057617,
      "end": 30.799999237060547,
      "text": " of those emotions this morning, but here with focus on the message, I would say this,"
    },
    {
      "id": 7,
      "start": 30.799999237060547,
      "end": 37.63999938964844,
      "text": " that at times our emotions are evidenced through our tears."
    },
    {
      "id": 8,
      "start": 37.63999938964844,
      "end": 41.720001220703125,
      "text": " Sometimes that is tears of gladness and rejoicing."
    },
    {
      "id": 9,
      "start": 41.720001220703125,
      "end": 46.84000015258789,
      "text": " We find that Joseph, in fact, in the book of Genesis, there are many references in which"
    },
    {
      "id": 10,
      "start": 46.84000015258789,
      "end": 49.720001220703125,
      "text": " the Bible speaks about Joseph weeping."
    },
    {
      "id": 11,
      "start": 49.720001220703125,
      "end": 53.29999923706055,
      "text": " And you would find that he wept at the sight of his father."
    },
    {
      "id": 12,
      "start": 53.29999923706055,
      "end": 57.220001220703125,
      "text": " After all of those years of being separated, and of course all that had transpired, and"
    },
    {
      "id": 13,
      "start": 57.220001220703125,
      "end": 60.060001373291016,
      "text": " those no doubt are tears of rejoicing."
    },
    {
      "id": 14,
      "start": 60.060001373291016,
      "end": 65.26000213623047,
      "text": " We find that we would look at the word of God and we often would refer to Jeremiah as"
    },
    {
      "id": 15,
      "start": 65.26000213623047,
      "end": 66.26000213623047,
      "text": " being what?"
    },
    {
      "id": 16,
      "start": 66.26000213623047,
      "end": 67.86000061035156,
      "text": " The weeping prophet."
    },
    {
      "id": 17,
      "start": 67.86000061035156,
      "end": 72.66000366210938,
      "text": " That's oftentimes how we would refer to Jeremiah, as you read the book of Jeremiah, but especially"
    },
    {
      "id": 18,
      "start": 72.66000366210938,
      "end": 75.0,
      "text": " as you read the book of Lamentations."
    },
    {
      "id": 19,
      "start": 75.0,
      "end": 78.05999755859375,
      "text": " The book of Lamentations, God uses Jeremiah to write that book."
    },
    {
      "id": 20,
      "start": 78.05999755859375,
      "end": 82.81999969482422,
      "text": " It's just a short book and we find that he's lamenting over the destruction of Judah because"
    },
    {
      "id": 21,
      "start": 82.81999969482422,
      "end": 86.5,
      "text": " of the captivity of the Babylonians and all that took place."
    },
    {
      "id": 22,
      "start": 86.5,
      "end": 93.95999908447266,
      "text": " And in Lamentations 1 in verse number 16 we read this, for these things I weep."
    },
    {
      "id": 23,
      "start": 93.95999908447266,
      "end": 100.9000015258789,
      "text": " For these things I weep, mine eye, mine eye runneth down with water because the comforter"
    },
    {
      "id": 24,
      "start": 100.9000015258789,
      "end": 103.26000213623047,
      "text": " that should relieve my soul is far from me."
    },
    {
      "id": 25,
      "start": 103.26000213623047,
      "end": 106.86000061035156,
      "text": " My children are desolate because the enemy prevailed."
    },
    {
      "id": 26,
      "start": 106.86000061035156,
      "end": 111.81999969482422,
      "text": " We read also in Lamentations 3 in verse number 51 where the Bible says, mine eye affecteth"
    },
    {
      "id": 27,
      "start": 111.81999969482422,
      "end": 113.62000274658203,
      "text": " my heart."
    },
    {
      "id": 28,
      "start": 113.62000274658203,
      "end": 118.18000030517578,
      "text": " We think about that impact that our eye has upon our heart and then sometimes the impact"
    },
    {
      "id": 29,
      "start": 118.18000030517578,
      "end": 122.37999725341797,
      "text": " that our heart has on our eye through tears."
    },
    {
      "id": 30,
      "start": 122.37999725341797,
      "end": 129.25999450683594,
      "text": " We find that the Lord Jesus Christ, at His triumphal entry, the Bible tells us that when"
    },
    {
      "id": 31,
      "start": 129.25999450683594,
      "end": 133.9600067138672,
      "text": " He seized Jerusalem, He wept over it."
    },
    {
      "id": 32,
      "start": 133.9600067138672,
      "end": 139.97999572753906,
      "text": " You read in the book of Acts in the 20th chapter as Paul is speaking to those religious, or"
    },
    {
      "id": 33,
      "start": 140.13999938964844,
      "end": 144.94000244140625,
      "text": " excuse me, to the leaders, the church leaders there at Ephesus, of the church at Ephesus."
    },
    {
      "id": 34,
      "start": 144.94000244140625,
      "end": 146.60000610351562,
      "text": " It's recorded in Acts 20."
    },
    {
      "id": 35,
      "start": 146.60000610351562,
      "end": 152.25999450683594,
      "text": " And as he's describing his ministry, he describes it this way, I cease not to warn everyone"
    },
    {
      "id": 36,
      "start": 152.25999450683594,
      "end": 157.86000061035156,
      "text": " night and day with tears, with tears."
    },
    {
      "id": 37,
      "start": 157.86000061035156,
      "end": 162.10000610351562,
      "text": " As we look at 2 Kings chapter number 8, we read, beginning in verse number 7, the Bible"
    },
    {
      "id": 38,
      "start": 162.10000610351562,
      "end": 167.5,
      "text": " says this, and Elisha came to Damascus and Ben-Hadad, the king of Syria, was sick."
    },
    {
      "id": 39,
      "start": 167.97999572753906,
      "end": 171.82000732421875,
      "text": " And it was told him, saying, The man of God has come hither."
    },
    {
      "id": 40,
      "start": 171.82000732421875,
      "end": 176.94000244140625,
      "text": " And the king, that's Ben-Hadad, said unto Haziel, which was one of his servants, Take"
    },
    {
      "id": 41,
      "start": 176.94000244140625,
      "end": 182.4600067138672,
      "text": " a present in thine hand, and go, meet the man of God, and inquire of the Lord by him,"
    },
    {
      "id": 42,
      "start": 182.4600067138672,
      "end": 186.13999938964844,
      "text": " saying, Shall I recover of this disease?"
    },
    {
      "id": 43,
      "start": 186.13999938964844,
      "end": 191.52000427246094,
      "text": " No doubt Ben-Hadad was interested in knowing with this sickness that he had, am I going"
    },
    {
      "id": 44,
      "start": 191.52000427246094,
      "end": 192.82000732421875,
      "text": " to recover?"
    },
    {
      "id": 45,
      "start": 192.82000732421875,
      "end": 194.5,
      "text": " Am I going to get well?"
    },
    {
      "id": 46,
      "start": 194.5,
      "end": 199.75999450683594,
      "text": " And we find that Haziel goes to Elisha, the man of God, to meet him, and took a present"
    },
    {
      "id": 47,
      "start": 199.75999450683594,
      "end": 204.97999572753906,
      "text": " with him, even of every good thing of Damascus, forty camels' burden, and came and stood"
    },
    {
      "id": 48,
      "start": 204.97999572753906,
      "end": 210.5,
      "text": " before him, and said, Thy son Ben-Hadad, king of Syria, hath sent me to thee, saying, Shall"
    },
    {
      "id": 49,
      "start": 210.5,
      "end": 213.89999389648438,
      "text": " I recover of this disease?"
    },
    {
      "id": 50,
      "start": 213.89999389648438,
      "end": 218.86000061035156,
      "text": " You see, in verse number 9, the description of the size of this present, and really the"
    },
    {
      "id": 51,
      "start": 218.86000061035156,
      "end": 225.25999450683594,
      "text": " scene is set for us, and Ben-Hadad had inquired through his servant Haziel, and Haziel comes"
    },
    {
      "id": 52,
      "start": 225.25999450683594,
      "end": 229.82000732421875,
      "text": " there and he speaks to Elisha, the man of God, and here's what Elisha's message is in"
    },
    {
      "id": 53,
      "start": 229.82000732421875,
      "end": 231.13999938964844,
      "text": " verse number 10."
    },
    {
      "id": 54,
      "start": 231.13999938964844,
      "end": 239.66000366210938,
      "text": " He says, Go, say unto him, Thou mayest certainly recover, howbeit the Lord hath showed me that"
    },
    {
      "id": 55,
      "start": 239.66000366210938,
      "end": 242.6199951171875,
      "text": " he shall surely die."
    },
    {
      "id": 56,
      "start": 242.6199951171875,
      "end": 247.3000030517578,
      "text": " If you read the entirety of the passage of Scripture, you'll find that Ben-Hadad could"
    },
    {
      "id": 57,
      "start": 247.3000030517578,
      "end": 252.33999633789062,
      "text": " have recovered from the sickness that he had, but in fact what happened was Haziel"
    },
    {
      "id": 58,
      "start": 252.33999633789062,
      "end": 253.5800018310547,
      "text": " killed him."
    },
    {
      "id": 59,
      "start": 253.5800018310547,
      "end": 258.3399963378906,
      "text": " If you read in verse number 15, it says, And it came to pass in the morrow, that he, Haziel,"
    },
    {
      "id": 60,
      "start": 258.3399963378906,
      "end": 264.6400146484375,
      "text": " took a thick cloth, and dipped it in water, and spread it on his face, so that he died."
    },
    {
      "id": 61,
      "start": 264.6400146484375,
      "end": 269.6199951171875,
      "text": " And notice what the last verse, or the end of that verse says, that Haziel reigned in"
    },
    {
      "id": 62,
      "start": 269.6199951171875,
      "end": 271.79998779296875,
      "text": " his stead."
    },
    {
      "id": 63,
      "start": 271.79998779296875,
      "end": 276.6600036621094,
      "text": " In the midst of all of this, the verse by which we receive our title this morning in"
    },
    {
      "id": 64,
      "start": 276.6600036621094,
      "end": 281.7799987792969,
      "text": " the thought that I want to focus in this morning is in verse number 11."
    },
    {
      "id": 65,
      "start": 281.7799987792969,
      "end": 288.5400085449219,
      "text": " The Bible says, after he had made the declaration, Elisha, to Haziel with regard to the fact"
    },
    {
      "id": 66,
      "start": 288.5400085449219,
      "end": 293.4599914550781,
      "text": " that he could recover, but that he would surely die, it says that he settled his countenance"
    },
    {
      "id": 67,
      "start": 293.4599914550781,
      "end": 297.4200134277344,
      "text": " steadfastly until he was ashamed."
    },
    {
      "id": 68,
      "start": 297.4200134277344,
      "end": 303.05999755859375,
      "text": " Elisha looks for a lengthy period of time at Haziel, and the Bible says at the end of"
    },
    {
      "id": 69,
      "start": 303.05999755859375,
      "end": 307.7799987792969,
      "text": " verse number 11, And the man of God wept."
    },
    {
      "id": 70,
      "start": 307.7799987792969,
      "end": 310.9800109863281,
      "text": " The man of God wept."
    },
    {
      "id": 71,
      "start": 310.9800109863281,
      "end": 318.3800048828125,
      "text": " It's very interesting because in verse number 12, Haziel said, Why weepeth my Lord?"
    },
    {
      "id": 72,
      "start": 318.3800048828125,
      "end": 323.17999267578125,
      "text": " And I'm thankful for that question that Haziel asked because it's through that question that"
    },
    {
      "id": 73,
      "start": 323.17999267578125,
      "end": 330.94000244140625,
      "text": " we receive insight as to what it was that caused Elisha, the man of God, to weep."
    },
    {
      "id": 74,
      "start": 331.3399963378906,
      "end": 336.17999267578125,
      "text": " If you're taking notes this morning, consider what Elisha recognized."
    },
    {
      "id": 75,
      "start": 336.17999267578125,
      "end": 339.260009765625,
      "text": " It's provided for us here in verses 12 and 13."
    },
    {
      "id": 76,
      "start": 339.260009765625,
      "end": 340.260009765625,
      "text": " The scene is set."
    },
    {
      "id": 77,
      "start": 340.260009765625,
      "end": 344.5,
      "text": " We understand the interaction, the dialogue, as I've mentioned already, between Elisha"
    },
    {
      "id": 78,
      "start": 344.5,
      "end": 351.1400146484375,
      "text": " and Haziel with regard specifically to Ben-Hadad, but God had revealed something more to Elisha"
    },
    {
      "id": 79,
      "start": 351.1400146484375,
      "end": 354.3800048828125,
      "text": " than just the fact that Ben-Hadad would die."
    },
    {
      "id": 80,
      "start": 354.3800048828125,
      "end": 359.4599914550781,
      "text": " In fact, God had revealed to Elisha that Haziel would reign, and not only would he reign as"
    },
    {
      "id": 81,
      "start": 359.4599914550781,
      "end": 364.4200134277344,
      "text": " king of Syria, but the destruction that would be brought upon the people of God."
    },
    {
      "id": 82,
      "start": 364.4200134277344,
      "end": 369.17999267578125,
      "text": " And we find that in verse number 12, when Haziel looks back at Elisha and he sees that"
    },
    {
      "id": 83,
      "start": 369.17999267578125,
      "end": 375.5,
      "text": " Elisha, the man of God, is weeping, he says, Why weepest my Lord?"
    },
    {
      "id": 84,
      "start": 375.5,
      "end": 381.0199890136719,
      "text": " And he answered, here is the response of Elisha, the insight that we receive, and we find that"
    },
    {
      "id": 85,
      "start": 381.0199890136719,
      "end": 385.94000244140625,
      "text": " it's through this, what Elisha recognized that caused him to weep."
    },
    {
      "id": 86,
      "start": 385.94000244140625,
      "end": 392.82000732421875,
      "text": " He answered, notice in verse number 12, Because I know the evil that thou wilt do unto the"
    },
    {
      "id": 87,
      "start": 392.82000732421875,
      "end": 395.6600036621094,
      "text": " children of Israel."
    },
    {
      "id": 88,
      "start": 395.6600036621094,
      "end": 402.1400146484375,
      "text": " He says, I know the evil, Haziel, that you're going to do to the children of Israel."
    },
    {
      "id": 89,
      "start": 402.1400146484375,
      "end": 404.4599914550781,
      "text": " He says, notice what he says, how he describes it."
    },
    {
      "id": 90,
      "start": 404.4599914550781,
      "end": 410.9800109863281,
      "text": " He says, Their strongholds wilt thou set on fire."
    },
    {
      "id": 91,
      "start": 410.9800109863281,
      "end": 419.1000061035156,
      "text": " Their young men wilt thou slay with the sword, and wilt dash their children and rip up their"
    },
    {
      "id": 92,
      "start": 419.1000061035156,
      "end": 422.8999938964844,
      "text": " women with child."
    },
    {
      "id": 93,
      "start": 422.8999938964844,
      "end": 424.5400085449219,
      "text": " Wow."
    },
    {
      "id": 94,
      "start": 424.5400085449219,
      "end": 430.5,
      "text": " God had revealed this to Elisha, and as Elisha is standing there and answering the question"
    },
    {
      "id": 95,
      "start": 430.5,
      "end": 437.3800048828125,
      "text": " with regard to Ben-Hadad's health, God had not only revealed to Elisha that Haziel would"
    },
    {
      "id": 96,
      "start": 437.3800048828125,
      "end": 443.1400146484375,
      "text": " kill Ben-Hadad, but that Haziel would reign as the king, and the destruction that he would"
    },
    {
      "id": 97,
      "start": 443.1400146484375,
      "end": 445.739990234375,
      "text": " bring upon his own people."
    },
    {
      "id": 98,
      "start": 445.739990234375,
      "end": 450.1400146484375,
      "text": " He says in verse number 13, And Haziel said, But what is thy servant, a dog, that he should"
    },
    {
      "id": 99,
      "start": 450.1400146484375,
      "end": 451.1400146484375,
      "text": " do this great thing?"
    },
    {
      "id": 100,
      "start": 451.1400146484375,
      "end": 458.05999755859375,
      "text": " And Elisha answered, The Lord hath showed me that thou shalt be king over Syria."
    },
    {
      "id": 101,
      "start": 458.05999755859375,
      "end": 460.9800109863281,
      "text": " I'm thankful this morning that our God is omniscient."
    },
    {
      "id": 102,
      "start": 460.9800109863281,
      "end": 464.94000244140625,
      "text": " We spoke about that a little bit during our Sunday school hour this morning, and how that"
    },
    {
      "id": 103,
      "start": 464.94000244140625,
      "end": 469.1000061035156,
      "text": " the Lord knew their thoughts, those that were there seeking to attack and accuse the"
    },
    {
      "id": 104,
      "start": 469.1000061035156,
      "end": 470.5400085449219,
      "text": " Lord Jesus Christ."
    },
    {
      "id": 105,
      "start": 470.5400085449219,
      "end": 473.5799865722656,
      "text": " But we find here that God is omniscient."
    },
    {
      "id": 106,
      "start": 473.5799865722656,
      "end": 474.8599853515625,
      "text": " He's also eternal."
    },
    {
      "id": 107,
      "start": 474.8599853515625,
      "end": 477.0400085449219,
      "text": " He knows the end from the beginning."
    },
    {
      "id": 108,
      "start": 477.0400085449219,
      "end": 481.9800109863281,
      "text": " He is able to reveal to Elisha that which would happen in the future."
    },
    {
      "id": 109,
      "start": 481.9800109863281,
      "end": 487.1400146484375,
      "text": " He was able to not only give Elisha wisdom and insight with regard to Ben-Hadad, but"
    },
    {
      "id": 110,
      "start": 487.1400146484375,
      "end": 489.4200134277344,
      "text": " also with regard to Haziel."
    },
    {
      "id": 111,
      "start": 489.4200134277344,
      "end": 495.3800048828125,
      "text": " When we find that God had revealed this, Elisha makes it plain that it was the Lord."
    },
    {
      "id": 112,
      "start": 495.3800048828125,
      "end": 500.739990234375,
      "text": " This was not Elisha just coming up with some idea of what was going to happen."
    },
    {
      "id": 113,
      "start": 500.739990234375,
      "end": 509.3800048828125,
      "text": " The Lord God Almighty, the eternal Creator God, revealed this information to Elisha."
    },
    {
      "id": 114,
      "start": 509.3800048828125,
      "end": 516.0999755859375,
      "text": " And it was this information, what Elisha had recognized about what Haziel would do that"
    },
    {
      "id": 115,
      "start": 516.0999755859375,
      "end": 520.219970703125,
      "text": " brought him to a place of weeping."
    },
    {
      "id": 116,
      "start": 520.219970703125,
      "end": 523.6599731445312,
      "text": " It says that the man of God wept."
    },
    {
      "id": 117,
      "start": 523.6599731445312,
      "end": 532.0800170898438,
      "text": " I want you to notice that this information that is given to us, that which Elisha had"
    },
    {
      "id": 118,
      "start": 532.0800170898438,
      "end": 536.739990234375,
      "text": " recognized in verse 12 and 13, it comes to pass."
    },
    {
      "id": 119,
      "start": 536.739990234375,
      "end": 542.3400268554688,
      "text": " By the way, everything that God says comes to pass."
    },
    {
      "id": 120,
      "start": 542.3400268554688,
      "end": 547.0999755859375,
      "text": " Sometimes you read in the New Testament that phraseology, and it came to pass."
    },
    {
      "id": 121,
      "start": 547.0999755859375,
      "end": 552.260009765625,
      "text": " You read how that the Lord has given us many promises for which we ought to rejoice and"
    },
    {
      "id": 122,
      "start": 552.260009765625,
      "end": 558.7000122070312,
      "text": " be thankful for, and every one of them has either been fulfilled or will be fulfilled,"
    },
    {
      "id": 123,
      "start": 558.7000122070312,
      "end": 561.9000244140625,
      "text": " because God always does what He says He will do."
    },
    {
      "id": 124,
      "start": 561.9000244140625,
      "end": 569.0999755859375,
      "text": " And we find that here in the depth of the destruction and the sorrow that Elisha has,"
    },
    {
      "id": 125,
      "start": 569.0999755859375,
      "end": 570.7000122070312,
      "text": " we find that it came to pass."
    },
    {
      "id": 126,
      "start": 570.7000122070312,
      "end": 575.8200073242188,
      "text": " Hold your place here in 2 Kings, but I want you to turn over to chapter 10 in verse number"
    },
    {
      "id": 127,
      "start": 575.8200073242188,
      "end": 576.8200073242188,
      "text": " 32."
    },
    {
      "id": 128,
      "start": 576.8200073242188,
      "end": 582.02001953125,
      "text": " Turn over a few verses or a few pages and look here in 2 Kings chapter number 10."
    },
    {
      "id": 129,
      "start": 582.02001953125,
      "end": 588.4199829101562,
      "text": " In verse number 32, the Bible says, in those days, the Lord began to cut Israel short,"
    },
    {
      "id": 130,
      "start": 588.4199829101562,
      "end": 594.760009765625,
      "text": " and Haziel smote them in all the coast of Israel from Jordan eastward, all the land"
    },
    {
      "id": 131,
      "start": 594.760009765625,
      "end": 599.6799926757812,
      "text": " of Gilead, the Gadites, the Reubenites, the Manassites from Aurore, which is by the river"
    },
    {
      "id": 132,
      "start": 599.6799926757812,
      "end": 600.1199951171875,
      "text": " Arno."
    },
    {
      "id": 0,
      "start": 600.1199951171875,
      "end": 608.3199949264526,
      "text": " on even Gilead and Bashan. We find that, obviously, because of the sin of the people, God is allowing"
    },
    {
      "id": 1,
      "start": 608.3199949264526,
      "end": 614.8399953842163,
      "text": " this judgment to take place. And the king of Syria, this Haziel, that is the man that"
    },
    {
      "id": 2,
      "start": 614.8399953842163,
      "end": 621.4399948120117,
      "text": " is interacting with Elisha in 2 Kings 8, we find here that he smote them and all the coast"
    },
    {
      "id": 3,
      "start": 621.4399948120117,
      "end": 626.2999954223633,
      "text": " of Israel, according to verse 32. Turn over another page or two to chapter 12, and notice"
    },
    {
      "id": 4,
      "start": 626.2999954223633,
      "end": 632.1799964904785,
      "text": " as we read here in this passage of Scripture and we notice what's taking place in verse"
    },
    {
      "id": 5,
      "start": 632.1799964904785,
      "end": 638.3799934387207,
      "text": " 17. It says, Then Haziel, king of Syria, went up and fought against Gath and took it. And"
    },
    {
      "id": 6,
      "start": 638.3799934387207,
      "end": 645.2999954223633,
      "text": " Haziel set his face to go up to Jerusalem. And Jehoash, king of Judah, took all the hallowed"
    },
    {
      "id": 7,
      "start": 645.2999954223633,
      "end": 652.9399948120117,
      "text": " things that Jehoshaphat and Jehoram and Ahaziah, his father's kings of Judah, had dedicated,"
    },
    {
      "id": 8,
      "start": 652.9399948120117,
      "end": 657.3799934387207,
      "text": " and his own hallowed things and all the gold that was found in the treasures of the house"
    },
    {
      "id": 9,
      "start": 657.3799934387207,
      "end": 662.7399940490723,
      "text": " of the Lord and in the king's house, and sent it to Haziel, king of Syria, and he went away"
    },
    {
      "id": 10,
      "start": 662.7399940490723,
      "end": 668.859992980957,
      "text": " from Jerusalem. And so we find at this particular juncture, we find that Haziel had had success"
    },
    {
      "id": 11,
      "start": 668.859992980957,
      "end": 674.2999954223633,
      "text": " there at Gath, and now he sets his army in the direction of going to Jerusalem for the"
    },
    {
      "id": 12,
      "start": 674.2999954223633,
      "end": 679.2199935913086,
      "text": " purpose of destroying it and overtaking it. And the king at that time is Jehoash, and"
    },
    {
      "id": 13,
      "start": 679.2199935913086,
      "end": 684.379997253418,
      "text": " he takes all of the goods and he sends all of these goods to Haziel in order to appease"
    },
    {
      "id": 14,
      "start": 684.379997253418,
      "end": 690.5799942016602,
      "text": " him so that he would not come upon Jerusalem. And at that particular time, the Bible tells"
    },
    {
      "id": 15,
      "start": 690.5799942016602,
      "end": 695.2199935913086,
      "text": " us that he went away from Jerusalem, but I want you to understand that that did not last,"
    },
    {
      "id": 16,
      "start": 695.2199935913086,
      "end": 699.859992980957,
      "text": " for in chapter number 13, it says this in verse number 6, Nevertheless, they departed"
    },
    {
      "id": 17,
      "start": 699.859992980957,
      "end": 704.3399963378906,
      "text": " not from the sins of the house of Jeroboam, who made Israel sin, but walked therein, and"
    },
    {
      "id": 18,
      "start": 704.3399963378906,
      "end": 709.4599914550781,
      "text": " there remained the grove also in Samaria. Neither did he leave of the people of Jehoahaz,"
    },
    {
      "id": 19,
      "start": 709.4599914550781,
      "end": 714.6999969482422,
      "text": " but fifty horsemen and ten chariots and ten thousand footmen, for the king of Syria had"
    },
    {
      "id": 20,
      "start": 714.6999969482422,
      "end": 722.3399963378906,
      "text": " destroyed them and had made them like the dust by threshing.\" Who is that king of Syria?"
    },
    {
      "id": 21,
      "start": 722.3399963378906,
      "end": 729.739990234375,
      "text": " It's Haziel. God tells us, as we read through the book of 2 Kings, that that which had been"
    },
    {
      "id": 22,
      "start": 729.739990234375,
      "end": 737.1799926757812,
      "text": " revealed, that which was recognized by Elisha did indeed come to pass. We not only note"
    },
    {
      "id": 23,
      "start": 737.1799926757812,
      "end": 743.0999908447266,
      "text": " in our text of Scripture in 2 Kings chapter 8 how or what it was that Elisha recognized,"
    },
    {
      "id": 24,
      "start": 743.0999908447266,
      "end": 747.4599914550781,
      "text": " but we consider how he responded. We've already made note to this, and so I'll just quickly"
    },
    {
      "id": 25,
      "start": 747.4599914550781,
      "end": 751.8199920654297,
      "text": " rehearse it here, where the Bible says that the man of God wept. I want you to think about"
    },
    {
      "id": 26,
      "start": 751.8199920654297,
      "end": 757.3399963378906,
      "text": " that just for a moment. I want you to allow the thought of that text of Scripture to really"
    },
    {
      "id": 27,
      "start": 757.3399963378906,
      "end": 762.6599884033203,
      "text": " sink deep within your mind this morning and really to impress upon your heart the response"
    },
    {
      "id": 28,
      "start": 762.6599884033203,
      "end": 768.0999908447266,
      "text": " of Elisha to that which he had recognized. To weep is to cry, to shed tears, but the"
    },
    {
      "id": 29,
      "start": 768.0999908447266,
      "end": 774.3399963378906,
      "text": " reality is that often as we use that word weep or wept, it carries with it a greater"
    },
    {
      "id": 30,
      "start": 774.3399963378906,
      "end": 781.2599945068359,
      "text": " context than just someone crying, someone that's just shed a single tear, just got a"
    },
    {
      "id": 31,
      "start": 781.2599945068359,
      "end": 785.6199951171875,
      "text": " little emotional or choked up in dealing with something. No, the Bible says that the man"
    },
    {
      "id": 32,
      "start": 785.6199951171875,
      "end": 798.0599975585938,
      "text": " of God wept. He wept. His heart was breaking over that which had been revealed to him."
    },
    {
      "id": 33,
      "start": 798.0599975585938,
      "end": 807.0599975585938,
      "text": " And we find that that which had been revealed had a profound impact upon Elisha. The hardship,"
    },
    {
      "id": 34,
      "start": 807.0599975585938,
      "end": 815.2599945068359,
      "text": " the brutality, the destruction that would come to pass affected him. It impacted him."
    },
    {
      "id": 35,
      "start": 815.2599945068359,
      "end": 820.2599945068359,
      "text": " And he stood there and wept. I don't know how long he stood there. The Bible tells us"
    },
    {
      "id": 36,
      "start": 820.2599945068359,
      "end": 824.6199951171875,
      "text": " in verse number 11 that he settled his countenance steadfastly until he was ashamed. There was"
    },
    {
      "id": 37,
      "start": 824.6199951171875,
      "end": 829.8600006103516,
      "text": " a period of time that Elisha stood there staring at Hazio. You ever feel like somebody's staring"
    },
    {
      "id": 38,
      "start": 829.8600006103516,
      "end": 835.5800018310547,
      "text": " at you and they're just kind of looking into your soul, so to speak? They're standing there"
    },
    {
      "id": 39,
      "start": 835.5800018310547,
      "end": 842.1799926757812,
      "text": " and he begins to weep. He begins to weep. You ever been in a situation where someone's"
    },
    {
      "id": 40,
      "start": 842.1799926757812,
      "end": 848.0199890136719,
      "text": " crying and you've asked them, they're weeping, and you say, why are you weeping? That's what"
    },
    {
      "id": 41,
      "start": 848.0199890136719,
      "end": 857.3800048828125,
      "text": " happens in verse 12. Why weepeth my Lord? And he gives the answer. We've looked at it"
    },
    {
      "id": 42,
      "start": 857.3800048828125,
      "end": 862.4199829101562,
      "text": " already. But when we consider this morning, this text of Scripture from the Old Testament,"
    },
    {
      "id": 43,
      "start": 862.4199829101562,
      "end": 867.1000061035156,
      "text": " and we consider what Elisha recognized and how he responded, I want you to consider this"
    },
    {
      "id": 44,
      "start": 867.1000061035156,
      "end": 871.4199829101562,
      "text": " morning with me. I'm not going to preach short this morning. I'm just getting to the third"
    },
    {
      "id": 45,
      "start": 871.6600036621094,
      "end": 877.6600036621094,
      "text": " point. That's our longest point. I want you to consider this morning, number three, the"
    },
    {
      "id": 46,
      "start": 877.6600036621094,
      "end": 884.6600036621094,
      "text": " absence of tears. The absence of tears. I want you to think about this. Turn over to"
    },
    {
      "id": 47,
      "start": 884.8200073242188,
      "end": 891.8200073242188,
      "text": " the book of Isaiah, if you will, in the 39th chapter. Isaiah chapter 39. I want you to"
    },
    {
      "id": 48,
      "start": 891.8200073242188,
      "end": 896.1399841308594,
      "text": " look at this passage of Scripture with me. We won't take time to read all of it, but"
    },
    {
      "id": 49,
      "start": 896.1399841308594,
      "end": 901.6199951171875,
      "text": " I want you to understand what's taking place here. In this passage of Scripture, we read"
    },
    {
      "id": 50,
      "start": 901.6199951171875,
      "end": 908.260009765625,
      "text": " about Hezekiah and his interaction with the man of God, the prophet of God, Isaiah. We"
    },
    {
      "id": 51,
      "start": 908.260009765625,
      "end": 913.4199829101562,
      "text": " find that Hezekiah, we often would say that he would find himself in that category as"
    },
    {
      "id": 52,
      "start": 913.4199829101562,
      "end": 919.0199890136719,
      "text": " being basically a good king. And you read about Hezekiah. Remember, it was during his"
    },
    {
      "id": 53,
      "start": 919.0199890136719,
      "end": 923.5,
      "text": " time that the Assyrians were going to come and to try to take captive Judah. They had"
    },
    {
      "id": 54,
      "start": 923.5,
      "end": 928.5799865722656,
      "text": " already been successful in taking captive Israel, the ten tribes of the north. We find"
    },
    {
      "id": 55,
      "start": 928.5799865722656,
      "end": 935.5799865722656,
      "text": " that Hezekiah, he receives those letters and he receives all that's taking place. The threats"
    },
    {
      "id": 56,
      "start": 936.1399841308594,
      "end": 943.1399841308594,
      "text": " and just the crazy stuff that was being said to him with regard to how they would be destroyed."
    },
    {
      "id": 57,
      "start": 943.7799987792969,
      "end": 949.8599853515625,
      "text": " The people that come from Assyria, they not only try to pressure upon Hezekiah and to"
    },
    {
      "id": 58,
      "start": 949.8599853515625,
      "end": 956.8599853515625,
      "text": " cause Hezekiah to fold, but they try to impact the people. They try to cause the people to"
    },
    {
      "id": 59,
      "start": 957.3800048828125,
      "end": 962.3999938964844,
      "text": " be afraid. They tell the people, don't trust in Hezekiah. Don't allow him to influence"
    },
    {
      "id": 60,
      "start": 962.3999938964844,
      "end": 967.6600036621094,
      "text": " you to trust in God. We are mindful of the fact that Hezekiah takes those papers and"
    },
    {
      "id": 61,
      "start": 967.6600036621094,
      "end": 973.3399963378906,
      "text": " he opens them up to the Lord and he prays to God. He understands that God is the Creator"
    },
    {
      "id": 62,
      "start": 973.3399963378906,
      "end": 979.1399841308594,
      "text": " and that God is able. And let me say this, God moves and God works miraculously. And"
    },
    {
      "id": 63,
      "start": 979.1399841308594,
      "end": 986.1399841308594,
      "text": " the Assyrians are destroyed, but then Hezekiah gets sick. And we read in the beginning of"
    },
    {
      "id": 64,
      "start": 986.6999816894531,
      "end": 992.2200012207031,
      "text": " chapter 38 where the Bible says, in those days was Hezekiah sick unto death. And he"
    },
    {
      "id": 65,
      "start": 992.2200012207031,
      "end": 997.4199829101562,
      "text": " is told this by the prophet at the end of verse number 1 of Isaiah 38, thus saith the"
    },
    {
      "id": 66,
      "start": 997.4199829101562,
      "end": 1004.4199829101562,
      "text": " Lord, set thine house in order for thou shalt die and not live. And Hezekiah is saddened"
    },
    {
      "id": 67,
      "start": 1005.260009765625,
      "end": 1010.9400024414062,
      "text": " at this news and Hezekiah begins to pray and God hears the prayer and God says that He"
    },
    {
      "id": 68,
      "start": 1010.9400024414062,
      "end": 1017.9400024414062,
      "text": " would add 15 years to his life. The worst 15 years of his life. Honestly. Terrible."
    },
    {
      "id": 69,
      "start": 1020.8599853515625,
      "end": 1027.8599853515625,
      "text": " And here is what happens. The Babylonians send a group of people and Hezekiah welcomes"
    },
    {
      "id": 70,
      "start": 1028.8599853515625,
      "end": 1035.8599853515625,
      "text": " them. And Hezekiah shows them all that he has and all that is there. And after the meeting"
    },
    {
      "id": 71,
      "start": 1037.2999877929688,
      "end": 1042.2999877929688,
      "text": " with the Babylonians, we pick it up in chapter number 39 and it says this in verse 2, and"
    },
    {
      "id": 72,
      "start": 1042.2999877929688,
      "end": 1047.2200012207031,
      "text": " Hezekiah was glad of them. That's the entourage, if you will, that was sent from the king of"
    },
    {
      "id": 73,
      "start": 1047.2200012207031,
      "end": 1050.8999938964844,
      "text": " Babylon according to verse number 1. They had heard that he had been sick and he recovered"
    },
    {
      "id": 74,
      "start": 1050.8999938964844,
      "end": 1054.8200073242188,
      "text": " so they come and they had a present and he said that he was glad and he showed them the"
    },
    {
      "id": 75,
      "start": 1054.8200073242188,
      "end": 1059.6999816894531,
      "text": " house of his precious things, the silver, the gold, the spices, the precious ointment"
    },
    {
      "id": 76,
      "start": 1059.6999816894531,
      "end": 1064.8999938964844,
      "text": " and all the house of his armor and all that was found in his treasures. There was nothing"
    },
    {
      "id": 77,
      "start": 1064.8999938964844,
      "end": 1071.8999938964844,
      "text": " in his house and all his dominion that Hezekiah showed them not. Then Isaiah came. Isaiah"
    },
    {
      "id": 78,
      "start": 1072.260009765625,
      "end": 1079.260009765625,
      "text": " came and paid Hezekiah a visit in verse number 3 and it says that Isaiah says unto Hezekiah,"
    },
    {
      "id": 79,
      "start": 1079.260009765625,
      "end": 1083.3399963378906,
      "text": " what said these men and from whence came they unto thee? And Hezekiah said, they are come"
    },
    {
      "id": 80,
      "start": 1083.3800048828125,
      "end": 1088.739990234375,
      "text": " from a far country unto me, even from Babylon. Then said he, what have they seen in thine"
    },
    {
      "id": 81,
      "start": 1088.739990234375,
      "end": 1094.1799926757812,
      "text": " house? And Hezekiah answered, all that is in mine house have they seen. There is nothing"
    },
    {
      "id": 82,
      "start": 1094.1799926757812,
      "end": 1099.8200073242188,
      "text": " among my treasures that I have not showed them. In verse number 4. In verse number 5"
    },
    {
      "id": 83,
      "start": 1099.8200073242188,
      "end": 1106.8200073242188,
      "text": " the Bible says then said Isaiah to Hezekiah, hear the word of the Lord of hosts. Behold,"
    },
    {
      "id": 84,
      "start": 1107.8200073242188,
      "end": 1114.8200073242188,
      "text": " verse 6, the days come that all that is in thine house and that which thy fathers have"
    },
    {
      "id": 85,
      "start": 1117.3399658203125,
      "end": 1124.3399658203125,
      "text": " laid up in store until this day shall be carried to Babylon. Nothing shall be left, saith the"
    },
    {
      "id": 86,
      "start": 1125.0999755859375,
      "end": 1132.0999755859375,
      "text": " Lord. And of thy sons that shall issue from thee which thou shalt beget shall they take"
    },
    {
      "id": 87,
      "start": 1132.3399658203125,
      "end": 1138.1400146484375,
      "text": " away and they shall be eunuchs in the palace of the king of Babylon. Now verse 6 and 7"
    },
    {
      "id": 88,
      "start": 1138.1400146484375,
      "end": 1145.1400146484375,
      "text": " is not good news. Right? Verse 6 and 7 we could liken that to what Elisha understood"
    },
    {
      "id": 89,
      "start": 1145.2999877929688,
      "end": 1150.4600219726562,
      "text": " in 2 Kings chapter number 8. How that he understood what Hazael was going to do, the king of Syria"
    },
    {
      "id": 90,
      "start": 1150.4600219726562,
      "end": 1155.3800048828125,
      "text": " to the people of God and the brutality and the destruction, the way in which God reveals"
    },
    {
      "id": 91,
      "start": 1155.3800048828125,
      "end": 1159.6599731445312,
      "text": " to him that the strongholds would be burned, the young men would be slain, the children"
    },
    {
      "id": 92,
      "start": 1159.7000122070312,
      "end": 1164.2999877929688,
      "text": " would be dashed and they would rip up the women with child and God revealed that to"
    },
    {
      "id": 93,
      "start": 1164.2999877929688,
      "end": 1170.6599731445312,
      "text": " him and here Hezekiah the king of Judah is given this revelation, he's given this information"
    },
    {
      "id": 94,
      "start": 1170.6599731445312,
      "end": 1176.7000122070312,
      "text": " from Hezekiah that listen, excuse me, Hezekiah receives it from Isaiah that everything that"
    },
    {
      "id": 95,
      "start": 1176.7000122070312,
      "end": 1181.260009765625,
      "text": " they've seen is going to be carried to Babylon. Nothing shall be left and by the way your"
    },
    {
      "id": 96,
      "start": 1181.260009765625,
      "end": 1188.260009765625,
      "text": " sons that shall issue from you, they're going to become eunuchs in the palace of Babylon."
    },
    {
      "id": 97,
      "start": 1189.260009765625,
      "end": 1196.260009765625,
      "text": " Notice Hezekiah's response in verse number 8. Then said Hezekiah to Isaiah, good is the"
    },
    {
      "id": 98,
      "start": 1196.3800048828125,
      "end": 1203.3800048828125,
      "text": " word of the Lord which thou hast spoken. He said moreover, good is the word of the Lord"
    },
    {
      "id": 0,
      "start": 1203.3800048828125,
      "end": 1210.6200046539307,
      "text": " over, for there shall be peace and truth in my days.\""
    },
    {
      "id": 1,
      "start": 1210.6200046539307,
      "end": 1214.8600044250488,
      "text": " Does that not bother you?"
    },
    {
      "id": 2,
      "start": 1214.8600044250488,
      "end": 1220.9400043487549,
      "text": " The response of Hezekiah is not to weep."
    },
    {
      "id": 3,
      "start": 1220.9400043487549,
      "end": 1225.4200057983398,
      "text": " The response of Hezekiah is not to beg God to intercede."
    },
    {
      "id": 4,
      "start": 1225.4200057983398,
      "end": 1230.9000053405762,
      "text": " Oh, when he was told that he was going to die in Isaiah chapter 38, in verse number"
    },
    {
      "id": 5,
      "start": 1230.9000053405762,
      "end": 1238.2200050354004,
      "text": " four, and let me back up, in verse number three, and said, remember now, oh Lord, he's"
    },
    {
      "id": 6,
      "start": 1238.2200050354004,
      "end": 1240.3400039672852,
      "text": " coming and he's praying to the Lord."
    },
    {
      "id": 7,
      "start": 1240.3400039672852,
      "end": 1243.740005493164,
      "text": " According to verse number two, he turned his face to the wall and he prayed unto the Lord"
    },
    {
      "id": 8,
      "start": 1243.740005493164,
      "end": 1248.740005493164,
      "text": " and he says this, in verse number three, remember now, oh Lord, I beseech thee, how I have walked"
    },
    {
      "id": 9,
      "start": 1248.740005493164,
      "end": 1252.8200035095215,
      "text": " before thee in truth and with a perfect heart and have done that which is good in thy sight."
    },
    {
      "id": 10,
      "start": 1252.8200035095215,
      "end": 1259.9400062561035,
      "text": " And Hezekiah wept sore because he was going to die."
    },
    {
      "id": 11,
      "start": 1259.9400062561035,
      "end": 1264.5000038146973,
      "text": " God says in verse number three, verse number four, excuse me, then came the word of the"
    },
    {
      "id": 12,
      "start": 1264.5000038146973,
      "end": 1269.5000076293945,
      "text": " Lord unto Isaiah saying, go and show to Hezekiah, say to Hezekiah, thus saith the Lord the God"
    },
    {
      "id": 13,
      "start": 1269.5000076293945,
      "end": 1274.9400024414062,
      "text": " of David thy father, I have heard thy prayer, notice this, I have seen thy tears, behold,"
    },
    {
      "id": 14,
      "start": 1274.9400024414062,
      "end": 1277.7000045776367,
      "text": " I will add unto thy days fifteen years."
    },
    {
      "id": 15,
      "start": 1277.7000045776367,
      "end": 1285.1000061035156,
      "text": " But in chapter 39, the Babylonians are going to come and they're going to take everything."
    },
    {
      "id": 16,
      "start": 1285.1000061035156,
      "end": 1286.9800033569336,
      "text": " Nothing is going to be left."
    },
    {
      "id": 17,
      "start": 1287.020004272461,
      "end": 1291.7000045776367,
      "text": " Their sons are going to become eunuchs in the palace of Babylon."
    },
    {
      "id": 18,
      "start": 1291.7000045776367,
      "end": 1297.020004272461,
      "text": " And Hezekiah says, good is the word of the Lord, there'll be peace in my day."
    },
    {
      "id": 19,
      "start": 1297.020004272461,
      "end": 1300.7800064086914,
      "text": " Does that not baffle your mind?"
    },
    {
      "id": 20,
      "start": 1300.7800064086914,
      "end": 1307.4600067138672,
      "text": " The absence of tears on the part of Hezekiah."
    },
    {
      "id": 21,
      "start": 1307.4600067138672,
      "end": 1313.1800079345703,
      "text": " If we'd be honest this morning, I make the application for us today."
    },
    {
      "id": 22,
      "start": 1313.1800079345703,
      "end": 1318.7000045776367,
      "text": " I believe in many of our lives, in many of our churches across this land, in fact in"
    },
    {
      "id": 23,
      "start": 1318.7000045776367,
      "end": 1326.3400039672852,
      "text": " many of our churches across this globe, I believe there's an absence of tears."
    },
    {
      "id": 24,
      "start": 1326.3400039672852,
      "end": 1336.1000061035156,
      "text": " There's an absence of allowing the truth that God has revealed to us to truly impact us."
    },
    {
      "id": 25,
      "start": 1336.1000061035156,
      "end": 1342.9000091552734,
      "text": " The reality is that Elisha hears about physical destruction that's going to take place at"
    },
    {
      "id": 26,
      "start": 1343.6200103759766,
      "end": 1344.6200103759766,
      "text": " the hands of Hazael, king of Syria."
    },
    {
      "id": 27,
      "start": 1344.6200103759766,
      "end": 1351.7799987792969,
      "text": " The man of God wept."
    },
    {
      "id": 28,
      "start": 1351.7799987792969,
      "end": 1358.1000061035156,
      "text": " What was it that caused Hezekiah to weep his own death being announced?"
    },
    {
      "id": 29,
      "start": 1358.1000061035156,
      "end": 1365.4600067138672,
      "text": " But at the destruction of the people and the carrying away into captivity, he wept not."
    },
    {
      "id": 30,
      "start": 1365.4600067138672,
      "end": 1372.7799987792969,
      "text": " This morning, I think about what God's word has revealed to us as the people of God today,"
    },
    {
      "id": 31,
      "start": 1373.020004272461,
      "end": 1378.4199981689453,
      "text": " just as God had revealed through the prophets and to Elisha the prophet, and then through"
    },
    {
      "id": 32,
      "start": 1378.4199981689453,
      "end": 1383.6200103759766,
      "text": " the prophet Isaiah to Hezekiah, He had revealed to those men what would happen, what would"
    },
    {
      "id": 33,
      "start": 1383.6200103759766,
      "end": 1385.5400085449219,
      "text": " come to pass."
    },
    {
      "id": 34,
      "start": 1385.5400085449219,
      "end": 1391.4199981689453,
      "text": " Can I tell you this morning that God has given us truth with regard to what's going to come"
    },
    {
      "id": 35,
      "start": 1391.4199981689453,
      "end": 1395.5800018310547,
      "text": " to pass."
    },
    {
      "id": 36,
      "start": 1395.5800018310547,
      "end": 1401.3000030517578,
      "text": " As we look to the word of God, and I think this morning specifically about the truth"
    },
    {
      "id": 37,
      "start": 1401.3400115966797,
      "end": 1408.1399993896484,
      "text": " of the reality of the lake of fire."
    },
    {
      "id": 38,
      "start": 1408.1399993896484,
      "end": 1413.740005493164,
      "text": " The word of God refers to it as the second death, the great white throne judgment."
    },
    {
      "id": 39,
      "start": 1413.740005493164,
      "end": 1420.5400085449219,
      "text": " This morning, the truth is that that will come to pass, and every single lost person"
    },
    {
      "id": 40,
      "start": 1420.5400085449219,
      "end": 1425.8200073242188,
      "text": " that you know and every single lost person that I know is going to stand at the great"
    },
    {
      "id": 41,
      "start": 1425.8200073242188,
      "end": 1427.3000030517578,
      "text": " white throne."
    },
    {
      "id": 42,
      "start": 1427.3000030517578,
      "end": 1428.7799987792969,
      "text": " Look at it in Revelation 20."
    },
    {
      "id": 43,
      "start": 1429.3400115966797,
      "end": 1434.3000030517578,
      "text": " I'll be honest with you, I hate reading this passage of Scripture publicly, but I'm going"
    },
    {
      "id": 44,
      "start": 1434.3000030517578,
      "end": 1438.4199981689453,
      "text": " to."
    },
    {
      "id": 45,
      "start": 1438.4199981689453,
      "end": 1452.9000091552734,
      "text": " I don't much enjoy reading it privately."
    },
    {
      "id": 46,
      "start": 1452.9000091552734,
      "end": 1462.3000183105469,
      "text": " In Revelation 20 and verse number 11, the Bible begins by saying this, and I saw a great"
    },
    {
      "id": 47,
      "start": 1462.3000183105469,
      "end": 1469.9800109863281,
      "text": " white throne, and him that sat on it from whose face the earth and the heaven fled away,"
    },
    {
      "id": 48,
      "start": 1469.9800109863281,
      "end": 1473.3399963378906,
      "text": " and there was found no place for them."
    },
    {
      "id": 49,
      "start": 1473.3399963378906,
      "end": 1479.8200073242188,
      "text": " I saw the dead, small and great, stand before God, and the books were opened and another"
    },
    {
      "id": 50,
      "start": 1479.8600158691406,
      "end": 1484.7799987792969,
      "text": " book was opened, which is the book of life, and the dead were judged out of those things"
    },
    {
      "id": 51,
      "start": 1484.7799987792969,
      "end": 1490.1000061035156,
      "text": " which were written in the books according to their works, and the sea gave up the dead"
    },
    {
      "id": 52,
      "start": 1490.1000061035156,
      "end": 1496.3800048828125,
      "text": " which were in it, and death and hell delivered up the dead which were in them, and they were"
    },
    {
      "id": 53,
      "start": 1496.3800048828125,
      "end": 1501.1400146484375,
      "text": " judged every man according to their works."
    },
    {
      "id": 54,
      "start": 1501.1400146484375,
      "end": 1507.5400085449219,
      "text": " And death and hell were cast in the lake of fire, this is the second death, and whosoever"
    },
    {
      "id": 55,
      "start": 1507.5400085449219,
      "end": 1515.1400146484375,
      "text": " was not found written in the book of life was cast into the lake of fire."
    },
    {
      "id": 56,
      "start": 1515.1400146484375,
      "end": 1521.8600158691406,
      "text": " Now often this morning as we think about this truth, for ourselves maybe we think about"
    },
    {
      "id": 57,
      "start": 1521.8600158691406,
      "end": 1527.3399963378906,
      "text": " verse number 6 of Revelation 20, but the Bible says, blessed and holy is he that hath part"
    },
    {
      "id": 58,
      "start": 1527.3399963378906,
      "end": 1533.1799926757812,
      "text": " in the first resurrection, on such the second death hath no power, but they shall be priests"
    },
    {
      "id": 59,
      "start": 1533.1799926757812,
      "end": 1536.8999938964844,
      "text": " of God and of Christ and shall reign with him a thousand years."
    },
    {
      "id": 60,
      "start": 1536.8999938964844,
      "end": 1541.1000061035156,
      "text": " I'm thankful this morning that I've been saved by the blood of Jesus Christ, and I'm"
    },
    {
      "id": 61,
      "start": 1541.1000061035156,
      "end": 1547.3999938964844,
      "text": " thankful this morning that the second death has no power over me, but there are countless"
    },
    {
      "id": 62,
      "start": 1547.3999938964844,
      "end": 1555.7000122070312,
      "text": " millions of people that do not know the Lord Jesus Christ as their personal Savior."
    },
    {
      "id": 63,
      "start": 1555.7000122070312,
      "end": 1562.3800048828125,
      "text": " Some of the people that you work with, some of the people that you live next to, some"
    },
    {
      "id": 64,
      "start": 1562.3800048828125,
      "end": 1567.02001953125,
      "text": " of the people that we see throughout the community."
    },
    {
      "id": 65,
      "start": 1567.02001953125,
      "end": 1572.6600036621094,
      "text": " The reality is that one day, we don't know the day, we know that the great white throne"
    },
    {
      "id": 66,
      "start": 1572.6600036621094,
      "end": 1577.5800170898438,
      "text": " judgment is at least a thousand and seven years away because of the tribulation and"
    },
    {
      "id": 67,
      "start": 1577.5800170898438,
      "end": 1583.6600036621094,
      "text": " the millennial reign of Christ, but that is if the Lord returned at this moment."
    },
    {
      "id": 68,
      "start": 1583.6600036621094,
      "end": 1591.5,
      "text": " So we don't know how long it is until this event takes place, but we know that just as"
    },
    {
      "id": 69,
      "start": 1591.5,
      "end": 1596.6600036621094,
      "text": " the case was with Hazael, it came to pass."
    },
    {
      "id": 70,
      "start": 1596.6600036621094,
      "end": 1601.1400146484375,
      "text": " Just as the case is with the Babylonians, you can read of the Babylonian captivity and"
    },
    {
      "id": 71,
      "start": 1601.1400146484375,
      "end": 1606.760009765625,
      "text": " all that they did in the destruction of Judah and the carrying away of the people."
    },
    {
      "id": 72,
      "start": 1606.760009765625,
      "end": 1612.739990234375,
      "text": " You can understand this morning that this too, this truth of Revelation 20 is going"
    },
    {
      "id": 73,
      "start": 1612.739990234375,
      "end": 1614.739990234375,
      "text": " to come to pass."
    },
    {
      "id": 74,
      "start": 1614.739990234375,
      "end": 1620.0599975585938,
      "text": " And I want you to think about this as you go into the 21st chapter of the book of Revelation."
    },
    {
      "id": 75,
      "start": 1620.1000061035156,
      "end": 1623.4599914550781,
      "text": " I'm not going to read much except for one verse here in verse number four, and I just"
    },
    {
      "id": 76,
      "start": 1623.4599914550781,
      "end": 1627.2200012207031,
      "text": " want to read really the first part of the verse because I want you to see what the Bible"
    },
    {
      "id": 77,
      "start": 1627.2200012207031,
      "end": 1628.2200012207031,
      "text": " says."
    },
    {
      "id": 78,
      "start": 1628.2200012207031,
      "end": 1636.0599975585938,
      "text": " And God shall wipe away all tears from their eyes."
    },
    {
      "id": 79,
      "start": 1636.0599975585938,
      "end": 1639.02001953125,
      "text": " Continues and says, there shall be no more death, neither sorrow nor crying, neither"
    },
    {
      "id": 80,
      "start": 1639.02001953125,
      "end": 1641.9400024414062,
      "text": " shall there be any more pain, for the former things are passed away."
    },
    {
      "id": 81,
      "start": 1641.9400024414062,
      "end": 1646.4800109863281,
      "text": " I want you to think about that first phrase in verse number four where it says, God shall"
    },
    {
      "id": 82,
      "start": 1646.4800109863281,
      "end": 1649.9400024414062,
      "text": " wipe away all tears from their eyes."
    },
    {
      "id": 83,
      "start": 1649.9400024414062,
      "end": 1653.6600036621094,
      "text": " I believe that as you look at the text of Scripture and you understand the events that"
    },
    {
      "id": 84,
      "start": 1653.6600036621094,
      "end": 1657.5,
      "text": " are taking place, I believe that believers will be at the great white throne of judgment"
    },
    {
      "id": 85,
      "start": 1657.5,
      "end": 1663.02001953125,
      "text": " not to be judged, but will be there."
    },
    {
      "id": 86,
      "start": 1663.02001953125,
      "end": 1666.8600158691406,
      "text": " And why is it that Revelation 21 and verse number four says that God shall wipe away"
    },
    {
      "id": 87,
      "start": 1666.8600158691406,
      "end": 1668.739990234375,
      "text": " all the tears?"
    },
    {
      "id": 88,
      "start": 1668.739990234375,
      "end": 1676.8200073242188,
      "text": " Because I think there's going to be a lot of believers that are going to be weeping."
    },
    {
      "id": 89,
      "start": 1676.8999938964844,
      "end": 1681.4599914550781,
      "text": " The issue is that we ought to be weeping right now."
    },
    {
      "id": 90,
      "start": 1681.4599914550781,
      "end": 1684.739990234375,
      "text": " I wonder as we look at our prayer bulletin, when's the last time we've wept over some"
    },
    {
      "id": 91,
      "start": 1684.739990234375,
      "end": 1690.4599914550781,
      "text": " of the names in that prayer bulletin, people that are lost that we know."
    },
    {
      "id": 92,
      "start": 1690.4599914550781,
      "end": 1695.8800048828125,
      "text": " We have specific names on our prayer bulletin because they're specific people that we know."
    },
    {
      "id": 93,
      "start": 1695.8800048828125,
      "end": 1699.4599914550781,
      "text": " Maybe not every single one of us know them personally, but somebody within our congregation"
    },
    {
      "id": 94,
      "start": 1699.4599914550781,
      "end": 1702.4200134277344,
      "text": " knows them personally and we pray for them."
    },
    {
      "id": 95,
      "start": 1703.4200134277344,
      "end": 1708.6600036621094,
      "text": " I want you to think about this truth as we...I've asked myself this question, how can we have"
    },
    {
      "id": 96,
      "start": 1708.6600036621094,
      "end": 1710.5800170898438,
      "text": " dry eyes?"
    },
    {
      "id": 97,
      "start": 1710.5800170898438,
      "end": 1716.6199951171875,
      "text": " How can we respond like Hezekiah did and say, well, it's good for us?"
    },
    {
      "id": 98,
      "start": 1716.6199951171875,
      "end": 1721.52001953125,
      "text": " Sometimes we get this perspective of life and maybe we just get so consumed with what's"
    },
    {
      "id": 99,
      "start": 1721.52001953125,
      "end": 1725.5,
      "text": " going on and the routine and the monotony of life and just all that's taking place,"
    },
    {
      "id": 100,
      "start": 1725.5,
      "end": 1729.8200073242188,
      "text": " and we're not even mindful of the fact that these people are going to die and go to a"
    },
    {
      "id": 101,
      "start": 1729.8200073242188,
      "end": 1730.8200073242188,
      "text": " Christless eternity."
    },
    {
      "id": 102,
      "start": 1730.8200073242188,
      "end": 1737.4199829101562,
      "text": " They're going to be cast into the lake of fire forever, it's not just for a period of"
    },
    {
      "id": 103,
      "start": 1737.4199829101562,
      "end": 1742.2200317382812,
      "text": " time, it's for all of eternity."
    },
    {
      "id": 104,
      "start": 1742.2200317382812,
      "end": 1750.2999877929688,
      "text": " And how can we that know the truth not really be impacted by it?"
    },
    {
      "id": 105,
      "start": 1750.2999877929688,
      "end": 1753.739990234375,
      "text": " Should it not cause us as it caused Elisha to weep?"
    },
    {
      "id": 106,
      "start": 1753.739990234375,
      "end": 1762.3800048828125,
      "text": " I want you to notice the testimony of the Apostle Paul in the book of Romans."
    },
    {
      "id": 107,
      "start": 1762.3800048828125,
      "end": 1770.6199951171875,
      "text": " Paul, of course, I mentioned already in Acts 20 by way of introduction, how that he speaks"
    },
    {
      "id": 108,
      "start": 1770.6199951171875,
      "end": 1775.9400024414062,
      "text": " about his ministry there in Ephesus and he's speaking to the church leaders of Ephesus"
    },
    {
      "id": 109,
      "start": 1775.9400024414062,
      "end": 1782.3200073242188,
      "text": " and he says that, I cease not to warn everyone night and day with tears."
    },
    {
      "id": 110,
      "start": 1782.3200073242188,
      "end": 1787.9600219726562,
      "text": " Why did Paul cease not to warn night and day?"
    },
    {
      "id": 111,
      "start": 1787.9600219726562,
      "end": 1790.280029296875,
      "text": " And why did he have tears?"
    },
    {
      "id": 112,
      "start": 1790.280029296875,
      "end": 1793.52001953125,
      "text": " Because God had revealed some things to him."
    },
    {
      "id": 113,
      "start": 1793.52001953125,
      "end": 1796.9199829101562,
      "text": " God had revealed to him the truth of salvation through the Lord Jesus Christ."
    },
    {
      "id": 114,
      "start": 1796.9199829101562,
      "end": 1802.0,
      "text": " Listen, there's no other name under heaven whereby we must be saved, right?"
    },
    {
      "id": 115,
      "start": 1802.0,
      "end": 1803.3599853515625,
      "text": " Neither is there salvation in any other name."
    },
    {
      "id": 0,
      "start": 1803.3599853515625,
      "end": 1805.6799852848053,
      "text": " other name, the name of Jesus."
    },
    {
      "id": 1,
      "start": 1805.6799852848053,
      "end": 1808.1999855041504,
      "text": " Jesus said, I am the way, the truth, and the life."
    },
    {
      "id": 2,
      "start": 1808.1999855041504,
      "end": 1811.3199853897095,
      "text": " No man cometh unto the Father but by me."
    },
    {
      "id": 3,
      "start": 1811.3199853897095,
      "end": 1817.3199853897095,
      "text": " In Romans 9, I want you to see the heart, if you will, of Paul as he's sharing here"
    },
    {
      "id": 4,
      "start": 1817.3199853897095,
      "end": 1820.9199848175049,
      "text": " and speaking about his own perspective."
    },
    {
      "id": 5,
      "start": 1820.9199848175049,
      "end": 1825.9599857330322,
      "text": " He says, I say the truth in Christ, I lie not, my conscience also bearing me witness"
    },
    {
      "id": 6,
      "start": 1825.9599857330322,
      "end": 1827.6799850463867,
      "text": " in the Holy Ghost."
    },
    {
      "id": 7,
      "start": 1827.6799850463867,
      "end": 1832.639986038208,
      "text": " We know that all Scripture is given by inspiration of God, and we understand that God is recording"
    },
    {
      "id": 8,
      "start": 1832.639986038208,
      "end": 1837.8799858093262,
      "text": " this, and these are the thoughts, this is the heart of Paul as he's sharing with these"
    },
    {
      "id": 9,
      "start": 1837.8799858093262,
      "end": 1838.8799858093262,
      "text": " believers."
    },
    {
      "id": 10,
      "start": 1838.8799858093262,
      "end": 1845.499984741211,
      "text": " And he's saying, I'm telling you the truth, I'm not just trying to sound good here."
    },
    {
      "id": 11,
      "start": 1845.499984741211,
      "end": 1852.1999855041504,
      "text": " He says that I have, notice what he says in verse number 2, I have great heaviness and"
    },
    {
      "id": 12,
      "start": 1852.1999855041504,
      "end": 1857.5199851989746,
      "text": " continual sorrow in my heart."
    },
    {
      "id": 13,
      "start": 1857.5199851989746,
      "end": 1859.1399841308594,
      "text": " Why Paul?"
    },
    {
      "id": 14,
      "start": 1859.1399841308594,
      "end": 1865.7799835205078,
      "text": " I know that the word weep or tears is not mentioned there, but in my mind this morning,"
    },
    {
      "id": 15,
      "start": 1865.7799835205078,
      "end": 1871.4199829101562,
      "text": " I think that this man that has great heaviness and continual sorrow in his heart, I believe"
    },
    {
      "id": 16,
      "start": 1871.4199829101562,
      "end": 1874.099983215332,
      "text": " there were tears that were shed."
    },
    {
      "id": 17,
      "start": 1874.099983215332,
      "end": 1879.4399871826172,
      "text": " As he said to the believers at Ephesus, I cease not to warn night and day with tears,"
    },
    {
      "id": 18,
      "start": 1879.4399871826172,
      "end": 1882.339988708496,
      "text": " no doubt he's got tears."
    },
    {
      "id": 19,
      "start": 1882.339988708496,
      "end": 1888.1399841308594,
      "text": " And it tells us in verse number 3, for I could wish that myself were accursed from"
    },
    {
      "id": 20,
      "start": 1888.1399841308594,
      "end": 1894.9799880981445,
      "text": " Christ for my brethren, my kinsmen according to the flesh."
    },
    {
      "id": 21,
      "start": 1894.9799880981445,
      "end": 1902.3199844360352,
      "text": " Chapter 10 in verse number 1, notice what he says, brethren, my heart's desire and prayer"
    },
    {
      "id": 22,
      "start": 1902.3199844360352,
      "end": 1909.5799865722656,
      "text": " to God for Israel is that they might be saved."
    },
    {
      "id": 23,
      "start": 1909.5799865722656,
      "end": 1913.2999877929688,
      "text": " Paul's desire was for people to be saved."
    },
    {
      "id": 24,
      "start": 1913.2999877929688,
      "end": 1920.5399856567383,
      "text": " He has, he's called, he's known as the apostle to the Gentiles, right, to the uncircumcision."
    },
    {
      "id": 25,
      "start": 1920.5399856567383,
      "end": 1925.8199844360352,
      "text": " We understand that, he mentions that in the book of Galatians, but he himself is Jewish."
    },
    {
      "id": 26,
      "start": 1925.8199844360352,
      "end": 1931.4199829101562,
      "text": " And being Jewish, he says, I have this great sorrow and this continual sorrow, this heaviness"
    },
    {
      "id": 27,
      "start": 1931.4199829101562,
      "end": 1932.4199829101562,
      "text": " in my heart."
    },
    {
      "id": 28,
      "start": 1932.4199829101562,
      "end": 1933.4199829101562,
      "text": " Why?"
    },
    {
      "id": 29,
      "start": 1933.4199829101562,
      "end": 1935.8599853515625,
      "text": " Because I want them to be saved."
    },
    {
      "id": 30,
      "start": 1935.8599853515625,
      "end": 1942.0199890136719,
      "text": " Because I know that just because they're Jewish doesn't mean they're right with God."
    },
    {
      "id": 31,
      "start": 1942.0199890136719,
      "end": 1947.0599822998047,
      "text": " Just because they have that heritage, just because that's their lineage, that does not"
    },
    {
      "id": 32,
      "start": 1947.0599822998047,
      "end": 1949.6199798583984,
      "text": " give them a free pass."
    },
    {
      "id": 33,
      "start": 1949.6199798583984,
      "end": 1953.4599914550781,
      "text": " By the way, there are some people today that preach heresy on that subject, and they say"
    },
    {
      "id": 34,
      "start": 1953.4599914550781,
      "end": 1956.8599853515625,
      "text": " just because someone's Jewish means they're going to go to heaven."
    },
    {
      "id": 35,
      "start": 1956.8599853515625,
      "end": 1961.7799835205078,
      "text": " That is an error, that is not true."
    },
    {
      "id": 36,
      "start": 1961.7799835205078,
      "end": 1965.6199798583984,
      "text": " The gospel, Paul says, I am not ashamed of the gospel of Christ, it is the power of God"
    },
    {
      "id": 37,
      "start": 1965.6199798583984,
      "end": 1971.5799865722656,
      "text": " unto salvation, to the Jew first and also to the Gentile or to the Greek."
    },
    {
      "id": 38,
      "start": 1971.5799865722656,
      "end": 1972.5799865722656,
      "text": " Notice the distinction."
    },
    {
      "id": 39,
      "start": 1972.5799865722656,
      "end": 1976.6599884033203,
      "text": " He's talking about how Jesus came to his own and his own received him not."
    },
    {
      "id": 40,
      "start": 1976.6599884033203,
      "end": 1980.499984741211,
      "text": " How many times in Paul's ministry did he go and he went to the synagogue preaching to"
    },
    {
      "id": 41,
      "start": 1980.499984741211,
      "end": 1985.4199829101562,
      "text": " the Jews, but the Jews didn't want to hear it, so he goes to the Gentiles."
    },
    {
      "id": 42,
      "start": 1985.4199829101562,
      "end": 1988.739990234375,
      "text": " Over and over, you read in the book of Acts."
    },
    {
      "id": 43,
      "start": 1988.739990234375,
      "end": 1996.8199920654297,
      "text": " And so Paul is sharing his heart here for his kinsmen according to the flesh."
    },
    {
      "id": 44,
      "start": 1996.8199920654297,
      "end": 1999.2799835205078,
      "text": " Notice the depth of the heartache."
    },
    {
      "id": 45,
      "start": 1999.2799835205078,
      "end": 2003.5999908447266,
      "text": " He says that I have great heaviness in chapter 9 and verse number 2, continual sorrow in"
    },
    {
      "id": 46,
      "start": 2003.5999908447266,
      "end": 2004.8399810791016,
      "text": " my heart."
    },
    {
      "id": 47,
      "start": 2004.8399810791016,
      "end": 2010.6399841308594,
      "text": " Notice what he says, I could wish that myself were accursed from Christ for my brethren,"
    },
    {
      "id": 48,
      "start": 2010.6399841308594,
      "end": 2012.6399841308594,
      "text": " my kinsmen, according to the flesh."
    },
    {
      "id": 49,
      "start": 2012.6399841308594,
      "end": 2020.719985961914,
      "text": " I cannot fully comprehend the depth of verse number 3, I can't."
    },
    {
      "id": 50,
      "start": 2020.719985961914,
      "end": 2025.719985961914,
      "text": " I can't comprehend the depth of saying that I could wish that myself were accursed from"
    },
    {
      "id": 51,
      "start": 2025.719985961914,
      "end": 2029.0799865722656,
      "text": " Christ so that somebody else would be saved."
    },
    {
      "id": 52,
      "start": 2029.8799896240234,
      "end": 2032.6399841308594,
      "text": " Paul had a great desire to see people saved."
    },
    {
      "id": 53,
      "start": 2032.6399841308594,
      "end": 2035.6399841308594,
      "text": " What caused Paul to continue to go and preach the gospel?"
    },
    {
      "id": 54,
      "start": 2035.6399841308594,
      "end": 2040.999984741211,
      "text": " He'd go and he'd be beaten and he'd be cast out of town and suffer all sorts of persecution,"
    },
    {
      "id": 55,
      "start": 2040.999984741211,
      "end": 2046.1199798583984,
      "text": " but he'd go to the next place and he'd preach some more because he understood the truth"
    },
    {
      "id": 56,
      "start": 2046.1199798583984,
      "end": 2048.3999786376953,
      "text": " of the gospel."
    },
    {
      "id": 57,
      "start": 2048.3999786376953,
      "end": 2053.0799865722656,
      "text": " He understood the need for people to be saved."
    },
    {
      "id": 58,
      "start": 2053.0799865722656,
      "end": 2057.5999908447266,
      "text": " He said, I'm willing to endure some hardship, I'm willing to endure some opposition, I'm"
    },
    {
      "id": 59,
      "start": 2057.5999908447266,
      "end": 2063.9199829101562,
      "text": " willing to suffer some loss because my focus is on eternity."
    },
    {
      "id": 60,
      "start": 2063.9199829101562,
      "end": 2068.279998779297,
      "text": " And these people, they need Christ."
    },
    {
      "id": 61,
      "start": 2068.279998779297,
      "end": 2073.6399841308594,
      "text": " This morning as we think about the absence of tears, I've mentioned it by using the illustration"
    },
    {
      "id": 62,
      "start": 2073.6399841308594,
      "end": 2078.5999755859375,
      "text": " of Hezekiah, but I challenge ourselves to look at our own lives."
    },
    {
      "id": 63,
      "start": 2078.5999755859375,
      "end": 2081.759979248047,
      "text": " When's the last time we wept over lost souls?"
    },
    {
      "id": 64,
      "start": 2081.9199829101562,
      "end": 2090.0,
      "text": " When's the last time we wept over our country, our nation, the globe?"
    },
    {
      "id": 65,
      "start": 2090.0,
      "end": 2094.239990234375,
      "text": " Millions are dying."
    },
    {
      "id": 66,
      "start": 2094.239990234375,
      "end": 2097.5999755859375,
      "text": " Many times they die without Christ."
    },
    {
      "id": 67,
      "start": 2097.5999755859375,
      "end": 2102.0,
      "text": " I understand that we can't make anyone get saved."
    },
    {
      "id": 68,
      "start": 2102.0,
      "end": 2103.3199768066406,
      "text": " We can't make anyone get saved."
    },
    {
      "id": 69,
      "start": 2103.3199768066406,
      "end": 2109.519989013672,
      "text": " In fact, if we can force conversion, I would question if it's actually conversion, right?"
    },
    {
      "id": 70,
      "start": 2109.519989013672,
      "end": 2114.6799926757812,
      "text": " Because it's a choice."
    },
    {
      "id": 71,
      "start": 2114.6799926757812,
      "end": 2119.959991455078,
      "text": " So we can't force anyone, we can't manipulate anyone to trust Christ."
    },
    {
      "id": 72,
      "start": 2119.959991455078,
      "end": 2126.279998779297,
      "text": " But can I tell you this morning that as we look at the life of Hezekiah and we think"
    },
    {
      "id": 73,
      "start": 2126.279998779297,
      "end": 2133.0,
      "text": " about that absence of tears in contrast to the life of Elisha and the weeping over what"
    },
    {
      "id": 74,
      "start": 2133.0,
      "end": 2141.1599731445312,
      "text": " would take place, I want my life to align more with Elisha than with Hezekiah."
    },
    {
      "id": 75,
      "start": 2141.1599731445312,
      "end": 2144.0399780273438,
      "text": " I don't want my own difficulties."
    },
    {
      "id": 76,
      "start": 2144.0399780273438,
      "end": 2153.3999938964844,
      "text": " I don't want news of my own health scare to cause me to weep when I won't even weep over"
    },
    {
      "id": 77,
      "start": 2153.3999938964844,
      "end": 2154.3999938964844,
      "text": " lost souls."
    },
    {
      "id": 78,
      "start": 2154.3999938964844,
      "end": 2157.779998779297,
      "text": " Does that make sense this morning?"
    },
    {
      "id": 79,
      "start": 2157.779998779297,
      "end": 2164.8999938964844,
      "text": " But sometimes we get so self-centered and so self-focused that it's just all about what's"
    },
    {
      "id": 80,
      "start": 2164.8999938964844,
      "end": 2168.5399780273438,
      "text": " going on in my life, in my circle."
    },
    {
      "id": 81,
      "start": 2168.5399780273438,
      "end": 2173.939971923828,
      "text": " We need to kind of break that down and begin to look and see what's going to happen."
    },
    {
      "id": 82,
      "start": 2173.939971923828,
      "end": 2179.5799865722656,
      "text": " Turn over to the book of Psalms, if you will, and we'll close with this passage of Scripture."
    },
    {
      "id": 83,
      "start": 2179.5799865722656,
      "end": 2209.0999755859375,
      "text": " Psalm 126."
    },
    {
      "id": 84,
      "start": 2209.6199951171875,
      "end": 2216.6599731445312,
      "text": " I want you to notice what the Bible says in verses 5 and 6."
    },
    {
      "id": 85,
      "start": 2216.6599731445312,
      "end": 2225.6199951171875,
      "text": " They that sow in tears shall reap in joy."
    },
    {
      "id": 86,
      "start": 2225.6199951171875,
      "end": 2236.699981689453,
      "text": " He that goeth forth and weepeth, bearing precious seed, shall doubtless come again with rejoicing,"
    },
    {
      "id": 87,
      "start": 2236.699981689453,
      "end": 2240.6599731445312,
      "text": " bringing his sheaves with him."
    },
    {
      "id": 88,
      "start": 2240.6599731445312,
      "end": 2247.699981689453,
      "text": " They that sow in tears shall reap in joy."
    },
    {
      "id": 89,
      "start": 2247.699981689453,
      "end": 2249.3399963378906,
      "text": " I don't remember what year it was."
    },
    {
      "id": 90,
      "start": 2249.3399963378906,
      "end": 2254.2999877929688,
      "text": " I was just doing a quick search here on my iPad when you were turning to that passage"
    },
    {
      "id": 91,
      "start": 2254.2999877929688,
      "end": 2256.779998779297,
      "text": " of Scripture."
    },
    {
      "id": 92,
      "start": 2256.779998779297,
      "end": 2263.3799743652344,
      "text": " God gave me this poem that I wrote for one of our missions conferences a few years ago."
    },
    {
      "id": 93,
      "start": 2263.3799743652344,
      "end": 2267.5,
      "text": " I don't remember the date, but I titled the poem, and I'm not a poet, by the way."
    },
    {
      "id": 94,
      "start": 2267.5,
      "end": 2269.219970703125,
      "text": " This is the only poem I've ever written."
    },
    {
      "id": 95,
      "start": 2269.219970703125,
      "end": 2273.019989013672,
      "text": " We've got some people in our church that have written poems and they could write books of"
    },
    {
      "id": 96,
      "start": 2273.019989013672,
      "end": 2276.8999938964844,
      "text": " poems."
    },
    {
      "id": 97,
      "start": 2276.8999938964844,
      "end": 2280.8999938964844,
      "text": " Have I done my part was what I titled the poem."
    },
    {
      "id": 98,
      "start": 2280.8999938964844,
      "end": 2285.97998046875,
      "text": " Their names upon my heart, I wonder, have I done my part?"
    },
    {
      "id": 99,
      "start": 2285.97998046875,
      "end": 2288.779998779297,
      "text": " Their faces I can see."
    },
    {
      "id": 100,
      "start": 2288.779998779297,
      "end": 2291.259979248047,
      "text": " They will live eternally."
    },
    {
      "id": 101,
      "start": 2291.259979248047,
      "end": 2298.0599975585938,
      "text": " For billions have never heard the message from God's Word, how He died upon the tree"
    },
    {
      "id": 102,
      "start": 2298.0599975585938,
      "end": 2302.3799743652344,
      "text": " and rose in triumph on day three."
    },
    {
      "id": 103,
      "start": 2302.3799743652344,
      "end": 2310.699981689453,
      "text": " For boldness let us pray as we tell them of the way, the promise we must claim as the"
    },
    {
      "id": 104,
      "start": 2310.699981689453,
      "end": 2313.3399963378906,
      "text": " gospel we proclaim."
    },
    {
      "id": 105,
      "start": 2313.3399963378906,
      "end": 2320.4199829101562,
      "text": " And I'd add in that the need to weep."
    },
    {
      "id": 106,
      "start": 2320.5799560546875,
      "end": 2325.7000122070312,
      "text": " I pray that God would give us tears, seriously."
    },
    {
      "id": 107,
      "start": 2325.7000122070312,
      "end": 2334.8599853515625,
      "text": " Not to just be some weepy person that's always crying, but to truly have that heart of compassion"
    },
    {
      "id": 108,
      "start": 2334.8599853515625,
      "end": 2336.5799560546875,
      "text": " for lost souls."
    },
    {
      "id": 109,
      "start": 2336.5799560546875,
      "end": 2342.6199951171875,
      "text": " Listen, I don't want somebody to just think, you're trying to tell me this because you"
    },
    {
      "id": 110,
      "start": 2342.6199951171875,
      "end": 2345.6199951171875,
      "text": " want me to go to your church."
    },
    {
      "id": 111,
      "start": 2345.6199951171875,
      "end": 2350.8599853515625,
      "text": " I've told people, I don't care if you ever come to our church."
    },
    {
      "id": 112,
      "start": 2350.8599853515625,
      "end": 2355.3399658203125,
      "text": " I'm most concerned about where you're going to spend eternity."
    },
    {
      "id": 113,
      "start": 2355.3399658203125,
      "end": 2358.4199829101562,
      "text": " Would I like to see them come to a church that teaches and preaches the Word of God"
    },
    {
      "id": 114,
      "start": 2358.4199829101562,
      "end": 2362.3800048828125,
      "text": " where they can grow and learn to walk with Christ?"
    },
    {
      "id": 115,
      "start": 2362.3800048828125,
      "end": 2363.8200073242188,
      "text": " Absolutely."
    },
    {
      "id": 116,
      "start": 2363.8200073242188,
      "end": 2366.6199951171875,
      "text": " But most importantly, I'm concerned about their salvation."
    },
    {
      "id": 117,
      "start": 2366.6199951171875,
      "end": 2373.0999755859375,
      "text": " You know, there's a lot of people today that have the perspective when we invite them to"
    },
    {
      "id": 118,
      "start": 2373.0999755859375,
      "end": 2376.5399780273438,
      "text": " church that they just want us to go to church because we want numbers, or maybe because"
    },
    {
      "id": 119,
      "start": 2376.5399780273438,
      "end": 2378.8200073242188,
      "text": " we're after their purse."
    },
    {
      "id": 120,
      "start": 2378.8200073242188,
      "end": 2379.8200073242188,
      "text": " We want their money."
    },
    {
      "id": 121,
      "start": 2379.8200073242188,
      "end": 2383.0199584960938,
      "text": " But no, I don't want your money."
    },
    {
      "id": 122,
      "start": 2383.0199584960938,
      "end": 2389.8399658203125,
      "text": " I want to tell you what God did for me and what He could do for you."
    },
    {
      "id": 123,
      "start": 2389.8399658203125,
      "end": 2392.739990234375,
      "text": " And I believe this morning that if some..."
    },
    {
      "id": 124,
      "start": 2392.739990234375,
      "end": 2397.6199951171875,
      "text": " I don't want to be a professional Christian, can I use that term this morning?"
    },
    {
      "id": 125,
      "start": 2397.6199951171875,
      "end": 2402.97998046875,
      "text": " I don't want to just have a Roman's Road memorized that I just kind of wrote memorization."
    },
    {
      "id": 126,
      "start": 2402.97998046875,
      "end": 2403.47998046875,
      "text": " You know what that is?"
    },
    {
      "id": 0,
      "start": 2403.47998046875,
      "end": 2405.4199805259705,
      "text": " it is, right?"
    },
    {
      "id": 1,
      "start": 2405.4199805259705,
      "end": 2407.099980354309,
      "text": " Kids in school say the alphabet."
    },
    {
      "id": 2,
      "start": 2407.099980354309,
      "end": 2409.019980430603,
      "text": " Kids in school say this, say that."
    },
    {
      "id": 3,
      "start": 2409.019980430603,
      "end": 2413.139980316162,
      "text": " In some religious organizations, they have catechisms and they ask a question, and it's"
    },
    {
      "id": 4,
      "start": 2413.139980316162,
      "end": 2417.4199800491333,
      "text": " just rote religion, just rote responses."
    },
    {
      "id": 5,
      "start": 2417.4199800491333,
      "end": 2419.659980773926,
      "text": " I don't want to be a rote Christian."
    },
    {
      "id": 6,
      "start": 2419.659980773926,
      "end": 2423.2599811553955,
      "text": " I don't want to just go knock on somebody's door, talk to somebody at the coffee shop,"
    },
    {
      "id": 7,
      "start": 2423.2599811553955,
      "end": 2427.6999797821045,
      "text": " interact with somebody at lunch, and just kind of feel like I'm a professional Christian."
    },
    {
      "id": 8,
      "start": 2427.6999797821045,
      "end": 2433.2599811553955,
      "text": " I want them to see that there's a heart of compassion, because I understand that one"
    },
    {
      "id": 9,
      "start": 2433.2599811553955,
      "end": 2441.579978942871,
      "text": " day they will stand before God Almighty and should cause us to weep."
    },
    {
      "id": 10,
      "start": 2441.579978942871,
      "end": 2447.539981842041,
      "text": " And perhaps this morning we just need to pray that God would give us some tears."
    },
    {
      "id": 11,
      "start": 2447.539981842041,
      "end": 2455.879981994629,
      "text": " God help us to identify more with Elisha than with Hezekiah, because when God revealed to"
    },
    {
      "id": 12,
      "start": 2455.879981994629,
      "end": 2461.3399810791016,
      "text": " Elisha what Hazael was going to do, the man of God wept."
    },
    {
      "id": 13,
      "start": 2461.3399810791016,
      "end": 2467.9199829101562,
      "text": " He wept about some physical destruction."
    },
    {
      "id": 14,
      "start": 2467.9199829101562,
      "end": 2473.879981994629,
      "text": " The death of those people is no doubt a sad thing, but I would argue this morning that"
    },
    {
      "id": 15,
      "start": 2473.879981994629,
      "end": 2478.259979248047,
      "text": " we're dealing with something on an entirely different plane, because we're not just dealing"
    },
    {
      "id": 16,
      "start": 2478.259979248047,
      "end": 2484.279983520508,
      "text": " with physical death, we're dealing with spiritual death."
    },
    {
      "id": 17,
      "start": 2484.279983520508,
      "end": 2491.7199783325195,
      "text": " Someone wrote a song a number of years ago, Lord, let us weep again."
    },
    {
      "id": 18,
      "start": 2491.7199783325195,
      "end": 2495.379981994629,
      "text": " It's a powerful truth, and I just pray that God would help us."
    },
    {
      "id": 19,
      "start": 2495.379981994629,
      "end": 2498.9199829101562,
      "text": " As Elisha wept, that we'd have a renewed focus."
    },
    {
      "id": 20,
      "start": 2498.9199829101562,
      "end": 2500.7399826049805,
      "text": " Why are we really here?"
    },
    {
      "id": 21,
      "start": 2500.7399826049805,
      "end": 2502.9599838256836,
      "text": " Why did Hezekiah really get 15 more years?"
    },
    {
      "id": 22,
      "start": 2502.9599838256836,
      "end": 2508.6399841308594,
      "text": " Was it just so that he could have peace and safety and have a good life?"
    },
    {
      "id": 23,
      "start": 2508.9999771118164,
      "end": 2513.099983215332,
      "text": " Unfortunately, he just messed up in those 15 years."
    },
    {
      "id": 24,
      "start": 2513.099983215332,
      "end": 2515.699981689453,
      "text": " Sad."
    },
    {
      "id": 25,
      "start": 2515.699981689453,
      "end": 2522.859977722168,
      "text": " His son that would follow him on the throne was born in those 15 years, who was wicked."
    },
    {
      "id": 26,
      "start": 2522.859977722168,
      "end": 2524.9999771118164,
      "text": " This morning, Elisha wept."
    },
    {
      "id": 27,
      "start": 2524.9999771118164,
      "end": 2528.5399780273438,
      "text": " Oh, that God would help us to weep again."
    },
    {
      "id": 28,
      "start": 2528.5399780273438,
      "end": 2529.5399780273438,
      "text": " Let's pray."
    },
    {
      "id": 29,
      "start": 2529.5399780273438,
      "end": 2533.3999786376953,
      "text": " Father, we love You this morning."
    },
    {
      "id": 30,
      "start": 2533.3999786376953,
      "end": 2538.0399780273438,
      "text": " We thank You for loving us."
    },
    {
      "id": 31,
      "start": 2538.0399780273438,
      "end": 2548.8799743652344,
      "text": " God, we thank You for salvation through the Lord Jesus Christ."
    },
    {
      "id": 32,
      "start": 2548.8799743652344,
      "end": 2554.3599853515625,
      "text": " I could speak for myself and for many that are gathered here this morning that we've"
    },
    {
      "id": 33,
      "start": 2554.3599853515625,
      "end": 2559.3599853515625,
      "text": " placed our faith and trust in the finished work of Christ at Calvary."
    },
    {
      "id": 34,
      "start": 2559.3599853515625,
      "end": 2565.759979248047,
      "text": " We have confidence that when we take our final breath here upon this earth that we'll"
    },
    {
      "id": 35,
      "start": 2565.759979248047,
      "end": 2572.699981689453,
      "text": " be immediately in Your presence, not because of any good works that we've done, not because"
    },
    {
      "id": 36,
      "start": 2572.699981689453,
      "end": 2585.519973754883,
      "text": " of any merit of our own, but because Calvary covers it all."
    },
    {
      "id": 37,
      "start": 2585.519973754883,
      "end": 2589.719985961914,
      "text": " There's one here this morning on our property, one that's tuned in via live stream that's"
    },
    {
      "id": 38,
      "start": 2589.719985961914,
      "end": 2591.0799865722656,
      "text": " not sure of heaven."
    },
    {
      "id": 39,
      "start": 2591.0799865722656,
      "end": 2593.8399810791016,
      "text": " God, I pray that today they'd get it settled."
    },
    {
      "id": 40,
      "start": 2593.8399810791016,
      "end": 2597.4199829101562,
      "text": " I pray that You'd give us an opportunity to take a Bible and show somebody how they could"
    },
    {
      "id": 41,
      "start": 2597.4199829101562,
      "end": 2604.1599731445312,
      "text": " know for sure that heaven is their home, not hoping, not thinking, but knowing with certainty,"
    },
    {
      "id": 42,
      "start": 2604.1599731445312,
      "end": 2609.999984741211,
      "text": " with 100% confidence that heaven is their home."
    },
    {
      "id": 43,
      "start": 2609.999984741211,
      "end": 2617.439987182617,
      "text": " God, I pray for those of us that are here that are saved."
    },
    {
      "id": 44,
      "start": 2617.439987182617,
      "end": 2622.8399810791016,
      "text": " God, You've revealed things to us just as You revealed to Elisha and just as You revealed"
    },
    {
      "id": 45,
      "start": 2622.8399810791016,
      "end": 2626.0999755859375,
      "text": " to Hezekiah."
    },
    {
      "id": 46,
      "start": 2626.0999755859375,
      "end": 2631.279983520508,
      "text": " That which You've revealed to us is going to come to pass."
    },
    {
      "id": 47,
      "start": 2631.279983520508,
      "end": 2640.5999755859375,
      "text": " God, I pray that You'd help us to go onward and forward as we sang this morning how thankful"
    },
    {
      "id": 48,
      "start": 2640.5999755859375,
      "end": 2643.5999755859375,
      "text": " we are that we have Your own promise."
    },
    {
      "id": 49,
      "start": 2643.5999755859375,
      "end": 2649.759979248047,
      "text": " You said that You would build Your church and that the gates of hell shall not prevail"
    },
    {
      "id": 50,
      "start": 2649.759979248047,
      "end": 2652.5999755859375,
      "text": " against it."
    },
    {
      "id": 51,
      "start": 2652.5999755859375,
      "end": 2656.999984741211,
      "text": " I'm thankful that as we go onward and forward that we go with the message that Calvary covers"
    },
    {
      "id": 52,
      "start": 2656.999984741211,
      "end": 2658.5599822998047,
      "text": " it all."
    },
    {
      "id": 53,
      "start": 2658.8399810791016,
      "end": 2666.1599731445312,
      "text": " God, I just pray this morning that You'd help us to do it with tears, not to just be weepy"
    },
    {
      "id": 54,
      "start": 2666.1599731445312,
      "end": 2680.3199768066406,
      "text": " people, but God, to have a heart of compassion for those that we know have not yet trusted"
    },
    {
      "id": 55,
      "start": 2680.3199768066406,
      "end": 2682.9199829101562,
      "text": " Christ as their Savior."
    },
    {
      "id": 56,
      "start": 2682.9199829101562,
      "end": 2692.5999755859375,
      "text": " The names in our prayer list, the last time we wept over them, God, would You help us"
    },
    {
      "id": 57,
      "start": 2692.5999755859375,
      "end": 2693.5999755859375,
      "text": " to weep again?"
    },
    {
      "id": 58,
      "start": 2693.5999755859375,
      "end": 2702.759979248047,
      "text": " I pray that You'd move in a way this morning that would not just have a temporary change"
    },
    {
      "id": 59,
      "start": 2702.759979248047,
      "end": 2704.959991455078,
      "text": " or impact in our lives."
    },
    {
      "id": 60,
      "start": 2704.959991455078,
      "end": 2712.719970703125,
      "text": " God, I pray that You'd just renew in us, we sing that song of passion for souls."
    },
    {
      "id": 61,
      "start": 2712.719970703125,
      "end": 2717.6799926757812,
      "text": " Help us to have a passion with compassion."
    },
    {
      "id": 62,
      "start": 2717.6799926757812,
      "end": 2720.959991455078,
      "text": " We give You the honor and glory for every decision that is made."
    },
    {
      "id": 63,
      "start": 2720.959991455078,
      "end": 2724.999969482422,
      "text": " We pray that You'd move as only You can, for it's in Christ's name we pray."
    },
    {
      "id": 64,
      "start": 2724.999969482422,
      "end": 2725.999969482422,
      "text": " Would You stand with me?"
    },
    {
      "id": 65,
      "start": 2725.999969482422,
      "end": 2729.199981689453,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 66,
      "start": 2729.199981689453,
      "end": 2732.3199768066406,
      "text": " We end each service with an invitation."
    },
    {
      "id": 67,
      "start": 2732.3199768066406,
      "end": 2737.6399841308594,
      "text": " The purpose is to give you an opportunity to respond to how the Holy Spirit has used"
    },
    {
      "id": 68,
      "start": 2737.6399841308594,
      "end": 2740.239990234375,
      "text": " His Word in your life."
    },
    {
      "id": 69,
      "start": 2740.239990234375,
      "end": 2743.6799926757812,
      "text": " Kimberly's going to play quietly on the piano, and as she does, the altar is open."
    }
  ],
  "processed_at": "2025-04-16T15:09:38.357392"
}