{
  "video_id": "SfucrRfy8nw",
  "text": "Into the entirety of the psalm, but just want to look at these first three verses this morning and I've titled the message this praise him praise him and We sing that song what a wonderful hymn it is. How many of you know something about Fanny Crosby? What do you know about Fanny Crosby? All right, one of the first things people say she was blind, right? She's a great songwriter You know that she's the one that wrote the song praise him praise him And she's blind Praise him praise him. Listen. We have much to praise the Lord for amen Sometimes we begin to live under the circumstances We begin to get overwhelmed by the things in life and sometimes it's more We find ourselves in a position where it's easier maybe to complain Than it is to praise as we look at this passage of Scripture In fact as we read the entirety of the book of Psalms, we find it on a regular occasion We are confronted with the subject of praise It's good for us to be reminded of the importance of praise in our lives as God's people In fact as you as I I believe this morning I could say this I believe that I would be Accurate in saying this I think it's a safe assumption to say that each of us would agree this morning That God is worthy of our praise He's worthy of our worship You read the book of Revelation in chapter number four and five and begin to see the scene in heaven You begin to see how that the Lamb is being worshiped how he's being praised our Savior what a blessing and the reality is that as we look at the the Experiences that we have on life as we deal with the troubles the trials of the victories the times of triumph The reality is that we ought to be a people that praise him. I know that you're there in Psalm 34 You don't need to turn there But I want to read to you the final psalm of the book of Psalms in Psalm 150 how accurately it really summarizes Much of not the only theme but certainly a very profound thought throughout the book of Psalms that of praise The song psalmist said praise ye the Lord praise God in his sanctuary Praise him in the firmament of his power Praise him for his mighty acts praise him according to his excellent greatness Praise him with the sound of the trumpet praise him with the saw tree and harp Praise him with the timbrel and dance praise him with stringed instruments and organs Praise him upon the loud cymbals praise him upon the high sounding cymbals Then notice the final verse to this great book. Let everything that hath breath praise the Lord praise Ye the Lord Praise him praise him Psalm 34 a psalm that's ascribed to David The Bible says this I will bless the Lord at all times His praise shall continually be in my mouth My soul shall make her boast in the Lord. The humble shall hear thereof and be glad Oh Magnify the Lord with me and let us exalt his name together the word praise carries with the idea to extol in words or song to magnify to glorify on account of perfections or Excellent works now. Let me ask you based upon that definition We would easily conclude that our God is worthy of our praise. He is perfect in every way. Amen We have plenty of imperfections Yes We are imperfect people, but we serve a perfect God and I'm so thankful for the the truth of his character we think about the definition that we would to glorify an account of perfections or Excellent works in the sense of or in the case of praising our God. We praise him in both references not an or Situation, but we praise him on the account of his perfections and on his excellent works Our God is awesome. In fact, it's interesting You don't need to turn there but I will reference for you in Psalm 111 in verse number three and four the Bible says his work is honorable and glorious and His righteousness endureth forever. He hath made his wonderful works to be remembered the Lord is gracious and full of Compassion as I think about that phrase in verse number four that he hath made his wonderful works to be remembered I'm mindful of the book that we hold in our hands and the many accounts that God has given us of his wonderful works and how we can rehearse them and we can recall them and and how it causes us to understand the excellent works of our God It's interesting in Psalm 40 in verse number three the psalmist said and he hath put a new song in my mouth even praise Unto our God many shall see it and fear and shall trust in the Lord We often speak about the fact that redemption and really if you think about that Psalm in Psalm 40 how that the psalmist starts and talks about the fact that he brought me up out of in a horrible pit In verse number two out of the miry clay set my feet upon a rock established my goings Can you remember the work that God did in your life? And he says he had put a new song in my mouth. What is that new song? It's praise unto our God It's praise unto our God. I Wonder this morning There are times I shared this with someone before the service and I told him I'd mentioned it in the in the message in Kind of in the introduction this morning ever a time in your life where you just kind of Find yourself complaining about something No Let's go to another text of Scripture about being truthful. Amen, but the reality is that Complaining sometimes just comes real natural for us sometimes we live so much under the Circumstances that we just go through life and there are times in which we're not really Intending to complain we did not set out in our conversation to have a complaint session Yet we find ourselves at times as we kind of pause in the midst of that Conversation or and the things that we're saying saying man. I'm just complaining. I Wonder this morning. Do we ever catch ourselves praising? Where we didn't just like purpose to I want to have a conversation I'm gonna go talk to Michael and I'm gonna purpose to praise God as I talk to Michael See, I've planned that I've purposed that right? but what I'm asking is are there times in the midst of our Conversations we go through life as we are traveling this journey that we just catch ourselves praising God just overwhelmed with how wonderful He is And and we find that the psalmist would say Here's some things about praising the Lord and certainly we would be mindful of the importance of understanding That we are to stand in all of our God I believe this morning that we've been commanded. We've been instructed to praise the Lord Amen, we've been instructed in everything give. Thanks. This is the will of God in Christ Jesus concerning you rejoice evermore The Apostle Paul as he writes the book of Philippians He begins in the third chapter about speaking about and he says finally, but he has a whole nother chapter left And so, you know when the preacher says finally, he's not really at his last point The reality however, is that he says finally my brethren rejoice in the Lord you get to chapter number four rejoice in the Lord always and again I say rejoice and we think about this extolling and praising the Lord that we would magnify him that we would lift him up and we think about this principle of praising the Lord Certainly we find that he is worthy of it that we as his people ought to be Engaged in it and I believe this morning that the more time we spend with God The closer we draw to him the more natural that praise just kind of flows Because I'm in his presence and I'm enjoying the the the truth of who God is and I'm being reminded of his character and I'm Rejoicing and who he is and I'm praising God and I find myself praising him Why because I've been near him because I've drawn close to him and I've understood How perfect and how holy he is I've been reminded of his character I've been reminded of his works his excellent works And as I look at the truth of the Word of God and I think about the psalmist As I mentioned a moment ago about him saying that you stand in all of him It's interesting that in verse 8 of Psalm 33 the Bible says let all the earth fear the Lord Let all the inhabitants of the world stand in all of him And then the very next verse says this for he spake and it was done he commanded and it stood still obvious reference to creation I begin to think about The Lord and begin to think about praising him and the reality this morning is that we ought to praise God for who he is Amen As I enter into my prayer time on a daily basis I begin by reminding myself and rehearsing before the Lord his character traits Not because he needs to be reminded of the fact that he's holy and just and Omniscient and omnipotent and omnipresent and all of those things not that he needs to be reminded of it But you know what? I need to be reminded of it And as I begin to rehearse those things and I begin to consider the the the references in the Word of God that teach me Who he is and define for us his character It caused me to get into that spirit of praising and worshiping. Oh We ought to praise God for who he is. We ought to praise God for what he's done That song for all he's done God's done some great things for us And what a blessing to to consider the fact that we praise him not only for who he is But also for what he's done. We praise him because he is perfect. We praise him because of his excellent works. It's an it's a combination of both and we begin to get into that mindset of praising the Lord. As we look here at Psalm 34, I want to just share a couple of thoughts with you this morning. I want you to notice, number one, that the psalmist resolved to praise the Lord. I know that word resolved is a strong word. I think it's an important word. In fact, as you go throughout the book of Psalms, as you read many of the Psalms that are ascribed to David, you will see regularly this phrase, I will. And you find that there are several references to this thought, I will bless the Lord or I will praise thee. In fact, the phrase I will praise thee is referenced in those particular words over 11 times just in the Psalms. And you think about the resolve, the purpose, the commitment that the psalmist is making that he is resolved to praise the Lord. We find that he says here in verse number one, I will bless the Lord at all times. Notice the next phrase, his praise shall continually be in my mouth. My soul shall make her boast in the Lord. The humble shall hear thereof and be glad. O magnify the Lord with me and let us exalt his name together. It's interesting if you were to read Psalm 107, oftentimes we'll use a portion of the first opening of that particular passage in verse number two where the Bible says, let the redeemed of the Lord say so. And maybe we'll use that phraseology when talking about praising the Lord and giving testimony. In fact, the psalmist says, O give thanks unto the Lord for he is good, for his mercy endureth forever. Begin to think about the psalm and the truth that is captured in Psalm 107. On four occasions the psalmist says, O that men would praise the Lord for his goodness and for his wonderful works to the children of men. And this morning when we think about the truth of praise him, praise him, it should not be something that is difficult for God's people. It should not be something that you have to kind of work up, if you will, that you're gonna praise God. It ought to be a natural thing because of the time that we've spent in his presence and because of our understanding of who he is and what he's done for us. And we find that the psalmist is resolved. I like the resolve of the psalmist. I think this morning that we should say something similar. I mean, we can adopt the same words that the psalmist uses and we can have for our purpose and our resolve that I will praise the Lord. We just make that decision. We make that determination. We purpose in our hearts that we're gonna praise him. And the reality as we look at the nation of Israel, of course, we're mindful of all of the accounts and how often they are criticized for complaining. And certainly they're guilty of it. In fact, I've often shared with you that I like the word that is used often in the Old Testament to describe the complaining of God's people and it's murmur. That they were murmuring. In fact, the Bible tells us how that they were murmuring even within their tents. Now think about that. You think about that truth and the the expression of that phraseology and you think about their tents being the the place in which they would dwell. In fact, that's found in Psalm 106 and verse 25, but murmured in their tents and hearken not unto the voice of the Lord. See, the psalmist said, I'm gonna purpose. I'm gonna resolve to praise the Lord. There's some things that I understand and obviously as we think about the sweet psalmist of Israel, as we think about David and we think about his walk with God, we think about his experiences and we understand some things that have been recorded for us in the Word of God with regard to the life of David and we see the closeness that he has. And you find that David says, the Lord is my shepherd in Psalm 23. And we begin to fill your mind with those truths of the Word of God and begin to spend that time. Remember, the Psalms tell us that in his presence is fullness of joy. The reality is that there's a sense of resolve that I see here on the part of the psalmist, a sense of resolve that I need, a sense of resolve that I believe that each of us could use in our lives. In Psalm 9, I'm gonna share a number of references with you. You can turn there if you want. I'll read them to you. You don't have to take the time to try to fumble back and forth. They're all here in the book of Psalms, so we're not gonna go to all sorts of other places, at least not yet. In Psalm 9, in verse number 1, again, a psalm that is ascribed to David, the Bible says this, I will praise thee, O Lord, and then I like this phrase, with my whole heart I will show forth all thy marvelous works. Think about the wholehearted aspect that the psalmist shares with us here. It's not just a, I have to say this because duty demands it, so to speak. I have to say this because somebody's looking for a testimony. We have praise and thanksgiving type of service. In fact, during our Thanksgiving season, we have a prayer, praise, and pie service. We ask people to share testimonies. Let the redeemed of the Lord say so. Praise the Lord. It ought not to be a difficult thing. In fact, it ought to be when we take testimonies that we run out of time, amen, because there's so much to praise them for, truly. We sing the song, count your blessings, name them one by one. Dean, often as he sings that song or leads that song, he gets sidetracked and he doesn't continue leading in the time because he's going like this, right? Count your blessings. You've seen him, I've seen him do it, I know you've seen him do it. The reality is that the songwriter, through that song, is trying to remind us of the truth of Psalm 68, that he, God, hath daily loatheth us with benefits. There's so much to praise him for, and we need to resolve to praise the Lord. Psalm 69, notice what is said here by the psalmist in Psalm 69, in verse number 30. In Psalm 69, in verse number 30, the psalmist says, I will praise the name of God with a psalm and will magnify him with thanksgiving. Does our song praise God? I hope it does. I hope the songs that we sing are offering, rendering praise unto our God, reminding us of who he is, reminding us of what he's done. It's a psalm of praise. In Psalm 86, turn over several pages here and look at Psalm 86 and, again, a psalm that's ascribed to David, and we find that here in this particular psalm, he's rejoicing. Really, it's a prayer of David. He's rejoicing for how the Lord would answer his prayer and teaching him his way. He says this in verse number 12, I will praise thee, O Lord my God, with all my heart, and I will glorify thy name forevermore. In Psalm 118, again, this psalm begins with that same phraseology that we mentioned from Psalm 107, O give thanks unto the Lord for he is good, because his mercy endureth forever. But here in Psalm 118, in verse number 21, the Bible says this, I will praise thee, notice this, for thou hast heard me and art become my salvation. I want you to just pause there just for a moment. We often speak about the importance of prayer, the privilege of prayer, the fact that we can enter boldly into the throne room of God and we can bring our petitions before the Lord knowing that he hears and answers prayer. The psalmist says here, I will praise thee. Why? For thou hast heard me. The reality is that we find that Paul would say this to the believers in Philippi as he would give them the instruction of praying and giving thanks, and he would say this to these believers, and it's a great model for us to follow in Philippians 4, in verse number 6, be careful for nothing but in everything by prayer and supplication, with thanksgiving let your requests be made known unto God. See, we ought to praise God that he hears us. Yes, that he answers us, but sometimes the answer doesn't come immediately. Have you ever prayed for something that you didn't get a response immediately? But you know what? We can praise God that he heard us. Based upon the authority of the Word of God, our God hears and answers prayer. And sometimes we're good at praising God for the answer, and sometimes when we're waiting for the answer, there's not a whole lot of praise going on. We're waiting for God to answer, waiting for God to answer, waiting for God to answer. But here the psalmist says, I'm praising God because he heard my prayer. And I wonder this morning, if we just can take for a moment in our minds and in our lives today, just take a pause and just recognize what a blessing it is to know that our God hears us. You remember the situation with Elijah at Mount Carmel? He challenged all of those Baal worshippers, and he challenged them. And we find the Bible tells us if you were to read the passage of Scripture there in 1 Kings, in chapter number 18, you begin to understand all that's happening in the challenge, and you find that Elijah says to them that he'd let them go first. And here's what he says, and ye call, verse number 24, call ye on the name of your gods, and I will call on the name of the Lord. The God that answereth by fire, let him be God. And all the people answered and said, it is well spoken. that after they're crying out and they're doing all of these things and they're praying because it's a false God, they have ears but they hear not. Amen? And we find here that Elijah would pray and God answers him, but it's amazing as you look at the prayer that he prays, it's recorded for us in verse 36, and verse 37 you see the response, and I can rejoice this morning that our God hears us. He's not far off, it's not as if he's not listening to us, he hears us when we pray and we can have that assurance. What a praise him for that. Psalm 139, well let me say there in Psalm 118, look at the last couple of verses in that passage, what a great truth is given to us in verse 28 and 29, notice how he begins, Thou art my God. It's personal. He is my God. Remember we talked about the 23rd Psalm, the Lord is my shepherd. The reality this morning is that the Lord is the shepherd, he is the good shepherd, he is the chief shepherd, he is the great shepherd, those names are ascribed to him. But what a difference it makes when we say the Lord is my shepherd, that personal relationship that we have with the Lord Jesus Christ and what a blessing we find. The psalmist says, Thou art my God, notice, and I will praise thee. Thou art my God, I will exalt thee. Oh give thanks unto the Lord for he is good, for his mercy endureth forever. I wonder how often we just stop and praise God that he is mine and I am his. Now I belong to Jesus, aren't you thankful for that? He is my God. We look at the psalmist and the psalmist speaks about the fact that he is my God, my shield, my rock, my fortress, my refuge and my hiding place and how we can rejoice in all of those things, why? Because it's personal, he's my God, he is the Lord God Almighty, he is the creator of everything, the sustainer of everything, but he's my God, personally. He's not far off that he cannot be, no, no, no, he's my God. Remember as we've been studying through the book of Hebrews, we have an high priest which cannot be, which, let me read the verse, I'm going to butcher it, let me go there, Hebrews chapter number 4, in verse number 15, For we have not a high priest which cannot be touched with the feeling of our infirmities, but was in all points tempted like as we are yet without sin. We have a great high priest, he's our God. We find that the psalmist is rejoicing, he says I will praise thee in Psalm 139 and verse number 14, why? For I am wonderfully made. Notice as the psalmist would reference that truth and we would understand that we have been created by our God, that he is the creator of all and therefore we find that the psalmist says this in Psalm 139 and verse 14, I will praise thee for I am fearfully and wonderfully made, marvelous are thy works and that my soul knoweth right well. I will praise thee. So we find that the psalmist as we were to look at Psalm 34 and were to see the way in which the psalmist begins this passage of scripture with this resolve that I will bless the Lord at all times and his praise shall continually be in my mouth and we think about the subject matter of praise him, praise him and we find the psalmist as we've referenced a number of verses of scripture this morning, he has resolved to praise the Lord. Oh that we too would resolve to praise the Lord, that we would purpose, that we would determine in our lives that we're going to praise him, why? Because he's worthy of it. But we find that it doesn't end with resolve. Can I tell you that it's, there are several things that we have purposed to do in our lives no doubt that we never followed through with. So I'm going to do this and then we didn't really kind of follow through. And here we find not only did the psalmist resolve to praise the Lord but we find the psalmist regularly praised the Lord. I like the phraseology that we find in Psalm 34 when he says this, notice these words, at all times. At all times. Now we find that the New Testament puts it this way in everything, right? And by the way there in 1 Thessalonians 5 when he says in everything give thanks for this is the will of God in Christ Jesus concerning you. It's God's will that we give thanks, that we praise him, that we exalt him, that we lift him up. And we find that the psalmist says that at all times, notice he says this, his praise shall continually be in my mouth. Those are two phrases that we find here at all times and continually that should help us to understand the importance of regularly praising the Lord. When we speak about regularly praising the Lord the reality is that it ought to be done in private. Privately. Praising the Lord. But it doesn't stop in private. We ought to praise him publicly. Amen? In fact the psalmist often references the intent that he has to praise the Lord in public. In Psalm 108 in verse number 3 the psalmist says this, I will praise thee O Lord among the people and I will sing praises unto thee among the nations. See when we praise God privately it's probably going to overflow into our public praise of God. What do I mean by that? I'm so full of praising God in my private walk with him, and I'm not saying this of me, I'm saying that as we do this, as we resolve to praise the Lord, as we are regularly praising him in our time with him on a daily basis and we're standing in awe of who he is and we're mindful of his character, we're mindful of his excellent works and we're praising him, that's going to flow out publicly. I made a statement to somebody just on Friday, I know the person I was speaking to was lost. I know that. And as a question was asked of me I responded by saying this, well Lord willing this is going to, and I thought he has no idea what Lord willing even means. But I caught myself saying it. And it was kind of interesting. I've shared the gospel with the individual, I've tried to witness to him and to share the truth with him that he might be saved, and I just found myself just using that phraseology. That's a phraseology that maybe we use amongst brethren, but not so often that we use amongst heathen or lost people, why? They don't understand the phrase. What I'm saying this morning is that as we praise God privately, it will be known in our public lives. Because it just becomes an overflow. See, as believers, we don't have a situation where we have separated our lives into the sacred part of me and the social aspect or the societal aspect of my life. No, the reality is that we're Christians. And as we praise Him privately and we get full of who God is, we find that it will begin to be seen even in our public life. And by the way, that's a good thing. How are they going to know how good our God is if we don't tell them? Right? And what I mean is when it becomes a continual thing, a consistent thing in our life, when we're praising the Lord and we are able to show that people see, man, they praise the Lord. This is real. This isn't some made up thing. This isn't something that I know somebody's watching me, that I know somebody's listening, that something adverse has happened and we're going to see how they respond and we're going to make sure that we're... No. It just becomes natural. Why? Because I'm praising Him regularly. I think about the truth of praising God in times of positive circumstances. I would say this of that, it's actually kind of easy. Amen? It's kind of easy to praise God when things are going well. I mean, when things are going well and everything's good, it's kind of easy to praise God. I want to think about the situation. Turn back, if you will, to 1 Chronicles chapter 16. I want to take you back to an event in the life of David. And I want you to think about what's happening here and I want you to think about the magnitude of what's going on and the praising that's taking place and what a great time in Israel's history this is as David would lead the nation into bringing the ark back to Jerusalem. We understand that in chapter number 15, things did not go as they had planned for it to go. And we find, excuse me, in chapter number 13. In chapter number 15, the record is given of the transport and how God worked and how God was praised throughout that time. And we come to chapter 16, and the Bible begins with this phrase, so they brought the ark of God and set it in the midst of the tent that David had pitched for it. Now, this is a positive time in Israel's history. I mean, this is an exciting time. If you were to contrast what took place in chapter 13 and what now is happening in chapter 15 and 16, you would see that this is a great spiritual time of rejoicing in the nation of Israel's history. and David is leading, and the Bible tells us that the ark is now there. And it tells us in v. 4, \"...And he, David, appointed certain of the Levites to minister before the ark of the Lord, and to record, and to thank and praise the Lord God of Israel.\" V. 7, \"...Then on that day David delivered...\" Notice this word, first. There's a priority on praising. \"...Then on that day David delivered first this psalm to thank the Lord into the hand of Asaph and his brethren. Give thanks unto the Lord. Call upon His name. Make known His deeds among the people. Sing unto Him. Sing psalms unto Him. Talk ye of all His wondrous works. Glory in His holy name. Let the heart of them rejoice. Seek the Lord. Seek the Lord and His strength. Seek His face continually.\" V. 25, \"...For great is the Lord and greatly to be praised. He also is to be feared above all gods. For all the gods of the people are idols, but the Lord made the heavens.\" V. 29, \"...Give unto the Lord the glory due unto His name. Bring an offering and come before Him. Worship the Lord in the beauty of holiness, for before Him, all the earth, the world also shall be stable, that it be not moved. Let the heavens be glad, and let the earth rejoice, and let men say among the nations, The Lord reigneth. Let the sea roar, and the fullness thereof. Let the fields rejoice, and all that is therein. Then shall the trees of the woods sing out at the presence of the Lord, because He cometh to judge the earth.\" V. 34, \"...Oh, give thanks unto the Lord for He is good. For His mercy endureth forever. And say ye, Save us, O God, of our salvation, and gather us together, and deliver us from the heathen, that we may give thanks to Thy holy name, and glory in Thy praise.\" V. 36, \"...Blessed be the Lord God of Israel forever and ever.\" And all the people said, Amen, and praised the Lord. You can read many accounts such as this throughout Israel's history, where they had some amazing things happen and they responded by praising God. They saw the hand of the Lord at work. They were delivered and they were experiencing the miracles of God and they respond by praising. And what a blessing that is. That's how we ought to respond. The more challenging thing for us is to praise the Lord during times of adversity. During times of adverse circumstances. But if we're mindful of what the psalmist said in Psalm 34, when he said that he was going to praise the Lord, bless the Lord, it says at all times. At all times. Now, the reality is that we find ourselves in a situation in life that there are times in which we have those positive circumstances. It seems as if the adversity comes maybe more so than the times of not having adversity. It's in those times of adversity that we can find ourselves in a place of challenge to praise the Lord. It's in those times that we find it maybe easy to complain, to murmur, to have the, woe is me, to have the pity party kind of a situation. But the reality is that the psalmist, when he made the resolve to praise the Lord, he didn't say, I will bless the Lord when he's good to me. Because the reality is that if it were written that way, we would misunderstand that because the reality is that God is always good to us. But unfortunately, we sometimes interpret whether he's good to us or not based upon our circumstances. The Bible declares the Lord is good. We'll say something like this, all the time, God is good. Amen? God is good all the time, he really is. It's not just a cliche that we use because we understand that God has a purpose. We understand that he's sovereign and in his plan, he's working out his will. And there are times in which he's working out his will and it might require that we go through some level of adversity or difficulty. Think about the Apostle Paul in 2 Corinthians 12. He's dealing with infirmity, he's dealing with a difficulty, and he besought the Lord thrice, the Bible tells us. And the Lord's answer was what? My grace is sufficient for thee. And it's interesting as you would look at the response of the Apostle Paul in that portion of Scripture in 2 Corinthians 12, when he receives that answer, that my grace is sufficient for thee. In verse number nine, he ends by saying, most gladly therefore will I rather glory in my infirmities that the power of Christ may rest upon me. Therefore I take pleasure in infirmities, in reproaches, in necessities, in persecutions, in distresses. Notice, for Christ's sake, for when I am weak, then am I strong. There's a truth that is given to us in the book of Philippians in chapter number three. As the Apostle Paul is writing to this church in Philippi, we're going to eventually get to a passage in Acts where Paul was in Philippi. But I want you to think about Paul writing this letter back to the believers there at Philippi, and I want you to understand that as he's writing this book of rejoicing, he's writing from a place of prison, and we understand that as Paul is writing this book, that even while he was there personally ministering, he dealt with some serious adversity. There's some serious conflict in Philippi. We find that Paul is writing back to them about the importance of rejoicing and the idea of joy or rejoicing as a theme that's found throughout the book of Philippians. But it's interesting in the third chapter as we come to verse number 10, I've been guilty of only quoting a portion of this verse in Philippians 3 and verse number 10 when Paul says that I may know Him and the power of His resurrection. So you think about the power of His resurrection. I mean, it's wonderful, isn't it? I mean, we understand the resurrection is the cornerstone of our faith. We understand that if Christ be not risen, then your faith, your preaching, it's in vain. But now is Christ risen, right? That's what he says in 1 Corinthians 15. And we find here in Philippians 3, we rejoice in the fact of the power of His resurrection, but notice that the Bible says this, and the fellowship of His sufferings being made conformable unto His death. The fellowship of His sufferings. I'd rather focus upon the power of His resurrection than the fellowship of His sufferings. But think about the way in which our Savior suffered for us. You think about all that took place, how that God made Him to be sin for us who knew no sin, that we might be made the righteousness of God in Him, that we think about the things that He suffered and the things that He did. And we look here, the apostle is saying that I want to know Him and I want to know Him in the power of His resurrection, but also the fellowship of His sufferings being made conformable unto His death. I want you to think about Paul and Silas as they were there in Philippi in Acts 16. Turn back there if you will. I want you to, as we kind of conclude this morning with this thought of praising the Lord and how that we ought to resolve to praise Him, but we ought to be engaged in regularly praising the Lord. It begins in the private life of every one of God's children. As I praise Him privately, it will overflow into my public life. As I praise Him privately and publicly, as I've resolved to do so, and I'm regularly practicing, if I can use that phraseology, praising my God, and I praise Him in all situations, at all times, continually. In Acts 16, we're familiar with what's taking place here as Paul and Silas are there in Philippi and we understand that they received that direction in verse number 10, after he'd seen the vision, immediately we endeavored to go into Macedonia, assuredly gathering that the Lord had called us for to preach the Gospel unto them. We find that they come to Philippi. It was the chief city of that part of Macedonia, according to verse number 12 of our passage here in Acts 16. We find that it was there that they found Lydia, a certain woman in verse number 14, and she was baptized in her household. And we find that Paul is giving truth and it came to pass in verse 16, as we went to prayer, certain damsel possessed with a spirit of divination met us, which brought her masters much gain by soothsaying. The same followed Paul and us and cried saying, these men are the servants of the Most High God which show unto us the way of salvation. And this did she many days. But Paul being grieved, turned and said to the spirit, I command thee in the name of Jesus Christ to come out of her. And he came out the same hour. Can I tell you that the message of verse 17 was a true message. They were the men, these men, they were the servants of the Most High God. They were showing the way of salvation. But that message was coming from a wrong vessel. There's a whole message that we could develop on that single thought this morning. We find that in verse number 19, as this transpired, that the masters of this one that was crying out, this one that had the spirit of divination, this one that brought much gain by her suits, saying that when they saw that the hope of their gains was gone, that they caught Paul and Silas and drew them in the marketplace and the rulers and they brought them to the magistrates saying, these men being Jews do exceedingly trouble our city. What happened? Verse 23, and when they had laid many stripes upon them, they cast them into prison, charging the jailer to keep them safely, who having received such a charge, thrust them into the inner prison and made their feet fast in the stocks. And at midnight, we know the account, and at midnight Paul and Silas prayed and sang praises unto God. And then I noticed that last phrase, and the prisoners heard them. The prisoners heard them. I'm not sure how much the prisoners knew of what had transpired. I don't know how much they were aware of, but one thing I know is that Paul and Silas were adversely dealt with here in Philippi. We find that as they are beaten, as they are imprisoned, the Bible tells us that they not only prayed, but they sang praises. And as they sang praises, some people heard them. Now, I don't know, I've never spent a night in jail, I hope I never have to, but it would seem to me, and if you want to disagree, we can talk about it later, it would seem to me that some of those prisoners that heard them had probably been there for a period of time. Is that a safe assumption? No doubt, I'm not saying that all of them had been there for years, but some of them no doubt had been there for a period of time. And I would venture to say that for some of them that had spent some time there, they had never had a night where they heard some people singing and praising God. And I would venture to say that the Philippian jailer who knew what happened, I'd venture to say that he'd never seen anything like it either. Why? Because when God sent the earthquake, and that man was ready to kill himself, and Paul ran in and said, no, do yourself no harm, or ran out, excuse me, do yourself no harm, right? Paul, he hollered, cried with a loud voice in verse 38, 28, excuse me, do thyself no harm, for we're all here. What's the first thing that man says to him? What must I do to be saved? What must I do to be saved? See, there was an impact that their praise had. See, the reality this morning is that when we look at this passage of Scripture, and we say that the psalmist had resolved to praise the Lord, that the psalmist regularly praised the Lord, we begin to consider how this praise should look in our lives, in my life, in your life, and we begin to consider and really ask ourselves this morning as we would do some self-evaluation and examination and say, how is my praising? How many people have heard me praising versus how many people have heard me complaining? How often do my children hear me praising? How often do they hear me complaining? How often does my spouse? I mean, you get the idea. I don't have to go through every single scenario, right? You understand what I'm saying this morning. But we find that in the time of adversity, when we find that it might be a little bit difficult to praise the Lord, when we understand some things, if I go back to really my thought that the more time we spend with God, the more time we're in His presence and we're understanding His character and we're understanding His excellent works, the more natural it becomes that in times of adversity, it does not necessarily have to be a forced thing. It can still be natural. You say, how? I'm glad you asked. Let me share a verse with you in Romans chapter number 8. It's a verse that we know, but it's a verse sometimes I think that we know it better to counsel with than to practice in our lives. The truth this morning is that in time of adversity, in time of difficulty, we still ought to praise the Lord. That still would be captured in everything, right? You agree with that? At all times, continually. In Romans chapter number 8, I want you to consider this great promise in verse 28. I want you to think about these first three words, and we know. Now to know something is different than to think something. Would you agree? To know something is different than to assume something. Would you agree? Paul's not making an assumption in this verse of Scripture. Paul's not sharing a thought. I think this to be the case. Paul says, and we know, because there's something that we know about God. There's some things that we know about the character of God. There's some things that we know about the sovereignty of God. There's some things that we know about the plan of God. And so when we look at this passage of Scripture, again, Paul is the human penman that's writing these words. He's the one that we just read of in Acts 16 that experienced that adversity. By the way, he suffered many adversities. If you read the passage in 2 Corinthians chapter number 10, you can read a whole list of things that he suffered. In fact, if you read the same passage of Scripture in Philippians chapter number 3 that I shared with you in verse number 10, we find that in that same passage of Scripture, he talks about the fact that there were some things that he suffered. There were some things that he dealt with. We find that he would testify, as he's writing to Timothy, that the Lord delivered me out of them all. And we find here in Romans 8 and verse 28, and we know, all right? So we made focus on the word, no, but then I wanted you to make focus on the next phrase. And we know that, what's it say? All things, all things. Now, we could ask a young person here, does that mean everything? Well, yeah, and it's pretty simple, right? All things. So, understand, as we break down the verse of Scripture, as we think about what Paul is saying here, the truth that's being shared with us, he says we know something. We have the knowledge of this truth that he's sharing. It's not something that we think or we assume. We know that all things work together for good. You say, pastor, you don't know about my thing. I might not know about your thing, but God does. Is that fair to say? He's omniscient, right? He knows about it. And can I tell you that in the history of humankind, in over 6,000 years of human history, you are not the first one to experience your thing. Would you agree? You say, no, you don't know what I'm dealing with, pastor. There's been billions of people that have lived upon this earth. I am not the only one that's ever dealt with some difficulty, and neither are you. And I'm not trying to be, I'm trying to be facetious a little bit, but I'm trying to help us this morning. Because the reality is that sometimes we think that our particular circumstance or our particular situation is like nothing else that anyone else has ever experienced. But that's not true. It's just not true. And so we look at this and we understand that the truth that God is sharing with us is that we know that all things work together for good. To them, it says this, that love God to them who are the called according to His purpose. We love Him because He first loved us. If you love me, keep my commandments. I've had people share with me as I've sought to give them encouragement from this verse of Scripture. It doesn't apply to me because I'm not one that was called according to His purpose. What a way to twist Scripture. I think about Joseph. Many of you know Joseph is named Joseph and not Christopher, because I love the Bible character Joseph. His middle name is Christopher. Joseph was a man, as you would read his life account in Genesis 37 through 50, you begin to see that he suffered some terrible things. In fact, I would venture to say that most of us in this room have never encountered half of what he had to deal with. But you know what's amazing is that we know the end of the story for the life of Joseph. We know how he ended up in the palace. We know how everything kind of worked out. But you know when he was in Potiphar's house, before that when he was in the pit, when he was in Potiphar's house, when he was in the prison, when he was forgotten for two years, all of those things were the culmination of what God was doing in the life of that man Joseph. I've often said this as I've thought about the life of Joseph as it's given to us in that portion of scripture, we begin to think of all that took place and all that transpired. In fact, Joseph would have this of his own testimony when he speaks to his brothers, as for you, you thought evil, right? They meant it for evil, but he says this in Genesis 50 and verse 19, and Joseph said to them, fear not, for am I in the place of God? But as for you, you thought evil against me, but God meant it unto good to bring to pass as it is this day to save much people alive. What a perspective that Joseph had, a perspective that would do well for us to learn about and really implement in our own lives. Joseph had this understanding that because he was in a pit, because he was in Potiphar's house, because he was in the prison, it's what led him to be in the palace. And as he's in the palace, he's able to interpret this dream obviously before he gets to the palace, but even think about the time in which he's in the prison. Would he have met the butler and baker if he was still in Potiphar's house? Most likely not. So he meets the butler and the baker because he's in the prison house. By the way, did he deserve to be there? No. Do you know how many people say, I don't deserve this? I understand. Let God be God. He's in the prison house. He interprets the dreams. The butler and the baker go back. The butler, he restored to his butlership, right? The baker, he's killed. That was the interpretation of the dreams. And what does Joseph say to them? There's one request that he makes, remember me. Remember me. And it's interesting because after the butler gets back, guess what the butler does? He conveniently forgets. Isn't that helpful? But I want you to think about what's going on in the life of Joseph. I want you to just for a moment think about Joseph in this particular situation and think about the way in which he was forgotten for those two full years. And as he's there in that situation, as he's dealing with in that prison and all that he's dealing with, we find that it's during that time that Pharaoh dreamed a dream. Now, had the butler returned immediately and said to the Pharaoh, there's a guy in prison that interpret my dream. I mean, it came to pass just as he said, what do you think Pharaoh would have said? I think he would have said, that's great, but I got guys that interpret dreams, right? Where did Pharaoh go first after he dreamed his dream in chapter number 41? He went to his magicians and his astrologers. That's what he did for them to interpret the dream. But guess what? They couldn't interpret the dream. It's at that particular time that Joseph says or that the butler says, I remember my false this day. And I remember as I was in prison, there's a guy by the name of Joseph, in Hebrew, interpreted my dream. What does Pharaoh say at that point? Bring him to me. Bring him to me. So for two years he's forgotten in prison, but you see the timing of God. You see the hand of the Lord. Now here's the thing, and I understand this, and I hope that it just helps us. I understand that we're looking at a historical account. We're looking at the whole process and we're seeing the end. But for each one of us, we're living life moment by moment. We might be in the midst somewhere in those two years, right? And we just feel like we can't see anything positive. But we don't have to pretend to praise God in the time of adversity because we can have the knowledge that our God is working. And I may not have to know how He is working, but I can simply rejoice and then praise Him that He is working. Does that make sense? I hope that it helps some. It's helped me because there's some times that you deal with some things in your life and you say, what is going on? What is this all about? You say, God is working. I don't know about you, but during the whole COVID thing that we're still dealing with, there have been plenty of times that it's like, what is going on? Everything that you ever think about ministry has changed dramatically. I never have had to tell people, I'm sorry, you can't come to church until COVID. I was talking to a missionary friend the other day. I said, in fact, all of my years of ministry has been trying to get people to come to church. He said, yeah, pack a pew, brother. I was like, I wish we could just, yeah, it'd be great. You can't, right? Unless you're family. I got a phone call on Friday, pastor, I just want to share with you, so-and-so got saved. I would venture to say that if it were not for COVID, they probably never would have watched our services online. By the way, that's the fourth phone call I've gotten during this time of people that have gotten saved. When COVID came in, pastors were talking together how we were going to, I had pastors, I'm ready to go underground if I have to go underground. I mean, just do what we got to do, right? God's God. He's working. Somebody called me up just shortly after that phone call. Said, pastor, my heart's so overwhelmed. I just got to share it with somebody. It's going to burst. God answered a prayer. And they're just rejoicing. I mean, they were just so ecstatic. It was great. Those are pleasant phone calls, by the way. What I'm saying this morning is that we all are dealing with personally different scenarios and situations. And we have to have this understanding, praise him, praise him. Our God is worthy. We purpose, we resolve. I'm going to praise him at all times. His praise shall continually be in my mouth. Look up Hebrews 13 and verse number 15, that we're to offer our praise, the sacrifice of our lips, our praise given thanks to God continually. And we make that resolve, and then we regularly praise him. Privately, and it overflows into public. And then we're praising him in good times and in times that maybe we wouldn't describe as being good times. But we know, we know that in all things, our God is working. And the reality this morning is that when I have that knowledge that God is working, and I have that proper perspective, it helps me to praise him in the moment. Because I say, I don't know what God's doing, but God's a whole lot wiser than I am. Right? He transcends us. His ways are not our ways. His thoughts are not our thoughts. And we understand that truth, and we say, I don't understand all that God's doing, but I'm going to praise him because I know he's doing something good. He's doing something that he's doing for my good and for his glory. John chapter number 11, Lazarus is sick, and Jesus delays. Right? Martha and Mary find that Jesus is coming, but Lazarus is already dead. You know what they say? If you had been here, my brother had not died. And I believe that there was some absolute truth in what they said. They fully believed that if Jesus was there, that he could have healed that sickness. But Jesus said, I'm going to do greater works. And in fact, he told his disciples before he ever left, when he announced that Lazarus was dead, he said, I am glad for your sakes that I was not there. Why? Because God's working. And you know that even the Jewish people that were there to mourn the death of Lazarus, they even believed that Jesus could have done something if he was there. You read it, you'll see that they make the same comments about what Jesus is able to do. But then after Jesus stood there and said, Lazarus, come forth, there was a whole new level of understanding of what God is able to do. They saw something that they would not have seen otherwise. Can I tell you that this is real simple? Lazarus had to die in order for Jesus to raise him from the dead. That's basic, right? But there was some heartache in that whole process by Martha and Mary. But they got to see what God was able to do. Praise him, praise him. He's worthy of it. I hope that we'd resolve this morning. praise Him, and that we'd regularly practice praising our God, for He is worthy. Let's pray. Father, we love You. We thank You for loving us. Thank You for the Word of God, the truth contained therein. God, we can see in Your Word the importance of resolving, as the psalmist did, to praise You. I thank You that You've put a new song in my heart to even praise unto my God. We understand that Your character and Your work, they demand our praise. You're worthy of it. God, as we think about some of the examples that we referenced this morning, I thank You for the instruction that they provide. And Lord, I know, however, that as we walk this journey called life, that there are some difficulties that we face. There are times in which it seems as if we just can't see what's going on. God, would You help us to rest in the truth of Your Word? Would You help us to praise You in the time of that difficulty, knowing, not thinking or assuming, but knowing that You're at work? Help us, Lord, to be a people that properly praise You. I pray that You'd have Your will and way over these next few moments of invitation, that decisions would be made that would please Thee. We'll certainly praise You for all that You'll do, for it's in Christ's name we pray. Just stand with me. Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.119999885559082,
      "text": " Into the entirety of the psalm, but just want to look at these first three verses this morning"
    },
    {
      "id": 1,
      "start": 4.119999885559082,
      "end": 8.239999771118164,
      "text": " and I've titled the message this praise him praise him and"
    },
    {
      "id": 2,
      "start": 8.880000114440918,
      "end": 14.079999923706055,
      "text": " We sing that song what a wonderful hymn it is. How many of you know something about Fanny Crosby?"
    },
    {
      "id": 3,
      "start": 14.920000076293945,
      "end": 16.920000076293945,
      "text": " What do you know about Fanny Crosby?"
    },
    {
      "id": 4,
      "start": 17.68000030517578,
      "end": 22.0,
      "text": " All right, one of the first things people say she was blind, right? She's a great songwriter"
    },
    {
      "id": 5,
      "start": 22.1200008392334,
      "end": 25.600000381469727,
      "text": " You know that she's the one that wrote the song praise him praise him"
    },
    {
      "id": 6,
      "start": 26.280000686645508,
      "end": 28.15999984741211,
      "text": " And she's blind"
    },
    {
      "id": 7,
      "start": 28.15999984741211,
      "end": 34.0,
      "text": " Praise him praise him. Listen. We have much to praise the Lord for amen"
    },
    {
      "id": 8,
      "start": 34.0,
      "end": 36.15999984741211,
      "text": " Sometimes we begin to live under the circumstances"
    },
    {
      "id": 9,
      "start": 36.15999984741211,
      "end": 40.08000183105469,
      "text": " We begin to get overwhelmed by the things in life and sometimes it's more"
    },
    {
      "id": 10,
      "start": 40.47999954223633,
      "end": 44.20000076293945,
      "text": " We find ourselves in a position where it's easier maybe to complain"
    },
    {
      "id": 11,
      "start": 44.63999938964844,
      "end": 48.31999969482422,
      "text": " Than it is to praise as we look at this passage of Scripture"
    },
    {
      "id": 12,
      "start": 48.31999969482422,
      "end": 52.720001220703125,
      "text": " In fact as we read the entirety of the book of Psalms, we find it on a regular occasion"
    },
    {
      "id": 13,
      "start": 52.720001220703125,
      "end": 54.880001068115234,
      "text": " We are confronted with the subject of praise"
    },
    {
      "id": 14,
      "start": 55.36000061035156,
      "end": 60.560001373291016,
      "text": " It's good for us to be reminded of the importance of praise in our lives as God's people"
    },
    {
      "id": 15,
      "start": 60.560001373291016,
      "end": 66.23999786376953,
      "text": " In fact as you as I I believe this morning I could say this I believe that I would be"
    },
    {
      "id": 16,
      "start": 67.12000274658203,
      "end": 71.87999725341797,
      "text": " Accurate in saying this I think it's a safe assumption to say that each of us would agree this morning"
    },
    {
      "id": 17,
      "start": 72.0,
      "end": 74.27999877929688,
      "text": " That God is worthy of our praise"
    },
    {
      "id": 18,
      "start": 75.16000366210938,
      "end": 76.80000305175781,
      "text": " He's worthy of our worship"
    },
    {
      "id": 19,
      "start": 76.80000305175781,
      "end": 81.4800033569336,
      "text": " You read the book of Revelation in chapter number four and five and begin to see the scene in heaven"
    },
    {
      "id": 20,
      "start": 81.4800033569336,
      "end": 85.31999969482422,
      "text": " You begin to see how that the Lamb is being worshiped how he's being praised"
    },
    {
      "id": 21,
      "start": 85.83999633789062,
      "end": 91.68000030517578,
      "text": " our Savior what a blessing and the reality is that as we look at the the"
    },
    {
      "id": 22,
      "start": 92.5999984741211,
      "end": 98.91999816894531,
      "text": " Experiences that we have on life as we deal with the troubles the trials of the victories the times of triumph"
    },
    {
      "id": 23,
      "start": 98.91999816894531,
      "end": 104.63999938964844,
      "text": " The reality is that we ought to be a people that praise him. I know that you're there in Psalm 34"
    },
    {
      "id": 24,
      "start": 104.63999938964844,
      "end": 105.5199966430664,
      "text": " You don't need to turn there"
    },
    {
      "id": 25,
      "start": 105.5199966430664,
      "end": 112.72000122070312,
      "text": " But I want to read to you the final psalm of the book of Psalms in Psalm 150 how accurately it really summarizes"
    },
    {
      "id": 26,
      "start": 112.95999908447266,
      "end": 120.23999786376953,
      "text": " Much of not the only theme but certainly a very profound thought throughout the book of Psalms that of praise"
    },
    {
      "id": 27,
      "start": 121.12000274658203,
      "end": 125.63999938964844,
      "text": " The song psalmist said praise ye the Lord praise God in his sanctuary"
    },
    {
      "id": 28,
      "start": 126.4000015258789,
      "end": 128.39999389648438,
      "text": " Praise him in the firmament of his power"
    },
    {
      "id": 29,
      "start": 128.72000122070312,
      "end": 133.8000030517578,
      "text": " Praise him for his mighty acts praise him according to his excellent greatness"
    },
    {
      "id": 30,
      "start": 134.47999572753906,
      "end": 138.16000366210938,
      "text": " Praise him with the sound of the trumpet praise him with the saw tree and harp"
    },
    {
      "id": 31,
      "start": 138.44000244140625,
      "end": 142.52000427246094,
      "text": " Praise him with the timbrel and dance praise him with stringed instruments and organs"
    },
    {
      "id": 32,
      "start": 143.0,
      "end": 147.10000610351562,
      "text": " Praise him upon the loud cymbals praise him upon the high sounding cymbals"
    },
    {
      "id": 33,
      "start": 147.36000061035156,
      "end": 153.1999969482422,
      "text": " Then notice the final verse to this great book. Let everything that hath breath"
    },
    {
      "id": 34,
      "start": 153.75999450683594,
      "end": 155.75999450683594,
      "text": " praise the Lord"
    },
    {
      "id": 35,
      "start": 155.8800048828125,
      "end": 156.9199981689453,
      "text": " praise"
    },
    {
      "id": 36,
      "start": 156.9199981689453,
      "end": 158.9199981689453,
      "text": " Ye the Lord"
    },
    {
      "id": 37,
      "start": 158.9600067138672,
      "end": 162.60000610351562,
      "text": " Praise him praise him Psalm 34 a psalm that's ascribed to David"
    },
    {
      "id": 38,
      "start": 163.0,
      "end": 165.8800048828125,
      "text": " The Bible says this I will bless the Lord at all times"
    },
    {
      "id": 39,
      "start": 166.55999755859375,
      "end": 169.9600067138672,
      "text": " His praise shall continually be in my mouth"
    },
    {
      "id": 40,
      "start": 170.32000732421875,
      "end": 176.1999969482422,
      "text": " My soul shall make her boast in the Lord. The humble shall hear thereof and be glad Oh"
    },
    {
      "id": 41,
      "start": 177.0399932861328,
      "end": 182.22000122070312,
      "text": " Magnify the Lord with me and let us exalt his name"
    },
    {
      "id": 42,
      "start": 182.8800048828125,
      "end": 188.75999450683594,
      "text": " together the word praise carries with the idea to extol in words or song to magnify"
    },
    {
      "id": 43,
      "start": 189.44000244140625,
      "end": 191.44000244140625,
      "text": " to glorify on account of"
    },
    {
      "id": 44,
      "start": 191.75999450683594,
      "end": 193.67999267578125,
      "text": " perfections or"
    },
    {
      "id": 45,
      "start": 193.67999267578125,
      "end": 198.0,
      "text": " Excellent works now. Let me ask you based upon that definition"
    },
    {
      "id": 46,
      "start": 198.0800018310547,
      "end": 204.60000610351562,
      "text": " We would easily conclude that our God is worthy of our praise. He is perfect in every way. Amen"
    },
    {
      "id": 47,
      "start": 204.67999267578125,
      "end": 206.67999267578125,
      "text": " We have plenty of imperfections"
    },
    {
      "id": 48,
      "start": 207.52000427246094,
      "end": 208.72000122070312,
      "text": " Yes"
    },
    {
      "id": 49,
      "start": 208.72000122070312,
      "end": 216.1199951171875,
      "text": " We are imperfect people, but we serve a perfect God and I'm so thankful for the the truth of his character"
    },
    {
      "id": 50,
      "start": 216.55999755859375,
      "end": 221.0800018310547,
      "text": " we think about the definition that we would to glorify an account of perfections or"
    },
    {
      "id": 51,
      "start": 221.9600067138672,
      "end": 229.60000610351562,
      "text": " Excellent works in the sense of or in the case of praising our God. We praise him in both references not an or"
    },
    {
      "id": 52,
      "start": 230.1199951171875,
      "end": 236.8800048828125,
      "text": " Situation, but we praise him on the account of his perfections and on his excellent works"
    },
    {
      "id": 53,
      "start": 237.0800018310547,
      "end": 240.0399932861328,
      "text": " Our God is awesome. In fact, it's interesting"
    },
    {
      "id": 54,
      "start": 240.0399932861328,
      "end": 240.83999633789062,
      "text": " You don't need to turn there"
    },
    {
      "id": 55,
      "start": 240.83999633789062,
      "end": 247.67999267578125,
      "text": " but I will reference for you in Psalm 111 in verse number three and four the Bible says his work is honorable and glorious and"
    },
    {
      "id": 56,
      "start": 247.67999267578125,
      "end": 252.75999450683594,
      "text": " His righteousness endureth forever. He hath made his wonderful works"
    },
    {
      "id": 57,
      "start": 253.36000061035156,
      "end": 255.36000061035156,
      "text": " to be remembered"
    },
    {
      "id": 58,
      "start": 255.67999267578125,
      "end": 258.1199951171875,
      "text": " the Lord is gracious and full of"
    },
    {
      "id": 59,
      "start": 258.8800048828125,
      "end": 263.8399963378906,
      "text": " Compassion as I think about that phrase in verse number four that he hath made his wonderful works to be remembered"
    },
    {
      "id": 60,
      "start": 263.8399963378906,
      "end": 270.6400146484375,
      "text": " I'm mindful of the book that we hold in our hands and the many accounts that God has given us of his wonderful works and"
    },
    {
      "id": 61,
      "start": 270.8399963378906,
      "end": 276.2799987792969,
      "text": " how we can rehearse them and we can recall them and and how it causes us to understand the"
    },
    {
      "id": 62,
      "start": 276.6400146484375,
      "end": 278.6400146484375,
      "text": " excellent works of our God"
    },
    {
      "id": 63,
      "start": 279.9599914550781,
      "end": 285.8399963378906,
      "text": " It's interesting in Psalm 40 in verse number three the psalmist said and he hath put a new song in my mouth"
    },
    {
      "id": 64,
      "start": 286.9599914550781,
      "end": 288.67999267578125,
      "text": " even praise"
    },
    {
      "id": 65,
      "start": 288.67999267578125,
      "end": 294.8399963378906,
      "text": " Unto our God many shall see it and fear and shall trust in the Lord"
    },
    {
      "id": 66,
      "start": 295.3999938964844,
      "end": 299.2799987792969,
      "text": " We often speak about the fact that redemption and really if you think about that"
    },
    {
      "id": 67,
      "start": 299.7200012207031,
      "end": 305.2799987792969,
      "text": " Psalm in Psalm 40 how that the psalmist starts and talks about the fact that he brought me up out of in a horrible pit"
    },
    {
      "id": 68,
      "start": 305.2799987792969,
      "end": 309.7200012207031,
      "text": " In verse number two out of the miry clay set my feet upon a rock established my goings"
    },
    {
      "id": 69,
      "start": 309.7200012207031,
      "end": 312.4800109863281,
      "text": " Can you remember the work that God did in your life?"
    },
    {
      "id": 70,
      "start": 313.6000061035156,
      "end": 318.760009765625,
      "text": " And he says he had put a new song in my mouth. What is that new song? It's praise unto our God"
    },
    {
      "id": 71,
      "start": 319.3599853515625,
      "end": 321.3599853515625,
      "text": " It's praise unto our God. I"
    },
    {
      "id": 72,
      "start": 322.55999755859375,
      "end": 323.67999267578125,
      "text": " Wonder this morning"
    },
    {
      "id": 73,
      "start": 323.67999267578125,
      "end": 328.44000244140625,
      "text": " There are times I shared this with someone before the service and I told him I'd mentioned it in the in the message in"
    },
    {
      "id": 74,
      "start": 328.55999755859375,
      "end": 333.20001220703125,
      "text": " Kind of in the introduction this morning ever a time in your life where you just kind of"
    },
    {
      "id": 75,
      "start": 333.8800048828125,
      "end": 336.2799987792969,
      "text": " Find yourself complaining about something"
    },
    {
      "id": 76,
      "start": 338.32000732421875,
      "end": 340.0799865722656,
      "text": " No"
    },
    {
      "id": 77,
      "start": 340.0799865722656,
      "end": 345.1199951171875,
      "text": " Let's go to another text of Scripture about being truthful. Amen, but the reality is that"
    },
    {
      "id": 78,
      "start": 346.0,
      "end": 348.1199951171875,
      "text": " Complaining sometimes just comes real natural for us"
    },
    {
      "id": 79,
      "start": 349.3999938964844,
      "end": 351.3999938964844,
      "text": " sometimes we live so much under the"
    },
    {
      "id": 80,
      "start": 351.55999755859375,
      "end": 355.0799865722656,
      "text": " Circumstances that we just go through life and there are times in which we're not really"
    },
    {
      "id": 81,
      "start": 355.6400146484375,
      "end": 362.32000732421875,
      "text": " Intending to complain we did not set out in our conversation to have a complaint session"
    },
    {
      "id": 82,
      "start": 362.55999755859375,
      "end": 367.239990234375,
      "text": " Yet we find ourselves at times as we kind of pause in the midst of that"
    },
    {
      "id": 83,
      "start": 367.5199890136719,
      "end": 371.1199951171875,
      "text": " Conversation or and the things that we're saying saying man. I'm just complaining. I"
    },
    {
      "id": 84,
      "start": 372.4800109863281,
      "end": 374.9800109863281,
      "text": " Wonder this morning. Do we ever catch ourselves praising?"
    },
    {
      "id": 85,
      "start": 376.3599853515625,
      "end": 380.1199951171875,
      "text": " Where we didn't just like purpose to I want to have a conversation"
    },
    {
      "id": 86,
      "start": 380.1199951171875,
      "end": 384.32000732421875,
      "text": " I'm gonna go talk to Michael and I'm gonna purpose to praise God as I talk to Michael"
    },
    {
      "id": 87,
      "start": 384.32000732421875,
      "end": 386.4800109863281,
      "text": " See, I've planned that I've purposed that right?"
    },
    {
      "id": 88,
      "start": 386.4800109863281,
      "end": 389.20001220703125,
      "text": " but what I'm asking is are there times in the midst of our"
    },
    {
      "id": 89,
      "start": 389.6000061035156,
      "end": 397.3999938964844,
      "text": " Conversations we go through life as we are traveling this journey that we just catch ourselves praising God just overwhelmed with how wonderful"
    },
    {
      "id": 90,
      "start": 397.6400146484375,
      "end": 398.8399963378906,
      "text": " He is"
    },
    {
      "id": 91,
      "start": 398.8399963378906,
      "end": 401.55999755859375,
      "text": " And and we find that the psalmist would say"
    },
    {
      "id": 92,
      "start": 402.32000732421875,
      "end": 408.1199951171875,
      "text": " Here's some things about praising the Lord and certainly we would be mindful of the importance of understanding"
    },
    {
      "id": 93,
      "start": 408.67999267578125,
      "end": 411.4800109863281,
      "text": " That we are to stand in all of our God"
    },
    {
      "id": 94,
      "start": 411.4800109863281,
      "end": 416.67999267578125,
      "text": " I believe this morning that we've been commanded. We've been instructed to praise the Lord"
    },
    {
      "id": 95,
      "start": 417.3999938964844,
      "end": 424.2799987792969,
      "text": " Amen, we've been instructed in everything give. Thanks. This is the will of God in Christ Jesus concerning you rejoice evermore"
    },
    {
      "id": 96,
      "start": 424.8399963378906,
      "end": 427.1199951171875,
      "text": " The Apostle Paul as he writes the book of Philippians"
    },
    {
      "id": 97,
      "start": 427.1199951171875,
      "end": 432.7200012207031,
      "text": " He begins in the third chapter about speaking about and he says finally, but he has a whole nother chapter left"
    },
    {
      "id": 98,
      "start": 432.7200012207031,
      "end": 435.9200134277344,
      "text": " And so, you know when the preacher says finally, he's not really at his last point"
    },
    {
      "id": 99,
      "start": 436.20001220703125,
      "end": 442.9200134277344,
      "text": " The reality however, is that he says finally my brethren rejoice in the Lord you get to chapter number four rejoice in the Lord"
    },
    {
      "id": 100,
      "start": 443.44000244140625,
      "end": 444.3999938964844,
      "text": " always and again"
    },
    {
      "id": 101,
      "start": 444.3999938964844,
      "end": 446.55999755859375,
      "text": " I say rejoice and we think about this"
    },
    {
      "id": 102,
      "start": 446.9200134277344,
      "end": 453.8399963378906,
      "text": " extolling and praising the Lord that we would magnify him that we would lift him up and we think about this principle of praising the"
    },
    {
      "id": 103,
      "start": 453.8399963378906,
      "end": 455.0,
      "text": " Lord"
    },
    {
      "id": 104,
      "start": 455.0,
      "end": 459.6400146484375,
      "text": " Certainly we find that he is worthy of it that we as his people ought to be"
    },
    {
      "id": 105,
      "start": 459.79998779296875,
      "end": 465.5199890136719,
      "text": " Engaged in it and I believe this morning that the more time we spend with God"
    },
    {
      "id": 106,
      "start": 465.760009765625,
      "end": 471.20001220703125,
      "text": " The closer we draw to him the more natural that praise just kind of flows"
    },
    {
      "id": 107,
      "start": 472.4800109863281,
      "end": 475.32000732421875,
      "text": " Because I'm in his presence and I'm enjoying"
    },
    {
      "id": 108,
      "start": 476.1600036621094,
      "end": 481.8399963378906,
      "text": " the the the truth of who God is and I'm being reminded of his character and I'm"
    },
    {
      "id": 109,
      "start": 482.8800048828125,
      "end": 487.44000244140625,
      "text": " Rejoicing and who he is and I'm praising God and I find myself praising him"
    },
    {
      "id": 110,
      "start": 487.44000244140625,
      "end": 492.1600036621094,
      "text": " Why because I've been near him because I've drawn close to him and I've understood"
    },
    {
      "id": 111,
      "start": 492.6000061035156,
      "end": 497.2799987792969,
      "text": " How perfect and how holy he is I've been reminded of his character"
    },
    {
      "id": 112,
      "start": 498.0400085449219,
      "end": 501.2799987792969,
      "text": " I've been reminded of his works his excellent works"
    },
    {
      "id": 113,
      "start": 501.2799987792969,
      "end": 506.0,
      "text": " And as I look at the truth of the Word of God and I think about the psalmist"
    },
    {
      "id": 114,
      "start": 506.20001220703125,
      "end": 509.4800109863281,
      "text": " As I mentioned a moment ago about him saying that you stand in all of him"
    },
    {
      "id": 115,
      "start": 509.6400146484375,
      "end": 514.52001953125,
      "text": " It's interesting that in verse 8 of Psalm 33 the Bible says let all the earth fear the Lord"
    },
    {
      "id": 116,
      "start": 514.52001953125,
      "end": 518.8800048828125,
      "text": " Let all the inhabitants of the world stand in all of him"
    },
    {
      "id": 117,
      "start": 519.3599853515625,
      "end": 526.1199951171875,
      "text": " And then the very next verse says this for he spake and it was done he commanded and it stood still"
    },
    {
      "id": 118,
      "start": 526.8400268554688,
      "end": 528.8400268554688,
      "text": " obvious reference to creation"
    },
    {
      "id": 119,
      "start": 529.3200073242188,
      "end": 530.9600219726562,
      "text": " I begin to think about"
    },
    {
      "id": 120,
      "start": 530.9600219726562,
      "end": 537.1599731445312,
      "text": " The Lord and begin to think about praising him and the reality this morning is that we ought to praise God for who he is"
    },
    {
      "id": 121,
      "start": 537.9600219726562,
      "end": 539.3599853515625,
      "text": " Amen"
    },
    {
      "id": 122,
      "start": 539.3599853515625,
      "end": 543.0399780273438,
      "text": " As I enter into my prayer time on a daily basis"
    },
    {
      "id": 123,
      "start": 543.0399780273438,
      "end": 549.239990234375,
      "text": " I begin by reminding myself and rehearsing before the Lord his character traits"
    },
    {
      "id": 124,
      "start": 549.9600219726562,
      "end": 553.760009765625,
      "text": " Not because he needs to be reminded of the fact that he's holy and just and"
    },
    {
      "id": 125,
      "start": 554.47998046875,
      "end": 559.2000122070312,
      "text": " Omniscient and omnipotent and omnipresent and all of those things not that he needs to be reminded of it"
    },
    {
      "id": 126,
      "start": 559.2000122070312,
      "end": 561.2000122070312,
      "text": " But you know what? I need to be reminded of it"
    },
    {
      "id": 127,
      "start": 562.280029296875,
      "end": 569.0399780273438,
      "text": " And as I begin to rehearse those things and I begin to consider the the the references in the Word of God that teach me"
    },
    {
      "id": 128,
      "start": 569.0399780273438,
      "end": 572.5999755859375,
      "text": " Who he is and define for us his character"
    },
    {
      "id": 129,
      "start": 572.6400146484375,
      "end": 576.719970703125,
      "text": " It caused me to get into that spirit of praising and worshiping. Oh"
    },
    {
      "id": 130,
      "start": 577.6400146484375,
      "end": 580.8400268554688,
      "text": " We ought to praise God for who he is. We ought to praise God for what he's done"
    },
    {
      "id": 131,
      "start": 581.52001953125,
      "end": 583.52001953125,
      "text": " That song for all he's done"
    },
    {
      "id": 132,
      "start": 584.4000244140625,
      "end": 586.4000244140625,
      "text": " God's done some great things for us"
    },
    {
      "id": 133,
      "start": 587.5599975585938,
      "end": 592.6799926757812,
      "text": " And what a blessing to to consider the fact that we praise him not only for who he is"
    },
    {
      "id": 134,
      "start": 592.6799926757812,
      "end": 600.0399780273438,
      "text": " But also for what he's done. We praise him because he is perfect. We praise him because of his excellent works. It's an it's a"
    },
    {
      "id": 0,
      "start": 600.0399780273438,
      "end": 605.3199782371521,
      "text": " combination of both and we begin to get into that mindset of praising"
    },
    {
      "id": 1,
      "start": 605.3199782371521,
      "end": 609.439977645874,
      "text": " the Lord. As we look here at Psalm 34, I want to just share a couple of thoughts"
    },
    {
      "id": 2,
      "start": 609.439977645874,
      "end": 612.0799779891968,
      "text": " with you this morning. I want you to notice, number one, that the psalmist"
    },
    {
      "id": 3,
      "start": 612.0799779891968,
      "end": 617.2399787902832,
      "text": " resolved to praise the Lord. I know that word resolved is a strong word. I think"
    },
    {
      "id": 4,
      "start": 617.2399787902832,
      "end": 621.5199775695801,
      "text": " it's an important word. In fact, as you go throughout the book of Psalms, as you"
    },
    {
      "id": 5,
      "start": 621.5199775695801,
      "end": 625.5999774932861,
      "text": " read many of the Psalms that are ascribed to David, you will see regularly this"
    },
    {
      "id": 6,
      "start": 625.5999774932861,
      "end": 631.4799785614014,
      "text": " phrase, I will. And you find that there are several references to this thought, I"
    },
    {
      "id": 7,
      "start": 631.4799785614014,
      "end": 635.7199783325195,
      "text": " will bless the Lord or I will praise thee. In fact, the phrase I will praise"
    },
    {
      "id": 8,
      "start": 635.7199783325195,
      "end": 640.1999778747559,
      "text": " thee is referenced in those particular words over 11 times just in the Psalms."
    },
    {
      "id": 9,
      "start": 640.1999778747559,
      "end": 644.3999786376953,
      "text": " And you think about the resolve, the purpose, the commitment that the"
    },
    {
      "id": 10,
      "start": 644.3999786376953,
      "end": 648.9599761962891,
      "text": " psalmist is making that he is resolved to praise the Lord. We find that he says"
    },
    {
      "id": 11,
      "start": 648.9599761962891,
      "end": 653.799976348877,
      "text": " here in verse number one, I will bless the Lord at all times. Notice the next"
    },
    {
      "id": 12,
      "start": 653.799976348877,
      "end": 661.6799774169922,
      "text": " phrase, his praise shall continually be in my mouth. My soul shall make her boast"
    },
    {
      "id": 13,
      "start": 661.6799774169922,
      "end": 666.2399749755859,
      "text": " in the Lord. The humble shall hear thereof and be glad. O magnify the Lord"
    },
    {
      "id": 14,
      "start": 666.2399749755859,
      "end": 673.1199798583984,
      "text": " with me and let us exalt his name together. It's interesting if you were to"
    },
    {
      "id": 15,
      "start": 673.1199798583984,
      "end": 678.7599792480469,
      "text": " read Psalm 107, oftentimes we'll use a portion of the first opening of that"
    },
    {
      "id": 16,
      "start": 678.7599792480469,
      "end": 683.3199768066406,
      "text": " particular passage in verse number two where the Bible says, let the redeemed of"
    },
    {
      "id": 17,
      "start": 683.3199768066406,
      "end": 687.1599807739258,
      "text": " the Lord say so. And maybe we'll use that phraseology when talking about praising"
    },
    {
      "id": 18,
      "start": 687.1599807739258,
      "end": 691.3199768066406,
      "text": " the Lord and giving testimony. In fact, the psalmist says, O give thanks unto the"
    },
    {
      "id": 19,
      "start": 691.3199768066406,
      "end": 697.359977722168,
      "text": " Lord for he is good, for his mercy endureth forever. Begin to think about"
    },
    {
      "id": 20,
      "start": 697.359977722168,
      "end": 702.7599792480469,
      "text": " the psalm and the truth that is captured in Psalm 107. On four occasions the"
    },
    {
      "id": 21,
      "start": 702.7599792480469,
      "end": 707.8399810791016,
      "text": " psalmist says, O that men would praise the Lord for his goodness and for his"
    },
    {
      "id": 22,
      "start": 707.8399810791016,
      "end": 713.47998046875,
      "text": " wonderful works to the children of men. And this morning when we think about the"
    },
    {
      "id": 23,
      "start": 713.47998046875,
      "end": 720.3199768066406,
      "text": " truth of praise him, praise him, it should not be something that is difficult for"
    },
    {
      "id": 24,
      "start": 720.3199768066406,
      "end": 725.5999755859375,
      "text": " God's people. It should not be something that you have to kind of work up, if you"
    },
    {
      "id": 25,
      "start": 725.5999755859375,
      "end": 729.3199768066406,
      "text": " will, that you're gonna praise God. It ought to be a natural thing because of"
    },
    {
      "id": 26,
      "start": 729.3199768066406,
      "end": 732.8799743652344,
      "text": " the time that we've spent in his presence and because of our understanding"
    },
    {
      "id": 27,
      "start": 732.8799743652344,
      "end": 737.8399810791016,
      "text": " of who he is and what he's done for us. And we find that the psalmist is"
    },
    {
      "id": 28,
      "start": 737.8399810791016,
      "end": 742.3999786376953,
      "text": " resolved. I like the resolve of the psalmist. I think this morning that we"
    },
    {
      "id": 29,
      "start": 742.3999786376953,
      "end": 745.5399780273438,
      "text": " should say something similar. I mean, we can adopt the same words that the"
    },
    {
      "id": 30,
      "start": 745.5399780273438,
      "end": 751.4399719238281,
      "text": " psalmist uses and we can have for our purpose and our resolve that I will"
    },
    {
      "id": 31,
      "start": 751.4399719238281,
      "end": 757.1599731445312,
      "text": " praise the Lord. We just make that decision. We make that determination. We"
    },
    {
      "id": 32,
      "start": 757.1599731445312,
      "end": 761.6799774169922,
      "text": " purpose in our hearts that we're gonna praise him. And the reality as we look at"
    },
    {
      "id": 33,
      "start": 761.6799774169922,
      "end": 765.5599822998047,
      "text": " the nation of Israel, of course, we're mindful of all of the accounts and how"
    },
    {
      "id": 34,
      "start": 765.5599822998047,
      "end": 769.7999725341797,
      "text": " often they are criticized for complaining. And certainly they're guilty"
    },
    {
      "id": 35,
      "start": 769.7999725341797,
      "end": 774.6799774169922,
      "text": " of it. In fact, I've often shared with you that I like the word that is used often"
    },
    {
      "id": 36,
      "start": 774.6799774169922,
      "end": 778.2399749755859,
      "text": " in the Old Testament to describe the complaining of God's people and it's"
    },
    {
      "id": 37,
      "start": 778.2399749755859,
      "end": 785.0799713134766,
      "text": " murmur. That they were murmuring. In fact, the Bible tells us how that they were"
    },
    {
      "id": 38,
      "start": 785.0799713134766,
      "end": 790.0799713134766,
      "text": " murmuring even within their tents. Now think about that. You think about that"
    },
    {
      "id": 39,
      "start": 790.0799713134766,
      "end": 793.3999786376953,
      "text": " truth and the the expression of that phraseology and you think about their"
    },
    {
      "id": 40,
      "start": 793.3999786376953,
      "end": 799.7599792480469,
      "text": " tents being the the place in which they would dwell. In fact, that's found in"
    },
    {
      "id": 41,
      "start": 799.7599792480469,
      "end": 804.7599792480469,
      "text": " Psalm 106 and verse 25, but murmured in their tents and hearken not unto the"
    },
    {
      "id": 42,
      "start": 804.7599792480469,
      "end": 810.6799774169922,
      "text": " voice of the Lord. See, the psalmist said, I'm gonna purpose. I'm gonna resolve to"
    },
    {
      "id": 43,
      "start": 810.6799774169922,
      "end": 814.6399841308594,
      "text": " praise the Lord. There's some things that I understand and obviously as we think"
    },
    {
      "id": 44,
      "start": 814.6399841308594,
      "end": 818.0399780273438,
      "text": " about the sweet psalmist of Israel, as we think about David and we think about his"
    },
    {
      "id": 45,
      "start": 818.0799713134766,
      "end": 821.6799774169922,
      "text": " walk with God, we think about his experiences and we understand some"
    },
    {
      "id": 46,
      "start": 821.6799774169922,
      "end": 824.7999725341797,
      "text": " things that have been recorded for us in the Word of God with regard to the life"
    },
    {
      "id": 47,
      "start": 824.7999725341797,
      "end": 829.9399719238281,
      "text": " of David and we see the closeness that he has. And you find that David says, the"
    },
    {
      "id": 48,
      "start": 829.9399719238281,
      "end": 835.1999816894531,
      "text": " Lord is my shepherd in Psalm 23. And we begin to fill your mind with those"
    },
    {
      "id": 49,
      "start": 835.1999816894531,
      "end": 839.8799743652344,
      "text": " truths of the Word of God and begin to spend that time. Remember, the Psalms tell"
    },
    {
      "id": 50,
      "start": 839.8799743652344,
      "end": 847.3999786376953,
      "text": " us that in his presence is fullness of joy. The reality is that there's a sense"
    },
    {
      "id": 51,
      "start": 847.3999786376953,
      "end": 851.47998046875,
      "text": " of resolve that I see here on the part of the psalmist, a sense of resolve that"
    },
    {
      "id": 52,
      "start": 851.47998046875,
      "end": 855.0399780273438,
      "text": " I need, a sense of resolve that I believe that each of us could use in our lives."
    },
    {
      "id": 53,
      "start": 855.0399780273438,
      "end": 858.7999877929688,
      "text": " In Psalm 9, I'm gonna share a number of references with you. You can turn there"
    },
    {
      "id": 54,
      "start": 858.7999877929688,
      "end": 863.1199645996094,
      "text": " if you want. I'll read them to you. You don't have to take the time to try to"
    },
    {
      "id": 55,
      "start": 863.1199645996094,
      "end": 866.9999694824219,
      "text": " fumble back and forth. They're all here in the book of Psalms, so we're not gonna"
    },
    {
      "id": 56,
      "start": 866.9999694824219,
      "end": 872.719970703125,
      "text": " go to all sorts of other places, at least not yet. In Psalm 9, in verse number 1,"
    },
    {
      "id": 57,
      "start": 872.7599792480469,
      "end": 877.8399658203125,
      "text": " again, a psalm that is ascribed to David, the Bible says this, I will praise thee,"
    },
    {
      "id": 58,
      "start": 877.8399658203125,
      "end": 887.3199768066406,
      "text": " O Lord, and then I like this phrase, with my whole heart I will show forth all thy"
    },
    {
      "id": 59,
      "start": 887.3199768066406,
      "end": 894.5999755859375,
      "text": " marvelous works. Think about the wholehearted aspect that the psalmist"
    },
    {
      "id": 60,
      "start": 894.5999755859375,
      "end": 899.9999694824219,
      "text": " shares with us here. It's not just a, I have to say this because duty demands it,"
    },
    {
      "id": 61,
      "start": 899.9999694824219,
      "end": 903.3599853515625,
      "text": " so to speak. I have to say this because somebody's looking for a testimony. We"
    },
    {
      "id": 62,
      "start": 903.3599853515625,
      "end": 907.3999633789062,
      "text": " have praise and thanksgiving type of service. In fact, during our Thanksgiving"
    },
    {
      "id": 63,
      "start": 907.3999633789062,
      "end": 913.6399841308594,
      "text": " season, we have a prayer, praise, and pie service. We ask people to share testimonies."
    },
    {
      "id": 64,
      "start": 913.6399841308594,
      "end": 917.1199645996094,
      "text": " Let the redeemed of the Lord say so. Praise the Lord. It ought not to be a"
    },
    {
      "id": 65,
      "start": 917.1199645996094,
      "end": 921.0399780273438,
      "text": " difficult thing. In fact, it ought to be when we take testimonies that we run out"
    },
    {
      "id": 66,
      "start": 921.0399780273438,
      "end": 927.8799743652344,
      "text": " of time, amen, because there's so much to praise them for, truly. We sing the song,"
    },
    {
      "id": 67,
      "start": 927.8799743652344,
      "end": 933.8799743652344,
      "text": " count your blessings, name them one by one. Dean, often as he sings that song or"
    },
    {
      "id": 68,
      "start": 933.8799743652344,
      "end": 938.1599731445312,
      "text": " leads that song, he gets sidetracked and he doesn't continue leading in the time"
    },
    {
      "id": 69,
      "start": 938.1599731445312,
      "end": 943.0799865722656,
      "text": " because he's going like this, right? Count your blessings. You've seen him, I've"
    },
    {
      "id": 70,
      "start": 943.0799865722656,
      "end": 947.1999816894531,
      "text": " seen him do it, I know you've seen him do it. The reality is that the songwriter,"
    },
    {
      "id": 71,
      "start": 947.1999816894531,
      "end": 951.5999755859375,
      "text": " through that song, is trying to remind us of the truth of Psalm 68, that he, God,"
    },
    {
      "id": 72,
      "start": 951.5999755859375,
      "end": 958.3999633789062,
      "text": " hath daily loatheth us with benefits. There's so much to praise him for, and we"
    },
    {
      "id": 73,
      "start": 958.3999633789062,
      "end": 962.7599792480469,
      "text": " need to resolve to praise the Lord. Psalm 69, notice what is said here by the"
    },
    {
      "id": 74,
      "start": 962.7599792480469,
      "end": 967.239990234375,
      "text": " psalmist in Psalm 69, in verse number 30."
    },
    {
      "id": 75,
      "start": 974.3599853515625,
      "end": 978.9199829101562,
      "text": " In Psalm 69, in verse number 30, the psalmist says, I will praise the name of"
    },
    {
      "id": 76,
      "start": 978.9199829101562,
      "end": 987.4399719238281,
      "text": " God with a psalm and will magnify him with thanksgiving. Does our song praise"
    },
    {
      "id": 77,
      "start": 987.4399719238281,
      "end": 995.2799682617188,
      "text": " God? I hope it does. I hope the songs that we sing are offering, rendering praise"
    },
    {
      "id": 78,
      "start": 995.2799682617188,
      "end": 1000.6799926757812,
      "text": " unto our God, reminding us of who he is, reminding us of what he's done. It's a"
    },
    {
      "id": 79,
      "start": 1000.6799926757812,
      "end": 1007.6799926757812,
      "text": " psalm of praise. In Psalm 86, turn over several pages here and look at Psalm 86"
    },
    {
      "id": 80,
      "start": 1007.8399658203125,
      "end": 1012.9199829101562,
      "text": " and, again, a psalm that's ascribed to David, and we find that here in this"
    },
    {
      "id": 81,
      "start": 1012.9199829101562,
      "end": 1017.1999816894531,
      "text": " particular psalm, he's rejoicing. Really, it's a prayer of David. He's rejoicing"
    },
    {
      "id": 82,
      "start": 1017.1999816894531,
      "end": 1021.9999694824219,
      "text": " for how the Lord would answer his prayer and teaching him his way. He says this in"
    },
    {
      "id": 83,
      "start": 1021.9999694824219,
      "end": 1028.3199768066406,
      "text": " verse number 12, I will praise thee, O Lord my God, with all my heart, and I will"
    },
    {
      "id": 84,
      "start": 1028.3199768066406,
      "end": 1041.5599670410156,
      "text": " glorify thy name forevermore. In Psalm 118, again, this psalm begins with that"
    },
    {
      "id": 85,
      "start": 1041.5599670410156,
      "end": 1045.7999877929688,
      "text": " same phraseology that we mentioned from Psalm 107, O give thanks unto the Lord"
    },
    {
      "id": 86,
      "start": 1045.7999877929688,
      "end": 1051.6799926757812,
      "text": " for he is good, because his mercy endureth forever. But here in Psalm 118,"
    },
    {
      "id": 87,
      "start": 1051.6799926757812,
      "end": 1057.1199645996094,
      "text": " in verse number 21, the Bible says this, I will praise thee, notice this, for thou"
    },
    {
      "id": 88,
      "start": 1057.1199645996094,
      "end": 1063.1999816894531,
      "text": " hast heard me and art become my salvation. I want you to just pause there just for a"
    },
    {
      "id": 89,
      "start": 1063.1999816894531,
      "end": 1066.239990234375,
      "text": " moment. We often speak about the importance of prayer, the privilege of"
    },
    {
      "id": 90,
      "start": 1066.239990234375,
      "end": 1071.1199645996094,
      "text": " prayer, the fact that we can enter boldly into the throne room of God and we"
    },
    {
      "id": 91,
      "start": 1071.1199645996094,
      "end": 1075.9999694824219,
      "text": " can bring our petitions before the Lord knowing that he hears and answers prayer."
    },
    {
      "id": 92,
      "start": 1075.9999694824219,
      "end": 1082.6399841308594,
      "text": " The psalmist says here, I will praise thee. Why? For thou hast heard me. The"
    },
    {
      "id": 93,
      "start": 1082.6399841308594,
      "end": 1086.6399841308594,
      "text": " reality is that we find that Paul would say this to the believers in Philippi as"
    },
    {
      "id": 94,
      "start": 1086.6399841308594,
      "end": 1091.5599670410156,
      "text": " he would give them the instruction of praying and giving thanks, and he would"
    },
    {
      "id": 95,
      "start": 1091.5599670410156,
      "end": 1096.1599731445312,
      "text": " say this to these believers, and it's a great model for us to follow in"
    },
    {
      "id": 96,
      "start": 1096.1599731445312,
      "end": 1100.1599731445312,
      "text": " Philippians 4, in verse number 6, be careful for nothing but in everything by"
    },
    {
      "id": 97,
      "start": 1100.1599731445312,
      "end": 1105.6799926757812,
      "text": " prayer and supplication, with thanksgiving let your requests be made"
    },
    {
      "id": 98,
      "start": 1105.6799926757812,
      "end": 1113.6399536132812,
      "text": " known unto God. See, we ought to praise God that he hears us. Yes, that he answers"
    },
    {
      "id": 99,
      "start": 1113.719970703125,
      "end": 1117.0,
      "text": " us, but sometimes the answer doesn't come immediately. Have you ever prayed for"
    },
    {
      "id": 100,
      "start": 1117.0,
      "end": 1121.1599731445312,
      "text": " something that you didn't get a response immediately? But you know what? We can"
    },
    {
      "id": 101,
      "start": 1121.1599731445312,
      "end": 1125.2799682617188,
      "text": " praise God that he heard us. Based upon the authority of the Word of God, our God"
    },
    {
      "id": 102,
      "start": 1125.2799682617188,
      "end": 1131.1599731445312,
      "text": " hears and answers prayer. And sometimes we're good at praising God for the"
    },
    {
      "id": 103,
      "start": 1131.1599731445312,
      "end": 1136.719970703125,
      "text": " answer, and sometimes when we're waiting for the answer, there's not a whole lot"
    },
    {
      "id": 104,
      "start": 1136.719970703125,
      "end": 1140.9599609375,
      "text": " of praise going on. We're waiting for God to answer, waiting for God to answer,"
    },
    {
      "id": 105,
      "start": 1140.9599609375,
      "end": 1144.4400024414062,
      "text": " waiting for God to answer. But here the psalmist says, I'm praising God because"
    },
    {
      "id": 106,
      "start": 1144.4400024414062,
      "end": 1150.7999877929688,
      "text": " he heard my prayer. And I wonder this morning, if we just can take for a moment"
    },
    {
      "id": 107,
      "start": 1150.7999877929688,
      "end": 1156.8399658203125,
      "text": " in our minds and in our lives today, just take a pause and just recognize what a"
    },
    {
      "id": 108,
      "start": 1156.8399658203125,
      "end": 1162.5199584960938,
      "text": " blessing it is to know that our God hears us. You remember the situation with"
    },
    {
      "id": 109,
      "start": 1162.5199584960938,
      "end": 1169.8800048828125,
      "text": " Elijah at Mount Carmel? He challenged all of those Baal worshippers, and he"
    },
    {
      "id": 110,
      "start": 1169.9199829101562,
      "end": 1174.3200073242188,
      "text": " challenged them. And we find the Bible tells us if you were to read the passage"
    },
    {
      "id": 111,
      "start": 1174.3200073242188,
      "end": 1178.8800048828125,
      "text": " of Scripture there in 1 Kings, in chapter number 18, you begin to understand all"
    },
    {
      "id": 112,
      "start": 1178.8800048828125,
      "end": 1182.8800048828125,
      "text": " that's happening in the challenge, and you find that Elijah says to them that"
    },
    {
      "id": 113,
      "start": 1182.8800048828125,
      "end": 1187.0799560546875,
      "text": " he'd let them go first. And here's what he says, and ye call, verse number 24,"
    },
    {
      "id": 114,
      "start": 1187.0799560546875,
      "end": 1192.1199951171875,
      "text": " call ye on the name of your gods, and I will call on the name of the Lord. The"
    },
    {
      "id": 115,
      "start": 1192.1199951171875,
      "end": 1197.5199584960938,
      "text": " God that answereth by fire, let him be God. And all the people answered and"
    },
    {
      "id": 116,
      "start": 1197.5199584960938,
      "end": 1201.9599609375,
      "text": " said, it is well spoken."
    },
    {
      "id": 0,
      "start": 1201.9599609375,
      "end": 1206.7799611091614,
      "text": " that after they're crying out and they're doing all of these things and they're praying"
    },
    {
      "id": 1,
      "start": 1206.7799611091614,
      "end": 1213.7799606323242,
      "text": " because it's a false God, they have ears but they hear not. Amen? And we find here that"
    },
    {
      "id": 2,
      "start": 1213.7799606323242,
      "end": 1219.2399616241455,
      "text": " Elijah would pray and God answers him, but it's amazing as you look at the prayer that"
    },
    {
      "id": 3,
      "start": 1219.2399616241455,
      "end": 1224.4799613952637,
      "text": " he prays, it's recorded for us in verse 36, and verse 37 you see the response, and I can"
    },
    {
      "id": 4,
      "start": 1224.4799613952637,
      "end": 1231.4799613952637,
      "text": " rejoice this morning that our God hears us. He's not far off, it's not as if he's not"
    },
    {
      "id": 5,
      "start": 1232.1999607086182,
      "end": 1237.359962463379,
      "text": " listening to us, he hears us when we pray and we can have that assurance. What a praise"
    },
    {
      "id": 6,
      "start": 1237.359962463379,
      "end": 1244.359962463379,
      "text": " him for that. Psalm 139, well let me say there in Psalm 118, look at the last couple of verses"
    },
    {
      "id": 7,
      "start": 1245.6399612426758,
      "end": 1251.6399612426758,
      "text": " in that passage, what a great truth is given to us in verse 28 and 29, notice how he begins,"
    },
    {
      "id": 8,
      "start": 1251.6399612426758,
      "end": 1258.6399612426758,
      "text": " Thou art my God. It's personal. He is my God. Remember we talked about the 23rd Psalm,"
    },
    {
      "id": 9,
      "start": 1263.6799621582031,
      "end": 1270.6799621582031,
      "text": " the Lord is my shepherd. The reality this morning is that the Lord is the shepherd,"
    },
    {
      "id": 10,
      "start": 1271.9999618530273,
      "end": 1278.4399642944336,
      "text": " he is the good shepherd, he is the chief shepherd, he is the great shepherd, those names are"
    },
    {
      "id": 11,
      "start": 1278.4399642944336,
      "end": 1285.1999588012695,
      "text": " ascribed to him. But what a difference it makes when we say the Lord is my shepherd,"
    },
    {
      "id": 12,
      "start": 1285.1999588012695,
      "end": 1289.559959411621,
      "text": " that personal relationship that we have with the Lord Jesus Christ and what a blessing"
    },
    {
      "id": 13,
      "start": 1289.559959411621,
      "end": 1296.559959411621,
      "text": " we find. The psalmist says, Thou art my God, notice, and I will praise thee. Thou art my"
    },
    {
      "id": 14,
      "start": 1298.0399627685547,
      "end": 1305.0399627685547,
      "text": " God, I will exalt thee. Oh give thanks unto the Lord for he is good, for his mercy endureth"
    },
    {
      "id": 15,
      "start": 1305.1599578857422,
      "end": 1312.1599578857422,
      "text": " forever. I wonder how often we just stop and praise God that he is mine and I am his. Now"
    },
    {
      "id": 16,
      "start": 1315.079963684082,
      "end": 1322.079963684082,
      "text": " I belong to Jesus, aren't you thankful for that? He is my God. We look at the psalmist"
    },
    {
      "id": 17,
      "start": 1323.3999633789062,
      "end": 1328.1199645996094,
      "text": " and the psalmist speaks about the fact that he is my God, my shield, my rock, my fortress,"
    },
    {
      "id": 18,
      "start": 1328.1199645996094,
      "end": 1332.9199676513672,
      "text": " my refuge and my hiding place and how we can rejoice in all of those things, why? Because"
    },
    {
      "id": 19,
      "start": 1332.9199676513672,
      "end": 1339.1599578857422,
      "text": " it's personal, he's my God, he is the Lord God Almighty, he is the creator of everything,"
    },
    {
      "id": 20,
      "start": 1339.1599578857422,
      "end": 1346.1599578857422,
      "text": " the sustainer of everything, but he's my God, personally. He's not far off that he cannot"
    },
    {
      "id": 21,
      "start": 1346.5599670410156,
      "end": 1351.9199676513672,
      "text": " be, no, no, no, he's my God. Remember as we've been studying through the book of Hebrews,"
    },
    {
      "id": 22,
      "start": 1351.9199676513672,
      "end": 1355.479965209961,
      "text": " we have an high priest which cannot be, which, let me read the verse, I'm going to butcher"
    },
    {
      "id": 23,
      "start": 1355.479965209961,
      "end": 1359.7999572753906,
      "text": " it, let me go there, Hebrews chapter number 4, in verse number 15, For we have not a high"
    },
    {
      "id": 24,
      "start": 1359.8399658203125,
      "end": 1363.8399658203125,
      "text": " priest which cannot be touched with the feeling of our infirmities, but was in all points"
    },
    {
      "id": 25,
      "start": 1363.8399658203125,
      "end": 1370.8399658203125,
      "text": " tempted like as we are yet without sin. We have a great high priest, he's our God. We"
    },
    {
      "id": 26,
      "start": 1371.8399658203125,
      "end": 1376.3599548339844,
      "text": " find that the psalmist is rejoicing, he says I will praise thee in Psalm 139 and verse"
    },
    {
      "id": 27,
      "start": 1376.3599548339844,
      "end": 1382.0399627685547,
      "text": " number 14, why? For I am wonderfully made. Notice as the psalmist would reference that"
    },
    {
      "id": 28,
      "start": 1382.0399627685547,
      "end": 1388.7599639892578,
      "text": " truth and we would understand that we have been created by our God, that he is the creator"
    },
    {
      "id": 29,
      "start": 1388.7599639892578,
      "end": 1394.2799682617188,
      "text": " of all and therefore we find that the psalmist says this in Psalm 139 and verse 14, I will"
    },
    {
      "id": 30,
      "start": 1394.2799682617188,
      "end": 1399.6799621582031,
      "text": " praise thee for I am fearfully and wonderfully made, marvelous are thy works and that my"
    },
    {
      "id": 31,
      "start": 1399.6799621582031,
      "end": 1406.6799621582031,
      "text": " soul knoweth right well. I will praise thee. So we find that the psalmist as we were to"
    },
    {
      "id": 32,
      "start": 1407.9599609375,
      "end": 1413.7599639892578,
      "text": " look at Psalm 34 and were to see the way in which the psalmist begins this passage of"
    },
    {
      "id": 33,
      "start": 1413.7999572753906,
      "end": 1419.1199645996094,
      "text": " scripture with this resolve that I will bless the Lord at all times and his praise shall"
    },
    {
      "id": 34,
      "start": 1419.1199645996094,
      "end": 1423.7599639892578,
      "text": " continually be in my mouth and we think about the subject matter of praise him, praise him"
    },
    {
      "id": 35,
      "start": 1423.7599639892578,
      "end": 1428.199966430664,
      "text": " and we find the psalmist as we've referenced a number of verses of scripture this morning,"
    },
    {
      "id": 36,
      "start": 1428.199966430664,
      "end": 1433.3599548339844,
      "text": " he has resolved to praise the Lord. Oh that we too would resolve to praise the Lord, that"
    },
    {
      "id": 37,
      "start": 1433.3599548339844,
      "end": 1438.0799560546875,
      "text": " we would purpose, that we would determine in our lives that we're going to praise him,"
    },
    {
      "id": 38,
      "start": 1438.0799560546875,
      "end": 1443.1199645996094,
      "text": " why? Because he's worthy of it. But we find that it doesn't end with resolve. Can I tell"
    },
    {
      "id": 39,
      "start": 1443.1199645996094,
      "end": 1447.439956665039,
      "text": " you that it's, there are several things that we have purposed to do in our lives no doubt"
    },
    {
      "id": 40,
      "start": 1447.439956665039,
      "end": 1454.3199615478516,
      "text": " that we never followed through with. So I'm going to do this and then we didn't really"
    },
    {
      "id": 41,
      "start": 1454.3199615478516,
      "end": 1459.6399536132812,
      "text": " kind of follow through. And here we find not only did the psalmist resolve to praise the"
    },
    {
      "id": 42,
      "start": 1459.6399536132812,
      "end": 1466.1599731445312,
      "text": " Lord but we find the psalmist regularly praised the Lord. I like the phraseology that we find"
    },
    {
      "id": 43,
      "start": 1466.1599731445312,
      "end": 1475.8799743652344,
      "text": " in Psalm 34 when he says this, notice these words, at all times. At all times. Now we"
    },
    {
      "id": 44,
      "start": 1475.8799743652344,
      "end": 1482.9599609375,
      "text": " find that the New Testament puts it this way in everything, right? And by the way there"
    },
    {
      "id": 45,
      "start": 1482.9599609375,
      "end": 1486.719970703125,
      "text": " in 1 Thessalonians 5 when he says in everything give thanks for this is the will of God in"
    },
    {
      "id": 46,
      "start": 1486.719970703125,
      "end": 1492.2399597167969,
      "text": " Christ Jesus concerning you. It's God's will that we give thanks, that we praise him, that"
    },
    {
      "id": 47,
      "start": 1492.2399597167969,
      "end": 1498.3199462890625,
      "text": " we exalt him, that we lift him up. And we find that the psalmist says that at all times,"
    },
    {
      "id": 48,
      "start": 1498.3199462890625,
      "end": 1505.5599670410156,
      "text": " notice he says this, his praise shall continually be in my mouth. Those are two phrases that"
    },
    {
      "id": 49,
      "start": 1505.5599670410156,
      "end": 1511.219970703125,
      "text": " we find here at all times and continually that should help us to understand the importance"
    },
    {
      "id": 50,
      "start": 1511.219970703125,
      "end": 1516.8399658203125,
      "text": " of regularly praising the Lord. When we speak about regularly praising the Lord the reality"
    },
    {
      "id": 51,
      "start": 1516.8399658203125,
      "end": 1525.3999633789062,
      "text": " is that it ought to be done in private. Privately. Praising the Lord. But it doesn't stop in"
    },
    {
      "id": 52,
      "start": 1525.3999633789062,
      "end": 1533.4399719238281,
      "text": " private. We ought to praise him publicly. Amen? In fact the psalmist often references"
    },
    {
      "id": 53,
      "start": 1533.4399719238281,
      "end": 1540.9599609375,
      "text": " the intent that he has to praise the Lord in public. In Psalm 108 in verse number 3"
    },
    {
      "id": 54,
      "start": 1540.9599609375,
      "end": 1546.2399597167969,
      "text": " the psalmist says this, I will praise thee O Lord among the people and I will sing praises"
    },
    {
      "id": 55,
      "start": 1546.2399597167969,
      "end": 1555.8799743652344,
      "text": " unto thee among the nations. See when we praise God privately it's probably going"
    },
    {
      "id": 56,
      "start": 1555.8799743652344,
      "end": 1562.3999633789062,
      "text": " to overflow into our public praise of God. What do I mean by that? I'm so full of praising"
    },
    {
      "id": 57,
      "start": 1562.3999633789062,
      "end": 1567.9199523925781,
      "text": " God in my private walk with him, and I'm not saying this of me, I'm saying that as we do"
    },
    {
      "id": 58,
      "start": 1567.9199523925781,
      "end": 1573.6799621582031,
      "text": " this, as we resolve to praise the Lord, as we are regularly praising him in our time"
    },
    {
      "id": 59,
      "start": 1573.6799621582031,
      "end": 1578.7599487304688,
      "text": " with him on a daily basis and we're standing in awe of who he is and we're mindful of his"
    },
    {
      "id": 60,
      "start": 1578.7599487304688,
      "end": 1583.3199462890625,
      "text": " character, we're mindful of his excellent works and we're praising him, that's going"
    },
    {
      "id": 61,
      "start": 1583.3199462890625,
      "end": 1591.3199462890625,
      "text": " to flow out publicly. I made a statement to somebody just on Friday, I know the person"
    },
    {
      "id": 62,
      "start": 1591.3199462890625,
      "end": 1600.6799621582031,
      "text": " I was speaking to was lost. I know that. And as a question was asked of me I responded"
    },
    {
      "id": 63,
      "start": 1600.6799621582031,
      "end": 1605.2399597167969,
      "text": " by saying this, well Lord willing this is going to, and I thought he has no idea what"
    },
    {
      "id": 64,
      "start": 1605.2399597167969,
      "end": 1612.6399536132812,
      "text": " Lord willing even means. But I caught myself saying it. And it was kind of interesting."
    },
    {
      "id": 65,
      "start": 1612.6399536132812,
      "end": 1616.9199523925781,
      "text": " I've shared the gospel with the individual, I've tried to witness to him and to share"
    },
    {
      "id": 66,
      "start": 1616.9199523925781,
      "end": 1622.3199462890625,
      "text": " the truth with him that he might be saved, and I just found myself just using that phraseology."
    },
    {
      "id": 67,
      "start": 1622.3199462890625,
      "end": 1627.719970703125,
      "text": " That's a phraseology that maybe we use amongst brethren, but not so often that we use amongst"
    },
    {
      "id": 68,
      "start": 1627.719970703125,
      "end": 1633.719970703125,
      "text": " heathen or lost people, why? They don't understand the phrase. What I'm saying this morning is"
    },
    {
      "id": 69,
      "start": 1633.719970703125,
      "end": 1640.0799560546875,
      "text": " that as we praise God privately, it will be known in our public lives. Because it just"
    },
    {
      "id": 70,
      "start": 1640.0799560546875,
      "end": 1649.9199523925781,
      "text": " becomes an overflow. See, as believers, we don't have a situation where we have separated"
    },
    {
      "id": 71,
      "start": 1649.9199523925781,
      "end": 1661.199951171875,
      "text": " our lives into the sacred part of me and the social aspect or the societal aspect of"
    },
    {
      "id": 72,
      "start": 1661.199951171875,
      "end": 1669.2399597167969,
      "text": " my life. No, the reality is that we're Christians. And as we praise Him privately and we get"
    },
    {
      "id": 73,
      "start": 1669.2399597167969,
      "end": 1675.3199462890625,
      "text": " full of who God is, we find that it will begin to be seen even in our public life. And by"
    },
    {
      "id": 74,
      "start": 1675.3199462890625,
      "end": 1680.2399597167969,
      "text": " the way, that's a good thing. How are they going to know how good our God is if we don't"
    },
    {
      "id": 75,
      "start": 1680.2399597167969,
      "end": 1686.719970703125,
      "text": " tell them? Right? And what I mean is when it becomes a continual thing, a consistent"
    },
    {
      "id": 76,
      "start": 1686.719970703125,
      "end": 1692.5999755859375,
      "text": " thing in our life, when we're praising the Lord and we are able to show that people see,"
    },
    {
      "id": 77,
      "start": 1692.5999755859375,
      "end": 1697.2399597167969,
      "text": " man, they praise the Lord. This is real. This isn't some made up thing. This isn't something"
    },
    {
      "id": 78,
      "start": 1697.2399597167969,
      "end": 1701.4399719238281,
      "text": " that I know somebody's watching me, that I know somebody's listening, that something adverse"
    },
    {
      "id": 79,
      "start": 1701.4399719238281,
      "end": 1705.199951171875,
      "text": " has happened and we're going to see how they respond and we're going to make sure that"
    },
    {
      "id": 80,
      "start": 1705.199951171875,
      "end": 1712.7999572753906,
      "text": " we're... No. It just becomes natural. Why? Because I'm praising Him regularly. I think"
    },
    {
      "id": 81,
      "start": 1712.7999572753906,
      "end": 1721.47998046875,
      "text": " about the truth of praising God in times of positive circumstances. I would say this of"
    },
    {
      "id": 82,
      "start": 1721.47998046875,
      "end": 1727.47998046875,
      "text": " that, it's actually kind of easy. Amen? It's kind of easy to praise God when things are"
    },
    {
      "id": 83,
      "start": 1727.47998046875,
      "end": 1733.3599853515625,
      "text": " going well. I mean, when things are going well and everything's good, it's kind of easy"
    },
    {
      "id": 84,
      "start": 1733.3599853515625,
      "end": 1738.0799560546875,
      "text": " to praise God. I want to think about the situation. Turn back, if you will, to 1 Chronicles chapter"
    },
    {
      "id": 85,
      "start": 1738.0799560546875,
      "end": 1743.239990234375,
      "text": " 16. I want to take you back to an event in the life of David. And I want you to think"
    },
    {
      "id": 86,
      "start": 1743.239990234375,
      "end": 1746.719970703125,
      "text": " about what's happening here and I want you to think about the magnitude of what's going"
    },
    {
      "id": 87,
      "start": 1746.719970703125,
      "end": 1752.5599365234375,
      "text": " on and the praising that's taking place and what a great time in Israel's history this"
    },
    {
      "id": 88,
      "start": 1752.5599365234375,
      "end": 1758.6399536132812,
      "text": " is as David would lead the nation into bringing the ark back to Jerusalem. We understand that"
    },
    {
      "id": 89,
      "start": 1758.6399536132812,
      "end": 1763.9599609375,
      "text": " in chapter number 15, things did not go as they had planned for it to go. And we find,"
    },
    {
      "id": 90,
      "start": 1763.9599609375,
      "end": 1769.5999755859375,
      "text": " excuse me, in chapter number 13. In chapter number 15, the record is given of the transport"
    },
    {
      "id": 91,
      "start": 1769.5999755859375,
      "end": 1775.8399658203125,
      "text": " and how God worked and how God was praised throughout that time. And we come to chapter"
    },
    {
      "id": 92,
      "start": 1775.8399658203125,
      "end": 1782.2799682617188,
      "text": " 16, and the Bible begins with this phrase, so they brought the ark of God and set it"
    },
    {
      "id": 93,
      "start": 1782.2799682617188,
      "end": 1787.719970703125,
      "text": " in the midst of the tent that David had pitched for it. Now, this is a positive time in Israel's"
    },
    {
      "id": 94,
      "start": 1787.719970703125,
      "end": 1791.5999755859375,
      "text": " history. I mean, this is an exciting time. If you were to contrast what took place in"
    },
    {
      "id": 95,
      "start": 1791.5999755859375,
      "end": 1797.3199462890625,
      "text": " chapter 13 and what now is happening in chapter 15 and 16, you would see that this is a great"
    },
    {
      "id": 96,
      "start": 1797.3199462890625,
      "end": 1801.9999389648438,
      "text": " spiritual time of rejoicing in the nation of Israel's history."
    },
    {
      "id": 0,
      "start": 1801.9999389648438,
      "end": 1803.5999389886856,
      "text": " and David is leading,"
    },
    {
      "id": 1,
      "start": 1803.5999389886856,
      "end": 1806.8799390792847,
      "text": " and the Bible tells us that the ark is now there."
    },
    {
      "id": 2,
      "start": 1806.8799390792847,
      "end": 1808.5199389457703,
      "text": " And it tells us in v. 4,"
    },
    {
      "id": 3,
      "start": 1808.5199389457703,
      "end": 1811.0399389266968,
      "text": " \"...And he, David, appointed certain of the Levites"
    },
    {
      "id": 4,
      "start": 1811.0399389266968,
      "end": 1813.1199388504028,
      "text": " to minister before the ark of the Lord,"
    },
    {
      "id": 5,
      "start": 1813.1199388504028,
      "end": 1816.199938774109,
      "text": " and to record, and to thank and praise"
    },
    {
      "id": 6,
      "start": 1816.199938774109,
      "end": 1820.9199390411377,
      "text": " the Lord God of Israel.\""
    },
    {
      "id": 7,
      "start": 1820.9199390411377,
      "end": 1822.7999382019043,
      "text": " V. 7,"
    },
    {
      "id": 8,
      "start": 1822.7999382019043,
      "end": 1826.1999397277832,
      "text": " \"...Then on that day David delivered...\""
    },
    {
      "id": 9,
      "start": 1826.1999397277832,
      "end": 1829.4399394989014,
      "text": " Notice this word, first."
    },
    {
      "id": 10,
      "start": 1829.6399383544922,
      "end": 1832.5199394226074,
      "text": " There's a priority on praising."
    },
    {
      "id": 11,
      "start": 1832.5199394226074,
      "end": 1836.2799377441406,
      "text": " \"...Then on that day David delivered first this psalm"
    },
    {
      "id": 12,
      "start": 1836.2799377441406,
      "end": 1839.6799392700195,
      "text": " to thank the Lord into the hand of Asaph and his brethren."
    },
    {
      "id": 13,
      "start": 1839.6799392700195,
      "end": 1841.5999374389648,
      "text": " Give thanks unto the Lord."
    },
    {
      "id": 14,
      "start": 1841.5999374389648,
      "end": 1842.9599380493164,
      "text": " Call upon His name."
    },
    {
      "id": 15,
      "start": 1842.9599380493164,
      "end": 1845.6399383544922,
      "text": " Make known His deeds among the people."
    },
    {
      "id": 16,
      "start": 1845.6399383544922,
      "end": 1847.8399391174316,
      "text": " Sing unto Him. Sing psalms unto Him."
    },
    {
      "id": 17,
      "start": 1847.8399391174316,
      "end": 1849.9999389648438,
      "text": " Talk ye of all His wondrous works."
    },
    {
      "id": 18,
      "start": 1849.9999389648438,
      "end": 1851.5999374389648,
      "text": " Glory in His holy name."
    },
    {
      "id": 19,
      "start": 1851.5999374389648,
      "end": 1853.2399406433105,
      "text": " Let the heart of them rejoice."
    },
    {
      "id": 20,
      "start": 1853.2399406433105,
      "end": 1854.5199394226074,
      "text": " Seek the Lord."
    },
    {
      "id": 21,
      "start": 1854.5199394226074,
      "end": 1856.6799392700195,
      "text": " Seek the Lord and His strength."
    },
    {
      "id": 22,
      "start": 1856.7199401855469,
      "end": 1860.759937286377,
      "text": " Seek His face continually.\""
    },
    {
      "id": 23,
      "start": 1860.759937286377,
      "end": 1861.6399383544922,
      "text": " V. 25,"
    },
    {
      "id": 24,
      "start": 1861.6399383544922,
      "end": 1865.7199401855469,
      "text": " \"...For great is the Lord and greatly to be praised."
    },
    {
      "id": 25,
      "start": 1865.7199401855469,
      "end": 1867.9999389648438,
      "text": " He also is to be feared above all gods."
    },
    {
      "id": 26,
      "start": 1867.9999389648438,
      "end": 1869.9599380493164,
      "text": " For all the gods of the people are idols,"
    },
    {
      "id": 27,
      "start": 1869.9599380493164,
      "end": 1871.43994140625,
      "text": " but the Lord made the heavens.\""
    },
    {
      "id": 28,
      "start": 1871.43994140625,
      "end": 1872.319938659668,
      "text": " V. 29,"
    },
    {
      "id": 29,
      "start": 1872.319938659668,
      "end": 1874.8399353027344,
      "text": " \"...Give unto the Lord the glory due unto His name."
    },
    {
      "id": 30,
      "start": 1874.8399353027344,
      "end": 1876.6399383544922,
      "text": " Bring an offering and come before Him."
    },
    {
      "id": 31,
      "start": 1876.6399383544922,
      "end": 1879.1599426269531,
      "text": " Worship the Lord in the beauty of holiness,"
    },
    {
      "id": 32,
      "start": 1879.1599426269531,
      "end": 1881.1199417114258,
      "text": " for before Him, all the earth,"
    },
    {
      "id": 33,
      "start": 1881.1199417114258,
      "end": 1883.4799423217773,
      "text": " the world also shall be stable,"
    },
    {
      "id": 34,
      "start": 1883.4799423217773,
      "end": 1885.2399368286133,
      "text": " that it be not moved."
    },
    {
      "id": 35,
      "start": 1885.2799377441406,
      "end": 1887.199935913086,
      "text": " Let the heavens be glad,"
    },
    {
      "id": 36,
      "start": 1887.199935913086,
      "end": 1888.5599365234375,
      "text": " and let the earth rejoice,"
    },
    {
      "id": 37,
      "start": 1888.5599365234375,
      "end": 1890.3599395751953,
      "text": " and let men say among the nations,"
    },
    {
      "id": 38,
      "start": 1890.3599395751953,
      "end": 1893.9999389648438,
      "text": " The Lord reigneth."
    },
    {
      "id": 39,
      "start": 1893.9999389648438,
      "end": 1895.6399383544922,
      "text": " Let the sea roar,"
    },
    {
      "id": 40,
      "start": 1895.6399383544922,
      "end": 1897.1599426269531,
      "text": " and the fullness thereof."
    },
    {
      "id": 41,
      "start": 1897.1599426269531,
      "end": 1898.4799423217773,
      "text": " Let the fields rejoice,"
    },
    {
      "id": 42,
      "start": 1898.4799423217773,
      "end": 1899.9999389648438,
      "text": " and all that is therein."
    },
    {
      "id": 43,
      "start": 1899.9999389648438,
      "end": 1901.8399353027344,
      "text": " Then shall the trees of the woods sing out"
    },
    {
      "id": 44,
      "start": 1901.8399353027344,
      "end": 1902.9599380493164,
      "text": " at the presence of the Lord,"
    },
    {
      "id": 45,
      "start": 1902.9599380493164,
      "end": 1904.6799392700195,
      "text": " because He cometh to judge the earth.\""
    },
    {
      "id": 46,
      "start": 1904.6799392700195,
      "end": 1905.3999404907227,
      "text": " V. 34,"
    },
    {
      "id": 47,
      "start": 1905.3999404907227,
      "end": 1907.8399353027344,
      "text": " \"...Oh, give thanks unto the Lord for He is good."
    },
    {
      "id": 48,
      "start": 1907.8399353027344,
      "end": 1909.319938659668,
      "text": " For His mercy endureth forever."
    },
    {
      "id": 49,
      "start": 1909.319938659668,
      "end": 1910.5199356079102,
      "text": " And say ye,"
    },
    {
      "id": 50,
      "start": 1910.5199356079102,
      "end": 1913.0799407958984,
      "text": " Save us, O God, of our salvation,"
    },
    {
      "id": 51,
      "start": 1913.0799407958984,
      "end": 1914.199935913086,
      "text": " and gather us together,"
    },
    {
      "id": 52,
      "start": 1914.199935913086,
      "end": 1915.5999374389648,
      "text": " and deliver us from the heathen,"
    },
    {
      "id": 53,
      "start": 1915.5999374389648,
      "end": 1918.1599426269531,
      "text": " that we may give thanks to Thy holy name,"
    },
    {
      "id": 54,
      "start": 1918.1599426269531,
      "end": 1919.9599380493164,
      "text": " and glory in Thy praise.\""
    },
    {
      "id": 55,
      "start": 1919.9599380493164,
      "end": 1920.9599380493164,
      "text": " V. 36,"
    },
    {
      "id": 56,
      "start": 1920.9599380493164,
      "end": 1923.6399383544922,
      "text": " \"...Blessed be the Lord God of Israel forever and ever.\""
    },
    {
      "id": 57,
      "start": 1923.6399383544922,
      "end": 1924.7199401855469,
      "text": " And all the people said,"
    },
    {
      "id": 58,
      "start": 1924.7199401855469,
      "end": 1925.9599380493164,
      "text": " Amen,"
    },
    {
      "id": 59,
      "start": 1925.9599380493164,
      "end": 1928.4799423217773,
      "text": " and praised the Lord."
    },
    {
      "id": 60,
      "start": 1930.1199340820312,
      "end": 1932.679931640625,
      "text": " You can read many accounts such as this"
    },
    {
      "id": 61,
      "start": 1932.679931640625,
      "end": 1934.3599395751953,
      "text": " throughout Israel's history,"
    },
    {
      "id": 62,
      "start": 1934.3599395751953,
      "end": 1936.1599426269531,
      "text": " where they had some amazing things happen"
    },
    {
      "id": 63,
      "start": 1936.1599426269531,
      "end": 1938.3999328613281,
      "text": " and they responded by praising God."
    },
    {
      "id": 64,
      "start": 1939.2799377441406,
      "end": 1940.9999389648438,
      "text": " They saw the hand of the Lord at work."
    },
    {
      "id": 65,
      "start": 1940.9999389648438,
      "end": 1942.0399322509766,
      "text": " They were delivered"
    },
    {
      "id": 66,
      "start": 1942.0399322509766,
      "end": 1945.919937133789,
      "text": " and they were experiencing the miracles of God"
    },
    {
      "id": 67,
      "start": 1945.919937133789,
      "end": 1948.1199340820312,
      "text": " and they respond by praising."
    },
    {
      "id": 68,
      "start": 1948.1199340820312,
      "end": 1949.3199462890625,
      "text": " And what a blessing that is."
    },
    {
      "id": 69,
      "start": 1949.3199462890625,
      "end": 1950.9999389648438,
      "text": " That's how we ought to respond."
    },
    {
      "id": 70,
      "start": 1952.3199462890625,
      "end": 1954.4799346923828,
      "text": " The more challenging thing for us"
    },
    {
      "id": 71,
      "start": 1954.4799346923828,
      "end": 1958.0399322509766,
      "text": " is to praise the Lord during times of adversity."
    },
    {
      "id": 72,
      "start": 1958.0399322509766,
      "end": 1960.5999450683594,
      "text": " During times of adverse circumstances."
    },
    {
      "id": 73,
      "start": 1960.5999450683594,
      "end": 1963.959945678711,
      "text": " But if we're mindful of what the psalmist said in Psalm 34,"
    },
    {
      "id": 74,
      "start": 1963.959945678711,
      "end": 1966.1199340820312,
      "text": " when he said that he was going to praise the Lord,"
    },
    {
      "id": 75,
      "start": 1966.1199340820312,
      "end": 1969.3199462890625,
      "text": " bless the Lord, it says at all times."
    },
    {
      "id": 76,
      "start": 1969.3199462890625,
      "end": 1971.2799377441406,
      "text": " At all times."
    },
    {
      "id": 77,
      "start": 1971.2799377441406,
      "end": 1973.7999420166016,
      "text": " Now, the reality is that we find ourselves"
    },
    {
      "id": 78,
      "start": 1973.7999420166016,
      "end": 1975.43994140625,
      "text": " in a situation in life"
    },
    {
      "id": 79,
      "start": 1975.43994140625,
      "end": 1977.3199462890625,
      "text": " that there are times in which we have"
    },
    {
      "id": 80,
      "start": 1977.3199462890625,
      "end": 1980.679931640625,
      "text": " those positive circumstances."
    },
    {
      "id": 81,
      "start": 1980.679931640625,
      "end": 1984.0399322509766,
      "text": " It seems as if the adversity comes"
    },
    {
      "id": 82,
      "start": 1984.0399322509766,
      "end": 1988.919937133789,
      "text": " maybe more so than the times of not having adversity."
    },
    {
      "id": 83,
      "start": 1989.919937133789,
      "end": 1992.2799377441406,
      "text": " It's in those times of adversity"
    },
    {
      "id": 84,
      "start": 1992.2799377441406,
      "end": 1995.959945678711,
      "text": " that we can find ourselves in a place of challenge"
    },
    {
      "id": 85,
      "start": 1995.959945678711,
      "end": 1997.1599426269531,
      "text": " to praise the Lord."
    },
    {
      "id": 86,
      "start": 1998.1199340820312,
      "end": 2001.8799438476562,
      "text": " It's in those times that we find it maybe easy"
    },
    {
      "id": 87,
      "start": 2001.8799438476562,
      "end": 2004.0399322509766,
      "text": " to complain, to murmur,"
    },
    {
      "id": 88,
      "start": 2005.2799377441406,
      "end": 2007.6399383544922,
      "text": " to have the, woe is me,"
    },
    {
      "id": 89,
      "start": 2007.6399383544922,
      "end": 2010.3599395751953,
      "text": " to have the pity party kind of a situation."
    },
    {
      "id": 90,
      "start": 2012.3999328613281,
      "end": 2014.679931640625,
      "text": " But the reality is that the psalmist,"
    },
    {
      "id": 91,
      "start": 2014.679931640625,
      "end": 2017.0799407958984,
      "text": " when he made the resolve to praise the Lord,"
    },
    {
      "id": 92,
      "start": 2017.0799407958984,
      "end": 2021.7199401855469,
      "text": " he didn't say, I will bless the Lord when he's good to me."
    },
    {
      "id": 93,
      "start": 2022.9999389648438,
      "end": 2026.199935913086,
      "text": " Because the reality is that if it were written that way,"
    },
    {
      "id": 94,
      "start": 2026.199935913086,
      "end": 2027.919937133789,
      "text": " we would misunderstand that"
    },
    {
      "id": 95,
      "start": 2027.919937133789,
      "end": 2030.9999389648438,
      "text": " because the reality is that God is always good to us."
    },
    {
      "id": 96,
      "start": 2031.9999389648438,
      "end": 2034.8399353027344,
      "text": " But unfortunately, we sometimes interpret"
    },
    {
      "id": 97,
      "start": 2034.8399353027344,
      "end": 2036.5599365234375,
      "text": " whether he's good to us or not"
    },
    {
      "id": 98,
      "start": 2036.5599365234375,
      "end": 2039.919937133789,
      "text": " based upon our circumstances."
    },
    {
      "id": 99,
      "start": 2039.919937133789,
      "end": 2042.3599395751953,
      "text": " The Bible declares the Lord is good."
    },
    {
      "id": 100,
      "start": 2043.5599365234375,
      "end": 2044.7999420166016,
      "text": " We'll say something like this,"
    },
    {
      "id": 101,
      "start": 2044.7999420166016,
      "end": 2047.1199340820312,
      "text": " all the time, God is good."
    },
    {
      "id": 102,
      "start": 2047.1199340820312,
      "end": 2047.959945678711,
      "text": " Amen?"
    },
    {
      "id": 103,
      "start": 2047.959945678711,
      "end": 2050.199935913086,
      "text": " God is good all the time, he really is."
    },
    {
      "id": 104,
      "start": 2050.199935913086,
      "end": 2052.5199432373047,
      "text": " It's not just a cliche that we use"
    },
    {
      "id": 105,
      "start": 2052.5199432373047,
      "end": 2054.959945678711,
      "text": " because we understand that God has a purpose."
    },
    {
      "id": 106,
      "start": 2055.1199340820312,
      "end": 2056.9999389648438,
      "text": " We understand that he's sovereign"
    },
    {
      "id": 107,
      "start": 2056.9999389648438,
      "end": 2060.719940185547,
      "text": " and in his plan, he's working out his will."
    },
    {
      "id": 108,
      "start": 2060.719940185547,
      "end": 2063.159942626953,
      "text": " And there are times in which he's working out his will"
    },
    {
      "id": 109,
      "start": 2063.159942626953,
      "end": 2064.7599487304688,
      "text": " and it might require that we go through"
    },
    {
      "id": 110,
      "start": 2064.7599487304688,
      "end": 2067.43994140625,
      "text": " some level of adversity or difficulty."
    },
    {
      "id": 111,
      "start": 2070.199951171875,
      "end": 2072.919952392578,
      "text": " Think about the Apostle Paul in 2 Corinthians 12."
    },
    {
      "id": 112,
      "start": 2074.3599243164062,
      "end": 2075.679931640625,
      "text": " He's dealing with infirmity,"
    },
    {
      "id": 113,
      "start": 2075.679931640625,
      "end": 2077.43994140625,
      "text": " he's dealing with a difficulty,"
    },
    {
      "id": 114,
      "start": 2077.43994140625,
      "end": 2079.8799438476562,
      "text": " and he besought the Lord thrice, the Bible tells us."
    },
    {
      "id": 115,
      "start": 2079.8799438476562,
      "end": 2081.7599487304688,
      "text": " And the Lord's answer was what?"
    },
    {
      "id": 116,
      "start": 2081.7599487304688,
      "end": 2083.679931640625,
      "text": " My grace is sufficient for thee."
    },
    {
      "id": 117,
      "start": 2084.479949951172,
      "end": 2085.9999389648438,
      "text": " And it's interesting as you would look"
    },
    {
      "id": 118,
      "start": 2085.9999389648438,
      "end": 2087.8399353027344,
      "text": " at the response of the Apostle Paul"
    },
    {
      "id": 119,
      "start": 2087.8399353027344,
      "end": 2090.3599243164062,
      "text": " in that portion of Scripture in 2 Corinthians 12,"
    },
    {
      "id": 120,
      "start": 2090.3599243164062,
      "end": 2091.679931640625,
      "text": " when he receives that answer,"
    },
    {
      "id": 121,
      "start": 2091.679931640625,
      "end": 2093.1199340820312,
      "text": " that my grace is sufficient for thee."
    },
    {
      "id": 122,
      "start": 2093.1199340820312,
      "end": 2095.199951171875,
      "text": " In verse number nine, he ends by saying,"
    },
    {
      "id": 123,
      "start": 2095.199951171875,
      "end": 2097.5599365234375,
      "text": " most gladly therefore will I rather glory"
    },
    {
      "id": 124,
      "start": 2097.5599365234375,
      "end": 2099.479949951172,
      "text": " in my infirmities that the power of Christ"
    },
    {
      "id": 125,
      "start": 2099.479949951172,
      "end": 2100.7599487304688,
      "text": " may rest upon me."
    },
    {
      "id": 126,
      "start": 2100.7599487304688,
      "end": 2103.5999450683594,
      "text": " Therefore I take pleasure in infirmities,"
    },
    {
      "id": 127,
      "start": 2103.5999450683594,
      "end": 2105.2399291992188,
      "text": " in reproaches, in necessities,"
    },
    {
      "id": 128,
      "start": 2105.2399291992188,
      "end": 2106.959930419922,
      "text": " in persecutions, in distresses."
    },
    {
      "id": 129,
      "start": 2106.959930419922,
      "end": 2109.6399536132812,
      "text": " Notice, for Christ's sake, for when I am weak,"
    },
    {
      "id": 130,
      "start": 2109.6399536132812,
      "end": 2110.959930419922,
      "text": " then am I strong."
    },
    {
      "id": 131,
      "start": 2113.8799438476562,
      "end": 2115.3199462890625,
      "text": " There's a truth that is given to us"
    },
    {
      "id": 132,
      "start": 2115.3199462890625,
      "end": 2117.8799438476562,
      "text": " in the book of Philippians in chapter number three."
    },
    {
      "id": 133,
      "start": 2119.919952392578,
      "end": 2123.3199462890625,
      "text": " As the Apostle Paul is writing to this church in Philippi,"
    },
    {
      "id": 134,
      "start": 2123.3199462890625,
      "end": 2126.199951171875,
      "text": " we're going to eventually get to a passage in Acts"
    },
    {
      "id": 135,
      "start": 2126.199951171875,
      "end": 2128.719940185547,
      "text": " where Paul was in Philippi."
    },
    {
      "id": 136,
      "start": 2128.719940185547,
      "end": 2131.43994140625,
      "text": " But I want you to think about Paul writing this letter"
    },
    {
      "id": 137,
      "start": 2131.43994140625,
      "end": 2133.9999389648438,
      "text": " back to the believers there at Philippi,"
    },
    {
      "id": 138,
      "start": 2133.9999389648438,
      "end": 2136.719940185547,
      "text": " and I want you to understand that as he's writing"
    },
    {
      "id": 139,
      "start": 2136.719940185547,
      "end": 2140.43994140625,
      "text": " this book of rejoicing, he's writing from a place of prison,"
    },
    {
      "id": 140,
      "start": 2140.43994140625,
      "end": 2143.3599243164062,
      "text": " and we understand that as Paul is writing this book,"
    },
    {
      "id": 141,
      "start": 2144.0399475097656,
      "end": 2145.9999389648438,
      "text": " that even while he was there personally ministering,"
    },
    {
      "id": 142,
      "start": 2145.9999389648438,
      "end": 2149.1199340820312,
      "text": " he dealt with some serious adversity."
    },
    {
      "id": 143,
      "start": 2150.0399475097656,
      "end": 2152.199951171875,
      "text": " There's some serious conflict in Philippi."
    },
    {
      "id": 144,
      "start": 2153.399932861328,
      "end": 2155.5199279785156,
      "text": " We find that Paul is writing back to them"
    },
    {
      "id": 145,
      "start": 2155.5199279785156,
      "end": 2157.159942626953,
      "text": " about the importance of rejoicing"
    },
    {
      "id": 146,
      "start": 2157.159942626953,
      "end": 2160.2399291992188,
      "text": " and the idea of joy or rejoicing as a theme"
    },
    {
      "id": 147,
      "start": 2160.2399291992188,
      "end": 2163.7999267578125,
      "text": " that's found throughout the book of Philippians."
    },
    {
      "id": 148,
      "start": 2163.7999267578125,
      "end": 2165.5599365234375,
      "text": " But it's interesting in the third chapter"
    },
    {
      "id": 149,
      "start": 2165.5599365234375,
      "end": 2168.959930419922,
      "text": " as we come to verse number 10,"
    },
    {
      "id": 150,
      "start": 2168.959930419922,
      "end": 2173.959930419922,
      "text": " I've been guilty of only quoting a portion of this verse"
    },
    {
      "id": 151,
      "start": 2175.7999267578125,
      "end": 2177.399932861328,
      "text": " in Philippians 3 and verse number 10"
    },
    {
      "id": 152,
      "start": 2177.399932861328,
      "end": 2180.399932861328,
      "text": " when Paul says that I may know Him"
    },
    {
      "id": 153,
      "start": 2180.399932861328,
      "end": 2183.2399291992188,
      "text": " and the power of His resurrection."
    },
    {
      "id": 154,
      "start": 2184.1199340820312,
      "end": 2185.679931640625,
      "text": " So you think about the power of His resurrection."
    },
    {
      "id": 155,
      "start": 2185.679931640625,
      "end": 2186.719940185547,
      "text": " I mean, it's wonderful, isn't it?"
    },
    {
      "id": 156,
      "start": 2186.719940185547,
      "end": 2188.3599243164062,
      "text": " I mean, we understand the resurrection"
    },
    {
      "id": 157,
      "start": 2188.3599243164062,
      "end": 2189.6399536132812,
      "text": " is the cornerstone of our faith."
    },
    {
      "id": 158,
      "start": 2189.6399536132812,
      "end": 2192.3199462890625,
      "text": " We understand that if Christ be not risen,"
    },
    {
      "id": 159,
      "start": 2192.3199462890625,
      "end": 2194.8399353027344,
      "text": " then your faith, your preaching, it's in vain."
    },
    {
      "id": 160,
      "start": 2196.2399291992188,
      "end": 2198.1199340820312,
      "text": " But now is Christ risen, right?"
    },
    {
      "id": 161,
      "start": 2198.1199340820312,
      "end": 2200.159942626953,
      "text": " That's what he says in 1 Corinthians 15."
    },
    {
      "id": 162,
      "start": 2200.159942626953,
      "end": 2201.7999267578125,
      "text": " And we find here in Philippians 3,"
    },
    {
      "id": 163,
      "start": 2201.7999267578125,
      "end": 2204.1199340820312,
      "text": " we rejoice in the fact of the power of His resurrection,"
    },
    {
      "id": 164,
      "start": 2204.1199340820312,
      "end": 2206.159942626953,
      "text": " but notice that the Bible says this,"
    },
    {
      "id": 165,
      "start": 2206.159942626953,
      "end": 2211.0799255371094,
      "text": " and the fellowship of His sufferings"
    },
    {
      "id": 166,
      "start": 2212.43994140625,
      "end": 2215.719940185547,
      "text": " being made conformable unto His death."
    },
    {
      "id": 167,
      "start": 2216.919952392578,
      "end": 2219.959930419922,
      "text": " The fellowship of His sufferings."
    },
    {
      "id": 168,
      "start": 2221.399932861328,
      "end": 2226.399932861328,
      "text": " I'd rather focus upon the power of His resurrection"
    },
    {
      "id": 169,
      "start": 2226.5599365234375,
      "end": 2229.8799438476562,
      "text": " than the fellowship of His sufferings."
    },
    {
      "id": 170,
      "start": 2229.8799438476562,
      "end": 2233.479949951172,
      "text": " But think about the way in which our Savior suffered for us."
    },
    {
      "id": 171,
      "start": 2233.479949951172,
      "end": 2236.3599243164062,
      "text": " You think about all that took place,"
    },
    {
      "id": 172,
      "start": 2236.3599243164062,
      "end": 2239.5599365234375,
      "text": " how that God made Him to be sin for us who knew no sin,"
    },
    {
      "id": 173,
      "start": 2239.5599365234375,
      "end": 2242.0799255371094,
      "text": " that we might be made the righteousness of God in Him,"
    },
    {
      "id": 174,
      "start": 2242.0799255371094,
      "end": 2244.2799377441406,
      "text": " that we think about the things that He suffered"
    },
    {
      "id": 175,
      "start": 2244.2799377441406,
      "end": 2245.919952392578,
      "text": " and the things that He did."
    },
    {
      "id": 176,
      "start": 2245.919952392578,
      "end": 2248.719940185547,
      "text": " And we look here, the apostle is saying"
    },
    {
      "id": 177,
      "start": 2248.719940185547,
      "end": 2250.399932861328,
      "text": " that I want to know Him"
    },
    {
      "id": 178,
      "start": 2250.399932861328,
      "end": 2252.0399475097656,
      "text": " and I want to know Him in the power of His resurrection,"
    },
    {
      "id": 179,
      "start": 2252.0399475097656,
      "end": 2254.7599487304688,
      "text": " but also the fellowship of His sufferings"
    },
    {
      "id": 180,
      "start": 2254.8399353027344,
      "end": 2258.479949951172,
      "text": " being made conformable unto His death."
    },
    {
      "id": 181,
      "start": 2259.8399353027344,
      "end": 2261.8399353027344,
      "text": " I want you to think about Paul and Silas"
    },
    {
      "id": 182,
      "start": 2261.8399353027344,
      "end": 2265.5999450683594,
      "text": " as they were there in Philippi in Acts 16."
    },
    {
      "id": 183,
      "start": 2265.5999450683594,
      "end": 2267.199951171875,
      "text": " Turn back there if you will."
    },
    {
      "id": 184,
      "start": 2269.3599243164062,
      "end": 2271.8799438476562,
      "text": " I want you to, as we kind of conclude this morning"
    },
    {
      "id": 185,
      "start": 2271.8799438476562,
      "end": 2274.399932861328,
      "text": " with this thought of praising the Lord"
    },
    {
      "id": 186,
      "start": 2274.399932861328,
      "end": 2276.679931640625,
      "text": " and how that we ought to resolve to praise Him,"
    },
    {
      "id": 187,
      "start": 2276.679931640625,
      "end": 2281.679931640625,
      "text": " but we ought to be engaged in regularly praising the Lord."
    },
    {
      "id": 188,
      "start": 2281.679931640625,
      "end": 2286.679931640625,
      "text": " It begins in the private life"
    },
    {
      "id": 189,
      "start": 2287.2399291992188,
      "end": 2289.199951171875,
      "text": " of every one of God's children."
    },
    {
      "id": 190,
      "start": 2290.159942626953,
      "end": 2292.7999267578125,
      "text": " As I praise Him privately,"
    },
    {
      "id": 191,
      "start": 2292.7999267578125,
      "end": 2295.8399353027344,
      "text": " it will overflow into my public life."
    },
    {
      "id": 192,
      "start": 2298.43994140625,
      "end": 2300.6399536132812,
      "text": " As I praise Him privately and publicly,"
    },
    {
      "id": 193,
      "start": 2300.6399536132812,
      "end": 2302.719940185547,
      "text": " as I've resolved to do so,"
    },
    {
      "id": 194,
      "start": 2302.719940185547,
      "end": 2304.6399536132812,
      "text": " and I'm regularly practicing,"
    },
    {
      "id": 195,
      "start": 2304.6399536132812,
      "end": 2307.5999450683594,
      "text": " if I can use that phraseology, praising my God,"
    },
    {
      "id": 196,
      "start": 2307.5999450683594,
      "end": 2311.6399536132812,
      "text": " and I praise Him in all situations, at all times,"
    },
    {
      "id": 197,
      "start": 2311.6399536132812,
      "end": 2312.8399353027344,
      "text": " continually."
    },
    {
      "id": 198,
      "start": 2313.8399353027344,
      "end": 2316.8799438476562,
      "text": " In Acts 16, we're familiar with what's taking place here"
    },
    {
      "id": 199,
      "start": 2316.8799438476562,
      "end": 2320.1199340820312,
      "text": " as Paul and Silas are there in Philippi"
    },
    {
      "id": 200,
      "start": 2320.1199340820312,
      "end": 2323.0799560546875,
      "text": " and we understand that they received that direction"
    },
    {
      "id": 201,
      "start": 2323.0799560546875,
      "end": 2323.919921875,
      "text": " in verse number 10,"
    },
    {
      "id": 202,
      "start": 2323.919921875,
      "end": 2325.159912109375,
      "text": " after he'd seen the vision,"
    },
    {
      "id": 203,
      "start": 2325.159912109375,
      "end": 2327.9999389648438,
      "text": " immediately we endeavored to go into Macedonia,"
    },
    {
      "id": 204,
      "start": 2327.9999389648438,
      "end": 2330.0799560546875,
      "text": " assuredly gathering that the Lord had called us"
    },
    {
      "id": 205,
      "start": 2330.0799560546875,
      "end": 2332.199951171875,
      "text": " for to preach the Gospel unto them."
    },
    {
      "id": 206,
      "start": 2332.199951171875,
      "end": 2334.159912109375,
      "text": " We find that they come to Philippi."
    },
    {
      "id": 207,
      "start": 2334.159912109375,
      "end": 2336.5999145507812,
      "text": " It was the chief city of that part of Macedonia,"
    },
    {
      "id": 208,
      "start": 2336.5999145507812,
      "end": 2339.8599243164062,
      "text": " according to verse number 12 of our passage here in Acts 16."
    },
    {
      "id": 209,
      "start": 2339.8599243164062,
      "end": 2341.659912109375,
      "text": " We find that it was there that they found Lydia,"
    },
    {
      "id": 210,
      "start": 2341.659912109375,
      "end": 2343.419921875,
      "text": " a certain woman in verse number 14,"
    },
    {
      "id": 211,
      "start": 2343.419921875,
      "end": 2345.8599243164062,
      "text": " and she was baptized in her household."
    },
    {
      "id": 212,
      "start": 2345.8599243164062,
      "end": 2349.1399536132812,
      "text": " And we find that Paul is giving truth"
    },
    {
      "id": 213,
      "start": 2349.1399536132812,
      "end": 2351.659912109375,
      "text": " and it came to pass in verse 16,"
    },
    {
      "id": 214,
      "start": 2353.0999145507812,
      "end": 2354.1399536132812,
      "text": " as we went to prayer,"
    },
    {
      "id": 215,
      "start": 2354.1399536132812,
      "end": 2358.0999145507812,
      "text": " certain damsel possessed with a spirit of divination met us,"
    },
    {
      "id": 216,
      "start": 2358.0999145507812,
      "end": 2362.2199096679688,
      "text": " which brought her masters much gain by soothsaying."
    },
    {
      "id": 217,
      "start": 2362.2199096679688,
      "end": 2364.8599243164062,
      "text": " The same followed Paul and us and cried saying,"
    },
    {
      "id": 218,
      "start": 2364.8599243164062,
      "end": 2367.2199096679688,
      "text": " these men are the servants of the Most High God"
    },
    {
      "id": 219,
      "start": 2367.2199096679688,
      "end": 2370.8999633789062,
      "text": " which show unto us the way of salvation."
    },
    {
      "id": 220,
      "start": 2370.8999633789062,
      "end": 2373.2199096679688,
      "text": " And this did she many days."
    },
    {
      "id": 221,
      "start": 2373.2199096679688,
      "end": 2374.2999267578125,
      "text": " But Paul being grieved,"
    },
    {
      "id": 222,
      "start": 2374.2999267578125,
      "end": 2375.3399658203125,
      "text": " turned and said to the spirit,"
    },
    {
      "id": 223,
      "start": 2375.3399658203125,
      "end": 2377.0599365234375,
      "text": " I command thee in the name of Jesus Christ"
    },
    {
      "id": 224,
      "start": 2377.0599365234375,
      "end": 2378.2199096679688,
      "text": " to come out of her."
    },
    {
      "id": 225,
      "start": 2378.2199096679688,
      "end": 2381.1399536132812,
      "text": " And he came out the same hour."
    },
    {
      "id": 226,
      "start": 2381.1399536132812,
      "end": 2383.0199584960938,
      "text": " Can I tell you that the message of verse 17"
    },
    {
      "id": 227,
      "start": 2383.0199584960938,
      "end": 2384.699951171875,
      "text": " was a true message."
    },
    {
      "id": 228,
      "start": 2384.699951171875,
      "end": 2387.0999145507812,
      "text": " They were the men, these men,"
    },
    {
      "id": 229,
      "start": 2387.0999145507812,
      "end": 2388.9799194335938,
      "text": " they were the servants of the Most High God."
    },
    {
      "id": 230,
      "start": 2388.9799194335938,
      "end": 2391.4999389648438,
      "text": " They were showing the way of salvation."
    },
    {
      "id": 231,
      "start": 2391.4999389648438,
      "end": 2394.5399169921875,
      "text": " But that message was coming from a wrong vessel."
    },
    {
      "id": 232,
      "start": 2394.5399169921875,
      "end": 2396.3399658203125,
      "text": " There's a whole message that we could develop"
    },
    {
      "id": 233,
      "start": 2396.3399658203125,
      "end": 2398.2999267578125,
      "text": " on that single thought this morning."
    },
    {
      "id": 234,
      "start": 2399.699951171875,
      "end": 2401.8599243164062,
      "text": " We find that in verse number 19,"
    },
    {
      "id": 0,
      "start": 2401.8599243164062,
      "end": 2407.539924144745,
      "text": " as this transpired, that the masters of this one that was crying out, this one that had"
    },
    {
      "id": 1,
      "start": 2407.539924144745,
      "end": 2412.539924621582,
      "text": " the spirit of divination, this one that brought much gain by her suits, saying that when they"
    },
    {
      "id": 2,
      "start": 2412.539924621582,
      "end": 2417.499924659729,
      "text": " saw that the hope of their gains was gone, that they caught Paul and Silas and drew them"
    },
    {
      "id": 3,
      "start": 2417.499924659729,
      "end": 2422.0999240875244,
      "text": " in the marketplace and the rulers and they brought them to the magistrates saying, these"
    },
    {
      "id": 4,
      "start": 2422.0999240875244,
      "end": 2425.5799236297607,
      "text": " men being Jews do exceedingly trouble our city."
    },
    {
      "id": 5,
      "start": 2425.5799236297607,
      "end": 2426.5799236297607,
      "text": " What happened?"
    },
    {
      "id": 6,
      "start": 2426.5799236297607,
      "end": 2430.6399250030518,
      "text": " Verse 23, and when they had laid many stripes upon them, they cast them into prison, charging"
    },
    {
      "id": 7,
      "start": 2430.6399250030518,
      "end": 2435.0799255371094,
      "text": " the jailer to keep them safely, who having received such a charge, thrust them into the"
    },
    {
      "id": 8,
      "start": 2435.0799255371094,
      "end": 2438.5599250793457,
      "text": " inner prison and made their feet fast in the stocks."
    },
    {
      "id": 9,
      "start": 2438.5599250793457,
      "end": 2449.479923248291,
      "text": " And at midnight, we know the account, and at midnight Paul and Silas prayed and sang"
    },
    {
      "id": 10,
      "start": 2449.479923248291,
      "end": 2453.599925994873,
      "text": " praises unto God."
    },
    {
      "id": 11,
      "start": 2453.599925994873,
      "end": 2459.3999252319336,
      "text": " And then I noticed that last phrase, and the prisoners heard them."
    },
    {
      "id": 12,
      "start": 2459.3999252319336,
      "end": 2461.2399253845215,
      "text": " The prisoners heard them."
    },
    {
      "id": 13,
      "start": 2461.2399253845215,
      "end": 2468.439926147461,
      "text": " I'm not sure how much the prisoners knew of what had transpired."
    },
    {
      "id": 14,
      "start": 2468.439926147461,
      "end": 2477.7999267578125,
      "text": " I don't know how much they were aware of, but one thing I know is that Paul and Silas"
    },
    {
      "id": 15,
      "start": 2477.7999267578125,
      "end": 2482.3599243164062,
      "text": " were adversely dealt with here in Philippi."
    },
    {
      "id": 16,
      "start": 2482.3599243164062,
      "end": 2488.539924621582,
      "text": " We find that as they are beaten, as they are imprisoned, the Bible tells us that they not"
    },
    {
      "id": 17,
      "start": 2488.539924621582,
      "end": 2492.259925842285,
      "text": " only prayed, but they sang praises."
    },
    {
      "id": 18,
      "start": 2492.259925842285,
      "end": 2496.0599212646484,
      "text": " And as they sang praises, some people heard them."
    },
    {
      "id": 19,
      "start": 2496.0599212646484,
      "end": 2503.1799240112305,
      "text": " Now, I don't know, I've never spent a night in jail, I hope I never have to, but it would"
    },
    {
      "id": 20,
      "start": 2503.1799240112305,
      "end": 2507.5799255371094,
      "text": " seem to me, and if you want to disagree, we can talk about it later, it would seem to"
    },
    {
      "id": 21,
      "start": 2507.5799255371094,
      "end": 2514.1799240112305,
      "text": " me that some of those prisoners that heard them had probably been there for a period"
    },
    {
      "id": 22,
      "start": 2514.1799240112305,
      "end": 2515.1799240112305,
      "text": " of time."
    },
    {
      "id": 23,
      "start": 2515.419921875,
      "end": 2519.259925842285,
      "text": " Is that a safe assumption?"
    },
    {
      "id": 24,
      "start": 2519.259925842285,
      "end": 2522.7799224853516,
      "text": " No doubt, I'm not saying that all of them had been there for years, but some of them"
    },
    {
      "id": 25,
      "start": 2522.7799224853516,
      "end": 2526.33992767334,
      "text": " no doubt had been there for a period of time."
    },
    {
      "id": 26,
      "start": 2526.33992767334,
      "end": 2531.2599182128906,
      "text": " And I would venture to say that for some of them that had spent some time there, they"
    },
    {
      "id": 27,
      "start": 2531.2599182128906,
      "end": 2537.639923095703,
      "text": " had never had a night where they heard some people singing and praising God."
    },
    {
      "id": 28,
      "start": 2537.639923095703,
      "end": 2545.3199310302734,
      "text": " And I would venture to say that the Philippian jailer who knew what happened, I'd venture"
    },
    {
      "id": 29,
      "start": 2545.3199310302734,
      "end": 2549.919921875,
      "text": " to say that he'd never seen anything like it either."
    },
    {
      "id": 30,
      "start": 2549.919921875,
      "end": 2551.7399291992188,
      "text": " Why?"
    },
    {
      "id": 31,
      "start": 2551.7399291992188,
      "end": 2556.159927368164,
      "text": " Because when God sent the earthquake, and that man was ready to kill himself, and Paul"
    },
    {
      "id": 32,
      "start": 2556.159927368164,
      "end": 2561.199920654297,
      "text": " ran in and said, no, do yourself no harm, or ran out, excuse me, do yourself no harm,"
    },
    {
      "id": 33,
      "start": 2561.199920654297,
      "end": 2562.199920654297,
      "text": " right?"
    },
    {
      "id": 34,
      "start": 2562.199920654297,
      "end": 2567.419921875,
      "text": " Paul, he hollered, cried with a loud voice in verse 38, 28, excuse me, do thyself no"
    },
    {
      "id": 35,
      "start": 2568.199920654297,
      "end": 2569.199920654297,
      "text": " harm, for we're all here."
    },
    {
      "id": 36,
      "start": 2569.199920654297,
      "end": 2571.179931640625,
      "text": " What's the first thing that man says to him?"
    },
    {
      "id": 37,
      "start": 2571.179931640625,
      "end": 2576.2999267578125,
      "text": " What must I do to be saved?"
    },
    {
      "id": 38,
      "start": 2576.2999267578125,
      "end": 2577.939926147461,
      "text": " What must I do to be saved?"
    },
    {
      "id": 39,
      "start": 2577.939926147461,
      "end": 2582.459930419922,
      "text": " See, there was an impact that their praise had."
    },
    {
      "id": 40,
      "start": 2582.459930419922,
      "end": 2588.5799255371094,
      "text": " See, the reality this morning is that when we look at this passage of Scripture, and"
    },
    {
      "id": 41,
      "start": 2588.5799255371094,
      "end": 2593.0599212646484,
      "text": " we say that the psalmist had resolved to praise the Lord, that the psalmist regularly praised"
    },
    {
      "id": 42,
      "start": 2593.0599212646484,
      "end": 2598.139923095703,
      "text": " the Lord, we begin to consider how this praise should look in our lives, in my life, in your"
    },
    {
      "id": 43,
      "start": 2598.139923095703,
      "end": 2602.9799194335938,
      "text": " life, and we begin to consider and really ask ourselves this morning as we would do"
    },
    {
      "id": 44,
      "start": 2602.9799194335938,
      "end": 2611.9799194335938,
      "text": " some self-evaluation and examination and say, how is my praising?"
    },
    {
      "id": 45,
      "start": 2611.9799194335938,
      "end": 2618.5399169921875,
      "text": " How many people have heard me praising versus how many people have heard me complaining?"
    },
    {
      "id": 46,
      "start": 2618.5399169921875,
      "end": 2622.459930419922,
      "text": " How often do my children hear me praising?"
    },
    {
      "id": 47,
      "start": 2622.459930419922,
      "end": 2625.219924926758,
      "text": " How often do they hear me complaining?"
    },
    {
      "id": 48,
      "start": 2625.219924926758,
      "end": 2626.219924926758,
      "text": " How often does my spouse?"
    },
    {
      "id": 49,
      "start": 2626.219924926758,
      "end": 2627.219924926758,
      "text": " I mean, you get the idea."
    },
    {
      "id": 50,
      "start": 2627.219924926758,
      "end": 2628.7799224853516,
      "text": " I don't have to go through every single scenario, right?"
    },
    {
      "id": 51,
      "start": 2628.7799224853516,
      "end": 2633.179931640625,
      "text": " You understand what I'm saying this morning."
    },
    {
      "id": 52,
      "start": 2633.179931640625,
      "end": 2638.619918823242,
      "text": " But we find that in the time of adversity, when we find that it might be a little bit"
    },
    {
      "id": 53,
      "start": 2638.619918823242,
      "end": 2644.7799224853516,
      "text": " difficult to praise the Lord, when we understand some things, if I go back to really my thought"
    },
    {
      "id": 54,
      "start": 2644.7799224853516,
      "end": 2649.379928588867,
      "text": " that the more time we spend with God, the more time we're in His presence and we're"
    },
    {
      "id": 55,
      "start": 2649.379928588867,
      "end": 2653.3399200439453,
      "text": " understanding His character and we're understanding His excellent works, the more natural it"
    },
    {
      "id": 56,
      "start": 2653.3399200439453,
      "end": 2661.8199157714844,
      "text": " becomes that in times of adversity, it does not necessarily have to be a forced thing."
    },
    {
      "id": 57,
      "start": 2661.8199157714844,
      "end": 2662.8199157714844,
      "text": " It can still be natural."
    },
    {
      "id": 58,
      "start": 2662.8199157714844,
      "end": 2663.8199157714844,
      "text": " You say, how?"
    },
    {
      "id": 59,
      "start": 2663.8199157714844,
      "end": 2668.459930419922,
      "text": " I'm glad you asked."
    },
    {
      "id": 60,
      "start": 2668.459930419922,
      "end": 2670.419921875,
      "text": " Let me share a verse with you in Romans chapter number 8."
    },
    {
      "id": 61,
      "start": 2670.419921875,
      "end": 2677.939910888672,
      "text": " It's a verse that we know, but it's a verse sometimes I think that we know it better to"
    },
    {
      "id": 62,
      "start": 2677.939910888672,
      "end": 2686.8199157714844,
      "text": " counsel with than to practice in our lives."
    },
    {
      "id": 63,
      "start": 2686.8199157714844,
      "end": 2693.459930419922,
      "text": " The truth this morning is that in time of adversity, in time of difficulty, we still"
    },
    {
      "id": 64,
      "start": 2693.459930419922,
      "end": 2694.9799194335938,
      "text": " ought to praise the Lord."
    },
    {
      "id": 65,
      "start": 2694.9799194335938,
      "end": 2697.459930419922,
      "text": " That still would be captured in everything, right?"
    },
    {
      "id": 66,
      "start": 2697.459930419922,
      "end": 2698.459930419922,
      "text": " You agree with that?"
    },
    {
      "id": 67,
      "start": 2698.459930419922,
      "end": 2702.419921875,
      "text": " At all times, continually."
    },
    {
      "id": 68,
      "start": 2702.419921875,
      "end": 2712.7799377441406,
      "text": " In Romans chapter number 8, I want you to consider this great promise in verse 28."
    },
    {
      "id": 69,
      "start": 2712.7799377441406,
      "end": 2722.0999145507812,
      "text": " I want you to think about these first three words, and we know."
    },
    {
      "id": 70,
      "start": 2722.0999145507812,
      "end": 2729.3399353027344,
      "text": " Now to know something is different than to think something."
    },
    {
      "id": 71,
      "start": 2729.3399353027344,
      "end": 2731.0199279785156,
      "text": " Would you agree?"
    },
    {
      "id": 72,
      "start": 2731.0199279785156,
      "end": 2736.8599243164062,
      "text": " To know something is different than to assume something."
    },
    {
      "id": 73,
      "start": 2736.8599243164062,
      "end": 2738.8599243164062,
      "text": " Would you agree?"
    },
    {
      "id": 74,
      "start": 2738.8599243164062,
      "end": 2742.2599182128906,
      "text": " Paul's not making an assumption in this verse of Scripture."
    },
    {
      "id": 75,
      "start": 2742.2599182128906,
      "end": 2744.3399353027344,
      "text": " Paul's not sharing a thought."
    },
    {
      "id": 76,
      "start": 2744.3399353027344,
      "end": 2746.659912109375,
      "text": " I think this to be the case."
    },
    {
      "id": 77,
      "start": 2746.659912109375,
      "end": 2755.2599182128906,
      "text": " Paul says, and we know, because there's something that we know about God."
    },
    {
      "id": 78,
      "start": 2755.2599182128906,
      "end": 2758.2599182128906,
      "text": " There's some things that we know about the character of God."
    },
    {
      "id": 79,
      "start": 2758.2599182128906,
      "end": 2760.8599243164062,
      "text": " There's some things that we know about the sovereignty of God."
    },
    {
      "id": 80,
      "start": 2760.899932861328,
      "end": 2763.659912109375,
      "text": " There's some things that we know about the plan of God."
    },
    {
      "id": 81,
      "start": 2763.659912109375,
      "end": 2767.8599243164062,
      "text": " And so when we look at this passage of Scripture, again, Paul is the human penman that's writing"
    },
    {
      "id": 82,
      "start": 2767.8599243164062,
      "end": 2768.8599243164062,
      "text": " these words."
    },
    {
      "id": 83,
      "start": 2768.8599243164062,
      "end": 2773.3399353027344,
      "text": " He's the one that we just read of in Acts 16 that experienced that adversity."
    },
    {
      "id": 84,
      "start": 2773.3399353027344,
      "end": 2777.699920654297,
      "text": " By the way, he suffered many adversities."
    },
    {
      "id": 85,
      "start": 2777.699920654297,
      "end": 2781.939910888672,
      "text": " If you read the passage in 2 Corinthians chapter number 10, you can read a whole list of things"
    },
    {
      "id": 86,
      "start": 2781.939910888672,
      "end": 2782.939910888672,
      "text": " that he suffered."
    },
    {
      "id": 87,
      "start": 2782.939910888672,
      "end": 2787.939910888672,
      "text": " In fact, if you read the same passage of Scripture in Philippians chapter number 3 that I shared"
    },
    {
      "id": 88,
      "start": 2787.939910888672,
      "end": 2793.139923095703,
      "text": " with you in verse number 10, we find that in that same passage of Scripture, he talks"
    },
    {
      "id": 89,
      "start": 2793.139923095703,
      "end": 2796.5399169921875,
      "text": " about the fact that there were some things that he suffered."
    },
    {
      "id": 90,
      "start": 2796.5399169921875,
      "end": 2800.2599182128906,
      "text": " There were some things that he dealt with."
    },
    {
      "id": 91,
      "start": 2800.2599182128906,
      "end": 2805.7799377441406,
      "text": " We find that he would testify, as he's writing to Timothy, that the Lord delivered me out"
    },
    {
      "id": 92,
      "start": 2805.7799377441406,
      "end": 2808.419921875,
      "text": " of them all."
    },
    {
      "id": 93,
      "start": 2808.419921875,
      "end": 2814.2999267578125,
      "text": " And we find here in Romans 8 and verse 28, and we know, all right?"
    },
    {
      "id": 94,
      "start": 2814.2999267578125,
      "end": 2820.7799377441406,
      "text": " So we made focus on the word, no, but then I wanted you to make focus on the next phrase."
    },
    {
      "id": 95,
      "start": 2820.7799377441406,
      "end": 2826.2599182128906,
      "text": " And we know that, what's it say?"
    },
    {
      "id": 96,
      "start": 2826.2599182128906,
      "end": 2831.659912109375,
      "text": " All things, all things."
    },
    {
      "id": 97,
      "start": 2831.659912109375,
      "end": 2835.4999389648438,
      "text": " Now, we could ask a young person here, does that mean everything?"
    },
    {
      "id": 98,
      "start": 2835.4999389648438,
      "end": 2838.0999145507812,
      "text": " Well, yeah, and it's pretty simple, right?"
    },
    {
      "id": 99,
      "start": 2838.0999145507812,
      "end": 2839.0999145507812,
      "text": " All things."
    },
    {
      "id": 100,
      "start": 2840.0999145507812,
      "end": 2844.2599182128906,
      "text": " So, understand, as we break down the verse of Scripture, as we think about what Paul"
    },
    {
      "id": 101,
      "start": 2844.2599182128906,
      "end": 2848.5399169921875,
      "text": " is saying here, the truth that's being shared with us, he says we know something."
    },
    {
      "id": 102,
      "start": 2848.5399169921875,
      "end": 2851.939910888672,
      "text": " We have the knowledge of this truth that he's sharing."
    },
    {
      "id": 103,
      "start": 2851.939910888672,
      "end": 2855.379913330078,
      "text": " It's not something that we think or we assume."
    },
    {
      "id": 104,
      "start": 2855.379913330078,
      "end": 2864.8599243164062,
      "text": " We know that all things work together for good."
    },
    {
      "id": 105,
      "start": 2864.8599243164062,
      "end": 2866.659912109375,
      "text": " You say, pastor, you don't know about my thing."
    },
    {
      "id": 106,
      "start": 2866.659912109375,
      "end": 2869.899932861328,
      "text": " I might not know about your thing, but God does."
    },
    {
      "id": 107,
      "start": 2869.899932861328,
      "end": 2872.0199279785156,
      "text": " Is that fair to say?"
    },
    {
      "id": 108,
      "start": 2872.0199279785156,
      "end": 2873.0199279785156,
      "text": " He's omniscient, right?"
    },
    {
      "id": 109,
      "start": 2873.0199279785156,
      "end": 2874.5799255371094,
      "text": " He knows about it."
    },
    {
      "id": 110,
      "start": 2874.5799255371094,
      "end": 2881.0199279785156,
      "text": " And can I tell you that in the history of humankind, in over 6,000 years of human history,"
    },
    {
      "id": 111,
      "start": 2881.0199279785156,
      "end": 2886.0999145507812,
      "text": " you are not the first one to experience your thing."
    },
    {
      "id": 112,
      "start": 2886.0999145507812,
      "end": 2887.0999145507812,
      "text": " Would you agree?"
    },
    {
      "id": 113,
      "start": 2887.0999145507812,
      "end": 2891.0199279785156,
      "text": " You say, no, you don't know what I'm dealing with, pastor."
    },
    {
      "id": 114,
      "start": 2891.0199279785156,
      "end": 2894.5799255371094,
      "text": " There's been billions of people that have lived upon this earth."
    },
    {
      "id": 115,
      "start": 2894.5799255371094,
      "end": 2898.2599182128906,
      "text": " I am not the only one that's ever dealt with some difficulty, and neither are you."
    },
    {
      "id": 116,
      "start": 2898.2599182128906,
      "end": 2903.179931640625,
      "text": " And I'm not trying to be, I'm trying to be facetious a little bit, but I'm trying to"
    },
    {
      "id": 117,
      "start": 2903.179931640625,
      "end": 2905.379913330078,
      "text": " help us this morning."
    },
    {
      "id": 118,
      "start": 2905.379913330078,
      "end": 2910.6199340820312,
      "text": " Because the reality is that sometimes we think that our particular circumstance or our particular"
    },
    {
      "id": 119,
      "start": 2910.6199340820312,
      "end": 2915.179931640625,
      "text": " situation is like nothing else that anyone else has ever experienced."
    },
    {
      "id": 120,
      "start": 2915.179931640625,
      "end": 2918.5798950195312,
      "text": " But that's not true."
    },
    {
      "id": 121,
      "start": 2918.5798950195312,
      "end": 2922.1399536132812,
      "text": " It's just not true."
    },
    {
      "id": 122,
      "start": 2922.1399536132812,
      "end": 2926.8599243164062,
      "text": " And so we look at this and we understand that the truth that God is sharing with us"
    },
    {
      "id": 123,
      "start": 2926.8599243164062,
      "end": 2932.0999145507812,
      "text": " is that we know that all things work together for good."
    },
    {
      "id": 124,
      "start": 2932.0999145507812,
      "end": 2944.89990234375,
      "text": " To them, it says this, that love God to them who are the called according to His purpose."
    },
    {
      "id": 125,
      "start": 2944.89990234375,
      "end": 2949.659912109375,
      "text": " We love Him because He first loved us."
    },
    {
      "id": 126,
      "start": 2949.659912109375,
      "end": 2951.7399291992188,
      "text": " If you love me, keep my commandments."
    },
    {
      "id": 127,
      "start": 2952.3399047851562,
      "end": 2955.419921875,
      "text": " I've had people share with me as I've sought to give them encouragement from this verse"
    },
    {
      "id": 128,
      "start": 2955.419921875,
      "end": 2956.4598999023438,
      "text": " of Scripture."
    },
    {
      "id": 129,
      "start": 2956.4598999023438,
      "end": 2962.659912109375,
      "text": " It doesn't apply to me because I'm not one that was called according to His purpose."
    },
    {
      "id": 130,
      "start": 2962.659912109375,
      "end": 2967.89990234375,
      "text": " What a way to twist Scripture."
    },
    {
      "id": 131,
      "start": 2967.89990234375,
      "end": 2970.1399536132812,
      "text": " I think about Joseph."
    },
    {
      "id": 132,
      "start": 2970.1399536132812,
      "end": 2974.659912109375,
      "text": " Many of you know Joseph is named Joseph and not Christopher, because I love the Bible"
    },
    {
      "id": 133,
      "start": 2974.659912109375,
      "end": 2975.659912109375,
      "text": " character Joseph."
    },
    {
      "id": 134,
      "start": 2975.659912109375,
      "end": 2979.7799072265625,
      "text": " His middle name is Christopher."
    },
    {
      "id": 135,
      "start": 2979.7799072265625,
      "end": 2986.699951171875,
      "text": " Joseph was a man, as you would read his life account in Genesis 37 through 50, you begin"
    },
    {
      "id": 136,
      "start": 2986.699951171875,
      "end": 2991.4999389648438,
      "text": " to see that he suffered some terrible things."
    },
    {
      "id": 137,
      "start": 2991.4999389648438,
      "end": 2998.2999267578125,
      "text": " In fact, I would venture to say that most of us in this room have never encountered"
    },
    {
      "id": 138,
      "start": 2998.2999267578125,
      "end": 3000.179931640625,
      "text": " half of what he had to deal with."
    },
    {
      "id": 0,
      "start": 3000.179931640625,
      "end": 3008.6599311828613,
      "text": " But you know what's amazing is that we know the end of the story for the life of Joseph."
    },
    {
      "id": 1,
      "start": 3008.6599311828613,
      "end": 3011.5399312973022,
      "text": " We know how he ended up in the palace."
    },
    {
      "id": 2,
      "start": 3011.5399312973022,
      "end": 3013.97993183136,
      "text": " We know how everything kind of worked out."
    },
    {
      "id": 3,
      "start": 3013.97993183136,
      "end": 3022.339931488037,
      "text": " But you know when he was in Potiphar's house, before that when he was in the pit, when he"
    },
    {
      "id": 4,
      "start": 3022.339931488037,
      "end": 3029.5799312591553,
      "text": " was in Potiphar's house, when he was in the prison, when he was forgotten for two years,"
    },
    {
      "id": 5,
      "start": 3029.5799312591553,
      "end": 3035.2599334716797,
      "text": " all of those things were the culmination of what God was doing in the life of that man"
    },
    {
      "id": 6,
      "start": 3035.2599334716797,
      "end": 3037.5399322509766,
      "text": " Joseph."
    },
    {
      "id": 7,
      "start": 3037.5399322509766,
      "end": 3041.6999320983887,
      "text": " I've often said this as I've thought about the life of Joseph as it's given to us in"
    },
    {
      "id": 8,
      "start": 3041.6999320983887,
      "end": 3046.5399322509766,
      "text": " that portion of scripture, we begin to think of all that took place and all that transpired."
    },
    {
      "id": 9,
      "start": 3046.5399322509766,
      "end": 3050.6999320983887,
      "text": " In fact, Joseph would have this of his own testimony when he speaks to his brothers,"
    },
    {
      "id": 10,
      "start": 3050.6999320983887,
      "end": 3052.859931945801,
      "text": " as for you, you thought evil, right?"
    },
    {
      "id": 11,
      "start": 3052.859931945801,
      "end": 3058.5399322509766,
      "text": " They meant it for evil, but he says this in Genesis 50 and verse 19, and Joseph said to"
    },
    {
      "id": 12,
      "start": 3058.5399322509766,
      "end": 3062.179931640625,
      "text": " them, fear not, for am I in the place of God?"
    },
    {
      "id": 13,
      "start": 3062.179931640625,
      "end": 3069.6599349975586,
      "text": " But as for you, you thought evil against me, but God meant it unto good to bring to pass"
    },
    {
      "id": 14,
      "start": 3069.6599349975586,
      "end": 3074.0999298095703,
      "text": " as it is this day to save much people alive."
    },
    {
      "id": 15,
      "start": 3074.0999298095703,
      "end": 3081.0199279785156,
      "text": " What a perspective that Joseph had, a perspective that would do well for us to learn about and"
    },
    {
      "id": 16,
      "start": 3081.0199279785156,
      "end": 3084.3399353027344,
      "text": " really implement in our own lives."
    },
    {
      "id": 17,
      "start": 3084.3399353027344,
      "end": 3088.6199340820312,
      "text": " Joseph had this understanding that because he was in a pit, because he was in Potiphar's"
    },
    {
      "id": 18,
      "start": 3088.6199340820312,
      "end": 3092.179931640625,
      "text": " house, because he was in the prison, it's what led him to be in the palace."
    },
    {
      "id": 19,
      "start": 3092.179931640625,
      "end": 3095.779930114746,
      "text": " And as he's in the palace, he's able to interpret this dream obviously before he gets to the"
    },
    {
      "id": 20,
      "start": 3095.779930114746,
      "end": 3100.6999282836914,
      "text": " palace, but even think about the time in which he's in the prison."
    },
    {
      "id": 21,
      "start": 3100.6999282836914,
      "end": 3104.8199310302734,
      "text": " Would he have met the butler and baker if he was still in Potiphar's house?"
    },
    {
      "id": 22,
      "start": 3104.8199310302734,
      "end": 3106.9399337768555,
      "text": " Most likely not."
    },
    {
      "id": 23,
      "start": 3106.9399337768555,
      "end": 3110.4199295043945,
      "text": " So he meets the butler and the baker because he's in the prison house."
    },
    {
      "id": 24,
      "start": 3110.4199295043945,
      "end": 3112.5399322509766,
      "text": " By the way, did he deserve to be there?"
    },
    {
      "id": 25,
      "start": 3112.5399322509766,
      "end": 3113.5399322509766,
      "text": " No."
    },
    {
      "id": 26,
      "start": 3113.7399291992188,
      "end": 3115.779930114746,
      "text": " Do you know how many people say, I don't deserve this?"
    },
    {
      "id": 27,
      "start": 3115.779930114746,
      "end": 3117.979934692383,
      "text": " I understand."
    },
    {
      "id": 28,
      "start": 3117.979934692383,
      "end": 3122.459930419922,
      "text": " Let God be God."
    },
    {
      "id": 29,
      "start": 3122.459930419922,
      "end": 3124.5399322509766,
      "text": " He's in the prison house."
    },
    {
      "id": 30,
      "start": 3124.5399322509766,
      "end": 3125.8199310302734,
      "text": " He interprets the dreams."
    },
    {
      "id": 31,
      "start": 3125.8199310302734,
      "end": 3127.579933166504,
      "text": " The butler and the baker go back."
    },
    {
      "id": 32,
      "start": 3127.579933166504,
      "end": 3130.459930419922,
      "text": " The butler, he restored to his butlership, right?"
    },
    {
      "id": 33,
      "start": 3130.459930419922,
      "end": 3131.459930419922,
      "text": " The baker, he's killed."
    },
    {
      "id": 34,
      "start": 3131.459930419922,
      "end": 3134.459930419922,
      "text": " That was the interpretation of the dreams."
    },
    {
      "id": 35,
      "start": 3134.459930419922,
      "end": 3136.8199310302734,
      "text": " And what does Joseph say to them?"
    },
    {
      "id": 36,
      "start": 3136.8199310302734,
      "end": 3140.8599243164062,
      "text": " There's one request that he makes, remember me."
    },
    {
      "id": 37,
      "start": 3140.8599243164062,
      "end": 3141.8599243164062,
      "text": " Remember me."
    },
    {
      "id": 38,
      "start": 3142.379928588867,
      "end": 3146.4999389648438,
      "text": " And it's interesting because after the butler gets back, guess what the butler does?"
    },
    {
      "id": 39,
      "start": 3146.4999389648438,
      "end": 3148.0999298095703,
      "text": " He conveniently forgets."
    },
    {
      "id": 40,
      "start": 3148.0999298095703,
      "end": 3150.0999298095703,
      "text": " Isn't that helpful?"
    },
    {
      "id": 41,
      "start": 3150.0999298095703,
      "end": 3155.7399291992188,
      "text": " But I want you to think about what's going on in the life of Joseph."
    },
    {
      "id": 42,
      "start": 3155.7399291992188,
      "end": 3160.379928588867,
      "text": " I want you to just for a moment think about Joseph in this particular situation and think"
    },
    {
      "id": 43,
      "start": 3160.379928588867,
      "end": 3164.699935913086,
      "text": " about the way in which he was forgotten for those two full years."
    },
    {
      "id": 44,
      "start": 3164.699935913086,
      "end": 3170.5799255371094,
      "text": " And as he's there in that situation, as he's dealing with in that prison and all that he's"
    },
    {
      "id": 45,
      "start": 3170.5799255371094,
      "end": 3176.8599243164062,
      "text": " dealing with, we find that it's during that time that Pharaoh dreamed a dream."
    },
    {
      "id": 46,
      "start": 3176.8599243164062,
      "end": 3185.459930419922,
      "text": " Now, had the butler returned immediately and said to the Pharaoh, there's a guy in prison"
    },
    {
      "id": 47,
      "start": 3185.459930419922,
      "end": 3186.459930419922,
      "text": " that interpret my dream."
    },
    {
      "id": 48,
      "start": 3186.459930419922,
      "end": 3193.0199279785156,
      "text": " I mean, it came to pass just as he said, what do you think Pharaoh would have said?"
    },
    {
      "id": 49,
      "start": 3193.0199279785156,
      "end": 3197.7799377441406,
      "text": " I think he would have said, that's great, but I got guys that interpret dreams, right?"
    },
    {
      "id": 50,
      "start": 3197.7799377441406,
      "end": 3201.219924926758,
      "text": " Where did Pharaoh go first after he dreamed his dream in chapter number 41?"
    },
    {
      "id": 51,
      "start": 3201.219924926758,
      "end": 3203.659927368164,
      "text": " He went to his magicians and his astrologers."
    },
    {
      "id": 52,
      "start": 3203.659927368164,
      "end": 3207.2599334716797,
      "text": " That's what he did for them to interpret the dream."
    },
    {
      "id": 53,
      "start": 3207.2599334716797,
      "end": 3208.2599334716797,
      "text": " But guess what?"
    },
    {
      "id": 54,
      "start": 3208.2599334716797,
      "end": 3210.3399353027344,
      "text": " They couldn't interpret the dream."
    },
    {
      "id": 55,
      "start": 3210.3399353027344,
      "end": 3216.0599365234375,
      "text": " It's at that particular time that Joseph says or that the butler says, I remember my false"
    },
    {
      "id": 56,
      "start": 3216.0599365234375,
      "end": 3217.0599365234375,
      "text": " this day."
    },
    {
      "id": 57,
      "start": 3217.0599365234375,
      "end": 3222.139938354492,
      "text": " And I remember as I was in prison, there's a guy by the name of Joseph, in Hebrew, interpreted"
    },
    {
      "id": 58,
      "start": 3222.139938354492,
      "end": 3223.139938354492,
      "text": " my dream."
    },
    {
      "id": 59,
      "start": 3223.139938354492,
      "end": 3225.219924926758,
      "text": " What does Pharaoh say at that point?"
    },
    {
      "id": 60,
      "start": 3225.219924926758,
      "end": 3227.2599334716797,
      "text": " Bring him to me."
    },
    {
      "id": 61,
      "start": 3227.2599334716797,
      "end": 3228.3399353027344,
      "text": " Bring him to me."
    },
    {
      "id": 62,
      "start": 3228.3399353027344,
      "end": 3233.5399322509766,
      "text": " So for two years he's forgotten in prison, but you see the timing of God."
    },
    {
      "id": 63,
      "start": 3233.5399322509766,
      "end": 3235.219924926758,
      "text": " You see the hand of the Lord."
    },
    {
      "id": 64,
      "start": 3235.219924926758,
      "end": 3240.2599334716797,
      "text": " Now here's the thing, and I understand this, and I hope that it just helps us."
    },
    {
      "id": 65,
      "start": 3240.2599334716797,
      "end": 3243.7799377441406,
      "text": " I understand that we're looking at a historical account."
    },
    {
      "id": 66,
      "start": 3243.7799377441406,
      "end": 3247.7399291992188,
      "text": " We're looking at the whole process and we're seeing the end."
    },
    {
      "id": 67,
      "start": 3247.7399291992188,
      "end": 3252.0399322509766,
      "text": " But for each one of us, we're living life moment by moment."
    },
    {
      "id": 68,
      "start": 3252.0399322509766,
      "end": 3255.219924926758,
      "text": " We might be in the midst somewhere in those two years, right?"
    },
    {
      "id": 69,
      "start": 3255.219924926758,
      "end": 3259.4999389648438,
      "text": " And we just feel like we can't see anything positive."
    },
    {
      "id": 70,
      "start": 3259.4999389648438,
      "end": 3265.219940185547,
      "text": " But we don't have to pretend to praise God in the time of adversity because we can have"
    },
    {
      "id": 71,
      "start": 3265.219940185547,
      "end": 3268.93994140625,
      "text": " the knowledge that our God is working."
    },
    {
      "id": 72,
      "start": 3268.93994140625,
      "end": 3275.9799194335938,
      "text": " And I may not have to know how He is working, but I can simply rejoice and then praise Him"
    },
    {
      "id": 73,
      "start": 3275.9799194335938,
      "end": 3277.4999389648438,
      "text": " that He is working."
    },
    {
      "id": 74,
      "start": 3277.4999389648438,
      "end": 3280.2999267578125,
      "text": " Does that make sense?"
    },
    {
      "id": 75,
      "start": 3280.2999267578125,
      "end": 3281.8199462890625,
      "text": " I hope that it helps some."
    },
    {
      "id": 76,
      "start": 3282.5799255371094,
      "end": 3286.699920654297,
      "text": " It's helped me because there's some times that you deal with some things in your life"
    },
    {
      "id": 77,
      "start": 3286.699920654297,
      "end": 3289.8599243164062,
      "text": " and you say, what is going on?"
    },
    {
      "id": 78,
      "start": 3289.8599243164062,
      "end": 3291.659942626953,
      "text": " What is this all about?"
    },
    {
      "id": 79,
      "start": 3291.659942626953,
      "end": 3294.139923095703,
      "text": " You say, God is working."
    },
    {
      "id": 80,
      "start": 3294.139923095703,
      "end": 3298.0199279785156,
      "text": " I don't know about you, but during the whole COVID thing that we're still dealing with,"
    },
    {
      "id": 81,
      "start": 3298.0199279785156,
      "end": 3303.459930419922,
      "text": " there have been plenty of times that it's like, what is going on?"
    },
    {
      "id": 82,
      "start": 3303.459930419922,
      "end": 3307.8199462890625,
      "text": " Everything that you ever think about ministry has changed dramatically."
    },
    {
      "id": 83,
      "start": 3307.8199462890625,
      "end": 3313.219940185547,
      "text": " I never have had to tell people, I'm sorry, you can't come to church until COVID."
    },
    {
      "id": 84,
      "start": 3313.219940185547,
      "end": 3315.0599365234375,
      "text": " I was talking to a missionary friend the other day."
    },
    {
      "id": 85,
      "start": 3315.0599365234375,
      "end": 3320.8599243164062,
      "text": " I said, in fact, all of my years of ministry has been trying to get people to come to church."
    },
    {
      "id": 86,
      "start": 3320.8599243164062,
      "end": 3322.5399169921875,
      "text": " He said, yeah, pack a pew, brother."
    },
    {
      "id": 87,
      "start": 3322.5399169921875,
      "end": 3326.219940185547,
      "text": " I was like, I wish we could just, yeah, it'd be great."
    },
    {
      "id": 88,
      "start": 3326.219940185547,
      "end": 3328.139923095703,
      "text": " You can't, right?"
    },
    {
      "id": 89,
      "start": 3328.139923095703,
      "end": 3329.139923095703,
      "text": " Unless you're family."
    },
    {
      "id": 90,
      "start": 3329.139923095703,
      "end": 3337.5799255371094,
      "text": " I got a phone call on Friday, pastor, I just want to share with you, so-and-so got saved."
    },
    {
      "id": 91,
      "start": 3338.3399353027344,
      "end": 3345.459930419922,
      "text": " I would venture to say that if it were not for COVID,"
    },
    {
      "id": 92,
      "start": 3345.459930419922,
      "end": 3348.3399353027344,
      "text": " they probably never would have watched our services online."
    },
    {
      "id": 93,
      "start": 3352.699920654297,
      "end": 3355.899932861328,
      "text": " By the way, that's the fourth phone call I've gotten during this time"
    },
    {
      "id": 94,
      "start": 3355.899932861328,
      "end": 3357.9799194335938,
      "text": " of people that have gotten saved."
    },
    {
      "id": 95,
      "start": 3359.6199340820312,
      "end": 3364.7799377441406,
      "text": " When COVID came in, pastors were talking together how we were going to,"
    },
    {
      "id": 96,
      "start": 3364.7799377441406,
      "end": 3368.5399169921875,
      "text": " I had pastors, I'm ready to go underground if I have to go underground."
    },
    {
      "id": 97,
      "start": 3368.5399169921875,
      "end": 3371.659942626953,
      "text": " I mean, just do what we got to do, right?"
    },
    {
      "id": 98,
      "start": 3371.659942626953,
      "end": 3372.8599243164062,
      "text": " God's God."
    },
    {
      "id": 99,
      "start": 3372.8599243164062,
      "end": 3374.7399291992188,
      "text": " He's working."
    },
    {
      "id": 100,
      "start": 3374.7399291992188,
      "end": 3379.6199340820312,
      "text": " Somebody called me up just shortly after that phone call."
    },
    {
      "id": 101,
      "start": 3379.6199340820312,
      "end": 3381.9799194335938,
      "text": " Said, pastor, my heart's so overwhelmed."
    },
    {
      "id": 102,
      "start": 3381.9799194335938,
      "end": 3383.6199340820312,
      "text": " I just got to share it with somebody."
    },
    {
      "id": 103,
      "start": 3383.6199340820312,
      "end": 3384.419921875,
      "text": " It's going to burst."
    },
    {
      "id": 104,
      "start": 3384.419921875,
      "end": 3386.4999389648438,
      "text": " God answered a prayer."
    },
    {
      "id": 105,
      "start": 3386.4999389648438,
      "end": 3388.7799377441406,
      "text": " And they're just rejoicing."
    },
    {
      "id": 106,
      "start": 3388.7799377441406,
      "end": 3390.219940185547,
      "text": " I mean, they were just so ecstatic."
    },
    {
      "id": 107,
      "start": 3390.219940185547,
      "end": 3391.93994140625,
      "text": " It was great."
    },
    {
      "id": 108,
      "start": 3391.93994140625,
      "end": 3394.9799194335938,
      "text": " Those are pleasant phone calls, by the way."
    },
    {
      "id": 109,
      "start": 3394.9799194335938,
      "end": 3400.5799255371094,
      "text": " What I'm saying this morning is that we all are dealing with personally"
    },
    {
      "id": 110,
      "start": 3400.5799255371094,
      "end": 3404.9799194335938,
      "text": " different scenarios and situations."
    },
    {
      "id": 111,
      "start": 3404.9799194335938,
      "end": 3408.699920654297,
      "text": " And we have to have this understanding, praise him, praise him."
    },
    {
      "id": 112,
      "start": 3408.699920654297,
      "end": 3409.8199462890625,
      "text": " Our God is worthy."
    },
    {
      "id": 113,
      "start": 3409.8199462890625,
      "end": 3412.139923095703,
      "text": " We purpose, we resolve."
    },
    {
      "id": 114,
      "start": 3412.139923095703,
      "end": 3415.699920654297,
      "text": " I'm going to praise him at all times."
    },
    {
      "id": 115,
      "start": 3415.699920654297,
      "end": 3417.8199462890625,
      "text": " His praise shall continually be in my mouth."
    },
    {
      "id": 116,
      "start": 3417.8199462890625,
      "end": 3422.459930419922,
      "text": " Look up Hebrews 13 and verse number 15, that we're to offer our praise,"
    },
    {
      "id": 117,
      "start": 3422.459930419922,
      "end": 3428.2599182128906,
      "text": " the sacrifice of our lips, our praise given thanks to God continually."
    },
    {
      "id": 118,
      "start": 3428.2599182128906,
      "end": 3432.93994140625,
      "text": " And we make that resolve, and then we regularly praise him."
    },
    {
      "id": 119,
      "start": 3432.93994140625,
      "end": 3437.5399169921875,
      "text": " Privately, and it overflows into public."
    },
    {
      "id": 120,
      "start": 3437.5399169921875,
      "end": 3442.3399353027344,
      "text": " And then we're praising him in good times and in times that maybe we wouldn't"
    },
    {
      "id": 121,
      "start": 3442.3399353027344,
      "end": 3445.5399169921875,
      "text": " describe as being good times."
    },
    {
      "id": 122,
      "start": 3445.5399169921875,
      "end": 3454.179931640625,
      "text": " But we know, we know that in all things, our God is working."
    },
    {
      "id": 123,
      "start": 3454.179931640625,
      "end": 3459.6199340820312,
      "text": " And the reality this morning is that when I have that knowledge that God is working,"
    },
    {
      "id": 124,
      "start": 3459.6199340820312,
      "end": 3466.3399353027344,
      "text": " and I have that proper perspective, it helps me to praise him in the moment."
    },
    {
      "id": 125,
      "start": 3466.3399353027344,
      "end": 3472.0199279785156,
      "text": " Because I say, I don't know what God's doing, but God's a whole lot wiser than I am."
    },
    {
      "id": 126,
      "start": 3472.0199279785156,
      "end": 3472.3399353027344,
      "text": " Right?"
    },
    {
      "id": 127,
      "start": 3472.3399353027344,
      "end": 3473.3799438476562,
      "text": " He transcends us."
    },
    {
      "id": 128,
      "start": 3473.3799438476562,
      "end": 3474.459930419922,
      "text": " His ways are not our ways."
    },
    {
      "id": 129,
      "start": 3474.459930419922,
      "end": 3476.419921875,
      "text": " His thoughts are not our thoughts."
    },
    {
      "id": 130,
      "start": 3476.419921875,
      "end": 3480.419921875,
      "text": " And we understand that truth, and we say, I don't understand all that God's doing,"
    },
    {
      "id": 131,
      "start": 3480.419921875,
      "end": 3484.699920654297,
      "text": " but I'm going to praise him because I know he's doing something good."
    },
    {
      "id": 132,
      "start": 3484.699920654297,
      "end": 3493.3399353027344,
      "text": " He's doing something that he's doing for my good and for his glory."
    },
    {
      "id": 133,
      "start": 3493.3799438476562,
      "end": 3502.4999389648438,
      "text": " John chapter number 11, Lazarus is sick, and Jesus delays."
    },
    {
      "id": 134,
      "start": 3502.4999389648438,
      "end": 3505.219940185547,
      "text": " Right?"
    },
    {
      "id": 135,
      "start": 3505.219940185547,
      "end": 3510.6199340820312,
      "text": " Martha and Mary find that Jesus is coming, but Lazarus is already dead."
    },
    {
      "id": 136,
      "start": 3510.6199340820312,
      "end": 3512.179931640625,
      "text": " You know what they say?"
    },
    {
      "id": 137,
      "start": 3512.179931640625,
      "end": 3517.7399291992188,
      "text": " If you had been here, my brother had not died."
    },
    {
      "id": 138,
      "start": 3517.7399291992188,
      "end": 3521.7399291992188,
      "text": " And I believe that there was some absolute truth in what they said."
    },
    {
      "id": 139,
      "start": 3521.7399291992188,
      "end": 3526.4599609375,
      "text": " They fully believed that if Jesus was there, that he could have healed that sickness."
    },
    {
      "id": 140,
      "start": 3526.4599609375,
      "end": 3529.7799072265625,
      "text": " But Jesus said, I'm going to do greater works."
    },
    {
      "id": 141,
      "start": 3529.7799072265625,
      "end": 3534.7399291992188,
      "text": " And in fact, he told his disciples before he ever left, when he announced that Lazarus was dead,"
    },
    {
      "id": 142,
      "start": 3534.7399291992188,
      "end": 3539.7799072265625,
      "text": " he said, I am glad for your sakes that I was not there."
    },
    {
      "id": 143,
      "start": 3539.7799072265625,
      "end": 3542.419921875,
      "text": " Why? Because God's working."
    },
    {
      "id": 144,
      "start": 3542.419921875,
      "end": 3549.5399169921875,
      "text": " And you know that even the Jewish people that were there to mourn the death of Lazarus,"
    },
    {
      "id": 145,
      "start": 3549.5399169921875,
      "end": 3554.3399047851562,
      "text": " they even believed that Jesus could have done something if he was there."
    },
    {
      "id": 146,
      "start": 3554.3399047851562,
      "end": 3560.4999389648438,
      "text": " You read it, you'll see that they make the same comments about what Jesus is able to do."
    },
    {
      "id": 147,
      "start": 3560.4999389648438,
      "end": 3565.3399047851562,
      "text": " But then after Jesus stood there and said, Lazarus, come forth,"
    },
    {
      "id": 148,
      "start": 3565.3399047851562,
      "end": 3570.8599243164062,
      "text": " there was a whole new level of understanding of what God is able to do."
    },
    {
      "id": 149,
      "start": 3570.8599243164062,
      "end": 3575.659912109375,
      "text": " They saw something that they would not have seen otherwise."
    },
    {
      "id": 150,
      "start": 3575.699951171875,
      "end": 3578.1399536132812,
      "text": " Can I tell you that this is real simple?"
    },
    {
      "id": 151,
      "start": 3578.1399536132812,
      "end": 3583.89990234375,
      "text": " Lazarus had to die in order for Jesus to raise him from the dead."
    },
    {
      "id": 152,
      "start": 3583.89990234375,
      "end": 3587.3799438476562,
      "text": " That's basic, right?"
    },
    {
      "id": 153,
      "start": 3587.3799438476562,
      "end": 3592.419921875,
      "text": " But there was some heartache in that whole process by Martha and Mary."
    },
    {
      "id": 154,
      "start": 3592.419921875,
      "end": 3594.8599243164062,
      "text": " But they got to see what God was able to do."
    },
    {
      "id": 155,
      "start": 3594.8599243164062,
      "end": 3596.4599609375,
      "text": " Praise him, praise him."
    },
    {
      "id": 156,
      "start": 3596.4599609375,
      "end": 3598.1399536132812,
      "text": " He's worthy of it."
    },
    {
      "id": 157,
      "start": 3598.1399536132812,
      "end": 3599.8599243164062,
      "text": " I hope that we'd resolve this morning."
    },
    {
      "id": 0,
      "start": 3599.8599243164062,
      "end": 3605.2199244499207,
      "text": " praise Him, and that we'd regularly practice praising our God, for He is worthy."
    },
    {
      "id": 1,
      "start": 3605.2199244499207,
      "end": 3606.2199244499207,
      "text": " Let's pray."
    },
    {
      "id": 2,
      "start": 3606.2199244499207,
      "end": 3607.2199244499207,
      "text": " Father, we love You."
    },
    {
      "id": 3,
      "start": 3607.2199244499207,
      "end": 3608.3399238586426,
      "text": " We thank You for loving us."
    },
    {
      "id": 4,
      "start": 3608.3399238586426,
      "end": 3611.739924430847,
      "text": " Thank You for the Word of God, the truth contained therein."
    },
    {
      "id": 5,
      "start": 3611.739924430847,
      "end": 3622.7799243927,
      "text": " God, we can see in Your Word the importance of resolving, as the psalmist did, to praise"
    },
    {
      "id": 6,
      "start": 3622.7799243927,
      "end": 3623.7799243927,
      "text": " You."
    },
    {
      "id": 7,
      "start": 3623.7799243927,
      "end": 3631.5799236297607,
      "text": " I thank You that You've put a new song in my heart to even praise unto my God."
    },
    {
      "id": 8,
      "start": 3631.5799236297607,
      "end": 3641.1799240112305,
      "text": " We understand that Your character and Your work, they demand our praise."
    },
    {
      "id": 9,
      "start": 3641.1799240112305,
      "end": 3643.099925994873,
      "text": " You're worthy of it."
    },
    {
      "id": 10,
      "start": 3643.099925994873,
      "end": 3650.659923553467,
      "text": " God, as we think about some of the examples that we referenced this morning, I thank You"
    },
    {
      "id": 11,
      "start": 3650.659923553467,
      "end": 3653.099925994873,
      "text": " for the instruction that they provide."
    },
    {
      "id": 12,
      "start": 3653.099925994873,
      "end": 3663.37992477417,
      "text": " And Lord, I know, however, that as we walk this journey called life, that there are some"
    },
    {
      "id": 13,
      "start": 3663.37992477417,
      "end": 3667.219924926758,
      "text": " difficulties that we face."
    },
    {
      "id": 14,
      "start": 3667.219924926758,
      "end": 3673.219924926758,
      "text": " There are times in which it seems as if we just can't see what's going on."
    },
    {
      "id": 15,
      "start": 3673.219924926758,
      "end": 3677.8999252319336,
      "text": " God, would You help us to rest in the truth of Your Word?"
    },
    {
      "id": 16,
      "start": 3677.8999252319336,
      "end": 3686.0599212646484,
      "text": " Would You help us to praise You in the time of that difficulty, knowing, not thinking"
    },
    {
      "id": 17,
      "start": 3686.0599212646484,
      "end": 3691.33992767334,
      "text": " or assuming, but knowing that You're at work?"
    },
    {
      "id": 18,
      "start": 3691.33992767334,
      "end": 3696.739921569824,
      "text": " Help us, Lord, to be a people that properly praise You."
    },
    {
      "id": 19,
      "start": 3696.739921569824,
      "end": 3701.5799255371094,
      "text": " I pray that You'd have Your will and way over these next few moments of invitation, that"
    },
    {
      "id": 20,
      "start": 3701.5799255371094,
      "end": 3704.0599212646484,
      "text": " decisions would be made that would please Thee."
    },
    {
      "id": 21,
      "start": 3704.0599212646484,
      "end": 3707.739921569824,
      "text": " We'll certainly praise You for all that You'll do, for it's in Christ's name we pray."
    },
    {
      "id": 22,
      "start": 3707.739921569824,
      "end": 3708.739921569824,
      "text": " Just stand with me."
    },
    {
      "id": 23,
      "start": 3708.739921569824,
      "end": 3709.739921569824,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 24,
      "start": 3709.739921569824,
      "end": 3711.099922180176,
      "text": " Kimberly's going to play quietly on the piano."
    }
  ],
  "processed_at": "2025-04-17T16:07:25.458363"
}