{
  "video_id": "sJAMffvnci8",
  "text": "number six this evening. If you have your Bible with you, mark chapter number six. And specifically this evening, we'll be looking at verses 45 down through verse number 52. And I trust it'll be an encouragement to you this evening as we look at this portion of Scripture. And here in this section of the book of Mark, we have the privilege of reading about a number of the miracles that the Lord Jesus Christ performed. It's exciting to study through the Gospels and to see the life and ministry of the Lord Jesus Christ to study the miracles. And the text that's immediately preceding that, which we'll be looking at this evening, is the text of Scripture that records for us the feeding of the 5,000. And that's an exciting passage of Scripture, an exciting ministry, just a wonderful miracle that the Lord Jesus Christ performs. And of course, the disciples, they had the privilege of being personally involved in that particular miracle, where they were the ones that distributed all of the food. And they'd go back to Jesus, and Jesus kept multiplying it, and they'd take it. And of course, the Bible tells us that they were all filled, and they took up that which remained. And it's interesting, as we come to the text in which we're studying this evening, we find that the Bible tells us that after they had gathered up those fragments, according to verse number 43, they took up 12 baskets full of the fragments of the fishes, and they that did eat of the loaves were about 5,000 men. And then we come in verse number 45, and as we get to verses 45 and 46, really, we note three specific things that take place. The Bible says, \"...in straightway immediately he constrained his disciples to get into the ship and to go to the other side before unto Bethsaida, while he sent away the people. And when he had sent them away, he departed into a mountain to pray.\" And so, as we look at verses 45 and 46 and kind of get the backdrop, if you will, the setting for this particular text that we're going to study this evening, we find that Jesus sends the disciples, he tells them to go get on the ship and to go over to the other side, and then he sends all of those away that had experienced this great miracle, that had been fed with these loaves and fishes, and we find that he sends them home. And then the Bible tells us that he himself, the Lord Jesus Christ, departed into a mountain to pray. And as we look at the text of Scripture, we find that the Bible tells us in verse number 47, \"...and when even was come, the ship was in the midst of the sea, and he alone on the land.\" And so we find, no doubt, that there was a level of obedience on the part of the disciples in verse number 45. He tells them to go, and they did, and we find there's a part of obedience on the part of those that had feasted on that miracle. They departed as well. And then the Bible says this in verse 48, \"...and he saw them toiling and rowing.\" I want to share a thought with you this evening. I've just titled it here from verse number 48, \"...he saw them, he saw them.\" And as we look at this passage of Scripture, I want to really consider three truths that really just kind of pop out at me this evening from this portion of Scripture. And obviously, we find that the Lord Jesus Christ demonstrates his power in this passage over nature, and what a wonderful truth to understand the way in which you study the miracles and the way in which the Lord Jesus Christ demonstrates his power through his earthly ministry. But as we notice here what's going on in this text of Scripture, I would say to you, number one, the first observation that I make from this passage is he knows where you are. He knows where you are. And the Bible says to start verse number 48, \"...and he saw them.\" They didn't see him at this particular point. They're out obeying the commandment of the Lord. They went, and they got onto the ship, and they're going to cross over. The Bible says that they were in the midst of the sea, according to verse number 47, that center, middle section of that verse, as the ship was in the midst of the sea. And so they are going and obeying, doing what they were told to do. And the Bible tells us in verse number 48 that he saw them. He saw them toiling and rowing. As we consider the fact, as we would look at this truth of verse number 48, that he knows where you are, that we'd understand that they were toiling and rowing, and we understand that that's what they're dealing with. And I want you to just focus. Maybe you want to underline. We have three particular thoughts this evening, and just statements in these verses of Scripture that I hope would be an encouragement to you. And the first statement that I'd like you to kind of underline or circle in your Bible is, he saw them. He saw them. We've used that for our title this evening, for this message tonight. But I want you to consider that God knows where you are. He knows where you are. He sees you. And that is an encouraging truth that we find in the Word of God. And the reality is that I've heard illustrations over the years that have been shared about various life experiences, and one that comes to mind even as I look at this particular thought in verse number 48, that he, the Lord Jesus Christ, saw them, is an illustration or a story that I read many years ago about a building that was on fire, and the son was on the second floor of this particular building, and the father was outside of the building, and he was saying to his son, just jump, I'll catch you. Just jump, I'll catch you. And the boy said repeatedly, but I can't see you. I can't see you. And he said, it's okay, I can see you. And that's all that matters. And he encouraged that little boy to jump to refuge from that fire, encouraging that little boy that though you may not see me, I see you. And how important it is that we get the understanding and the encouragement, the comfort of just those simple words in verse number 48, and he saw them. He saw them. Not only do I notice as we study this portion of Scripture and just kind of look at some of these thoughts this evening, not only do I notice that he knows where you are, but number two, he knows what you're facing. He knows what you're facing. The Bible says that he saw them. Notice it says, toiling and rowing. Toiling and rowing. As I look at this verse of Scripture, and I see that terminology that is used in my mind's eye, I see these disciples, I mean, they're doing everything they can to get to the other side, and they are just, I mean, of course, they're used to being on the water. Many of these disciples had been fishermen, and they understood what it was to be on the water, and they had a level of experience, and the Bible says, however, they're toiling and rowing. I get in my mind's eye the picture of these disciples that are doing everything they humanly possibly can do, and they're making no progress. And the Bible tells us why they're toiling and rowing. It says, for the wind was contrary unto them. If you underlined or circled in verse number 48 that first thought, he saw them, when we think about, make this observation that not only does he know where you are, but he knows what you're facing, I would say to underline or circle that phrase, the wind was contrary unto them. You know, there are some times in our lives that we're going to face some less than desirable circumstances. There's going to be times that the wind is going to be contrary to us. And there are times in which, no doubt, if you were to go out on the water, that there would be times that the wind is favorable to you, and it helps you along your journey. But there are other times in which that wind is contrary, and you're doing everything you can to stay the course and reach the destination. And we find that here, as we look at this portion of Scripture, that Jesus, God in flesh, that he tells the disciples, in verse number 45, to get into the ship and to go onto the other side. They obey him. They go into the ship. The ship is now in the midst of the sea. And yet, the Bible tells us that the wind was contrary unto them. Unfortunately, in life, there are some that have sought to make this observation or declaration that every time you face a trouble or a trial in your life, it's because of some sin in your life. Well, that's what the friends of Job tried to say. And we looked at Job last week a little bit, and looked at the way in which he would use his words to strengthen others. And we find here that these disciples did not face a contrary wind because of disobedience. They did not face a contrary wind because of sin. We find that they face this contrary wind, and God's going to continue to develop them and teach them things. And we find that as you get to the end of the text, it's kind of interesting that in verse number 52, and we'll see it in a little bit as well, but it says, \"...they considered not the miracle of the loaves, for their heart was hardened.\" And we find that the disciples, listen, they're just like we are, human beings, right? I mean, there are times in which we see great victories. I mean, can you imagine the feeding of the 5,000? Can you imagine being one of the disciples and passing out all of that and saying, I mean, Andrew said, we don't have enough. I mean, 200 penny worth isn't enough to feed. I mean, we got nothing. Send them home. Right? That's what the disciples said. And then they take part in seeing this great miracle. Then they take 12 baskets. But see, sometimes even after we see God work in a great way, we then face another trial and we're like, oh, this is terrible. What's going to happen? Right? And so Jesus is going to teach them. He's going to show them, listen, he knows where we are, but he also knows what we're facing. See, the reality is that not everyone knows what you're facing. The reality is that we can face difficulties and trials and storms in our lives that other people aren't going to understand. They're not going to be aware of. Maybe it's not even appropriate that other people are aware of all of the storm that we might face. I preached a message not long ago, just a couple of Sundays ago. And as I preached from Psalms, and I really was dealing with the truth of really pour out your heart before him in Psalm 62. And what a great truth from that passage of scripture that we are to pour out our heart before him. What a great privilege that we have to do that. But we find that as we look at this portion of scripture and we make some observations, some simple truths this evening, that he knew where they were. He knows where you are. He knew what they were facing. He knows what you are facing. He knows what you're dealing with. You know that he knows our frame. He made us, right? He knows that we're but dust. He knows the things that we struggle with. He knows the things that that we're dealing with in life. We find not only as we look at this portion of scripture, does he know where you are and know what you're facing, but I would say number three, that he knows what you need. He knows what you need. I want you to notice in verse number 48, the Bible says, he saw them. That's the first phrase that we said to circle or underline. He saw them toiling and rowing notice for the wind was contrary to them. The second thought and about the fourth watch of the night, notice this, he cometh unto them. He cometh unto them. Isn't that good? He cometh unto them walking upon the sea. It says that he would have passed by them. I want you to notice that phrase that he cometh unto them. He knows where you are. He knows what you're facing and he knows what you need. And here, the Lord Jesus Christ, God in flesh, he saw his disciples from the place where he was. The Bible says that he departed into a mountain to pray in verse number 46. And he saw his disciples. He knew where they were. He knew what they were facing and he knew what they needed. And so he went to them. He went to them. It says that he cometh unto them. We understand that during the earthly ministry of the Lord Jesus Christ that God took upon himself human form. And we understand the hypostatic union and all that goes into it. The God-man as we'd refer to the Lord Jesus Christ. And we look at Philippians chapter number two and what powerful truth God gives us with regard to the incarnation and the deity of Christ. And we find that during the earthly ministry that he physically could be in the presence of his disciples. And then there were times in which he was physically not in the presence of the disciples. As New Testament believers, after the ascension of the Lord Jesus Christ, remember he said in John chapter number 14 to the disciples, he said it a couple of times in the book of John, that it was expedient. It was beneficial for them that he go away. Why? He's going to send the Comforter. He's going to send the Holy Spirit. We find that he promised us according to what we read in Hebrews 13, I will never leave thee nor forsake thee. What a tremendous promise. See God knows where you are. He knows what you're facing and he knows exactly what you need. The Bible says that he cometh unto them. It says walking upon the sea. Now this is something interesting about the scriptures. There are times in which there are statements that are made that are just a few words of statement that carry with it such profound truth. Walking upon the sea. I mean, if you're not careful, you just read right past that. But he's walking on the sea. We know about Peter, right? When Peter said, if it be thou bid me come unto thee and Peter went out, walked in the water until he looked at the storm and began to sink. And he was wise enough to say, Lord save me or help me. And what a blessing that is that he was helped. But we find here that Jesus is the creator of all things. He's able to do all things and he's walking upon the sea. And it says that he would have passed by them. And I want you to keep that thought and I want you to go over, if you will, to the book of John in the sixth chapter. And John chapter number six is, of course, from John's perspective, as he would write about this same event. We find that the feeding of the 5,000 is just a great miracle that is referenced. And what a blessing to be able to read about that and to rejoice. We see in verse number 10, at the end of the verse, it says, so the men sat down and number about 5,000 and they gathered up the fragments that remained in verse number 12. And they filled the baskets in verse number 13. But you see that they filled the baskets in verse number 13. But you see that the similarity, the event that is being recorded between Mark chapter number six and John chapter number six, and the way that John records it in verse number 18, he says, and the sea arose by reason of a great wind that blew. So when they had rowed about five and 20 or 30 furlongs, they see Jesus walking on the sea and drawing nigh into the ship. And they were afraid. He says unto them, it is I be not afraid. Notice this truth in verse number 21. Then they willingly received him into the ship. And we compare scripture with scripture. You find it's not a contradiction. No way. The Bible doesn't contradict itself, but you read at the end of verse number 48, that it says that he would have passed by them. And in John's account, he doesn't reference about the fact that he might have passed by or he would have passed by them. But he says that they willingly received him into the ship. This evening, we must understand that God knows what we need, but he never forces himself upon us. Are we willing to receive what he knows that we need? See, sometimes in life, we think we know what we need, right? We think we got to figure it out. Sometimes even we try to help God when we pray. We pray about something and offer to God a way in which he could answer it. And maybe he could answer it in that way. He's God, but he knows exactly what we need. And the Bible tells us that he would have passed by them in Mark's gospel. And John says that they willingly received him into the ship. And then it says immediately the ship was at the land where they went. And so we find that they saw him walking in the sea. We read it in verse number 49. Back in Mark chapter number six, they supposed it had been a spirit and cried out for they all saw him and were troubled. Immediately he talked with them and saith unto them, be of good cheer. It is I, be not afraid. Aren't you thankful for those words of the Lord Jesus Christ here in verse number 50? He says, be of good cheer. It is I, be not afraid. Not only were they in midst of a storm, but they see Jesus walking upon the sea. And they supposed, according to verse number 49, that it had been a spirit and they cried out. The Bible says that they were troubled literally in verse number 50, carries with it the idea of being terrified at that which was taking place. And Jesus says, be of good cheer. It is I, be not afraid. And I want you to notice one final statement from this passage of scripture that I'd like for you to underline or circle. It's in verse number 51 when the Bible says that he went up unto them. He went up unto them into the ship and the wind ceased and they were sore amazed in themselves beyond measure and wondered. Do you notice as we look at these four statements that I've asked you to underline or circle in your Bibles this evening or to take note of them in your notes? He knows where you are. The first statement found in verse number 48, he saw them. He saw them. Again, in verse number 48, the wind was contrary unto them. He knew where they were and he knew what they were facing, but he knew what they needed. And we find that in verse number 48, it says he cometh unto them. And then in verse number 51, he went up unto them. And the Bible tells us in this particular miracle that is given to us, recorded for us in this passage of scripture, that when he went up unto them in verse number 51 into the ship, the Bible says that the wind ceased. The wind ceased. The Bible tells us that they were sore amazed in themselves beyond measure and wondered. These disciples during their walk with the Lord Jesus Christ had the privilege of seeing the storm become more than once. And as we would give the attention here and see the power of our God over nature. And the Bible says that, remember what John said in John chapter number 6, that they willingly received him into the ship. And I think that it's important for us to understand that they willingly received him to the ship. And it says to us in verse number 51 of Mark 6, that he went up unto them into the ship and the wind ceased. The wind ceased. See this evening, as we look at this portion of scripture, and it's a great miracle that was performed, no doubt the Lord is seeking to develop his disciples. And he gave them the direction to go onto the, into the ship and to go onto the other side, unto Bethsaida. And they were obedient to the direction that the Lord had given. And we find that there's this storm and we notice all those things are taking place. But this evening, I want you to think about your life. And I want you to understand that he sees you. We can look here and see that it says he saw them. We can speak about the disciples that were in the boat, in the ship, but he sees you. He knows where you are. Where they were is not where we are. Right? I'm not in the middle of a ship or in the middle of a sea. I'm not on a ship. I don't plan to go on too many ships. Amen. It's not really my cup of tea, if you understand. Joseph's not too excited about ships either. And, but the reality is that they're in a different place than where we are. And I'm in a different place than you are. And the person on the other side of the auditorium is in a different place than you are. The person in the front of the auditorium is in a different place. You understand what I'm saying. But the omniscient Almighty God sees you. He knows where you are. Where they were was in the ship on the sea. And what they were facing was a storm. The wind was contrary unto them. And he knew what they were dealing with. He knew what they were facing. I'm not facing a contrary wind on a ship. On a sea. But you're facing something different than I'm facing. We understand. But he knows what you're facing. Individually. He sees you. He knows what you're facing. And let me say this. He knows what you need. He knows better what you need than what you think you need. He knows better what you need than what I think you need. Or than your spouse thinks that you need or whatever, right? He knows what we need. And here's the wonderful thing. He can meet that need. He can meet that need. He is able. And this evening, I hope that we could just be comforted for a few moments as we look at this portion of scripture and think about those phrases. He saw them. He saw them. And this evening, I don't know. Maybe you're the only person in the room that knows what you're dealing with. But don't forget that God knows what you're dealing with. And really, that's the most important, is it not? Because he can do for you what no one else can do for you. And this evening, these disciples in Mark chapter number 6, they got to see a great miracle. They saw that the wind ceased when he came up in the ship. And you know, the reality is that God's still working miracles today in your life, in my life. He still answers prayer. He still meets the needs. He still works and does exceeding abundantly above all that we could ask or think. Because we serve the Lord God omnipotent. And what a joy it is to know this evening that he knows where we are. He knows what we're facing and he knows what we need. Father, we love you. We thank you for loving us. Just a simple thought this evening from this portion of scripture. But I know this evening that you helped me personally as I prepared, even as I delivered. God, I pray that this evening your word has helped your people tonight. Those that are gathered locally, those who have tuned in via live stream, that we'd be encouraged tonight as we understand and observe these simple truths that you know where we are, you know what we're facing, and you know what we need. We trust you. I pray that you'd help us to submit to you. I pray that you'd work through our time of prayer that you alone would be glorified. For it's in Christ's name we pray, amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.599999904632568,
      "text": " number six this evening. If you have your Bible with you, mark chapter number six. And specifically"
    },
    {
      "id": 1,
      "start": 5.599999904632568,
      "end": 12.319999694824219,
      "text": " this evening, we'll be looking at verses 45 down through verse number 52. And I trust it'll be an"
    },
    {
      "id": 2,
      "start": 12.319999694824219,
      "end": 18.15999984741211,
      "text": " encouragement to you this evening as we look at this portion of Scripture. And here in this section"
    },
    {
      "id": 3,
      "start": 18.15999984741211,
      "end": 22.639999389648438,
      "text": " of the book of Mark, we have the privilege of reading about a number of the miracles that the"
    },
    {
      "id": 4,
      "start": 22.639999389648438,
      "end": 28.31999969482422,
      "text": " Lord Jesus Christ performed. It's exciting to study through the Gospels and to see the life"
    },
    {
      "id": 5,
      "start": 28.31999969482422,
      "end": 34.47999954223633,
      "text": " and ministry of the Lord Jesus Christ to study the miracles. And the text that's immediately"
    },
    {
      "id": 6,
      "start": 34.47999954223633,
      "end": 39.279998779296875,
      "text": " preceding that, which we'll be looking at this evening, is the text of Scripture that records"
    },
    {
      "id": 7,
      "start": 39.279998779296875,
      "end": 45.68000030517578,
      "text": " for us the feeding of the 5,000. And that's an exciting passage of Scripture, an exciting ministry,"
    },
    {
      "id": 8,
      "start": 46.560001373291016,
      "end": 53.68000030517578,
      "text": " just a wonderful miracle that the Lord Jesus Christ performs. And of course, the disciples,"
    },
    {
      "id": 9,
      "start": 54.31999969482422,
      "end": 60.08000183105469,
      "text": " they had the privilege of being personally involved in that particular miracle, where they were the"
    },
    {
      "id": 10,
      "start": 60.08000183105469,
      "end": 65.19999694824219,
      "text": " ones that distributed all of the food. And they'd go back to Jesus, and Jesus kept multiplying it,"
    },
    {
      "id": 11,
      "start": 65.19999694824219,
      "end": 69.5999984741211,
      "text": " and they'd take it. And of course, the Bible tells us that they were all filled, and they took up"
    },
    {
      "id": 12,
      "start": 69.5999984741211,
      "end": 73.83999633789062,
      "text": " that which remained. And it's interesting, as we come to the text in which we're studying this"
    },
    {
      "id": 13,
      "start": 73.83999633789062,
      "end": 78.4800033569336,
      "text": " evening, we find that the Bible tells us that after they had gathered up those fragments,"
    },
    {
      "id": 14,
      "start": 78.4800033569336,
      "end": 83.19999694824219,
      "text": " according to verse number 43, they took up 12 baskets full of the fragments of the fishes,"
    },
    {
      "id": 15,
      "start": 83.19999694824219,
      "end": 89.27999877929688,
      "text": " and they that did eat of the loaves were about 5,000 men. And then we come in verse number 45,"
    },
    {
      "id": 16,
      "start": 90.31999969482422,
      "end": 96.23999786376953,
      "text": " and as we get to verses 45 and 46, really, we note three specific things that take place."
    },
    {
      "id": 17,
      "start": 96.23999786376953,
      "end": 103.5199966430664,
      "text": " The Bible says, \"...in straightway immediately he constrained his disciples to get into the ship"
    },
    {
      "id": 18,
      "start": 103.5199966430664,
      "end": 110.4000015258789,
      "text": " and to go to the other side before unto Bethsaida, while he sent away the people. And when he had"
    },
    {
      "id": 19,
      "start": 110.4000015258789,
      "end": 116.55999755859375,
      "text": " sent them away, he departed into a mountain to pray.\" And so, as we look at verses 45 and 46 and"
    },
    {
      "id": 20,
      "start": 116.55999755859375,
      "end": 121.5999984741211,
      "text": " kind of get the backdrop, if you will, the setting for this particular text that we're going to study"
    },
    {
      "id": 21,
      "start": 121.5999984741211,
      "end": 126.31999969482422,
      "text": " this evening, we find that Jesus sends the disciples, he tells them to go get on the ship"
    },
    {
      "id": 22,
      "start": 126.31999969482422,
      "end": 132.8000030517578,
      "text": " and to go over to the other side, and then he sends all of those away that had experienced this"
    },
    {
      "id": 23,
      "start": 132.8000030517578,
      "end": 138.63999938964844,
      "text": " great miracle, that had been fed with these loaves and fishes, and we find that he sends them home."
    },
    {
      "id": 24,
      "start": 138.63999938964844,
      "end": 144.9600067138672,
      "text": " And then the Bible tells us that he himself, the Lord Jesus Christ, departed into a mountain"
    },
    {
      "id": 25,
      "start": 144.9600067138672,
      "end": 152.0,
      "text": " to pray. And as we look at the text of Scripture, we find that the Bible tells us in verse number 47,"
    },
    {
      "id": 26,
      "start": 152.0,
      "end": 160.8800048828125,
      "text": " \"...and when even was come, the ship was in the midst of the sea, and he alone on the land.\" And so we find,"
    },
    {
      "id": 27,
      "start": 160.8800048828125,
      "end": 165.36000061035156,
      "text": " no doubt, that there was a level of obedience on the part of the disciples in verse number 45. He"
    },
    {
      "id": 28,
      "start": 165.36000061035156,
      "end": 171.60000610351562,
      "text": " tells them to go, and they did, and we find there's a part of obedience on the part of those"
    },
    {
      "id": 29,
      "start": 171.60000610351562,
      "end": 178.47999572753906,
      "text": " that had feasted on that miracle. They departed as well. And then the Bible says this in verse 48,"
    },
    {
      "id": 30,
      "start": 178.47999572753906,
      "end": 184.63999938964844,
      "text": " \"...and he saw them toiling and rowing.\" I want to share a thought with you this evening. I've just"
    },
    {
      "id": 31,
      "start": 184.63999938964844,
      "end": 191.44000244140625,
      "text": " titled it here from verse number 48, \"...he saw them, he saw them.\" And as we look at this passage"
    },
    {
      "id": 32,
      "start": 191.52000427246094,
      "end": 197.1199951171875,
      "text": " of Scripture, I want to really consider three truths that really just kind of pop out at me"
    },
    {
      "id": 33,
      "start": 197.1199951171875,
      "end": 202.8000030517578,
      "text": " this evening from this portion of Scripture. And obviously, we find that the Lord Jesus Christ"
    },
    {
      "id": 34,
      "start": 202.8000030517578,
      "end": 210.0,
      "text": " demonstrates his power in this passage over nature, and what a wonderful truth to understand"
    },
    {
      "id": 35,
      "start": 210.0,
      "end": 214.0,
      "text": " the way in which you study the miracles and the way in which the Lord Jesus Christ demonstrates"
    },
    {
      "id": 36,
      "start": 214.0,
      "end": 220.72000122070312,
      "text": " his power through his earthly ministry. But as we notice here what's going on in this text of"
    },
    {
      "id": 37,
      "start": 220.72000122070312,
      "end": 225.60000610351562,
      "text": " Scripture, I would say to you, number one, the first observation that I make from this passage"
    },
    {
      "id": 38,
      "start": 225.60000610351562,
      "end": 232.0800018310547,
      "text": " is he knows where you are. He knows where you are. And the Bible says to start verse number 48,"
    },
    {
      "id": 39,
      "start": 232.0800018310547,
      "end": 240.47999572753906,
      "text": " \"...and he saw them.\" They didn't see him at this particular point. They're out obeying the"
    },
    {
      "id": 40,
      "start": 240.47999572753906,
      "end": 244.8000030517578,
      "text": " commandment of the Lord. They went, and they got onto the ship, and they're going to cross over."
    },
    {
      "id": 41,
      "start": 244.8000030517578,
      "end": 248.32000732421875,
      "text": " The Bible says that they were in the midst of the sea, according to verse number 47,"
    },
    {
      "id": 42,
      "start": 248.8800048828125,
      "end": 253.0399932861328,
      "text": " that center, middle section of that verse, as the ship was in the midst of the sea."
    },
    {
      "id": 43,
      "start": 253.0399932861328,
      "end": 258.9599914550781,
      "text": " And so they are going and obeying, doing what they were told to do. And the Bible tells us in verse"
    },
    {
      "id": 44,
      "start": 258.9599914550781,
      "end": 267.67999267578125,
      "text": " number 48 that he saw them. He saw them toiling and rowing. As we consider the fact, as we would"
    },
    {
      "id": 45,
      "start": 267.67999267578125,
      "end": 272.9599914550781,
      "text": " look at this truth of verse number 48, that he knows where you are, that we'd understand that"
    },
    {
      "id": 46,
      "start": 272.9599914550781,
      "end": 279.2799987792969,
      "text": " they were toiling and rowing, and we understand that that's what they're dealing with. And I want"
    },
    {
      "id": 47,
      "start": 279.2799987792969,
      "end": 283.760009765625,
      "text": " you to just focus. Maybe you want to underline. We have three particular thoughts this evening,"
    },
    {
      "id": 48,
      "start": 283.760009765625,
      "end": 288.9599914550781,
      "text": " and just statements in these verses of Scripture that I hope would be an encouragement to you."
    },
    {
      "id": 49,
      "start": 288.9599914550781,
      "end": 293.6000061035156,
      "text": " And the first statement that I'd like you to kind of underline or circle in your Bible is,"
    },
    {
      "id": 50,
      "start": 293.6000061035156,
      "end": 302.79998779296875,
      "text": " he saw them. He saw them. We've used that for our title this evening, for this message tonight."
    },
    {
      "id": 51,
      "start": 302.79998779296875,
      "end": 308.3999938964844,
      "text": " But I want you to consider that God knows where you are. He knows where you are. He sees you."
    },
    {
      "id": 52,
      "start": 308.9599914550781,
      "end": 316.79998779296875,
      "text": " And that is an encouraging truth that we find in the Word of God. And the reality is that I've"
    },
    {
      "id": 53,
      "start": 316.79998779296875,
      "end": 323.1199951171875,
      "text": " heard illustrations over the years that have been shared about various life experiences,"
    },
    {
      "id": 54,
      "start": 323.1199951171875,
      "end": 329.0400085449219,
      "text": " and one that comes to mind even as I look at this particular thought in verse number 48, that he,"
    },
    {
      "id": 55,
      "start": 329.0400085449219,
      "end": 335.6000061035156,
      "text": " the Lord Jesus Christ, saw them, is an illustration or a story that I read many years ago about a"
    },
    {
      "id": 56,
      "start": 335.6000061035156,
      "end": 340.239990234375,
      "text": " building that was on fire, and the son was on the second floor of this particular building,"
    },
    {
      "id": 57,
      "start": 340.239990234375,
      "end": 344.6400146484375,
      "text": " and the father was outside of the building, and he was saying to his son,"
    },
    {
      "id": 58,
      "start": 344.6400146484375,
      "end": 354.239990234375,
      "text": " just jump, I'll catch you. Just jump, I'll catch you. And the boy said repeatedly, but I can't see you."
    },
    {
      "id": 59,
      "start": 354.8800048828125,
      "end": 360.8800048828125,
      "text": " I can't see you. And he said, it's okay, I can see you. And that's all that matters."
    },
    {
      "id": 60,
      "start": 361.8399963378906,
      "end": 368.7200012207031,
      "text": " And he encouraged that little boy to jump to refuge from that fire, encouraging that little"
    },
    {
      "id": 61,
      "start": 368.7200012207031,
      "end": 376.7200012207031,
      "text": " boy that though you may not see me, I see you. And how important it is that we get the"
    },
    {
      "id": 62,
      "start": 376.7200012207031,
      "end": 383.2799987792969,
      "text": " understanding and the encouragement, the comfort of just those simple words in verse number 48,"
    },
    {
      "id": 63,
      "start": 383.2799987792969,
      "end": 390.8800048828125,
      "text": " and he saw them. He saw them. Not only do I notice as we study this portion of Scripture and just kind"
    },
    {
      "id": 64,
      "start": 390.8800048828125,
      "end": 395.44000244140625,
      "text": " of look at some of these thoughts this evening, not only do I notice that he knows where you are,"
    },
    {
      "id": 65,
      "start": 395.44000244140625,
      "end": 401.67999267578125,
      "text": " but number two, he knows what you're facing. He knows what you're facing. The Bible says that he"
    },
    {
      "id": 66,
      "start": 401.67999267578125,
      "end": 408.79998779296875,
      "text": " saw them. Notice it says, toiling and rowing. Toiling and rowing. As I look at this verse of"
    },
    {
      "id": 67,
      "start": 408.79998779296875,
      "end": 414.0799865722656,
      "text": " Scripture, and I see that terminology that is used in my mind's eye, I see these disciples,"
    },
    {
      "id": 68,
      "start": 414.0799865722656,
      "end": 420.1600036621094,
      "text": " I mean, they're doing everything they can to get to the other side, and they are just, I mean,"
    },
    {
      "id": 69,
      "start": 420.1600036621094,
      "end": 424.55999755859375,
      "text": " of course, they're used to being on the water. Many of these disciples had been fishermen,"
    },
    {
      "id": 70,
      "start": 424.55999755859375,
      "end": 428.1600036621094,
      "text": " and they understood what it was to be on the water, and they had a level of experience, and"
    },
    {
      "id": 71,
      "start": 428.9599914550781,
      "end": 434.55999755859375,
      "text": " the Bible says, however, they're toiling and rowing. I get in my mind's eye the picture"
    },
    {
      "id": 72,
      "start": 435.1199951171875,
      "end": 440.7200012207031,
      "text": " of these disciples that are doing everything they humanly possibly can do, and they're making no"
    },
    {
      "id": 73,
      "start": 440.7200012207031,
      "end": 448.239990234375,
      "text": " progress. And the Bible tells us why they're toiling and rowing. It says, for the wind"
    },
    {
      "id": 74,
      "start": 448.8800048828125,
      "end": 456.9599914550781,
      "text": " was contrary unto them. If you underlined or circled in verse number 48 that first thought,"
    },
    {
      "id": 75,
      "start": 456.9599914550781,
      "end": 462.3999938964844,
      "text": " he saw them, when we think about, make this observation that not only does he know where"
    },
    {
      "id": 76,
      "start": 462.3999938964844,
      "end": 467.760009765625,
      "text": " you are, but he knows what you're facing, I would say to underline or circle that phrase,"
    },
    {
      "id": 77,
      "start": 467.760009765625,
      "end": 473.6000061035156,
      "text": " the wind was contrary unto them. You know, there are some times in our lives that we're going to"
    },
    {
      "id": 78,
      "start": 473.6000061035156,
      "end": 479.3599853515625,
      "text": " face some less than desirable circumstances. There's going to be times that the wind is going"
    },
    {
      "id": 79,
      "start": 479.3599853515625,
      "end": 485.9200134277344,
      "text": " to be contrary to us. And there are times in which, no doubt, if you were to go out on the water,"
    },
    {
      "id": 80,
      "start": 486.4800109863281,
      "end": 491.0400085449219,
      "text": " that there would be times that the wind is favorable to you, and it helps you along your"
    },
    {
      "id": 81,
      "start": 491.0400085449219,
      "end": 496.3999938964844,
      "text": " journey. But there are other times in which that wind is contrary, and you're doing everything you"
    },
    {
      "id": 82,
      "start": 496.3999938964844,
      "end": 503.1199951171875,
      "text": " can to stay the course and reach the destination. And we find that here, as we look at this portion"
    },
    {
      "id": 83,
      "start": 503.1199951171875,
      "end": 509.6000061035156,
      "text": " of Scripture, that Jesus, God in flesh, that he tells the disciples, in verse number 45,"
    },
    {
      "id": 84,
      "start": 509.6000061035156,
      "end": 516.0800170898438,
      "text": " to get into the ship and to go onto the other side. They obey him. They go into the ship. The"
    },
    {
      "id": 85,
      "start": 516.0800170898438,
      "end": 523.6799926757812,
      "text": " ship is now in the midst of the sea. And yet, the Bible tells us that the wind was contrary unto"
    },
    {
      "id": 86,
      "start": 523.6799926757812,
      "end": 532.6400146484375,
      "text": " them. Unfortunately, in life, there are some that have sought to make this observation or"
    },
    {
      "id": 87,
      "start": 532.6400146484375,
      "end": 537.9199829101562,
      "text": " declaration that every time you face a trouble or a trial in your life, it's because of some sin in"
    },
    {
      "id": 88,
      "start": 537.9199829101562,
      "end": 543.760009765625,
      "text": " your life. Well, that's what the friends of Job tried to say. And we looked at Job last week a"
    },
    {
      "id": 89,
      "start": 543.760009765625,
      "end": 549.5999755859375,
      "text": " little bit, and looked at the way in which he would use his words to strengthen others. And"
    },
    {
      "id": 90,
      "start": 550.1599731445312,
      "end": 556.7999877929688,
      "text": " we find here that these disciples did not face a contrary wind because of disobedience."
    },
    {
      "id": 91,
      "start": 557.6799926757812,
      "end": 563.6799926757812,
      "text": " They did not face a contrary wind because of sin. We find that they face this contrary wind,"
    },
    {
      "id": 92,
      "start": 563.6799926757812,
      "end": 569.3599853515625,
      "text": " and God's going to continue to develop them and teach them things. And we find that as you get"
    },
    {
      "id": 93,
      "start": 569.3599853515625,
      "end": 574.239990234375,
      "text": " to the end of the text, it's kind of interesting that in verse number 52, and we'll see it in a"
    },
    {
      "id": 94,
      "start": 574.239990234375,
      "end": 577.6799926757812,
      "text": " little bit as well, but it says, \"...they considered not the miracle of the loaves,"
    },
    {
      "id": 95,
      "start": 577.6799926757812,
      "end": 583.0399780273438,
      "text": " for their heart was hardened.\" And we find that the disciples, listen, they're just like we are,"
    },
    {
      "id": 96,
      "start": 583.0399780273438,
      "end": 588.0,
      "text": " human beings, right? I mean, there are times in which we see great victories. I mean, can you"
    },
    {
      "id": 97,
      "start": 588.0,
      "end": 592.9600219726562,
      "text": " imagine the feeding of the 5,000? Can you imagine being one of the disciples and passing out all of"
    },
    {
      "id": 98,
      "start": 592.9600219726562,
      "end": 597.52001953125,
      "text": " that and saying, I mean, Andrew said, we don't have enough. I mean, 200 penny worth isn't enough"
    },
    {
      "id": 99,
      "start": 597.52001953125,
      "end": 602.47998046875,
      "text": " to feed. I mean, we got nothing. Send them home. Right? That's what the disciples said."
    },
    {
      "id": 100,
      "start": 602.47998046875,
      "end": 611.9199829101562,
      "text": " And then they take part in seeing this great miracle. Then they take 12 baskets. But see,"
    },
    {
      "id": 101,
      "start": 611.9199829101562,
      "end": 617.3599853515625,
      "text": " sometimes even after we see God work in a great way, we then face another trial and we're like,"
    },
    {
      "id": 102,
      "start": 617.3599853515625,
      "end": 623.4400024414062,
      "text": " oh, this is terrible. What's going to happen? Right? And so Jesus is going to teach them. He's"
    },
    {
      "id": 103,
      "start": 623.4400024414062,
      "end": 628.1599731445312,
      "text": " going to show them, listen, he knows where we are, but he also knows what we're facing."
    },
    {
      "id": 104,
      "start": 629.1199951171875,
      "end": 633.6799926757812,
      "text": " See, the reality is that not everyone knows what you're facing."
    },
    {
      "id": 105,
      "start": 635.6799926757812,
      "end": 643.9199829101562,
      "text": " The reality is that we can face difficulties and trials and storms in our lives that other people"
    },
    {
      "id": 106,
      "start": 643.9199829101562,
      "end": 647.52001953125,
      "text": " aren't going to understand. They're not going to be aware of. Maybe it's not even appropriate that"
    },
    {
      "id": 107,
      "start": 647.52001953125,
      "end": 654.0,
      "text": " other people are aware of all of the storm that we might face. I preached a message not long ago,"
    },
    {
      "id": 108,
      "start": 654.0,
      "end": 660.5599975585938,
      "text": " just a couple of Sundays ago. And as I preached from Psalms, and I really was dealing with the"
    },
    {
      "id": 109,
      "start": 660.5599975585938,
      "end": 668.3200073242188,
      "text": " truth of really pour out your heart before him in Psalm 62. And what a great truth from that passage"
    },
    {
      "id": 110,
      "start": 668.3200073242188,
      "end": 673.3599853515625,
      "text": " of scripture that we are to pour out our heart before him. What a great privilege that we have"
    },
    {
      "id": 111,
      "start": 673.3599853515625,
      "end": 679.9199829101562,
      "text": " to do that. But we find that as we look at this portion of scripture and we make some observations,"
    },
    {
      "id": 112,
      "start": 679.9199829101562,
      "end": 686.5599975585938,
      "text": " some simple truths this evening, that he knew where they were. He knows where you are. He knew"
    },
    {
      "id": 113,
      "start": 686.5599975585938,
      "end": 691.52001953125,
      "text": " what they were facing. He knows what you are facing. He knows what you're dealing with. You"
    },
    {
      "id": 114,
      "start": 691.52001953125,
      "end": 697.5999755859375,
      "text": " know that he knows our frame. He made us, right? He knows that we're but dust. He knows the things"
    },
    {
      "id": 115,
      "start": 697.5999755859375,
      "end": 706.47998046875,
      "text": " that we struggle with. He knows the things that that we're dealing with in life. We find not only"
    },
    {
      "id": 116,
      "start": 706.47998046875,
      "end": 710.4000244140625,
      "text": " as we look at this portion of scripture, does he know where you are and know what you're facing,"
    },
    {
      "id": 117,
      "start": 710.4000244140625,
      "end": 716.5599975585938,
      "text": " but I would say number three, that he knows what you need. He knows what you need. I want you to"
    },
    {
      "id": 118,
      "start": 716.5599975585938,
      "end": 723.0399780273438,
      "text": " notice in verse number 48, the Bible says, he saw them. That's the first phrase that we said to"
    },
    {
      "id": 119,
      "start": 723.0399780273438,
      "end": 728.6400146484375,
      "text": " circle or underline. He saw them toiling and rowing notice for the wind was contrary to them."
    },
    {
      "id": 120,
      "start": 728.6400146484375,
      "end": 735.8400268554688,
      "text": " The second thought and about the fourth watch of the night, notice this, he cometh unto them."
    },
    {
      "id": 121,
      "start": 736.9600219726562,
      "end": 744.47998046875,
      "text": " He cometh unto them. Isn't that good? He cometh unto them walking upon the sea. It says that he"
    },
    {
      "id": 122,
      "start": 744.47998046875,
      "end": 751.4400024414062,
      "text": " would have passed by them. I want you to notice that phrase that he cometh unto them. He knows"
    },
    {
      "id": 123,
      "start": 751.4400024414062,
      "end": 758.0800170898438,
      "text": " where you are. He knows what you're facing and he knows what you need. And here, the Lord Jesus"
    },
    {
      "id": 124,
      "start": 758.0800170898438,
      "end": 764.1599731445312,
      "text": " Christ, God in flesh, he saw his disciples from the place where he was. The Bible says that he"
    },
    {
      "id": 125,
      "start": 764.1599731445312,
      "end": 769.9199829101562,
      "text": " departed into a mountain to pray in verse number 46. And he saw his disciples. He knew where they"
    },
    {
      "id": 126,
      "start": 769.9199829101562,
      "end": 776.3200073242188,
      "text": " were. He knew what they were facing and he knew what they needed. And so he went to them. He went"
    },
    {
      "id": 127,
      "start": 776.3200073242188,
      "end": 783.8400268554688,
      "text": " to them. It says that he cometh unto them. We understand that during the earthly ministry of"
    },
    {
      "id": 128,
      "start": 783.8400268554688,
      "end": 793.1199951171875,
      "text": " the Lord Jesus Christ that God took upon himself human form. And we understand the hypostatic union"
    },
    {
      "id": 129,
      "start": 793.1199951171875,
      "end": 798.7999877929688,
      "text": " and all that goes into it. The God-man as we'd refer to the Lord Jesus Christ. And we look at"
    },
    {
      "id": 130,
      "start": 798.7999877929688,
      "end": 804.3200073242188,
      "text": " Philippians chapter number two and what powerful truth God gives us with regard to the incarnation"
    },
    {
      "id": 131,
      "start": 804.3200073242188,
      "end": 813.0399780273438,
      "text": " and the deity of Christ. And we find that during the earthly ministry that he physically could be"
    },
    {
      "id": 132,
      "start": 813.1199951171875,
      "end": 819.3599853515625,
      "text": " in the presence of his disciples. And then there were times in which he was physically not in the"
    },
    {
      "id": 133,
      "start": 819.3599853515625,
      "end": 825.4400024414062,
      "text": " presence of the disciples. As New Testament believers, after the ascension of the Lord"
    },
    {
      "id": 134,
      "start": 825.4400024414062,
      "end": 830.719970703125,
      "text": " Jesus Christ, remember he said in John chapter number 14 to the disciples, he said it a couple"
    },
    {
      "id": 135,
      "start": 830.719970703125,
      "end": 835.5999755859375,
      "text": " of times in the book of John, that it was expedient. It was beneficial for them that he go away. Why?"
    },
    {
      "id": 136,
      "start": 835.5999755859375,
      "end": 839.9199829101562,
      "text": " He's going to send the Comforter. He's going to send the Holy Spirit. We find that he promised us"
    },
    {
      "id": 137,
      "start": 839.9199829101562,
      "end": 846.0,
      "text": " according to what we read in Hebrews 13, I will never leave thee nor forsake thee. What a tremendous"
    },
    {
      "id": 138,
      "start": 846.0,
      "end": 854.5599975585938,
      "text": " promise. See God knows where you are. He knows what you're facing and he knows exactly what you need."
    },
    {
      "id": 139,
      "start": 854.5599975585938,
      "end": 861.8400268554688,
      "text": " The Bible says that he cometh unto them. It says walking upon the sea. Now this is something"
    },
    {
      "id": 140,
      "start": 861.8400268554688,
      "end": 867.1199951171875,
      "text": " interesting about the scriptures. There are times in which there are statements that are made that"
    },
    {
      "id": 141,
      "start": 867.2000122070312,
      "end": 873.8400268554688,
      "text": " are just a few words of statement that carry with it such profound truth. Walking upon the sea. I"
    },
    {
      "id": 142,
      "start": 873.8400268554688,
      "end": 878.6400146484375,
      "text": " mean, if you're not careful, you just read right past that. But he's walking on the sea. We know"
    },
    {
      "id": 143,
      "start": 878.6400146484375,
      "end": 883.760009765625,
      "text": " about Peter, right? When Peter said, if it be thou bid me come unto thee and Peter went out,"
    },
    {
      "id": 144,
      "start": 883.760009765625,
      "end": 888.0,
      "text": " walked in the water until he looked at the storm and began to sink. And he was wise enough to say,"
    },
    {
      "id": 145,
      "start": 888.0,
      "end": 893.9199829101562,
      "text": " Lord save me or help me. And what a blessing that is that he was helped. But we find here"
    },
    {
      "id": 146,
      "start": 894.8800048828125,
      "end": 900.9600219726562,
      "text": " that Jesus is the creator of all things. He's able to do all things and he's walking upon the sea."
    },
    {
      "id": 147,
      "start": 902.239990234375,
      "end": 906.7999877929688,
      "text": " And it says that he would have passed by them. And I want you to keep that thought and I want you to"
    },
    {
      "id": 148,
      "start": 906.7999877929688,
      "end": 912.47998046875,
      "text": " go over, if you will, to the book of John in the sixth chapter. And John chapter number six is,"
    },
    {
      "id": 149,
      "start": 912.47998046875,
      "end": 917.8400268554688,
      "text": " of course, from John's perspective, as he would write about this same event."
    },
    {
      "id": 150,
      "start": 918.47998046875,
      "end": 926.47998046875,
      "text": " We find that the feeding of the 5,000 is just a great miracle that is referenced. And what a"
    },
    {
      "id": 151,
      "start": 926.47998046875,
      "end": 931.5999755859375,
      "text": " blessing to be able to read about that and to rejoice. We see in verse number 10, at the end of"
    },
    {
      "id": 152,
      "start": 931.5999755859375,
      "end": 936.1599731445312,
      "text": " the verse, it says, so the men sat down and number about 5,000 and they gathered up the fragments"
    },
    {
      "id": 153,
      "start": 936.1599731445312,
      "end": 942.0,
      "text": " that remained in verse number 12. And they filled the baskets in verse number 13. But you see that"
    },
    {
      "id": 154,
      "start": 942.239990234375,
      "end": 948.47998046875,
      "text": " they filled the baskets in verse number 13. But you see that the similarity, the event that is"
    },
    {
      "id": 155,
      "start": 948.47998046875,
      "end": 952.7999877929688,
      "text": " being recorded between Mark chapter number six and John chapter number six, and the way that"
    },
    {
      "id": 156,
      "start": 952.7999877929688,
      "end": 958.5599975585938,
      "text": " John records it in verse number 18, he says, and the sea arose by reason of a great wind that blew."
    },
    {
      "id": 157,
      "start": 958.5599975585938,
      "end": 963.6799926757812,
      "text": " So when they had rowed about five and 20 or 30 furlongs, they see Jesus walking on the sea"
    },
    {
      "id": 158,
      "start": 964.47998046875,
      "end": 969.5999755859375,
      "text": " and drawing nigh into the ship. And they were afraid. He says unto them, it is I be not afraid."
    },
    {
      "id": 159,
      "start": 969.5999755859375,
      "end": 976.47998046875,
      "text": " Notice this truth in verse number 21. Then they willingly received him into the ship."
    },
    {
      "id": 160,
      "start": 977.1199951171875,
      "end": 981.5999755859375,
      "text": " And we compare scripture with scripture. You find it's not a contradiction. No way."
    },
    {
      "id": 161,
      "start": 981.5999755859375,
      "end": 985.8400268554688,
      "text": " The Bible doesn't contradict itself, but you read at the end of verse number 48, that it says that"
    },
    {
      "id": 162,
      "start": 985.8400268554688,
      "end": 991.2000122070312,
      "text": " he would have passed by them. And in John's account, he doesn't reference about the fact"
    },
    {
      "id": 163,
      "start": 991.2000122070312,
      "end": 995.8400268554688,
      "text": " that he might have passed by or he would have passed by them. But he says that they willingly"
    },
    {
      "id": 164,
      "start": 995.8400268554688,
      "end": 1003.1199951171875,
      "text": " received him into the ship. This evening, we must understand that God knows what we need,"
    },
    {
      "id": 165,
      "start": 1003.1199951171875,
      "end": 1011.6799926757812,
      "text": " but he never forces himself upon us. Are we willing to receive what he knows that we need?"
    },
    {
      "id": 166,
      "start": 1012.3200073242188,
      "end": 1017.0399780273438,
      "text": " See, sometimes in life, we think we know what we need, right? We think we got to figure it out."
    },
    {
      "id": 167,
      "start": 1017.0399780273438,
      "end": 1022.4000244140625,
      "text": " Sometimes even we try to help God when we pray. We pray about something and offer to God a way in"
    },
    {
      "id": 168,
      "start": 1022.4000244140625,
      "end": 1027.43994140625,
      "text": " which he could answer it. And maybe he could answer it in that way. He's God, but he knows"
    },
    {
      "id": 169,
      "start": 1027.43994140625,
      "end": 1032.56005859375,
      "text": " exactly what we need. And the Bible tells us that he would have passed by them in Mark's gospel."
    },
    {
      "id": 170,
      "start": 1032.56005859375,
      "end": 1038.6400146484375,
      "text": " And John says that they willingly received him into the ship. And then it says immediately the"
    },
    {
      "id": 171,
      "start": 1038.6400146484375,
      "end": 1043.8399658203125,
      "text": " ship was at the land where they went. And so we find that they saw him walking in the sea. We"
    },
    {
      "id": 172,
      "start": 1043.8399658203125,
      "end": 1048.1600341796875,
      "text": " read it in verse number 49. Back in Mark chapter number six, they supposed it had been a spirit"
    },
    {
      "id": 173,
      "start": 1048.1600341796875,
      "end": 1053.1199951171875,
      "text": " and cried out for they all saw him and were troubled. Immediately he talked with them and"
    },
    {
      "id": 174,
      "start": 1053.1199951171875,
      "end": 1058.800048828125,
      "text": " saith unto them, be of good cheer. It is I, be not afraid. Aren't you thankful for those words"
    },
    {
      "id": 175,
      "start": 1058.800048828125,
      "end": 1068.9599609375,
      "text": " of the Lord Jesus Christ here in verse number 50? He says, be of good cheer. It is I, be not afraid."
    },
    {
      "id": 176,
      "start": 1070.239990234375,
      "end": 1077.3599853515625,
      "text": " Not only were they in midst of a storm, but they see Jesus walking upon the sea. And they supposed,"
    },
    {
      "id": 177,
      "start": 1077.3599853515625,
      "end": 1081.8399658203125,
      "text": " according to verse number 49, that it had been a spirit and they cried out. The Bible says that"
    },
    {
      "id": 178,
      "start": 1081.8399658203125,
      "end": 1087.199951171875,
      "text": " they were troubled literally in verse number 50, carries with it the idea of being terrified"
    },
    {
      "id": 179,
      "start": 1088.719970703125,
      "end": 1097.3599853515625,
      "text": " at that which was taking place. And Jesus says, be of good cheer. It is I, be not afraid."
    },
    {
      "id": 180,
      "start": 1098.8800048828125,
      "end": 1104.0799560546875,
      "text": " And I want you to notice one final statement from this passage of scripture"
    },
    {
      "id": 181,
      "start": 1104.6400146484375,
      "end": 1110.6400146484375,
      "text": " that I'd like for you to underline or circle. It's in verse number 51 when the Bible says that"
    },
    {
      "id": 182,
      "start": 1110.6400146484375,
      "end": 1120.47998046875,
      "text": " he went up unto them. He went up unto them into the ship and the wind ceased and they were sore"
    },
    {
      "id": 183,
      "start": 1120.47998046875,
      "end": 1128.1600341796875,
      "text": " amazed in themselves beyond measure and wondered. Do you notice as we look at these four statements"
    },
    {
      "id": 184,
      "start": 1128.1600341796875,
      "end": 1133.3599853515625,
      "text": " that I've asked you to underline or circle in your Bibles this evening or to take note of"
    },
    {
      "id": 185,
      "start": 1134.239990234375,
      "end": 1140.0799560546875,
      "text": " them in your notes? He knows where you are. The first statement found in verse number 48,"
    },
    {
      "id": 186,
      "start": 1140.0799560546875,
      "end": 1147.280029296875,
      "text": " he saw them. He saw them. Again, in verse number 48, the wind was contrary unto them."
    },
    {
      "id": 187,
      "start": 1148.0799560546875,
      "end": 1153.3599853515625,
      "text": " He knew where they were and he knew what they were facing, but he knew what they needed. And we find"
    },
    {
      "id": 188,
      "start": 1153.3599853515625,
      "end": 1160.0799560546875,
      "text": " that in verse number 48, it says he cometh unto them. And then in verse number 51, he went up"
    },
    {
      "id": 189,
      "start": 1160.800048828125,
      "end": 1168.4000244140625,
      "text": " unto them. And the Bible tells us in this particular miracle that is given to us,"
    },
    {
      "id": 190,
      "start": 1168.4000244140625,
      "end": 1174.0799560546875,
      "text": " recorded for us in this passage of scripture, that when he went up unto them in verse number 51 into"
    },
    {
      "id": 191,
      "start": 1174.0799560546875,
      "end": 1181.6800537109375,
      "text": " the ship, the Bible says that the wind ceased. The wind ceased. The Bible tells us that they"
    },
    {
      "id": 192,
      "start": 1181.6800537109375,
      "end": 1187.3599853515625,
      "text": " were sore amazed in themselves beyond measure and wondered. These disciples during their"
    },
    {
      "id": 193,
      "start": 1188.0799560546875,
      "end": 1193.8399658203125,
      "text": " walk with the Lord Jesus Christ had the privilege of seeing the storm become more than once."
    },
    {
      "id": 194,
      "start": 1195.0400390625,
      "end": 1202.9599609375,
      "text": " And as we would give the attention here and see the power of our God over nature."
    },
    {
      "id": 195,
      "start": 1203.9200439453125,
      "end": 1209.0400390625,
      "text": " And the Bible says that, remember what John said in John chapter number 6, that they willingly"
    },
    {
      "id": 196,
      "start": 1209.0400390625,
      "end": 1215.52001953125,
      "text": " received him into the ship. And I think that it's important for us to understand that they"
    },
    {
      "id": 197,
      "start": 1215.52001953125,
      "end": 1220.6400146484375,
      "text": " willingly received him to the ship. And it says to us in verse number 51 of Mark 6, that he went"
    },
    {
      "id": 198,
      "start": 1220.6400146484375,
      "end": 1228.3199462890625,
      "text": " up unto them into the ship and the wind ceased. The wind ceased. See this evening, as we look at"
    },
    {
      "id": 199,
      "start": 1228.3199462890625,
      "end": 1232.8800048828125,
      "text": " this portion of scripture, and it's a great miracle that was performed, no doubt the Lord"
    },
    {
      "id": 200,
      "start": 1232.8800048828125,
      "end": 1240.1600341796875,
      "text": " is seeking to develop his disciples. And he gave them the direction to go onto the, into the ship"
    },
    {
      "id": 201,
      "start": 1240.1600341796875,
      "end": 1244.8800048828125,
      "text": " and to go onto the other side, unto Bethsaida. And they were obedient to the direction that the"
    },
    {
      "id": 202,
      "start": 1244.8800048828125,
      "end": 1250.8800048828125,
      "text": " Lord had given. And we find that there's this storm and we notice all those things are taking"
    },
    {
      "id": 203,
      "start": 1250.8800048828125,
      "end": 1255.760009765625,
      "text": " place. But this evening, I want you to think about your life. And I want you to understand that he"
    },
    {
      "id": 204,
      "start": 1255.760009765625,
      "end": 1262.56005859375,
      "text": " sees you. We can look here and see that it says he saw them. We can speak about the disciples that"
    },
    {
      "id": 205,
      "start": 1262.56005859375,
      "end": 1271.280029296875,
      "text": " were in the boat, in the ship, but he sees you. He knows where you are. Where they were is not where"
    },
    {
      "id": 206,
      "start": 1271.280029296875,
      "end": 1277.52001953125,
      "text": " we are. Right? I'm not in the middle of a ship or in the middle of a sea. I'm not on a ship."
    },
    {
      "id": 207,
      "start": 1278.6400146484375,
      "end": 1284.6400146484375,
      "text": " I don't plan to go on too many ships. Amen. It's not really my cup of tea, if you understand."
    },
    {
      "id": 208,
      "start": 1285.3599853515625,
      "end": 1291.3599853515625,
      "text": " Joseph's not too excited about ships either. And, but the reality is that they're in a different"
    },
    {
      "id": 209,
      "start": 1291.3599853515625,
      "end": 1296.3199462890625,
      "text": " place than where we are. And I'm in a different place than you are. And the person on the other"
    },
    {
      "id": 210,
      "start": 1296.3199462890625,
      "end": 1299.52001953125,
      "text": " side of the auditorium is in a different place than you are. The person in the front of the"
    },
    {
      "id": 211,
      "start": 1299.52001953125,
      "end": 1306.3199462890625,
      "text": " auditorium is in a different place. You understand what I'm saying. But the omniscient Almighty God"
    },
    {
      "id": 212,
      "start": 1307.280029296875,
      "end": 1315.0400390625,
      "text": " sees you. He knows where you are. Where they were was in the ship on the sea."
    },
    {
      "id": 213,
      "start": 1316.6400146484375,
      "end": 1322.6400146484375,
      "text": " And what they were facing was a storm. The wind was contrary unto them. And he knew what they"
    },
    {
      "id": 214,
      "start": 1322.6400146484375,
      "end": 1328.9599609375,
      "text": " were dealing with. He knew what they were facing. I'm not facing a contrary wind on a ship."
    },
    {
      "id": 215,
      "start": 1329.6800537109375,
      "end": 1334.4000244140625,
      "text": " On a sea. But you're facing something different than I'm facing."
    },
    {
      "id": 216,
      "start": 1336.239990234375,
      "end": 1344.1600341796875,
      "text": " We understand. But he knows what you're facing. Individually. He sees you. He knows what you're"
    },
    {
      "id": 217,
      "start": 1344.1600341796875,
      "end": 1351.52001953125,
      "text": " facing. And let me say this. He knows what you need. He knows better what you need than what"
    },
    {
      "id": 218,
      "start": 1351.52001953125,
      "end": 1357.0400390625,
      "text": " you think you need. He knows better what you need than what I think you need."
    },
    {
      "id": 219,
      "start": 1358.8800048828125,
      "end": 1363.760009765625,
      "text": " Or than your spouse thinks that you need or whatever, right? He knows what we need."
    },
    {
      "id": 220,
      "start": 1365.3599853515625,
      "end": 1371.760009765625,
      "text": " And here's the wonderful thing. He can meet that need. He can meet that need. He is able."
    },
    {
      "id": 221,
      "start": 1373.0400390625,
      "end": 1379.1199951171875,
      "text": " And this evening, I hope that we could just be comforted for a few moments as we look at this"
    },
    {
      "id": 222,
      "start": 1379.1199951171875,
      "end": 1387.52001953125,
      "text": " portion of scripture and think about those phrases. He saw them. He saw them. And this"
    },
    {
      "id": 223,
      "start": 1387.52001953125,
      "end": 1396.47998046875,
      "text": " evening, I don't know. Maybe you're the only person in the room that knows what you're dealing with."
    },
    {
      "id": 224,
      "start": 1398.3199462890625,
      "end": 1403.760009765625,
      "text": " But don't forget that God knows what you're dealing with. And really, that's the most"
    },
    {
      "id": 225,
      "start": 1403.760009765625,
      "end": 1409.1199951171875,
      "text": " important, is it not? Because he can do for you what no one else can do for you."
    },
    {
      "id": 226,
      "start": 1409.8399658203125,
      "end": 1413.8399658203125,
      "text": " And this evening, these disciples in Mark chapter number 6, they got to see a great miracle. They"
    },
    {
      "id": 227,
      "start": 1413.8399658203125,
      "end": 1419.3599853515625,
      "text": " saw that the wind ceased when he came up in the ship. And you know, the reality is that"
    },
    {
      "id": 228,
      "start": 1420.0,
      "end": 1425.9200439453125,
      "text": " God's still working miracles today in your life, in my life. He still answers prayer. He still"
    },
    {
      "id": 229,
      "start": 1425.9200439453125,
      "end": 1432.8800048828125,
      "text": " meets the needs. He still works and does exceeding abundantly above all that we could ask or think."
    },
    {
      "id": 230,
      "start": 1433.9200439453125,
      "end": 1439.760009765625,
      "text": " Because we serve the Lord God omnipotent. And what a joy it is to know this evening"
    },
    {
      "id": 231,
      "start": 1440.719970703125,
      "end": 1445.5999755859375,
      "text": " that he knows where we are. He knows what we're facing and he knows what we need."
    },
    {
      "id": 232,
      "start": 1446.3199462890625,
      "end": 1449.280029296875,
      "text": " Father, we love you. We thank you for loving us."
    },
    {
      "id": 233,
      "start": 1451.1199951171875,
      "end": 1454.4000244140625,
      "text": " Just a simple thought this evening from this portion of scripture."
    },
    {
      "id": 234,
      "start": 1454.4000244140625,
      "end": 1465.760009765625,
      "text": " But I know this evening that you helped me personally as I prepared, even as I delivered."
    },
    {
      "id": 235,
      "start": 1467.3599853515625,
      "end": 1472.239990234375,
      "text": " God, I pray that this evening your word has helped your people tonight."
    },
    {
      "id": 236,
      "start": 1473.760009765625,
      "end": 1478.4000244140625,
      "text": " Those that are gathered locally, those who have tuned in via live stream,"
    },
    {
      "id": 237,
      "start": 1479.0400390625,
      "end": 1491.0400390625,
      "text": " that we'd be encouraged tonight as we understand and observe these simple truths that you know"
    },
    {
      "id": 238,
      "start": 1491.0400390625,
      "end": 1498.3199462890625,
      "text": " where we are, you know what we're facing, and you know what we need. We trust you. I pray that you'd"
    },
    {
      "id": 239,
      "start": 1498.3199462890625,
      "end": 1503.3599853515625,
      "text": " help us to submit to you. I pray that you'd work through our time of prayer that you alone would"
    },
    {
      "id": 240,
      "start": 1503.3599853515625,
      "end": 1507.6800537109375,
      "text": " be glorified. For it's in Christ's name we pray, amen."
    }
  ],
  "processed_at": "2025-04-17T06:33:22.330213"
}