{
  "video_id": "t3763lfMrgQ",
  "text": "before and just be looking at a few verses of scripture this evening in the book of Philippians. And of course, as you know, here on Wednesday evenings for the last couple of months, we've been dealing with the subject matter of teach me. And we began this series by looking at the psalmist and looking at the heart cry, the plea of the psalmist when he says, teach me. And I'm so thankful that he desires to teach us. And of course, as we echo the words of the psalmist and we have that heart attitude of surrender and humility, and we recognize that we need to be taught of the Lord, he will teach us many valuable lessons. The last couple of weeks on Wednesday evening, we've kind of dealt with various classrooms of instruction, various means in which God will use in our lives to teach us certain lessons. And this evening, I want to look at this passage of scripture here in Philippians chapter four, Look in verse number 10 with me nearing the end of this book. And the Bible says, But I rejoiced in the Lord greatly, that now at the last your care of me hath flourished again, wherein ye were also careful, but ye lacked opportunity. Not that I speak in respect of want, for I have learned in whatsoever state I am therewith to be content. I know both how to be abased, and I know how to abound everywhere, and in all things I am instructed both to be full and to be hungry, both to abound and to suffer need. And we're just going to look at verses 10 through 12 this evening of Philippians four. It's interesting to me because two of the subjects that Paul references in the book of Philippians are joy and contentment. It's very interesting when you consider the fact that Paul is writing from a Roman prison and it's great impact in my life when I think about him writing from a Roman prison and understanding the circumstances in which he was dealing with. And yet throughout these four chapters, two of the subjects that are referenced often are the idea of joy. Of course, that's the broader, the more common theme of the book of Philippians, but he also deals with the subject of contentment here in this passage of scripture. When we think about these two particular subjects, joy and contentment, we understand that they're needed in our lives even today. If you're taking notes, I've titled the message this evening, I have learned to be content. I have learned to be content. The word content, according to the 1828 Webster's Dictionary, here's a definition and I like this. It says, rest or quietness of mind in the present condition, satisfaction which holds the mind in peace, restraining complaint. That's a good definition. Let me say it again, content, rest or quietness of mind in the present condition. So, many people say, I'd be content if, no, no, content is that rest, that quietness in the present condition. Whatever it is, Paul says here, whatsoever state I am therewith to be content. So, we see in that present condition, and then it goes on to say the satisfaction which holds the mind in peace, restraining complaint. And what a great need for us when we think about the subject and how Paul says, I have learned, in whatsoever state I am, I have learned to be content. As we think about this lesson that Paul learned and a lesson that we could learn, I want you to think about some things because I find in verse number 11, when Paul makes the statement, it's very informative to me. Notice again in verse number 11, he says, not that I speak in respect of want. Now, understand, he's writing to these Philippian believers, and contextually, as you study the book, as you understand during his missionary journey, the way in which the church at Philippi communicated with the Apostle Paul. In other words, they were giving to his needs. They were sacrificial in their giving. They were praying for the Apostle Paul. He mentions that later on near the end of the chapter here, the end of the book, and he says that in verse number 10, I rejoiced in the Lord greatly. Why? That now at the last, your care of me hath flourished again. And he says later on in verse number 14 that ye did communicate with my affliction. In verse number 15, now you Philippians know also that in the beginning of the gospel when I departed from Macedonia, no church communicated with me as concerning giving and receiving. Notice this. But ye only. So, Paul is rejoicing because of the opportunity that they had to partner with him and to invest in the ministry, and he says at the end of the verse, he says, wherein ye were also careful, but ye lacked opportunity. Now, look in verse number 11. He says, not that I speak in respect of want. He's not writing to them. He's not saying I'm speaking, I'm not speaking in respect of want, and then he says this, For I have learned in whatsoever state I am therewith to be content. This statement in verse number 11 is very informative to me. Number one, I would say this, to be content is not our default setting. To be content is not my default setting. To be content is not your default setting. I mentioned on Sunday morning when I preached the message there from Numbers 11, when the people complained, and I said this in that message, that the default setting for the children of Israel was to complain. Every time something went a little bit off course for the children of Israel, their default setting was to complain. It was not, what is God doing in this situation? What is God going to do miraculously? We've seen him do this, we've observed his power here, and the excitement, the anticipation of what is God going to do? No, their default setting was to complain. We looked at that thoroughly on Sunday morning, and as I look at this subject and consider this lesson learned by the Apostle Paul, I would say to be content, it's not our default setting. If you think about babies, babies, you don't have to teach them to be discontent. They cry just for the purpose of being held, and they want what some other child in the nursery has, and you can understand if you've worked in the nursery, if you've worked amongst children, even your own children, and you just kind of can see there's an immediate understanding that they don't have to be taught to be discontent, and neither do we. To be content is not my default setting. I must therefore, as Paul says, I, we must learn to be content. And I would ask this question, I asked myself as I was preparing the message, and I asked myself this question, I wonder what it is that I would say, I wonder this evening what it is that you would say, I wonder if we would say this, I have learned to be content. Or maybe, here's what I would say, I am learning to be content. I can't be where the Apostle Paul is, I'm just being transparent and honest with you this evening. I'm not to that point where I have learned that I can say I have learned in what sort of state I am there with to be content. That's my goal, that's my aim, that's my desire. But the reality is that if I'm honest and I evaluate appropriately before the Lord, and I'm honest with you this evening, I have to say I am learning in what sort of state I am there with to be content. And I think for most of us, that's probably where we are. We're learning. We're learning to be content. And so we have this subject matter of teach me, and we see that Paul specifically says I've learned this truth, I've learned this lesson in what sort of state I am there with to be content. I would ask the question, if we understand this evening that it's not my default setting, if I understand this evening that I must learn to be content, I would ask the question, how is it that we learn to be content? What is it that God does in our life to teach us contentment that we can come to the place where we say, as Paul said, I have learned in what sort of state I am there with to be content? I would say this, Paul learned this lesson, I believe, in the classroom of want. He learned this lesson in the classroom of want. We talked last week about the classroom of loneliness with Joseph and the great lessons that he learned in the classroom of loneliness, and we find this evening that Paul says not that I speak in respect of want, for I have learned in what sort of state I am there with to be content. Notice what he says in verse number 12, I know both how to be abased and I know how to abound. Everywhere and in all things I am instructed both to be full and to be hungry, both to abound and to suffer need. I believe that it's in this classroom of want that God often will teach us the subject of contentment and understanding that He gives us that which we need. See there's this inappropriate perspective that is so common in our society today, and it's not just common amongst Bible believers, I believe that it's common amongst generally within society, and that is this, if we have plenty, then we're having God's favor, God's pleased with us. Why? Because we're abounding, we have plenty. And if we lack, well then that's God's judgment. But, you know, that's not true biblically. Biblically, we understand that there are times in which, if you think about the church of the Laodiceans, when they're increased with goods and have need of nothing, that's what they're indicted for, right? Because they're in a place where they think, I don't need anything, not even God really is what's being referred to there in Revelation chapter number 3. And we think about this perspective that is skewed by the world in which we live, and we must understand biblically that the reality is that, look, the children of Israel, when Jeremiah is prophesying to Judah, and Jeremiah, the captivity takes place, and these guys say go pray for us, and whatever God says we're going to do, and then Jeremiah comes and gives them the message, and they say no, we're not going to do that because you're lying to us, and then they have this perspective, when we were offering to the queen of heaven, we had all of these things, we weren't suffering, we weren't having this trouble, and so here's what we're going to do, we're going to go back to doing that. Terrible perspective, terrible perspective. And this evening, if I'm going to learn to be content, oftentimes, not always, but oftentimes God will use that classroom of want, but I would say this, what really helps us to learn this contentment into being content is having a proper view of God. Because the reality is that in verse number 11, Paul says in the middle of what I've used as the title this evening, I have learned to be content, he says this, in whatsoever state I am. In whatsoever state I am. So when I have a proper view of God, when I understand that present condition, remember that was part of that definition that I shared of what it means to be content in the present condition, it's not being content in what we think will make us content, it's being content in contentment, true contentment is in whatever our present condition is, in that whatsoever state I am. And we find that he says I know how to be abased, I know how to abound, but the reality is that if I understand this evening, and I have a proper view of God, and I understand tonight that God is in control, that God is sovereign, we believe that biblically, the Bible clearly communicates to us as the people of God that he is sovereign, that he rules in the affairs of mankind. And when we understand that this evening, when we have that proper view of God, when we see him as Isaiah saw him, high, holy, and lifted up, and we see him sitting upon his throne, and we understand that he's in control, then, since God, because we understand that God is in control, then we also must understand that he has allowed whatever state I'm in, and he's allowed it for his purpose. He's allowed it for his glory. And so Paul is sitting in a Roman prison, he's writing to the church in Philippi, and he's writing to them about rejoicing, about being joyful, but he's also writing to them about being content, and he's saying, I have learned in what sort of state I am therewith to be content. Sitting in a Roman prison, Paul was content. Paul was content. You say, I don't get it. How? How could you be content in that situation? Because he knew God was in control. He knew that his life was in God's hands. And when we understand this evening, we sing songs about the fact that I am his, and I belong to him, and here, Lord, here's my life. I give you control, and take my life, and let it be, and we sing songs such as that, but the reality is that as we surrender to God, we sing, I surrender all. Sometimes when we think about all those songs, we say, I'm in God's hands, and God has a perfect plan and a perfect purpose for everything that he allows, and so therefore, I can be content because I know that God's in control, and I know that he has a purpose. Think about this. We're going to work backwards and make our way to Philippians 1, but look in Philippians 4. We're in verses 10 through 12, but look back in verse number 4, a verse that many of us have memorized. Rejoice in the Lord always, and again, I say rejoice. Now, how can I rejoice in the Lord always? Because he's always good, because he's sovereign, because he's God, because he has a plan, because he has a purpose, and as I'm rejoicing, that is evidence of that contentment, right? Because remember, I mentioned in that definition that content, to be content, is that satisfaction which holds the mind in peace, restraining complaint. So instead of me complaining about my circumstances, instead of me complaining about my lot in life, I'm understanding that God's in control, I've learned to be content, and I'm rejoicing. Why? Because God has a plan. I was talking to one of our missionaries on Monday afternoon. Actually, it was early evening when I was speaking to him, and it was actually Lacy Wheeler down in Mexico, and I had mentioned a few weeks ago about him sending me a video of them getting some scriptures down into Honduras and the vehicle breaking down and them having to be towed and just all the situation with that. And we were rehearsing and talking about that because we were talking about getting scriptures in Guatemala and some of the difficulties that they had, and they were aiming to go there and ended up in Honduras because of some border issues. But the reality is that when they're in Honduras, man, the vehicle that's got all the scriptures in it, it breaks down. And you can get all kinds of bothered and sideways and upset, but because it broke down where it did, they had more opportunities. You mean to tell me that God isn't in control? He could keep that vehicle running. He could allow that vehicle. We in our minds, we could say, well, there's a better place where I could have broken down. God says, no, no, I allowed you to break down exactly where I allowed you to break down. Why? Because I have a purpose. I have a plan. And there were contacts that were made in that particular village and then in the adjacent city that never would have been made had they not broken down where they did. So we learn to be content. I am learning to be content. Rejoice in the Lord always. And again, I say rejoice. We looked at this verse on Sunday morning, but turn back, if you will, to chapter number two and look at verse number 14. We kind of finished with this verse on Sunday, but here in Philippians 2 and verse 14, do all things without murmurings and disputings. Again, we see all things, not some things, not the things that we enjoy, not the things that we want to do, but do all things without murmurings and disputings. And we understand that God gives us the ability to do that. And I'll turn back to chapter one and look at verse number 12. I often reference this verse of Scripture. I'll be honest with you, it's one of the verses of Scripture that has had a profound impact in my life. And I'm thankful for God's Word. There's so many verses of Scripture that I could go to and I could say, God used these verses in such a profound way in my life. And this is one of them. This is definitely in the top, I'll say, 25 verses that I would run to and say, God used this verse in my life. And notice what Paul says to these believers in Philippi. He says, but I would, ye should understand, brethren, that the things which have happened unto me have fallen out rather under the furtherance of the gospel. Now those things that happened unto Paul, he says that he wanted these believers in Philippi to understand this. He wanted them to have a knowledge of this. He goes right into the next verse and speaks about the bonds that he has in Christ. And when you begin to understand, listen, for Paul, the things that happened to him are different than the things that happened to you, than the things that happened to me. But the reality is that we all have things that happen in our life. And when we understand that those things that happen in our lives are ordained by God who is sovereign and who is in control, and we understand that he has a greater purpose and why he's allowed those things, I can be content. I can rest and rejoice. Why? Because my God's in control and he makes no mistakes. You believe this evening that he doeth all things well? I do. I believe that. He doeth all things well. He makes no mistakes. In this evening, as we think about this truth of how do we learn contentment, there are times in which God will use the classroom of want. It is absolutely essential that we have that proper view of who God is and that we just remove ourselves from that inappropriate perspective that is so common in our society today that plenty equals God's favor and lack equals God's judgment, but that we would learn that God is in control and God has a plan and God reigns supreme, and I can be content in whatsoever state I am. Turn over to the book of Hebrews, if you will, in chapter 13. Look at two verses as we close this evening, one here from the New Testament, one from the Old. In Hebrews 13 and verse number 5, the Bible says this, Hebrews 13 and verse number 5, let your conversation be without covetousness and be content with such things as ye have, for he hath said, I will never leave thee nor forsake thee, so that we may boldly say, the Lord is my helper and I will not fear what man shall do unto me. You know, we have so many things that money cannot buy. So many people today are looking to be content in the things that they can buy and how they can have more and how that's going to bring them a level of contentment, but here the Bible says that we're to let your conversation be without covetousness and be content with such things as you have, and then he reminds us of the promise of God's presence, that he said, I will never leave thee nor forsake thee. He reminds us that that means that we can boldly say, the Lord is my helper. Aren't you thankful for that? He says, and I will not fear what man shall do unto me. In closing this evening, we see it here in verse number 5 when he speaks about covetousness and contentment. Turn to the book of Jeremiah, if you will. Let me just give you a warning as we close this evening. Beware of the enemy of contentment. You know what the enemy is of contentment? It's covetousness. And we see in Jeremiah chapter 6, very quickly, I want you to see what the Bible says about this thing of covetousness. No doubt we see this in our society today, and it's the enemy of contentment. And if I'm seeking to learn to be content, if I'm desiring to learn what Paul learned, what he references here in the book of Philippians, then I must be aware of what the enemy of contentment is. Listen, we live in a society that bombards us with advertisements, the marketing industry on telling you what you need and why you need it, right? Don't we? I mean, there are things that you purchase that you never even thought you needed, but you saw some kind of something and it's like, man, I guess I do need that. I've never been able to operate without that. I mean, isn't that amazing? And that's what the marketing industry, that's what they do, that's why they exist. Look at Jeremiah 6 and verse 13. For from the least of them, even unto the greatest of them, every one is given to covetousness. And from the prophet, even unto the priest, every one dealeth falsely. That is a sad indictment on the children of Israel, is it not? Judah, terrible indictment. Every one of them, from the least, even to the greatest, every one of them is given to covetousness, and every one of them, from the prophet, even unto the priest, dealeth falsely. This morning, this evening, whatever it is, this evening, our society is geared to cause us to be covetous. But as we look in the Word of God, we're to be content. And Paul says, I have learned. I learned a valuable lesson. What I learned is in what sort of state I am therewith to be content. This evening, as I mentioned already, I would simply say I am learning to be content. But I want to be able to reach that place where I can say, I have learned to be content. Amen? Because, listen, somebody said this, when God is all you have, you find out for the first time in your life that God is all you need. He's saying in a little course, He's all I need. He really is. And He takes such good care of us. And oh, that we learn to be content, and it will lead us to a place of rejoice in the Lord always. And again, I say rejoice. Why? Because there's no room for complaint. Complaint has been restrained because I've learned to be content. Let's pray. Father, we love You. We thank You for loving us. I thank You for the testimony of the Apostle Paul here in this passage of Scripture. And God, I pray that You'd help each of us this evening. Lord, I pray that You would help us to evaluate honestly our lives in this area of contentment. That God, You would help us to be in a place, perhaps there's some that could say with Paul that I have learned to be content. Perhaps there's others that would say I am learning to be content. I pray that it'd be each of our desires that, God, You would teach us contentment, that You'd help us, Lord, to see You in Your proper place, Lord, to understand that You're sovereign in control. You do all things well, that You make no mistakes, and help us, Lord, to be content. Thank You for the privilege of prayer. I pray that You'd bless our time, and we'll thank You for all that You'll do, for it's in Christ's name we pray. Amen. Does anyone need a bulletin this evening? You did not get one when you came in. You need one? Miss Dionne.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.199999809265137,
      "text": " before and just be looking at a few verses of scripture this evening in the book of Philippians."
    },
    {
      "id": 1,
      "start": 5.199999809265137,
      "end": 9.279999732971191,
      "text": " And of course, as you know, here on Wednesday evenings for the last couple of months, we've"
    },
    {
      "id": 2,
      "start": 9.279999732971191,
      "end": 12.539999961853027,
      "text": " been dealing with the subject matter of teach me."
    },
    {
      "id": 3,
      "start": 12.539999961853027,
      "end": 17.68000030517578,
      "text": " And we began this series by looking at the psalmist and looking at the heart cry, the"
    },
    {
      "id": 4,
      "start": 17.68000030517578,
      "end": 21.399999618530273,
      "text": " plea of the psalmist when he says, teach me."
    },
    {
      "id": 5,
      "start": 21.399999618530273,
      "end": 25.84000015258789,
      "text": " And I'm so thankful that he desires to teach us."
    },
    {
      "id": 6,
      "start": 25.84000015258789,
      "end": 30.280000686645508,
      "text": " And of course, as we echo the words of the psalmist and we have that heart attitude"
    },
    {
      "id": 7,
      "start": 30.280000686645508,
      "end": 34.68000030517578,
      "text": " of surrender and humility, and we recognize that we need to be taught of the Lord, he"
    },
    {
      "id": 8,
      "start": 34.68000030517578,
      "end": 37.68000030517578,
      "text": " will teach us many valuable lessons."
    },
    {
      "id": 9,
      "start": 37.68000030517578,
      "end": 42.400001525878906,
      "text": " The last couple of weeks on Wednesday evening, we've kind of dealt with various classrooms"
    },
    {
      "id": 10,
      "start": 42.400001525878906,
      "end": 47.15999984741211,
      "text": " of instruction, various means in which God will use in our lives to teach us certain"
    },
    {
      "id": 11,
      "start": 47.15999984741211,
      "end": 48.47999954223633,
      "text": " lessons."
    },
    {
      "id": 12,
      "start": 48.47999954223633,
      "end": 53.720001220703125,
      "text": " And this evening, I want to look at this passage of scripture here in Philippians chapter four,"
    },
    {
      "id": 13,
      "start": 53.959999084472656,
      "end": 57.84000015258789,
      "text": " Look in verse number 10 with me nearing the end of this book."
    },
    {
      "id": 14,
      "start": 57.84000015258789,
      "end": 58.84000015258789,
      "text": " And the Bible says,"
    },
    {
      "id": 15,
      "start": 58.84000015258789,
      "end": 65.4000015258789,
      "text": " But I rejoiced in the Lord greatly, that now at the last your care of me hath flourished"
    },
    {
      "id": 16,
      "start": 65.4000015258789,
      "end": 73.23999786376953,
      "text": " again, wherein ye were also careful, but ye lacked opportunity."
    },
    {
      "id": 17,
      "start": 73.23999786376953,
      "end": 80.23999786376953,
      "text": " Not that I speak in respect of want, for I have learned in whatsoever state I am therewith"
    },
    {
      "id": 18,
      "start": 80.23999786376953,
      "end": 81.87999725341797,
      "text": " to be content."
    },
    {
      "id": 19,
      "start": 81.87999725341797,
      "end": 87.31999969482422,
      "text": " I know both how to be abased, and I know how to abound everywhere, and in all things"
    },
    {
      "id": 20,
      "start": 87.31999969482422,
      "end": 94.36000061035156,
      "text": " I am instructed both to be full and to be hungry, both to abound and to suffer need."
    },
    {
      "id": 21,
      "start": 94.36000061035156,
      "end": 98.23999786376953,
      "text": " And we're just going to look at verses 10 through 12 this evening of Philippians four."
    },
    {
      "id": 22,
      "start": 98.23999786376953,
      "end": 101.5999984741211,
      "text": " It's interesting to me because two of the subjects that Paul references in the book"
    },
    {
      "id": 23,
      "start": 101.5999984741211,
      "end": 105.16000366210938,
      "text": " of Philippians are joy and contentment."
    },
    {
      "id": 24,
      "start": 105.16000366210938,
      "end": 111.5199966430664,
      "text": " It's very interesting when you consider the fact that Paul is writing from a Roman prison"
    },
    {
      "id": 25,
      "start": 112.16000366210938,
      "end": 116.87999725341797,
      "text": " and it's great impact in my life when I think about him writing from a Roman prison and"
    },
    {
      "id": 26,
      "start": 116.87999725341797,
      "end": 120.36000061035156,
      "text": " understanding the circumstances in which he was dealing with."
    },
    {
      "id": 27,
      "start": 120.36000061035156,
      "end": 125.72000122070312,
      "text": " And yet throughout these four chapters, two of the subjects that are referenced often"
    },
    {
      "id": 28,
      "start": 125.72000122070312,
      "end": 127.4800033569336,
      "text": " are the idea of joy."
    },
    {
      "id": 29,
      "start": 127.4800033569336,
      "end": 133.1199951171875,
      "text": " Of course, that's the broader, the more common theme of the book of Philippians, but he also"
    },
    {
      "id": 30,
      "start": 133.1199951171875,
      "end": 137.36000061035156,
      "text": " deals with the subject of contentment here in this passage of scripture."
    },
    {
      "id": 31,
      "start": 137.36000061035156,
      "end": 143.1999969482422,
      "text": " When we think about these two particular subjects, joy and contentment, we understand"
    },
    {
      "id": 32,
      "start": 143.1999969482422,
      "end": 146.27999877929688,
      "text": " that they're needed in our lives even today."
    },
    {
      "id": 33,
      "start": 146.27999877929688,
      "end": 152.13999938964844,
      "text": " If you're taking notes, I've titled the message this evening, I have learned to be content."
    },
    {
      "id": 34,
      "start": 152.13999938964844,
      "end": 155.0,
      "text": " I have learned to be content."
    },
    {
      "id": 35,
      "start": 155.0,
      "end": 161.39999389648438,
      "text": " The word content, according to the 1828 Webster's Dictionary, here's a definition and I like"
    },
    {
      "id": 36,
      "start": 161.39999389648438,
      "end": 162.39999389648438,
      "text": " this."
    },
    {
      "id": 37,
      "start": 162.39999389648438,
      "end": 170.97999572753906,
      "text": " It says, rest or quietness of mind in the present condition, satisfaction which holds"
    },
    {
      "id": 38,
      "start": 170.97999572753906,
      "end": 176.75999450683594,
      "text": " the mind in peace, restraining complaint."
    },
    {
      "id": 39,
      "start": 176.75999450683594,
      "end": 178.9199981689453,
      "text": " That's a good definition."
    },
    {
      "id": 40,
      "start": 178.9199981689453,
      "end": 184.9199981689453,
      "text": " Let me say it again, content, rest or quietness of mind in the present condition."
    },
    {
      "id": 41,
      "start": 185.9199981689453,
      "end": 192.75999450683594,
      "text": " So, many people say, I'd be content if, no, no, content is that rest, that quietness in"
    },
    {
      "id": 42,
      "start": 192.75999450683594,
      "end": 194.32000732421875,
      "text": " the present condition."
    },
    {
      "id": 43,
      "start": 194.32000732421875,
      "end": 199.9199981689453,
      "text": " Whatever it is, Paul says here, whatsoever state I am therewith to be content."
    },
    {
      "id": 44,
      "start": 199.9199981689453,
      "end": 204.83999633789062,
      "text": " So, we see in that present condition, and then it goes on to say the satisfaction which"
    },
    {
      "id": 45,
      "start": 204.83999633789062,
      "end": 211.0,
      "text": " holds the mind in peace, restraining complaint."
    },
    {
      "id": 46,
      "start": 211.0800018310547,
      "end": 217.75999450683594,
      "text": " And what a great need for us when we think about the subject and how Paul says, I have"
    },
    {
      "id": 47,
      "start": 217.75999450683594,
      "end": 224.67999267578125,
      "text": " learned, in whatsoever state I am, I have learned to be content."
    },
    {
      "id": 48,
      "start": 224.67999267578125,
      "end": 230.8800048828125,
      "text": " As we think about this lesson that Paul learned and a lesson that we could learn, I want you"
    },
    {
      "id": 49,
      "start": 230.8800048828125,
      "end": 236.72000122070312,
      "text": " to think about some things because I find in verse number 11, when Paul makes the statement,"
    },
    {
      "id": 50,
      "start": 236.72000122070312,
      "end": 238.72000122070312,
      "text": " it's very informative to me."
    },
    {
      "id": 51,
      "start": 238.72000122070312,
      "end": 242.0399932861328,
      "text": " Notice again in verse number 11, he says, not that I speak in respect of want."
    },
    {
      "id": 52,
      "start": 242.0399932861328,
      "end": 246.8000030517578,
      "text": " Now, understand, he's writing to these Philippian believers, and contextually, as you study"
    },
    {
      "id": 53,
      "start": 246.8000030517578,
      "end": 252.67999267578125,
      "text": " the book, as you understand during his missionary journey, the way in which the church at Philippi"
    },
    {
      "id": 54,
      "start": 252.67999267578125,
      "end": 255.60000610351562,
      "text": " communicated with the Apostle Paul."
    },
    {
      "id": 55,
      "start": 255.60000610351562,
      "end": 257.7200012207031,
      "text": " In other words, they were giving to his needs."
    },
    {
      "id": 56,
      "start": 257.7200012207031,
      "end": 259.94000244140625,
      "text": " They were sacrificial in their giving."
    },
    {
      "id": 57,
      "start": 259.94000244140625,
      "end": 262.55999755859375,
      "text": " They were praying for the Apostle Paul."
    },
    {
      "id": 58,
      "start": 262.55999755859375,
      "end": 267.5199890136719,
      "text": " He mentions that later on near the end of the chapter here, the end of the book, and"
    },
    {
      "id": 59,
      "start": 267.5199890136719,
      "end": 271.8399963378906,
      "text": " he says that in verse number 10, I rejoiced in the Lord greatly."
    },
    {
      "id": 60,
      "start": 271.8399963378906,
      "end": 272.8399963378906,
      "text": " Why?"
    },
    {
      "id": 61,
      "start": 272.8399963378906,
      "end": 277.79998779296875,
      "text": " That now at the last, your care of me hath flourished again."
    },
    {
      "id": 62,
      "start": 277.79998779296875,
      "end": 283.20001220703125,
      "text": " And he says later on in verse number 14 that ye did communicate with my affliction."
    },
    {
      "id": 63,
      "start": 283.20001220703125,
      "end": 287.9200134277344,
      "text": " In verse number 15, now you Philippians know also that in the beginning of the gospel when"
    },
    {
      "id": 64,
      "start": 287.9200134277344,
      "end": 294.0,
      "text": " I departed from Macedonia, no church communicated with me as concerning giving and receiving."
    },
    {
      "id": 65,
      "start": 294.0,
      "end": 295.0,
      "text": " Notice this."
    },
    {
      "id": 66,
      "start": 295.0,
      "end": 297.0400085449219,
      "text": " But ye only."
    },
    {
      "id": 67,
      "start": 297.55999755859375,
      "end": 304.0400085449219,
      "text": " So, Paul is rejoicing because of the opportunity that they had to partner with him and to invest"
    },
    {
      "id": 68,
      "start": 304.0400085449219,
      "end": 310.0799865722656,
      "text": " in the ministry, and he says at the end of the verse, he says, wherein ye were also careful,"
    },
    {
      "id": 69,
      "start": 310.0799865722656,
      "end": 311.4800109863281,
      "text": " but ye lacked opportunity."
    },
    {
      "id": 70,
      "start": 311.4800109863281,
      "end": 313.32000732421875,
      "text": " Now, look in verse number 11."
    },
    {
      "id": 71,
      "start": 313.32000732421875,
      "end": 317.29998779296875,
      "text": " He says, not that I speak in respect of want."
    },
    {
      "id": 72,
      "start": 317.29998779296875,
      "end": 318.3599853515625,
      "text": " He's not writing to them."
    },
    {
      "id": 73,
      "start": 318.3599853515625,
      "end": 322.239990234375,
      "text": " He's not saying I'm speaking, I'm not speaking in respect of want, and then he says this,"
    },
    {
      "id": 74,
      "start": 322.239990234375,
      "end": 328.55999755859375,
      "text": " For I have learned in whatsoever state I am therewith to be content."
    },
    {
      "id": 75,
      "start": 328.55999755859375,
      "end": 331.760009765625,
      "text": " This statement in verse number 11 is very informative to me."
    },
    {
      "id": 76,
      "start": 331.760009765625,
      "end": 338.239990234375,
      "text": " Number one, I would say this, to be content is not our default setting."
    },
    {
      "id": 77,
      "start": 338.239990234375,
      "end": 341.32000732421875,
      "text": " To be content is not my default setting."
    },
    {
      "id": 78,
      "start": 341.32000732421875,
      "end": 343.9200134277344,
      "text": " To be content is not your default setting."
    },
    {
      "id": 79,
      "start": 343.9200134277344,
      "end": 348.3999938964844,
      "text": " I mentioned on Sunday morning when I preached the message there from Numbers 11, when the"
    },
    {
      "id": 80,
      "start": 348.5199890136719,
      "end": 352.8800048828125,
      "text": " people complained, and I said this in that message, that the default setting for the"
    },
    {
      "id": 81,
      "start": 352.8800048828125,
      "end": 355.3999938964844,
      "text": " children of Israel was to complain."
    },
    {
      "id": 82,
      "start": 355.3999938964844,
      "end": 360.6000061035156,
      "text": " Every time something went a little bit off course for the children of Israel, their default"
    },
    {
      "id": 83,
      "start": 360.6000061035156,
      "end": 361.7200012207031,
      "text": " setting was to complain."
    },
    {
      "id": 84,
      "start": 361.7200012207031,
      "end": 365.0,
      "text": " It was not, what is God doing in this situation?"
    },
    {
      "id": 85,
      "start": 365.0,
      "end": 367.6000061035156,
      "text": " What is God going to do miraculously?"
    },
    {
      "id": 86,
      "start": 367.6000061035156,
      "end": 372.94000244140625,
      "text": " We've seen him do this, we've observed his power here, and the excitement, the anticipation"
    },
    {
      "id": 87,
      "start": 372.94000244140625,
      "end": 374.6000061035156,
      "text": " of what is God going to do?"
    },
    {
      "id": 88,
      "start": 374.6000061035156,
      "end": 377.6000061035156,
      "text": " No, their default setting was to complain."
    },
    {
      "id": 89,
      "start": 377.6000061035156,
      "end": 382.55999755859375,
      "text": " We looked at that thoroughly on Sunday morning, and as I look at this subject and consider"
    },
    {
      "id": 90,
      "start": 382.55999755859375,
      "end": 388.7200012207031,
      "text": " this lesson learned by the Apostle Paul, I would say to be content, it's not our default"
    },
    {
      "id": 91,
      "start": 388.7200012207031,
      "end": 389.7200012207031,
      "text": " setting."
    },
    {
      "id": 92,
      "start": 389.7200012207031,
      "end": 395.8800048828125,
      "text": " If you think about babies, babies, you don't have to teach them to be discontent."
    },
    {
      "id": 93,
      "start": 395.8800048828125,
      "end": 401.9200134277344,
      "text": " They cry just for the purpose of being held, and they want what some other child in the"
    },
    {
      "id": 94,
      "start": 401.9200134277344,
      "end": 406.9200134277344,
      "text": " nursery has, and you can understand if you've worked in the nursery, if you've worked amongst"
    },
    {
      "id": 95,
      "start": 406.9599914550781,
      "end": 411.9200134277344,
      "text": " children, even your own children, and you just kind of can see there's an immediate"
    },
    {
      "id": 96,
      "start": 411.9200134277344,
      "end": 418.9200134277344,
      "text": " understanding that they don't have to be taught to be discontent, and neither do we."
    },
    {
      "id": 97,
      "start": 418.9200134277344,
      "end": 422.3599853515625,
      "text": " To be content is not my default setting."
    },
    {
      "id": 98,
      "start": 422.3599853515625,
      "end": 430.0,
      "text": " I must therefore, as Paul says, I, we must learn to be content."
    },
    {
      "id": 99,
      "start": 430.0,
      "end": 434.4800109863281,
      "text": " And I would ask this question, I asked myself as I was preparing the message, and I asked"
    },
    {
      "id": 100,
      "start": 434.4800109863281,
      "end": 439.0,
      "text": " myself this question, I wonder what it is that I would say, I wonder this evening what"
    },
    {
      "id": 101,
      "start": 439.0,
      "end": 444.67999267578125,
      "text": " it is that you would say, I wonder if we would say this, I have learned to be content."
    },
    {
      "id": 102,
      "start": 444.67999267578125,
      "end": 449.44000244140625,
      "text": " Or maybe, here's what I would say, I am learning to be content."
    },
    {
      "id": 103,
      "start": 449.44000244140625,
      "end": 453.2799987792969,
      "text": " I can't be where the Apostle Paul is, I'm just being transparent and honest with you"
    },
    {
      "id": 104,
      "start": 453.2799987792969,
      "end": 454.2799987792969,
      "text": " this evening."
    },
    {
      "id": 105,
      "start": 454.2799987792969,
      "end": 458.8399963378906,
      "text": " I'm not to that point where I have learned that I can say I have learned in what sort"
    },
    {
      "id": 106,
      "start": 458.8399963378906,
      "end": 460.6400146484375,
      "text": " of state I am there with to be content."
    },
    {
      "id": 107,
      "start": 460.6400146484375,
      "end": 463.67999267578125,
      "text": " That's my goal, that's my aim, that's my desire."
    },
    {
      "id": 108,
      "start": 463.67999267578125,
      "end": 468.8800048828125,
      "text": " But the reality is that if I'm honest and I evaluate appropriately before the Lord,"
    },
    {
      "id": 109,
      "start": 468.8800048828125,
      "end": 473.760009765625,
      "text": " and I'm honest with you this evening, I have to say I am learning in what sort of state"
    },
    {
      "id": 110,
      "start": 473.760009765625,
      "end": 475.8800048828125,
      "text": " I am there with to be content."
    },
    {
      "id": 111,
      "start": 475.8800048828125,
      "end": 479.44000244140625,
      "text": " And I think for most of us, that's probably where we are."
    },
    {
      "id": 112,
      "start": 479.44000244140625,
      "end": 481.1600036621094,
      "text": " We're learning."
    },
    {
      "id": 113,
      "start": 481.1600036621094,
      "end": 482.67999267578125,
      "text": " We're learning to be content."
    },
    {
      "id": 114,
      "start": 482.67999267578125,
      "end": 487.4800109863281,
      "text": " And so we have this subject matter of teach me, and we see that Paul specifically says"
    },
    {
      "id": 115,
      "start": 487.4800109863281,
      "end": 492.3599853515625,
      "text": " I've learned this truth, I've learned this lesson in what sort of state I am there with"
    },
    {
      "id": 116,
      "start": 492.3599853515625,
      "end": 493.3599853515625,
      "text": " to be content."
    },
    {
      "id": 117,
      "start": 493.3599853515625,
      "end": 498.44000244140625,
      "text": " I would ask the question, if we understand this evening that it's not my default setting,"
    },
    {
      "id": 118,
      "start": 498.44000244140625,
      "end": 502.8399963378906,
      "text": " if I understand this evening that I must learn to be content, I would ask the question, how"
    },
    {
      "id": 119,
      "start": 502.8399963378906,
      "end": 505.94000244140625,
      "text": " is it that we learn to be content?"
    },
    {
      "id": 120,
      "start": 505.94000244140625,
      "end": 511.3599853515625,
      "text": " What is it that God does in our life to teach us contentment that we can come to the place"
    },
    {
      "id": 121,
      "start": 511.3599853515625,
      "end": 516.47998046875,
      "text": " where we say, as Paul said, I have learned in what sort of state I am there with to"
    },
    {
      "id": 122,
      "start": 516.47998046875,
      "end": 517.47998046875,
      "text": " be content?"
    },
    {
      "id": 123,
      "start": 517.47998046875,
      "end": 524.0,
      "text": " I would say this, Paul learned this lesson, I believe, in the classroom of want."
    },
    {
      "id": 124,
      "start": 524.0,
      "end": 526.4000244140625,
      "text": " He learned this lesson in the classroom of want."
    },
    {
      "id": 125,
      "start": 526.4000244140625,
      "end": 530.760009765625,
      "text": " We talked last week about the classroom of loneliness with Joseph and the great lessons"
    },
    {
      "id": 126,
      "start": 530.760009765625,
      "end": 535.239990234375,
      "text": " that he learned in the classroom of loneliness, and we find this evening that Paul says not"
    },
    {
      "id": 127,
      "start": 535.239990234375,
      "end": 538.97998046875,
      "text": " that I speak in respect of want, for I have learned in what sort of state I am there with"
    },
    {
      "id": 128,
      "start": 538.97998046875,
      "end": 540.2000122070312,
      "text": " to be content."
    },
    {
      "id": 129,
      "start": 540.2000122070312,
      "end": 545.6799926757812,
      "text": " Notice what he says in verse number 12, I know both how to be abased and I know how"
    },
    {
      "id": 130,
      "start": 545.6799926757812,
      "end": 546.6799926757812,
      "text": " to abound."
    },
    {
      "id": 131,
      "start": 546.6799926757812,
      "end": 552.97998046875,
      "text": " Everywhere and in all things I am instructed both to be full and to be hungry, both to"
    },
    {
      "id": 132,
      "start": 552.97998046875,
      "end": 555.3599853515625,
      "text": " abound and to suffer need."
    },
    {
      "id": 133,
      "start": 555.3599853515625,
      "end": 560.0399780273438,
      "text": " I believe that it's in this classroom of want that God often will teach us the subject of"
    },
    {
      "id": 134,
      "start": 560.0399780273438,
      "end": 566.239990234375,
      "text": " contentment and understanding that He gives us that which we need."
    },
    {
      "id": 135,
      "start": 566.239990234375,
      "end": 572.0800170898438,
      "text": " See there's this inappropriate perspective that is so common in our society today, and"
    },
    {
      "id": 136,
      "start": 572.0800170898438,
      "end": 577.0,
      "text": " it's not just common amongst Bible believers, I believe that it's common amongst generally"
    },
    {
      "id": 137,
      "start": 577.0,
      "end": 584.4400024414062,
      "text": " within society, and that is this, if we have plenty, then we're having God's favor, God's"
    },
    {
      "id": 138,
      "start": 584.4400024414062,
      "end": 585.760009765625,
      "text": " pleased with us."
    },
    {
      "id": 139,
      "start": 585.760009765625,
      "end": 586.760009765625,
      "text": " Why?"
    },
    {
      "id": 140,
      "start": 586.760009765625,
      "end": 590.8599853515625,
      "text": " Because we're abounding, we have plenty."
    },
    {
      "id": 141,
      "start": 590.8599853515625,
      "end": 594.3200073242188,
      "text": " And if we lack, well then that's God's judgment."
    },
    {
      "id": 142,
      "start": 594.4000244140625,
      "end": 598.4400024414062,
      "text": " But, you know, that's not true biblically."
    },
    {
      "id": 143,
      "start": 598.4400024414062,
      "end": 604.9600219726562,
      "text": " Biblically, we understand that there are times in which, if you think about the church of"
    },
    {
      "id": 144,
      "start": 604.9600219726562,
      "end": 610.52001953125,
      "text": " the Laodiceans, when they're increased with goods and have need of nothing, that's what"
    },
    {
      "id": 145,
      "start": 610.52001953125,
      "end": 612.239990234375,
      "text": " they're indicted for, right?"
    },
    {
      "id": 146,
      "start": 612.239990234375,
      "end": 615.9199829101562,
      "text": " Because they're in a place where they think, I don't need anything, not even God really"
    },
    {
      "id": 147,
      "start": 615.9199829101562,
      "end": 619.6799926757812,
      "text": " is what's being referred to there in Revelation chapter number 3."
    },
    {
      "id": 148,
      "start": 619.6799926757812,
      "end": 624.8800048828125,
      "text": " And we think about this perspective that is skewed by the world in which we live, and"
    },
    {
      "id": 149,
      "start": 624.8800048828125,
      "end": 630.0800170898438,
      "text": " we must understand biblically that the reality is that, look, the children of Israel, when"
    },
    {
      "id": 150,
      "start": 630.0800170898438,
      "end": 635.8800048828125,
      "text": " Jeremiah is prophesying to Judah, and Jeremiah, the captivity takes place, and these guys"
    },
    {
      "id": 151,
      "start": 635.8800048828125,
      "end": 640.4400024414062,
      "text": " say go pray for us, and whatever God says we're going to do, and then Jeremiah comes"
    },
    {
      "id": 152,
      "start": 640.4400024414062,
      "end": 642.6799926757812,
      "text": " and gives them the message, and they say no, we're not going to do that because you're"
    },
    {
      "id": 153,
      "start": 642.6799926757812,
      "end": 648.1599731445312,
      "text": " lying to us, and then they have this perspective, when we were offering to the queen of heaven,"
    },
    {
      "id": 154,
      "start": 648.1599731445312,
      "end": 652.5999755859375,
      "text": " we had all of these things, we weren't suffering, we weren't having this trouble, and so here's"
    },
    {
      "id": 155,
      "start": 652.5999755859375,
      "end": 655.9600219726562,
      "text": " what we're going to do, we're going to go back to doing that."
    },
    {
      "id": 156,
      "start": 655.9600219726562,
      "end": 660.0,
      "text": " Terrible perspective, terrible perspective."
    },
    {
      "id": 157,
      "start": 660.0,
      "end": 666.0599975585938,
      "text": " And this evening, if I'm going to learn to be content, oftentimes, not always, but oftentimes"
    },
    {
      "id": 158,
      "start": 666.0599975585938,
      "end": 671.9600219726562,
      "text": " God will use that classroom of want, but I would say this, what really helps us to learn"
    },
    {
      "id": 159,
      "start": 671.9600219726562,
      "end": 679.6799926757812,
      "text": " this contentment into being content is having a proper view of God."
    },
    {
      "id": 160,
      "start": 679.6799926757812,
      "end": 684.5599975585938,
      "text": " Because the reality is that in verse number 11, Paul says in the middle of what I've used"
    },
    {
      "id": 161,
      "start": 684.5599975585938,
      "end": 689.6400146484375,
      "text": " as the title this evening, I have learned to be content, he says this, in whatsoever"
    },
    {
      "id": 162,
      "start": 689.6400146484375,
      "end": 692.9600219726562,
      "text": " state I am."
    },
    {
      "id": 163,
      "start": 692.9600219726562,
      "end": 694.5999755859375,
      "text": " In whatsoever state I am."
    },
    {
      "id": 164,
      "start": 694.5999755859375,
      "end": 699.719970703125,
      "text": " So when I have a proper view of God, when I understand that present condition, remember"
    },
    {
      "id": 165,
      "start": 699.719970703125,
      "end": 704.1599731445312,
      "text": " that was part of that definition that I shared of what it means to be content in the present"
    },
    {
      "id": 166,
      "start": 704.1599731445312,
      "end": 709.6799926757812,
      "text": " condition, it's not being content in what we think will make us content, it's being"
    },
    {
      "id": 167,
      "start": 709.6799926757812,
      "end": 715.280029296875,
      "text": " content in contentment, true contentment is in whatever our present condition is, in that"
    },
    {
      "id": 168,
      "start": 715.280029296875,
      "end": 717.52001953125,
      "text": " whatsoever state I am."
    },
    {
      "id": 169,
      "start": 717.52001953125,
      "end": 722.0399780273438,
      "text": " And we find that he says I know how to be abased, I know how to abound, but the reality"
    },
    {
      "id": 170,
      "start": 722.0399780273438,
      "end": 726.760009765625,
      "text": " is that if I understand this evening, and I have a proper view of God, and I understand"
    },
    {
      "id": 171,
      "start": 726.760009765625,
      "end": 734.760009765625,
      "text": " tonight that God is in control, that God is sovereign, we believe that biblically,"
    },
    {
      "id": 172,
      "start": 734.760009765625,
      "end": 740.8400268554688,
      "text": " the Bible clearly communicates to us as the people of God that he is sovereign, that he"
    },
    {
      "id": 173,
      "start": 740.8400268554688,
      "end": 744.6799926757812,
      "text": " rules in the affairs of mankind."
    },
    {
      "id": 174,
      "start": 744.6799926757812,
      "end": 749.4000244140625,
      "text": " And when we understand that this evening, when we have that proper view of God, when"
    },
    {
      "id": 175,
      "start": 749.4000244140625,
      "end": 755.1199951171875,
      "text": " we see him as Isaiah saw him, high, holy, and lifted up, and we see him sitting upon"
    },
    {
      "id": 176,
      "start": 755.1199951171875,
      "end": 761.52001953125,
      "text": " his throne, and we understand that he's in control, then, since God, because we understand"
    },
    {
      "id": 177,
      "start": 761.52001953125,
      "end": 767.6400146484375,
      "text": " that God is in control, then we also must understand that he has allowed whatever state"
    },
    {
      "id": 178,
      "start": 767.6400146484375,
      "end": 771.6400146484375,
      "text": " I'm in, and he's allowed it for his purpose."
    },
    {
      "id": 179,
      "start": 771.6400146484375,
      "end": 773.9600219726562,
      "text": " He's allowed it for his glory."
    },
    {
      "id": 180,
      "start": 773.9600219726562,
      "end": 779.9600219726562,
      "text": " And so Paul is sitting in a Roman prison, he's writing to the church in Philippi, and"
    },
    {
      "id": 181,
      "start": 779.9600219726562,
      "end": 784.52001953125,
      "text": " he's writing to them about rejoicing, about being joyful, but he's also writing to them"
    },
    {
      "id": 182,
      "start": 784.52001953125,
      "end": 790.0800170898438,
      "text": " about being content, and he's saying, I have learned in what sort of state I am therewith"
    },
    {
      "id": 183,
      "start": 790.0800170898438,
      "end": 791.7999877929688,
      "text": " to be content."
    },
    {
      "id": 184,
      "start": 791.7999877929688,
      "end": 795.280029296875,
      "text": " Sitting in a Roman prison, Paul was content."
    },
    {
      "id": 185,
      "start": 795.280029296875,
      "end": 797.6799926757812,
      "text": " Paul was content."
    },
    {
      "id": 186,
      "start": 797.6799926757812,
      "end": 799.9199829101562,
      "text": " You say, I don't get it."
    },
    {
      "id": 187,
      "start": 799.9199829101562,
      "end": 801.1599731445312,
      "text": " How?"
    },
    {
      "id": 188,
      "start": 801.1599731445312,
      "end": 804.0,
      "text": " How could you be content in that situation?"
    },
    {
      "id": 189,
      "start": 804.0,
      "end": 806.9199829101562,
      "text": " Because he knew God was in control."
    },
    {
      "id": 190,
      "start": 806.9199829101562,
      "end": 811.8400268554688,
      "text": " He knew that his life was in God's hands."
    },
    {
      "id": 191,
      "start": 811.8400268554688,
      "end": 816.760009765625,
      "text": " And when we understand this evening, we sing songs about the fact that I am his, and I"
    },
    {
      "id": 192,
      "start": 816.760009765625,
      "end": 820.1199951171875,
      "text": " belong to him, and here, Lord, here's my life."
    },
    {
      "id": 193,
      "start": 820.1199951171875,
      "end": 827.02001953125,
      "text": " I give you control, and take my life, and let it be, and we sing songs such as that,"
    },
    {
      "id": 194,
      "start": 827.02001953125,
      "end": 835.47998046875,
      "text": " but the reality is that as we surrender to God, we sing, I surrender all."
    },
    {
      "id": 195,
      "start": 835.47998046875,
      "end": 840.2000122070312,
      "text": " Sometimes when we think about all those songs, we say, I'm in God's hands, and God has a"
    },
    {
      "id": 196,
      "start": 840.2000122070312,
      "end": 848.719970703125,
      "text": " perfect plan and a perfect purpose for everything that he allows, and so therefore, I can be"
    },
    {
      "id": 197,
      "start": 848.719970703125,
      "end": 853.8400268554688,
      "text": " content because I know that God's in control, and I know that he has a purpose."
    },
    {
      "id": 198,
      "start": 853.8400268554688,
      "end": 854.8400268554688,
      "text": " Think about this."
    },
    {
      "id": 199,
      "start": 854.8400268554688,
      "end": 859.7999877929688,
      "text": " We're going to work backwards and make our way to Philippians 1, but look in Philippians"
    },
    {
      "id": 200,
      "start": 859.7999877929688,
      "end": 860.7999877929688,
      "text": " 4."
    },
    {
      "id": 201,
      "start": 860.7999877929688,
      "end": 865.0800170898438,
      "text": " We're in verses 10 through 12, but look back in verse number 4, a verse that many of us"
    },
    {
      "id": 202,
      "start": 865.0800170898438,
      "end": 866.0800170898438,
      "text": " have memorized."
    },
    {
      "id": 203,
      "start": 866.0800170898438,
      "end": 875.2000122070312,
      "text": " Rejoice in the Lord always, and again, I say rejoice."
    },
    {
      "id": 204,
      "start": 875.2000122070312,
      "end": 879.260009765625,
      "text": " Now, how can I rejoice in the Lord always?"
    },
    {
      "id": 205,
      "start": 879.260009765625,
      "end": 884.9600219726562,
      "text": " Because he's always good, because he's sovereign, because he's God, because he has a plan, because"
    },
    {
      "id": 206,
      "start": 884.9600219726562,
      "end": 891.9000244140625,
      "text": " he has a purpose, and as I'm rejoicing, that is evidence of that contentment, right?"
    },
    {
      "id": 207,
      "start": 891.9000244140625,
      "end": 897.9400024414062,
      "text": " Because remember, I mentioned in that definition that content, to be content, is that satisfaction"
    },
    {
      "id": 208,
      "start": 897.9400024414062,
      "end": 901.780029296875,
      "text": " which holds the mind in peace, restraining complaint."
    },
    {
      "id": 209,
      "start": 901.780029296875,
      "end": 906.5,
      "text": " So instead of me complaining about my circumstances, instead of me complaining about my lot in"
    },
    {
      "id": 210,
      "start": 906.5,
      "end": 912.4199829101562,
      "text": " life, I'm understanding that God's in control, I've learned to be content, and I'm rejoicing."
    },
    {
      "id": 211,
      "start": 912.4199829101562,
      "end": 913.5,
      "text": " Why?"
    },
    {
      "id": 212,
      "start": 913.5,
      "end": 914.5,
      "text": " Because God has a plan."
    },
    {
      "id": 213,
      "start": 914.5,
      "end": 919.8599853515625,
      "text": " I was talking to one of our missionaries on Monday afternoon."
    },
    {
      "id": 214,
      "start": 920.8599853515625,
      "end": 924.4199829101562,
      "text": " Actually, it was early evening when I was speaking to him, and it was actually Lacy"
    },
    {
      "id": 215,
      "start": 924.4199829101562,
      "end": 928.7000122070312,
      "text": " Wheeler down in Mexico, and I had mentioned a few weeks ago about him sending me a video"
    },
    {
      "id": 216,
      "start": 928.7000122070312,
      "end": 933.6199951171875,
      "text": " of them getting some scriptures down into Honduras and the vehicle breaking down and"
    },
    {
      "id": 217,
      "start": 933.6199951171875,
      "end": 937.6199951171875,
      "text": " them having to be towed and just all the situation with that."
    },
    {
      "id": 218,
      "start": 937.6199951171875,
      "end": 940.9400024414062,
      "text": " And we were rehearsing and talking about that because we were talking about getting scriptures"
    },
    {
      "id": 219,
      "start": 940.9400024414062,
      "end": 945.4199829101562,
      "text": " in Guatemala and some of the difficulties that they had, and they were aiming to go"
    },
    {
      "id": 220,
      "start": 945.4199829101562,
      "end": 948.5599975585938,
      "text": " there and ended up in Honduras because of some border issues."
    },
    {
      "id": 221,
      "start": 948.5599975585938,
      "end": 952.8800048828125,
      "text": " But the reality is that when they're in Honduras, man, the vehicle that's got all the scriptures"
    },
    {
      "id": 222,
      "start": 952.8800048828125,
      "end": 953.8800048828125,
      "text": " in it, it breaks down."
    },
    {
      "id": 223,
      "start": 953.8800048828125,
      "end": 961.9199829101562,
      "text": " And you can get all kinds of bothered and sideways and upset, but because it broke down"
    },
    {
      "id": 224,
      "start": 961.9199829101562,
      "end": 964.3200073242188,
      "text": " where it did, they had more opportunities."
    },
    {
      "id": 225,
      "start": 964.3200073242188,
      "end": 968.0800170898438,
      "text": " You mean to tell me that God isn't in control?"
    },
    {
      "id": 226,
      "start": 968.0800170898438,
      "end": 970.0,
      "text": " He could keep that vehicle running."
    },
    {
      "id": 227,
      "start": 970.0,
      "end": 971.5599975585938,
      "text": " He could allow that vehicle."
    },
    {
      "id": 228,
      "start": 971.5599975585938,
      "end": 974.4000244140625,
      "text": " We in our minds, we could say, well, there's a better place where I could have broken down."
    },
    {
      "id": 229,
      "start": 974.4000244140625,
      "end": 978.4400024414062,
      "text": " God says, no, no, I allowed you to break down exactly where I allowed you to break down."
    },
    {
      "id": 230,
      "start": 978.52001953125,
      "end": 979.52001953125,
      "text": " Why?"
    },
    {
      "id": 231,
      "start": 979.52001953125,
      "end": 980.52001953125,
      "text": " Because I have a purpose."
    },
    {
      "id": 232,
      "start": 980.52001953125,
      "end": 981.9600219726562,
      "text": " I have a plan."
    },
    {
      "id": 233,
      "start": 981.9600219726562,
      "end": 986.7999877929688,
      "text": " And there were contacts that were made in that particular village and then in the adjacent"
    },
    {
      "id": 234,
      "start": 986.7999877929688,
      "end": 992.5999755859375,
      "text": " city that never would have been made had they not broken down where they did."
    },
    {
      "id": 235,
      "start": 992.5999755859375,
      "end": 994.52001953125,
      "text": " So we learn to be content."
    },
    {
      "id": 236,
      "start": 994.52001953125,
      "end": 996.9600219726562,
      "text": " I am learning to be content."
    },
    {
      "id": 237,
      "start": 996.9600219726562,
      "end": 998.6400146484375,
      "text": " Rejoice in the Lord always."
    },
    {
      "id": 238,
      "start": 998.6400146484375,
      "end": 1000.1599731445312,
      "text": " And again, I say rejoice."
    },
    {
      "id": 239,
      "start": 1000.1599731445312,
      "end": 1003.8800048828125,
      "text": " We looked at this verse on Sunday morning, but turn back, if you will, to chapter number"
    },
    {
      "id": 240,
      "start": 1003.8800048828125,
      "end": 1006.4400024414062,
      "text": " two and look at verse number 14."
    },
    {
      "id": 241,
      "start": 1006.4400024414062,
      "end": 1011.1599731445312,
      "text": " We kind of finished with this verse on Sunday, but here in Philippians 2 and verse 14, do"
    },
    {
      "id": 242,
      "start": 1011.1599731445312,
      "end": 1014.5599975585938,
      "text": " all things without murmurings and disputings."
    },
    {
      "id": 243,
      "start": 1014.5599975585938,
      "end": 1020.5999755859375,
      "text": " Again, we see all things, not some things, not the things that we enjoy, not the things"
    },
    {
      "id": 244,
      "start": 1020.5999755859375,
      "end": 1024.3199462890625,
      "text": " that we want to do, but do all things without murmurings and disputings."
    },
    {
      "id": 245,
      "start": 1024.3199462890625,
      "end": 1026.9599609375,
      "text": " And we understand that God gives us the ability to do that."
    },
    {
      "id": 246,
      "start": 1026.9599609375,
      "end": 1031.43994140625,
      "text": " And I'll turn back to chapter one and look at verse number 12."
    },
    {
      "id": 247,
      "start": 1031.43994140625,
      "end": 1033.3199462890625,
      "text": " I often reference this verse of Scripture."
    },
    {
      "id": 248,
      "start": 1033.6800537109375,
      "end": 1038.800048828125,
      "text": " I'll be honest with you, it's one of the verses of Scripture that has had a profound impact"
    },
    {
      "id": 249,
      "start": 1038.800048828125,
      "end": 1039.800048828125,
      "text": " in my life."
    },
    {
      "id": 250,
      "start": 1039.800048828125,
      "end": 1041.4000244140625,
      "text": " And I'm thankful for God's Word."
    },
    {
      "id": 251,
      "start": 1041.4000244140625,
      "end": 1045.760009765625,
      "text": " There's so many verses of Scripture that I could go to and I could say, God used these"
    },
    {
      "id": 252,
      "start": 1045.760009765625,
      "end": 1048.9200439453125,
      "text": " verses in such a profound way in my life."
    },
    {
      "id": 253,
      "start": 1048.9200439453125,
      "end": 1050.0,
      "text": " And this is one of them."
    },
    {
      "id": 254,
      "start": 1050.0,
      "end": 1056.0799560546875,
      "text": " This is definitely in the top, I'll say, 25 verses that I would run to and say, God used"
    },
    {
      "id": 255,
      "start": 1056.0799560546875,
      "end": 1057.6800537109375,
      "text": " this verse in my life."
    },
    {
      "id": 256,
      "start": 1057.6800537109375,
      "end": 1060.4000244140625,
      "text": " And notice what Paul says to these believers in Philippi."
    },
    {
      "id": 257,
      "start": 1060.4000244140625,
      "end": 1065.760009765625,
      "text": " He says, but I would, ye should understand, brethren, that the things which have happened"
    },
    {
      "id": 258,
      "start": 1065.760009765625,
      "end": 1071.239990234375,
      "text": " unto me have fallen out rather under the furtherance of the gospel."
    },
    {
      "id": 259,
      "start": 1071.239990234375,
      "end": 1076.199951171875,
      "text": " Now those things that happened unto Paul, he says that he wanted these believers in"
    },
    {
      "id": 260,
      "start": 1076.199951171875,
      "end": 1078.0,
      "text": " Philippi to understand this."
    },
    {
      "id": 261,
      "start": 1078.0,
      "end": 1080.52001953125,
      "text": " He wanted them to have a knowledge of this."
    },
    {
      "id": 262,
      "start": 1080.52001953125,
      "end": 1086.0799560546875,
      "text": " He goes right into the next verse and speaks about the bonds that he has in Christ."
    },
    {
      "id": 263,
      "start": 1086.0799560546875,
      "end": 1090.1199951171875,
      "text": " And when you begin to understand, listen, for Paul, the things that happened to him"
    },
    {
      "id": 264,
      "start": 1090.1199951171875,
      "end": 1094.3199462890625,
      "text": " are different than the things that happened to you, than the things that happened to me."
    },
    {
      "id": 265,
      "start": 1094.3199462890625,
      "end": 1099.0400390625,
      "text": " But the reality is that we all have things that happen in our life."
    },
    {
      "id": 266,
      "start": 1099.0400390625,
      "end": 1105.3800048828125,
      "text": " And when we understand that those things that happen in our lives are ordained by God who"
    },
    {
      "id": 267,
      "start": 1105.3800048828125,
      "end": 1111.9599609375,
      "text": " is sovereign and who is in control, and we understand that he has a greater purpose and"
    },
    {
      "id": 268,
      "start": 1111.9599609375,
      "end": 1116.8399658203125,
      "text": " why he's allowed those things, I can be content."
    },
    {
      "id": 269,
      "start": 1116.8399658203125,
      "end": 1121.0400390625,
      "text": " I can rest and rejoice."
    },
    {
      "id": 270,
      "start": 1121.0400390625,
      "end": 1122.3199462890625,
      "text": " Why?"
    },
    {
      "id": 271,
      "start": 1122.3199462890625,
      "end": 1126.47998046875,
      "text": " Because my God's in control and he makes no mistakes."
    },
    {
      "id": 272,
      "start": 1126.47998046875,
      "end": 1129.239990234375,
      "text": " You believe this evening that he doeth all things well?"
    },
    {
      "id": 273,
      "start": 1129.239990234375,
      "end": 1130.239990234375,
      "text": " I do."
    },
    {
      "id": 274,
      "start": 1130.239990234375,
      "end": 1131.239990234375,
      "text": " I believe that."
    },
    {
      "id": 275,
      "start": 1131.239990234375,
      "end": 1132.239990234375,
      "text": " He doeth all things well."
    },
    {
      "id": 276,
      "start": 1132.239990234375,
      "end": 1134.5999755859375,
      "text": " He makes no mistakes."
    },
    {
      "id": 277,
      "start": 1134.5999755859375,
      "end": 1138.6800537109375,
      "text": " In this evening, as we think about this truth of how do we learn contentment, there are"
    },
    {
      "id": 278,
      "start": 1138.6800537109375,
      "end": 1141.9200439453125,
      "text": " times in which God will use the classroom of want."
    },
    {
      "id": 279,
      "start": 1141.9200439453125,
      "end": 1148.0400390625,
      "text": " It is absolutely essential that we have that proper view of who God is and that we just"
    },
    {
      "id": 280,
      "start": 1148.0400390625,
      "end": 1154.43994140625,
      "text": " remove ourselves from that inappropriate perspective that is so common in our society today that"
    },
    {
      "id": 281,
      "start": 1154.43994140625,
      "end": 1159.0,
      "text": " plenty equals God's favor and lack equals God's judgment, but that we would learn that"
    },
    {
      "id": 282,
      "start": 1159.0,
      "end": 1167.47998046875,
      "text": " God is in control and God has a plan and God reigns supreme, and I can be content in whatsoever"
    },
    {
      "id": 283,
      "start": 1167.47998046875,
      "end": 1168.47998046875,
      "text": " state I am."
    },
    {
      "id": 284,
      "start": 1168.47998046875,
      "end": 1172.1199951171875,
      "text": " Turn over to the book of Hebrews, if you will, in chapter 13."
    },
    {
      "id": 285,
      "start": 1172.1199951171875,
      "end": 1175.52001953125,
      "text": " Look at two verses as we close this evening, one here from the New Testament, one from"
    },
    {
      "id": 286,
      "start": 1175.52001953125,
      "end": 1176.52001953125,
      "text": " the Old."
    },
    {
      "id": 287,
      "start": 1176.52001953125,
      "end": 1185.47998046875,
      "text": " In Hebrews 13 and verse number 5, the Bible says this, Hebrews 13 and verse number 5,"
    },
    {
      "id": 288,
      "start": 1185.47998046875,
      "end": 1195.52001953125,
      "text": " let your conversation be without covetousness and be content with such things as ye have,"
    },
    {
      "id": 289,
      "start": 1195.52001953125,
      "end": 1202.239990234375,
      "text": " for he hath said, I will never leave thee nor forsake thee, so that we may boldly say,"
    },
    {
      "id": 290,
      "start": 1202.239990234375,
      "end": 1207.43994140625,
      "text": " the Lord is my helper and I will not fear what man shall do unto me."
    },
    {
      "id": 291,
      "start": 1207.43994140625,
      "end": 1211.5999755859375,
      "text": " You know, we have so many things that money cannot buy."
    },
    {
      "id": 292,
      "start": 1211.5999755859375,
      "end": 1217.4000244140625,
      "text": " So many people today are looking to be content in the things that they can buy and how they"
    },
    {
      "id": 293,
      "start": 1217.4000244140625,
      "end": 1222.9200439453125,
      "text": " can have more and how that's going to bring them a level of contentment, but here the"
    },
    {
      "id": 294,
      "start": 1222.9200439453125,
      "end": 1229.199951171875,
      "text": " Bible says that we're to let your conversation be without covetousness and be content with"
    },
    {
      "id": 295,
      "start": 1229.199951171875,
      "end": 1234.8399658203125,
      "text": " such things as you have, and then he reminds us of the promise of God's presence, that"
    },
    {
      "id": 296,
      "start": 1234.8399658203125,
      "end": 1237.52001953125,
      "text": " he said, I will never leave thee nor forsake thee."
    },
    {
      "id": 297,
      "start": 1237.52001953125,
      "end": 1242.5999755859375,
      "text": " He reminds us that that means that we can boldly say, the Lord is my helper."
    },
    {
      "id": 298,
      "start": 1242.5999755859375,
      "end": 1245.8399658203125,
      "text": " Aren't you thankful for that?"
    },
    {
      "id": 299,
      "start": 1245.8399658203125,
      "end": 1249.43994140625,
      "text": " He says, and I will not fear what man shall do unto me."
    },
    {
      "id": 300,
      "start": 1249.43994140625,
      "end": 1254.0,
      "text": " In closing this evening, we see it here in verse number 5 when he speaks about covetousness"
    },
    {
      "id": 301,
      "start": 1254.0,
      "end": 1255.0,
      "text": " and contentment."
    },
    {
      "id": 302,
      "start": 1255.0,
      "end": 1257.0,
      "text": " Turn to the book of Jeremiah, if you will."
    },
    {
      "id": 303,
      "start": 1257.0,
      "end": 1260.3599853515625,
      "text": " Let me just give you a warning as we close this evening."
    },
    {
      "id": 304,
      "start": 1260.3599853515625,
      "end": 1263.56005859375,
      "text": " Beware of the enemy of contentment."
    },
    {
      "id": 305,
      "start": 1263.56005859375,
      "end": 1264.9599609375,
      "text": " You know what the enemy is of contentment?"
    },
    {
      "id": 306,
      "start": 1264.9599609375,
      "end": 1267.1600341796875,
      "text": " It's covetousness."
    },
    {
      "id": 307,
      "start": 1267.1600341796875,
      "end": 1273.1199951171875,
      "text": " And we see in Jeremiah chapter 6, very quickly, I want you to see what the Bible says about"
    },
    {
      "id": 308,
      "start": 1273.1199951171875,
      "end": 1275.6800537109375,
      "text": " this thing of covetousness."
    },
    {
      "id": 309,
      "start": 1275.6800537109375,
      "end": 1282.800048828125,
      "text": " No doubt we see this in our society today, and it's the enemy of contentment."
    },
    {
      "id": 310,
      "start": 1282.800048828125,
      "end": 1289.8800048828125,
      "text": " And if I'm seeking to learn to be content, if I'm desiring to learn what Paul learned,"
    },
    {
      "id": 311,
      "start": 1289.8800048828125,
      "end": 1295.3199462890625,
      "text": " what he references here in the book of Philippians, then I must be aware of what the enemy of"
    },
    {
      "id": 312,
      "start": 1295.3199462890625,
      "end": 1296.6400146484375,
      "text": " contentment is."
    },
    {
      "id": 313,
      "start": 1296.6400146484375,
      "end": 1304.3599853515625,
      "text": " Listen, we live in a society that bombards us with advertisements, the marketing industry"
    },
    {
      "id": 314,
      "start": 1304.52001953125,
      "end": 1308.239990234375,
      "text": " on telling you what you need and why you need it, right?"
    },
    {
      "id": 315,
      "start": 1308.239990234375,
      "end": 1309.239990234375,
      "text": " Don't we?"
    },
    {
      "id": 316,
      "start": 1309.239990234375,
      "end": 1313.280029296875,
      "text": " I mean, there are things that you purchase that you never even thought you needed, but"
    },
    {
      "id": 317,
      "start": 1313.280029296875,
      "end": 1317.43994140625,
      "text": " you saw some kind of something and it's like, man, I guess I do need that."
    },
    {
      "id": 318,
      "start": 1317.43994140625,
      "end": 1319.239990234375,
      "text": " I've never been able to operate without that."
    },
    {
      "id": 319,
      "start": 1319.239990234375,
      "end": 1321.47998046875,
      "text": " I mean, isn't that amazing?"
    },
    {
      "id": 320,
      "start": 1321.47998046875,
      "end": 1326.199951171875,
      "text": " And that's what the marketing industry, that's what they do, that's why they exist."
    },
    {
      "id": 321,
      "start": 1326.199951171875,
      "end": 1329.8399658203125,
      "text": " Look at Jeremiah 6 and verse 13."
    },
    {
      "id": 322,
      "start": 1329.8399658203125,
      "end": 1338.3599853515625,
      "text": " For from the least of them, even unto the greatest of them, every one is given to covetousness."
    },
    {
      "id": 323,
      "start": 1338.3599853515625,
      "end": 1343.5999755859375,
      "text": " And from the prophet, even unto the priest, every one dealeth falsely."
    },
    {
      "id": 324,
      "start": 1343.5999755859375,
      "end": 1349.3199462890625,
      "text": " That is a sad indictment on the children of Israel, is it not?"
    },
    {
      "id": 325,
      "start": 1349.3199462890625,
      "end": 1353.0400390625,
      "text": " Judah, terrible indictment."
    },
    {
      "id": 326,
      "start": 1353.0400390625,
      "end": 1357.1600341796875,
      "text": " Every one of them, from the least, even to the greatest, every one of them is given to"
    },
    {
      "id": 327,
      "start": 1357.1600341796875,
      "end": 1361.239990234375,
      "text": " covetousness, and every one of them, from the prophet, even unto the priest, dealeth"
    },
    {
      "id": 328,
      "start": 1361.239990234375,
      "end": 1363.9599609375,
      "text": " falsely."
    },
    {
      "id": 329,
      "start": 1363.9599609375,
      "end": 1369.0,
      "text": " This morning, this evening, whatever it is, this evening, our society is geared to cause"
    },
    {
      "id": 330,
      "start": 1369.0,
      "end": 1370.9599609375,
      "text": " us to be covetous."
    },
    {
      "id": 331,
      "start": 1370.9599609375,
      "end": 1378.43994140625,
      "text": " But as we look in the Word of God, we're to be content."
    },
    {
      "id": 332,
      "start": 1378.43994140625,
      "end": 1382.1600341796875,
      "text": " And Paul says, I have learned."
    },
    {
      "id": 333,
      "start": 1382.1600341796875,
      "end": 1385.3599853515625,
      "text": " I learned a valuable lesson."
    },
    {
      "id": 334,
      "start": 1385.3599853515625,
      "end": 1392.0799560546875,
      "text": " What I learned is in what sort of state I am therewith to be content."
    },
    {
      "id": 335,
      "start": 1392.0799560546875,
      "end": 1397.800048828125,
      "text": " This evening, as I mentioned already, I would simply say I am learning to be content."
    },
    {
      "id": 336,
      "start": 1397.800048828125,
      "end": 1401.6400146484375,
      "text": " But I want to be able to reach that place where I can say, I have learned to be content."
    },
    {
      "id": 337,
      "start": 1401.6400146484375,
      "end": 1402.6400146484375,
      "text": " Amen?"
    },
    {
      "id": 338,
      "start": 1402.6400146484375,
      "end": 1408.800048828125,
      "text": " Because, listen, somebody said this, when God is all you have, you find out for the"
    },
    {
      "id": 339,
      "start": 1408.800048828125,
      "end": 1413.6800537109375,
      "text": " first time in your life that God is all you need."
    },
    {
      "id": 340,
      "start": 1413.6800537109375,
      "end": 1416.1199951171875,
      "text": " He's saying in a little course, He's all I need."
    },
    {
      "id": 341,
      "start": 1416.1199951171875,
      "end": 1417.1199951171875,
      "text": " He really is."
    },
    {
      "id": 342,
      "start": 1417.1199951171875,
      "end": 1420.5999755859375,
      "text": " And He takes such good care of us."
    },
    {
      "id": 343,
      "start": 1420.5999755859375,
      "end": 1426.1199951171875,
      "text": " And oh, that we learn to be content, and it will lead us to a place of rejoice in the"
    },
    {
      "id": 344,
      "start": 1426.1199951171875,
      "end": 1427.1199951171875,
      "text": " Lord always."
    },
    {
      "id": 345,
      "start": 1427.1199951171875,
      "end": 1429.280029296875,
      "text": " And again, I say rejoice."
    },
    {
      "id": 346,
      "start": 1429.280029296875,
      "end": 1430.280029296875,
      "text": " Why?"
    },
    {
      "id": 347,
      "start": 1430.280029296875,
      "end": 1432.719970703125,
      "text": " Because there's no room for complaint."
    },
    {
      "id": 348,
      "start": 1432.719970703125,
      "end": 1436.5999755859375,
      "text": " Complaint has been restrained because I've learned to be content."
    },
    {
      "id": 349,
      "start": 1436.5999755859375,
      "end": 1437.5999755859375,
      "text": " Let's pray."
    },
    {
      "id": 350,
      "start": 1437.5999755859375,
      "end": 1438.780029296875,
      "text": " Father, we love You."
    },
    {
      "id": 351,
      "start": 1438.780029296875,
      "end": 1440.56005859375,
      "text": " We thank You for loving us."
    },
    {
      "id": 352,
      "start": 1440.56005859375,
      "end": 1445.0,
      "text": " I thank You for the testimony of the Apostle Paul here in this passage of Scripture."
    },
    {
      "id": 353,
      "start": 1445.0,
      "end": 1449.0400390625,
      "text": " And God, I pray that You'd help each of us this evening."
    },
    {
      "id": 354,
      "start": 1449.0400390625,
      "end": 1458.800048828125,
      "text": " Lord, I pray that You would help us to evaluate honestly our lives in this area of contentment."
    },
    {
      "id": 355,
      "start": 1458.800048828125,
      "end": 1462.5999755859375,
      "text": " That God, You would help us to be in a place, perhaps there's some that could say with Paul"
    },
    {
      "id": 356,
      "start": 1462.5999755859375,
      "end": 1465.3199462890625,
      "text": " that I have learned to be content."
    },
    {
      "id": 357,
      "start": 1465.3199462890625,
      "end": 1470.47998046875,
      "text": " Perhaps there's others that would say I am learning to be content."
    },
    {
      "id": 358,
      "start": 1470.52001953125,
      "end": 1475.0799560546875,
      "text": " I pray that it'd be each of our desires that, God, You would teach us contentment, that"
    },
    {
      "id": 359,
      "start": 1475.0799560546875,
      "end": 1483.4000244140625,
      "text": " You'd help us, Lord, to see You in Your proper place, Lord, to understand that You're sovereign"
    },
    {
      "id": 360,
      "start": 1483.4000244140625,
      "end": 1484.6400146484375,
      "text": " in control."
    },
    {
      "id": 361,
      "start": 1484.6400146484375,
      "end": 1491.8399658203125,
      "text": " You do all things well, that You make no mistakes, and help us, Lord, to be content."
    },
    {
      "id": 362,
      "start": 1491.8399658203125,
      "end": 1493.0400390625,
      "text": " Thank You for the privilege of prayer."
    },
    {
      "id": 363,
      "start": 1493.0400390625,
      "end": 1496.8399658203125,
      "text": " I pray that You'd bless our time, and we'll thank You for all that You'll do, for it's"
    },
    {
      "id": 364,
      "start": 1496.8399658203125,
      "end": 1497.8399658203125,
      "text": " in Christ's name we pray."
    },
    {
      "id": 365,
      "start": 1497.8399658203125,
      "end": 1498.8399658203125,
      "text": " Amen."
    },
    {
      "id": 366,
      "start": 1498.8399658203125,
      "end": 1500.3399658203125,
      "text": " Does anyone need a bulletin this evening?"
    },
    {
      "id": 367,
      "start": 1500.3399658203125,
      "end": 1501.5,
      "text": " You did not get one when you came in."
    },
    {
      "id": 368,
      "start": 1501.5,
      "end": 1504.0999755859375,
      "text": " You need one?"
    },
    {
      "id": 369,
      "start": 1504.0999755859375,
      "end": 1504.6199951171875,
      "text": " Miss Dionne."
    }
  ],
  "processed_at": "2025-04-16T15:42:17.821159"
}