{
  "video_id": "T5xHSdrZyYk",
  "text": "verses 6 through 13, and of course, as you are aware, if you were here last week, we looked at the first five verses of chapter number 8 last week, and so we'll finish up chapter number 8 this morning and be looking at Hebrews 8, verses 6 through 13. Let me read verses 6 and 7 to you, then we'll get into the message this morning. In Hebrews 8 and verse number 6, the Bible says, But now hath he, speaking of our great high priest, he hath obtained a more excellent ministry by how much also he is the mediator of a better covenant which was established upon better promises. For if that first covenant had been faultless, then should no place have been sought for the second. Notice in verse number 13, the Bible says, In that he saith, A new covenant he hath made the first old, now that which decayeth and waxeth old is ready to vanish away. As we look at this passage of Scripture, I've simply entitled our message this morning, A New Covenant. A New Covenant, and we'll be looking at Hebrews 8, verses 6 through 13. As you know, the book of Hebrews has established that Christ is superior. He's better. He's greater. We know that as we study the first three chapters of the book of Hebrews, that you see immediately that he deals with the fact that Christ is better than the prophets, he's better than the angels, he's better than Moses. We find in chapter number 6 that there's reference there to him being better and superior to Abraham, but we find that in chapters 5 through really chapter number 10, the midst of what we're studying in this section of the book of Hebrews, we find that the Bible has made it clear, abundantly clear, and has provided us with much information to prove the superiority of the priesthood of Christ. Of course, as we look at the contrast between that which these recipients would have been very familiar with, the Aaronic priesthood, or the Levitical priesthood, we find that the author of Hebrews, God, is giving the truth to these believers that we have a great high priest. No, he's not after the order of Aaron, after that Aaronic priesthood. He's after the order of Melchizedek, that Messianic prophecy that we found in the book of Psalms. And we understand that throughout the book of Hebrews, there have been many references to Old Testament prophecy that has found its proper fulfillment here in the book of Hebrews in saying that Jesus is the Messiah. He is the one that has fulfilled these prophecies. Again, this morning as we look at this eighth chapter of the book of Hebrews, we'll find reference to the Old Testament, we'll find that there's reference to the first tabernacle, and of course we understand that even as we studied last week in the first five verses of Hebrews, chapter number eight, that the Scriptures talk to us about the true tabernacle, which the Lord pitched and not man. And we find that as we would look at this new covenant that is being discussed, and we'll look at several aspects of it in verses 6 through 13, but I want to remind you of the first, or the old covenant, of which the recipients would have been very familiar. We won't take time to go back to the book of Exodus, but I just want to share with you kind of an overview of Exodus chapter number 20 through 40. As we look at those 20 chapters that end the book of Exodus, of course if you look at the first several chapters of the book of Exodus, you begin to deal with the call of Moses, the plight of the children of Israel as they're in Egyptian bondage, and the power of God that is revealed through all of the plagues, and of course the last being the death of the firstborn, God's deliverance of his people out of Egypt, the miraculous crossing of the Red Sea. I mean, there are so many powerful, wonderful truths that we find in the book of Exodus, but as we look at chapters 20 through 40, and their really impact that this chapter has on that truth, again, that these believers that are being written to here, that these Jewish believers would have had much knowledge and been very familiar with that portion of Scripture. You understand that it was in Exodus chapters 20 through 23 that we find that Moses would receive the law. In particular, in chapter number 20, we're aware of the 10 commandments that are given there in Exodus chapter number 20, but it's in those three chapters that Moses would receive the law. It was in Exodus chapter number 24 that the law is ratified. It's interesting that in that passage of Scripture, on two occasions, the children of Israel respond to Moses and say, all the words which the Lord hath said will we do. There was a commitment to obedience. We see that in verse number 3, and again in verse number 7, where there, the Bible tells us that he took the book of the covenant and read in the audience of the people, and they said, all that the Lord hath said will we do, and be obedient. That's in Exodus chapter 24. Immediately after that process, we find that Moses goes back to the mount, and it's in Exodus chapters 25 through 31 that God gives Moses the instruction with regard to the tabernacle. All of those details on the construction, all of the materials and the dimensions, and all of the fine details, it's in that passage where God shows him the pattern of the true tabernacle. We understand, as we dealt with last week, how that tabernacle, which would soon become a temple under the reign and rule of Solomon, king of Israel, and of course there was a temple that was still standing here for these Jewish believers in Jerusalem, but we find that all of that was a simple shadow, a picture of that true tabernacle, which is in heaven. And so while Moses was there receiving all of that instruction and all of those details, and God saying, very specifically, do not deviate at all. There was very important that every detail would be followed just as it had been given. And then we come to Exodus chapter number 32, and we find the record of Aaron and the golden calf. They had broken the very law that they had committed to obey. They ratified, we use that word in chapter 24, where they say all that the Lord has said we will do, we're going to be obedient. And as Moses is up on the mountain receiving all that instruction, they say we don't know about this guy Moses, we don't know what he's doing, and we don't know all that's going on, and they make this golden calf. How terrible to see how quickly the people had broken the very law that they committed to obey. And then we find that in chapters 33 and 34, we find that there's repentance and renewal of that really just a commitment to obedience on the part of the children of Israel. In chapters 33 and 34 of the book of Exodus, and then you read of, in chapters 35-39, the instruction of the tabernacle, all those details, Bezalel and others that would be take part in doing the work that God had commanded to be done, and you come to the 40th chapter of the book of Exodus, and it's a culmination of all of those events, and you find that they did exactly as God had commanded, they obeyed the Lord, they followed the instruction, and you read of the rearing up of the tabernacle and the glory of God filling that place. What a blessing. And as we consider those truths from the last part of the book of Exodus and really kind of quickly overview those 20 chapters, we find that there will be reference to those things because the Bible talks about here this new covenant, but he makes reference to the first covenant, and really we would simply refer to that as being the law. And we find that as we look at the passage of scripture that is before us, again, I've titled the message, A Better Covenant, A New Covenant, as we find in verse number 13, a new covenant, we find in verse number 8, where it is a better covenant, and we find that this is a better covenant, excuse me, verse number 6, it says, by how much also he is the mediator of a better covenant. As we look at the passage of scripture, again, we'll make note of some Old Testament prophets in the book of Jeremiah as we go through the passage, and notice if you're taking notes, number one, the superiority of the new covenant. Notice in verse number 6, I read it for you already, but you find that the Bible says, but now hath he obtained a more excellent ministry. Now remember, he's speaking about the fact that we have a high priest. He's been dealing with this subject matter, we really started in chapter number 5, we get into the truth of the order of Melchizedek and the fact that that is fully developed in chapter number 7, and you come here to chapter number 8, and you say, why is it we have this high priest, and as we discussed last week, that he ministers in a better place, and we find that he presented a better offering. What did he do? He offered himself. The sinless, precious blood of God in flesh, the Lord Jesus Christ, and then we come as we find it says, but now, in verse number 6, hath he obtained a more excellent ministry. Notice by how much also he is the mediator of a better covenant, which was established upon better promises. Again, we've mentioned the theme of the book of Hebrews, that Christ is better, he is superior, and we find twice in verse number 6, how that it mentions a better covenant, which was established upon better promises. We find that he says in verse number 7, for if that first covenant had been faultless, then should no place have been sought for the second, but finding fault, notice this phrase, with them. Who's them? The children of Israel, right? We mention how they broke the covenant and we find that he says finding fault with them, he saith, God says, behold… Behold, the days come, saith the Lord, when I will make a new covenant, notice this, with the house of Israel and with the house of Judah, not according to the covenant that I made with their fathers in the day when I took them by the hand to lead them out of the land of Egypt. Now, remember, that's found in the book of Exodus. We just kind of reviewed that very quickly. And then you notice the last phrase in verse number nine, because they, who's they? Again, the children of Israel, they continued not in my covenant, and I regarded them not, saith the Lord. It's interesting as we look at the superiority of this covenant, this new covenant that is mentioned here in the passage of scripture, we would find that really there's two simple reasons that it's a better covenant. Number one, because Jesus is the surety for this covenant. Notice back in chapter number seven, this was given to us in chapter seven and verse number 22 about this better testament. The word testament and covenant can be used interchangeably. You understand here that in verse number 22, it says this, by so much was Jesus made a surety of a better testament, a better covenant. We find that he paid for the sin of mankind with his precious blood, and Jesus is the surety of this covenant. Not only is he the surety of the covenant, but we find in verse number six that he is the mediator of this covenant. Mediator is one who takes two parties that are at variance, and these two parties that are at variance, this mediator were interposed in order to bring reconciliation. You find the work of the mediator, if you understand the Lord Jesus Christ in this particular role, if you will, as mediator, he took man who was at enmity with God. We find that Jesus came and presented himself, and he allowed Jesus through his substitutionary death, burial, and glorious resurrection. We find that he is both the surety and the mediator of this new covenant, which allows what? It allows mankind to be reconciled to God. Without the work of Christ on the cross of Calvary, we do not understand this great truth of reconciliation, because we were at enmity with God. You read Romans chapter number five, and you find here that the superiority of this new covenant that is mentioned in our passage of Scripture, that it's because Jesus is not only the surety, but he's also the mediator. It's important for us to understand that. It was with his precious blood. He did not use anything. We find that Peter mentions that we're not redeemed with silver and gold, but with the precious blood of Christ. What a joy to understand the superiority of this covenant. Notice he says in verse number seven, For if that first covenant had been faultless, then should no place have been sought for the second. What was the problem with the first covenant? It was broken by them. It says there in verse number eight, For finding fault with them, speaking of the children of Israel. You notice that as we look in verse number nine, it says they continued not in my covenant. And it says that he therefore regarded them not, saith the Lord. As we begin to look at the passage of Scripture, we find that God then mentions in verse number eight, and this writer of the book of Hebrews is helping these Jewish believers to understand the promises that had been given in the Old Testament. Again, these Jewish believers would have a certain understanding of these Old Testament truths, and what a blessing to see how the writer of Hebrews, under the inspiration of the Holy Spirit of God, allows for these believers to understand the Old Testament truth and properly apply it to the Lord Jesus Christ. I've heard people say, the Old Testament really isn't important, we live in the New Testament age. Oh, the New Testament contradicts that. Because the New Testament says that it was written for our benefit, for our admonition, for our learning. And so we can't ignore the Old Testament, we find great truth in the Old Testament that helps us understand the fulfillment that we find here in the New Testament. And so we find that he says this in verse number eight. Notice the way in which he's leading into this new covenant, and we'll deal with it in more details in verses 10 through 12, but notice what he says, behold, right in the middle of verse number eight, the days come, saith the Lord. This is referring to an Old Testament prophecy. God is eternal, right? He's Alpha and Omega, the beginning and the end, the first and last. And so he is able to speak about something that's going to come in the future, why? Because he is eternal. And he's able to bring it to pass, why? Because he's eternal. We see the knowledge and wisdom of God, we see the eternality of God here in the passage of Scripture, and he says, behold, the days come, saith the Lord. Notice these phrases, when I will make a new covenant with the house of Israel and with the house of Judah. And so we find that right there in verse number eight, it begins to refer to this Old Testament prophecy with regard to this new covenant, and we'll look at it in Jeremiah here in just a few moments, but it's important that we understand that he says that he's going to make this, it's going to be in days to come, and he will make this new covenant with the house of Israel and with the house of Judah. Of course, during the time of Jeremiah's prophecy, Israel had already been taken captive by the Assyrians. In fact, Judah was on the eve of captivity by the Babylonians. They had already sieged the city. You can find that Jeremiah speaks of that often with regard to the impending judgment and doom of the city of Judah, the nation of Judah being carried away into Babylonian captivity. And so really in focus here is when he talks about the house of Israel and the house of Judah is this one nation of Israel again that God's going to make this promise to, this new covenant to. Now, it's important that we understand there are individuals that have taken and had really, in my opinion, a bad exegetical approach to understanding the Scriptures, and they said, no, this new covenant has nothing to do with Israel. It has everything to do with Israel. They said, no, no, it's about the church, and the church becomes spiritual Israel. As you start to do those kind of things with Scripture, you really kind of get yourself twisted up and get yourself in a mess. No doubt these Jewish believers that are the original recipients of this book of Hebrews, when the writer says the house of Judah and the house of Israel, they would have understood the nation. No doubt in Jeremiah's prophecy, in Jeremiah chapter number 31, that when that prophecy is given with regard to the house of Judah and the house of Israel, it was understood to be Israel. There was no church at that time. Amen? The church was known by God, but it was not known by the prophets. We find that as we look at the passage of Scripture that is before us, and we understand the superiority of the new covenant, then we look at number two, the specifics of the new covenant. We find, first of all, as we've mentioned here in verse number 8, and we'll get into it in verses 10 through 12 as well, I want you to understand, number one, how it relates to Israel. How it relates to Israel. Turn over, if you will, to Jeremiah 31. Keep your place here in Hebrews chapter number 8, but turn to the book of Jeremiah. Let's read this portion of Scripture in Jeremiah chapter number 31 with regard to this prophecy that is being referenced in Hebrews chapter number 8. In Jeremiah chapter number 31, we find that really beginning in verse number 31 down through verse number 34 will be the context in which we read here this morning of some of the promise with regard to this new covenant. Notice in verse number 31 of Jeremiah 31, Behold, the days come, saith the Lord, that I will make a new covenant with the house of Israel and with the house of Judah, not according to the covenant that I made with their fathers in the day that I took them by the hand to bring them out of the land of Egypt, which my covenant they break, although I was a husband unto them, saith the Lord. Verse 33. But this shall be the covenant that I will make with the house of Israel after those days, saith the Lord. Remember that phrase, after those days, we're going to look at something with regard to that in just a moment. After those days, saith the Lord, let's look at what he's going to do. I will put my law in their inward parts and write it in their hearts and will be their God and they shall be my people and they shall teach no more every man his neighbor and every man his brother, saying, Know the Lord, for they shall all know me. From the least of them unto the greatest of them, saith the Lord, for I will forgive their iniquity and I will remember their sin no more. So we're looking here at the specifics of the new covenant and understanding how this relates to Israel as a nation. Really the fullness of this prophecy that is given, the fullness of the blessings of this new covenant, we understand that they'll be fully experienced by Israel during the millennial reign of Christ. That's when the fullness of this new covenant will be experienced by the house of Israel. Notice that there, as I mentioned in verse number 33, when he said, after those days. What's he speaking of? Well, if you go back to chapter number 30 of the book of Jeremiah, notice what is said in verse number 7. In Jeremiah 30 and verse number 7, the Bible says this, Alas, for that day is great so that none is like it. It is even, notice this phrase, the time of Jacob's trial. Trouble, but he shall be saved out of it You know he's talking about talking about the tribulation Seven year period that we refer to as the day of Jacob's trouble. Who's Jacob? What was his name changed to? Israel right is the so we find that as we look here at the passage of Scripture in Jeremiah 30 in View in verse number seven is the tribulation the time of Israel or Jacob's trouble as it's mentioned there Specifically and so we see that that's the period of tribulation and then in Jeremiah chapter number 31 in verses 31 through 34 He begins to talk about this new covenant He gives us the timeline after those days that seven-year tribulation period there will be the millennial reign of Christ and That's when the fullness of this new covenant will be Experienced by the house of Israel now the Bible is awesome. Go over to Romans chapter 11 Because really when we get to see all that's happening here. We begin to now keep your place in Hebrews We're gonna get back there and I promise we're gonna look at the rest of the passage of Scripture But it's important for us to understand the specifics of this new covenant and how it relates to Israel but what happened so that Israel wasn't the Immediate recipient of all of these things they resisted and rejected Messiah Israel as a nation Rejected Messiah. What did they say? We have no king Right. What did they say crucify him, right? So they said they rejected Messiah not every individual Jewish person rejected Messiah But as a nation Corporately or collectively the nation of Israel Rejected their Messiah, by the way, there are still Jewish people that get saved today But they have to be saved the way that we are saved through the gospel of Jesus Christ There are false teachers that would proclaim that just because you're of Jewish descent that you're a child of God And you don't have to worry about it That is a heresy from the pit of hell that will condemn people to eternal damnation Amen the reality is that even to this very day as a Nation the Jewish people reject that Jesus Christ is the Messiah There are individuals that are getting saved today You're seeing you there are Jewish believers and we're thankful for that Remember the gospel is the power of God unto salvation to the Jew first and then also to the Greek right to the Gentile And so as we look in Romans chapter 11, and I hope to package all this together for you this morning It's a whole lot, but I trust we can get through it in verse number 16. We're gonna kind of start there We could look at the entirety of the chapter, but for sake of time Let me jump in in verse number 16 of Romans 11 It says for if the first fruit be holy the lump is also holy and if the root be holy So are the branches and if some of the branches be broken off and thou being a wild olive tree work graft in among them and with them partake gist of the root and fatness of the olive tree Says in verse number 18 boasts not against the branches But if thou boasts thou bearest not the root but the root thee Thou will say then the branches were broken off that I might be graft in you say what in the world is he talking about? He's talking about the house of Israel the Jewish people and the Gentiles We find that the explanation is can I'm looking verse number 20 well because of unbelief they Circle it underline it make sure you understand they were broken off What was he referring to earlier that were broken off the branches? He's using this illustration of this olive tree and he's talking about the branches that are broken off And then he says they the branches were broken off because why because of unbelief Who's they that's the Jewish people Israel as a nation? And so we find that it continues in verse number 20 and it says and thou Standest by faith. So you see there's a contrast between they and thou We then find at the end of verse number 20. It says be not high-minded But fear Verse 21 for if God spared not the natural branches Take heed lest he also spare not thee This is the warning verse 22 behold Therefore the goodness and severity of God on them which fell severity, but toward thee goodness if thou continue in his goodness, otherwise thou also shall be cut off and They also if they abide not still in unbelief shall be graft in for God is able to graft them in again And so again in verse number 23 gives the provision for Jewish people to be saved even during this time that we call the church age And we find here that it continues in verse 24 for if thou were cut out of the olive tree, which is by Wild which is wild by nature and were graft contrary to nature into a good olive tree How much more shall these which be the natural branches be graft into? Their own olive tree it makes sense, right and he's using this he's going through he's given this explanation and then you come to verses 25 and 26 and you see the fullness again of the truth of the millennial reign of Christ and Understanding God's timeline. It says in verse number 25 for I would not brethren that you should be ignorant of this mystery God wants us to be informed. He doesn't want us to be ignorant. He doesn't want us to be in the dark He wants us to understand his plan for the ages and we find that as he's giving this instruction That he mentions right within the text I don't want you to be ignorant of this and we find that as he would speak about the mystery remember the Apostle Paul uses the phraseology of mystery Paul's the human author here of the book of Romans in the book of Ephesians when he talks about the mystery What's he talking about the church? That's gonna be made up of Jew and Gentile right in the church Right, we're the church. What a blessing We find that it says in verse number 25 It says lest he should be wise in your own conceits Notice this that blindness in part is happened to Israel until the fullness of the Gentiles become in Do you remember John 9 the healing of the man that was born blind? There's a great discourse that takes place there in John chapter 9. This man was born blind the disciples immediately say hey Who sinned his parents or him? I mean he was born blind. What's going on? They go through this whole process. The man is healed and he's in just Interrogated by the Jewish leaders of the day as to what happened. How did this happen? He's like look I've told you I've told you and I've told you a man named Jesus. Here's what he did He healed me and you go through the passage and you begin to see how that this man Of course, he's excommunicated because he is gonna be a disciple of Jesus and he says if I tell you again Are you gonna become his disciples and they're full with rage because we are the disciples of Moses, right? I mean, they're not just having it right? They don't want anything to do with it and then Some of the Jewish people say to Jesus are we blind also? The answer was yes Not that you're blind physically, but you're blind spiritually Remember what it says to us in 2nd Corinthians chapter number 4 the God of this world have blinded the minds of them that believe Lest the light of the glorious gospel should shine in unto them, right? The enemy is in the process of Blinding and we find that he does that not just for Jews But for Gentiles alike this this work that he does of blinding But we find here the Bible says that blindness in part is happened to Israel into the fullness of the Gentiles become in So because Israel rejected Messiah The Church Age as we often refer to it as has been Established and here we are in this opportunity to receive the blessing Notice it says into the fullness of the Gentiles become in It talks about the blessing that we receive and what a blessing it is to know the Lord Jesus Christ is our personal Savior And it says in verse number 26 And so all Israel shall be saved as it is written there shall come out a sign to deliver and shall turn away Ungodliness from Jacob for this is my covenant unto them when I shall take away their sins What's the referring to the new covenant? Here's where people get messed up They look at verse number 26 and it says so all Israel shall be saved and they say there you go seals the deal No, no at the time of the Millennium Because here's what's gonna happen if I can just kind of overview it very quickly At some point and I believe soon the trumpet of the Lord is gonna sound and we're gonna be raptured out of here That is the next event on God's prophetic calendar. Amen the snatching away of the Saints the rapture We can read of that in 1st Thessalonians chapter 4 and we can understand the truth that is contained therein With regard to the rapture immediately following the rapture of the church Immediately the timeline starts for the seven-year tribulation You can read of that in Revelation. You can read of all of the Judgments that will be unfolded and just I mean it is gonna be a terrible time upon earth But here's what's happening if I can use this analogy God for this period that we call the church age if we could pretend that there's a stove top here He's taken Israel and he's put him on the back burner and he's dealing with the church right now as the church age But once the rapture takes place, the church is removed, amen, now Israel comes to the front burner, if I can use that analogy. And what's happening is we see in Jeremiah 30, verse number 7, this is the time of Jacob's trouble. That seven year period of time that we refer to as the tribulation, what is God doing? He's dealing with Israel as a nation. And as he's dealing with Israel as a nation, then comes at the end of the tribulation, the return of Christ, the battle of Armageddon, you read of all of those things that take place there throughout the book of Revelation, and then you find the millennial reign of Christ. And it's at that point that we see the fullness of this new covenant. And so it's important that we understand the prophecy in Jeremiah, the truth in Romans chapter 11, as we take and unfold that which is given to us here in Hebrews chapter number 8. Because the reality is that when we speak about this new covenant, and we think about the specifics that it is with regard how it relates to Israel as a nation, is one aspect of what we have to consider. Now go back to Hebrews chapter number 8, we won't go back to the book of Jeremiah, you might want to keep your place there in Romans 11, I may go back in just a moment, it depends on how the time goes. Let me mention here five aspects, if you will, that are given to us with regard to the specifics of this new covenant in verses 10 down through verse number 12. Notice, for this is the covenant that I will make with the house of Israel after those days, saith the Lord. Again, this is a quote from what we see in Jeremiah 31. Notice it says, I will put my laws into their mind and write them in their hearts. So that's the first aspect, specific, if you will, with regard to this new covenant, and opposed to being a table of stone, which would have been the old covenant. And you understand, really, this is through the work of the Holy Spirit. We find that it continues in verse number 10, it says, I will be to them a God, and they shall be to me a people. And we'll look at some of these things here as we get through and begin to see not only how it relates to Israel, but how it relates to us today. Notice in verse number 11, they shall not teach every man his neighbor and every man his brother, saying, Know the Lord, for all shall know me from the least to the greatest. Can I tell you, that's not the case today, right? Do you know that that's not the case today? And so therefore, we understand that this new covenant in its fullness, in its entirety, we're not experiencing this yet. Notice in verse number 12, for I will be merciful to their unrighteousness, and it says this in really the fifth aspect, and their sins and their iniquities will I remember no more. As we begin to think about these aspects and the specifics of this new covenant as it's given here in Hebrews chapter number 8, again, remember, he's writing and he's helping these believers understand that we have a high priest. He ministers in a better place, he has presented a better offering, he offered himself, and then he begins to talk about the fact that he has obtained a more excellent ministry. Why? Because he's the mediator of a better covenant. It begins to unfold this. Now, as we understand how the new covenant relates to Israel, it's also important for us to understand how it relates to individual believers today. Yes, it relates to Israel as a nation, we see it in its fullness as we've gone through great lengths to deal with that this morning, but we must also understand that this new covenant relates to individual believers today. How do we know that? Well, let me mention what Paul says in 2 Corinthians chapter 3 and verse number 6. He says, who also hath made us able ministers of the New Testament, the new covenant. So if God hath made us able ministers of this new covenant, we understand that there are aspects of this new covenant that relate to us today as individual believers. Again, we must understand the church is not spiritual Israel. When you go down that path, you start really messing up all kinds of things, and it becomes very challenging to interpret Scripture properly, and if you understand that Israel is a separate entity in its entirety from the church, and the church now, as we look at the blessings as how this new covenant relates to the individual believers, we can understand the blessings of salvation. Remember in Romans chapter 11, as we looked at the passage of Scripture, it spoke about the fact how we were graft in, and you understand that because of the rejection, because of their unbelief, then we that were wild, that we were from that wild olive tree, that we were graft in, and therefore we get to enjoy the blessings of salvation even today as individual believers. Consider with me the Holy Spirit of God, how He works, and how He has given one of His roles as being the divine teacher. He leads us into all truth. It's one of the responsibilities and roles of the Holy Spirit of God. Consider that there in Hebrews 8, it talks about the fact that I will be to them a God and they shall be to me a people. Aren't you thankful for the truth of John 1 in verse number 12, but as many as received Him to them gave He power to become the sons of God. Aren't you thankful that you can say He is my God? Deborah sang this morning about my shepherd, the Lord is my shepherd. Aren't you thankful this morning that we as Gentiles, that we can understand the blessings of this new covenant by way of salvation, because of what was accomplished at Calvary? Again, the fullness of the new covenant will not be realized until the millennial reign of Christ. By the way, those of us that are saved will rule and reign with Christ during the millennial reign of Christ. We don't have time to get into all that this morning, but it's an amazing truth of the Word of God. And we find here that this new covenant that the writer of Hebrews is dealing with and addressing and giving these details as we begin to interpret Scripture with Scripture, we can rejoice really at this particular time in history. We can rejoice in the plan that God has for the nation of Israel, but we also understand that as individual believers today, we are the recipients of these blessings of the new covenant through Calvary, through what the Lord Jesus Christ accomplished on the cross of Calvary. The Apostle Paul often during his ministry in the book of Acts, you'll find that he preaches and teaches that this Jesus is Christ. They knew who Jesus was as a human figure. They understood, many of them in the book of Acts that Paul would minister to, especially those that were within the synagogues that he would travel and go to those particular regions and he would first go into the synagogue. They would have a knowledge of Jesus, the man that was crucified. But he says this Jesus is the Christ, the Messiah, the Promised One. He is the one that you've been looking for, but you missed it. You rejected him. You find that Paul has a great desire to see his brethren, his kinfolk, his Jewish counterparts to come to the knowledge of salvation through the Lord Jesus Christ. But we understand that Paul is often referred to himself as the Apostle to the Gentiles. So we understand that there, as we look at this passage of Scripture and we can begin to think about the prophecy that was given in Jeremiah chapter number 31, that prophecy still stands true that God is going to make this new covenant in its fullness with the house of Israel and the house of Judah during the time of the millennial reign of Christ. But today, as individual believers, we get to be partakers of these blessings. Why? Because we are grafted in. It's a beautiful picture of what we find here for the church age and the blessings that we get to receive. What a joy. By the way, it's important for us to understand that God was not in the dark about any of these things. He knew all of this was going to happen. He knew that his people would reject him. He understood all of these things and he made provision, therefore, as we find as the Bible unfolds. In this passage of Scripture, we find this truth with regard to the new covenant and we need to understand what Paul said in that passage in 2 Corinthians 3. In fact, let's turn back there. Let me read that to you again because I want you to understand, okay, this is great that we understand this new covenant and the fact that it's superior because why? Because Jesus is the surety and Jesus is the mediator and we're rejoicing in that and we understand that it's superior and we understand some of the specifics and we've gone through them somewhat quickly this morning, but we unfold and kind of peel back the pages of Scripture and begin to see the plan that God has for the ages. But notice what Paul says here in 2 Corinthians 3. It's interesting because he says in chapter 4, therefore seeing we have this ministry, but notice how he introduces this in chapter 3. He says in verse number 4, and such trust have we through Christ to Godward, not that we are sufficient of ourselves to think anything as of ourselves, but our sufficiency is of God, who also hath made us able ministers to the New Testament, not of the letter, but of the Spirit. For the letter killeth, but the Spirit giveth life. As you begin to understand what Paul is saying here, and even as you... Compare that with what Paul is giving to the believers in the region of Galatia when he speaks about the law and how that it could not give life. He says that if there had been a law that was given which could have given life, verily, righteousness should have been by the law. But no, it couldn't give life. What did the law do? It condemned. It said you're guilty. Right? It was a schoolmaster in Galatians 3. We find that here as we looked at that, why did we look at the overview of the book of Exodus at the very beginning of the message? Because we understand that as the law, that first covenant was given, that it was broken straight away. Showing that the law condemns. But here we find that Paul says that God hath made us. He is the One. Our sufficiency is of God. We don't go on our own power. We go as we're filled with the power of the Holy Spirit. In Acts 1 and verse number 8, we understand the truth of the responsibility that has been given to us to go and to be a witness. But he says that we are made able ministers of the New Testament, this new covenant. So therefore we get to go out and we get to share the gospel of Jesus Christ to let people understand what was accomplished by the substitutionary death, burial and glorious resurrection of Jesus Christ, our Savior. That these blessings are available as Paul would say there to the believers in Rome as he begins that great book. He says, speaking of the gospel, of course he understood that he was a debtor, that he was ready. He said, I am not ashamed of the gospel of Christ for it is the power of God unto salvation to everyone that believeth, to the Jew first and also to the Greek. He says that God hath made us to be able ministers. He says in 2 Corinthians 4 and verse number 1 that we have this ministry. Therefore seeing we have this ministry as we have received mercy, we faint not. Notice what he says in verse number... Man, we should read the whole thing. Verse number 3, if our gospel be hid, it is hid to them that are lost. Right? Remember he said that he made us able ministers of this New Covenant, this New Testament, that we would go. We've received this ministry that we faint not. If our gospel be hid, it is hid to them that are lost in whom the God of this world hath blinded the minds of them which believe not. Lest the light of the glorious gospel of Christ who is the image of God should shine unto them for we preach not ourselves, but Christ Jesus the Lord and ourselves your servants for Jesus' sake. Notice verse number 7. We have this treasure in earthen vessels that the excellency of the power may be of God and not of us. Notice verse 16. For which cause we faint not, but though our outward man perish, yet the inward man is renewed day by day for our light affliction, which is but for a moment, worketh for us a far more exceeding and eternal weight of glory. While we look not at the things which are seen, but at the things which are not seen, but the things which are not seen, excuse me, for the things which are seen are temporal, but the things which are not seen are eternal. So what's the understanding as we take away this morning from this passage that there's a better covenant? The fact of the matter is that we understand the details of it, and that's good. But it ought to motivate us to do something about it. Amen? Yes, that we are the recipients of these blessings spiritually. We understand, again, the fullness of this new covenant during the millennial reign of Christ, but as I have been a recipient of the gospel of Jesus Christ, as I now have been able to be graft in and to experience those blessings of salvation, I understand that I have been made, you have been made an able minister of this new covenant, of this new testament, and if our gospel be hid, it is hid to them that are lost. We have this treasure in earthen vessels. So it's not that we just go around and theologically understand this thing of a new covenant or a better covenant. It's that we actively go out and say, listen, Jesus did this so that you could be saved. Amen? The gospel is the power of God unto salvation. The Jew first, also the Greek. And so we understand, listen, this is an amazing truth of God's word, this new covenant, this better covenant, but it's not a truth that we hold to ourselves. It's a truth that we go and proclaim, that we go and send a light, as we have on our wall over here in our, we have our missions board over here, and we go and proclaim this truth of send the light. And really, as we enter into the church house that God has given us, that we're reminded of the truth and the responsibility that we have to go and preach the gospel to every creature. Paul says he's made us able ministers. He says, go and preach the gospel to every creature. He says, I will be with you always. Aren't you thankful for the promise that God will be with us? And so we understand the details and what a great truth that is given with regard to this new, better covenant, but we have to understand how it would impact us today. Yes, that we would be saved, that's wonderful. There's a world of lost people that need the gospel. And the question is this, who's gonna tell them? Who will tell them? It's gotta be somebody that knows the truth, right? You know, there are a lot of people out there that are propagating false teaching, right? A lot of people, a lot of false teachers. We understand that the Bible prophesies that that's gonna happen in the last days. There's gonna be a lot of false teachers. Just as there have been false prophets, so will there be false teachers. That's what Peter uses. He uses the example of the Old Testament, Israel, with all of the false prophets, and there were many. There are many false teachers, but we have the truth. And so we don't walk away from a passage like Hebrews 8, saying, man, that's wonderful to understand this theology and all that takes place and the eschatological, the timeline and the chart and all that's gonna happen in the end times and the eschatology with regard to the rapture and the tribulation and the millennial, so on and so forth, and how this is all fulfilled. That's great, and it's important to understand and to have that foundation. But what does it do for us today? How's it motivate us today? The trumpet of the Lord's gonna sound. I don't know when it's gonna sound. But as I mentioned in previous messages, whenever that time happens, whenever that trumpet sounds, I preached a couple of Sunday nights ago, this truth, go and tell. The only time I have to go and tell anyone is while I'm still here on earth. Because during the millennial reign and during all of eternity, I don't need to tell anybody about Jesus because they'll already know. Amen? And so the moment is now, and if our gospel's hid, it's hidden to them that are lost. A better covenant. Aren't you thankful for the truth of God's word? Let's pray together. We love you, we thank you for loving us. We thank you for the passage that is before us this morning for the truth that this better covenant is superior because the Lord Jesus Christ, God in flesh, is the surety of this covenant, is the mediator of this covenant. We thank you for the opportunity of looking at the specifics of this new covenant, this better covenant, with how it relates to Israel as a nation. As we consider how it relates to us as individual believers today. What a joy to understand that the gospel has now been made available to us and we can be grafted in. Lord, I pray that you would help us to understand the blessings of this truth. It'd help us to be burdened to take this message to a lost and dying world. We don't seek to set a date or any of those things which you've forbidden us to do. But God, we acknowledge this morning that we're living in the last days. You've told us that we're to redeem the time. We're to be busy about the work that you've called us to do. We thank you that Paul recognized and even as we would look at the passage and understand the way in which it relates to us that you have made us able ministers of this new testament, of this new covenant. God, would you help us to boldly proclaim the truth of your word that we would preach the gospel of Jesus Christ to those that you would give us opportunity that would understand the blessings that accompany salvation. Lord, if there's one that's not sure of heaven, I pray that today would be the day of their salvation. I pray that not one person would leave here without knowing for sure that heaven is their home. I pray that during this time of invitation that you alone would be glorified, that you'd work in hearts and lives. Help us to have a spirit, a heart of thankfulness for the blessings that accompany salvation. Help us to have a heart of commitment to go and to take this message to a lost and dying world. Well, thank you for all that you'll do for it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano and as she does, the altar's open. Have a time of invitation. You're welcome to move around the auditorium and come up here to this old-fashioned altar or you can pray right there in your seat. Make your seat and altar. As Kimberly plays, the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.559999942779541,
      "text": " verses 6 through 13, and of course, as you are aware, if you were here last week, we"
    },
    {
      "id": 1,
      "start": 5.559999942779541,
      "end": 9.84000015258789,
      "text": " looked at the first five verses of chapter number 8 last week, and so we'll finish up"
    },
    {
      "id": 2,
      "start": 9.84000015258789,
      "end": 14.399999618530273,
      "text": " chapter number 8 this morning and be looking at Hebrews 8, verses 6 through 13."
    },
    {
      "id": 3,
      "start": 14.399999618530273,
      "end": 18.239999771118164,
      "text": " Let me read verses 6 and 7 to you, then we'll get into the message this morning."
    },
    {
      "id": 4,
      "start": 18.239999771118164,
      "end": 23.0,
      "text": " In Hebrews 8 and verse number 6, the Bible says, But now hath he, speaking of our great"
    },
    {
      "id": 5,
      "start": 23.0,
      "end": 29.239999771118164,
      "text": " high priest, he hath obtained a more excellent ministry by how much also he is the mediator"
    },
    {
      "id": 6,
      "start": 29.239999771118164,
      "end": 34.2400016784668,
      "text": " of a better covenant which was established upon better promises."
    },
    {
      "id": 7,
      "start": 34.2400016784668,
      "end": 39.439998626708984,
      "text": " For if that first covenant had been faultless, then should no place have been sought for"
    },
    {
      "id": 8,
      "start": 39.439998626708984,
      "end": 40.439998626708984,
      "text": " the second."
    },
    {
      "id": 9,
      "start": 40.439998626708984,
      "end": 45.47999954223633,
      "text": " Notice in verse number 13, the Bible says, In that he saith, A new covenant he hath made"
    },
    {
      "id": 10,
      "start": 45.47999954223633,
      "end": 51.84000015258789,
      "text": " the first old, now that which decayeth and waxeth old is ready to vanish away."
    },
    {
      "id": 11,
      "start": 51.84000015258789,
      "end": 55.599998474121094,
      "text": " As we look at this passage of Scripture, I've simply entitled our message this morning,"
    },
    {
      "id": 12,
      "start": 55.599998474121094,
      "end": 56.599998474121094,
      "text": " A New Covenant."
    },
    {
      "id": 13,
      "start": 56.599998474121094,
      "end": 60.63999938964844,
      "text": " A New Covenant, and we'll be looking at Hebrews 8, verses 6 through 13."
    },
    {
      "id": 14,
      "start": 60.63999938964844,
      "end": 65.4800033569336,
      "text": " As you know, the book of Hebrews has established that Christ is superior."
    },
    {
      "id": 15,
      "start": 65.4800033569336,
      "end": 66.95999908447266,
      "text": " He's better."
    },
    {
      "id": 16,
      "start": 66.95999908447266,
      "end": 67.95999908447266,
      "text": " He's greater."
    },
    {
      "id": 17,
      "start": 67.95999908447266,
      "end": 71.55999755859375,
      "text": " We know that as we study the first three chapters of the book of Hebrews, that you see immediately"
    },
    {
      "id": 18,
      "start": 71.55999755859375,
      "end": 75.87999725341797,
      "text": " that he deals with the fact that Christ is better than the prophets, he's better than"
    },
    {
      "id": 19,
      "start": 75.87999725341797,
      "end": 77.87999725341797,
      "text": " the angels, he's better than Moses."
    },
    {
      "id": 20,
      "start": 77.87999725341797,
      "end": 82.44000244140625,
      "text": " We find in chapter number 6 that there's reference there to him being better and superior to"
    },
    {
      "id": 21,
      "start": 82.44000244140625,
      "end": 89.23999786376953,
      "text": " Abraham, but we find that in chapters 5 through really chapter number 10, the midst of what"
    },
    {
      "id": 22,
      "start": 89.23999786376953,
      "end": 93.91999816894531,
      "text": " we're studying in this section of the book of Hebrews, we find that the Bible has made"
    },
    {
      "id": 23,
      "start": 93.91999816894531,
      "end": 102.16000366210938,
      "text": " it clear, abundantly clear, and has provided us with much information to prove the superiority"
    },
    {
      "id": 24,
      "start": 102.16000366210938,
      "end": 104.87999725341797,
      "text": " of the priesthood of Christ."
    },
    {
      "id": 25,
      "start": 104.87999725341797,
      "end": 110.44000244140625,
      "text": " Of course, as we look at the contrast between that which these recipients would have been"
    },
    {
      "id": 26,
      "start": 110.44000244140625,
      "end": 115.91999816894531,
      "text": " very familiar with, the Aaronic priesthood, or the Levitical priesthood, we find that"
    },
    {
      "id": 27,
      "start": 115.91999816894531,
      "end": 122.36000061035156,
      "text": " the author of Hebrews, God, is giving the truth to these believers that we have a great"
    },
    {
      "id": 28,
      "start": 122.36000061035156,
      "end": 123.36000061035156,
      "text": " high priest."
    },
    {
      "id": 29,
      "start": 123.36000061035156,
      "end": 128.44000244140625,
      "text": " No, he's not after the order of Aaron, after that Aaronic priesthood."
    },
    {
      "id": 30,
      "start": 128.44000244140625,
      "end": 133.5399932861328,
      "text": " He's after the order of Melchizedek, that Messianic prophecy that we found in the book"
    },
    {
      "id": 31,
      "start": 133.5399932861328,
      "end": 134.5399932861328,
      "text": " of Psalms."
    },
    {
      "id": 32,
      "start": 134.5399932861328,
      "end": 138.47999572753906,
      "text": " And we understand that throughout the book of Hebrews, there have been many references"
    },
    {
      "id": 33,
      "start": 138.55999755859375,
      "end": 144.67999267578125,
      "text": " to Old Testament prophecy that has found its proper fulfillment here in the book of Hebrews"
    },
    {
      "id": 34,
      "start": 144.67999267578125,
      "end": 148.1199951171875,
      "text": " in saying that Jesus is the Messiah."
    },
    {
      "id": 35,
      "start": 148.1199951171875,
      "end": 150.72000122070312,
      "text": " He is the one that has fulfilled these prophecies."
    },
    {
      "id": 36,
      "start": 150.72000122070312,
      "end": 155.27999877929688,
      "text": " Again, this morning as we look at this eighth chapter of the book of Hebrews, we'll find"
    },
    {
      "id": 37,
      "start": 155.27999877929688,
      "end": 161.1199951171875,
      "text": " reference to the Old Testament, we'll find that there's reference to the first tabernacle,"
    },
    {
      "id": 38,
      "start": 161.1199951171875,
      "end": 165.75999450683594,
      "text": " and of course we understand that even as we studied last week in the first five verses"
    },
    {
      "id": 39,
      "start": 165.75999450683594,
      "end": 172.67999267578125,
      "text": " of Hebrews, chapter number eight, that the Scriptures talk to us about the true tabernacle,"
    },
    {
      "id": 40,
      "start": 172.67999267578125,
      "end": 175.24000549316406,
      "text": " which the Lord pitched and not man."
    },
    {
      "id": 41,
      "start": 175.24000549316406,
      "end": 179.24000549316406,
      "text": " And we find that as we would look at this new covenant that is being discussed, and"
    },
    {
      "id": 42,
      "start": 179.24000549316406,
      "end": 184.83999633789062,
      "text": " we'll look at several aspects of it in verses 6 through 13, but I want to remind you of"
    },
    {
      "id": 43,
      "start": 184.83999633789062,
      "end": 190.44000244140625,
      "text": " the first, or the old covenant, of which the recipients would have been very familiar."
    },
    {
      "id": 44,
      "start": 190.44000244140625,
      "end": 193.89999389648438,
      "text": " We won't take time to go back to the book of Exodus, but I just want to share with you"
    },
    {
      "id": 45,
      "start": 194.02000427246094,
      "end": 198.4600067138672,
      "text": " kind of an overview of Exodus chapter number 20 through 40."
    },
    {
      "id": 46,
      "start": 198.4600067138672,
      "end": 202.13999938964844,
      "text": " As we look at those 20 chapters that end the book of Exodus, of course if you look at the"
    },
    {
      "id": 47,
      "start": 202.13999938964844,
      "end": 206.94000244140625,
      "text": " first several chapters of the book of Exodus, you begin to deal with the call of Moses,"
    },
    {
      "id": 48,
      "start": 206.94000244140625,
      "end": 211.97999572753906,
      "text": " the plight of the children of Israel as they're in Egyptian bondage, and the power of God"
    },
    {
      "id": 49,
      "start": 211.97999572753906,
      "end": 217.5,
      "text": " that is revealed through all of the plagues, and of course the last being the death of"
    },
    {
      "id": 50,
      "start": 217.5,
      "end": 223.77999877929688,
      "text": " the firstborn, God's deliverance of his people out of Egypt, the miraculous crossing of the"
    },
    {
      "id": 51,
      "start": 223.77999877929688,
      "end": 224.77999877929688,
      "text": " Red Sea."
    },
    {
      "id": 52,
      "start": 224.77999877929688,
      "end": 228.5800018310547,
      "text": " I mean, there are so many powerful, wonderful truths that we find in the book of Exodus,"
    },
    {
      "id": 53,
      "start": 228.5800018310547,
      "end": 234.6999969482422,
      "text": " but as we look at chapters 20 through 40, and their really impact that this chapter"
    },
    {
      "id": 54,
      "start": 234.6999969482422,
      "end": 240.44000244140625,
      "text": " has on that truth, again, that these believers that are being written to here, that these"
    },
    {
      "id": 55,
      "start": 240.44000244140625,
      "end": 246.10000610351562,
      "text": " Jewish believers would have had much knowledge and been very familiar with that portion of"
    },
    {
      "id": 56,
      "start": 246.10000610351562,
      "end": 247.13999938964844,
      "text": " Scripture."
    },
    {
      "id": 57,
      "start": 247.13999938964844,
      "end": 251.74000549316406,
      "text": " You understand that it was in Exodus chapters 20 through 23 that we find that Moses would"
    },
    {
      "id": 58,
      "start": 251.74000549316406,
      "end": 253.3000030517578,
      "text": " receive the law."
    },
    {
      "id": 59,
      "start": 253.3000030517578,
      "end": 258.0799865722656,
      "text": " In particular, in chapter number 20, we're aware of the 10 commandments that are given"
    },
    {
      "id": 60,
      "start": 258.0799865722656,
      "end": 261.94000244140625,
      "text": " there in Exodus chapter number 20, but it's in those three chapters that Moses would receive"
    },
    {
      "id": 61,
      "start": 261.94000244140625,
      "end": 262.94000244140625,
      "text": " the law."
    },
    {
      "id": 62,
      "start": 262.94000244140625,
      "end": 266.1000061035156,
      "text": " It was in Exodus chapter number 24 that the law is ratified."
    },
    {
      "id": 63,
      "start": 266.1000061035156,
      "end": 272.5799865722656,
      "text": " It's interesting that in that passage of Scripture, on two occasions, the children of Israel respond"
    },
    {
      "id": 64,
      "start": 272.5799865722656,
      "end": 280.1000061035156,
      "text": " to Moses and say, all the words which the Lord hath said will we do."
    },
    {
      "id": 65,
      "start": 280.1000061035156,
      "end": 282.4800109863281,
      "text": " There was a commitment to obedience."
    },
    {
      "id": 66,
      "start": 282.4800109863281,
      "end": 287.1000061035156,
      "text": " We see that in verse number 3, and again in verse number 7, where there, the Bible tells"
    },
    {
      "id": 67,
      "start": 287.1000061035156,
      "end": 290.5,
      "text": " us that he took the book of the covenant and read in the audience of the people, and they"
    },
    {
      "id": 68,
      "start": 290.5,
      "end": 296.739990234375,
      "text": " said, all that the Lord hath said will we do, and be obedient."
    },
    {
      "id": 69,
      "start": 296.739990234375,
      "end": 298.82000732421875,
      "text": " That's in Exodus chapter 24."
    },
    {
      "id": 70,
      "start": 298.82000732421875,
      "end": 303.3800048828125,
      "text": " Immediately after that process, we find that Moses goes back to the mount, and it's in"
    },
    {
      "id": 71,
      "start": 303.3800048828125,
      "end": 309.9800109863281,
      "text": " Exodus chapters 25 through 31 that God gives Moses the instruction with regard to the tabernacle."
    },
    {
      "id": 72,
      "start": 310.3599853515625,
      "end": 314.70001220703125,
      "text": " All of those details on the construction, all of the materials and the dimensions, and"
    },
    {
      "id": 73,
      "start": 314.70001220703125,
      "end": 321.82000732421875,
      "text": " all of the fine details, it's in that passage where God shows him the pattern of the true"
    },
    {
      "id": 74,
      "start": 321.82000732421875,
      "end": 322.82000732421875,
      "text": " tabernacle."
    },
    {
      "id": 75,
      "start": 322.82000732421875,
      "end": 327.260009765625,
      "text": " We understand, as we dealt with last week, how that tabernacle, which would soon become"
    },
    {
      "id": 76,
      "start": 327.260009765625,
      "end": 332.1400146484375,
      "text": " a temple under the reign and rule of Solomon, king of Israel, and of course there was a"
    },
    {
      "id": 77,
      "start": 332.1400146484375,
      "end": 337.5400085449219,
      "text": " temple that was still standing here for these Jewish believers in Jerusalem, but we find"
    },
    {
      "id": 78,
      "start": 337.5400085449219,
      "end": 344.1400146484375,
      "text": " that all of that was a simple shadow, a picture of that true tabernacle, which is in heaven."
    },
    {
      "id": 79,
      "start": 344.1400146484375,
      "end": 348.82000732421875,
      "text": " And so while Moses was there receiving all of that instruction and all of those details,"
    },
    {
      "id": 80,
      "start": 348.82000732421875,
      "end": 354.0400085449219,
      "text": " and God saying, very specifically, do not deviate at all."
    },
    {
      "id": 81,
      "start": 354.0400085449219,
      "end": 360.1600036621094,
      "text": " There was very important that every detail would be followed just as it had been given."
    },
    {
      "id": 82,
      "start": 360.1600036621094,
      "end": 364.6199951171875,
      "text": " And then we come to Exodus chapter number 32, and we find the record of Aaron and the"
    },
    {
      "id": 83,
      "start": 364.6199951171875,
      "end": 366.2200012207031,
      "text": " golden calf."
    },
    {
      "id": 84,
      "start": 366.2200012207031,
      "end": 372.9800109863281,
      "text": " They had broken the very law that they had committed to obey."
    },
    {
      "id": 85,
      "start": 372.9800109863281,
      "end": 378.5799865722656,
      "text": " They ratified, we use that word in chapter 24, where they say all that the Lord has said"
    },
    {
      "id": 86,
      "start": 378.5799865722656,
      "end": 381.739990234375,
      "text": " we will do, we're going to be obedient."
    },
    {
      "id": 87,
      "start": 381.739990234375,
      "end": 384.9800109863281,
      "text": " And as Moses is up on the mountain receiving all that instruction, they say we don't know"
    },
    {
      "id": 88,
      "start": 384.9800109863281,
      "end": 388.1000061035156,
      "text": " about this guy Moses, we don't know what he's doing, and we don't know all that's going"
    },
    {
      "id": 89,
      "start": 388.1000061035156,
      "end": 391.1400146484375,
      "text": " on, and they make this golden calf."
    },
    {
      "id": 90,
      "start": 391.1400146484375,
      "end": 398.5,
      "text": " How terrible to see how quickly the people had broken the very law that they committed"
    },
    {
      "id": 91,
      "start": 398.5,
      "end": 400.29998779296875,
      "text": " to obey."
    },
    {
      "id": 92,
      "start": 400.29998779296875,
      "end": 407.2200012207031,
      "text": " And then we find that in chapters 33 and 34, we find that there's repentance and renewal"
    },
    {
      "id": 93,
      "start": 407.2200012207031,
      "end": 414.70001220703125,
      "text": " of that really just a commitment to obedience on the part of the children of Israel."
    },
    {
      "id": 94,
      "start": 414.70001220703125,
      "end": 419.7799987792969,
      "text": " In chapters 33 and 34 of the book of Exodus, and then you read of, in chapters 35-39, the"
    },
    {
      "id": 95,
      "start": 419.7799987792969,
      "end": 423.4599914550781,
      "text": " instruction of the tabernacle, all those details, Bezalel and others that would be"
    },
    {
      "id": 96,
      "start": 423.4599914550781,
      "end": 430.2200012207031,
      "text": " take part in doing the work that God had commanded to be done, and you come to the 40th chapter"
    },
    {
      "id": 97,
      "start": 430.2200012207031,
      "end": 434.17999267578125,
      "text": " of the book of Exodus, and it's a culmination of all of those events, and you find that"
    },
    {
      "id": 98,
      "start": 434.17999267578125,
      "end": 439.94000244140625,
      "text": " they did exactly as God had commanded, they obeyed the Lord, they followed the instruction,"
    },
    {
      "id": 99,
      "start": 439.94000244140625,
      "end": 446.1400146484375,
      "text": " and you read of the rearing up of the tabernacle and the glory of God filling that place."
    },
    {
      "id": 100,
      "start": 446.1400146484375,
      "end": 447.7799987792969,
      "text": " What a blessing."
    },
    {
      "id": 101,
      "start": 447.7799987792969,
      "end": 452.8599853515625,
      "text": " And as we consider those truths from the last part of the book of Exodus and really"
    },
    {
      "id": 102,
      "start": 452.8599853515625,
      "end": 457.29998779296875,
      "text": " kind of quickly overview those 20 chapters, we find that there will be reference to those"
    },
    {
      "id": 103,
      "start": 457.29998779296875,
      "end": 461.5799865722656,
      "text": " things because the Bible talks about here this new covenant, but he makes reference"
    },
    {
      "id": 104,
      "start": 461.5799865722656,
      "end": 466.9800109863281,
      "text": " to the first covenant, and really we would simply refer to that as being the law."
    },
    {
      "id": 105,
      "start": 466.9800109863281,
      "end": 471.70001220703125,
      "text": " And we find that as we look at the passage of scripture that is before us, again, I've"
    },
    {
      "id": 106,
      "start": 471.70001220703125,
      "end": 477.3399963378906,
      "text": " titled the message, A Better Covenant, A New Covenant, as we find in verse number 13, a"
    },
    {
      "id": 107,
      "start": 477.3399963378906,
      "end": 482.260009765625,
      "text": " new covenant, we find in verse number 8, where it is a better covenant, and we find"
    },
    {
      "id": 108,
      "start": 482.260009765625,
      "end": 486.4200134277344,
      "text": " that this is a better covenant, excuse me, verse number 6, it says, by how much also"
    },
    {
      "id": 109,
      "start": 486.4200134277344,
      "end": 490.6600036621094,
      "text": " he is the mediator of a better covenant."
    },
    {
      "id": 110,
      "start": 490.6600036621094,
      "end": 494.94000244140625,
      "text": " As we look at the passage of scripture, again, we'll make note of some Old Testament prophets"
    },
    {
      "id": 111,
      "start": 494.94000244140625,
      "end": 499.260009765625,
      "text": " in the book of Jeremiah as we go through the passage, and notice if you're taking notes,"
    },
    {
      "id": 112,
      "start": 499.260009765625,
      "end": 502.1400146484375,
      "text": " number one, the superiority of the new covenant."
    },
    {
      "id": 113,
      "start": 502.1400146484375,
      "end": 506.3800048828125,
      "text": " Notice in verse number 6, I read it for you already, but you find that the Bible says,"
    },
    {
      "id": 114,
      "start": 506.3800048828125,
      "end": 509.17999267578125,
      "text": " but now hath he obtained a more excellent ministry."
    },
    {
      "id": 115,
      "start": 509.17999267578125,
      "end": 513.5399780273438,
      "text": " Now remember, he's speaking about the fact that we have a high priest."
    },
    {
      "id": 116,
      "start": 513.5399780273438,
      "end": 517.260009765625,
      "text": " He's been dealing with this subject matter, we really started in chapter number 5, we"
    },
    {
      "id": 117,
      "start": 517.260009765625,
      "end": 523.97998046875,
      "text": " get into the truth of the order of Melchizedek and the fact that that is fully developed"
    },
    {
      "id": 118,
      "start": 523.97998046875,
      "end": 528.3800048828125,
      "text": " in chapter number 7, and you come here to chapter number 8, and you say, why is it we"
    },
    {
      "id": 119,
      "start": 528.3800048828125,
      "end": 534.5,
      "text": " have this high priest, and as we discussed last week, that he ministers in a better place,"
    },
    {
      "id": 120,
      "start": 534.5,
      "end": 539.219970703125,
      "text": " and we find that he presented a better offering."
    },
    {
      "id": 121,
      "start": 539.219970703125,
      "end": 540.219970703125,
      "text": " What did he do?"
    },
    {
      "id": 122,
      "start": 540.219970703125,
      "end": 542.5,
      "text": " He offered himself."
    },
    {
      "id": 123,
      "start": 542.5,
      "end": 548.3800048828125,
      "text": " The sinless, precious blood of God in flesh, the Lord Jesus Christ, and then we come as"
    },
    {
      "id": 124,
      "start": 548.3800048828125,
      "end": 554.1400146484375,
      "text": " we find it says, but now, in verse number 6, hath he obtained a more excellent ministry."
    },
    {
      "id": 125,
      "start": 554.1400146484375,
      "end": 562.2999877929688,
      "text": " Notice by how much also he is the mediator of a better covenant, which was established"
    },
    {
      "id": 126,
      "start": 562.2999877929688,
      "end": 564.6199951171875,
      "text": " upon better promises."
    },
    {
      "id": 127,
      "start": 564.6199951171875,
      "end": 570.4199829101562,
      "text": " Again, we've mentioned the theme of the book of Hebrews, that Christ is better, he is superior,"
    },
    {
      "id": 128,
      "start": 570.4199829101562,
      "end": 575.7000122070312,
      "text": " and we find twice in verse number 6, how that it mentions a better covenant, which was established"
    },
    {
      "id": 129,
      "start": 575.7000122070312,
      "end": 578.239990234375,
      "text": " upon better promises."
    },
    {
      "id": 130,
      "start": 578.239990234375,
      "end": 582.5800170898438,
      "text": " We find that he says in verse number 7, for if that first covenant had been faultless,"
    },
    {
      "id": 131,
      "start": 582.5800170898438,
      "end": 586.0999755859375,
      "text": " then should no place have been sought for the second, but finding fault, notice this"
    },
    {
      "id": 132,
      "start": 586.0999755859375,
      "end": 589.0999755859375,
      "text": " phrase, with them."
    },
    {
      "id": 133,
      "start": 589.0999755859375,
      "end": 590.0999755859375,
      "text": " Who's them?"
    },
    {
      "id": 134,
      "start": 590.0999755859375,
      "end": 591.7000122070312,
      "text": " The children of Israel, right?"
    },
    {
      "id": 135,
      "start": 592.0800170898438,
      "end": 597.219970703125,
      "text": " We mention how they broke the covenant and we find that he says finding fault with them,"
    },
    {
      "id": 136,
      "start": 597.219970703125,
      "end": 600.0599975585938,
      "text": " he saith, God says, behold…"
    },
    {
      "id": 0,
      "start": 600.0599975585938,
      "end": 606.6999974250793,
      "text": " Behold, the days come, saith the Lord, when I will make a new covenant, notice this, with"
    },
    {
      "id": 1,
      "start": 606.6999974250793,
      "end": 612.2599973678589,
      "text": " the house of Israel and with the house of Judah, not according to the covenant that"
    },
    {
      "id": 2,
      "start": 612.2599973678589,
      "end": 617.6199970245361,
      "text": " I made with their fathers in the day when I took them by the hand to lead them out of"
    },
    {
      "id": 3,
      "start": 617.6199970245361,
      "end": 618.6199970245361,
      "text": " the land of Egypt."
    },
    {
      "id": 4,
      "start": 618.6199970245361,
      "end": 621.3599967956543,
      "text": " Now, remember, that's found in the book of Exodus."
    },
    {
      "id": 5,
      "start": 621.3599967956543,
      "end": 623.6999969482422,
      "text": " We just kind of reviewed that very quickly."
    },
    {
      "id": 6,
      "start": 623.6999969482422,
      "end": 628.3399982452393,
      "text": " And then you notice the last phrase in verse number nine, because they, who's they?"
    },
    {
      "id": 7,
      "start": 628.3399982452393,
      "end": 635.0199966430664,
      "text": " Again, the children of Israel, they continued not in my covenant, and I regarded them not,"
    },
    {
      "id": 8,
      "start": 635.0199966430664,
      "end": 636.9799957275391,
      "text": " saith the Lord."
    },
    {
      "id": 9,
      "start": 636.9799957275391,
      "end": 640.6599960327148,
      "text": " It's interesting as we look at the superiority of this covenant, this new covenant that is"
    },
    {
      "id": 10,
      "start": 640.6599960327148,
      "end": 645.2199974060059,
      "text": " mentioned here in the passage of scripture, we would find that really there's two simple"
    },
    {
      "id": 11,
      "start": 645.2199974060059,
      "end": 647.4199981689453,
      "text": " reasons that it's a better covenant."
    },
    {
      "id": 12,
      "start": 647.4199981689453,
      "end": 651.1799964904785,
      "text": " Number one, because Jesus is the surety for this covenant."
    },
    {
      "id": 13,
      "start": 651.1799964904785,
      "end": 654.8399963378906,
      "text": " Notice back in chapter number seven, this was given to us in chapter seven and verse"
    },
    {
      "id": 14,
      "start": 654.8399963378906,
      "end": 658.0599975585938,
      "text": " number 22 about this better testament."
    },
    {
      "id": 15,
      "start": 658.0599975585938,
      "end": 661.2999992370605,
      "text": " The word testament and covenant can be used interchangeably."
    },
    {
      "id": 16,
      "start": 661.2999992370605,
      "end": 668.2999954223633,
      "text": " You understand here that in verse number 22, it says this, by so much was Jesus made a"
    },
    {
      "id": 17,
      "start": 668.2999954223633,
      "end": 673.6999969482422,
      "text": " surety of a better testament, a better covenant."
    },
    {
      "id": 18,
      "start": 673.6999969482422,
      "end": 680.8600006103516,
      "text": " We find that he paid for the sin of mankind with his precious blood, and Jesus is the"
    },
    {
      "id": 19,
      "start": 680.8600006103516,
      "end": 682.6599960327148,
      "text": " surety of this covenant."
    },
    {
      "id": 20,
      "start": 682.6599960327148,
      "end": 686.5,
      "text": " Not only is he the surety of the covenant, but we find in verse number six that he is"
    },
    {
      "id": 21,
      "start": 686.5,
      "end": 690.1800003051758,
      "text": " the mediator of this covenant."
    },
    {
      "id": 22,
      "start": 690.1800003051758,
      "end": 696.1800003051758,
      "text": " Mediator is one who takes two parties that are at variance, and these two parties that"
    },
    {
      "id": 23,
      "start": 696.1800003051758,
      "end": 702.8999938964844,
      "text": " are at variance, this mediator were interposed in order to bring reconciliation."
    },
    {
      "id": 24,
      "start": 702.8999938964844,
      "end": 707.6199951171875,
      "text": " You find the work of the mediator, if you understand the Lord Jesus Christ in this particular"
    },
    {
      "id": 25,
      "start": 707.6199951171875,
      "end": 716.0999984741211,
      "text": " role, if you will, as mediator, he took man who was at enmity with God."
    },
    {
      "id": 26,
      "start": 716.0999984741211,
      "end": 723.0199966430664,
      "text": " We find that Jesus came and presented himself, and he allowed Jesus through his substitutionary"
    },
    {
      "id": 27,
      "start": 723.0199966430664,
      "end": 725.8999938964844,
      "text": " death, burial, and glorious resurrection."
    },
    {
      "id": 28,
      "start": 725.8999938964844,
      "end": 731.5800018310547,
      "text": " We find that he is both the surety and the mediator of this new covenant, which allows"
    },
    {
      "id": 29,
      "start": 731.5800018310547,
      "end": 732.5800018310547,
      "text": " what?"
    },
    {
      "id": 30,
      "start": 732.5800018310547,
      "end": 735.8999938964844,
      "text": " It allows mankind to be reconciled to God."
    },
    {
      "id": 31,
      "start": 735.8999938964844,
      "end": 741.0999908447266,
      "text": " Without the work of Christ on the cross of Calvary, we do not understand this great truth"
    },
    {
      "id": 32,
      "start": 741.0999908447266,
      "end": 745.1399993896484,
      "text": " of reconciliation, because we were at enmity with God."
    },
    {
      "id": 33,
      "start": 745.1799926757812,
      "end": 751.6600036621094,
      "text": " You read Romans chapter number five, and you find here that the superiority of this new"
    },
    {
      "id": 34,
      "start": 751.6600036621094,
      "end": 756.4599914550781,
      "text": " covenant that is mentioned in our passage of Scripture, that it's because Jesus is not"
    },
    {
      "id": 35,
      "start": 756.4599914550781,
      "end": 759.8999938964844,
      "text": " only the surety, but he's also the mediator."
    },
    {
      "id": 36,
      "start": 759.8999938964844,
      "end": 761.6999969482422,
      "text": " It's important for us to understand that."
    },
    {
      "id": 37,
      "start": 761.6999969482422,
      "end": 764.5399932861328,
      "text": " It was with his precious blood."
    },
    {
      "id": 38,
      "start": 764.5399932861328,
      "end": 767.0599975585938,
      "text": " He did not use anything."
    },
    {
      "id": 39,
      "start": 767.0599975585938,
      "end": 771.2200012207031,
      "text": " We find that Peter mentions that we're not redeemed with silver and gold, but with the"
    },
    {
      "id": 40,
      "start": 771.2200012207031,
      "end": 773.739990234375,
      "text": " precious blood of Christ."
    },
    {
      "id": 41,
      "start": 773.739990234375,
      "end": 779.739990234375,
      "text": " What a joy to understand the superiority of this covenant."
    },
    {
      "id": 42,
      "start": 779.739990234375,
      "end": 781.739990234375,
      "text": " Notice he says in verse number seven,"
    },
    {
      "id": 43,
      "start": 781.739990234375,
      "end": 785.5399932861328,
      "text": " For if that first covenant had been faultless, then should no place have been sought for"
    },
    {
      "id": 44,
      "start": 785.5399932861328,
      "end": 786.5399932861328,
      "text": " the second."
    },
    {
      "id": 45,
      "start": 786.5399932861328,
      "end": 788.5,
      "text": " What was the problem with the first covenant?"
    },
    {
      "id": 46,
      "start": 788.5,
      "end": 791.7799987792969,
      "text": " It was broken by them."
    },
    {
      "id": 47,
      "start": 791.7799987792969,
      "end": 793.2599945068359,
      "text": " It says there in verse number eight,"
    },
    {
      "id": 48,
      "start": 793.2599945068359,
      "end": 797.239990234375,
      "text": " For finding fault with them, speaking of the children of Israel."
    },
    {
      "id": 49,
      "start": 797.239990234375,
      "end": 804.1199951171875,
      "text": " You notice that as we look in verse number nine, it says they continued not in my covenant."
    },
    {
      "id": 50,
      "start": 804.1199951171875,
      "end": 807.6799926757812,
      "text": " And it says that he therefore regarded them not, saith the Lord."
    },
    {
      "id": 51,
      "start": 807.6799926757812,
      "end": 813.1600036621094,
      "text": " As we begin to look at the passage of Scripture, we find that God then mentions in verse number"
    },
    {
      "id": 52,
      "start": 813.1600036621094,
      "end": 818.5599975585938,
      "text": " eight, and this writer of the book of Hebrews is helping these Jewish believers to understand"
    },
    {
      "id": 53,
      "start": 818.5599975585938,
      "end": 821.5599975585938,
      "text": " the promises that had been given in the Old Testament."
    },
    {
      "id": 54,
      "start": 821.5599975585938,
      "end": 826.5999908447266,
      "text": " Again, these Jewish believers would have a certain understanding of these Old Testament"
    },
    {
      "id": 55,
      "start": 826.9599914550781,
      "end": 831.0,
      "text": " truths, and what a blessing to see how the writer of Hebrews, under the inspiration of"
    },
    {
      "id": 56,
      "start": 831.0,
      "end": 837.1600036621094,
      "text": " the Holy Spirit of God, allows for these believers to understand the Old Testament truth and"
    },
    {
      "id": 57,
      "start": 837.1600036621094,
      "end": 841.7599945068359,
      "text": " properly apply it to the Lord Jesus Christ."
    },
    {
      "id": 58,
      "start": 841.7599945068359,
      "end": 845.7599945068359,
      "text": " I've heard people say, the Old Testament really isn't important, we live in the New Testament"
    },
    {
      "id": 59,
      "start": 845.7599945068359,
      "end": 846.7599945068359,
      "text": " age."
    },
    {
      "id": 60,
      "start": 846.7599945068359,
      "end": 850.1199951171875,
      "text": " Oh, the New Testament contradicts that."
    },
    {
      "id": 61,
      "start": 850.1199951171875,
      "end": 853.7200012207031,
      "text": " Because the New Testament says that it was written for our benefit, for our admonition,"
    },
    {
      "id": 62,
      "start": 853.7200012207031,
      "end": 854.7200012207031,
      "text": " for our learning."
    },
    {
      "id": 63,
      "start": 855.4400024414062,
      "end": 860.0400085449219,
      "text": " And so we can't ignore the Old Testament, we find great truth in the Old Testament that"
    },
    {
      "id": 64,
      "start": 860.0400085449219,
      "end": 864.8800048828125,
      "text": " helps us understand the fulfillment that we find here in the New Testament."
    },
    {
      "id": 65,
      "start": 864.8800048828125,
      "end": 867.5199890136719,
      "text": " And so we find that he says this in verse number eight."
    },
    {
      "id": 66,
      "start": 867.5199890136719,
      "end": 871.2799987792969,
      "text": " Notice the way in which he's leading into this new covenant, and we'll deal with it"
    },
    {
      "id": 67,
      "start": 871.2799987792969,
      "end": 876.5199890136719,
      "text": " in more details in verses 10 through 12, but notice what he says, behold, right in the"
    },
    {
      "id": 68,
      "start": 876.5199890136719,
      "end": 881.4400024414062,
      "text": " middle of verse number eight, the days come, saith the Lord."
    },
    {
      "id": 69,
      "start": 882.3200073242188,
      "end": 885.0799865722656,
      "text": " This is referring to an Old Testament prophecy."
    },
    {
      "id": 70,
      "start": 885.0799865722656,
      "end": 887.0,
      "text": " God is eternal, right?"
    },
    {
      "id": 71,
      "start": 887.0,
      "end": 889.8800048828125,
      "text": " He's Alpha and Omega, the beginning and the end, the first and last."
    },
    {
      "id": 72,
      "start": 889.8800048828125,
      "end": 894.6799926757812,
      "text": " And so he is able to speak about something that's going to come in the future, why?"
    },
    {
      "id": 73,
      "start": 894.6799926757812,
      "end": 897.4800109863281,
      "text": " Because he is eternal."
    },
    {
      "id": 74,
      "start": 897.4800109863281,
      "end": 900.4400024414062,
      "text": " And he's able to bring it to pass, why?"
    },
    {
      "id": 75,
      "start": 900.4400024414062,
      "end": 901.4400024414062,
      "text": " Because he's eternal."
    },
    {
      "id": 76,
      "start": 901.4400024414062,
      "end": 906.7999877929688,
      "text": " We see the knowledge and wisdom of God, we see the eternality of God here in the passage"
    },
    {
      "id": 77,
      "start": 906.7999877929688,
      "end": 911.0400085449219,
      "text": " of Scripture, and he says, behold, the days come, saith the Lord."
    },
    {
      "id": 78,
      "start": 911.0400085449219,
      "end": 917.5599975585938,
      "text": " Notice these phrases, when I will make a new covenant with the house of Israel and"
    },
    {
      "id": 79,
      "start": 917.5599975585938,
      "end": 919.4800109863281,
      "text": " with the house of Judah."
    },
    {
      "id": 80,
      "start": 919.4800109863281,
      "end": 923.760009765625,
      "text": " And so we find that right there in verse number eight, it begins to refer to this Old Testament"
    },
    {
      "id": 81,
      "start": 923.760009765625,
      "end": 928.1199951171875,
      "text": " prophecy with regard to this new covenant, and we'll look at it in Jeremiah here in just"
    },
    {
      "id": 82,
      "start": 928.1199951171875,
      "end": 932.8399963378906,
      "text": " a few moments, but it's important that we understand that he says that he's going to"
    },
    {
      "id": 83,
      "start": 932.8399963378906,
      "end": 937.6399841308594,
      "text": " make this, it's going to be in days to come, and he will make this new covenant with the"
    },
    {
      "id": 84,
      "start": 937.6399841308594,
      "end": 942.6000061035156,
      "text": " house of Israel and with the house of Judah."
    },
    {
      "id": 85,
      "start": 942.6000061035156,
      "end": 947.239990234375,
      "text": " Of course, during the time of Jeremiah's prophecy, Israel had already been taken captive by the"
    },
    {
      "id": 86,
      "start": 947.239990234375,
      "end": 949.1399841308594,
      "text": " Assyrians."
    },
    {
      "id": 87,
      "start": 949.1399841308594,
      "end": 953.8800048828125,
      "text": " In fact, Judah was on the eve of captivity by the Babylonians."
    },
    {
      "id": 88,
      "start": 953.8800048828125,
      "end": 956.3399963378906,
      "text": " They had already sieged the city."
    },
    {
      "id": 89,
      "start": 956.3399963378906,
      "end": 960.4800109863281,
      "text": " You can find that Jeremiah speaks of that often with regard to the impending judgment"
    },
    {
      "id": 90,
      "start": 960.4800109863281,
      "end": 965.3599853515625,
      "text": " and doom of the city of Judah, the nation of Judah being carried away into Babylonian"
    },
    {
      "id": 91,
      "start": 965.3599853515625,
      "end": 966.3599853515625,
      "text": " captivity."
    },
    {
      "id": 92,
      "start": 966.3599853515625,
      "end": 970.9199829101562,
      "text": " And so really in focus here is when he talks about the house of Israel and the house of"
    },
    {
      "id": 93,
      "start": 970.9199829101562,
      "end": 976.2799987792969,
      "text": " Judah is this one nation of Israel again that God's going to make this promise to, this"
    },
    {
      "id": 94,
      "start": 976.2799987792969,
      "end": 977.2799987792969,
      "text": " new covenant to."
    },
    {
      "id": 95,
      "start": 977.2799987792969,
      "end": 982.5199890136719,
      "text": " Now, it's important that we understand there are individuals that have taken and had really,"
    },
    {
      "id": 96,
      "start": 982.5199890136719,
      "end": 988.239990234375,
      "text": " in my opinion, a bad exegetical approach to understanding the Scriptures, and they said,"
    },
    {
      "id": 97,
      "start": 988.239990234375,
      "end": 990.6799926757812,
      "text": " no, this new covenant has nothing to do with Israel."
    },
    {
      "id": 98,
      "start": 990.6799926757812,
      "end": 992.5199890136719,
      "text": " It has everything to do with Israel."
    },
    {
      "id": 99,
      "start": 993.5199890136719,
      "end": 996.8399963378906,
      "text": " They said, no, no, it's about the church, and the church becomes spiritual Israel."
    },
    {
      "id": 100,
      "start": 996.8399963378906,
      "end": 1000.6799926757812,
      "text": " As you start to do those kind of things with Scripture, you really kind of get yourself"
    },
    {
      "id": 101,
      "start": 1000.6799926757812,
      "end": 1003.6000061035156,
      "text": " twisted up and get yourself in a mess."
    },
    {
      "id": 102,
      "start": 1003.6000061035156,
      "end": 1009.5599975585938,
      "text": " No doubt these Jewish believers that are the original recipients of this book of Hebrews,"
    },
    {
      "id": 103,
      "start": 1009.5599975585938,
      "end": 1014.7200012207031,
      "text": " when the writer says the house of Judah and the house of Israel, they would have understood"
    },
    {
      "id": 104,
      "start": 1014.7200012207031,
      "end": 1016.3599853515625,
      "text": " the nation."
    },
    {
      "id": 105,
      "start": 1016.3599853515625,
      "end": 1022.6000061035156,
      "text": " No doubt in Jeremiah's prophecy, in Jeremiah chapter number 31, that when that prophecy"
    },
    {
      "id": 106,
      "start": 1022.6000061035156,
      "end": 1026.6399841308594,
      "text": " is given with regard to the house of Judah and the house of Israel, it was understood"
    },
    {
      "id": 107,
      "start": 1026.6399841308594,
      "end": 1027.6399841308594,
      "text": " to be Israel."
    },
    {
      "id": 108,
      "start": 1027.6399841308594,
      "end": 1029.6000061035156,
      "text": " There was no church at that time."
    },
    {
      "id": 109,
      "start": 1029.6000061035156,
      "end": 1030.6399841308594,
      "text": " Amen?"
    },
    {
      "id": 110,
      "start": 1030.6399841308594,
      "end": 1035.239990234375,
      "text": " The church was known by God, but it was not known by the prophets."
    },
    {
      "id": 111,
      "start": 1035.239990234375,
      "end": 1039.2799987792969,
      "text": " We find that as we look at the passage of Scripture that is before us, and we understand"
    },
    {
      "id": 112,
      "start": 1039.2799987792969,
      "end": 1043.3200073242188,
      "text": " the superiority of the new covenant, then we look at number two, the specifics of the"
    },
    {
      "id": 113,
      "start": 1043.3200073242188,
      "end": 1045.3599853515625,
      "text": " new covenant."
    },
    {
      "id": 114,
      "start": 1045.3599853515625,
      "end": 1048.1600036621094,
      "text": " We find, first of all, as we've mentioned here in verse number 8, and we'll get into"
    },
    {
      "id": 115,
      "start": 1048.1600036621094,
      "end": 1052.0799865722656,
      "text": " it in verses 10 through 12 as well, I want you to understand, number one, how it relates"
    },
    {
      "id": 116,
      "start": 1052.0799865722656,
      "end": 1053.0799865722656,
      "text": " to Israel."
    },
    {
      "id": 117,
      "start": 1053.0799865722656,
      "end": 1054.5599975585938,
      "text": " How it relates to Israel."
    },
    {
      "id": 118,
      "start": 1054.5599975585938,
      "end": 1056.2000122070312,
      "text": " Turn over, if you will, to Jeremiah 31."
    },
    {
      "id": 119,
      "start": 1056.2000122070312,
      "end": 1059.6399841308594,
      "text": " Keep your place here in Hebrews chapter number 8, but turn to the book of Jeremiah."
    },
    {
      "id": 120,
      "start": 1059.6399841308594,
      "end": 1065.8399963378906,
      "text": " Let's read this portion of Scripture in Jeremiah chapter number 31 with regard to this prophecy"
    },
    {
      "id": 121,
      "start": 1065.8399963378906,
      "end": 1071.3200073242188,
      "text": " that is being referenced in Hebrews chapter number 8."
    },
    {
      "id": 122,
      "start": 1071.3200073242188,
      "end": 1076.1199951171875,
      "text": " In Jeremiah chapter number 31, we find that really beginning in verse number 31 down through"
    },
    {
      "id": 123,
      "start": 1076.1199951171875,
      "end": 1081.3599853515625,
      "text": " verse number 34 will be the context in which we read here this morning of some of the promise"
    },
    {
      "id": 124,
      "start": 1081.3599853515625,
      "end": 1083.239990234375,
      "text": " with regard to this new covenant."
    },
    {
      "id": 125,
      "start": 1083.239990234375,
      "end": 1086.1199951171875,
      "text": " Notice in verse number 31 of Jeremiah 31,"
    },
    {
      "id": 126,
      "start": 1086.1199951171875,
      "end": 1091.5,
      "text": " Behold, the days come, saith the Lord, that I will make a new covenant with the house"
    },
    {
      "id": 127,
      "start": 1091.5,
      "end": 1095.8399963378906,
      "text": " of Israel and with the house of Judah, not according to the covenant that I made with"
    },
    {
      "id": 128,
      "start": 1095.8399963378906,
      "end": 1099.9199829101562,
      "text": " their fathers in the day that I took them by the hand to bring them out of the land"
    },
    {
      "id": 129,
      "start": 1099.9199829101562,
      "end": 1104.9199829101562,
      "text": " of Egypt, which my covenant they break, although I was a husband unto them, saith the Lord."
    },
    {
      "id": 130,
      "start": 1104.9199829101562,
      "end": 1106.1199951171875,
      "text": " Verse 33."
    },
    {
      "id": 131,
      "start": 1106.1199951171875,
      "end": 1111.1199951171875,
      "text": " But this shall be the covenant that I will make with the house of Israel after those"
    },
    {
      "id": 132,
      "start": 1111.1199951171875,
      "end": 1113.8400268554688,
      "text": " days, saith the Lord."
    },
    {
      "id": 133,
      "start": 1113.8400268554688,
      "end": 1116.5599975585938,
      "text": " Remember that phrase, after those days, we're going to look at something with regard to"
    },
    {
      "id": 134,
      "start": 1116.5599975585938,
      "end": 1118.5599975585938,
      "text": " that in just a moment."
    },
    {
      "id": 135,
      "start": 1118.5599975585938,
      "end": 1121.4400024414062,
      "text": " After those days, saith the Lord, let's look at what he's going to do."
    },
    {
      "id": 136,
      "start": 1121.4400024414062,
      "end": 1126.6199951171875,
      "text": " I will put my law in their inward parts and write it in their hearts and will be their"
    },
    {
      "id": 137,
      "start": 1126.6199951171875,
      "end": 1132.5800170898438,
      "text": " God and they shall be my people and they shall teach no more every man his neighbor"
    },
    {
      "id": 138,
      "start": 1132.5800170898438,
      "end": 1137.5,
      "text": " and every man his brother, saying, Know the Lord, for they shall all know me."
    },
    {
      "id": 139,
      "start": 1137.5,
      "end": 1140.9000244140625,
      "text": " From the least of them unto the greatest of them, saith the Lord, for I will forgive their"
    },
    {
      "id": 140,
      "start": 1140.9000244140625,
      "end": 1146.3800048828125,
      "text": " iniquity and I will remember their sin no more."
    },
    {
      "id": 141,
      "start": 1146.3800048828125,
      "end": 1150.2799682617188,
      "text": " So we're looking here at the specifics of the new covenant and understanding how this"
    },
    {
      "id": 142,
      "start": 1150.2799682617188,
      "end": 1153.219970703125,
      "text": " relates to Israel as a nation."
    },
    {
      "id": 143,
      "start": 1153.219970703125,
      "end": 1159.219970703125,
      "text": " Really the fullness of this prophecy that is given, the fullness of the blessings of"
    },
    {
      "id": 144,
      "start": 1159.219970703125,
      "end": 1164.6599731445312,
      "text": " this new covenant, we understand that they'll be fully experienced by Israel during the"
    },
    {
      "id": 145,
      "start": 1164.6599731445312,
      "end": 1167.2999877929688,
      "text": " millennial reign of Christ."
    },
    {
      "id": 146,
      "start": 1167.2999877929688,
      "end": 1173.5800170898438,
      "text": " That's when the fullness of this new covenant will be experienced by the house of Israel."
    },
    {
      "id": 147,
      "start": 1173.5800170898438,
      "end": 1178.8200073242188,
      "text": " Notice that there, as I mentioned in verse number 33, when he said, after those days."
    },
    {
      "id": 148,
      "start": 1178.8200073242188,
      "end": 1179.8200073242188,
      "text": " What's he speaking of?"
    },
    {
      "id": 149,
      "start": 1179.8200073242188,
      "end": 1184.97998046875,
      "text": " Well, if you go back to chapter number 30 of the book of Jeremiah, notice what is said"
    },
    {
      "id": 150,
      "start": 1184.97998046875,
      "end": 1187.2999877929688,
      "text": " in verse number 7."
    },
    {
      "id": 151,
      "start": 1187.2999877929688,
      "end": 1193.4600219726562,
      "text": " In Jeremiah 30 and verse number 7, the Bible says this, Alas, for that day is great so"
    },
    {
      "id": 152,
      "start": 1193.4600219726562,
      "end": 1195.3800048828125,
      "text": " that none is like it."
    },
    {
      "id": 153,
      "start": 1195.3800048828125,
      "end": 1200.1799926757812,
      "text": " It is even, notice this phrase, the time of Jacob's trial."
    },
    {
      "id": 0,
      "start": 1200.1799926757812,
      "end": 1204.6999926567078,
      "text": " Trouble, but he shall be saved out of it"
    },
    {
      "id": 1,
      "start": 1205.3399925231934,
      "end": 1207.3399925231934,
      "text": " You know he's talking about talking about the tribulation"
    },
    {
      "id": 2,
      "start": 1208.1399927139282,
      "end": 1214.2999925613403,
      "text": " Seven year period that we refer to as the day of Jacob's trouble. Who's Jacob? What was his name changed to?"
    },
    {
      "id": 3,
      "start": 1214.699993133545,
      "end": 1220.9599933624268,
      "text": " Israel right is the so we find that as we look here at the passage of Scripture in Jeremiah 30 in"
    },
    {
      "id": 4,
      "start": 1221.3399925231934,
      "end": 1228.4199924468994,
      "text": " View in verse number seven is the tribulation the time of Israel or Jacob's trouble as it's mentioned there"
    },
    {
      "id": 5,
      "start": 1229.139991760254,
      "end": 1236.1799926757812,
      "text": " Specifically and so we see that that's the period of tribulation and then in Jeremiah chapter number 31 in verses 31 through 34"
    },
    {
      "id": 6,
      "start": 1236.4599914550781,
      "end": 1238.5799942016602,
      "text": " He begins to talk about this new covenant"
    },
    {
      "id": 7,
      "start": 1238.5799942016602,
      "end": 1245.5799942016602,
      "text": " He gives us the timeline after those days that seven-year tribulation period there will be the millennial"
    },
    {
      "id": 8,
      "start": 1245.9399909973145,
      "end": 1247.9399909973145,
      "text": " reign of Christ and"
    },
    {
      "id": 9,
      "start": 1248.4599914550781,
      "end": 1253.0799942016602,
      "text": " That's when the fullness of this new covenant will be"
    },
    {
      "id": 10,
      "start": 1253.639991760254,
      "end": 1259.7799911499023,
      "text": " Experienced by the house of Israel now the Bible is awesome. Go over to Romans chapter 11"
    },
    {
      "id": 11,
      "start": 1260.5599937438965,
      "end": 1266.5999908447266,
      "text": " Because really when we get to see all that's happening here. We begin to now keep your place in Hebrews"
    },
    {
      "id": 12,
      "start": 1266.5999908447266,
      "end": 1270.8399963378906,
      "text": " We're gonna get back there and I promise we're gonna look at the rest of the passage of Scripture"
    },
    {
      "id": 13,
      "start": 1270.8399963378906,
      "end": 1276.479995727539,
      "text": " But it's important for us to understand the specifics of this new covenant and how it relates to Israel"
    },
    {
      "id": 14,
      "start": 1276.479995727539,
      "end": 1280.239990234375,
      "text": " but what happened so that Israel wasn't the"
    },
    {
      "id": 15,
      "start": 1280.7199935913086,
      "end": 1287.239990234375,
      "text": " Immediate recipient of all of these things they resisted and rejected Messiah"
    },
    {
      "id": 16,
      "start": 1288.759994506836,
      "end": 1290.759994506836,
      "text": " Israel as a nation"
    },
    {
      "id": 17,
      "start": 1291.359992980957,
      "end": 1295.239990234375,
      "text": " Rejected Messiah. What did they say? We have no king"
    },
    {
      "id": 18,
      "start": 1295.9999923706055,
      "end": 1299.8999938964844,
      "text": " Right. What did they say crucify him, right?"
    },
    {
      "id": 19,
      "start": 1300.1199951171875,
      "end": 1306.359992980957,
      "text": " So they said they rejected Messiah not every individual Jewish person rejected Messiah"
    },
    {
      "id": 20,
      "start": 1306.3999938964844,
      "end": 1308.3999938964844,
      "text": " But as a nation"
    },
    {
      "id": 21,
      "start": 1308.639991760254,
      "end": 1312.0399932861328,
      "text": " Corporately or collectively the nation of Israel"
    },
    {
      "id": 22,
      "start": 1312.4399948120117,
      "end": 1317.479995727539,
      "text": " Rejected their Messiah, by the way, there are still Jewish people that get saved today"
    },
    {
      "id": 23,
      "start": 1318.5199890136719,
      "end": 1323.5599899291992,
      "text": " But they have to be saved the way that we are saved through the gospel of Jesus Christ"
    },
    {
      "id": 24,
      "start": 1323.5599899291992,
      "end": 1329.9199981689453,
      "text": " There are false teachers that would proclaim that just because you're of Jewish descent that you're a child of God"
    },
    {
      "id": 25,
      "start": 1329.9199981689453,
      "end": 1331.6399993896484,
      "text": " And you don't have to worry about it"
    },
    {
      "id": 26,
      "start": 1331.6399993896484,
      "end": 1336.6399993896484,
      "text": " That is a heresy from the pit of hell that will condemn people to eternal damnation"
    },
    {
      "id": 27,
      "start": 1337.8799896240234,
      "end": 1338.9599914550781,
      "text": " Amen"
    },
    {
      "id": 28,
      "start": 1338.9599914550781,
      "end": 1343.7999877929688,
      "text": " the reality is that even to this very day as a"
    },
    {
      "id": 29,
      "start": 1344.479995727539,
      "end": 1350.4399871826172,
      "text": " Nation the Jewish people reject that Jesus Christ is the Messiah"
    },
    {
      "id": 30,
      "start": 1351.1999969482422,
      "end": 1353.719985961914,
      "text": " There are individuals that are getting saved today"
    },
    {
      "id": 31,
      "start": 1354.0399932861328,
      "end": 1357.9599914550781,
      "text": " You're seeing you there are Jewish believers and we're thankful for that"
    },
    {
      "id": 32,
      "start": 1358.1999969482422,
      "end": 1364.4399871826172,
      "text": " Remember the gospel is the power of God unto salvation to the Jew first and then also to the Greek right to the Gentile"
    },
    {
      "id": 33,
      "start": 1364.9199981689453,
      "end": 1370.1599884033203,
      "text": " And so as we look in Romans chapter 11, and I hope to package all this together for you this morning"
    },
    {
      "id": 34,
      "start": 1370.1599884033203,
      "end": 1375.1599884033203,
      "text": " It's a whole lot, but I trust we can get through it in verse number 16. We're gonna kind of start there"
    },
    {
      "id": 35,
      "start": 1375.1599884033203,
      "end": 1378.239990234375,
      "text": " We could look at the entirety of the chapter, but for sake of time"
    },
    {
      "id": 36,
      "start": 1378.239990234375,
      "end": 1380.9399871826172,
      "text": " Let me jump in in verse number 16 of Romans 11"
    },
    {
      "id": 37,
      "start": 1381.4199981689453,
      "end": 1386.6199951171875,
      "text": " It says for if the first fruit be holy the lump is also holy and if the root be holy"
    },
    {
      "id": 38,
      "start": 1386.6199951171875,
      "end": 1394.259994506836,
      "text": " So are the branches and if some of the branches be broken off and thou being a wild olive tree"
    },
    {
      "id": 39,
      "start": 1394.259994506836,
      "end": 1399.8199920654297,
      "text": " work graft in among them and with them partake gist of the root and"
    },
    {
      "id": 40,
      "start": 1400.7799987792969,
      "end": 1402.6999969482422,
      "text": " fatness of the olive tree"
    },
    {
      "id": 41,
      "start": 1402.6999969482422,
      "end": 1405.4199981689453,
      "text": " Says in verse number 18 boasts not against the branches"
    },
    {
      "id": 42,
      "start": 1405.4199981689453,
      "end": 1408.1799926757812,
      "text": " But if thou boasts thou bearest not the root but the root thee"
    },
    {
      "id": 43,
      "start": 1408.5399932861328,
      "end": 1414.2999877929688,
      "text": " Thou will say then the branches were broken off that I might be graft in you say what in the world is he talking about?"
    },
    {
      "id": 44,
      "start": 1414.7799987792969,
      "end": 1419.6999969482422,
      "text": " He's talking about the house of Israel the Jewish people and the Gentiles"
    },
    {
      "id": 45,
      "start": 1420.8999938964844,
      "end": 1424.4199981689453,
      "text": " We find that the explanation is can I'm looking verse number 20 well"
    },
    {
      "id": 46,
      "start": 1425.8199920654297,
      "end": 1427.4599914550781,
      "text": " because of"
    },
    {
      "id": 47,
      "start": 1427.4599914550781,
      "end": 1428.5399932861328,
      "text": " unbelief"
    },
    {
      "id": 48,
      "start": 1428.5399932861328,
      "end": 1429.8999938964844,
      "text": " they"
    },
    {
      "id": 49,
      "start": 1429.8999938964844,
      "end": 1434.4599914550781,
      "text": " Circle it underline it make sure you understand they were broken off"
    },
    {
      "id": 50,
      "start": 1434.4599914550781,
      "end": 1437.9599914550781,
      "text": " What was he referring to earlier that were broken off the branches?"
    },
    {
      "id": 51,
      "start": 1437.9599914550781,
      "end": 1443.979995727539,
      "text": " He's using this illustration of this olive tree and he's talking about the branches that are broken off"
    },
    {
      "id": 52,
      "start": 1443.979995727539,
      "end": 1449.979995727539,
      "text": " And then he says they the branches were broken off because why because of unbelief"
    },
    {
      "id": 53,
      "start": 1450.6599884033203,
      "end": 1454.739990234375,
      "text": " Who's they that's the Jewish people Israel as a nation?"
    },
    {
      "id": 54,
      "start": 1455.0199890136719,
      "end": 1460.2200012207031,
      "text": " And so we find that it continues in verse number 20 and it says and thou"
    },
    {
      "id": 55,
      "start": 1461.2999877929688,
      "end": 1465.6199951171875,
      "text": " Standest by faith. So you see there's a contrast between they and thou"
    },
    {
      "id": 56,
      "start": 1466.4199829101562,
      "end": 1470.6600036621094,
      "text": " We then find at the end of verse number 20. It says be not high-minded"
    },
    {
      "id": 57,
      "start": 1472.1399841308594,
      "end": 1474.1399841308594,
      "text": " But fear"
    },
    {
      "id": 58,
      "start": 1474.9400024414062,
      "end": 1479.5399780273438,
      "text": " Verse 21 for if God spared not the natural branches"
    },
    {
      "id": 59,
      "start": 1480.1000061035156,
      "end": 1483.1399841308594,
      "text": " Take heed lest he also spare not thee"
    },
    {
      "id": 60,
      "start": 1484.1399841308594,
      "end": 1486.5399780273438,
      "text": " This is the warning verse 22 behold"
    },
    {
      "id": 61,
      "start": 1486.5399780273438,
      "end": 1492.6999816894531,
      "text": " Therefore the goodness and severity of God on them which fell severity, but toward thee"
    },
    {
      "id": 62,
      "start": 1493.3399963378906,
      "end": 1499.4199829101562,
      "text": " goodness if thou continue in his goodness, otherwise thou also shall be cut off and"
    },
    {
      "id": 63,
      "start": 1499.6600036621094,
      "end": 1505.6600036621094,
      "text": " They also if they abide not still in unbelief shall be graft in for God is able to graft them in again"
    },
    {
      "id": 64,
      "start": 1505.6600036621094,
      "end": 1511.97998046875,
      "text": " And so again in verse number 23 gives the provision for Jewish people to be saved even during this time that we call the church age"
    },
    {
      "id": 65,
      "start": 1513.3399963378906,
      "end": 1519.8999938964844,
      "text": " And we find here that it continues in verse 24 for if thou were cut out of the olive tree, which is by"
    },
    {
      "id": 66,
      "start": 1520.4199829101562,
      "end": 1527.2200012207031,
      "text": " Wild which is wild by nature and were graft contrary to nature into a good olive tree"
    },
    {
      "id": 67,
      "start": 1527.2999877929688,
      "end": 1533.6199951171875,
      "text": " How much more shall these which be the natural branches be graft into?"
    },
    {
      "id": 68,
      "start": 1533.8200073242188,
      "end": 1539.8599853515625,
      "text": " Their own olive tree it makes sense, right and he's using this he's going through he's given this explanation"
    },
    {
      "id": 69,
      "start": 1539.8599853515625,
      "end": 1547.0199890136719,
      "text": " and then you come to verses 25 and 26 and you see the fullness again of the truth of the millennial reign of Christ and"
    },
    {
      "id": 70,
      "start": 1547.1000061035156,
      "end": 1554.2999877929688,
      "text": " Understanding God's timeline. It says in verse number 25 for I would not brethren that you should be ignorant of this mystery"
    },
    {
      "id": 71,
      "start": 1555.5,
      "end": 1559.6999816894531,
      "text": " God wants us to be informed. He doesn't want us to be ignorant. He doesn't want us to be in the dark"
    },
    {
      "id": 72,
      "start": 1560.1399841308594,
      "end": 1565.9400024414062,
      "text": " He wants us to understand his plan for the ages and we find that as he's giving this instruction"
    },
    {
      "id": 73,
      "start": 1566.4599914550781,
      "end": 1568.5799865722656,
      "text": " That he mentions right within the text"
    },
    {
      "id": 74,
      "start": 1568.5799865722656,
      "end": 1573.1799926757812,
      "text": " I don't want you to be ignorant of this and we find that as he would speak about the mystery"
    },
    {
      "id": 75,
      "start": 1573.1799926757812,
      "end": 1575.0199890136719,
      "text": " remember the Apostle Paul uses the"
    },
    {
      "id": 76,
      "start": 1575.0199890136719,
      "end": 1576.2200012207031,
      "text": " phraseology of mystery"
    },
    {
      "id": 77,
      "start": 1576.2200012207031,
      "end": 1580.6199951171875,
      "text": " Paul's the human author here of the book of Romans in the book of Ephesians when he talks about the mystery"
    },
    {
      "id": 78,
      "start": 1580.6199951171875,
      "end": 1585.5799865722656,
      "text": " What's he talking about the church? That's gonna be made up of Jew and Gentile right in the church"
    },
    {
      "id": 79,
      "start": 1586.6999816894531,
      "end": 1589.2999877929688,
      "text": " Right, we're the church. What a blessing"
    },
    {
      "id": 80,
      "start": 1590.1000061035156,
      "end": 1592.2200012207031,
      "text": " We find that it says in verse number 25"
    },
    {
      "id": 81,
      "start": 1592.9400024414062,
      "end": 1596.4199829101562,
      "text": " It says lest he should be wise in your own conceits"
    },
    {
      "id": 82,
      "start": 1596.9400024414062,
      "end": 1604.8200073242188,
      "text": " Notice this that blindness in part is happened to Israel until the fullness of the Gentiles"
    },
    {
      "id": 83,
      "start": 1605.8999938964844,
      "end": 1607.8200073242188,
      "text": " become in"
    },
    {
      "id": 84,
      "start": 1607.8200073242188,
      "end": 1611.6199951171875,
      "text": " Do you remember John 9 the healing of the man that was born blind?"
    },
    {
      "id": 85,
      "start": 1612.1000061035156,
      "end": 1618.3399963378906,
      "text": " There's a great discourse that takes place there in John chapter 9. This man was born blind the disciples immediately say hey"
    },
    {
      "id": 86,
      "start": 1618.3399963378906,
      "end": 1621.0599975585938,
      "text": " Who sinned his parents or him? I mean he was born blind. What's going on?"
    },
    {
      "id": 87,
      "start": 1621.0599975585938,
      "end": 1625.8999938964844,
      "text": " They go through this whole process. The man is healed and he's in just"
    },
    {
      "id": 88,
      "start": 1626.4199829101562,
      "end": 1631.3800048828125,
      "text": " Interrogated by the Jewish leaders of the day as to what happened. How did this happen?"
    },
    {
      "id": 89,
      "start": 1631.3800048828125,
      "end": 1636.3399963378906,
      "text": " He's like look I've told you I've told you and I've told you a man named Jesus. Here's what he did"
    },
    {
      "id": 90,
      "start": 1636.3800048828125,
      "end": 1641.1799926757812,
      "text": " He healed me and you go through the passage and you begin to see how that this man"
    },
    {
      "id": 91,
      "start": 1641.1799926757812,
      "end": 1646.8399963378906,
      "text": " Of course, he's excommunicated because he is gonna be a disciple of Jesus and he says if I tell you again"
    },
    {
      "id": 92,
      "start": 1646.8399963378906,
      "end": 1652.1600036621094,
      "text": " Are you gonna become his disciples and they're full with rage because we are the disciples of Moses, right?"
    },
    {
      "id": 93,
      "start": 1652.1600036621094,
      "end": 1656.3999938964844,
      "text": " I mean, they're not just having it right? They don't want anything to do with it and then"
    },
    {
      "id": 94,
      "start": 1657.5199890136719,
      "end": 1660.47998046875,
      "text": " Some of the Jewish people say to Jesus are we blind also?"
    },
    {
      "id": 95,
      "start": 1661.239990234375,
      "end": 1663.239990234375,
      "text": " The answer was yes"
    },
    {
      "id": 96,
      "start": 1663.4400024414062,
      "end": 1667.7599792480469,
      "text": " Not that you're blind physically, but you're blind spiritually"
    },
    {
      "id": 97,
      "start": 1668.1600036621094,
      "end": 1673.1999816894531,
      "text": " Remember what it says to us in 2nd Corinthians chapter number 4 the God of this world have blinded the minds of them that believe"
    },
    {
      "id": 98,
      "start": 1673.5599975585938,
      "end": 1679.2799987792969,
      "text": " Lest the light of the glorious gospel should shine in unto them, right? The enemy is in the process of"
    },
    {
      "id": 99,
      "start": 1680.2799987792969,
      "end": 1683.6799926757812,
      "text": " Blinding and we find that he does that not just for Jews"
    },
    {
      "id": 100,
      "start": 1683.6799926757812,
      "end": 1686.6999816894531,
      "text": " But for Gentiles alike this this work that he does of blinding"
    },
    {
      "id": 101,
      "start": 1686.6999816894531,
      "end": 1693.3800048828125,
      "text": " But we find here the Bible says that blindness in part is happened to Israel into the fullness of the Gentiles become in"
    },
    {
      "id": 102,
      "start": 1694.5,
      "end": 1696.5799865722656,
      "text": " So because Israel rejected Messiah"
    },
    {
      "id": 103,
      "start": 1697.5399780273438,
      "end": 1702.1000061035156,
      "text": " The Church Age as we often refer to it as has been"
    },
    {
      "id": 104,
      "start": 1702.4599914550781,
      "end": 1707.4199829101562,
      "text": " Established and here we are in this opportunity to receive the blessing"
    },
    {
      "id": 105,
      "start": 1707.4199829101562,
      "end": 1710.4599914550781,
      "text": " Notice it says into the fullness of the Gentiles become in"
    },
    {
      "id": 106,
      "start": 1710.6199951171875,
      "end": 1717.3800048828125,
      "text": " It talks about the blessing that we receive and what a blessing it is to know the Lord Jesus Christ is our personal Savior"
    },
    {
      "id": 107,
      "start": 1717.3800048828125,
      "end": 1718.97998046875,
      "text": " And it says in verse number 26"
    },
    {
      "id": 108,
      "start": 1718.97998046875,
      "end": 1725.4600219726562,
      "text": " And so all Israel shall be saved as it is written there shall come out a sign to deliver and shall turn away"
    },
    {
      "id": 109,
      "start": 1725.7799682617188,
      "end": 1732.5,
      "text": " Ungodliness from Jacob for this is my covenant unto them when I shall take away their sins"
    },
    {
      "id": 110,
      "start": 1732.6599731445312,
      "end": 1734.6599731445312,
      "text": " What's the referring to the new covenant?"
    },
    {
      "id": 111,
      "start": 1735.0599975585938,
      "end": 1736.6599731445312,
      "text": " Here's where people get messed up"
    },
    {
      "id": 112,
      "start": 1736.6599731445312,
      "end": 1740.739990234375,
      "text": " They look at verse number 26 and it says so all Israel shall be saved and they say there you go seals the deal"
    },
    {
      "id": 113,
      "start": 1740.8200073242188,
      "end": 1743.2999877929688,
      "text": " No, no at the time of the Millennium"
    },
    {
      "id": 114,
      "start": 1744.8200073242188,
      "end": 1748.7799682617188,
      "text": " Because here's what's gonna happen if I can just kind of overview it very quickly"
    },
    {
      "id": 115,
      "start": 1749.3399658203125,
      "end": 1755.0999755859375,
      "text": " At some point and I believe soon the trumpet of the Lord is gonna sound and we're gonna be raptured out of here"
    },
    {
      "id": 116,
      "start": 1755.4600219726562,
      "end": 1761.8599853515625,
      "text": " That is the next event on God's prophetic calendar. Amen the snatching away of the Saints the rapture"
    },
    {
      "id": 117,
      "start": 1762.7799682617188,
      "end": 1767.7000122070312,
      "text": " We can read of that in 1st Thessalonians chapter 4 and we can understand the truth that is contained therein"
    },
    {
      "id": 118,
      "start": 1767.97998046875,
      "end": 1771.1400146484375,
      "text": " With regard to the rapture immediately following the rapture of the church"
    },
    {
      "id": 119,
      "start": 1771.8200073242188,
      "end": 1774.8599853515625,
      "text": " Immediately the timeline starts for the seven-year tribulation"
    },
    {
      "id": 120,
      "start": 1775.5,
      "end": 1778.7000122070312,
      "text": " You can read of that in Revelation. You can read of all of the"
    },
    {
      "id": 121,
      "start": 1779.4199829101562,
      "end": 1784.2999877929688,
      "text": " Judgments that will be unfolded and just I mean it is gonna be a terrible time upon earth"
    },
    {
      "id": 122,
      "start": 1784.739990234375,
      "end": 1787.3800048828125,
      "text": " But here's what's happening if I can use this analogy"
    },
    {
      "id": 123,
      "start": 1788.02001953125,
      "end": 1793.0599975585938,
      "text": " God for this period that we call the church age if we could pretend that there's a stove top here"
    },
    {
      "id": 124,
      "start": 1793.0599975585938,
      "end": 1799.739990234375,
      "text": " He's taken Israel and he's put him on the back burner and he's dealing with the church right now as the church age"
    },
    {
      "id": 0,
      "start": 1799.739990234375,
      "end": 1806.739990234375,
      "text": " But once the rapture takes place, the church is removed, amen, now Israel comes to the"
    },
    {
      "id": 1,
      "start": 1806.739990234375,
      "end": 1809.819990158081,
      "text": " front burner, if I can use that analogy."
    },
    {
      "id": 2,
      "start": 1809.819990158081,
      "end": 1815.4999904632568,
      "text": " And what's happening is we see in Jeremiah 30, verse number 7, this is the time of Jacob's"
    },
    {
      "id": 3,
      "start": 1815.4999904632568,
      "end": 1816.899990081787,
      "text": " trouble."
    },
    {
      "id": 4,
      "start": 1816.899990081787,
      "end": 1821.0199909210205,
      "text": " That seven year period of time that we refer to as the tribulation, what is God doing?"
    },
    {
      "id": 5,
      "start": 1821.0199909210205,
      "end": 1824.6799907684326,
      "text": " He's dealing with Israel as a nation."
    },
    {
      "id": 6,
      "start": 1824.6799907684326,
      "end": 1830.399990081787,
      "text": " And as he's dealing with Israel as a nation, then comes at the end of the tribulation,"
    },
    {
      "id": 7,
      "start": 1830.399990081787,
      "end": 1833.799991607666,
      "text": " the return of Christ, the battle of Armageddon, you read of all of those things that take"
    },
    {
      "id": 8,
      "start": 1833.799991607666,
      "end": 1839.0399894714355,
      "text": " place there throughout the book of Revelation, and then you find the millennial reign of"
    },
    {
      "id": 9,
      "start": 1839.0399894714355,
      "end": 1840.0399894714355,
      "text": " Christ."
    },
    {
      "id": 10,
      "start": 1840.0399894714355,
      "end": 1844.5599899291992,
      "text": " And it's at that point that we see the fullness of this new covenant."
    },
    {
      "id": 11,
      "start": 1844.5599899291992,
      "end": 1849.4399909973145,
      "text": " And so it's important that we understand the prophecy in Jeremiah, the truth in Romans"
    },
    {
      "id": 12,
      "start": 1849.4399909973145,
      "end": 1855.1599884033203,
      "text": " chapter 11, as we take and unfold that which is given to us here in Hebrews chapter number"
    },
    {
      "id": 13,
      "start": 1855.1599884033203,
      "end": 1856.239990234375,
      "text": " 8."
    },
    {
      "id": 14,
      "start": 1856.239990234375,
      "end": 1860.3599891662598,
      "text": " Because the reality is that when we speak about this new covenant, and we think about"
    },
    {
      "id": 15,
      "start": 1860.3599891662598,
      "end": 1867.2999877929688,
      "text": " the specifics that it is with regard how it relates to Israel as a nation, is one aspect"
    },
    {
      "id": 16,
      "start": 1867.2999877929688,
      "end": 1868.7199935913086,
      "text": " of what we have to consider."
    },
    {
      "id": 17,
      "start": 1868.7199935913086,
      "end": 1872.639991760254,
      "text": " Now go back to Hebrews chapter number 8, we won't go back to the book of Jeremiah, you"
    },
    {
      "id": 18,
      "start": 1872.639991760254,
      "end": 1876.839988708496,
      "text": " might want to keep your place there in Romans 11, I may go back in just a moment, it depends"
    },
    {
      "id": 19,
      "start": 1876.839988708496,
      "end": 1878.639991760254,
      "text": " on how the time goes."
    },
    {
      "id": 20,
      "start": 1878.639991760254,
      "end": 1883.1999893188477,
      "text": " Let me mention here five aspects, if you will, that are given to us with regard to"
    },
    {
      "id": 21,
      "start": 1883.1999893188477,
      "end": 1888.119987487793,
      "text": " the specifics of this new covenant in verses 10 down through verse number 12."
    },
    {
      "id": 22,
      "start": 1888.119987487793,
      "end": 1894.2799911499023,
      "text": " Notice, for this is the covenant that I will make with the house of Israel after those"
    },
    {
      "id": 23,
      "start": 1894.2799911499023,
      "end": 1896.5199890136719,
      "text": " days, saith the Lord."
    },
    {
      "id": 24,
      "start": 1896.5199890136719,
      "end": 1900.1599884033203,
      "text": " Again, this is a quote from what we see in Jeremiah 31."
    },
    {
      "id": 25,
      "start": 1900.1599884033203,
      "end": 1906.239990234375,
      "text": " Notice it says, I will put my laws into their mind and write them in their hearts."
    },
    {
      "id": 26,
      "start": 1906.239990234375,
      "end": 1911.0399932861328,
      "text": " So that's the first aspect, specific, if you will, with regard to this new covenant,"
    },
    {
      "id": 27,
      "start": 1911.0399932861328,
      "end": 1915.0399932861328,
      "text": " and opposed to being a table of stone, which would have been the old covenant."
    },
    {
      "id": 28,
      "start": 1915.0399932861328,
      "end": 1919.359992980957,
      "text": " And you understand, really, this is through the work of the Holy Spirit."
    },
    {
      "id": 29,
      "start": 1919.359992980957,
      "end": 1923.839988708496,
      "text": " We find that it continues in verse number 10, it says, I will be to them a God, and"
    },
    {
      "id": 30,
      "start": 1923.839988708496,
      "end": 1927.0399932861328,
      "text": " they shall be to me a people."
    },
    {
      "id": 31,
      "start": 1927.0399932861328,
      "end": 1930.759994506836,
      "text": " And we'll look at some of these things here as we get through and begin to see not only"
    },
    {
      "id": 32,
      "start": 1930.759994506836,
      "end": 1933.9199829101562,
      "text": " how it relates to Israel, but how it relates to us today."
    },
    {
      "id": 33,
      "start": 1933.9199829101562,
      "end": 1937.499984741211,
      "text": " Notice in verse number 11, they shall not teach every man his neighbor and every man"
    },
    {
      "id": 34,
      "start": 1937.499984741211,
      "end": 1943.0399932861328,
      "text": " his brother, saying, Know the Lord, for all shall know me from the least to the greatest."
    },
    {
      "id": 35,
      "start": 1943.0399932861328,
      "end": 1945.5199890136719,
      "text": " Can I tell you, that's not the case today, right?"
    },
    {
      "id": 36,
      "start": 1945.5199890136719,
      "end": 1947.9599914550781,
      "text": " Do you know that that's not the case today?"
    },
    {
      "id": 37,
      "start": 1947.9599914550781,
      "end": 1953.5599975585938,
      "text": " And so therefore, we understand that this new covenant in its fullness, in its entirety,"
    },
    {
      "id": 38,
      "start": 1953.5599975585938,
      "end": 1955.8399963378906,
      "text": " we're not experiencing this yet."
    },
    {
      "id": 39,
      "start": 1955.8399963378906,
      "end": 1962.239990234375,
      "text": " Notice in verse number 12, for I will be merciful to their unrighteousness, and it says this"
    },
    {
      "id": 40,
      "start": 1962.239990234375,
      "end": 1968.479995727539,
      "text": " in really the fifth aspect, and their sins and their iniquities will I remember no more."
    },
    {
      "id": 41,
      "start": 1968.479995727539,
      "end": 1974.2799835205078,
      "text": " As we begin to think about these aspects and the specifics of this new covenant as it's"
    },
    {
      "id": 42,
      "start": 1974.2799835205078,
      "end": 1978.9599914550781,
      "text": " given here in Hebrews chapter number 8, again, remember, he's writing and he's helping these"
    },
    {
      "id": 43,
      "start": 1978.9599914550781,
      "end": 1983.0799865722656,
      "text": " believers understand that we have a high priest."
    },
    {
      "id": 44,
      "start": 1983.0799865722656,
      "end": 1989.3999938964844,
      "text": " He ministers in a better place, he has presented a better offering, he offered himself, and"
    },
    {
      "id": 45,
      "start": 1989.3999938964844,
      "end": 1993.1599884033203,
      "text": " then he begins to talk about the fact that he has obtained a more excellent ministry."
    },
    {
      "id": 46,
      "start": 1993.1599884033203,
      "end": 1994.1599884033203,
      "text": " Why?"
    },
    {
      "id": 47,
      "start": 1994.1599884033203,
      "end": 1996.5999908447266,
      "text": " Because he's the mediator of a better covenant."
    },
    {
      "id": 48,
      "start": 1996.5999908447266,
      "end": 1998.719985961914,
      "text": " It begins to unfold this."
    },
    {
      "id": 49,
      "start": 1998.719985961914,
      "end": 2004.0399932861328,
      "text": " Now, as we understand how the new covenant relates to Israel, it's also important for"
    },
    {
      "id": 50,
      "start": 2004.0399932861328,
      "end": 2008.1599884033203,
      "text": " us to understand how it relates to individual believers today."
    },
    {
      "id": 51,
      "start": 2008.1599884033203,
      "end": 2013.3599853515625,
      "text": " Yes, it relates to Israel as a nation, we see it in its fullness as we've gone through"
    },
    {
      "id": 52,
      "start": 2013.3599853515625,
      "end": 2017.9599914550781,
      "text": " great lengths to deal with that this morning, but we must also understand that this new"
    },
    {
      "id": 53,
      "start": 2017.9599914550781,
      "end": 2022.1199951171875,
      "text": " covenant relates to individual believers today."
    },
    {
      "id": 54,
      "start": 2022.1199951171875,
      "end": 2023.6399841308594,
      "text": " How do we know that?"
    },
    {
      "id": 55,
      "start": 2023.6399841308594,
      "end": 2029.3199920654297,
      "text": " Well, let me mention what Paul says in 2 Corinthians chapter 3 and verse number 6."
    },
    {
      "id": 56,
      "start": 2029.3199920654297,
      "end": 2035.719985961914,
      "text": " He says, who also hath made us able ministers of the New Testament, the new covenant."
    },
    {
      "id": 57,
      "start": 2035.719985961914,
      "end": 2042.6799926757812,
      "text": " So if God hath made us able ministers of this new covenant, we understand that there are"
    },
    {
      "id": 58,
      "start": 2042.6799926757812,
      "end": 2047.479995727539,
      "text": " aspects of this new covenant that relate to us today as individual believers."
    },
    {
      "id": 59,
      "start": 2047.479995727539,
      "end": 2052.1599884033203,
      "text": " Again, we must understand the church is not spiritual Israel."
    },
    {
      "id": 60,
      "start": 2052.1599884033203,
      "end": 2055.959991455078,
      "text": " When you go down that path, you start really messing up all kinds of things, and it becomes"
    },
    {
      "id": 61,
      "start": 2055.959991455078,
      "end": 2062.239990234375,
      "text": " very challenging to interpret Scripture properly, and if you understand that Israel is a separate"
    },
    {
      "id": 62,
      "start": 2062.239990234375,
      "end": 2068.759979248047,
      "text": " entity in its entirety from the church, and the church now, as we look at the blessings"
    },
    {
      "id": 63,
      "start": 2069.279998779297,
      "end": 2076.1199951171875,
      "text": " as how this new covenant relates to the individual believers, we can understand the blessings"
    },
    {
      "id": 64,
      "start": 2076.1199951171875,
      "end": 2077.7999877929688,
      "text": " of salvation."
    },
    {
      "id": 65,
      "start": 2077.7999877929688,
      "end": 2081.3599853515625,
      "text": " Remember in Romans chapter 11, as we looked at the passage of Scripture, it spoke about"
    },
    {
      "id": 66,
      "start": 2081.3599853515625,
      "end": 2086.279998779297,
      "text": " the fact how we were graft in, and you understand that because of the rejection, because of"
    },
    {
      "id": 67,
      "start": 2086.279998779297,
      "end": 2092.5999755859375,
      "text": " their unbelief, then we that were wild, that we were from that wild olive tree, that we"
    },
    {
      "id": 68,
      "start": 2092.5999755859375,
      "end": 2098.9199829101562,
      "text": " were graft in, and therefore we get to enjoy the blessings of salvation even today as individual"
    },
    {
      "id": 69,
      "start": 2098.9199829101562,
      "end": 2100.5999755859375,
      "text": " believers."
    },
    {
      "id": 70,
      "start": 2100.5999755859375,
      "end": 2106.1600036621094,
      "text": " Consider with me the Holy Spirit of God, how He works, and how He has given one of His"
    },
    {
      "id": 71,
      "start": 2106.1600036621094,
      "end": 2109.47998046875,
      "text": " roles as being the divine teacher."
    },
    {
      "id": 72,
      "start": 2109.47998046875,
      "end": 2111.0799865722656,
      "text": " He leads us into all truth."
    },
    {
      "id": 73,
      "start": 2111.0799865722656,
      "end": 2115.279998779297,
      "text": " It's one of the responsibilities and roles of the Holy Spirit of God."
    },
    {
      "id": 74,
      "start": 2115.279998779297,
      "end": 2118.3599853515625,
      "text": " Consider that there in Hebrews 8, it talks about the fact that I will be to them a God"
    },
    {
      "id": 75,
      "start": 2118.3599853515625,
      "end": 2119.959991455078,
      "text": " and they shall be to me a people."
    },
    {
      "id": 76,
      "start": 2119.959991455078,
      "end": 2123.4400024414062,
      "text": " Aren't you thankful for the truth of John 1 in verse number 12, but as many as received"
    },
    {
      "id": 77,
      "start": 2123.4400024414062,
      "end": 2126.47998046875,
      "text": " Him to them gave He power to become the sons of God."
    },
    {
      "id": 78,
      "start": 2126.47998046875,
      "end": 2130.1199951171875,
      "text": " Aren't you thankful that you can say He is my God?"
    },
    {
      "id": 79,
      "start": 2130.1199951171875,
      "end": 2134.4400024414062,
      "text": " Deborah sang this morning about my shepherd, the Lord is my shepherd."
    },
    {
      "id": 80,
      "start": 2134.4400024414062,
      "end": 2140.199981689453,
      "text": " Aren't you thankful this morning that we as Gentiles, that we can understand the blessings"
    },
    {
      "id": 81,
      "start": 2140.199981689453,
      "end": 2148.0,
      "text": " of this new covenant by way of salvation, because of what was accomplished at Calvary?"
    },
    {
      "id": 82,
      "start": 2148.0399780273438,
      "end": 2153.4400024414062,
      "text": " Again, the fullness of the new covenant will not be realized until the millennial reign"
    },
    {
      "id": 83,
      "start": 2153.4400024414062,
      "end": 2154.4400024414062,
      "text": " of Christ."
    },
    {
      "id": 84,
      "start": 2154.4400024414062,
      "end": 2158.239990234375,
      "text": " By the way, those of us that are saved will rule and reign with Christ during the millennial"
    },
    {
      "id": 85,
      "start": 2158.239990234375,
      "end": 2159.239990234375,
      "text": " reign of Christ."
    },
    {
      "id": 86,
      "start": 2159.239990234375,
      "end": 2162.6399841308594,
      "text": " We don't have time to get into all that this morning, but it's an amazing truth of the"
    },
    {
      "id": 87,
      "start": 2162.6399841308594,
      "end": 2164.279998779297,
      "text": " Word of God."
    },
    {
      "id": 88,
      "start": 2164.279998779297,
      "end": 2171.519989013672,
      "text": " And we find here that this new covenant that the writer of Hebrews is dealing with and"
    },
    {
      "id": 89,
      "start": 2171.519989013672,
      "end": 2176.3800048828125,
      "text": " addressing and giving these details as we begin to interpret Scripture with Scripture,"
    },
    {
      "id": 90,
      "start": 2176.3800048828125,
      "end": 2180.699981689453,
      "text": " we can rejoice really at this particular time in history."
    },
    {
      "id": 91,
      "start": 2180.699981689453,
      "end": 2186.5,
      "text": " We can rejoice in the plan that God has for the nation of Israel, but we also understand"
    },
    {
      "id": 92,
      "start": 2186.5,
      "end": 2191.2999877929688,
      "text": " that as individual believers today, we are the recipients of these blessings of the new"
    },
    {
      "id": 93,
      "start": 2191.2999877929688,
      "end": 2195.699981689453,
      "text": " covenant through Calvary, through what the Lord Jesus Christ accomplished on the cross"
    },
    {
      "id": 94,
      "start": 2195.699981689453,
      "end": 2196.9400024414062,
      "text": " of Calvary."
    },
    {
      "id": 95,
      "start": 2196.9400024414062,
      "end": 2200.8199768066406,
      "text": " The Apostle Paul often during his ministry in the book of Acts, you'll find that he preaches"
    },
    {
      "id": 96,
      "start": 2200.8199768066406,
      "end": 2204.3999938964844,
      "text": " and teaches that this Jesus is Christ."
    },
    {
      "id": 97,
      "start": 2204.3999938964844,
      "end": 2208.1199951171875,
      "text": " They knew who Jesus was as a human figure."
    },
    {
      "id": 98,
      "start": 2208.1199951171875,
      "end": 2213.759979248047,
      "text": " They understood, many of them in the book of Acts that Paul would minister to, especially"
    },
    {
      "id": 99,
      "start": 2213.759979248047,
      "end": 2217.6799926757812,
      "text": " those that were within the synagogues that he would travel and go to those particular"
    },
    {
      "id": 100,
      "start": 2217.6799926757812,
      "end": 2220.5999755859375,
      "text": " regions and he would first go into the synagogue."
    },
    {
      "id": 101,
      "start": 2220.5999755859375,
      "end": 2226.9199829101562,
      "text": " They would have a knowledge of Jesus, the man that was crucified."
    },
    {
      "id": 102,
      "start": 2226.9199829101562,
      "end": 2232.6799926757812,
      "text": " But he says this Jesus is the Christ, the Messiah, the Promised One."
    },
    {
      "id": 103,
      "start": 2232.6799926757812,
      "end": 2238.239990234375,
      "text": " He is the one that you've been looking for, but you missed it."
    },
    {
      "id": 104,
      "start": 2238.239990234375,
      "end": 2240.3599853515625,
      "text": " You rejected him."
    },
    {
      "id": 105,
      "start": 2240.3599853515625,
      "end": 2249.759979248047,
      "text": " You find that Paul has a great desire to see his brethren, his kinfolk, his Jewish counterparts"
    },
    {
      "id": 106,
      "start": 2249.759979248047,
      "end": 2253.8800048828125,
      "text": " to come to the knowledge of salvation through the Lord Jesus Christ."
    },
    {
      "id": 107,
      "start": 2253.8800048828125,
      "end": 2260.759979248047,
      "text": " But we understand that Paul is often referred to himself as the Apostle to the Gentiles."
    },
    {
      "id": 108,
      "start": 2260.759979248047,
      "end": 2265.8800048828125,
      "text": " So we understand that there, as we look at this passage of Scripture and we can begin"
    },
    {
      "id": 109,
      "start": 2265.8800048828125,
      "end": 2272.759979248047,
      "text": " to think about the prophecy that was given in Jeremiah chapter number 31, that prophecy"
    },
    {
      "id": 110,
      "start": 2272.759979248047,
      "end": 2279.0,
      "text": " still stands true that God is going to make this new covenant in its fullness with the"
    },
    {
      "id": 111,
      "start": 2279.0,
      "end": 2283.8399963378906,
      "text": " house of Israel and the house of Judah during the time of the millennial reign of Christ."
    },
    {
      "id": 112,
      "start": 2283.8399963378906,
      "end": 2289.519989013672,
      "text": " But today, as individual believers, we get to be partakers of these blessings."
    },
    {
      "id": 113,
      "start": 2289.519989013672,
      "end": 2290.519989013672,
      "text": " Why?"
    },
    {
      "id": 114,
      "start": 2291.279998779297,
      "end": 2292.279998779297,
      "text": " Because we are grafted in."
    },
    {
      "id": 115,
      "start": 2292.279998779297,
      "end": 2297.3199768066406,
      "text": " It's a beautiful picture of what we find here for the church age and the blessings"
    },
    {
      "id": 116,
      "start": 2297.3199768066406,
      "end": 2299.47998046875,
      "text": " that we get to receive."
    },
    {
      "id": 117,
      "start": 2299.47998046875,
      "end": 2300.759979248047,
      "text": " What a joy."
    },
    {
      "id": 118,
      "start": 2300.759979248047,
      "end": 2305.47998046875,
      "text": " By the way, it's important for us to understand that God was not in the dark about any of"
    },
    {
      "id": 119,
      "start": 2305.47998046875,
      "end": 2306.47998046875,
      "text": " these things."
    },
    {
      "id": 120,
      "start": 2306.47998046875,
      "end": 2307.720001220703,
      "text": " He knew all of this was going to happen."
    },
    {
      "id": 121,
      "start": 2307.720001220703,
      "end": 2309.959991455078,
      "text": " He knew that his people would reject him."
    },
    {
      "id": 122,
      "start": 2309.959991455078,
      "end": 2314.0,
      "text": " He understood all of these things and he made provision, therefore, as we find as the Bible"
    },
    {
      "id": 123,
      "start": 2314.0,
      "end": 2317.3599853515625,
      "text": " unfolds."
    },
    {
      "id": 124,
      "start": 2317.3599853515625,
      "end": 2323.9199829101562,
      "text": " In this passage of Scripture, we find this truth with regard to the new covenant and"
    },
    {
      "id": 125,
      "start": 2323.9199829101562,
      "end": 2328.5999755859375,
      "text": " we need to understand what Paul said in that passage in 2 Corinthians 3."
    },
    {
      "id": 126,
      "start": 2328.5999755859375,
      "end": 2329.5999755859375,
      "text": " In fact, let's turn back there."
    },
    {
      "id": 127,
      "start": 2329.5999755859375,
      "end": 2333.3999633789062,
      "text": " Let me read that to you again because I want you to understand, okay, this is great that"
    },
    {
      "id": 128,
      "start": 2333.3999633789062,
      "end": 2339.1599731445312,
      "text": " we understand this new covenant and the fact that it's superior because why?"
    },
    {
      "id": 129,
      "start": 2339.1599731445312,
      "end": 2344.9199829101562,
      "text": " Because Jesus is the surety and Jesus is the mediator and we're rejoicing in that and we"
    },
    {
      "id": 130,
      "start": 2344.9199829101562,
      "end": 2348.3999633789062,
      "text": " understand that it's superior and we understand some of the specifics and we've gone through"
    },
    {
      "id": 131,
      "start": 2348.3999633789062,
      "end": 2353.0800170898438,
      "text": " them somewhat quickly this morning, but we unfold and kind of peel back the pages of"
    },
    {
      "id": 132,
      "start": 2353.0800170898438,
      "end": 2357.2799682617188,
      "text": " Scripture and begin to see the plan that God has for the ages."
    },
    {
      "id": 133,
      "start": 2357.2799682617188,
      "end": 2361.5599975585938,
      "text": " But notice what Paul says here in 2 Corinthians 3."
    },
    {
      "id": 134,
      "start": 2361.5599975585938,
      "end": 2368.2000122070312,
      "text": " It's interesting because he says in chapter 4, therefore seeing we have this ministry,"
    },
    {
      "id": 135,
      "start": 2368.2000122070312,
      "end": 2371.4599609375,
      "text": " but notice how he introduces this in chapter 3."
    },
    {
      "id": 136,
      "start": 2371.4599609375,
      "end": 2376.6599731445312,
      "text": " He says in verse number 4, and such trust have we through Christ to Godward, not that"
    },
    {
      "id": 137,
      "start": 2376.6599731445312,
      "end": 2381.0999755859375,
      "text": " we are sufficient of ourselves to think anything as of ourselves, but our sufficiency is of"
    },
    {
      "id": 138,
      "start": 2381.0999755859375,
      "end": 2389.9400024414062,
      "text": " God, who also hath made us able ministers to the New Testament, not of the letter, but"
    },
    {
      "id": 139,
      "start": 2389.9400024414062,
      "end": 2391.4400024414062,
      "text": " of the Spirit."
    },
    {
      "id": 140,
      "start": 2391.4400024414062,
      "end": 2396.1799926757812,
      "text": " For the letter killeth, but the Spirit giveth life."
    },
    {
      "id": 141,
      "start": 2396.1799926757812,
      "end": 2399.7799682617188,
      "text": " As you begin to understand what Paul is saying here, and even as you..."
    },
    {
      "id": 0,
      "start": 2399.7799682617188,
      "end": 2401.859968185425,
      "text": " Compare that with what Paul is giving"
    },
    {
      "id": 1,
      "start": 2401.859968185425,
      "end": 2404.219968318939,
      "text": " to the believers in the region of Galatia"
    },
    {
      "id": 2,
      "start": 2404.219968318939,
      "end": 2405.939968109131,
      "text": " when he speaks about the law"
    },
    {
      "id": 3,
      "start": 2405.939968109131,
      "end": 2408.939968109131,
      "text": " and how that it could not give life."
    },
    {
      "id": 4,
      "start": 2408.939968109131,
      "end": 2411.3399686813354,
      "text": " He says that if there had been a law"
    },
    {
      "id": 5,
      "start": 2411.3399686813354,
      "end": 2413.7799682617188,
      "text": " that was given which could have given life,"
    },
    {
      "id": 6,
      "start": 2413.7799682617188,
      "end": 2416.2799682617188,
      "text": " verily, righteousness should have been by the law."
    },
    {
      "id": 7,
      "start": 2416.2799682617188,
      "end": 2417.7799682617188,
      "text": " But no, it couldn't give life."
    },
    {
      "id": 8,
      "start": 2417.7799682617188,
      "end": 2420.0599689483643,
      "text": " What did the law do? It condemned."
    },
    {
      "id": 9,
      "start": 2420.0599689483643,
      "end": 2423.099967956543,
      "text": " It said you're guilty."
    },
    {
      "id": 10,
      "start": 2423.099967956543,
      "end": 2424.099967956543,
      "text": " Right?"
    },
    {
      "id": 11,
      "start": 2424.099967956543,
      "end": 2427.339967727661,
      "text": " It was a schoolmaster in Galatians 3."
    },
    {
      "id": 12,
      "start": 2427.339967727661,
      "end": 2429.979969024658,
      "text": " We find that here as we looked at that,"
    },
    {
      "id": 13,
      "start": 2429.979969024658,
      "end": 2433.0599670410156,
      "text": " why did we look at the overview of the book of Exodus"
    },
    {
      "id": 14,
      "start": 2433.0599670410156,
      "end": 2434.8999671936035,
      "text": " at the very beginning of the message?"
    },
    {
      "id": 15,
      "start": 2434.8999671936035,
      "end": 2436.659969329834,
      "text": " Because we understand that as the law,"
    },
    {
      "id": 16,
      "start": 2436.659969329834,
      "end": 2438.4599685668945,
      "text": " that first covenant was given,"
    },
    {
      "id": 17,
      "start": 2438.4599685668945,
      "end": 2443.1399688720703,
      "text": " that it was broken straight away."
    },
    {
      "id": 18,
      "start": 2443.1399688720703,
      "end": 2447.3399696350098,
      "text": " Showing that the law condemns."
    },
    {
      "id": 19,
      "start": 2447.3399696350098,
      "end": 2450.1399688720703,
      "text": " But here we find that Paul says"
    },
    {
      "id": 20,
      "start": 2450.1399688720703,
      "end": 2451.8599700927734,
      "text": " that God hath made us."
    },
    {
      "id": 21,
      "start": 2451.8599700927734,
      "end": 2452.8599700927734,
      "text": " He is the One."
    },
    {
      "id": 22,
      "start": 2452.8599700927734,
      "end": 2455.0599670410156,
      "text": " Our sufficiency is of God."
    },
    {
      "id": 23,
      "start": 2455.0599670410156,
      "end": 2456.819969177246,
      "text": " We don't go on our own power."
    },
    {
      "id": 24,
      "start": 2457.3399696350098,
      "end": 2460.0599670410156,
      "text": " We go as we're filled with the power of the Holy Spirit."
    },
    {
      "id": 25,
      "start": 2460.0599670410156,
      "end": 2462.099967956543,
      "text": " In Acts 1 and verse number 8,"
    },
    {
      "id": 26,
      "start": 2462.099967956543,
      "end": 2464.699966430664,
      "text": " we understand the truth of the responsibility"
    },
    {
      "id": 27,
      "start": 2464.699966430664,
      "end": 2467.699966430664,
      "text": " that has been given to us to go and to be a witness."
    },
    {
      "id": 28,
      "start": 2467.699966430664,
      "end": 2472.2599716186523,
      "text": " But he says that we are made able ministers"
    },
    {
      "id": 29,
      "start": 2472.2599716186523,
      "end": 2475.1399688720703,
      "text": " of the New Testament, this new covenant."
    },
    {
      "id": 30,
      "start": 2475.1399688720703,
      "end": 2476.819969177246,
      "text": " So therefore we get to go out"
    },
    {
      "id": 31,
      "start": 2476.819969177246,
      "end": 2480.219970703125,
      "text": " and we get to share the gospel of Jesus Christ"
    },
    {
      "id": 32,
      "start": 2480.219970703125,
      "end": 2483.4599685668945,
      "text": " to let people understand what was accomplished"
    },
    {
      "id": 33,
      "start": 2483.4599685668945,
      "end": 2485.979965209961,
      "text": " by the substitutionary death, burial"
    },
    {
      "id": 34,
      "start": 2486.0199661254883,
      "end": 2489.979965209961,
      "text": " and glorious resurrection of Jesus Christ, our Savior."
    },
    {
      "id": 35,
      "start": 2489.979965209961,
      "end": 2492.6199645996094,
      "text": " That these blessings are available"
    },
    {
      "id": 36,
      "start": 2492.6199645996094,
      "end": 2495.419967651367,
      "text": " as Paul would say there to the believers in Rome"
    },
    {
      "id": 37,
      "start": 2495.419967651367,
      "end": 2497.499969482422,
      "text": " as he begins that great book."
    },
    {
      "id": 38,
      "start": 2497.499969482422,
      "end": 2499.699966430664,
      "text": " He says, speaking of the gospel,"
    },
    {
      "id": 39,
      "start": 2499.699966430664,
      "end": 2501.7399673461914,
      "text": " of course he understood that he was a debtor,"
    },
    {
      "id": 40,
      "start": 2501.7399673461914,
      "end": 2502.5799713134766,
      "text": " that he was ready."
    },
    {
      "id": 41,
      "start": 2502.5799713134766,
      "end": 2505.419967651367,
      "text": " He said, I am not ashamed of the gospel of Christ"
    },
    {
      "id": 42,
      "start": 2505.419967651367,
      "end": 2509.299964904785,
      "text": " for it is the power of God unto salvation"
    },
    {
      "id": 43,
      "start": 2509.299964904785,
      "end": 2511.4599685668945,
      "text": " to everyone that believeth,"
    },
    {
      "id": 44,
      "start": 2511.4599685668945,
      "end": 2515.8599700927734,
      "text": " to the Jew first and also to the Greek."
    },
    {
      "id": 45,
      "start": 2515.979965209961,
      "end": 2518.8599700927734,
      "text": " He says that God hath made us to be able ministers."
    },
    {
      "id": 46,
      "start": 2518.8599700927734,
      "end": 2521.899971008301,
      "text": " He says in 2 Corinthians 4 and verse number 1"
    },
    {
      "id": 47,
      "start": 2521.899971008301,
      "end": 2524.299964904785,
      "text": " that we have this ministry."
    },
    {
      "id": 48,
      "start": 2525.299964904785,
      "end": 2527.699966430664,
      "text": " Therefore seeing we have this ministry"
    },
    {
      "id": 49,
      "start": 2527.699966430664,
      "end": 2531.4599609375,
      "text": " as we have received mercy, we faint not."
    },
    {
      "id": 50,
      "start": 2531.4599609375,
      "end": 2533.6599731445312,
      "text": " Notice what he says in verse number..."
    },
    {
      "id": 51,
      "start": 2534.8999633789062,
      "end": 2536.5399627685547,
      "text": " Man, we should read the whole thing."
    },
    {
      "id": 52,
      "start": 2536.5399627685547,
      "end": 2538.2999725341797,
      "text": " Verse number 3, if our gospel be hid,"
    },
    {
      "id": 53,
      "start": 2538.2999725341797,
      "end": 2541.3399658203125,
      "text": " it is hid to them that are lost."
    },
    {
      "id": 54,
      "start": 2541.3399658203125,
      "end": 2542.179962158203,
      "text": " Right?"
    },
    {
      "id": 55,
      "start": 2542.179962158203,
      "end": 2543.7799682617188,
      "text": " Remember he said that he made us able ministers"
    },
    {
      "id": 56,
      "start": 2543.7799682617188,
      "end": 2545.8999633789062,
      "text": " of this New Covenant, this New Testament,"
    },
    {
      "id": 57,
      "start": 2545.8999633789062,
      "end": 2546.8599700927734,
      "text": " that we would go."
    },
    {
      "id": 58,
      "start": 2546.8599700927734,
      "end": 2549.0599670410156,
      "text": " We've received this ministry that we faint not."
    },
    {
      "id": 59,
      "start": 2549.0599670410156,
      "end": 2551.6599731445312,
      "text": " If our gospel be hid, it is hid to them that are lost"
    },
    {
      "id": 60,
      "start": 2551.6599731445312,
      "end": 2552.979965209961,
      "text": " in whom the God of this world"
    },
    {
      "id": 61,
      "start": 2552.979965209961,
      "end": 2555.3799743652344,
      "text": " hath blinded the minds of them which believe not."
    },
    {
      "id": 62,
      "start": 2555.3799743652344,
      "end": 2557.499969482422,
      "text": " Lest the light of the glorious gospel of Christ"
    },
    {
      "id": 63,
      "start": 2557.499969482422,
      "end": 2559.699966430664,
      "text": " who is the image of God should shine unto them"
    },
    {
      "id": 64,
      "start": 2559.699966430664,
      "end": 2561.2999725341797,
      "text": " for we preach not ourselves,"
    },
    {
      "id": 65,
      "start": 2561.2999725341797,
      "end": 2563.4599609375,
      "text": " but Christ Jesus the Lord"
    },
    {
      "id": 66,
      "start": 2563.4599609375,
      "end": 2565.739974975586,
      "text": " and ourselves your servants for Jesus' sake."
    },
    {
      "id": 67,
      "start": 2565.739974975586,
      "end": 2567.0599670410156,
      "text": " Notice verse number 7."
    },
    {
      "id": 68,
      "start": 2567.0599670410156,
      "end": 2570.5799713134766,
      "text": " We have this treasure in earthen vessels"
    },
    {
      "id": 69,
      "start": 2570.5799713134766,
      "end": 2572.7799682617188,
      "text": " that the excellency of the power may be of God"
    },
    {
      "id": 70,
      "start": 2572.7799682617188,
      "end": 2574.219970703125,
      "text": " and not of us."
    },
    {
      "id": 71,
      "start": 2574.219970703125,
      "end": 2575.7799682617188,
      "text": " Notice verse 16."
    },
    {
      "id": 72,
      "start": 2575.7799682617188,
      "end": 2577.3799743652344,
      "text": " For which cause we faint not,"
    },
    {
      "id": 73,
      "start": 2577.3799743652344,
      "end": 2578.939971923828,
      "text": " but though our outward man perish,"
    },
    {
      "id": 74,
      "start": 2578.939971923828,
      "end": 2581.699966430664,
      "text": " yet the inward man is renewed day by day"
    },
    {
      "id": 75,
      "start": 2581.699966430664,
      "end": 2584.019973754883,
      "text": " for our light affliction, which is but for a moment,"
    },
    {
      "id": 76,
      "start": 2584.019973754883,
      "end": 2585.979965209961,
      "text": " worketh for us a far more exceeding"
    },
    {
      "id": 77,
      "start": 2585.979965209961,
      "end": 2587.939971923828,
      "text": " and eternal weight of glory."
    },
    {
      "id": 78,
      "start": 2587.939971923828,
      "end": 2589.6199645996094,
      "text": " While we look not at the things which are seen,"
    },
    {
      "id": 79,
      "start": 2589.6199645996094,
      "end": 2591.3799743652344,
      "text": " but at the things which are not seen,"
    },
    {
      "id": 80,
      "start": 2591.3799743652344,
      "end": 2594.0999755859375,
      "text": " but the things which are not seen,"
    },
    {
      "id": 81,
      "start": 2594.0999755859375,
      "end": 2596.5399627685547,
      "text": " excuse me, for the things which are seen are temporal,"
    },
    {
      "id": 82,
      "start": 2596.5399627685547,
      "end": 2600.1399688720703,
      "text": " but the things which are not seen are eternal."
    },
    {
      "id": 83,
      "start": 2600.1399688720703,
      "end": 2604.019973754883,
      "text": " So what's the understanding as we take away this morning"
    },
    {
      "id": 84,
      "start": 2604.019973754883,
      "end": 2607.499969482422,
      "text": " from this passage that there's a better covenant?"
    },
    {
      "id": 85,
      "start": 2607.499969482422,
      "end": 2608.939971923828,
      "text": " The fact of the matter is that we understand"
    },
    {
      "id": 86,
      "start": 2608.939971923828,
      "end": 2610.739974975586,
      "text": " the details of it, and that's good."
    },
    {
      "id": 87,
      "start": 2611.6599731445312,
      "end": 2614.5799713134766,
      "text": " But it ought to motivate us to do something about it."
    },
    {
      "id": 88,
      "start": 2614.5799713134766,
      "end": 2615.419967651367,
      "text": " Amen?"
    },
    {
      "id": 89,
      "start": 2615.419967651367,
      "end": 2617.1399688720703,
      "text": " Yes, that we are the recipients"
    },
    {
      "id": 90,
      "start": 2617.1399688720703,
      "end": 2619.419967651367,
      "text": " of these blessings spiritually."
    },
    {
      "id": 91,
      "start": 2619.419967651367,
      "end": 2622.4599609375,
      "text": " We understand, again, the fullness of this new covenant"
    },
    {
      "id": 92,
      "start": 2622.4599609375,
      "end": 2623.8599700927734,
      "text": " during the millennial reign of Christ,"
    },
    {
      "id": 93,
      "start": 2623.8599700927734,
      "end": 2625.2999725341797,
      "text": " but as I have been a recipient"
    },
    {
      "id": 94,
      "start": 2625.2999725341797,
      "end": 2627.6599731445312,
      "text": " of the gospel of Jesus Christ,"
    },
    {
      "id": 95,
      "start": 2627.6599731445312,
      "end": 2630.5399627685547,
      "text": " as I now have been able to be graft in"
    },
    {
      "id": 96,
      "start": 2630.5399627685547,
      "end": 2633.5799713134766,
      "text": " and to experience those blessings of salvation,"
    },
    {
      "id": 97,
      "start": 2633.5799713134766,
      "end": 2635.4599609375,
      "text": " I understand that I have been made,"
    },
    {
      "id": 98,
      "start": 2635.4599609375,
      "end": 2638.219970703125,
      "text": " you have been made an able minister"
    },
    {
      "id": 99,
      "start": 2638.219970703125,
      "end": 2640.6199645996094,
      "text": " of this new covenant, of this new testament,"
    },
    {
      "id": 100,
      "start": 2640.6199645996094,
      "end": 2644.219970703125,
      "text": " and if our gospel be hid, it is hid to them that are lost."
    },
    {
      "id": 101,
      "start": 2644.219970703125,
      "end": 2647.3799743652344,
      "text": " We have this treasure in earthen vessels."
    },
    {
      "id": 102,
      "start": 2647.3799743652344,
      "end": 2648.8599700927734,
      "text": " So it's not that we just go around"
    },
    {
      "id": 103,
      "start": 2648.8599700927734,
      "end": 2650.8599700927734,
      "text": " and theologically understand this thing"
    },
    {
      "id": 104,
      "start": 2650.8599700927734,
      "end": 2652.8999633789062,
      "text": " of a new covenant or a better covenant."
    },
    {
      "id": 105,
      "start": 2652.8999633789062,
      "end": 2654.8199615478516,
      "text": " It's that we actively go out and say,"
    },
    {
      "id": 106,
      "start": 2654.8199615478516,
      "end": 2659.1399536132812,
      "text": " listen, Jesus did this so that you could be saved."
    },
    {
      "id": 107,
      "start": 2660.1399536132812,
      "end": 2661.259979248047,
      "text": " Amen?"
    },
    {
      "id": 108,
      "start": 2661.259979248047,
      "end": 2663.8599548339844,
      "text": " The gospel is the power of God unto salvation."
    },
    {
      "id": 109,
      "start": 2663.8599548339844,
      "end": 2665.3799743652344,
      "text": " The Jew first, also the Greek."
    },
    {
      "id": 110,
      "start": 2665.3799743652344,
      "end": 2666.5399780273438,
      "text": " And so we understand, listen,"
    },
    {
      "id": 111,
      "start": 2666.5399780273438,
      "end": 2669.4199829101562,
      "text": " this is an amazing truth of God's word,"
    },
    {
      "id": 112,
      "start": 2669.4199829101562,
      "end": 2671.8199768066406,
      "text": " this new covenant, this better covenant,"
    },
    {
      "id": 113,
      "start": 2671.8199768066406,
      "end": 2675.259979248047,
      "text": " but it's not a truth that we hold to ourselves."
    },
    {
      "id": 114,
      "start": 2675.259979248047,
      "end": 2677.739959716797,
      "text": " It's a truth that we go and proclaim,"
    },
    {
      "id": 115,
      "start": 2677.739959716797,
      "end": 2679.3799743652344,
      "text": " that we go and send a light,"
    },
    {
      "id": 116,
      "start": 2679.3799743652344,
      "end": 2683.1399536132812,
      "text": " as we have on our wall over here in our,"
    },
    {
      "id": 117,
      "start": 2683.1399536132812,
      "end": 2684.739959716797,
      "text": " we have our missions board over here,"
    },
    {
      "id": 118,
      "start": 2685.5799560546875,
      "end": 2688.179962158203,
      "text": " and we go and proclaim this truth of send the light."
    },
    {
      "id": 119,
      "start": 2688.179962158203,
      "end": 2691.7799682617188,
      "text": " And really, as we enter into the church house"
    },
    {
      "id": 120,
      "start": 2691.7799682617188,
      "end": 2692.7799682617188,
      "text": " that God has given us,"
    },
    {
      "id": 121,
      "start": 2692.7799682617188,
      "end": 2694.259979248047,
      "text": " that we're reminded of the truth"
    },
    {
      "id": 122,
      "start": 2694.259979248047,
      "end": 2696.179962158203,
      "text": " and the responsibility that we have"
    },
    {
      "id": 123,
      "start": 2696.179962158203,
      "end": 2699.4199829101562,
      "text": " to go and preach the gospel to every creature."
    },
    {
      "id": 124,
      "start": 2699.4199829101562,
      "end": 2702.8999633789062,
      "text": " Paul says he's made us able ministers."
    },
    {
      "id": 125,
      "start": 2702.8999633789062,
      "end": 2706.6599731445312,
      "text": " He says, go and preach the gospel to every creature."
    },
    {
      "id": 126,
      "start": 2706.6599731445312,
      "end": 2709.4599609375,
      "text": " He says, I will be with you always."
    },
    {
      "id": 127,
      "start": 2709.4599609375,
      "end": 2710.8599548339844,
      "text": " Aren't you thankful for the promise"
    },
    {
      "id": 128,
      "start": 2710.8599548339844,
      "end": 2712.699981689453,
      "text": " that God will be with us?"
    },
    {
      "id": 129,
      "start": 2712.699981689453,
      "end": 2713.97998046875,
      "text": " And so we understand the details"
    },
    {
      "id": 130,
      "start": 2714.179962158203,
      "end": 2716.739959716797,
      "text": " and what a great truth that is given"
    },
    {
      "id": 131,
      "start": 2716.739959716797,
      "end": 2719.6599731445312,
      "text": " with regard to this new, better covenant,"
    },
    {
      "id": 132,
      "start": 2719.6599731445312,
      "end": 2723.2999572753906,
      "text": " but we have to understand how it would impact us today."
    },
    {
      "id": 133,
      "start": 2723.2999572753906,
      "end": 2725.699981689453,
      "text": " Yes, that we would be saved, that's wonderful."
    },
    {
      "id": 134,
      "start": 2727.4199829101562,
      "end": 2730.7799682617188,
      "text": " There's a world of lost people that need the gospel."
    },
    {
      "id": 135,
      "start": 2731.739959716797,
      "end": 2733.8599548339844,
      "text": " And the question is this,"
    },
    {
      "id": 136,
      "start": 2733.8599548339844,
      "end": 2734.939971923828,
      "text": " who's gonna tell them?"
    },
    {
      "id": 137,
      "start": 2736.0599670410156,
      "end": 2737.0199584960938,
      "text": " Who will tell them?"
    },
    {
      "id": 138,
      "start": 2739.4599609375,
      "end": 2742.2999572753906,
      "text": " It's gotta be somebody that knows the truth, right?"
    },
    {
      "id": 139,
      "start": 2742.3399658203125,
      "end": 2744.1399536132812,
      "text": " You know, there are a lot of people out there"
    },
    {
      "id": 140,
      "start": 2744.1399536132812,
      "end": 2748.5399780273438,
      "text": " that are propagating false teaching, right?"
    },
    {
      "id": 141,
      "start": 2748.5399780273438,
      "end": 2751.4199829101562,
      "text": " A lot of people, a lot of false teachers."
    },
    {
      "id": 142,
      "start": 2751.4199829101562,
      "end": 2753.1399536132812,
      "text": " We understand that the Bible prophesies"
    },
    {
      "id": 143,
      "start": 2753.1399536132812,
      "end": 2754.4199829101562,
      "text": " that that's gonna happen in the last days."
    },
    {
      "id": 144,
      "start": 2754.4199829101562,
      "end": 2755.97998046875,
      "text": " There's gonna be a lot of false teachers."
    },
    {
      "id": 145,
      "start": 2755.97998046875,
      "end": 2757.3799743652344,
      "text": " Just as there have been false prophets,"
    },
    {
      "id": 146,
      "start": 2757.3799743652344,
      "end": 2758.5399780273438,
      "text": " so will there be false teachers."
    },
    {
      "id": 147,
      "start": 2758.5399780273438,
      "end": 2759.3799743652344,
      "text": " That's what Peter uses."
    },
    {
      "id": 148,
      "start": 2759.3799743652344,
      "end": 2761.7799682617188,
      "text": " He uses the example of the Old Testament, Israel,"
    },
    {
      "id": 149,
      "start": 2761.7799682617188,
      "end": 2764.739959716797,
      "text": " with all of the false prophets, and there were many."
    },
    {
      "id": 150,
      "start": 2764.739959716797,
      "end": 2768.0999755859375,
      "text": " There are many false teachers, but we have the truth."
    },
    {
      "id": 151,
      "start": 2768.0999755859375,
      "end": 2769.699981689453,
      "text": " And so we don't walk away from a passage"
    },
    {
      "id": 152,
      "start": 2769.699981689453,
      "end": 2771.1399536132812,
      "text": " like Hebrews 8, saying, man, that's wonderful"
    },
    {
      "id": 153,
      "start": 2771.1399536132812,
      "end": 2773.3399658203125,
      "text": " to understand this theology and all that takes place"
    },
    {
      "id": 154,
      "start": 2773.3399658203125,
      "end": 2778.0599670410156,
      "text": " and the eschatological, the timeline and the chart"
    },
    {
      "id": 155,
      "start": 2778.0599670410156,
      "end": 2779.699981689453,
      "text": " and all that's gonna happen in the end times"
    },
    {
      "id": 156,
      "start": 2779.699981689453,
      "end": 2781.5799560546875,
      "text": " and the eschatology with regard to the rapture"
    },
    {
      "id": 157,
      "start": 2781.5799560546875,
      "end": 2782.699981689453,
      "text": " and the tribulation and the millennial,"
    },
    {
      "id": 158,
      "start": 2782.699981689453,
      "end": 2784.6599731445312,
      "text": " so on and so forth, and how this is all fulfilled."
    },
    {
      "id": 159,
      "start": 2784.6599731445312,
      "end": 2786.4599609375,
      "text": " That's great, and it's important to understand"
    },
    {
      "id": 160,
      "start": 2786.4599609375,
      "end": 2788.47998046875,
      "text": " and to have that foundation."
    },
    {
      "id": 161,
      "start": 2788.47998046875,
      "end": 2790.499969482422,
      "text": " But what does it do for us today?"
    },
    {
      "id": 162,
      "start": 2790.499969482422,
      "end": 2792.3399658203125,
      "text": " How's it motivate us today?"
    },
    {
      "id": 163,
      "start": 2792.3399658203125,
      "end": 2793.97998046875,
      "text": " The trumpet of the Lord's gonna sound."
    },
    {
      "id": 164,
      "start": 2793.97998046875,
      "end": 2796.239959716797,
      "text": " I don't know when it's gonna sound."
    },
    {
      "id": 165,
      "start": 2796.239959716797,
      "end": 2798.7799682617188,
      "text": " But as I mentioned in previous messages,"
    },
    {
      "id": 166,
      "start": 2798.7799682617188,
      "end": 2800.2799682617188,
      "text": " whenever that time happens,"
    },
    {
      "id": 167,
      "start": 2800.2799682617188,
      "end": 2801.8799743652344,
      "text": " whenever that trumpet sounds,"
    },
    {
      "id": 168,
      "start": 2801.8799743652344,
      "end": 2804.2799682617188,
      "text": " I preached a couple of Sunday nights ago,"
    },
    {
      "id": 169,
      "start": 2804.2799682617188,
      "end": 2806.3199768066406,
      "text": " this truth, go and tell."
    },
    {
      "id": 170,
      "start": 2808.1599731445312,
      "end": 2810.239959716797,
      "text": " The only time I have to go and tell anyone"
    },
    {
      "id": 171,
      "start": 2810.239959716797,
      "end": 2812.5599670410156,
      "text": " is while I'm still here on earth."
    },
    {
      "id": 172,
      "start": 2812.5599670410156,
      "end": 2813.9199829101562,
      "text": " Because during the millennial reign"
    },
    {
      "id": 173,
      "start": 2813.9199829101562,
      "end": 2815.0799560546875,
      "text": " and during all of eternity,"
    },
    {
      "id": 174,
      "start": 2815.0799560546875,
      "end": 2816.719970703125,
      "text": " I don't need to tell anybody about Jesus"
    },
    {
      "id": 175,
      "start": 2816.719970703125,
      "end": 2818.5199584960938,
      "text": " because they'll already know."
    },
    {
      "id": 176,
      "start": 2818.5199584960938,
      "end": 2819.679962158203,
      "text": " Amen?"
    },
    {
      "id": 177,
      "start": 2819.679962158203,
      "end": 2823.1599731445312,
      "text": " And so the moment is now, and if our gospel's hid,"
    },
    {
      "id": 178,
      "start": 2823.1599731445312,
      "end": 2824.97998046875,
      "text": " it's hidden to them that are lost."
    },
    {
      "id": 179,
      "start": 2824.97998046875,
      "end": 2826.0999755859375,
      "text": " A better covenant."
    },
    {
      "id": 180,
      "start": 2826.0999755859375,
      "end": 2828.3199768066406,
      "text": " Aren't you thankful for the truth of God's word?"
    },
    {
      "id": 181,
      "start": 2828.3199768066406,
      "end": 2829.1599731445312,
      "text": " Let's pray together."
    },
    {
      "id": 182,
      "start": 2829.1599731445312,
      "end": 2832.0399780273438,
      "text": " We love you, we thank you for loving us."
    },
    {
      "id": 183,
      "start": 2832.0399780273438,
      "end": 2835.439971923828,
      "text": " We thank you for the passage that is before us this morning"
    },
    {
      "id": 184,
      "start": 2835.439971923828,
      "end": 2840.439971923828,
      "text": " for the truth that this better covenant is superior"
    },
    {
      "id": 185,
      "start": 2841.0399780273438,
      "end": 2844.679962158203,
      "text": " because the Lord Jesus Christ, God in flesh,"
    },
    {
      "id": 186,
      "start": 2844.679962158203,
      "end": 2846.199981689453,
      "text": " is the surety of this covenant,"
    },
    {
      "id": 187,
      "start": 2846.199981689453,
      "end": 2848.1599731445312,
      "text": " is the mediator of this covenant."
    },
    {
      "id": 188,
      "start": 2849.999969482422,
      "end": 2851.199981689453,
      "text": " We thank you for the opportunity"
    },
    {
      "id": 189,
      "start": 2851.199981689453,
      "end": 2853.3799743652344,
      "text": " of looking at the specifics of this new covenant,"
    },
    {
      "id": 190,
      "start": 2853.3799743652344,
      "end": 2854.5399780273438,
      "text": " this better covenant,"
    },
    {
      "id": 191,
      "start": 2855.4599609375,
      "end": 2857.739959716797,
      "text": " with how it relates to Israel as a nation."
    },
    {
      "id": 192,
      "start": 2858.6599731445312,
      "end": 2860.8199768066406,
      "text": " As we consider how it relates to us"
    },
    {
      "id": 193,
      "start": 2860.8199768066406,
      "end": 2863.5399780273438,
      "text": " as individual believers today."
    },
    {
      "id": 194,
      "start": 2863.5399780273438,
      "end": 2867.5399780273438,
      "text": " What a joy to understand that the gospel"
    },
    {
      "id": 195,
      "start": 2867.5399780273438,
      "end": 2869.5399780273438,
      "text": " has now been made available to us"
    },
    {
      "id": 196,
      "start": 2869.5399780273438,
      "end": 2871.0999755859375,
      "text": " and we can be grafted in."
    },
    {
      "id": 197,
      "start": 2872.759979248047,
      "end": 2874.2999572753906,
      "text": " Lord, I pray that you would help us"
    },
    {
      "id": 198,
      "start": 2874.2999572753906,
      "end": 2878.97998046875,
      "text": " to understand the blessings of this truth."
    },
    {
      "id": 199,
      "start": 2878.97998046875,
      "end": 2882.7799682617188,
      "text": " It'd help us to be burdened to take this message"
    },
    {
      "id": 200,
      "start": 2882.7799682617188,
      "end": 2884.5199584960938,
      "text": " to a lost and dying world."
    },
    {
      "id": 201,
      "start": 2887.7799682617188,
      "end": 2891.0999755859375,
      "text": " We don't seek to set a date or any of those things"
    },
    {
      "id": 202,
      "start": 2891.0999755859375,
      "end": 2893.499969482422,
      "text": " which you've forbidden us to do."
    },
    {
      "id": 203,
      "start": 2893.499969482422,
      "end": 2894.939971923828,
      "text": " But God, we acknowledge this morning"
    },
    {
      "id": 204,
      "start": 2894.939971923828,
      "end": 2896.8199768066406,
      "text": " that we're living in the last days."
    },
    {
      "id": 205,
      "start": 2898.5999755859375,
      "end": 2901.0999755859375,
      "text": " You've told us that we're to redeem the time."
    },
    {
      "id": 206,
      "start": 2902.499969482422,
      "end": 2904.6199645996094,
      "text": " We're to be busy about the work that you've called us to do."
    },
    {
      "id": 207,
      "start": 2904.6199645996094,
      "end": 2907.1399536132812,
      "text": " We thank you that Paul recognized"
    },
    {
      "id": 208,
      "start": 2907.1399536132812,
      "end": 2908.939971923828,
      "text": " and even as we would look at the passage"
    },
    {
      "id": 209,
      "start": 2908.939971923828,
      "end": 2913.2999877929688,
      "text": " and understand the way in which it relates to us"
    },
    {
      "id": 210,
      "start": 2913.2999877929688,
      "end": 2914.93994140625,
      "text": " that you have made us able ministers"
    },
    {
      "id": 211,
      "start": 2914.93994140625,
      "end": 2917.4599609375,
      "text": " of this new testament, of this new covenant."
    },
    {
      "id": 212,
      "start": 2918.1799926757812,
      "end": 2922.6199951171875,
      "text": " God, would you help us to boldly proclaim"
    },
    {
      "id": 213,
      "start": 2922.6199951171875,
      "end": 2924.6199951171875,
      "text": " the truth of your word"
    },
    {
      "id": 214,
      "start": 2924.6199951171875,
      "end": 2926.8999633789062,
      "text": " that we would preach the gospel of Jesus Christ"
    },
    {
      "id": 215,
      "start": 2926.8999633789062,
      "end": 2929.6199951171875,
      "text": " to those that you would give us opportunity"
    },
    {
      "id": 216,
      "start": 2929.6199951171875,
      "end": 2933.219970703125,
      "text": " that would understand the blessings"
    },
    {
      "id": 217,
      "start": 2934.739990234375,
      "end": 2937.1399536132812,
      "text": " that accompany salvation."
    },
    {
      "id": 218,
      "start": 2937.1399536132812,
      "end": 2939.0199584960938,
      "text": " Lord, if there's one that's not sure of heaven,"
    },
    {
      "id": 219,
      "start": 2939.0199584960938,
      "end": 2941.8999633789062,
      "text": " I pray that today would be the day of their salvation."
    },
    {
      "id": 220,
      "start": 2941.8999633789062,
      "end": 2943.4199829101562,
      "text": " I pray that not one person would leave here"
    },
    {
      "id": 221,
      "start": 2943.4199829101562,
      "end": 2946.5799560546875,
      "text": " without knowing for sure that heaven is their home."
    },
    {
      "id": 222,
      "start": 2946.5799560546875,
      "end": 2948.97998046875,
      "text": " I pray that during this time of invitation"
    },
    {
      "id": 223,
      "start": 2948.97998046875,
      "end": 2950.3799438476562,
      "text": " that you alone would be glorified,"
    },
    {
      "id": 224,
      "start": 2950.3799438476562,
      "end": 2952.699951171875,
      "text": " that you'd work in hearts and lives."
    },
    {
      "id": 225,
      "start": 2952.699951171875,
      "end": 2956.8199462890625,
      "text": " Help us to have a spirit, a heart of thankfulness"
    },
    {
      "id": 226,
      "start": 2956.8199462890625,
      "end": 2960.3799438476562,
      "text": " for the blessings that accompany salvation."
    },
    {
      "id": 227,
      "start": 2960.3799438476562,
      "end": 2962.0599975585938,
      "text": " Help us to have a heart of commitment"
    },
    {
      "id": 228,
      "start": 2962.0599975585938,
      "end": 2965.2599487304688,
      "text": " to go and to take this message to a lost and dying world."
    },
    {
      "id": 229,
      "start": 2966.1399536132812,
      "end": 2967.4599609375,
      "text": " Well, thank you for all that you'll do"
    },
    {
      "id": 230,
      "start": 2967.4599609375,
      "end": 2969.3399658203125,
      "text": " for it's in Christ's name we pray."
    },
    {
      "id": 231,
      "start": 2969.3399658203125,
      "end": 2970.1799926757812,
      "text": " Would you stand with me?"
    },
    {
      "id": 232,
      "start": 2970.1799926757812,
      "end": 2972.0999755859375,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 233,
      "start": 2972.0999755859375,
      "end": 2973.8599853515625,
      "text": " Kimberly's gonna play quietly on the piano"
    },
    {
      "id": 234,
      "start": 2973.8599853515625,
      "end": 2975.4599609375,
      "text": " and as she does, the altar's open."
    },
    {
      "id": 235,
      "start": 2975.4599609375,
      "end": 2977.0999755859375,
      "text": " Have a time of invitation."
    },
    {
      "id": 236,
      "start": 2977.0999755859375,
      "end": 2978.6599731445312,
      "text": " You're welcome to move around the auditorium"
    },
    {
      "id": 237,
      "start": 2978.6599731445312,
      "end": 2980.2599487304688,
      "text": " and come up here to this old-fashioned altar"
    },
    {
      "id": 238,
      "start": 2980.2599487304688,
      "end": 2982.0199584960938,
      "text": " or you can pray right there in your seat."
    },
    {
      "id": 239,
      "start": 2982.0199584960938,
      "end": 2983.8199462890625,
      "text": " Make your seat and altar."
    },
    {
      "id": 240,
      "start": 2983.8199462890625,
      "end": 2986.0199584960938,
      "text": " As Kimberly plays, the altar is open."
    }
  ],
  "processed_at": "2025-04-17T15:40:20.167763"
}