{
  "video_id": "tekmD5z_NmE",
  "text": "Number 11, and as you take a moment to grab your Bible and turn there, I just wanna once again thank the church for your support of our young people. It is the future of our church, and we need to invest and influence and pray for the young people, and so I wanna encourage you to pray for these that have made decisions and certainly thankful for what God has done in this past week and how God is working in their lives. Hebrews chapter number 11, I referenced briefly at the end of the message this morning as we looked at Hebrews 12, one and two in closing the message this morning, I referenced some about this 11th chapter here in the book of Hebrews. We've often referred to, I'm sure you've heard somebody refer to this passage as being the hall of faith chapter. Many would refer to those that are written here and named in this chapter as the heroes of the faith, and we see that these are individuals that were called by God to fulfill what God had for them as individuals. By faith, they obeyed the Lord, they finished, fulfilled what God had for them, and it certainly is encouraging to read this chapter and to be encouraged by what God has done in their lives, but even before you get into all of the real, maybe well-known events, I notice a statement in verse number five that just captured my attention as we were praying for our young people throughout the week, being at teen camp, and as I was preparing the message this morning and just looking even in our Sunday school class this morning with the life of Samuel and how the Bible says that Samuel judged Israel all the days of his life, and he was faithful to serve God, though he had a ministry that was taxing, no doubt, traveling from city to city and judging the people, and yet, because of his connection to God, we find that he was able to serve God all the days of his life. If you look in the passages I mentioned in Sunday school this morning, the key to that portion of scripture is that in Ramah, his hometown, he built there an altar unto the Lord, and how important worship is in our time with God. I was so just disappointed to hear the statistic that Brianna shared that the average, I'm not sure who they survey when they come up with those statistics. I wasn't called, I'm sure that many of you were not called, but it's so frightening to me to think that there would be any group of people that would claim to be followers of the Lord Jesus Christ and the average time spent in prayer to be two minutes. That's sad. There's a book that I was made aware of back in 1997, and that book was on a very prominent display in a Christian bookstore, and that book was entitled How to Pray in Nine Minutes and 59 Seconds, and I thought how horrible of a title of a book that must be that we're gonna try to squeeze God into less than 10 minutes. The reality is that now two minutes is what this statistic is, and yet the reality is that we can spend as much time with God as we want. What a privilege. I'm so thankful that God doesn't say time's up, next. We just enter into his presence, bring our petitions before his throne. As I look at this passage of scripture, I've used the title from verse number five. He had this testimony. Look at what the Bible says in Hebrews 11 in verse five. And by faith Enoch was translated that he should not see death and was not found because God had translated him for before his translation, he, Enoch, had this testimony. Notice that he pleased God. I wonder this evening if someone were to summarize my life, if someone were to summarize your life with just one statement, that's all they were allowed to have, was one statement to summarize your life, I wonder what it would be. I wonder how somebody would summarize. I'm not asking how you would summarize your life. I'm asking how someone else might summarize your life. And then if we take it even a step further, we can ask ourselves this question, how would God summarize our lives? Because here God is giving us a summary statement of the life of Enoch. We know the Bible says in the book of Genesis, if you were to go back there, we won't take the time to do so. But Enoch walked with God and he was not for God took him. Huh, what an amazing testimony. As I think about the summary statement that's found here in our passage of scripture, the Bible says he had this testimony, four simple words that he pleased God. We really could say it's three words, he pleased God. Wow, what an incredible testimony. These three words that are provided to us in Hebrews 11 in verse number five, he pleased God. I believe that those three words, this testimony of Enoch, those words are insightful. They reveal to us something about Enoch's walk with God. They reveal something to us about the seriousness of Enoch seeking to please the Lord with his life and having that single mindedness. I think about Enoch and I think about us today, how much we have that he did not have. We have the whole Bible. We have the Holy Spirit of God that indwells us. And Enoch had this testimony, he pleased God. Not only is the testimony that's given here in Hebrews 11 in verse five insightful, I believe it should be impactful to each of us as we evaluate this testimony, as we ponder the thought of what's really the full meaning of this statement that he pleased God, that we too as a child of God, that we would say that it would be our desire that God would summarize our lives with those same three words, that they pleased God, that they pleased God. See, this evening we must, as we look at the day and age in which we live, we must avoid the temptation to please ourselves. We live in a society that's pumping our minds full of the idea that you just live your life to please yourself and you do what makes you feel good and you do what brings you that fulfillment. That is not biblical, that is not having a biblical worldview and we must avoid the temptation. We find that there are those, in fact, Paul says this in Philippians two, in verse number 21, when he's speaking about sending Timothy to the church in Philippi, he says of others, he says the reason he's sending Timothy is because he knew that Timothy was like-minded and would naturally care for their estate, but he says for all seek their own and not the things which are Jesus Christ. I think this evening that what Paul, under the inspiration of the Holy Spirit of God, acknowledged to the believers in Philippi of those that were seeking their own is certainly true even in the day and age in which we live. So many are just seeking to please themselves. There's a danger in trying to please others. People live their lives trying to please someone. The only one that we should really desire to please is God. And the reality is that if we walk with God and we have that testimony that he pleased God, then God's gonna take care of all the other things. See, I'd rather have the testimony of Enoch that he pleased God and maybe disappointed some other people than to please some other people and disappoint God. As I think about this testimony of Enoch in these three simple words that he pleased God, I wonder this evening how it could be said of you and how it could be said of me that we would please God. How could we live a life that's pleasing to God? Have you ever had maybe an employer, a supervisor, that you sought to please and found it to be quite frustrating because you just didn't know what you could do to please that person? It didn't seem to matter from day to day, things would shift and change and maybe they had a shifting type of personality and you did something yesterday that pleased them but today it's not satisfactory and it's frustrating and it just can be infuriating because some people come to the end of themselves and I just don't know what to do to please you. People can feel that way. Can I tell you this evening, we don't ever have to feel that way with God. You know why? He's given us a full Bible and he's told us within the pages of this wonderful book what pleases him and he's told us those things that do not please him and we ought to be thankful for that. We ought to rejoice in knowing that God has given us in his word the revelation of not only himself but of those things that please him so that we can take note as we study through the pages of this book and as we read and meditate upon the truth that's contained therein and we find that these things please God and these things displease God that we can personally apply those things in our lives so that why? So that we can have that testimony that we please God. that we please God. As I think about this testimony of Enoch, I am mindful of the Apostle Paul and his concern for those that he had the opportunity to minister to, and this evening I just want to share two thoughts with you with this idea of pleasing the Lord within the parameters, if you will, of the ministry of the Apostle Paul. Of course, God used Paul in a great way, and Paul is a man that desired to please the Lord. We looked at Philippians 2.21, but in 1.21 he says, for me to live is Christ and to die is gain. And I think that summarizes a life testimony of the Apostle Paul that he was living his life in such a way that his single focused desire was to please God. I don't think Paul was concerned about pleasing Peter. I don't think Paul was concerned about pleasing Timothy or fill in the blank. Paul was concerned about pleasing God, singularly. As we understand the Apostle Paul in his own life and his ministry, God used him to serve and minister a number of people. Churches that were established through missionary journeys, churches that were contacted and written to under the inspiration of the Holy Spirit of God so that they would grow in their faith, and Paul, as we look at his writing and we look at his ministry and God gives us a picture, a glimpse into the heart of Paul, I notice this evening within the context of this subject matter of pleasing God, if you're taking notes, number one, I want you to consider with me the concern of the Apostle Paul. I want you to think about the Apostle Paul and his concern for those that God would give him the opportunity to minister to. Look over the book of Ephesians, if you will, and as we look at the book of Ephesians and understand here what's taking place and looking at the ministry of the Apostle Paul and we find here that Paul has this understanding that as he is writing to these and as he's had the opportunity to minister to these individuals, that he speaks about hearing, receiving a report with regard to their walk with God. Now why is that important? Well Paul was praying for these believers. Often you find in the letters that he writes that he's writing to them and he shares with them how he's praying for them, but you also find that Paul is concerned on receiving a report to know how they're doing, to understand how their walk with God is, how they've been able to endure the attacks of the enemy. When you look at the believers in Thessalonica, he deals with that specifically, and we find that Paul, it's revealed to us his concern. Notice with the believers in Ephesus, in Ephesians 1 and verse 15, the Bible says this, Therefore I also, after I heard of your faith in the Lord Jesus and love unto all the saints, cease not to give thanks for you, making mention of you in my prayers, and then we find that Paul begins to, and we're not gonna unwrap all of what he prays throughout the end of the chapter, but we find that Paul specifically is saying I'm praying for you. But when I think about the concern of the Apostle Paul, I want you to understand that in the particular time, they don't have the technology that we have today, and Paul is interested in receiving a report from these believers at Ephesus. He wants to know how they're doing in their walk with God. He wants to, he's interested, he's concerned to know if these believers at this church in Ephesus that he was privileged, allowed of God to see planted and established, he wants to know are they continuing in the faith, are they walking with God, are they pleasing the Lord. We find that Paul no doubt sends and he's interested in receiving words so that he can hear this report. We find in the book of Philippians that Paul is writing to this church, again that he had the opportunity to be able to see established, and we find that Paul mentions even in the first chapter again to the believers at Philippi in Philippians 1 and verse 27, notice what he says, only let your conversation be as it becometh the gospel of Christ, that whether I come and see you or else be absent, notice what he says, I may hear of your affairs, that you stand fast in one spirit with one mind, striving together for the faith of the gospel. Paul says, listen, whether I'm there or I cannot come, I desire to hear. I want to receive this report, I want to be aware of the fact that you're serving and pleasing the Lord. As best we can tell, in the book of Colossians, Paul is writing to a group of people that he never had the privilege of actually personally ministering to. The church at Colossae is not a church that Paul had the privilege of starting and establishing, but we find that Paul hears about their faith, he receives word about this group of believers in the city of Colossae, and we find that Paul, when he heard about their walk with God, it was encouraging to him, and he then sends a letter, yes, under the inspiration of the Holy Spirit of God, but in that letter, he reveals to them how he's praying for them that they would please God, that they would serve the Lord, that they would stand fast, that they would continue in the faith. Notice the Bible says in Colossians 1 and verse number 3, we give thanks to God and the Father of our Lord Jesus Christ, praying always for you, since we heard of your faith in Christ Jesus, and of the love which you have to all the saints, and we find that the Apostle Paul, if you were to read verses 9 through 14, you can see the content really of how he's praying for their growth. Notice specifically in verse number 10, that ye might walk worthy of the Lord unto all pleasing. What's Paul's concern for these believers in Colossae? That they would have the testimony that Enoch had, that they pleased God. He's praying to that end, that they would walk worthy of the Lord unto all pleasing. Notice it says, being fruitful in every good work, and increasing in the knowledge of God. It's a great study to study the prayers of the Apostle Paul, and then to take as we learn how Paul prayed for believers, and to incorporate those same truths in our prayer lives. So often, if we're not careful, our prayer time consists of more temporal things one for another, than spiritual things. And we find that as you would read the prayers of the Apostle Paul, as he's writing to these believers, that they are full of spiritual truth. He's praying for their spiritual growth. He's praying here that they would be fruitful in every good work, as it's already been said by our missionary and by Brianna during the testimony time. We don't do good works to get saved or to stay saved. As you study through the pages of God's precious Word, you find that salvation is a free gift. He didn't just put a down payment on your salvation. He paid for it all. There's nothing you can do to earn or to keep your salvation. We are kept by the power of God, and for that we must rejoice. But we find that Paul is concerned that these believers in Ephesus, in Philippi, in Colossae, that they would have this testimony that they pleased God. Notice in the book of 1 Thessalonians, I mentioned earlier how Paul is so concerned for this group of believers. It's interesting when you see the heart of the Apostle Paul here with the group of believers in Thessalonica. And you know that his time was short there in Thessalonica. Those that were against him and the enemy, they ran him out of town very quickly. But we find that in 1 Thessalonians 2, in verse number 12, notice the Bible says that you would walk worthy of God, who hath called you into his kingdom and glory. Think about that. Again, pleasing God, that he pleased God, that's what it said of Enoch. Here he says that they would walk worthy of God. I do not think that it would be inappropriate to say that those terminologies could be used synonymously. That they'd walk worthy of God, that they would please God. And we find here that Paul has that desire, he has that concern for these believers in Thessalonica. In chapter 3, in verse number 1, it says, Wherefore, when we could no longer forbear, we thought it good to be left in Athens alone and sent Timotheus our brother and minister of God and our fellow laborer in the gospel of Christ to establish you and to comfort you concerning your faith. Why? That no man should be moved by these afflictions for yourselves. Know that we are appointed thereunto, for verily when we were with you, we told you before that we should suffer tribulation, even as it has come to pass, and ye know. For this cause. Notice what Paul says. When I could no longer forbear, I sent to know your faith. And that's concern on the part of the spiritual leader, the apostle Paul. Why does Paul care? Because he knows they're going to stand before Christ one day. And he wants them to be able to have that testimony that they pleased God. Did Paul have that desire himself? Absolutely. But Paul had that desire, that concern for those that God would enable him to minister to. He continues in verse number five and says, Lest by some means the tempter have tempted you and our labor be in vain We have an enemy We have an enemy and the Bible tells us the enemy is seeking whom he may devour That's what the enemy is doing. He's active And we find that Paul I love the language in verse number five when he says when I could no longer forbear I mean Paul was in a position. He's like I just need to know I need to know how they're doing. He's not concerned about a physical condition. He's concerned about their spiritual well-being It's interesting to me that so often in our lives today Even in our everyday conversation with brothers and sisters in Christ our conversation primarily consists of how are you doing? temporally It's Not very common that even a brother or sister in Christ has a conversation with another brother or sister in Christ Hey, how are your devotions going? How's your time with God? What are you reading? How's God working in your life? Seems like those are questions that almost we act as if are off limits in conversations Brethren, it ought not be the case. I Remember in 2018 meeting a pastor that I'd never met before and Kimberly, you know pastor Scotty Buckhouse I think when your family was traveling you Met him and I met him in 2018 never met them fella before my life brother Armando We sat down at a big table and he sat across from me to eat lunch and I just met him. Hi, I'm Scotty Hi, I'm Chris just met him Sit down to eat lunch. We prayed and he said brother. How are your devotions? What's God teaching you in his word? And I was excited by that. I Was encouraged I wasn't offended by that and we had one of the best conversations Talking about what God's teaching us in our own lives It was awesome But you know how rare that is So rare, but Paul says I could no longer forbear I just had to know how they were doing why because he's concerned that they're pleasing God It wasn't concerned how they were doing financially how the job was going how this was going how that how are you doing spiritually? How are you doing spiritually? Not only do we see the concern of Paul Quickly, we see the charge from Paul Paul gives a charge to those that he's ministering to that aligns with his concern for them and we find again as we look at some of these same passages scripture go back if you were to the book of Ephesians in chapter 5 And notice what the Bible says Ephesians 5 as we consider the charge of the Apostle Paul Why would he say this to these believers that he's writing to these? Saints at Ephesus, why would he say these things because he wants them to have the testimony that they please God And he says to them in in Ephesians 5 and beginning in verse number one be therefore followers of God as dear children follow the Lord and Walk in love as Christ hath also hath loved us and hath given himself for us an offering and a sacrifice of God for a sweet-smelling savor he then goes through a number of things to avoid and to To not be partakers of and then he says this notice as we Look at the the statement in verse number 10. He says proving what is acceptable unto the Lord So what's he saying to these believers of Ephesus? Listen you have a responsibility to prove What is pleasing what is acceptable unto the Lord? here are some things that you ought not do in fact as you look and you study here in the in the previous chapter in Ephesians chapter before you find beginning in verse 17 down through the end he talks about this principle that we see in the book of Colossians as well the put off put on principle and Why is the Apostle Paul telling these believers in Ephesus to put off these things and to put on these things Why is he telling them to prove what is acceptable unto the Lord for this purpose? They please God They please God We read Colossians 1 10 already turn to the book of 1st Thessalonians and we'll look there very quickly At what the Apostle Paul says to these that he needed to know their affairs he needed to know what was Going on in their lives spiritually We find that in 1st Thessalonians 2 in verse number 4 Notice what Paul says it's a great perspective that he had for ministry He says but as we were allowed of God to be put in trust with the gospel Even so we speak not as pleasing men, but God which triath our hearts so keeping in mind that Paul is sharing with them their his perspective of the Privilege that they had that they were allowed of God to be entrusted with the gospel Even as we have been allowed of God to be entrusted with the gospel But you notice that he says that he wanted to please God He doesn't want to please men but look at chapter 4 in verse number 1 because he gives them a charge It wasn't enough for the Apostle Paul to just have the personal desire that he would please God But he wanted to give a charge to those that he was spiritually Ministering to that they too would please the Lord notice in verse number 1 of chapter 4 furthermore Then we beseech you brethren and exhort you by the Lord Jesus That is he as he have received of us notice when he says how ye ought to walk and to please God So you would abound more and more What's his desire that they would please God His charge to them is that they would live their lives in such a way that they would please the Lord Let me close with this charge in 2nd Timothy. We're familiar with chapter 2 in verse number 2 When the Apostle Paul is giving this charge to Timothy his son in the faith and he speaks to him about the importance of influence and generational influence but we notice that in the same chapter that the Apostle Paul is is giving a charge to Timothy and even to Us this evening and to all of those that God has enlisted into his army that we would please him notice in verse number 3 Of 2nd Timothy 2 the Bible says thou therefore endure hardness as a good soldier of Jesus Christ No man that worth and tangle with himself with the affairs of this life notice that he may please him who hath chosen Him to be a soldier Paul says I want to give you this charge that you please God Paul was concerned about the spiritual well-being of those that God enabled him to minister to and Then he gives the charge Live your life in such a way that you please the Lord You know, we sang several songs today in fact about heaven kind of interesting how that worked together and We will see him one day face to face What a wonderful wonderful Bible truth that is But I wonder this evening if we'll hear that we pleased God As We think about how our life might be summarized I think about the teenagers and being at camp and all of the the pressures that they have at the time that they're in in life and Do this and do that and chase this and do what makes you all of those things that they hear I'm to please God But it's not just teenagers from the youngest to the oldest To every child of God It ought to be that our desire Is to have the testimony? That is said here of Enoch he had this testimony he pleased God He pleased God I'm not asking you to summarize your life. I'm not asking us to Proclaim our own goodness I'm saying as we evaluate. I've said this so often from this pulpit Self-examination requires humility and honesty It's easy for us to just say oh, yeah, I'm pleasing God Take some time evaluate Prove what is acceptable unto the Lord, you know proving is is a process It was used that term in Ephesians 510 that's used with metal work And you're proving those metals and you're you're heating them up to get the the impurities out and all that's taking place and that's the term they would understand that and God says to us proving what is acceptable unto the Lord. How do we do that? Compare scripture with scripture Here's this thing that I'm thinking about doing or this okay How does it please God does it not please God and I'm gonna prove what is acceptable unto the Lord. It's a process It's work But it's worth it. Why because we can have this testimony They pleased God. I hope tonight as we think about this simple statement in Hebrews 11 5 Absolutely, just captivate at my attention this week. I just couldn't get away from it and I just wonder tonight Do we really have a desire? That our lives are pleasing to God above everything else that it would be be said of us that we have this testimony that we please God. Let's pray. Father, we love you. We thank you for loving us. Thank you for the testimony of Enoch. Thank you for the complete canon of Scripture. You've given us truth. You've revealed to us those things that please you. You've revealed to us those things that do not please you. God, I pray that we'd have that desire that above all else we would please you. Help us, God, to prove what is acceptable in the sight of God. I pray that as we have a moment of invitation tonight, I pray, Lord, that you'd work in hearts and lives. Help us, Lord, to be honest and humble. Help us, Lord, to truly seek to live our lives in such a way that it would be a Philippians 121 for me to live as Christ, not a Philippians 221 that all seek their own. I pray, God, that you would move and work as only you can. We'll thank you for every decision. For it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.5799999237060547,
      "text": " Number 11, and as you take a moment"
    },
    {
      "id": 1,
      "start": 2.5799999237060547,
      "end": 4.559999942779541,
      "text": " to grab your Bible and turn there,"
    },
    {
      "id": 2,
      "start": 4.559999942779541,
      "end": 7.400000095367432,
      "text": " I just wanna once again thank the church"
    },
    {
      "id": 3,
      "start": 7.400000095367432,
      "end": 10.020000457763672,
      "text": " for your support of our young people."
    },
    {
      "id": 4,
      "start": 10.020000457763672,
      "end": 12.960000038146973,
      "text": " It is the future of our church,"
    },
    {
      "id": 5,
      "start": 12.960000038146973,
      "end": 16.15999984741211,
      "text": " and we need to invest and influence"
    },
    {
      "id": 6,
      "start": 16.15999984741211,
      "end": 18.440000534057617,
      "text": " and pray for the young people,"
    },
    {
      "id": 7,
      "start": 18.440000534057617,
      "end": 22.15999984741211,
      "text": " and so I wanna encourage you to pray for these"
    },
    {
      "id": 8,
      "start": 22.15999984741211,
      "end": 24.459999084472656,
      "text": " that have made decisions and certainly thankful"
    },
    {
      "id": 9,
      "start": 24.459999084472656,
      "end": 27.15999984741211,
      "text": " for what God has done in this past week"
    },
    {
      "id": 10,
      "start": 27.15999984741211,
      "end": 29.719999313354492,
      "text": " and how God is working in their lives."
    },
    {
      "id": 11,
      "start": 29.719999313354492,
      "end": 32.08000183105469,
      "text": " Hebrews chapter number 11, I referenced briefly"
    },
    {
      "id": 12,
      "start": 32.08000183105469,
      "end": 33.959999084472656,
      "text": " at the end of the message this morning"
    },
    {
      "id": 13,
      "start": 33.959999084472656,
      "end": 36.279998779296875,
      "text": " as we looked at Hebrews 12, one and two"
    },
    {
      "id": 14,
      "start": 36.279998779296875,
      "end": 37.880001068115234,
      "text": " in closing the message this morning,"
    },
    {
      "id": 15,
      "start": 37.880001068115234,
      "end": 42.13999938964844,
      "text": " I referenced some about this 11th chapter"
    },
    {
      "id": 16,
      "start": 42.13999938964844,
      "end": 43.20000076293945,
      "text": " here in the book of Hebrews."
    },
    {
      "id": 17,
      "start": 43.20000076293945,
      "end": 46.0,
      "text": " We've often referred to, I'm sure you've heard somebody"
    },
    {
      "id": 18,
      "start": 46.0,
      "end": 49.779998779296875,
      "text": " refer to this passage as being the hall of faith chapter."
    },
    {
      "id": 19,
      "start": 49.779998779296875,
      "end": 52.439998626708984,
      "text": " Many would refer to those that are written here"
    },
    {
      "id": 20,
      "start": 52.439998626708984,
      "end": 55.63999938964844,
      "text": " and named in this chapter as the heroes of the faith,"
    },
    {
      "id": 21,
      "start": 55.63999938964844,
      "end": 57.439998626708984,
      "text": " and we see that these are individuals"
    },
    {
      "id": 22,
      "start": 57.439998626708984,
      "end": 61.63999938964844,
      "text": " that were called by God to fulfill"
    },
    {
      "id": 23,
      "start": 61.63999938964844,
      "end": 64.19999694824219,
      "text": " what God had for them as individuals."
    },
    {
      "id": 24,
      "start": 64.19999694824219,
      "end": 66.26000213623047,
      "text": " By faith, they obeyed the Lord,"
    },
    {
      "id": 25,
      "start": 66.26000213623047,
      "end": 69.91999816894531,
      "text": " they finished, fulfilled what God had for them,"
    },
    {
      "id": 26,
      "start": 69.91999816894531,
      "end": 73.4800033569336,
      "text": " and it certainly is encouraging to read this chapter"
    },
    {
      "id": 27,
      "start": 73.4800033569336,
      "end": 77.16000366210938,
      "text": " and to be encouraged by what God has done in their lives,"
    },
    {
      "id": 28,
      "start": 77.16000366210938,
      "end": 80.77999877929688,
      "text": " but even before you get into all of the real,"
    },
    {
      "id": 29,
      "start": 80.77999877929688,
      "end": 84.55999755859375,
      "text": " maybe well-known events, I notice a statement"
    },
    {
      "id": 30,
      "start": 84.55999755859375,
      "end": 88.12000274658203,
      "text": " in verse number five that just captured my attention"
    },
    {
      "id": 31,
      "start": 88.12000274658203,
      "end": 90.08000183105469,
      "text": " as we were praying for our young people"
    },
    {
      "id": 32,
      "start": 90.08000183105469,
      "end": 92.0,
      "text": " throughout the week, being at teen camp,"
    },
    {
      "id": 33,
      "start": 92.0,
      "end": 95.4000015258789,
      "text": " and as I was preparing the message this morning"
    },
    {
      "id": 34,
      "start": 95.4000015258789,
      "end": 98.4000015258789,
      "text": " and just looking even in our Sunday school class"
    },
    {
      "id": 35,
      "start": 98.4000015258789,
      "end": 100.36000061035156,
      "text": " this morning with the life of Samuel"
    },
    {
      "id": 36,
      "start": 100.36000061035156,
      "end": 102.80000305175781,
      "text": " and how the Bible says that Samuel judged Israel"
    },
    {
      "id": 37,
      "start": 102.80000305175781,
      "end": 107.44000244140625,
      "text": " all the days of his life, and he was faithful to serve God,"
    },
    {
      "id": 38,
      "start": 107.44000244140625,
      "end": 111.18000030517578,
      "text": " though he had a ministry that was taxing, no doubt,"
    },
    {
      "id": 39,
      "start": 111.18000030517578,
      "end": 114.54000091552734,
      "text": " traveling from city to city and judging the people,"
    },
    {
      "id": 40,
      "start": 114.54000091552734,
      "end": 118.33999633789062,
      "text": " and yet, because of his connection to God,"
    },
    {
      "id": 41,
      "start": 118.33999633789062,
      "end": 120.45999908447266,
      "text": " we find that he was able to serve God"
    },
    {
      "id": 42,
      "start": 120.45999908447266,
      "end": 121.73999786376953,
      "text": " all the days of his life."
    },
    {
      "id": 43,
      "start": 121.73999786376953,
      "end": 123.4800033569336,
      "text": " If you look in the passages I mentioned"
    },
    {
      "id": 44,
      "start": 123.4800033569336,
      "end": 124.9800033569336,
      "text": " in Sunday school this morning,"
    },
    {
      "id": 45,
      "start": 124.9800033569336,
      "end": 128.10000610351562,
      "text": " the key to that portion of scripture"
    },
    {
      "id": 46,
      "start": 128.10000610351562,
      "end": 130.5,
      "text": " is that in Ramah, his hometown,"
    },
    {
      "id": 47,
      "start": 130.5,
      "end": 133.5800018310547,
      "text": " he built there an altar unto the Lord,"
    },
    {
      "id": 48,
      "start": 133.5800018310547,
      "end": 138.17999267578125,
      "text": " and how important worship is in our time with God."
    },
    {
      "id": 49,
      "start": 138.17999267578125,
      "end": 142.5,
      "text": " I was so just disappointed to hear the statistic"
    },
    {
      "id": 50,
      "start": 142.5,
      "end": 144.66000366210938,
      "text": " that Brianna shared that the average,"
    },
    {
      "id": 51,
      "start": 144.66000366210938,
      "end": 146.5800018310547,
      "text": " I'm not sure who they survey"
    },
    {
      "id": 52,
      "start": 146.5800018310547,
      "end": 148.5399932861328,
      "text": " when they come up with those statistics."
    },
    {
      "id": 53,
      "start": 148.5399932861328,
      "end": 151.5800018310547,
      "text": " I wasn't called, I'm sure that many of you were not called,"
    },
    {
      "id": 54,
      "start": 151.5800018310547,
      "end": 154.67999267578125,
      "text": " but it's so frightening to me to think"
    },
    {
      "id": 55,
      "start": 154.67999267578125,
      "end": 156.9199981689453,
      "text": " that there would be any group of people"
    },
    {
      "id": 56,
      "start": 156.9199981689453,
      "end": 160.5,
      "text": " that would claim to be followers of the Lord Jesus Christ"
    },
    {
      "id": 57,
      "start": 160.5,
      "end": 164.4199981689453,
      "text": " and the average time spent in prayer to be two minutes."
    },
    {
      "id": 58,
      "start": 166.3000030517578,
      "end": 167.22000122070312,
      "text": " That's sad."
    },
    {
      "id": 59,
      "start": 168.4199981689453,
      "end": 173.33999633789062,
      "text": " There's a book that I was made aware of back in 1997,"
    },
    {
      "id": 60,
      "start": 173.33999633789062,
      "end": 178.33999633789062,
      "text": " and that book was on a very prominent display"
    },
    {
      "id": 61,
      "start": 178.4600067138672,
      "end": 180.66000366210938,
      "text": " in a Christian bookstore,"
    },
    {
      "id": 62,
      "start": 180.66000366210938,
      "end": 182.13999938964844,
      "text": " and that book was entitled"
    },
    {
      "id": 63,
      "start": 182.13999938964844,
      "end": 185.86000061035156,
      "text": " How to Pray in Nine Minutes and 59 Seconds,"
    },
    {
      "id": 64,
      "start": 185.86000061035156,
      "end": 189.94000244140625,
      "text": " and I thought how horrible of a title of a book that must be"
    },
    {
      "id": 65,
      "start": 189.94000244140625,
      "end": 191.94000244140625,
      "text": " that we're gonna try to squeeze God"
    },
    {
      "id": 66,
      "start": 191.94000244140625,
      "end": 194.5399932861328,
      "text": " into less than 10 minutes."
    },
    {
      "id": 67,
      "start": 194.5399932861328,
      "end": 197.02000427246094,
      "text": " The reality is that now two minutes"
    },
    {
      "id": 68,
      "start": 197.02000427246094,
      "end": 199.10000610351562,
      "text": " is what this statistic is,"
    },
    {
      "id": 69,
      "start": 199.10000610351562,
      "end": 201.5399932861328,
      "text": " and yet the reality is that we can spend"
    },
    {
      "id": 70,
      "start": 201.5399932861328,
      "end": 203.72000122070312,
      "text": " as much time with God as we want."
    },
    {
      "id": 71,
      "start": 205.22000122070312,
      "end": 206.05999755859375,
      "text": " What a privilege."
    },
    {
      "id": 72,
      "start": 206.05999755859375,
      "end": 210.22000122070312,
      "text": " I'm so thankful that God doesn't say time's up, next."
    },
    {
      "id": 73,
      "start": 210.22000122070312,
      "end": 212.33999633789062,
      "text": " We just enter into his presence,"
    },
    {
      "id": 74,
      "start": 212.33999633789062,
      "end": 214.77999877929688,
      "text": " bring our petitions before his throne."
    },
    {
      "id": 75,
      "start": 214.77999877929688,
      "end": 216.82000732421875,
      "text": " As I look at this passage of scripture,"
    },
    {
      "id": 76,
      "start": 216.82000732421875,
      "end": 219.82000732421875,
      "text": " I've used the title from verse number five."
    },
    {
      "id": 77,
      "start": 219.82000732421875,
      "end": 223.66000366210938,
      "text": " He had this testimony."
    },
    {
      "id": 78,
      "start": 223.66000366210938,
      "end": 226.66000366210938,
      "text": " Look at what the Bible says in Hebrews 11 in verse five."
    },
    {
      "id": 79,
      "start": 226.66000366210938,
      "end": 230.02000427246094,
      "text": " And by faith Enoch was translated"
    },
    {
      "id": 80,
      "start": 230.02000427246094,
      "end": 234.86000061035156,
      "text": " that he should not see death and was not found"
    },
    {
      "id": 81,
      "start": 234.86000061035156,
      "end": 239.86000061035156,
      "text": " because God had translated him for before his translation,"
    },
    {
      "id": 82,
      "start": 240.3800048828125,
      "end": 243.6999969482422,
      "text": " he, Enoch, had this testimony."
    },
    {
      "id": 83,
      "start": 243.6999969482422,
      "end": 247.86000061035156,
      "text": " Notice that he pleased God."
    },
    {
      "id": 84,
      "start": 249.6999969482422,
      "end": 254.6999969482422,
      "text": " I wonder this evening if someone were to summarize my life,"
    },
    {
      "id": 85,
      "start": 254.6999969482422,
      "end": 257.2200012207031,
      "text": " if someone were to summarize your life"
    },
    {
      "id": 86,
      "start": 257.2200012207031,
      "end": 258.8999938964844,
      "text": " with just one statement,"
    },
    {
      "id": 87,
      "start": 258.8999938964844,
      "end": 260.32000732421875,
      "text": " that's all they were allowed to have,"
    },
    {
      "id": 88,
      "start": 260.32000732421875,
      "end": 263.260009765625,
      "text": " was one statement to summarize your life,"
    },
    {
      "id": 89,
      "start": 263.260009765625,
      "end": 265.260009765625,
      "text": " I wonder what it would be."
    },
    {
      "id": 90,
      "start": 265.260009765625,
      "end": 267.05999755859375,
      "text": " I wonder how somebody would summarize."
    },
    {
      "id": 91,
      "start": 267.05999755859375,
      "end": 269.6600036621094,
      "text": " I'm not asking how you would summarize your life."
    },
    {
      "id": 92,
      "start": 269.6600036621094,
      "end": 273.4200134277344,
      "text": " I'm asking how someone else might summarize your life."
    },
    {
      "id": 93,
      "start": 273.4200134277344,
      "end": 275.739990234375,
      "text": " And then if we take it even a step further,"
    },
    {
      "id": 94,
      "start": 275.739990234375,
      "end": 277.260009765625,
      "text": " we can ask ourselves this question,"
    },
    {
      "id": 95,
      "start": 277.260009765625,
      "end": 280.8599853515625,
      "text": " how would God summarize our lives?"
    },
    {
      "id": 96,
      "start": 280.8999938964844,
      "end": 285.7799987792969,
      "text": " Because here God is giving us a summary statement"
    },
    {
      "id": 97,
      "start": 285.7799987792969,
      "end": 286.8999938964844,
      "text": " of the life of Enoch."
    },
    {
      "id": 98,
      "start": 286.8999938964844,
      "end": 288.94000244140625,
      "text": " We know the Bible says in the book of Genesis,"
    },
    {
      "id": 99,
      "start": 288.94000244140625,
      "end": 289.82000732421875,
      "text": " if you were to go back there,"
    },
    {
      "id": 100,
      "start": 289.82000732421875,
      "end": 291.5,
      "text": " we won't take the time to do so."
    },
    {
      "id": 101,
      "start": 291.5,
      "end": 295.8999938964844,
      "text": " But Enoch walked with God and he was not for God took him."
    },
    {
      "id": 102,
      "start": 295.8999938964844,
      "end": 299.239990234375,
      "text": " Huh, what an amazing testimony."
    },
    {
      "id": 103,
      "start": 300.3800048828125,
      "end": 302.1000061035156,
      "text": " As I think about the summary statement"
    },
    {
      "id": 104,
      "start": 302.1000061035156,
      "end": 304.5,
      "text": " that's found here in our passage of scripture,"
    },
    {
      "id": 105,
      "start": 304.5,
      "end": 306.8599853515625,
      "text": " the Bible says he had this testimony,"
    },
    {
      "id": 106,
      "start": 306.8599853515625,
      "end": 310.70001220703125,
      "text": " four simple words that he pleased God."
    },
    {
      "id": 107,
      "start": 311.5400085449219,
      "end": 314.8599853515625,
      "text": " We really could say it's three words, he pleased God."
    },
    {
      "id": 108,
      "start": 314.8599853515625,
      "end": 318.5799865722656,
      "text": " Wow, what an incredible testimony."
    },
    {
      "id": 109,
      "start": 320.3800048828125,
      "end": 323.29998779296875,
      "text": " These three words that are provided to us in Hebrews 11"
    },
    {
      "id": 110,
      "start": 323.29998779296875,
      "end": 325.82000732421875,
      "text": " in verse number five, he pleased God."
    },
    {
      "id": 111,
      "start": 325.82000732421875,
      "end": 328.8599853515625,
      "text": " I believe that those three words, this testimony of Enoch,"
    },
    {
      "id": 112,
      "start": 328.8599853515625,
      "end": 330.8599853515625,
      "text": " those words are insightful."
    },
    {
      "id": 113,
      "start": 330.8599853515625,
      "end": 335.2200012207031,
      "text": " They reveal to us something about Enoch's walk with God."
    },
    {
      "id": 114,
      "start": 335.2200012207031,
      "end": 338.5799865722656,
      "text": " They reveal something to us about the seriousness of Enoch"
    },
    {
      "id": 115,
      "start": 338.5799865722656,
      "end": 340.8999938964844,
      "text": " seeking to please the Lord with his life"
    },
    {
      "id": 116,
      "start": 340.8999938964844,
      "end": 343.739990234375,
      "text": " and having that single mindedness."
    },
    {
      "id": 117,
      "start": 343.739990234375,
      "end": 346.3800048828125,
      "text": " I think about Enoch and I think about us today,"
    },
    {
      "id": 118,
      "start": 346.3800048828125,
      "end": 349.0,
      "text": " how much we have that he did not have."
    },
    {
      "id": 119,
      "start": 350.3399963378906,
      "end": 352.3800048828125,
      "text": " We have the whole Bible."
    },
    {
      "id": 120,
      "start": 352.3800048828125,
      "end": 354.8999938964844,
      "text": " We have the Holy Spirit of God that indwells us."
    },
    {
      "id": 121,
      "start": 357.32000732421875,
      "end": 362.20001220703125,
      "text": " And Enoch had this testimony, he pleased God."
    },
    {
      "id": 122,
      "start": 363.4200134277344,
      "end": 366.1400146484375,
      "text": " Not only is the testimony that's given here"
    },
    {
      "id": 123,
      "start": 366.1400146484375,
      "end": 368.239990234375,
      "text": " in Hebrews 11 in verse five insightful,"
    },
    {
      "id": 124,
      "start": 368.8999938964844,
      "end": 371.2799987792969,
      "text": " I believe it should be impactful to each of us"
    },
    {
      "id": 125,
      "start": 371.2799987792969,
      "end": 375.239990234375,
      "text": " as we evaluate this testimony, as we ponder the thought"
    },
    {
      "id": 126,
      "start": 375.239990234375,
      "end": 379.239990234375,
      "text": " of what's really the full meaning of this statement"
    },
    {
      "id": 127,
      "start": 379.239990234375,
      "end": 382.4800109863281,
      "text": " that he pleased God, that we too as a child of God,"
    },
    {
      "id": 128,
      "start": 382.4800109863281,
      "end": 385.5199890136719,
      "text": " that we would say that it would be our desire"
    },
    {
      "id": 129,
      "start": 385.5199890136719,
      "end": 388.44000244140625,
      "text": " that God would summarize our lives"
    },
    {
      "id": 130,
      "start": 388.44000244140625,
      "end": 392.8800048828125,
      "text": " with those same three words, that they pleased God,"
    },
    {
      "id": 131,
      "start": 392.8800048828125,
      "end": 394.5199890136719,
      "text": " that they pleased God."
    },
    {
      "id": 132,
      "start": 394.5199890136719,
      "end": 397.9200134277344,
      "text": " See, this evening we must, as we look at the day and age"
    },
    {
      "id": 133,
      "start": 398.6000061035156,
      "end": 400.9599914550781,
      "text": " in which we live, we must avoid the temptation"
    },
    {
      "id": 134,
      "start": 400.9599914550781,
      "end": 402.7200012207031,
      "text": " to please ourselves."
    },
    {
      "id": 135,
      "start": 402.7200012207031,
      "end": 406.3599853515625,
      "text": " We live in a society that's pumping our minds full"
    },
    {
      "id": 136,
      "start": 406.3599853515625,
      "end": 408.7799987792969,
      "text": " of the idea that you just live your life"
    },
    {
      "id": 137,
      "start": 408.7799987792969,
      "end": 412.1600036621094,
      "text": " to please yourself and you do what makes you feel good"
    },
    {
      "id": 138,
      "start": 412.1600036621094,
      "end": 415.5,
      "text": " and you do what brings you that fulfillment."
    },
    {
      "id": 139,
      "start": 415.5,
      "end": 418.6400146484375,
      "text": " That is not biblical, that is not having"
    },
    {
      "id": 140,
      "start": 418.6400146484375,
      "end": 423.32000732421875,
      "text": " a biblical worldview and we must avoid the temptation."
    },
    {
      "id": 141,
      "start": 423.32000732421875,
      "end": 426.44000244140625,
      "text": " We find that there are those, in fact, Paul says this"
    },
    {
      "id": 142,
      "start": 426.44000244140625,
      "end": 429.2799987792969,
      "text": " in Philippians two, in verse number 21,"
    },
    {
      "id": 143,
      "start": 429.2799987792969,
      "end": 431.0400085449219,
      "text": " when he's speaking about sending Timothy"
    },
    {
      "id": 144,
      "start": 431.0400085449219,
      "end": 434.3800048828125,
      "text": " to the church in Philippi, he says of others,"
    },
    {
      "id": 145,
      "start": 434.3800048828125,
      "end": 437.5799865722656,
      "text": " he says the reason he's sending Timothy is because he knew"
    },
    {
      "id": 146,
      "start": 437.5799865722656,
      "end": 440.739990234375,
      "text": " that Timothy was like-minded and would naturally care"
    },
    {
      "id": 147,
      "start": 440.739990234375,
      "end": 445.44000244140625,
      "text": " for their estate, but he says for all seek their own"
    },
    {
      "id": 148,
      "start": 445.44000244140625,
      "end": 449.0,
      "text": " and not the things which are Jesus Christ."
    },
    {
      "id": 149,
      "start": 449.0,
      "end": 453.1400146484375,
      "text": " I think this evening that what Paul,"
    },
    {
      "id": 150,
      "start": 453.1400146484375,
      "end": 455.0799865722656,
      "text": " under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 151,
      "start": 455.0799865722656,
      "end": 457.32000732421875,
      "text": " acknowledged to the believers in Philippi"
    },
    {
      "id": 152,
      "start": 457.32000732421875,
      "end": 460.67999267578125,
      "text": " of those that were seeking their own is certainly true"
    },
    {
      "id": 153,
      "start": 460.67999267578125,
      "end": 463.32000732421875,
      "text": " even in the day and age in which we live."
    },
    {
      "id": 154,
      "start": 463.32000732421875,
      "end": 465.7799987792969,
      "text": " So many are just seeking to please themselves."
    },
    {
      "id": 155,
      "start": 466.8399963378906,
      "end": 469.2799987792969,
      "text": " There's a danger in trying to please others."
    },
    {
      "id": 156,
      "start": 470.4599914550781,
      "end": 473.5799865722656,
      "text": " People live their lives trying to please someone."
    },
    {
      "id": 157,
      "start": 474.8399963378906,
      "end": 478.6400146484375,
      "text": " The only one that we should really desire to please is God."
    },
    {
      "id": 158,
      "start": 478.6400146484375,
      "end": 481.55999755859375,
      "text": " And the reality is that if we walk with God"
    },
    {
      "id": 159,
      "start": 481.55999755859375,
      "end": 485.4800109863281,
      "text": " and we have that testimony that he pleased God,"
    },
    {
      "id": 160,
      "start": 485.4800109863281,
      "end": 488.4800109863281,
      "text": " then God's gonna take care of all the other things."
    },
    {
      "id": 161,
      "start": 488.4800109863281,
      "end": 491.32000732421875,
      "text": " See, I'd rather have the testimony of Enoch"
    },
    {
      "id": 162,
      "start": 491.32000732421875,
      "end": 495.67999267578125,
      "text": " that he pleased God and maybe disappointed some other people"
    },
    {
      "id": 163,
      "start": 495.67999267578125,
      "end": 498.739990234375,
      "text": " than to please some other people and disappoint God."
    },
    {
      "id": 164,
      "start": 500.79998779296875,
      "end": 503.1199951171875,
      "text": " As I think about this testimony of Enoch"
    },
    {
      "id": 165,
      "start": 503.1199951171875,
      "end": 507.8999938964844,
      "text": " in these three simple words that he pleased God,"
    },
    {
      "id": 166,
      "start": 507.8999938964844,
      "end": 510.760009765625,
      "text": " I wonder this evening how it could be said of you"
    },
    {
      "id": 167,
      "start": 510.760009765625,
      "end": 515.1199951171875,
      "text": " and how it could be said of me that we would please God."
    },
    {
      "id": 168,
      "start": 515.1199951171875,
      "end": 519.1199951171875,
      "text": " How could we live a life that's pleasing to God?"
    },
    {
      "id": 169,
      "start": 519.1199951171875,
      "end": 522.2000122070312,
      "text": " Have you ever had maybe an employer, a supervisor,"
    },
    {
      "id": 170,
      "start": 522.2000122070312,
      "end": 524.0999755859375,
      "text": " that you sought to please and found it"
    },
    {
      "id": 171,
      "start": 524.0999755859375,
      "end": 526.52001953125,
      "text": " to be quite frustrating because you just didn't know"
    },
    {
      "id": 172,
      "start": 526.52001953125,
      "end": 528.8400268554688,
      "text": " what you could do to please that person?"
    },
    {
      "id": 173,
      "start": 528.8400268554688,
      "end": 531.3599853515625,
      "text": " It didn't seem to matter from day to day,"
    },
    {
      "id": 174,
      "start": 531.3599853515625,
      "end": 532.9199829101562,
      "text": " things would shift and change"
    },
    {
      "id": 175,
      "start": 532.9199829101562,
      "end": 536.0399780273438,
      "text": " and maybe they had a shifting type of personality"
    },
    {
      "id": 176,
      "start": 536.0399780273438,
      "end": 538.3200073242188,
      "text": " and you did something yesterday that pleased them"
    },
    {
      "id": 177,
      "start": 538.3200073242188,
      "end": 540.239990234375,
      "text": " but today it's not satisfactory"
    },
    {
      "id": 178,
      "start": 540.760009765625,
      "end": 544.3599853515625,
      "text": " and it's frustrating and it just can be infuriating"
    },
    {
      "id": 179,
      "start": 544.3599853515625,
      "end": 546.52001953125,
      "text": " because some people come to the end of themselves"
    },
    {
      "id": 180,
      "start": 546.52001953125,
      "end": 550.3200073242188,
      "text": " and I just don't know what to do to please you."
    },
    {
      "id": 181,
      "start": 550.3200073242188,
      "end": 552.4000244140625,
      "text": " People can feel that way."
    },
    {
      "id": 182,
      "start": 552.4000244140625,
      "end": 553.3599853515625,
      "text": " Can I tell you this evening,"
    },
    {
      "id": 183,
      "start": 553.3599853515625,
      "end": 555.6400146484375,
      "text": " we don't ever have to feel that way with God."
    },
    {
      "id": 184,
      "start": 556.780029296875,
      "end": 557.9199829101562,
      "text": " You know why?"
    },
    {
      "id": 185,
      "start": 557.9199829101562,
      "end": 560.8599853515625,
      "text": " He's given us a full Bible and he's told us"
    },
    {
      "id": 186,
      "start": 560.8599853515625,
      "end": 564.1599731445312,
      "text": " within the pages of this wonderful book what pleases him"
    },
    {
      "id": 187,
      "start": 565.4000244140625,
      "end": 568.5999755859375,
      "text": " and he's told us those things that do not please him"
    },
    {
      "id": 188,
      "start": 568.5999755859375,
      "end": 570.0,
      "text": " and we ought to be thankful for that."
    },
    {
      "id": 189,
      "start": 570.760009765625,
      "end": 573.5599975585938,
      "text": " We ought to rejoice in knowing that God has given us"
    },
    {
      "id": 190,
      "start": 573.5599975585938,
      "end": 578.1599731445312,
      "text": " in his word the revelation of not only himself"
    },
    {
      "id": 191,
      "start": 578.1599731445312,
      "end": 580.7999877929688,
      "text": " but of those things that please him"
    },
    {
      "id": 192,
      "start": 580.7999877929688,
      "end": 583.1599731445312,
      "text": " so that we can take note as we study"
    },
    {
      "id": 193,
      "start": 583.1599731445312,
      "end": 584.8800048828125,
      "text": " through the pages of this book"
    },
    {
      "id": 194,
      "start": 584.8800048828125,
      "end": 587.2000122070312,
      "text": " and as we read and meditate upon the truth"
    },
    {
      "id": 195,
      "start": 587.2000122070312,
      "end": 589.9600219726562,
      "text": " that's contained therein and we find that these things"
    },
    {
      "id": 196,
      "start": 589.9600219726562,
      "end": 592.719970703125,
      "text": " please God and these things displease God"
    },
    {
      "id": 197,
      "start": 592.719970703125,
      "end": 595.5999755859375,
      "text": " that we can personally apply those things in our lives"
    },
    {
      "id": 198,
      "start": 595.5999755859375,
      "end": 596.4400024414062,
      "text": " so that why?"
    },
    {
      "id": 199,
      "start": 596.4400024414062,
      "end": 600.0,
      "text": " So that we can have that testimony that we please God."
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 602.079999923706,
      "text": " that we please God."
    },
    {
      "id": 1,
      "start": 602.079999923706,
      "end": 610.6000003814697,
      "text": " As I think about this testimony of Enoch, I am mindful of the Apostle Paul and his concern"
    },
    {
      "id": 2,
      "start": 610.6000003814697,
      "end": 615.0,
      "text": " for those that he had the opportunity to minister to, and this evening I just want to share"
    },
    {
      "id": 3,
      "start": 615.0,
      "end": 620.6399993896484,
      "text": " two thoughts with you with this idea of pleasing the Lord within the parameters, if you will,"
    },
    {
      "id": 4,
      "start": 620.6399993896484,
      "end": 622.4400005340576,
      "text": " of the ministry of the Apostle Paul."
    },
    {
      "id": 5,
      "start": 622.4400005340576,
      "end": 627.3199996948242,
      "text": " Of course, God used Paul in a great way, and Paul is a man that desired to please the Lord."
    },
    {
      "id": 6,
      "start": 627.3199996948242,
      "end": 631.3999996185303,
      "text": " We looked at Philippians 2.21, but in 1.21 he says, for me to live is Christ and to die"
    },
    {
      "id": 7,
      "start": 631.3999996185303,
      "end": 632.7200012207031,
      "text": " is gain."
    },
    {
      "id": 8,
      "start": 632.7200012207031,
      "end": 638.2799987792969,
      "text": " And I think that summarizes a life testimony of the Apostle Paul that he was living his"
    },
    {
      "id": 9,
      "start": 638.2799987792969,
      "end": 644.2400016784668,
      "text": " life in such a way that his single focused desire was to please God."
    },
    {
      "id": 10,
      "start": 644.2400016784668,
      "end": 646.7200012207031,
      "text": " I don't think Paul was concerned about pleasing Peter."
    },
    {
      "id": 11,
      "start": 646.7200012207031,
      "end": 651.7999992370605,
      "text": " I don't think Paul was concerned about pleasing Timothy or fill in the blank."
    },
    {
      "id": 12,
      "start": 651.7999992370605,
      "end": 656.0800018310547,
      "text": " Paul was concerned about pleasing God, singularly."
    },
    {
      "id": 13,
      "start": 656.0800018310547,
      "end": 660.8400001525879,
      "text": " As we understand the Apostle Paul in his own life and his ministry, God used him to"
    },
    {
      "id": 14,
      "start": 660.8400001525879,
      "end": 665.0800018310547,
      "text": " serve and minister a number of people."
    },
    {
      "id": 15,
      "start": 665.0800018310547,
      "end": 670.3199996948242,
      "text": " Churches that were established through missionary journeys, churches that were contacted and"
    },
    {
      "id": 16,
      "start": 670.3199996948242,
      "end": 674.5199966430664,
      "text": " written to under the inspiration of the Holy Spirit of God so that they would grow in their"
    },
    {
      "id": 17,
      "start": 674.5199966430664,
      "end": 679.1600036621094,
      "text": " faith, and Paul, as we look at his writing and we look at his ministry and God gives"
    },
    {
      "id": 18,
      "start": 679.1600036621094,
      "end": 685.3600006103516,
      "text": " us a picture, a glimpse into the heart of Paul, I notice this evening within the context"
    },
    {
      "id": 19,
      "start": 685.3600006103516,
      "end": 689.1999969482422,
      "text": " of this subject matter of pleasing God, if you're taking notes, number one, I want you"
    },
    {
      "id": 20,
      "start": 689.1999969482422,
      "end": 692.4800033569336,
      "text": " to consider with me the concern of the Apostle Paul."
    },
    {
      "id": 21,
      "start": 692.4800033569336,
      "end": 696.1600036621094,
      "text": " I want you to think about the Apostle Paul and his concern for those that God would give"
    },
    {
      "id": 22,
      "start": 696.1600036621094,
      "end": 698.2200012207031,
      "text": " him the opportunity to minister to."
    },
    {
      "id": 23,
      "start": 698.2200012207031,
      "end": 703.9599990844727,
      "text": " Look over the book of Ephesians, if you will, and as we look at the book of Ephesians and"
    },
    {
      "id": 24,
      "start": 703.9599990844727,
      "end": 711.0400009155273,
      "text": " understand here what's taking place and looking at the ministry of the Apostle Paul and we"
    },
    {
      "id": 25,
      "start": 711.0400009155273,
      "end": 718.5999984741211,
      "text": " find here that Paul has this understanding that as he is writing to these and as he's"
    },
    {
      "id": 26,
      "start": 718.5999984741211,
      "end": 725.8399963378906,
      "text": " had the opportunity to minister to these individuals, that he speaks about hearing, receiving a"
    },
    {
      "id": 27,
      "start": 725.8399963378906,
      "end": 729.4799957275391,
      "text": " report with regard to their walk with God."
    },
    {
      "id": 28,
      "start": 729.4799957275391,
      "end": 731.0,
      "text": " Now why is that important?"
    },
    {
      "id": 29,
      "start": 731.0,
      "end": 734.8000030517578,
      "text": " Well Paul was praying for these believers."
    },
    {
      "id": 30,
      "start": 734.8000030517578,
      "end": 738.5200042724609,
      "text": " Often you find in the letters that he writes that he's writing to them and he shares with"
    },
    {
      "id": 31,
      "start": 738.5200042724609,
      "end": 744.5200042724609,
      "text": " them how he's praying for them, but you also find that Paul is concerned on receiving a"
    },
    {
      "id": 32,
      "start": 744.5200042724609,
      "end": 751.4799957275391,
      "text": " report to know how they're doing, to understand how their walk with God is, how they've been"
    },
    {
      "id": 33,
      "start": 751.4799957275391,
      "end": 754.7200012207031,
      "text": " able to endure the attacks of the enemy."
    },
    {
      "id": 34,
      "start": 754.7200012207031,
      "end": 759.0800018310547,
      "text": " When you look at the believers in Thessalonica, he deals with that specifically, and we find"
    },
    {
      "id": 35,
      "start": 759.0800018310547,
      "end": 762.0,
      "text": " that Paul, it's revealed to us his concern."
    },
    {
      "id": 36,
      "start": 762.0,
      "end": 766.6000061035156,
      "text": " Notice with the believers in Ephesus, in Ephesians 1 and verse 15, the Bible says this,"
    },
    {
      "id": 37,
      "start": 766.6000061035156,
      "end": 775.6399993896484,
      "text": " Therefore I also, after I heard of your faith in the Lord Jesus and love unto all the saints,"
    },
    {
      "id": 38,
      "start": 775.6399993896484,
      "end": 780.0399932861328,
      "text": " cease not to give thanks for you, making mention of you in my prayers, and then we find that"
    },
    {
      "id": 39,
      "start": 780.0399932861328,
      "end": 784.3600006103516,
      "text": " Paul begins to, and we're not gonna unwrap all of what he prays throughout the end of"
    },
    {
      "id": 40,
      "start": 784.3600006103516,
      "end": 789.6000061035156,
      "text": " the chapter, but we find that Paul specifically is saying I'm praying for you."
    },
    {
      "id": 41,
      "start": 789.6000061035156,
      "end": 793.3200073242188,
      "text": " But when I think about the concern of the Apostle Paul, I want you to understand that"
    },
    {
      "id": 42,
      "start": 793.3200073242188,
      "end": 798.1999969482422,
      "text": " in the particular time, they don't have the technology that we have today, and Paul is"
    },
    {
      "id": 43,
      "start": 798.1999969482422,
      "end": 802.6399993896484,
      "text": " interested in receiving a report from these believers at Ephesus."
    },
    {
      "id": 44,
      "start": 802.6399993896484,
      "end": 807.1600036621094,
      "text": " He wants to know how they're doing in their walk with God."
    },
    {
      "id": 45,
      "start": 807.1600036621094,
      "end": 812.9199981689453,
      "text": " He wants to, he's interested, he's concerned to know if these believers at this church"
    },
    {
      "id": 46,
      "start": 812.9199981689453,
      "end": 818.3600006103516,
      "text": " in Ephesus that he was privileged, allowed of God to see planted and established, he"
    },
    {
      "id": 47,
      "start": 818.3600006103516,
      "end": 822.7200012207031,
      "text": " wants to know are they continuing in the faith, are they walking with God, are they"
    },
    {
      "id": 48,
      "start": 822.7200012207031,
      "end": 826.2799987792969,
      "text": " pleasing the Lord."
    },
    {
      "id": 49,
      "start": 826.2799987792969,
      "end": 831.9199981689453,
      "text": " We find that Paul no doubt sends and he's interested in receiving words so that he can"
    },
    {
      "id": 50,
      "start": 831.9199981689453,
      "end": 833.7200012207031,
      "text": " hear this report."
    },
    {
      "id": 51,
      "start": 833.7200012207031,
      "end": 838.2799987792969,
      "text": " We find in the book of Philippians that Paul is writing to this church, again that he had"
    },
    {
      "id": 52,
      "start": 838.2799987792969,
      "end": 845.3999938964844,
      "text": " the opportunity to be able to see established, and we find that Paul mentions even in the"
    },
    {
      "id": 53,
      "start": 845.3999938964844,
      "end": 850.4400024414062,
      "text": " first chapter again to the believers at Philippi in Philippians 1 and verse 27, notice what"
    },
    {
      "id": 54,
      "start": 850.4400024414062,
      "end": 855.9199981689453,
      "text": " he says, only let your conversation be as it becometh the gospel of Christ, that whether"
    },
    {
      "id": 55,
      "start": 855.9199981689453,
      "end": 862.3599853515625,
      "text": " I come and see you or else be absent, notice what he says, I may hear of your affairs,"
    },
    {
      "id": 56,
      "start": 862.3599853515625,
      "end": 868.760009765625,
      "text": " that you stand fast in one spirit with one mind, striving together for the faith of the"
    },
    {
      "id": 57,
      "start": 868.760009765625,
      "end": 870.1600036621094,
      "text": " gospel."
    },
    {
      "id": 58,
      "start": 870.1600036621094,
      "end": 874.6799926757812,
      "text": " Paul says, listen, whether I'm there or I cannot come, I desire to hear."
    },
    {
      "id": 59,
      "start": 874.9599914550781,
      "end": 880.0400085449219,
      "text": " I want to receive this report, I want to be aware of the fact that you're serving and"
    },
    {
      "id": 60,
      "start": 880.0400085449219,
      "end": 882.2799987792969,
      "text": " pleasing the Lord."
    },
    {
      "id": 61,
      "start": 882.2799987792969,
      "end": 887.3999938964844,
      "text": " As best we can tell, in the book of Colossians, Paul is writing to a group of people that"
    },
    {
      "id": 62,
      "start": 887.3999938964844,
      "end": 891.4800109863281,
      "text": " he never had the privilege of actually personally ministering to."
    },
    {
      "id": 63,
      "start": 891.4800109863281,
      "end": 896.8599853515625,
      "text": " The church at Colossae is not a church that Paul had the privilege of starting and establishing,"
    },
    {
      "id": 64,
      "start": 896.8599853515625,
      "end": 903.6400146484375,
      "text": " but we find that Paul hears about their faith, he receives word about this group of believers"
    },
    {
      "id": 65,
      "start": 903.6400146484375,
      "end": 909.7200012207031,
      "text": " in the city of Colossae, and we find that Paul, when he heard about their walk with"
    },
    {
      "id": 66,
      "start": 909.7200012207031,
      "end": 914.6000061035156,
      "text": " God, it was encouraging to him, and he then sends a letter, yes, under the inspiration"
    },
    {
      "id": 67,
      "start": 914.6000061035156,
      "end": 920.5199890136719,
      "text": " of the Holy Spirit of God, but in that letter, he reveals to them how he's praying for them"
    },
    {
      "id": 68,
      "start": 920.5199890136719,
      "end": 925.4800109863281,
      "text": " that they would please God, that they would serve the Lord, that they would stand fast,"
    },
    {
      "id": 69,
      "start": 925.4800109863281,
      "end": 928.239990234375,
      "text": " that they would continue in the faith."
    },
    {
      "id": 70,
      "start": 928.239990234375,
      "end": 932.7999877929688,
      "text": " Notice the Bible says in Colossians 1 and verse number 3, we give thanks to God and"
    },
    {
      "id": 71,
      "start": 932.7999877929688,
      "end": 939.3599853515625,
      "text": " the Father of our Lord Jesus Christ, praying always for you, since we heard of your faith"
    },
    {
      "id": 72,
      "start": 939.3599853515625,
      "end": 945.6799926757812,
      "text": " in Christ Jesus, and of the love which you have to all the saints, and we find that the"
    },
    {
      "id": 73,
      "start": 945.6799926757812,
      "end": 951.6600036621094,
      "text": " Apostle Paul, if you were to read verses 9 through 14, you can see the content really"
    },
    {
      "id": 74,
      "start": 951.6600036621094,
      "end": 954.0799865722656,
      "text": " of how he's praying for their growth."
    },
    {
      "id": 75,
      "start": 954.0799865722656,
      "end": 961.5599975585938,
      "text": " Notice specifically in verse number 10, that ye might walk worthy of the Lord unto all"
    },
    {
      "id": 76,
      "start": 961.9599914550781,
      "end": 963.6400146484375,
      "text": " pleasing."
    },
    {
      "id": 77,
      "start": 963.6400146484375,
      "end": 966.3200073242188,
      "text": " What's Paul's concern for these believers in Colossae?"
    },
    {
      "id": 78,
      "start": 966.3200073242188,
      "end": 971.6400146484375,
      "text": " That they would have the testimony that Enoch had, that they pleased God."
    },
    {
      "id": 79,
      "start": 971.6400146484375,
      "end": 977.3200073242188,
      "text": " He's praying to that end, that they would walk worthy of the Lord unto all pleasing."
    },
    {
      "id": 80,
      "start": 977.3200073242188,
      "end": 985.3200073242188,
      "text": " Notice it says, being fruitful in every good work, and increasing in the knowledge of God."
    },
    {
      "id": 81,
      "start": 986.3200073242188,
      "end": 994.0,
      "text": " It's a great study to study the prayers of the Apostle Paul, and then to take as we learn"
    },
    {
      "id": 82,
      "start": 994.0,
      "end": 1001.3599853515625,
      "text": " how Paul prayed for believers, and to incorporate those same truths in our prayer lives."
    },
    {
      "id": 83,
      "start": 1001.3599853515625,
      "end": 1007.3999938964844,
      "text": " So often, if we're not careful, our prayer time consists of more temporal things one"
    },
    {
      "id": 84,
      "start": 1007.3999938964844,
      "end": 1012.4400024414062,
      "text": " for another, than spiritual things."
    },
    {
      "id": 85,
      "start": 1012.5599975585938,
      "end": 1017.7200012207031,
      "text": " And we find that as you would read the prayers of the Apostle Paul, as he's writing to these"
    },
    {
      "id": 86,
      "start": 1017.7200012207031,
      "end": 1024.0400085449219,
      "text": " believers, that they are full of spiritual truth."
    },
    {
      "id": 87,
      "start": 1024.0400085449219,
      "end": 1025.9599914550781,
      "text": " He's praying for their spiritual growth."
    },
    {
      "id": 88,
      "start": 1025.9599914550781,
      "end": 1029.6000061035156,
      "text": " He's praying here that they would be fruitful in every good work, as it's already been said"
    },
    {
      "id": 89,
      "start": 1029.6000061035156,
      "end": 1034.0599975585938,
      "text": " by our missionary and by Brianna during the testimony time."
    },
    {
      "id": 90,
      "start": 1034.0599975585938,
      "end": 1038.7200012207031,
      "text": " We don't do good works to get saved or to stay saved."
    },
    {
      "id": 91,
      "start": 1038.7200012207031,
      "end": 1046.9599914550781,
      "text": " As you study through the pages of God's precious Word, you find that salvation is a free gift."
    },
    {
      "id": 92,
      "start": 1046.9599914550781,
      "end": 1051.4400024414062,
      "text": " He didn't just put a down payment on your salvation."
    },
    {
      "id": 93,
      "start": 1051.4400024414062,
      "end": 1054.2000122070312,
      "text": " He paid for it all."
    },
    {
      "id": 94,
      "start": 1054.2000122070312,
      "end": 1058.5599975585938,
      "text": " There's nothing you can do to earn or to keep your salvation."
    },
    {
      "id": 95,
      "start": 1058.5599975585938,
      "end": 1063.5199890136719,
      "text": " We are kept by the power of God, and for that we must rejoice."
    },
    {
      "id": 96,
      "start": 1063.5199890136719,
      "end": 1070.3200073242188,
      "text": " But we find that Paul is concerned that these believers in Ephesus, in Philippi, in Colossae,"
    },
    {
      "id": 97,
      "start": 1070.3200073242188,
      "end": 1074.9599914550781,
      "text": " that they would have this testimony that they pleased God."
    },
    {
      "id": 98,
      "start": 1074.9599914550781,
      "end": 1080.260009765625,
      "text": " Notice in the book of 1 Thessalonians, I mentioned earlier how Paul is so concerned for this"
    },
    {
      "id": 99,
      "start": 1080.260009765625,
      "end": 1082.1600036621094,
      "text": " group of believers."
    },
    {
      "id": 100,
      "start": 1082.1600036621094,
      "end": 1087.7200012207031,
      "text": " It's interesting when you see the heart of the Apostle Paul here with the group of believers"
    },
    {
      "id": 101,
      "start": 1087.7200012207031,
      "end": 1089.3999938964844,
      "text": " in Thessalonica."
    },
    {
      "id": 102,
      "start": 1089.3999938964844,
      "end": 1092.760009765625,
      "text": " And you know that his time was short there in Thessalonica."
    },
    {
      "id": 103,
      "start": 1092.760009765625,
      "end": 1097.5599975585938,
      "text": " Those that were against him and the enemy, they ran him out of town very quickly."
    },
    {
      "id": 104,
      "start": 1097.5599975585938,
      "end": 1101.9599914550781,
      "text": " But we find that in 1 Thessalonians 2, in verse number 12, notice the Bible says that"
    },
    {
      "id": 105,
      "start": 1101.9599914550781,
      "end": 1108.1199951171875,
      "text": " you would walk worthy of God, who hath called you into his kingdom and glory."
    },
    {
      "id": 106,
      "start": 1108.1199951171875,
      "end": 1109.1199951171875,
      "text": " Think about that."
    },
    {
      "id": 107,
      "start": 1109.1199951171875,
      "end": 1112.3200073242188,
      "text": " Again, pleasing God, that he pleased God, that's what it said of Enoch."
    },
    {
      "id": 108,
      "start": 1112.3200073242188,
      "end": 1115.239990234375,
      "text": " Here he says that they would walk worthy of God."
    },
    {
      "id": 109,
      "start": 1115.239990234375,
      "end": 1120.0399780273438,
      "text": " I do not think that it would be inappropriate to say that those terminologies could be used"
    },
    {
      "id": 110,
      "start": 1120.0399780273438,
      "end": 1121.0399780273438,
      "text": " synonymously."
    },
    {
      "id": 111,
      "start": 1121.0399780273438,
      "end": 1125.0800170898438,
      "text": " That they'd walk worthy of God, that they would please God."
    },
    {
      "id": 112,
      "start": 1125.0800170898438,
      "end": 1131.0,
      "text": " And we find here that Paul has that desire, he has that concern for these believers in"
    },
    {
      "id": 113,
      "start": 1131.0,
      "end": 1132.0,
      "text": " Thessalonica."
    },
    {
      "id": 114,
      "start": 1132.0,
      "end": 1135.0399780273438,
      "text": " In chapter 3, in verse number 1, it says,"
    },
    {
      "id": 115,
      "start": 1135.0399780273438,
      "end": 1140.719970703125,
      "text": " Wherefore, when we could no longer forbear, we thought it good to be left in Athens alone"
    },
    {
      "id": 116,
      "start": 1140.719970703125,
      "end": 1145.52001953125,
      "text": " and sent Timotheus our brother and minister of God and our fellow laborer in the gospel"
    },
    {
      "id": 117,
      "start": 1145.52001953125,
      "end": 1150.1199951171875,
      "text": " of Christ to establish you and to comfort you concerning your faith."
    },
    {
      "id": 118,
      "start": 1150.1199951171875,
      "end": 1151.1199951171875,
      "text": " Why?"
    },
    {
      "id": 119,
      "start": 1151.1199951171875,
      "end": 1154.1599731445312,
      "text": " That no man should be moved by these afflictions for yourselves."
    },
    {
      "id": 120,
      "start": 1154.1599731445312,
      "end": 1158.5800170898438,
      "text": " Know that we are appointed thereunto, for verily when we were with you, we told you"
    },
    {
      "id": 121,
      "start": 1158.5800170898438,
      "end": 1164.1199951171875,
      "text": " before that we should suffer tribulation, even as it has come to pass, and ye know."
    },
    {
      "id": 122,
      "start": 1164.1199951171875,
      "end": 1165.1199951171875,
      "text": " For this cause."
    },
    {
      "id": 123,
      "start": 1165.1199951171875,
      "end": 1167.1199951171875,
      "text": " Notice what Paul says."
    },
    {
      "id": 124,
      "start": 1167.1199951171875,
      "end": 1173.3200073242188,
      "text": " When I could no longer forbear, I sent to know your faith."
    },
    {
      "id": 125,
      "start": 1173.3200073242188,
      "end": 1179.52001953125,
      "text": " And that's concern on the part of the spiritual leader, the apostle Paul."
    },
    {
      "id": 126,
      "start": 1179.52001953125,
      "end": 1180.52001953125,
      "text": " Why does Paul care?"
    },
    {
      "id": 127,
      "start": 1180.52001953125,
      "end": 1182.8800048828125,
      "text": " Because he knows they're going to stand before Christ one day."
    },
    {
      "id": 128,
      "start": 1182.8800048828125,
      "end": 1188.719970703125,
      "text": " And he wants them to be able to have that testimony that they pleased God."
    },
    {
      "id": 129,
      "start": 1188.719970703125,
      "end": 1191.8800048828125,
      "text": " Did Paul have that desire himself?"
    },
    {
      "id": 130,
      "start": 1191.8800048828125,
      "end": 1193.0800170898438,
      "text": " Absolutely."
    },
    {
      "id": 131,
      "start": 1193.0800170898438,
      "end": 1197.239990234375,
      "text": " But Paul had that desire, that concern for those that God would enable him to minister"
    },
    {
      "id": 132,
      "start": 1197.239990234375,
      "end": 1198.239990234375,
      "text": " to."
    },
    {
      "id": 133,
      "start": 1198.239990234375,
      "end": 1199.9199829101562,
      "text": " He continues in verse number five and says,"
    },
    {
      "id": 0,
      "start": 1199.9199829101562,
      "end": 1206.0799827575684,
      "text": " Lest by some means the tempter have tempted you and our labor be in vain"
    },
    {
      "id": 1,
      "start": 1207.3199830055237,
      "end": 1209.3199825286865,
      "text": " We have an enemy"
    },
    {
      "id": 2,
      "start": 1209.519983291626,
      "end": 1214.559983253479,
      "text": " We have an enemy and the Bible tells us the enemy is seeking whom he may devour"
    },
    {
      "id": 3,
      "start": 1215.519983291626,
      "end": 1217.519983291626,
      "text": " That's what the enemy is doing. He's active"
    },
    {
      "id": 4,
      "start": 1218.679983139038,
      "end": 1224.9999828338623,
      "text": " And we find that Paul I love the language in verse number five when he says when I could no longer forbear"
    },
    {
      "id": 5,
      "start": 1224.9999828338623,
      "end": 1229.3199825286865,
      "text": " I mean Paul was in a position. He's like I just need to know"
    },
    {
      "id": 6,
      "start": 1229.9199829101562,
      "end": 1237.43998336792,
      "text": " I need to know how they're doing. He's not concerned about a physical condition. He's concerned about their spiritual well-being"
    },
    {
      "id": 7,
      "start": 1239.039981842041,
      "end": 1242.5199813842773,
      "text": " It's interesting to me that so often in our lives today"
    },
    {
      "id": 8,
      "start": 1243.3999824523926,
      "end": 1251.1999816894531,
      "text": " Even in our everyday conversation with brothers and sisters in Christ our conversation primarily consists of how are you doing?"
    },
    {
      "id": 9,
      "start": 1251.7999839782715,
      "end": 1253.7999839782715,
      "text": " temporally"
    },
    {
      "id": 10,
      "start": 1254.7999839782715,
      "end": 1255.999984741211,
      "text": " It's"
    },
    {
      "id": 11,
      "start": 1255.999984741211,
      "end": 1262.0799827575684,
      "text": " Not very common that even a brother or sister in Christ has a conversation with another brother or sister in Christ"
    },
    {
      "id": 12,
      "start": 1262.0799827575684,
      "end": 1265.999984741211,
      "text": " Hey, how are your devotions going? How's your time with God?"
    },
    {
      "id": 13,
      "start": 1266.7599792480469,
      "end": 1269.2399826049805,
      "text": " What are you reading? How's God working in your life?"
    },
    {
      "id": 14,
      "start": 1271.3199844360352,
      "end": 1277.8399810791016,
      "text": " Seems like those are questions that almost we act as if are off limits in conversations"
    },
    {
      "id": 15,
      "start": 1279.1199798583984,
      "end": 1281.1199798583984,
      "text": " Brethren, it ought not be the case. I"
    },
    {
      "id": 16,
      "start": 1282.1199798583984,
      "end": 1286.5599822998047,
      "text": " Remember in 2018 meeting a pastor that I'd never met before and"
    },
    {
      "id": 17,
      "start": 1287.47998046875,
      "end": 1289.7599792480469,
      "text": " Kimberly, you know pastor Scotty Buckhouse"
    },
    {
      "id": 18,
      "start": 1289.7599792480469,
      "end": 1291.7599792480469,
      "text": " I think when your family was traveling you"
    },
    {
      "id": 19,
      "start": 1291.8399810791016,
      "end": 1296.9199829101562,
      "text": " Met him and I met him in 2018 never met them fella before my life brother Armando"
    },
    {
      "id": 20,
      "start": 1296.9199829101562,
      "end": 1302.3199844360352,
      "text": " We sat down at a big table and he sat across from me to eat lunch and I just met him. Hi, I'm Scotty"
    },
    {
      "id": 21,
      "start": 1302.3199844360352,
      "end": 1304.3199844360352,
      "text": " Hi, I'm Chris just met him"
    },
    {
      "id": 22,
      "start": 1304.6799850463867,
      "end": 1310.999984741211,
      "text": " Sit down to eat lunch. We prayed and he said brother. How are your devotions? What's God teaching you in his word?"
    },
    {
      "id": 23,
      "start": 1311.47998046875,
      "end": 1313.5599822998047,
      "text": " And I was excited by that. I"
    },
    {
      "id": 24,
      "start": 1314.0799865722656,
      "end": 1319.719985961914,
      "text": " Was encouraged I wasn't offended by that and we had one of the best conversations"
    },
    {
      "id": 25,
      "start": 1320.0399856567383,
      "end": 1322.5599822998047,
      "text": " Talking about what God's teaching us in our own lives"
    },
    {
      "id": 26,
      "start": 1323.3599853515625,
      "end": 1325.0399856567383,
      "text": " It was awesome"
    },
    {
      "id": 27,
      "start": 1325.0399856567383,
      "end": 1327.0399856567383,
      "text": " But you know how rare that is"
    },
    {
      "id": 28,
      "start": 1327.47998046875,
      "end": 1331.719985961914,
      "text": " So rare, but Paul says I could no longer forbear"
    },
    {
      "id": 29,
      "start": 1331.719985961914,
      "end": 1336.959976196289,
      "text": " I just had to know how they were doing why because he's concerned that they're pleasing God"
    },
    {
      "id": 30,
      "start": 1337.6799774169922,
      "end": 1343.8799896240234,
      "text": " It wasn't concerned how they were doing financially how the job was going how this was going how that how are you doing spiritually?"
    },
    {
      "id": 31,
      "start": 1344.3999786376953,
      "end": 1346.3999786376953,
      "text": " How are you doing spiritually?"
    },
    {
      "id": 32,
      "start": 1346.5199890136719,
      "end": 1348.5199890136719,
      "text": " Not only do we see the concern of Paul"
    },
    {
      "id": 33,
      "start": 1349.3199768066406,
      "end": 1351.999984741211,
      "text": " Quickly, we see the charge from Paul"
    },
    {
      "id": 34,
      "start": 1352.5199890136719,
      "end": 1357.7999877929688,
      "text": " Paul gives a charge to those that he's ministering to that aligns with his concern for them"
    },
    {
      "id": 35,
      "start": 1357.7999877929688,
      "end": 1362.0399780273438,
      "text": " and we find again as we look at some of these same passages scripture go back if you were to the book of"
    },
    {
      "id": 36,
      "start": 1362.0399780273438,
      "end": 1364.0399780273438,
      "text": " Ephesians in chapter 5"
    },
    {
      "id": 37,
      "start": 1364.3599853515625,
      "end": 1366.3599853515625,
      "text": " And notice what the Bible says"
    },
    {
      "id": 38,
      "start": 1367.0799865722656,
      "end": 1369.999984741211,
      "text": " Ephesians 5 as we consider the charge of the Apostle Paul"
    },
    {
      "id": 39,
      "start": 1370.9199829101562,
      "end": 1375.5199890136719,
      "text": " Why would he say this to these believers that he's writing to these?"
    },
    {
      "id": 40,
      "start": 1377.0399780273438,
      "end": 1382.3999786376953,
      "text": " Saints at Ephesus, why would he say these things because he wants them to have the testimony that they please God"
    },
    {
      "id": 41,
      "start": 1383.5999755859375,
      "end": 1389.1199798583984,
      "text": " And he says to them in in Ephesians 5 and beginning in verse number one be therefore"
    },
    {
      "id": 42,
      "start": 1389.6799774169922,
      "end": 1394.1599884033203,
      "text": " followers of God as dear children follow the Lord and"
    },
    {
      "id": 43,
      "start": 1395.1599884033203,
      "end": 1401.5999755859375,
      "text": " Walk in love as Christ hath also hath loved us and hath given himself for us an offering and a sacrifice of God for a"
    },
    {
      "id": 44,
      "start": 1401.5999755859375,
      "end": 1402.6399841308594,
      "text": " sweet-smelling"
    },
    {
      "id": 45,
      "start": 1402.6399841308594,
      "end": 1405.8599853515625,
      "text": " savor he then goes through a number of things to avoid and to"
    },
    {
      "id": 46,
      "start": 1406.3999786376953,
      "end": 1410.3199768066406,
      "text": " To not be partakers of and then he says this notice as we"
    },
    {
      "id": 47,
      "start": 1410.999984741211,
      "end": 1418.1199798583984,
      "text": " Look at the the statement in verse number 10. He says proving what is acceptable unto the Lord"
    },
    {
      "id": 48,
      "start": 1418.8399810791016,
      "end": 1421.239990234375,
      "text": " So what's he saying to these believers of Ephesus?"
    },
    {
      "id": 49,
      "start": 1421.47998046875,
      "end": 1423.8799896240234,
      "text": " Listen you have a responsibility to prove"
    },
    {
      "id": 50,
      "start": 1424.5599822998047,
      "end": 1427.5199890136719,
      "text": " What is pleasing what is acceptable unto the Lord?"
    },
    {
      "id": 51,
      "start": 1427.8399810791016,
      "end": 1434.5599822998047,
      "text": " here are some things that you ought not do in fact as you look and you study here in the in the previous chapter in"
    },
    {
      "id": 52,
      "start": 1435.6799774169922,
      "end": 1439.239990234375,
      "text": " Ephesians chapter before you find beginning in verse 17 down through the end"
    },
    {
      "id": 53,
      "start": 1439.239990234375,
      "end": 1445.3999786376953,
      "text": " he talks about this principle that we see in the book of Colossians as well the put off put on principle and"
    },
    {
      "id": 54,
      "start": 1446.2799835205078,
      "end": 1453.2799835205078,
      "text": " Why is the Apostle Paul telling these believers in Ephesus to put off these things and to put on these things"
    },
    {
      "id": 55,
      "start": 1453.2799835205078,
      "end": 1457.5199890136719,
      "text": " Why is he telling them to prove what is acceptable unto the Lord for this purpose?"
    },
    {
      "id": 56,
      "start": 1458.3199768066406,
      "end": 1460.3199768066406,
      "text": " They please God"
    },
    {
      "id": 57,
      "start": 1460.8399963378906,
      "end": 1462.8399963378906,
      "text": " They please God"
    },
    {
      "id": 58,
      "start": 1464.239990234375,
      "end": 1469.6799926757812,
      "text": " We read Colossians 1 10 already turn to the book of 1st Thessalonians and we'll look there very quickly"
    },
    {
      "id": 59,
      "start": 1470.5599975585938,
      "end": 1477.719970703125,
      "text": " At what the Apostle Paul says to these that he needed to know their affairs he needed to know what was"
    },
    {
      "id": 60,
      "start": 1478.1999816894531,
      "end": 1480.1999816894531,
      "text": " Going on in their lives spiritually"
    },
    {
      "id": 61,
      "start": 1481.8799743652344,
      "end": 1485.239990234375,
      "text": " We find that in 1st Thessalonians 2 in verse number 4"
    },
    {
      "id": 62,
      "start": 1485.9599914550781,
      "end": 1489.8799743652344,
      "text": " Notice what Paul says it's a great perspective that he had for ministry"
    },
    {
      "id": 63,
      "start": 1490.0399780273438,
      "end": 1494.719970703125,
      "text": " He says but as we were allowed of God to be put in trust with the gospel"
    },
    {
      "id": 64,
      "start": 1494.719970703125,
      "end": 1498.9599914550781,
      "text": " Even so we speak not as pleasing men, but God which triath our hearts"
    },
    {
      "id": 65,
      "start": 1499.2799682617188,
      "end": 1504.5199890136719,
      "text": " so keeping in mind that Paul is sharing with them their his perspective of the"
    },
    {
      "id": 66,
      "start": 1504.8799743652344,
      "end": 1508.8399963378906,
      "text": " Privilege that they had that they were allowed of God to be entrusted with the gospel"
    },
    {
      "id": 67,
      "start": 1508.8399963378906,
      "end": 1512.6399841308594,
      "text": " Even as we have been allowed of God to be entrusted with the gospel"
    },
    {
      "id": 68,
      "start": 1512.6399841308594,
      "end": 1515.719970703125,
      "text": " But you notice that he says that he wanted to please God"
    },
    {
      "id": 69,
      "start": 1515.7999877929688,
      "end": 1521.1999816894531,
      "text": " He doesn't want to please men but look at chapter 4 in verse number 1 because he gives them a charge"
    },
    {
      "id": 70,
      "start": 1521.1999816894531,
      "end": 1526.739990234375,
      "text": " It wasn't enough for the Apostle Paul to just have the personal desire that he would please God"
    },
    {
      "id": 71,
      "start": 1526.8399963378906,
      "end": 1530.3199768066406,
      "text": " But he wanted to give a charge to those that he was spiritually"
    },
    {
      "id": 72,
      "start": 1531.1599731445312,
      "end": 1536.3599853515625,
      "text": " Ministering to that they too would please the Lord notice in verse number 1 of chapter 4 furthermore"
    },
    {
      "id": 73,
      "start": 1536.3599853515625,
      "end": 1540.0799865722656,
      "text": " Then we beseech you brethren and exhort you by the Lord Jesus"
    },
    {
      "id": 74,
      "start": 1540.8799743652344,
      "end": 1548.7999877929688,
      "text": " That is he as he have received of us notice when he says how ye ought to walk and to please God"
    },
    {
      "id": 75,
      "start": 1549.4399719238281,
      "end": 1551.8399963378906,
      "text": " So you would abound more and more"
    },
    {
      "id": 76,
      "start": 1554.239990234375,
      "end": 1557.0399780273438,
      "text": " What's his desire that they would please God"
    },
    {
      "id": 77,
      "start": 1557.47998046875,
      "end": 1564.0399780273438,
      "text": " His charge to them is that they would live their lives in such a way that they would please the Lord"
    },
    {
      "id": 78,
      "start": 1564.3999938964844,
      "end": 1570.8399963378906,
      "text": " Let me close with this charge in 2nd Timothy. We're familiar with chapter 2 in verse number 2"
    },
    {
      "id": 79,
      "start": 1571.4399719238281,
      "end": 1577.5199890136719,
      "text": " When the Apostle Paul is giving this charge to Timothy his son in the faith and he speaks to him about"
    },
    {
      "id": 80,
      "start": 1577.9199829101562,
      "end": 1581.239990234375,
      "text": " the importance of influence and generational influence"
    },
    {
      "id": 81,
      "start": 1581.4399719238281,
      "end": 1588.8399963378906,
      "text": " but we notice that in the same chapter that the Apostle Paul is is giving a charge to Timothy and even to"
    },
    {
      "id": 82,
      "start": 1588.9199829101562,
      "end": 1595.8799743652344,
      "text": " Us this evening and to all of those that God has enlisted into his army that we would please him notice in verse number 3"
    },
    {
      "id": 83,
      "start": 1595.8799743652344,
      "end": 1602.3199768066406,
      "text": " Of 2nd Timothy 2 the Bible says thou therefore endure hardness as a good soldier of Jesus Christ"
    },
    {
      "id": 84,
      "start": 1602.7999877929688,
      "end": 1609.719970703125,
      "text": " No man that worth and tangle with himself with the affairs of this life notice that he may please him who hath chosen"
    },
    {
      "id": 85,
      "start": 1610.0399780273438,
      "end": 1612.0399780273438,
      "text": " Him to be a soldier"
    },
    {
      "id": 86,
      "start": 1614.0399780273438,
      "end": 1616.9999694824219,
      "text": " Paul says I want to give you this charge that you please God"
    },
    {
      "id": 87,
      "start": 1617.7999877929688,
      "end": 1623.47998046875,
      "text": " Paul was concerned about the spiritual well-being of those that God enabled him to minister to and"
    },
    {
      "id": 88,
      "start": 1624.1599731445312,
      "end": 1626.0399780273438,
      "text": " Then he gives the charge"
    },
    {
      "id": 89,
      "start": 1626.0399780273438,
      "end": 1628.3599853515625,
      "text": " Live your life in such a way that you please the Lord"
    },
    {
      "id": 90,
      "start": 1629.1599731445312,
      "end": 1634.9999694824219,
      "text": " You know, we sang several songs today in fact about heaven kind of interesting how"
    },
    {
      "id": 91,
      "start": 1636.0799865722656,
      "end": 1638.0799865722656,
      "text": " that worked together and"
    },
    {
      "id": 92,
      "start": 1638.47998046875,
      "end": 1640.47998046875,
      "text": " We will see him one day face to face"
    },
    {
      "id": 93,
      "start": 1641.2799682617188,
      "end": 1643.7599792480469,
      "text": " What a wonderful wonderful Bible truth that is"
    },
    {
      "id": 94,
      "start": 1645.6799926757812,
      "end": 1652.5599975585938,
      "text": " But I wonder this evening if we'll hear that we pleased God"
    },
    {
      "id": 95,
      "start": 1653.5599975585938,
      "end": 1655.5599975585938,
      "text": " As"
    },
    {
      "id": 96,
      "start": 1656.3199768066406,
      "end": 1658.8399963378906,
      "text": " We think about how our life might be summarized"
    },
    {
      "id": 97,
      "start": 1658.8399963378906,
      "end": 1665.0399780273438,
      "text": " I think about the teenagers and being at camp and all of the the pressures that they have at the"
    },
    {
      "id": 98,
      "start": 1665.1599731445312,
      "end": 1667.1599731445312,
      "text": " time that they're in in life and"
    },
    {
      "id": 99,
      "start": 1667.3599853515625,
      "end": 1672.6399841308594,
      "text": " Do this and do that and chase this and do what makes you all of those things that they hear"
    },
    {
      "id": 100,
      "start": 1672.9999694824219,
      "end": 1674.719970703125,
      "text": " I'm to please God"
    },
    {
      "id": 101,
      "start": 1674.719970703125,
      "end": 1676.719970703125,
      "text": " But it's not just teenagers"
    },
    {
      "id": 102,
      "start": 1677.4399719238281,
      "end": 1679.8799743652344,
      "text": " from the youngest to the oldest"
    },
    {
      "id": 103,
      "start": 1680.7999877929688,
      "end": 1682.7999877929688,
      "text": " To every child of God"
    },
    {
      "id": 104,
      "start": 1683.5199890136719,
      "end": 1685.5199890136719,
      "text": " It ought to be that our desire"
    },
    {
      "id": 105,
      "start": 1686.5199890136719,
      "end": 1688.5199890136719,
      "text": " Is to have the testimony?"
    },
    {
      "id": 106,
      "start": 1689.8799743652344,
      "end": 1696.2799682617188,
      "text": " That is said here of Enoch he had this testimony he pleased God"
    },
    {
      "id": 107,
      "start": 1698.0799865722656,
      "end": 1700.0799865722656,
      "text": " He pleased God"
    },
    {
      "id": 108,
      "start": 1700.2799682617188,
      "end": 1705.5999755859375,
      "text": " I'm not asking you to summarize your life. I'm not asking us to"
    },
    {
      "id": 109,
      "start": 1707.1199951171875,
      "end": 1709.1199951171875,
      "text": " Proclaim our own goodness"
    },
    {
      "id": 110,
      "start": 1709.8799743652344,
      "end": 1713.4400024414062,
      "text": " I'm saying as we evaluate. I've said this so often from this pulpit"
    },
    {
      "id": 111,
      "start": 1714.8800048828125,
      "end": 1717.2799682617188,
      "text": " Self-examination requires humility and honesty"
    },
    {
      "id": 112,
      "start": 1718.760009765625,
      "end": 1721.2000122070312,
      "text": " It's easy for us to just say oh, yeah, I'm pleasing God"
    },
    {
      "id": 113,
      "start": 1722.2799682617188,
      "end": 1724.2799682617188,
      "text": " Take some time evaluate"
    },
    {
      "id": 114,
      "start": 1725.3200073242188,
      "end": 1730.5199584960938,
      "text": " Prove what is acceptable unto the Lord, you know proving is is a process"
    },
    {
      "id": 115,
      "start": 1731.719970703125,
      "end": 1735.760009765625,
      "text": " It was used that term in Ephesians 510 that's used with metal work"
    },
    {
      "id": 116,
      "start": 1736.2000122070312,
      "end": 1742.9599609375,
      "text": " And you're proving those metals and you're you're heating them up to get the the impurities out and all that's taking place"
    },
    {
      "id": 117,
      "start": 1742.9599609375,
      "end": 1746.3200073242188,
      "text": " and that's the term they would understand that and"
    },
    {
      "id": 118,
      "start": 1747.2799682617188,
      "end": 1751.239990234375,
      "text": " God says to us proving what is acceptable unto the Lord. How do we do that?"
    },
    {
      "id": 119,
      "start": 1752.3200073242188,
      "end": 1754.3200073242188,
      "text": " Compare scripture with scripture"
    },
    {
      "id": 120,
      "start": 1755.1199951171875,
      "end": 1758.9599609375,
      "text": " Here's this thing that I'm thinking about doing or this okay"
    },
    {
      "id": 121,
      "start": 1758.9599609375,
      "end": 1765.5599975585938,
      "text": " How does it please God does it not please God and I'm gonna prove what is acceptable unto the Lord. It's a process"
    },
    {
      "id": 122,
      "start": 1765.8399658203125,
      "end": 1767.8399658203125,
      "text": " It's work"
    },
    {
      "id": 123,
      "start": 1767.9599609375,
      "end": 1771.6799926757812,
      "text": " But it's worth it. Why because we can have this testimony"
    },
    {
      "id": 124,
      "start": 1772.7999877929688,
      "end": 1777.8399658203125,
      "text": " They pleased God. I hope tonight as we think about this"
    },
    {
      "id": 125,
      "start": 1778.9199829101562,
      "end": 1781.760009765625,
      "text": " simple statement in Hebrews 11 5"
    },
    {
      "id": 126,
      "start": 1782.8399658203125,
      "end": 1786.8399658203125,
      "text": " Absolutely, just captivate at my attention this week. I just couldn't get away from it and"
    },
    {
      "id": 127,
      "start": 1787.7999877929688,
      "end": 1789.7999877929688,
      "text": " I just wonder tonight"
    },
    {
      "id": 128,
      "start": 1790.2799682617188,
      "end": 1792.2799682617188,
      "text": " Do we really have a desire?"
    },
    {
      "id": 129,
      "start": 1792.2799682617188,
      "end": 1800.0,
      "text": " That our lives are pleasing to God above everything else that it would be"
    },
    {
      "id": 0,
      "start": 1800.0,
      "end": 1805.7199997901917,
      "text": " be said of us that we have this testimony that we please God. Let's pray. Father, we"
    },
    {
      "id": 1,
      "start": 1805.7199997901917,
      "end": 1811.159999847412,
      "text": " love you. We thank you for loving us. Thank you for the testimony of Enoch. Thank you"
    },
    {
      "id": 2,
      "start": 1811.159999847412,
      "end": 1821.920000076294,
      "text": " for the complete canon of Scripture. You've given us truth. You've revealed to us those"
    },
    {
      "id": 3,
      "start": 1821.920000076294,
      "end": 1829.2000007629395,
      "text": " things that please you. You've revealed to us those things that do not please you. God,"
    },
    {
      "id": 4,
      "start": 1829.2000007629395,
      "end": 1840.2400016784668,
      "text": " I pray that we'd have that desire that above all else we would please you. Help us, God,"
    },
    {
      "id": 5,
      "start": 1840.2400016784668,
      "end": 1846.5200004577637,
      "text": " to prove what is acceptable in the sight of God. I pray that as we have a moment of invitation"
    },
    {
      "id": 6,
      "start": 1846.5200004577637,
      "end": 1850.9599990844727,
      "text": " tonight, I pray, Lord, that you'd work in hearts and lives. Help us, Lord, to be honest"
    },
    {
      "id": 7,
      "start": 1850.9599990844727,
      "end": 1858.6399993896484,
      "text": " and humble. Help us, Lord, to truly seek to live our lives in such a way that it would"
    },
    {
      "id": 8,
      "start": 1858.6399993896484,
      "end": 1865.599998474121,
      "text": " be a Philippians 121 for me to live as Christ, not a Philippians 221 that all seek their"
    },
    {
      "id": 9,
      "start": 1865.599998474121,
      "end": 1872.3199996948242,
      "text": " own. I pray, God, that you would move and work as only you can. We'll thank you for"
    },
    {
      "id": 10,
      "start": 1872.3199996948242,
      "end": 1874.400001525879,
      "text": " every decision. For it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T01:21:23.801242"
}