{
  "video_id": "TeWW6mhl9W8",
  "text": "And what a great joy to know the Lord Jesus Christ as your personal Savior. And thankful for those songs that we're able to sing today. Thankful for that special Hebrews chapter number 11. Hebrews chapter number 11 this morning. And we'll be in Hebrews chapter number 11 for a few weeks. I mentioned as we began Hebrews chapter number 11 two Sunday mornings ago, Now Faith Is, that was the title for the message. And we looked at the first three verses. And this morning we'll be looking at verses 4 through 7. And as we look at the passage of Scripture that is before us and over the next several weeks as we examine Hebrews chapter 11, we find that the Word of God provides us with a list of individuals who lived by faith. We understand that the original recipients of this book, the Jewish believers in the first century, that they would have had an awareness of these individuals that are referenced by name. They would have understood and been familiar with the accounts that are referenced. And these same individuals had been encouraged, we remember back in Hebrews chapter number 6, that they are to go on. And we find that at the end of chapter number 10 that they are challenged to live by faith. And we understand the quote from Habakkuk that is referenced not only here in the book of Hebrews, but also Paul uses it in Romans and again in Galatians, that the just shall live by faith. And these believers had been challenged and they had been given, or they now are being given a sampling of those that have gone before them who indeed lived by faith. And as we consider these particular folks that are mentioned throughout Hebrews chapter 11, I believe that it is noteworthy that we recognize this morning that every era of human history had believers that lived by faith. These believers were living in the first century, and as we go through the Old Testament we find, first of all, starting there with Abel in verse number 4, and we'll begin looking at that here in just a moment, but we find that it begins all the way back in the book of Genesis, and we find that he goes through the entire era of the prophets, and he mentions many people. Of course, there are some that he mentions specifically by name, and there are others that he just kind of says, hey, we don't have the time to deal with all of these individuals. And he goes through and he provides some lists, and what a blessing to consider this morning that throughout all of human history there have been people that have believed God, and they have lived by faith. I believe this morning that if we would do a survey over the last 2,000 years of church history, that you could trace and you could find individuals, no, they're not in the canon of Scripture, but you can find individual believers that lived by faith. And this morning, we are challenged as believers in 2020 to live by faith. That we are to take God at His Word, that we're to believe what God has said, and that God will do what He says He will do. I believe that the list of folks that are mentioned here in Hebrews 11, it encourages the people of God. When you begin to read about those that have gone before us, and you begin to read about the way in which God worked and God blessed and what God did, man, it's encouraging to read those accounts that God has provided us with in His precious Word. But I believe that more than just being encouraged, that we ought to be challenged in our own lives to live by faith. I wonder this morning of how many of us, if God were to make mention this morning of those in 2020, how many of us would find ourselves on the roll of they lived by faith? As we look at our passage of Scripture, and if you're taking notes, I've simply entitled the message this morning, Living by Faith, Part 1. We're going to have a multi-part series with the same title as we go through here in Hebrews 11. But notice with me in verse number 4, the Bible says, \"...by faith Abel offered unto God a more excellent sacrifice than Cain, by which he obtained witness that he was righteous, God testifying of his gifts, and by it he being dead yet speaketh.\" Verse 5, \"...by faith Enoch was translated that he should not see death, and was not found, because God had translated him. For before his translation he had this testimony, that he pleased God. But without faith it is impossible to please him, for he that cometh to God must believe that he is, and it is the rewarder of them that diligently seek him.\" Verse 7, \"...by faith Noah, being warned of God of things not seen as yet, moved with fear, prepared an ark to the saving of his house, by the which he condemned the world and became heir of the righteousness which is by faith.\" As we examine the passage of Scripture this morning, I want you to notice with me in verse number 4, if you're taking notes, first of all, the worship of Abel. I want you to understand, it's amazing to me how the writer of Hebrews, of course, it's the Word of God, and so all Scripture is given by inspiration of God. And God goes back to creation in verse number 3, when he says, \"...through faith we understand that the worlds were framed by the Word of God, so that things which are seen were not made of things which do appear.\" And we studied that in our previous lesson two weeks ago, in this first three verses of Hebrews 11. And we find that the record of creation is referenced, of course, you can find the record of creation in Genesis 1 and 2, but it is not exclusive to the book of Genesis. You find the record and the testimony of creation throughout the whole of Scripture. And now we find that the writer of Hebrews goes to Genesis chapter number 4 and begins to discuss about an offering that was made by Abel, the son of Adam and Eve. Of course, Adam and Eve were created in the garden, and I love the fact that we start here because there are so many this morning in our world that deny creation, that dismiss the Genesis record. Of course, we've been preaching through the book of Genesis on Sunday evenings, and we've spent many, many messages through the first 11 chapters of the book of Genesis to lay that foundation and the groundwork and to understand the importance of the record of Genesis. They seek to destroy the foundation and undermine the authority of the Word of God, thus taking not only offense to what is given in Genesis 1-11, but so that they can then pick apart the whole of Scripture. And we find that the record of Genesis is absolutely true. It was accepted, as I mentioned, when he says, through faith we understand in verse number 3 how the testimony of those that believe that God is indeed the Creator of all things. We sing for our theme song this year from Psalm 121, I will lift up mine eyes into the hills, from whence cometh my help. My help cometh from the Lord, which made heaven and earth. And we find that now he references Abel, again, a reference that would help us understand the fact that these believers had an awareness and understood that the book of Genesis was a literal record that God has provided for human history. And we go back to Genesis chapter number 4, you notice here, we'll go there in just a moment, but notice what it says, By faith Abel offered unto God a more excellent sacrifice than Cain, by which he, Abel, obtained witness that he was righteous, God testifying of his gifts, and by it he being dead yet speaketh. When we think about the worship of Abel and we notice what is said here in verse number 4, and in just a moment we'll go to Genesis chapter number 4 and read the account of what God is referencing here in Hebrews 11 in verse number 4, we understand that Abel is the first human being to die. He's the first one to die. He'd be killed by his brother Cain shortly after this offering was made. And we find that as we would understand the worship of Abel and we'd understand the importance of our worship, first we must acknowledge that our God is worthy of worship. And what a joy to understand who our God is. I'm so thankful that God has revealed Himself to us through His Word and He has given us testimony of who He is and of His character. And we understand that He is worthy of our worship. In fact, I know that I've mentioned this before, but the very word worship originally in the English language carried with it the idea, and they would use it in this way, worth-ship. And He is worthy of our worship. Look over to the book of Psalms, if you will, Psalm 29. I want to reference just a couple of verses of Scripture here in the book of Psalms to understand and lay the groundwork for the fact that God indeed is worthy of our worship. In Psalm 29, in verse 2, the Bible says this. The psalmist is giving us truth. Look at Psalm 29 and verse 1. Give unto the Lord, O ye mighty, give unto the Lord glory and strength. Give unto the Lord the glory due unto His name. Worship the Lord in the beauty of holiness. I was singing around the house yesterday that song that we're familiar with, Jesus is the sweetest name I know. Begin to think about our Savior. Begin to think about our God and what He's done. done for us, and oh, how we ought to offer Him our worship. He is worthy of our worship. The psalmist will go on to say in Psalm 96, in verse 9, he'll make this testimony. He says, oh, worship the Lord and the beauty of holiness. Fear before Him all the earth. I'm mindful, and we ended our message last Sunday morning in Revelation 19 as we spoke about the marriage supper of the Lamb. But I find that as John is rehearsing those things and there's some things that he is able to be familiar with, in verse 10 of Revelation 19, the Bible says that he fell to his feet to worship Him, and he said unto me, see thou do it not, I am thy fellow servant of thy brethren that have the testimony of Jesus. Worship God. For the testimony of Jesus is the spirit of prophecy. We find that we acknowledge this morning that our God is worthy of worship, but we next need to understand and accept the fact that God has defined how we are to worship Him. In John 4 and verse 24, the Bible says that God is a spirit and they that worship Him must worship Him in spirit and in truth. And we find this morning that all that is called worship is not really worship. We must acknowledge and we must accept this morning that God is worthy of our worship, but we also must understand that God has defined how we are to worship Him. We understand that and we see that through the passage of Scripture that is referenced in Hebrews 11 in verse number four. Notice back in Genesis four, if you will, as we have the opportunity to go back to this Old Testament account and see what the writer of Hebrews is referring to when he speaks about by faith Abel offered a more excellent sacrifice. You'll notice here in Genesis 4, the Bible tells us beginning in verse number one, and Adam knew Eve his wife, and she conceived and bare Cain and said, I have gotten a man from the Lord. And she again bare his brother Abel. And Abel was a keeper of sheep, but Cain was a tiller of the ground. The Bible says in verse number three, and in the process of time it came to pass that Cain brought of the fruit of the ground an offering unto the Lord. And Abel, he also brought of the firstlings of his flock and of the fat thereof. And the Lord had respect unto Abel and to his offering. It tells us in verse number five, but unto Cain and to his offering, he had not respect and Cain was very wroth and his countenance fell. We find that the Bible records for us these two brothers. They have two different occupations and there's no problem in what their occupation is. There's no problem with what they do in life. The Bible begins to reveal to us in the process of time how they would bring forth these offerings. And we find that the offerings differed greatly. We find that the one offering that is mentioned in verse number three, the offering of Cain that he brought of the fruit of the ground an offering unto the Lord, but Abel's offering was much different. The Bible tells us that Abel, his offering in verse number four, he brought of the firstlings of his flock and of the fat thereof. And notice the Bible tells us that God had respect to the one, but not to the other. It's interesting that as we read Hebrews 11 and we interpret Scripture with Scripture and we understand that's what we've been encouraged to do that the Bible says by faith Abel offered. So it was by faith that he offered this sacrifice. And notice what it says that he offered unto God. What did he offer? A more excellent sacrifice than Cain. Why was it more excellent? Why was it a better sacrifice? Why is it that God had respect unto Abel and to his offering but not unto Cain and his offering? Well, we find that God will give some insight here in Genesis chapter four and then we'll go back in a previous chapter and look some more as to what's going on. But notice in verse number six, the Lord begins to speak to Cain. And the Lord said unto Cain, why art thou wroth? And why is thy countenance fallen? If thou doest well, shalt thou not be accepted? What a great question. What a great revelation that is given to us here in the beginning of verse number seven. In fact, basically what God is saying to Cain is that if you come the appropriate way, then you'll be accepted. The problem was that Cain did not come the way in which he was to come. Notice what he says, and if thou doest not well, sin lieth at the door and unto thee shall be his desire and thou shalt rule over him. And Cain talked with Abel his brother in verse number eight, it came to pass when they were in a field that Cain rose up against Abel his brother and slew him. Begin to think about this offering. We find that Abel, according to what we read in Hebrews 11 in verse number four, he offered this sacrifice by faith. He made this offering to God and it was by faith that he offered this sacrifice. We find that it was a more excellent sacrifice and that it was accepted, why? Because it was a blood sacrifice. You understand as we've studied through the book of Hebrews and in particular these last few chapters that we've been studying and understanding the importance of the blood and understanding the Old Testament and how they would bring all of those offerings and all of the blood and how it represented the fact that one day Messiah would come and Christ would become our Passover. He would go to a cruel cross. He would shed his precious blood so that mankind could be redeemed. He would be buried in a borrowed tomb and he would rise in victory on day number three, conquering sin, death, and the grave. We find that the Bible says as we would understand the apostle Paul speaking about this very truth in the book of Galatians he says, I do not frustrate the grace of God. If righteousness came by the law, then Christ is dead in vain. What is he saying to us? He's saying salvation is by grace through faith alone. Jesus paid it all and he paid it with his blood. He said on the cross of Calvary, it is finished. And we go all the way back to Genesis chapter number four and as we read about this offering of Abel, we see that it was a picture of that blood that would one day be shed by God himself, the Lord Jesus Christ on the cross of Calvary. But how is it that Abel knew to come in this fashion? How is it that God could tell us in Hebrews chapter number 11 that this offering was by faith? Well, we believe this morning and understand as we look at the whole of Scripture that he, Abel, had faith in the spoken word of God. Go back a chapter in Genesis chapter number three. I want you to understand that no doubt as God is providing us with this record of history here in the book of Genesis, that every conversation that they had, that God had with Adam and Eve was not, has not been recorded for us. But we do understand that God has recorded for us exactly what He wants us to know. And we understand that in Genesis chapter number three, that God gives us the record of when sin first entered into the world. We find that God created the world perfect, that there was no sin. And we find that in that state of perfection, that Satan, that old serpent, that he comes and he tempts Eve in the beginning of Genesis chapter number three and he questions what God says. He says, yea, hath God said. He says, ye shall not surely die. By the way, the devil's still a deceiver. He is a liar. The Bible tells us that in John chapter number eight, and he is from the beginning, but we find that after sin entered into the world and after Adam and Eve both partook of the fruit and their eyes are opened, that they did a couple of things. Number one, the Bible tells us that they hid themselves from God. No doubt, they were shameful of their sin. No doubt, they were shameful of the consequence of their sin. And they hide from God. Not only did they hide from God, but they sewed fig leaves together to cover their nakedness. We find that as they would sew those fig leaves together, that that is the work of their hands. When God comes into the garden, the Bible records it here for us in Genesis chapter number three, that he goes and he says in verse number nine, the Lord God called unto Adam and said unto him, where art thou? We find that the Bible then records for us the judgment that is shared with regard to the sin and how God deals with Adam and Eve and the serpent, and then he gives us that great prophecy in Genesis 3 in verse number 15, and I will put enmity between thee and the woman, between thy seed and her seed. It shall bruise thy head, and thou shalt bruise his heel. We find that as we continue to go through the passage of Scripture, and we understand again that they, Adam and Eve, have these aprons of fig leaves to cover their nakedness, the works of their hands that God says, that's not sufficient. So what does he do? We find that in Genesis 3 in verse number 21, the Bible says, and unto Adam, also unto his wife, did the Lord God make coats of skins and clothed them.\" What had to happen for God to provide these coats of skins? An innocent animal had to die. Blood had to be shed. And we find that in that moment that God was communicating not only to Adam and Eve, but then Adam would then communicate to his children the truth that God has given with regard to this process with regard to this fact that these fig leaves weren't insufficient, the works of your hands can never obtain salvation, but it has to be through the blood. What a great picture that we find all the way in the beginning of the book of Genesis. Someone said this, Scroggie is the last name, and he said that as he wrote a book with regard to his study the Word of God, he referred to the title of his book, The Unfolding Drama of Redemption, and he said the Old Testament gives us all of these truths with regard to the Messiah who would one day come, and as we lead through history and we go through the unfolding of this drama of redemption, we eventually come to the pages of Scripture, the gospel records of the birth of the Lord Jesus Christ, the God in flesh, and we find that he would live a perfect and sinless life and he would go to the cross of Calvary, fulfilling all of the picture of the Old Testament. And what a blessing. And so we find that Abel in chapter number four, as Adam and Eve have these children, Cain and Abel are listed by name, we find later Seth will be mentioned at the end of chapter number four, but we find that it was in process of time that they would bring these offerings, and no doubt they had been instructed by Adam, and this instruction that came from God, and Abel comes with a blood offering. Cain? He comes with an offering that's the work of his hands. And what does God say? He says the works of your hands are insufficient. Many religions around the world today, in fact I heard in the last couple of weeks a survey that was done, and amongst those that were asked the question about salvation, nearly 70% responded by saying you could be good enough to get to heaven. That's not what the Word of God teaches. The Word of God tells us that we're all sinners, for all have sinned and come short of the glory of God. Isaiah, in fact, says all of our good works are as filthy rags. See, we could not earn our own salvation. It's impossible, for by grace are you saved through faith, and that not of yourselves is the gift of God, not of works, lest any man should boast. And we find that in Abel's worship, that he would come and he would worship God in accordance to what God had instructed, what God had commanded. I believe that Cain came with a desire to worship God, but he came the wrong way. He came the wrong way. And so we find that God is worthy of our worship, but God has also defined how we are to worship Him. Notice with me back in Hebrews chapter 11, as we look at the remainder of verse number four, I want you to notice what the Bible tells us about this man Abel. The Bible says this, by faith Abel offered unto God a more excellent sacrifice than Cain, by which he obtained witness that he was righteous. That's a good testimony, by the way, is it not? In verse number four, we find that when we would consider our righteousness, we understand that we are clothed the imputed righteousness of Christ. For God hath made Him Christ to be sin for us who knew no sin, that we might be made the righteousness of God in Him. 2nd Corinthians 5 and verse number 21. Paul said, I'm not going about to establish mine own righteousness, but Christ's righteousness in Philippians chapter number 3. And you find that as we look at the the passage of Scripture, you think about the testimony that we can stand and we can say, I've been redeemed, I am saved by the blood of the Lamb, I am declared righteous, not because of any work that I have done, but all because of what Jesus did. I came by way of the cross. Notice it continues and says this, God testifying of His gifts. And notice this last phrase in verse number four, and by it He being dead yet speaketh. Oh, the testimony of this man. All of these years later, millennia later, we're speaking about this offering of Abel. He being dead yet speaketh. We see the worship of Abel as we continue to move through the passage of Scripture. Notice with me in verses five and six, number two this morning, the walk of Enoch. The walk of Enoch. Oh, we're to worship God according to how He has instructed us to worship Him, and no doubt He is worthy of our worship. But we then find, as we move into verse number five, that the Bible says that by faith Enoch was translated, that he should not see death and was not found, because God had translated him, for before his translation he had this testimony that he pleased God. We find that in Genesis chapter 5, verses 22 through 24, again a reference to the beginning of the Bible, that the Bible says this, that Enoch walked with God and he was not, for God took him. I mean, what a great picture that is. What a great testimony that is. And we find that as we consider the walk of Enoch, and we would understand this morning that as Abel was the first human being to die, that Enoch was the first human being to escape death. The Bible tells us of Enoch that he walked with God and he was not, for God took him. It says that he had this testimony that he was, notice it says that he was translated, that he should not see death and was not found. They couldn't find him because God took him, amen? And can you imagine, I mean, the Bible gives us, look back in Genesis chapter number five, and I want you to notice what the Bible says in verses 22 through 24. The Bible says this, in Genesis chapter number five, in verse number 22, and Enoch, well look at verse 21, it says, and Enoch lived sixty and five years and begat Methuselah. And Enoch walked with God after he begat Methuselah three hundred years and begat sons and daughters. And all the days of Enoch were three hundred sixty and five years, and look at verse 24, and Enoch walked with God and he was not, for God took him. Can you imagine just walking along in life, having that sweet communion and fellowship with God, so much so that God took him? I mean, where did Enoch go? Has anyone seen Enoch? He's missing. Isn't that awesome? I mean, I think it's great. I also believe that it's a picture, a type, of the rapture. The fact that one day the trumpet of the Lord is going to sound. We find that the Bible tells us in Revelation chapter number four that John heard this voice that said, come up hither. We find that in chapters two and three, all the churches in Asia are referenced in dealing with not only those physical churches that existed, those real churches, but also dealing with church age, if you will. And then you find in the fourth chapter, come up hither. I'm mindful of what the Apostle Paul says in 1 Thessalonians chapter number four with regard to the instruction, the teaching that he gives us with regard to the rapture. Yes, I agree. Many people have said the word rapture is not in the Bible. It's not, but the word rapture means to be caught up. And in 1 Thessalonians chapter number four, he says, then we which are alive and remain shall be caught up together to meet the Lord in the clouds, and so shall we ever be with the Lord. And then he says in verse number 18, wherefore comfort one another with these words. Oh, how comforting those words are to understand that one day the Lord Jesus Christ is going to call us home. Now, I'd like to believe that it would be in my lifetime. I know there are preachers over the centuries that have had that same testimony and that same desire that the rapture of the church would happen during their lifetime, and what a blessing it would be. Brother Mershawn often says he's looking for the upper taker and not the undertaker, and I love that quote, that phraseology that he uses. And we find that Enoch, he escaped death. He walked with God. He had this testimony back in chapter number 11 of Hebrews in verse number five, the verse in which we're looking at the walk of Enoch. Notice what it says at the end of the verse. For before his translation, he had this testimony. What is it? That he pleased God. Can I tell you this morning, that's a good testimony to have. Can I ask you this morning, what God say of us? What God say of you? That your walk pleases Him. I hope this morning you could say yes. Not in a prideful, boastful way, but a way in which you have sought to walk with the Lord and be obedient to His Word. That you've gone through the process of proving what is acceptable unto the Lord, and that you've desired to walk with Him and to please Him. And we find that the Bible tells us that Enoch had this testimony, but when we look at verse number six, the Bible tells us but without faith, it is impossible to please Him. For he that cometh to God must believe that he is, and he is a rewarder of them that diligently seek him.\" And so I find that as I look at verses 5 and 6 together, and I notice the walk of Enoch, that I am encouraged not only by his walk, challenged by his walk, but I'm encouraged to know that by faith I can please God as well. And so can you. We understand that the Bible says without faith, it is impossible to please Him. Remember, as we've studied several weeks on Wednesdays over the past couple of months, we have referenced various passages of Scripture after we ended our Elijah and Elisha study. And as we've looked at a number of different passages, we have mentioned how that God marveled at their faith. He marveled also at their unbelief. He says to the disciples, he says to Peter, in fact, how is it that your faith is so small? How is it that you have no faith? Remember the disciples. There was the feeding of the 5,000. What miraculous event that was. We find that Jesus says, hey, we need to get them something to eat. The disciples say, hey, send them away. It's time is far spent. It's time for them to go home. We have nothing to give them to eat. And Jesus says, no, we're gonna give them something to eat. They have five loaves and two fish, right? And the Bible tells us that He instructs the disciples to have them sit in companies. And as they sit in companies by 50, that He blessed and break and He distributed through the disciples to all of those folks, and they all were filled. And then they took up some baskets of the remains. How many baskets? 12. They had more at the end than they had at the beginning. Now, the disciples saw that. The disciples experienced that. The disciples were part of that. They were the ones that were distributing. They were the ones that picked up the fragments. They witnessed the work of God and the power of God. But shortly thereafter, there were 4,000 that were gathered. You know what the disciples said? How can a man provide bread for these folks? That's what they say. The question is, why don't they believe? Why don't they have faith? And I find myself so often, as we would look at the Scriptures and we would evaluate and understand what's going on, and we would be able to identify things in the lives of those that have gone before us, but how often do we face the same situations in our life? We've seen God work, we've witnessed God's power, but we come to a particular situation in our life and we say, I just don't know how it's gonna work. I just don't know how it's gonna happen. Where's your faith? Where's your faith? And so we understand that without faith, it's impossible to please Him. See, God wants us to believe Him. I'm mindful of the book of Numbers, the account that God gives us in chapters 13 and 14 with the spies that would be sent out. We find that as the spies return, and there were 12 of them, and we know that it was Caleb and Joshua that brought back the good report, the faithful report. The other 10, they didn't believe God. God had said over and over, I'm gonna give you this land. I'm gonna go with you. You're gonna possess this land. And yet they didn't believe. We know that those 10 individuals, they influenced the entire congregation of the nation of Israel. Joshua and Caleb, they rent their clothes, they plead with the people, so much so that the people are ready to stone Joshua and Caleb. God says to Moses, how long will it be, ere my people believe me? What of this morning? We think about the walk of Enoch. He walked with God. He believed God. He walked by faith. And we see that God blessed and God translated him. I mean, it's an amazing truth of the word of God. Again, as we look at these first references in Hebrews chapter 11, and we see how that they provide this reference back to the book of Genesis, giving credibility to what we read in the book of Genesis. We see the worship of Abel. We see the walk of Enoch in number three this morning. In verse number seven, we see the work of Noah. The work of Noah. We understand that God spoke to Noah. God informed Noah of coming judgment. And God specifically instructed Moses with regard to what he needed to do. We find that Noah believed God. He acted with faith. Notice in verse number seven, and we're noticing the work of Noah. It tells us in verse number seven, by faith Noah being warned of God of things not seen as yet. Notice what the Bible says. He moved with fear, prepared an ark to the saving of his house, by the witch he condemned the world and became heir of the righteousness, which is by faith. In Genesis chapter six through eight, we find the Bible gives us a record of the Genesis flood. We spent many weeks studying through those chapters in Genesis. And you notice in Genesis chapter number six, if you turn back there, the Bible tells us that God sees the wickedness of mankind. And the Lord says that he's going to destroy man whom he had created from the face of the earth. But yet God tells us that Noah found grace in the eyes of the Lord in verse number eight. And the Bible tells us that in verse number 13 of Genesis chapter number six, that God said unto Noah, the end of all flesh has come before me, for the earth is filled with violence through them and behold, notice what he says, I will destroy them with the earth. The very next verse, verse 14, make thee an ark of gopher wood. Room shalt thou make in the ark and shalt pitch it within and without with pitch. He goes through and he gives them the instruction with regard to what to do and how to do and the elements that he should use, the materials I shall say that he should use and all of the details with regard to this ark. And we find that in verse number 22, the Bible says this, thus did Noah, according to all that God commanded him, so did he. He was a man of faith and he was a man of obedience. I think it's interesting, the Bible tells us in Hebrews chapter 11, that he was warned of God, notice what it says, of things not seen as yet. He was warned of God of things not seen as yet. As best we know and understand, there had not been any rain and God said he's gonna destroy the earth with rain, with a flood. It was gonna rain for 40 days and 40 nights. And we find that here, that God gives this instruction, this warning to Noah of these things not seen as yet. He had never experienced rain, nor had he ever endured a flood. But God said it was gonna happen. And so guess what he did? Notice it says this, that he moved with fear. He believed God. He believed that what God said he was going to do, that he was going to do. And God said, I'm gonna destroy. But he says, make thee an ark of gopher wood. Here's the instruction. By the way, this work was a hard work. It was a long, enduring work. We find that this warning is given and it had an impact. And we find that he then prepared, it says here, an ark to the saving of his house. No doubt this was a lengthy, tiring work. We find that he was faithful to do what God called him to do. And God sustained him. I think about Noah building that ark. How many of you have been out to Kentucky and you've seen the ark out there? It's pretty neat, isn't it? I mean, you get up, you kind of come over the crest of the hill there in Kentucky where that ark is. I can't remember the town in which it's located. You come over the crest of the hill and man, you just see this ark. It's humongous. Ken Ham answers in Genesis, they wanted to build that model and they did to scale based upon the cubits and all the lengths that are mentioned there in the Genesis record. And I mean, it's amazing. You go in that thing and you realize how small you are and how large this thing is and the detail, the amount of time that it would have taken he and his family. And we find that he was preparing this ark. He was obedient to the work. Listen, no one ever said that working for God was going to be easy. But the amazing thing is that God sustains us in the work. He gives us the strength when we have no strength. I think about the Apostle Paul and I think about his testimony as he's serving God as he's going on those missionary journeys and all of the things that he endures and all of the difficulties that he faces. And yet he says that the Lord delivered him and the Lord sustained him. We find this morning that Noah, he was working for the Lord. It's interesting as we would consider our work for God. I want you to look at a few verses of Scripture. I've referenced earlier, turn to the book of Ephesians, if you will. And I referenced, I quoted for you earlier, Ephesians 2, verses 8 and 9, with regard to the subject matter of worship and how that we're saved by grace through faith, that it's nothing that we can do. It's of no works that you could do. It's of no works that I could do to earn my salvation. The Bible says that the gift of God... God is eternal life through Jesus Christ, my Lord. Can I tell you this morning that if you work for it, it ceases to be a gift. Amen? I go and I work for something and somebody gives me something and says, here's a gift for you. No, no, that's a wage, amen? I worked for that, I earned that, right? We understand that. At the end of the week when you get your paycheck, your boss doesn't come to you and say, here's a gift for you. He's like, man, I work like a dog all week. What do you mean a gift for me, right? It's a wage. You know what the Bible says about our sin? The wages of sin is death. The gift of God is eternal life through Jesus Christ, our Lord. And we find that that gift is based upon the grace and mercy of God and the work that he did at the cross of Calvary. However, we understand as the scriptures would unfold for us and tell us in verse number 10, that as we are saved, we become his workmen. We become his servants. And I love the way in which the writers of the New Testament, under the inspiration of the Holy Spirit of God, many of them, they'll begin the letters in which they write by saying, Paul, a servant. Peter, a servant. James, a servant. What a joy to be the servant of the Lord. We find here in Ephesians 2, in verse number 10, the Bible says, for we are his workmanship, created in Christ Jesus unto good works, which God hath before ordained that we should walk in them. Now let me help you understand something very important. We do not work to earn our salvation, and we do not work to keep our salvation. We work because we're saved. That's our response to what God has done for us and how he's blessed us. And what a joy, listen, the reality today is that if God had deemed it to be so, that at the moment that you trust at Christ your Savior, we could have immediately gone to heaven. And some say, man, that would have been wonderful. But he's left us here, and he's left us here for a purpose. He's left us here to be his representatives, his ambassadors. Remember, as we had that message on Sunday evening from Brother Hauser, that you're the salt of the earth, that you're the light of the world. And as we understand here this morning, as we begin to look at what's going on and we see this truth that we are his workmanship created in Christ Jesus unto good works, in the book of Philippians, Paul says this to the church in Philippi, just a few pages over in your Bible, in Philippians 1 and verse number six, being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ. We're familiar with the truth that Peter gives in 1 Peter chapter number four with regard to the gift that we've been given. I speak of this gift that he's mentioning in 1 Peter chapter number four. It is the gift of serving, the gifts of the Holy Spirit of God. And here we find that he says in verse number 10 of 1 Peter chapter number four, as every man hath received the gift, even so minister the same one to another as good stewards of the manifold grace of God. If any man speak, let him speak as the oracles of God. If any man minister, let him do it as of the ability which God giveth. Why? That God in all things may be glorified through Jesus Christ to whom be praise and dominion forever and ever, amen. You see how it goes back to our first point of worship. He's glorified, he's exalted, he is receiving the glory that's due unto his name. And we find here that as we look at these three individuals that are mentioned in Hebrews 11 verses four through seven, we find that we notice that the worship of Abel, we notice the walk of Enoch, and we notice the work of Noah. As we think about the work of Noah, we see that he prepared this ark. Notice what the result is. Really, there's a twofold result that is given to us in verse number seven of Hebrews 11. The Bible says this, that he prepared an ark, notice, to the saving of his house, to the saving of his house. We understand this morning that Noah and Mrs. Noah and his three sons and their wives all got onto that ark. And the only place of safety, of refuge was in the ark. You had to be in the ark. I think about the fact that the Bible tells us that Noah was a preacher of righteousness. And I think about the way in which Noah preached for all those years as he was preparing the ark. As we think about his preaching and the way in which no doubt he was mocked and ridiculed and made fun of, and we find that as that door was shut and God shut that door in there in the ark, that when that flood began, when those rains started to descend and the depths of the earth opened up, I believe that those individuals that had not listened, man, they were seeking some kind of refuge. But there was no refuge because you had to be in the ark. As New Testament believers, we have to be in Christ. If any man be in Christ, he is a new creature. Old things are passed away. Behold, all things are become new. And so we find, as we look at the twofold result of the work of Noah, that number one, he and his family were spared to the saving of his house, the Bible says. And then notice this, by the witch, he condemned the world. We find that the world was condemned. In 2 Peter 2, in verse number five, a thought that I just referenced a moment ago, but the Bible says this, and spared not the old world, but saved Noah, the eighth person, a preacher of righteousness, bringing in the flood upon the world of the ungodly. And it says that he became heir of the righteousness, which is by faith. Isn't that a great statement? We find this morning that righteousness is by faith. It's not by works. And even as we look at the work of Noah here in verse number seven, we understand that it was not his work that caused him to have this righteousness, but it was his faith and obedience to God. And we find that as Noah would get off the ark, that the first thing he does is he worships the Lord. He builds those altars, and he provides an offering unto the Lord. The first matter of business was worship after they got off of that ark. As we look at the truth of this first message in Hebrews 11, as we begin to deal with the individuals that are referenced by name, we see the worship. I hope this morning that we're worshiping God properly. That we understand this morning that He is worthy of our worship. I hope this morning that we are walking with God. That we would have the testimony of Enoch, that he walked with God, and he was not, for God took him. That we'd walk with him. That we'd enjoy that sweet communion and fellowship that is able to be enjoyed because of what the Lord Jesus Christ did for us on the cross of Calvary. And I hope this morning that we're working for the Lord. The songwriter said, work for the night is coming when man's work works no more. And this morning, we have an opportunity to work for the Lord. By the way, it's a great thing to be able to work for the Lord, to be His servant. And again, we do not confuse the teaching of the Word of God. We do not say that you work so that you can earn or keep your salvation. It simply is out of a response to all that God has done for us. I desire to work for Him. I desire to live for Him. I desire to walk with Him because I understand what He's given me here in this book and His Word. And this morning, we see these three characters, Abel, Enoch and Noah. Next week, we'll continue looking at Abraham. Begin to see how these individuals lived by faith, living by faith. But this morning, how are we living by faith? How is it in our lives that we are living by faith, that we're taking God at His Word, that we're believing Him? See, I'll tell you this morning, it's not easy for us to live by sight. It really is. I've been doing some reading here recently of some believers that have gone on before us over the centuries. Those that have served God faithfully. And some of that which they endured and how they lived by faith. They begin to think about our environment, what we have in 2020. It's easy for us to live by sight. But without faith, it is impossible to please Him. And so this morning, we come to Him by faith with regard to salvation. But we must understand that we must live by faith all the days of our lives. These men, they lived by faith and the Bible tells us what they did by faith. And we'll continue to see testimonies of those that have gone before us. And know that we would have a testimony of living by faith. Father, we love You this morning. We thank You for loving us. We thank You for the testimonies of these that have gone before us. All the way back to the book of Genesis. In reading in Genesis chapters four through eight of Abel and Enoch and Noah, seeing their worship and their walk and their work. And God, I pray this morning that You would encourage us. I pray that You would challenge us. or to help us to live by faith. There's one here that's not sure of heaven. As we shared testimony this morning, as we were singing this morning about salvation and knowing for sure that heaven's our home, maybe there's someone this morning that they just simply do not have 100% assurance that if they were to die today that heaven's their home. We pray that the Holy Spirit of God would convict them of their sin, of Christ's righteousness, of judgment to come. I pray that before they leave this place, they would get it settled. I pray for each child of God this morning. God, would you help us to live by faith? Help us to be challenged by the testimony of these men. I pray that you would do a work in our lives in these next few moments that would result in you being glorified and exalted, and us being made conformed to the image of your Son. Well, thank you for the work that you'll do, for it's in Christ's name we pray. Would you stand with me, heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano. As she does, the altar is open. If you're not sure of heaven, we'd love to take a Bible and show you how you can know for sure that heaven's your home. If you're a child of God, maybe you just wanna come and thank God for the gift of salvation. Maybe you just wanna come and commit to live by faith. As Kimberly plays, the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.5,
      "text": " And what a great joy to know the Lord Jesus Christ as your personal Savior."
    },
    {
      "id": 1,
      "start": 4.5,
      "end": 8.199999809265137,
      "text": " And thankful for those songs that we're able to sing today."
    },
    {
      "id": 2,
      "start": 8.199999809265137,
      "end": 10.899999618530273,
      "text": " Thankful for that special Hebrews chapter number 11."
    },
    {
      "id": 3,
      "start": 10.899999618530273,
      "end": 13.399999618530273,
      "text": " Hebrews chapter number 11 this morning."
    },
    {
      "id": 4,
      "start": 13.399999618530273,
      "end": 17.200000762939453,
      "text": " And we'll be in Hebrews chapter number 11 for a few weeks."
    },
    {
      "id": 5,
      "start": 17.200000762939453,
      "end": 21.700000762939453,
      "text": " I mentioned as we began Hebrews chapter number 11 two Sunday mornings ago,"
    },
    {
      "id": 6,
      "start": 21.700000762939453,
      "end": 25.100000381469727,
      "text": " Now Faith Is, that was the title for the message."
    },
    {
      "id": 7,
      "start": 25.100000381469727,
      "end": 27.600000381469727,
      "text": " And we looked at the first three verses."
    },
    {
      "id": 8,
      "start": 27.799999237060547,
      "end": 31.399999618530273,
      "text": " And this morning we'll be looking at verses 4 through 7."
    },
    {
      "id": 9,
      "start": 31.399999618530273,
      "end": 34.29999923706055,
      "text": " And as we look at the passage of Scripture that is before us"
    },
    {
      "id": 10,
      "start": 34.29999923706055,
      "end": 37.5,
      "text": " and over the next several weeks as we examine Hebrews chapter 11,"
    },
    {
      "id": 11,
      "start": 37.5,
      "end": 43.599998474121094,
      "text": " we find that the Word of God provides us with a list of individuals who lived by faith."
    },
    {
      "id": 12,
      "start": 43.599998474121094,
      "end": 46.900001525878906,
      "text": " We understand that the original recipients of this book,"
    },
    {
      "id": 13,
      "start": 46.900001525878906,
      "end": 49.400001525878906,
      "text": " the Jewish believers in the first century,"
    },
    {
      "id": 14,
      "start": 49.400001525878906,
      "end": 54.900001525878906,
      "text": " that they would have had an awareness of these individuals that are referenced by name."
    },
    {
      "id": 15,
      "start": 54.900001525878906,
      "end": 58.79999923706055,
      "text": " They would have understood and been familiar with the accounts that are referenced."
    },
    {
      "id": 16,
      "start": 58.79999923706055,
      "end": 61.79999923706055,
      "text": " And these same individuals had been encouraged,"
    },
    {
      "id": 17,
      "start": 61.79999923706055,
      "end": 64.0999984741211,
      "text": " we remember back in Hebrews chapter number 6,"
    },
    {
      "id": 18,
      "start": 64.0999984741211,
      "end": 65.80000305175781,
      "text": " that they are to go on."
    },
    {
      "id": 19,
      "start": 65.80000305175781,
      "end": 71.0,
      "text": " And we find that at the end of chapter number 10 that they are challenged to live by faith."
    },
    {
      "id": 20,
      "start": 71.0,
      "end": 77.19999694824219,
      "text": " And we understand the quote from Habakkuk that is referenced not only here in the book of Hebrews,"
    },
    {
      "id": 21,
      "start": 77.19999694824219,
      "end": 81.30000305175781,
      "text": " but also Paul uses it in Romans and again in Galatians,"
    },
    {
      "id": 22,
      "start": 81.30000305175781,
      "end": 84.4000015258789,
      "text": " that the just shall live by faith."
    },
    {
      "id": 23,
      "start": 84.4000015258789,
      "end": 88.5,
      "text": " And these believers had been challenged and they had been given,"
    },
    {
      "id": 24,
      "start": 88.5,
      "end": 96.69999694824219,
      "text": " or they now are being given a sampling of those that have gone before them who indeed lived by faith."
    },
    {
      "id": 25,
      "start": 96.69999694824219,
      "end": 102.4000015258789,
      "text": " And as we consider these particular folks that are mentioned throughout Hebrews chapter 11,"
    },
    {
      "id": 26,
      "start": 102.4000015258789,
      "end": 107.30000305175781,
      "text": " I believe that it is noteworthy that we recognize this morning"
    },
    {
      "id": 27,
      "start": 107.30000305175781,
      "end": 113.19999694824219,
      "text": " that every era of human history had believers that lived by faith."
    },
    {
      "id": 28,
      "start": 113.19999694824219,
      "end": 116.0,
      "text": " These believers were living in the first century,"
    },
    {
      "id": 29,
      "start": 116.0,
      "end": 119.19999694824219,
      "text": " and as we go through the Old Testament we find, first of all,"
    },
    {
      "id": 30,
      "start": 119.19999694824219,
      "end": 121.9000015258789,
      "text": " starting there with Abel in verse number 4,"
    },
    {
      "id": 31,
      "start": 121.9000015258789,
      "end": 123.9000015258789,
      "text": " and we'll begin looking at that here in just a moment,"
    },
    {
      "id": 32,
      "start": 123.9000015258789,
      "end": 126.9000015258789,
      "text": " but we find that it begins all the way back in the book of Genesis,"
    },
    {
      "id": 33,
      "start": 126.9000015258789,
      "end": 129.8000030517578,
      "text": " and we find that he goes through the entire era of the prophets,"
    },
    {
      "id": 34,
      "start": 129.8000030517578,
      "end": 131.39999389648438,
      "text": " and he mentions many people."
    },
    {
      "id": 35,
      "start": 131.39999389648438,
      "end": 134.3000030517578,
      "text": " Of course, there are some that he mentions specifically by name,"
    },
    {
      "id": 36,
      "start": 134.3000030517578,
      "end": 136.60000610351562,
      "text": " and there are others that he just kind of says,"
    },
    {
      "id": 37,
      "start": 136.60000610351562,
      "end": 142.0,
      "text": " hey, we don't have the time to deal with all of these individuals."
    },
    {
      "id": 38,
      "start": 142.0,
      "end": 144.1999969482422,
      "text": " And he goes through and he provides some lists,"
    },
    {
      "id": 39,
      "start": 144.1999969482422,
      "end": 147.8000030517578,
      "text": " and what a blessing to consider this morning"
    },
    {
      "id": 40,
      "start": 147.8000030517578,
      "end": 153.60000610351562,
      "text": " that throughout all of human history there have been people that have believed God,"
    },
    {
      "id": 41,
      "start": 153.60000610351562,
      "end": 155.5,
      "text": " and they have lived by faith."
    },
    {
      "id": 42,
      "start": 155.5,
      "end": 162.60000610351562,
      "text": " I believe this morning that if we would do a survey over the last 2,000 years of church history,"
    },
    {
      "id": 43,
      "start": 162.60000610351562,
      "end": 165.89999389648438,
      "text": " that you could trace and you could find individuals,"
    },
    {
      "id": 44,
      "start": 165.89999389648438,
      "end": 168.39999389648438,
      "text": " no, they're not in the canon of Scripture,"
    },
    {
      "id": 45,
      "start": 168.39999389648438,
      "end": 173.39999389648438,
      "text": " but you can find individual believers that lived by faith."
    },
    {
      "id": 46,
      "start": 173.39999389648438,
      "end": 180.5,
      "text": " And this morning, we are challenged as believers in 2020 to live by faith."
    },
    {
      "id": 47,
      "start": 180.5,
      "end": 182.60000610351562,
      "text": " That we are to take God at His Word,"
    },
    {
      "id": 48,
      "start": 182.60000610351562,
      "end": 185.39999389648438,
      "text": " that we're to believe what God has said,"
    },
    {
      "id": 49,
      "start": 185.39999389648438,
      "end": 188.6999969482422,
      "text": " and that God will do what He says He will do."
    },
    {
      "id": 50,
      "start": 188.6999969482422,
      "end": 193.60000610351562,
      "text": " I believe that the list of folks that are mentioned here in Hebrews 11,"
    },
    {
      "id": 51,
      "start": 193.60000610351562,
      "end": 197.0,
      "text": " it encourages the people of God."
    },
    {
      "id": 52,
      "start": 197.0,
      "end": 199.3000030517578,
      "text": " When you begin to read about those that have gone before us,"
    },
    {
      "id": 53,
      "start": 199.3000030517578,
      "end": 204.3000030517578,
      "text": " and you begin to read about the way in which God worked and God blessed and what God did,"
    },
    {
      "id": 54,
      "start": 204.3000030517578,
      "end": 211.3000030517578,
      "text": " man, it's encouraging to read those accounts that God has provided us with in His precious Word."
    },
    {
      "id": 55,
      "start": 211.3000030517578,
      "end": 214.3000030517578,
      "text": " But I believe that more than just being encouraged,"
    },
    {
      "id": 56,
      "start": 214.3000030517578,
      "end": 218.8000030517578,
      "text": " that we ought to be challenged in our own lives to live by faith."
    },
    {
      "id": 57,
      "start": 218.8000030517578,
      "end": 222.0,
      "text": " I wonder this morning of how many of us,"
    },
    {
      "id": 58,
      "start": 222.0,
      "end": 226.10000610351562,
      "text": " if God were to make mention this morning"
    },
    {
      "id": 59,
      "start": 226.10000610351562,
      "end": 235.5,
      "text": " of those in 2020, how many of us would find ourselves on the roll of they lived by faith?"
    },
    {
      "id": 60,
      "start": 235.5,
      "end": 238.60000610351562,
      "text": " As we look at our passage of Scripture, and if you're taking notes,"
    },
    {
      "id": 61,
      "start": 238.60000610351562,
      "end": 241.3000030517578,
      "text": " I've simply entitled the message this morning,"
    },
    {
      "id": 62,
      "start": 241.3000030517578,
      "end": 244.1999969482422,
      "text": " Living by Faith, Part 1."
    },
    {
      "id": 63,
      "start": 244.1999969482422,
      "end": 249.89999389648438,
      "text": " We're going to have a multi-part series with the same title as we go through here in Hebrews 11."
    },
    {
      "id": 64,
      "start": 249.89999389648438,
      "end": 251.8000030517578,
      "text": " But notice with me in verse number 4, the Bible says,"
    },
    {
      "id": 65,
      "start": 251.8000030517578,
      "end": 257.29998779296875,
      "text": " \"...by faith Abel offered unto God a more excellent sacrifice than Cain,"
    },
    {
      "id": 66,
      "start": 257.29998779296875,
      "end": 261.20001220703125,
      "text": " by which he obtained witness that he was righteous,"
    },
    {
      "id": 67,
      "start": 261.20001220703125,
      "end": 268.1000061035156,
      "text": " God testifying of his gifts, and by it he being dead yet speaketh.\""
    },
    {
      "id": 68,
      "start": 268.1000061035156,
      "end": 273.5,
      "text": " Verse 5, \"...by faith Enoch was translated that he should not see death,"
    },
    {
      "id": 69,
      "start": 273.5,
      "end": 277.5,
      "text": " and was not found, because God had translated him."
    },
    {
      "id": 70,
      "start": 277.5,
      "end": 284.0,
      "text": " For before his translation he had this testimony, that he pleased God."
    },
    {
      "id": 71,
      "start": 284.0,
      "end": 286.29998779296875,
      "text": " But without faith it is impossible to please him,"
    },
    {
      "id": 72,
      "start": 286.29998779296875,
      "end": 288.8999938964844,
      "text": " for he that cometh to God must believe that he is,"
    },
    {
      "id": 73,
      "start": 288.8999938964844,
      "end": 291.5,
      "text": " and it is the rewarder of them that diligently seek him.\""
    },
    {
      "id": 74,
      "start": 291.5,
      "end": 297.79998779296875,
      "text": " Verse 7, \"...by faith Noah, being warned of God of things not seen as yet,"
    },
    {
      "id": 75,
      "start": 297.79998779296875,
      "end": 302.1000061035156,
      "text": " moved with fear, prepared an ark to the saving of his house,"
    },
    {
      "id": 76,
      "start": 302.1000061035156,
      "end": 308.6000061035156,
      "text": " by the which he condemned the world and became heir of the righteousness which is by faith.\""
    },
    {
      "id": 77,
      "start": 308.6000061035156,
      "end": 310.6000061035156,
      "text": " As we examine the passage of Scripture this morning,"
    },
    {
      "id": 78,
      "start": 310.6000061035156,
      "end": 312.79998779296875,
      "text": " I want you to notice with me in verse number 4,"
    },
    {
      "id": 79,
      "start": 312.79998779296875,
      "end": 316.3999938964844,
      "text": " if you're taking notes, first of all, the worship of Abel."
    },
    {
      "id": 80,
      "start": 316.3999938964844,
      "end": 319.70001220703125,
      "text": " I want you to understand, it's amazing to me how the writer of Hebrews,"
    },
    {
      "id": 81,
      "start": 319.70001220703125,
      "end": 325.20001220703125,
      "text": " of course, it's the Word of God, and so all Scripture is given by inspiration of God."
    },
    {
      "id": 82,
      "start": 325.20001220703125,
      "end": 329.20001220703125,
      "text": " And God goes back to creation in verse number 3,"
    },
    {
      "id": 83,
      "start": 329.20001220703125,
      "end": 334.5,
      "text": " when he says, \"...through faith we understand that the worlds were framed by the Word of God,"
    },
    {
      "id": 84,
      "start": 334.5,
      "end": 338.8999938964844,
      "text": " so that things which are seen were not made of things which do appear.\""
    },
    {
      "id": 85,
      "start": 338.8999938964844,
      "end": 341.6000061035156,
      "text": " And we studied that in our previous lesson two weeks ago,"
    },
    {
      "id": 86,
      "start": 341.6000061035156,
      "end": 344.5,
      "text": " in this first three verses of Hebrews 11."
    },
    {
      "id": 87,
      "start": 344.5,
      "end": 348.3999938964844,
      "text": " And we find that the record of creation is referenced, of course,"
    },
    {
      "id": 88,
      "start": 348.3999938964844,
      "end": 351.20001220703125,
      "text": " you can find the record of creation in Genesis 1 and 2,"
    },
    {
      "id": 89,
      "start": 351.20001220703125,
      "end": 354.20001220703125,
      "text": " but it is not exclusive to the book of Genesis."
    },
    {
      "id": 90,
      "start": 354.20001220703125,
      "end": 359.0,
      "text": " You find the record and the testimony of creation throughout the whole of Scripture."
    },
    {
      "id": 91,
      "start": 359.0,
      "end": 363.5,
      "text": " And now we find that the writer of Hebrews goes to Genesis chapter number 4"
    },
    {
      "id": 92,
      "start": 363.5,
      "end": 370.20001220703125,
      "text": " and begins to discuss about an offering that was made by Abel, the son of Adam and Eve."
    },
    {
      "id": 93,
      "start": 370.20001220703125,
      "end": 372.5,
      "text": " Of course, Adam and Eve were created in the garden,"
    },
    {
      "id": 94,
      "start": 372.5,
      "end": 377.1000061035156,
      "text": " and I love the fact that we start here because there are so many this morning in our world"
    },
    {
      "id": 95,
      "start": 377.1000061035156,
      "end": 381.29998779296875,
      "text": " that deny creation, that dismiss the Genesis record."
    },
    {
      "id": 96,
      "start": 381.29998779296875,
      "end": 385.0,
      "text": " Of course, we've been preaching through the book of Genesis on Sunday evenings,"
    },
    {
      "id": 97,
      "start": 385.0,
      "end": 390.0,
      "text": " and we've spent many, many messages through the first 11 chapters of the book of Genesis"
    },
    {
      "id": 98,
      "start": 390.0,
      "end": 392.3999938964844,
      "text": " to lay that foundation and the groundwork"
    },
    {
      "id": 99,
      "start": 392.3999938964844,
      "end": 397.70001220703125,
      "text": " and to understand the importance of the record of Genesis."
    },
    {
      "id": 100,
      "start": 397.70001220703125,
      "end": 403.5,
      "text": " They seek to destroy the foundation and undermine the authority of the Word of God,"
    },
    {
      "id": 101,
      "start": 403.5,
      "end": 409.29998779296875,
      "text": " thus taking not only offense to what is given in Genesis 1-11,"
    },
    {
      "id": 102,
      "start": 409.29998779296875,
      "end": 413.8999938964844,
      "text": " but so that they can then pick apart the whole of Scripture."
    },
    {
      "id": 103,
      "start": 413.8999938964844,
      "end": 416.79998779296875,
      "text": " And we find that the record of Genesis is absolutely true."
    },
    {
      "id": 104,
      "start": 416.79998779296875,
      "end": 419.20001220703125,
      "text": " It was accepted, as I mentioned, when he says,"
    },
    {
      "id": 105,
      "start": 419.20001220703125,
      "end": 422.70001220703125,
      "text": " through faith we understand in verse number 3"
    },
    {
      "id": 106,
      "start": 422.70001220703125,
      "end": 430.20001220703125,
      "text": " how the testimony of those that believe that God is indeed the Creator of all things."
    },
    {
      "id": 107,
      "start": 430.20001220703125,
      "end": 434.20001220703125,
      "text": " We sing for our theme song this year from Psalm 121,"
    },
    {
      "id": 108,
      "start": 434.20001220703125,
      "end": 437.1000061035156,
      "text": " I will lift up mine eyes into the hills, from whence cometh my help."
    },
    {
      "id": 109,
      "start": 437.1000061035156,
      "end": 442.70001220703125,
      "text": " My help cometh from the Lord, which made heaven and earth."
    },
    {
      "id": 110,
      "start": 442.70001220703125,
      "end": 448.3999938964844,
      "text": " And we find that now he references Abel, again, a reference that would help us understand"
    },
    {
      "id": 111,
      "start": 448.3999938964844,
      "end": 452.20001220703125,
      "text": " the fact that these believers had an awareness"
    },
    {
      "id": 112,
      "start": 452.20001220703125,
      "end": 457.20001220703125,
      "text": " and understood that the book of Genesis was a literal record"
    },
    {
      "id": 113,
      "start": 457.20001220703125,
      "end": 460.3999938964844,
      "text": " that God has provided for human history."
    },
    {
      "id": 114,
      "start": 460.3999938964844,
      "end": 464.1000061035156,
      "text": " And we go back to Genesis chapter number 4, you notice here, we'll go there in just a moment,"
    },
    {
      "id": 115,
      "start": 464.1000061035156,
      "end": 465.0,
      "text": " but notice what it says,"
    },
    {
      "id": 116,
      "start": 465.0,
      "end": 470.3999938964844,
      "text": " By faith Abel offered unto God a more excellent sacrifice than Cain,"
    },
    {
      "id": 117,
      "start": 470.3999938964844,
      "end": 475.3999938964844,
      "text": " by which he, Abel, obtained witness that he was righteous,"
    },
    {
      "id": 118,
      "start": 475.3999938964844,
      "end": 482.70001220703125,
      "text": " God testifying of his gifts, and by it he being dead yet speaketh."
    },
    {
      "id": 119,
      "start": 482.70001220703125,
      "end": 487.1000061035156,
      "text": " When we think about the worship of Abel and we notice what is said here in verse number 4,"
    },
    {
      "id": 120,
      "start": 487.1000061035156,
      "end": 489.5,
      "text": " and in just a moment we'll go to Genesis chapter number 4"
    },
    {
      "id": 121,
      "start": 489.5,
      "end": 495.1000061035156,
      "text": " and read the account of what God is referencing here in Hebrews 11 in verse number 4,"
    },
    {
      "id": 122,
      "start": 495.1000061035156,
      "end": 499.6000061035156,
      "text": " we understand that Abel is the first human being to die."
    },
    {
      "id": 123,
      "start": 499.6000061035156,
      "end": 500.6000061035156,
      "text": " He's the first one to die."
    },
    {
      "id": 124,
      "start": 500.6000061035156,
      "end": 506.70001220703125,
      "text": " He'd be killed by his brother Cain shortly after this offering was made."
    },
    {
      "id": 125,
      "start": 506.70001220703125,
      "end": 510.8999938964844,
      "text": " And we find that as we would understand the worship of Abel"
    },
    {
      "id": 126,
      "start": 510.8999938964844,
      "end": 513.7000122070312,
      "text": " and we'd understand the importance of our worship,"
    },
    {
      "id": 127,
      "start": 513.7000122070312,
      "end": 518.5999755859375,
      "text": " first we must acknowledge that our God is worthy of worship."
    },
    {
      "id": 128,
      "start": 518.5999755859375,
      "end": 522.0999755859375,
      "text": " And what a joy to understand who our God is."
    },
    {
      "id": 129,
      "start": 522.0999755859375,
      "end": 526.7000122070312,
      "text": " I'm so thankful that God has revealed Himself to us through His Word"
    },
    {
      "id": 130,
      "start": 526.7000122070312,
      "end": 531.2999877929688,
      "text": " and He has given us testimony of who He is and of His character."
    },
    {
      "id": 131,
      "start": 531.2999877929688,
      "end": 535.0,
      "text": " And we understand that He is worthy of our worship."
    },
    {
      "id": 132,
      "start": 535.0,
      "end": 537.2999877929688,
      "text": " In fact, I know that I've mentioned this before,"
    },
    {
      "id": 133,
      "start": 537.2999877929688,
      "end": 542.4000244140625,
      "text": " but the very word worship originally in the English language carried with it the idea,"
    },
    {
      "id": 134,
      "start": 542.4000244140625,
      "end": 545.5999755859375,
      "text": " and they would use it in this way, worth-ship."
    },
    {
      "id": 135,
      "start": 545.5999755859375,
      "end": 548.2000122070312,
      "text": " And He is worthy of our worship."
    },
    {
      "id": 136,
      "start": 548.2000122070312,
      "end": 551.4000244140625,
      "text": " Look over to the book of Psalms, if you will, Psalm 29."
    },
    {
      "id": 137,
      "start": 551.4000244140625,
      "end": 555.0,
      "text": " I want to reference just a couple of verses of Scripture here in the book of Psalms"
    },
    {
      "id": 138,
      "start": 555.0,
      "end": 560.9000244140625,
      "text": " to understand and lay the groundwork for the fact that God indeed is worthy of our worship."
    },
    {
      "id": 139,
      "start": 560.9000244140625,
      "end": 564.5,
      "text": " In Psalm 29, in verse 2, the Bible says this."
    },
    {
      "id": 140,
      "start": 564.5,
      "end": 567.2000122070312,
      "text": " The psalmist is giving us truth."
    },
    {
      "id": 141,
      "start": 567.2000122070312,
      "end": 570.7999877929688,
      "text": " Look at Psalm 29 and verse 1."
    },
    {
      "id": 142,
      "start": 570.7999877929688,
      "end": 576.2000122070312,
      "text": " Give unto the Lord, O ye mighty, give unto the Lord glory and strength."
    },
    {
      "id": 143,
      "start": 576.2000122070312,
      "end": 581.7000122070312,
      "text": " Give unto the Lord the glory due unto His name."
    },
    {
      "id": 144,
      "start": 581.7999877929688,
      "end": 586.7999877929688,
      "text": " Worship the Lord in the beauty of holiness."
    },
    {
      "id": 145,
      "start": 586.7999877929688,
      "end": 592.2999877929688,
      "text": " I was singing around the house yesterday that song that we're familiar with,"
    },
    {
      "id": 146,
      "start": 592.2999877929688,
      "end": 595.5,
      "text": " Jesus is the sweetest name I know."
    },
    {
      "id": 147,
      "start": 595.5,
      "end": 597.0999755859375,
      "text": " Begin to think about our Savior."
    },
    {
      "id": 148,
      "start": 597.0999755859375,
      "end": 600.0,
      "text": " Begin to think about our God and what He's done."
    },
    {
      "id": 0,
      "start": 600.0,
      "end": 604.5999999046326,
      "text": " done for us, and oh, how we ought to offer Him our worship."
    },
    {
      "id": 1,
      "start": 604.5999999046326,
      "end": 606.8400001525879,
      "text": " He is worthy of our worship."
    },
    {
      "id": 2,
      "start": 606.8400001525879,
      "end": 609.4399995803833,
      "text": " The psalmist will go on to say in Psalm 96,"
    },
    {
      "id": 3,
      "start": 609.4399995803833,
      "end": 613.3199996948242,
      "text": " in verse 9, he'll make this testimony."
    },
    {
      "id": 4,
      "start": 613.3199996948242,
      "end": 615.039999961853,
      "text": " He says, oh, worship the Lord"
    },
    {
      "id": 5,
      "start": 615.039999961853,
      "end": 617.2000007629395,
      "text": " and the beauty of holiness."
    },
    {
      "id": 6,
      "start": 617.2000007629395,
      "end": 622.2800006866455,
      "text": " Fear before Him all the earth."
    },
    {
      "id": 7,
      "start": 622.2800006866455,
      "end": 624.6399993896484,
      "text": " I'm mindful, and we ended our message"
    },
    {
      "id": 8,
      "start": 624.6399993896484,
      "end": 628.0400009155273,
      "text": " last Sunday morning in Revelation 19"
    },
    {
      "id": 9,
      "start": 628.0400009155273,
      "end": 630.4799995422363,
      "text": " as we spoke about the marriage supper of the Lamb."
    },
    {
      "id": 10,
      "start": 630.4799995422363,
      "end": 633.439998626709,
      "text": " But I find that as John is rehearsing those things"
    },
    {
      "id": 11,
      "start": 633.439998626709,
      "end": 635.6800003051758,
      "text": " and there's some things that he is able"
    },
    {
      "id": 12,
      "start": 635.6800003051758,
      "end": 639.0800018310547,
      "text": " to be familiar with, in verse 10 of Revelation 19,"
    },
    {
      "id": 13,
      "start": 639.0800018310547,
      "end": 640.8800010681152,
      "text": " the Bible says that he fell to his feet"
    },
    {
      "id": 14,
      "start": 640.8800010681152,
      "end": 642.560001373291,
      "text": " to worship Him, and he said unto me,"
    },
    {
      "id": 15,
      "start": 642.560001373291,
      "end": 645.2400016784668,
      "text": " see thou do it not, I am thy fellow servant"
    },
    {
      "id": 16,
      "start": 645.2400016784668,
      "end": 647.8800010681152,
      "text": " of thy brethren that have the testimony of Jesus."
    },
    {
      "id": 17,
      "start": 647.8800010681152,
      "end": 650.4000015258789,
      "text": " Worship God."
    },
    {
      "id": 18,
      "start": 650.4000015258789,
      "end": 655.439998626709,
      "text": " For the testimony of Jesus is the spirit of prophecy."
    },
    {
      "id": 19,
      "start": 655.439998626709,
      "end": 657.9199981689453,
      "text": " We find that we acknowledge this morning"
    },
    {
      "id": 20,
      "start": 657.9599990844727,
      "end": 660.0400009155273,
      "text": " that our God is worthy of worship,"
    },
    {
      "id": 21,
      "start": 660.0400009155273,
      "end": 662.560001373291,
      "text": " but we next need to understand and accept"
    },
    {
      "id": 22,
      "start": 662.560001373291,
      "end": 665.0,
      "text": " the fact that God has defined"
    },
    {
      "id": 23,
      "start": 665.0,
      "end": 668.0800018310547,
      "text": " how we are to worship Him."
    },
    {
      "id": 24,
      "start": 668.0800018310547,
      "end": 670.0400009155273,
      "text": " In John 4 and verse 24,"
    },
    {
      "id": 25,
      "start": 670.0400009155273,
      "end": 672.0400009155273,
      "text": " the Bible says that God is a spirit"
    },
    {
      "id": 26,
      "start": 672.0400009155273,
      "end": 673.5999984741211,
      "text": " and they that worship Him must"
    },
    {
      "id": 27,
      "start": 673.5999984741211,
      "end": 677.120002746582,
      "text": " worship Him in spirit and in truth."
    },
    {
      "id": 28,
      "start": 677.120002746582,
      "end": 678.8000030517578,
      "text": " And we find this morning"
    },
    {
      "id": 29,
      "start": 678.8000030517578,
      "end": 681.0800018310547,
      "text": " that all that is called worship"
    },
    {
      "id": 30,
      "start": 681.0800018310547,
      "end": 684.2399978637695,
      "text": " is not really worship."
    },
    {
      "id": 31,
      "start": 684.2399978637695,
      "end": 686.5199966430664,
      "text": " We must acknowledge and we must accept"
    },
    {
      "id": 32,
      "start": 686.5599975585938,
      "end": 689.3199996948242,
      "text": " this morning that God is worthy of our worship,"
    },
    {
      "id": 33,
      "start": 689.3199996948242,
      "end": 691.8000030517578,
      "text": " but we also must understand that God"
    },
    {
      "id": 34,
      "start": 691.8000030517578,
      "end": 696.0400009155273,
      "text": " has defined how we are to worship Him."
    },
    {
      "id": 35,
      "start": 696.0400009155273,
      "end": 697.7600021362305,
      "text": " We understand that and we see that"
    },
    {
      "id": 36,
      "start": 697.7600021362305,
      "end": 699.1600036621094,
      "text": " through the passage of Scripture"
    },
    {
      "id": 37,
      "start": 699.1600036621094,
      "end": 701.0800018310547,
      "text": " that is referenced in Hebrews 11"
    },
    {
      "id": 38,
      "start": 701.0800018310547,
      "end": 702.0400009155273,
      "text": " in verse number four."
    },
    {
      "id": 39,
      "start": 702.0400009155273,
      "end": 704.4400024414062,
      "text": " Notice back in Genesis four, if you will,"
    },
    {
      "id": 40,
      "start": 704.4400024414062,
      "end": 706.5599975585938,
      "text": " as we have the opportunity to go back"
    },
    {
      "id": 41,
      "start": 706.5599975585938,
      "end": 708.3199996948242,
      "text": " to this Old Testament account"
    },
    {
      "id": 42,
      "start": 708.3199996948242,
      "end": 710.0800018310547,
      "text": " and see what the writer of Hebrews"
    },
    {
      "id": 43,
      "start": 710.0800018310547,
      "end": 711.7200012207031,
      "text": " is referring to when he speaks about"
    },
    {
      "id": 44,
      "start": 711.7200012207031,
      "end": 715.4800033569336,
      "text": " by faith Abel offered a more excellent sacrifice."
    },
    {
      "id": 45,
      "start": 715.5199966430664,
      "end": 719.2399978637695,
      "text": " You'll notice here in Genesis 4,"
    },
    {
      "id": 46,
      "start": 719.2399978637695,
      "end": 721.6800003051758,
      "text": " the Bible tells us beginning in verse number one,"
    },
    {
      "id": 47,
      "start": 721.6800003051758,
      "end": 723.4800033569336,
      "text": " and Adam knew Eve his wife,"
    },
    {
      "id": 48,
      "start": 723.4800033569336,
      "end": 725.0400009155273,
      "text": " and she conceived and bare Cain"
    },
    {
      "id": 49,
      "start": 725.0400009155273,
      "end": 727.3600006103516,
      "text": " and said, I have gotten a man from the Lord."
    },
    {
      "id": 50,
      "start": 727.3600006103516,
      "end": 729.7200012207031,
      "text": " And she again bare his brother Abel."
    },
    {
      "id": 51,
      "start": 729.7200012207031,
      "end": 731.8800048828125,
      "text": " And Abel was a keeper of sheep,"
    },
    {
      "id": 52,
      "start": 731.8800048828125,
      "end": 735.6399993896484,
      "text": " but Cain was a tiller of the ground."
    },
    {
      "id": 53,
      "start": 735.6399993896484,
      "end": 736.9600067138672,
      "text": " The Bible says in verse number three,"
    },
    {
      "id": 54,
      "start": 736.9600067138672,
      "end": 738.7200012207031,
      "text": " and in the process of time it came to pass"
    },
    {
      "id": 55,
      "start": 738.7200012207031,
      "end": 741.1600036621094,
      "text": " that Cain brought of the fruit of the ground"
    },
    {
      "id": 56,
      "start": 741.1600036621094,
      "end": 742.9600067138672,
      "text": " an offering unto the Lord."
    },
    {
      "id": 57,
      "start": 742.9600067138672,
      "end": 744.9199981689453,
      "text": " And Abel, he also brought of the firstlings"
    },
    {
      "id": 58,
      "start": 744.9199981689453,
      "end": 746.8800048828125,
      "text": " of his flock and of the fat thereof."
    },
    {
      "id": 59,
      "start": 746.8800048828125,
      "end": 749.8399963378906,
      "text": " And the Lord had respect unto Abel"
    },
    {
      "id": 60,
      "start": 749.8399963378906,
      "end": 752.2799987792969,
      "text": " and to his offering."
    },
    {
      "id": 61,
      "start": 752.2799987792969,
      "end": 753.8000030517578,
      "text": " It tells us in verse number five,"
    },
    {
      "id": 62,
      "start": 753.8000030517578,
      "end": 755.9199981689453,
      "text": " but unto Cain and to his offering,"
    },
    {
      "id": 63,
      "start": 755.9199981689453,
      "end": 759.8800048828125,
      "text": " he had not respect and Cain was very wroth"
    },
    {
      "id": 64,
      "start": 759.8800048828125,
      "end": 762.1999969482422,
      "text": " and his countenance fell."
    },
    {
      "id": 65,
      "start": 762.1999969482422,
      "end": 763.8399963378906,
      "text": " We find that the Bible records for us"
    },
    {
      "id": 66,
      "start": 763.8399963378906,
      "end": 764.7200012207031,
      "text": " these two brothers."
    },
    {
      "id": 67,
      "start": 764.7200012207031,
      "end": 766.5200042724609,
      "text": " They have two different occupations"
    },
    {
      "id": 68,
      "start": 766.5200042724609,
      "end": 769.4799957275391,
      "text": " and there's no problem in what their occupation is."
    },
    {
      "id": 69,
      "start": 769.4799957275391,
      "end": 772.6799926757812,
      "text": " There's no problem with what they do in life."
    },
    {
      "id": 70,
      "start": 772.8000030517578,
      "end": 775.4799957275391,
      "text": " The Bible begins to reveal to us"
    },
    {
      "id": 71,
      "start": 775.4799957275391,
      "end": 778.1600036621094,
      "text": " in the process of time how they would bring forth"
    },
    {
      "id": 72,
      "start": 778.1600036621094,
      "end": 779.4400024414062,
      "text": " these offerings."
    },
    {
      "id": 73,
      "start": 779.4400024414062,
      "end": 782.8000030517578,
      "text": " And we find that the offerings differed greatly."
    },
    {
      "id": 74,
      "start": 782.8000030517578,
      "end": 785.6399993896484,
      "text": " We find that the one offering that is mentioned"
    },
    {
      "id": 75,
      "start": 785.6399993896484,
      "end": 788.4400024414062,
      "text": " in verse number three, the offering of Cain"
    },
    {
      "id": 76,
      "start": 788.4400024414062,
      "end": 790.7200012207031,
      "text": " that he brought of the fruit of the ground"
    },
    {
      "id": 77,
      "start": 790.7200012207031,
      "end": 792.6799926757812,
      "text": " an offering unto the Lord,"
    },
    {
      "id": 78,
      "start": 792.6799926757812,
      "end": 795.6000061035156,
      "text": " but Abel's offering was much different."
    },
    {
      "id": 79,
      "start": 795.6000061035156,
      "end": 797.3600006103516,
      "text": " The Bible tells us that Abel,"
    },
    {
      "id": 80,
      "start": 797.3600006103516,
      "end": 799.8800048828125,
      "text": " his offering in verse number four,"
    },
    {
      "id": 81,
      "start": 799.8800048828125,
      "end": 801.7599945068359,
      "text": " he brought of the firstlings of his flock"
    },
    {
      "id": 82,
      "start": 801.8000030517578,
      "end": 803.1999969482422,
      "text": " and of the fat thereof."
    },
    {
      "id": 83,
      "start": 803.1999969482422,
      "end": 806.4400024414062,
      "text": " And notice the Bible tells us that God had respect"
    },
    {
      "id": 84,
      "start": 806.4400024414062,
      "end": 810.0,
      "text": " to the one, but not to the other."
    },
    {
      "id": 85,
      "start": 810.0,
      "end": 813.7200012207031,
      "text": " It's interesting that as we read Hebrews 11"
    },
    {
      "id": 86,
      "start": 813.7200012207031,
      "end": 815.9199981689453,
      "text": " and we interpret Scripture with Scripture"
    },
    {
      "id": 87,
      "start": 815.9199981689453,
      "end": 818.4799957275391,
      "text": " and we understand that's what we've been encouraged to do"
    },
    {
      "id": 88,
      "start": 818.4799957275391,
      "end": 821.4799957275391,
      "text": " that the Bible says by faith Abel offered."
    },
    {
      "id": 89,
      "start": 821.4799957275391,
      "end": 826.1600036621094,
      "text": " So it was by faith that he offered this sacrifice."
    },
    {
      "id": 90,
      "start": 826.1600036621094,
      "end": 830.8800048828125,
      "text": " And notice what it says that he offered unto God."
    },
    {
      "id": 91,
      "start": 830.8800048828125,
      "end": 831.8000030517578,
      "text": " What did he offer?"
    },
    {
      "id": 92,
      "start": 831.8000030517578,
      "end": 836.5599975585938,
      "text": " A more excellent sacrifice than Cain."
    },
    {
      "id": 93,
      "start": 836.5599975585938,
      "end": 838.1999969482422,
      "text": " Why was it more excellent?"
    },
    {
      "id": 94,
      "start": 838.1999969482422,
      "end": 840.2400054931641,
      "text": " Why was it a better sacrifice?"
    },
    {
      "id": 95,
      "start": 840.2400054931641,
      "end": 845.0,
      "text": " Why is it that God had respect unto Abel and to his offering"
    },
    {
      "id": 96,
      "start": 845.0,
      "end": 847.5800018310547,
      "text": " but not unto Cain and his offering?"
    },
    {
      "id": 97,
      "start": 847.5800018310547,
      "end": 851.1999969482422,
      "text": " Well, we find that God will give some insight here"
    },
    {
      "id": 98,
      "start": 851.1999969482422,
      "end": 854.0,
      "text": " in Genesis chapter four and then we'll go back"
    },
    {
      "id": 99,
      "start": 854.0,
      "end": 856.239990234375,
      "text": " in a previous chapter and look some more"
    },
    {
      "id": 100,
      "start": 856.239990234375,
      "end": 857.239990234375,
      "text": " as to what's going on."
    },
    {
      "id": 101,
      "start": 857.239990234375,
      "end": 858.6799926757812,
      "text": " But notice in verse number six,"
    },
    {
      "id": 102,
      "start": 858.6799926757812,
      "end": 860.9200134277344,
      "text": " the Lord begins to speak to Cain."
    },
    {
      "id": 103,
      "start": 860.9200134277344,
      "end": 862.2799987792969,
      "text": " And the Lord said unto Cain,"
    },
    {
      "id": 104,
      "start": 862.2799987792969,
      "end": 865.3999938964844,
      "text": " why art thou wroth?"
    },
    {
      "id": 105,
      "start": 865.3999938964844,
      "end": 868.3999938964844,
      "text": " And why is thy countenance fallen?"
    },
    {
      "id": 106,
      "start": 868.3999938964844,
      "end": 870.9200134277344,
      "text": " If thou doest well,"
    },
    {
      "id": 107,
      "start": 870.9200134277344,
      "end": 873.0400085449219,
      "text": " shalt thou not be accepted?"
    },
    {
      "id": 108,
      "start": 873.0400085449219,
      "end": 874.0799865722656,
      "text": " What a great question."
    },
    {
      "id": 109,
      "start": 874.0799865722656,
      "end": 876.9599914550781,
      "text": " What a great revelation that is given to us here"
    },
    {
      "id": 110,
      "start": 876.9599914550781,
      "end": 878.6000061035156,
      "text": " in the beginning of verse number seven."
    },
    {
      "id": 111,
      "start": 878.6000061035156,
      "end": 881.6000061035156,
      "text": " In fact, basically what God is saying to Cain"
    },
    {
      "id": 112,
      "start": 881.6000061035156,
      "end": 884.5199890136719,
      "text": " is that if you come the appropriate way,"
    },
    {
      "id": 113,
      "start": 884.5199890136719,
      "end": 886.6799926757812,
      "text": " then you'll be accepted."
    },
    {
      "id": 114,
      "start": 886.7200012207031,
      "end": 889.3999938964844,
      "text": " The problem was that Cain did not come"
    },
    {
      "id": 115,
      "start": 889.3999938964844,
      "end": 891.0,
      "text": " the way in which he was to come."
    },
    {
      "id": 116,
      "start": 891.0,
      "end": 892.239990234375,
      "text": " Notice what he says,"
    },
    {
      "id": 117,
      "start": 892.239990234375,
      "end": 894.7999877929688,
      "text": " and if thou doest not well,"
    },
    {
      "id": 118,
      "start": 894.7999877929688,
      "end": 896.2799987792969,
      "text": " sin lieth at the door"
    },
    {
      "id": 119,
      "start": 896.2799987792969,
      "end": 897.9599914550781,
      "text": " and unto thee shall be his desire"
    },
    {
      "id": 120,
      "start": 897.9599914550781,
      "end": 899.5599975585938,
      "text": " and thou shalt rule over him."
    },
    {
      "id": 121,
      "start": 899.5599975585938,
      "end": 901.4400024414062,
      "text": " And Cain talked with Abel his brother"
    },
    {
      "id": 122,
      "start": 901.4400024414062,
      "end": 902.2799987792969,
      "text": " in verse number eight,"
    },
    {
      "id": 123,
      "start": 902.2799987792969,
      "end": 903.9400024414062,
      "text": " it came to pass when they were in a field"
    },
    {
      "id": 124,
      "start": 903.9400024414062,
      "end": 906.0799865722656,
      "text": " that Cain rose up against Abel his brother"
    },
    {
      "id": 125,
      "start": 906.0799865722656,
      "end": 907.4400024414062,
      "text": " and slew him."
    },
    {
      "id": 126,
      "start": 909.1199951171875,
      "end": 911.1600036621094,
      "text": " Begin to think about this offering."
    },
    {
      "id": 127,
      "start": 911.1600036621094,
      "end": 912.3599853515625,
      "text": " We find that Abel,"
    },
    {
      "id": 128,
      "start": 912.3599853515625,
      "end": 914.1600036621094,
      "text": " according to what we read in Hebrews 11"
    },
    {
      "id": 129,
      "start": 914.1600036621094,
      "end": 915.0,
      "text": " in verse number four,"
    },
    {
      "id": 130,
      "start": 915.0,
      "end": 917.6400146484375,
      "text": " he offered this sacrifice by faith."
    },
    {
      "id": 131,
      "start": 917.6400146484375,
      "end": 919.4800109863281,
      "text": " He made this offering to God"
    },
    {
      "id": 132,
      "start": 919.4800109863281,
      "end": 922.5599975585938,
      "text": " and it was by faith that he offered this sacrifice."
    },
    {
      "id": 133,
      "start": 922.5599975585938,
      "end": 925.0400085449219,
      "text": " We find that it was a more excellent sacrifice"
    },
    {
      "id": 134,
      "start": 925.0400085449219,
      "end": 926.3599853515625,
      "text": " and that it was accepted, why?"
    },
    {
      "id": 135,
      "start": 926.3599853515625,
      "end": 929.2000122070312,
      "text": " Because it was a blood sacrifice."
    },
    {
      "id": 136,
      "start": 929.2000122070312,
      "end": 930.7200012207031,
      "text": " You understand as we've studied"
    },
    {
      "id": 137,
      "start": 930.7200012207031,
      "end": 931.8399963378906,
      "text": " through the book of Hebrews"
    },
    {
      "id": 138,
      "start": 931.8399963378906,
      "end": 934.8399963378906,
      "text": " and in particular these last few chapters"
    },
    {
      "id": 139,
      "start": 934.8399963378906,
      "end": 935.6799926757812,
      "text": " that we've been studying"
    },
    {
      "id": 140,
      "start": 935.6799926757812,
      "end": 938.7200012207031,
      "text": " and understanding the importance of the blood"
    },
    {
      "id": 141,
      "start": 938.7200012207031,
      "end": 940.6799926757812,
      "text": " and understanding the Old Testament"
    },
    {
      "id": 142,
      "start": 940.6799926757812,
      "end": 942.8800048828125,
      "text": " and how they would bring all of those offerings"
    },
    {
      "id": 143,
      "start": 942.8800048828125,
      "end": 944.0,
      "text": " and all of the blood"
    },
    {
      "id": 144,
      "start": 944.0,
      "end": 946.5199890136719,
      "text": " and how it represented the fact"
    },
    {
      "id": 145,
      "start": 946.5199890136719,
      "end": 948.6000061035156,
      "text": " that one day Messiah would come"
    },
    {
      "id": 146,
      "start": 948.6000061035156,
      "end": 951.2799987792969,
      "text": " and Christ would become our Passover."
    },
    {
      "id": 147,
      "start": 951.2799987792969,
      "end": 953.0199890136719,
      "text": " He would go to a cruel cross."
    },
    {
      "id": 148,
      "start": 953.0199890136719,
      "end": 955.2799987792969,
      "text": " He would shed his precious blood"
    },
    {
      "id": 149,
      "start": 955.2799987792969,
      "end": 957.4599914550781,
      "text": " so that mankind could be redeemed."
    },
    {
      "id": 150,
      "start": 957.4599914550781,
      "end": 959.6000061035156,
      "text": " He would be buried in a borrowed tomb"
    },
    {
      "id": 151,
      "start": 959.6000061035156,
      "end": 962.5199890136719,
      "text": " and he would rise in victory on day number three,"
    },
    {
      "id": 152,
      "start": 962.5199890136719,
      "end": 965.9800109863281,
      "text": " conquering sin, death, and the grave."
    },
    {
      "id": 153,
      "start": 965.9800109863281,
      "end": 967.4800109863281,
      "text": " We find that the Bible says"
    },
    {
      "id": 154,
      "start": 967.4800109863281,
      "end": 969.4400024414062,
      "text": " as we would understand the apostle Paul"
    },
    {
      "id": 155,
      "start": 969.4400024414062,
      "end": 972.5599975585938,
      "text": " speaking about this very truth in the book of Galatians"
    },
    {
      "id": 156,
      "start": 973.2799987792969,
      "end": 976.4400024414062,
      "text": " he says, I do not frustrate the grace of God."
    },
    {
      "id": 157,
      "start": 976.4400024414062,
      "end": 978.6000061035156,
      "text": " If righteousness came by the law,"
    },
    {
      "id": 158,
      "start": 978.6000061035156,
      "end": 980.6400146484375,
      "text": " then Christ is dead in vain."
    },
    {
      "id": 159,
      "start": 980.6400146484375,
      "end": 981.760009765625,
      "text": " What is he saying to us?"
    },
    {
      "id": 160,
      "start": 981.760009765625,
      "end": 986.0400085449219,
      "text": " He's saying salvation is by grace through faith alone."
    },
    {
      "id": 161,
      "start": 987.1600036621094,
      "end": 992.1600036621094,
      "text": " Jesus paid it all and he paid it with his blood."
    },
    {
      "id": 162,
      "start": 992.1600036621094,
      "end": 996.3200073242188,
      "text": " He said on the cross of Calvary, it is finished."
    },
    {
      "id": 163,
      "start": 996.3200073242188,
      "end": 999.0,
      "text": " And we go all the way back to Genesis chapter number four"
    },
    {
      "id": 164,
      "start": 999.0,
      "end": 1002.3599853515625,
      "text": " and as we read about this offering of Abel,"
    },
    {
      "id": 165,
      "start": 1003.2000122070312,
      "end": 1006.1600036621094,
      "text": " we see that it was a picture of that blood"
    },
    {
      "id": 166,
      "start": 1006.1600036621094,
      "end": 1009.2000122070312,
      "text": " that would one day be shed by God himself,"
    },
    {
      "id": 167,
      "start": 1009.2000122070312,
      "end": 1012.4800109863281,
      "text": " the Lord Jesus Christ on the cross of Calvary."
    },
    {
      "id": 168,
      "start": 1012.4800109863281,
      "end": 1017.1199951171875,
      "text": " But how is it that Abel knew to come in this fashion?"
    },
    {
      "id": 169,
      "start": 1017.1199951171875,
      "end": 1020.1600036621094,
      "text": " How is it that God could tell us"
    },
    {
      "id": 170,
      "start": 1020.1600036621094,
      "end": 1021.3999938964844,
      "text": " in Hebrews chapter number 11"
    },
    {
      "id": 171,
      "start": 1021.3999938964844,
      "end": 1024.1199951171875,
      "text": " that this offering was by faith?"
    },
    {
      "id": 172,
      "start": 1024.1199951171875,
      "end": 1025.760009765625,
      "text": " Well, we believe this morning"
    },
    {
      "id": 173,
      "start": 1025.760009765625,
      "end": 1028.239990234375,
      "text": " and understand as we look at the whole of Scripture"
    },
    {
      "id": 174,
      "start": 1028.2799987792969,
      "end": 1033.0799865722656,
      "text": " that he, Abel, had faith in the spoken word of God."
    },
    {
      "id": 175,
      "start": 1033.0799865722656,
      "end": 1036.760009765625,
      "text": " Go back a chapter in Genesis chapter number three."
    },
    {
      "id": 176,
      "start": 1036.760009765625,
      "end": 1039.3599853515625,
      "text": " I want you to understand that no doubt"
    },
    {
      "id": 177,
      "start": 1039.3599853515625,
      "end": 1043.6000061035156,
      "text": " as God is providing us with this record of history"
    },
    {
      "id": 178,
      "start": 1043.6000061035156,
      "end": 1045.0400085449219,
      "text": " here in the book of Genesis,"
    },
    {
      "id": 179,
      "start": 1045.0400085449219,
      "end": 1048.0799865722656,
      "text": " that every conversation that they had,"
    },
    {
      "id": 180,
      "start": 1048.0799865722656,
      "end": 1051.1199951171875,
      "text": " that God had with Adam and Eve was not,"
    },
    {
      "id": 181,
      "start": 1051.1199951171875,
      "end": 1053.4800109863281,
      "text": " has not been recorded for us."
    },
    {
      "id": 182,
      "start": 1053.4800109863281,
      "end": 1056.4400024414062,
      "text": " But we do understand that God has recorded for us"
    },
    {
      "id": 183,
      "start": 1056.4400024414062,
      "end": 1058.4800109863281,
      "text": " exactly what He wants us to know."
    },
    {
      "id": 184,
      "start": 1058.4800109863281,
      "end": 1061.3599853515625,
      "text": " And we understand that in Genesis chapter number three,"
    },
    {
      "id": 185,
      "start": 1061.3599853515625,
      "end": 1063.3200073242188,
      "text": " that God gives us the record"
    },
    {
      "id": 186,
      "start": 1063.3200073242188,
      "end": 1066.760009765625,
      "text": " of when sin first entered into the world."
    },
    {
      "id": 187,
      "start": 1066.760009765625,
      "end": 1070.0400085449219,
      "text": " We find that God created the world perfect,"
    },
    {
      "id": 188,
      "start": 1070.0400085449219,
      "end": 1071.5199890136719,
      "text": " that there was no sin."
    },
    {
      "id": 189,
      "start": 1071.5199890136719,
      "end": 1074.8399963378906,
      "text": " And we find that in that state of perfection,"
    },
    {
      "id": 190,
      "start": 1074.8399963378906,
      "end": 1077.1600036621094,
      "text": " that Satan, that old serpent,"
    },
    {
      "id": 191,
      "start": 1077.1600036621094,
      "end": 1080.0,
      "text": " that he comes and he tempts Eve"
    },
    {
      "id": 192,
      "start": 1080.0,
      "end": 1082.239990234375,
      "text": " in the beginning of Genesis chapter number three"
    },
    {
      "id": 193,
      "start": 1082.239990234375,
      "end": 1084.5199890136719,
      "text": " and he questions what God says."
    },
    {
      "id": 194,
      "start": 1084.5199890136719,
      "end": 1086.6400146484375,
      "text": " He says, yea, hath God said."
    },
    {
      "id": 195,
      "start": 1086.6400146484375,
      "end": 1088.5199890136719,
      "text": " He says, ye shall not surely die."
    },
    {
      "id": 196,
      "start": 1088.5199890136719,
      "end": 1091.760009765625,
      "text": " By the way, the devil's still a deceiver."
    },
    {
      "id": 197,
      "start": 1091.760009765625,
      "end": 1092.8800048828125,
      "text": " He is a liar."
    },
    {
      "id": 198,
      "start": 1092.8800048828125,
      "end": 1095.239990234375,
      "text": " The Bible tells us that in John chapter number eight,"
    },
    {
      "id": 199,
      "start": 1095.239990234375,
      "end": 1096.6000061035156,
      "text": " and he is from the beginning,"
    },
    {
      "id": 200,
      "start": 1096.6000061035156,
      "end": 1099.9200134277344,
      "text": " but we find that after sin entered into the world"
    },
    {
      "id": 201,
      "start": 1099.9200134277344,
      "end": 1102.5599975585938,
      "text": " and after Adam and Eve both partook of the fruit"
    },
    {
      "id": 202,
      "start": 1102.5599975585938,
      "end": 1104.2000122070312,
      "text": " and their eyes are opened,"
    },
    {
      "id": 203,
      "start": 1104.2000122070312,
      "end": 1106.0400085449219,
      "text": " that they did a couple of things."
    },
    {
      "id": 204,
      "start": 1106.0400085449219,
      "end": 1108.0,
      "text": " Number one, the Bible tells us"
    },
    {
      "id": 205,
      "start": 1108.0,
      "end": 1110.739990234375,
      "text": " that they hid themselves from God."
    },
    {
      "id": 206,
      "start": 1110.739990234375,
      "end": 1114.1199951171875,
      "text": " No doubt, they were shameful of their sin."
    },
    {
      "id": 207,
      "start": 1114.1199951171875,
      "end": 1115.9199829101562,
      "text": " No doubt, they were shameful"
    },
    {
      "id": 208,
      "start": 1115.9199829101562,
      "end": 1117.7999877929688,
      "text": " of the consequence of their sin."
    },
    {
      "id": 209,
      "start": 1117.7999877929688,
      "end": 1119.6400146484375,
      "text": " And they hide from God."
    },
    {
      "id": 210,
      "start": 1119.6400146484375,
      "end": 1121.239990234375,
      "text": " Not only did they hide from God,"
    },
    {
      "id": 211,
      "start": 1121.239990234375,
      "end": 1123.2000122070312,
      "text": " but they sewed fig leaves together"
    },
    {
      "id": 212,
      "start": 1123.2000122070312,
      "end": 1125.7000122070312,
      "text": " to cover their nakedness."
    },
    {
      "id": 213,
      "start": 1125.7000122070312,
      "end": 1128.760009765625,
      "text": " We find that as they would sew those fig leaves together,"
    },
    {
      "id": 214,
      "start": 1128.760009765625,
      "end": 1131.52001953125,
      "text": " that that is the work of their hands."
    },
    {
      "id": 215,
      "start": 1132.4400024414062,
      "end": 1134.4400024414062,
      "text": " When God comes into the garden,"
    },
    {
      "id": 216,
      "start": 1134.4400024414062,
      "end": 1136.2000122070312,
      "text": " the Bible records it here for us"
    },
    {
      "id": 217,
      "start": 1136.2000122070312,
      "end": 1138.4000244140625,
      "text": " in Genesis chapter number three,"
    },
    {
      "id": 218,
      "start": 1138.4000244140625,
      "end": 1141.5599975585938,
      "text": " that he goes and he says in verse number nine,"
    },
    {
      "id": 219,
      "start": 1141.5599975585938,
      "end": 1143.9600219726562,
      "text": " the Lord God called unto Adam and said unto him,"
    },
    {
      "id": 220,
      "start": 1143.9600219726562,
      "end": 1148.1599731445312,
      "text": " where art thou?"
    },
    {
      "id": 221,
      "start": 1148.1599731445312,
      "end": 1150.5599975585938,
      "text": " We find that the Bible then records for us"
    },
    {
      "id": 222,
      "start": 1150.5599975585938,
      "end": 1154.7999877929688,
      "text": " the judgment that is shared with regard to the sin"
    },
    {
      "id": 223,
      "start": 1154.7999877929688,
      "end": 1158.6400146484375,
      "text": " and how God deals with Adam and Eve and the serpent,"
    },
    {
      "id": 224,
      "start": 1158.6400146484375,
      "end": 1160.5999755859375,
      "text": " and then he gives us that great prophecy"
    },
    {
      "id": 225,
      "start": 1160.5999755859375,
      "end": 1162.8800048828125,
      "text": " in Genesis 3 in verse number 15,"
    },
    {
      "id": 226,
      "start": 1162.8800048828125,
      "end": 1165.3599853515625,
      "text": " and I will put enmity between thee and the woman,"
    },
    {
      "id": 227,
      "start": 1165.3599853515625,
      "end": 1166.8800048828125,
      "text": " between thy seed and her seed."
    },
    {
      "id": 228,
      "start": 1166.8800048828125,
      "end": 1168.8800048828125,
      "text": " It shall bruise thy head,"
    },
    {
      "id": 229,
      "start": 1168.8800048828125,
      "end": 1172.5599975585938,
      "text": " and thou shalt bruise his heel."
    },
    {
      "id": 230,
      "start": 1172.5599975585938,
      "end": 1174.760009765625,
      "text": " We find that as we continue to go through"
    },
    {
      "id": 231,
      "start": 1174.760009765625,
      "end": 1176.47998046875,
      "text": " the passage of Scripture,"
    },
    {
      "id": 232,
      "start": 1176.47998046875,
      "end": 1178.8800048828125,
      "text": " and we understand again that they,"
    },
    {
      "id": 233,
      "start": 1178.8800048828125,
      "end": 1182.239990234375,
      "text": " Adam and Eve, have these aprons of fig leaves"
    },
    {
      "id": 234,
      "start": 1182.239990234375,
      "end": 1184.0800170898438,
      "text": " to cover their nakedness,"
    },
    {
      "id": 235,
      "start": 1184.0800170898438,
      "end": 1187.1599731445312,
      "text": " the works of their hands that God says,"
    },
    {
      "id": 236,
      "start": 1187.1599731445312,
      "end": 1189.5999755859375,
      "text": " that's not sufficient."
    },
    {
      "id": 237,
      "start": 1189.5999755859375,
      "end": 1190.9199829101562,
      "text": " So what does he do?"
    },
    {
      "id": 238,
      "start": 1190.9199829101562,
      "end": 1193.6400146484375,
      "text": " We find that in Genesis 3 in verse number 21,"
    },
    {
      "id": 239,
      "start": 1193.6400146484375,
      "end": 1196.6400146484375,
      "text": " the Bible says, and unto Adam, also unto his wife,"
    },
    {
      "id": 240,
      "start": 1196.6400146484375,
      "end": 1200.1599731445312,
      "text": " did the Lord God make coats of skins"
    },
    {
      "id": 0,
      "start": 1200.1599731445312,
      "end": 1206.8399729728699,
      "text": " and clothed them.\" What had to happen for God to provide these coats of skins?"
    },
    {
      "id": 1,
      "start": 1206.8399729728699,
      "end": 1213.1599731445312,
      "text": " An innocent animal had to die. Blood had to be shed. And we find that in that moment"
    },
    {
      "id": 2,
      "start": 1213.1599731445312,
      "end": 1218.4399738311768,
      "text": " that God was communicating not only to Adam and Eve, but then Adam would then"
    },
    {
      "id": 3,
      "start": 1218.4399738311768,
      "end": 1224.919973373413,
      "text": " communicate to his children the truth that God has given with regard to this"
    },
    {
      "id": 4,
      "start": 1224.919973373413,
      "end": 1230.4399738311768,
      "text": " process with regard to this fact that these fig leaves weren't insufficient,"
    },
    {
      "id": 5,
      "start": 1230.4399738311768,
      "end": 1236.1599731445312,
      "text": " the works of your hands can never obtain salvation, but it has to be through the"
    },
    {
      "id": 6,
      "start": 1236.1599731445312,
      "end": 1239.9199714660645,
      "text": " blood. What a great picture that we find all the way in the beginning of the book"
    },
    {
      "id": 7,
      "start": 1239.9199714660645,
      "end": 1247.9199714660645,
      "text": " of Genesis. Someone said this, Scroggie is the last name, and he said that as he"
    },
    {
      "id": 8,
      "start": 1247.9199714660645,
      "end": 1253.119972229004,
      "text": " wrote a book with regard to his study the Word of God, he referred to the title"
    },
    {
      "id": 9,
      "start": 1253.119972229004,
      "end": 1257.239974975586,
      "text": " of his book, The Unfolding Drama of Redemption, and he said the Old Testament"
    },
    {
      "id": 10,
      "start": 1257.239974975586,
      "end": 1262.399974822998,
      "text": " gives us all of these truths with regard to the Messiah who would one day come,"
    },
    {
      "id": 11,
      "start": 1262.399974822998,
      "end": 1266.959976196289,
      "text": " and as we lead through history and we go through the unfolding of this drama of"
    },
    {
      "id": 12,
      "start": 1266.959976196289,
      "end": 1272.1999740600586,
      "text": " redemption, we eventually come to the pages of Scripture, the gospel records of"
    },
    {
      "id": 13,
      "start": 1272.1999740600586,
      "end": 1278.3199768066406,
      "text": " the birth of the Lord Jesus Christ, the God in flesh, and we find that he would"
    },
    {
      "id": 14,
      "start": 1278.3199768066406,
      "end": 1282.3999710083008,
      "text": " live a perfect and sinless life and he would go to the cross of Calvary,"
    },
    {
      "id": 15,
      "start": 1282.3999710083008,
      "end": 1288.4799728393555,
      "text": " fulfilling all of the picture of the Old Testament. And what a blessing. And so we"
    },
    {
      "id": 16,
      "start": 1288.4799728393555,
      "end": 1294.719970703125,
      "text": " find that Abel in chapter number four, as Adam and Eve have these children, Cain"
    },
    {
      "id": 17,
      "start": 1294.719970703125,
      "end": 1299.5599746704102,
      "text": " and Abel are listed by name, we find later Seth will be mentioned at the end"
    },
    {
      "id": 18,
      "start": 1299.5599746704102,
      "end": 1303.2799758911133,
      "text": " of chapter number four, but we find that it was in process of time that they"
    },
    {
      "id": 19,
      "start": 1303.2799758911133,
      "end": 1307.6399765014648,
      "text": " would bring these offerings, and no doubt they had been instructed by Adam, and"
    },
    {
      "id": 20,
      "start": 1307.6799697875977,
      "end": 1316.839973449707,
      "text": " this instruction that came from God, and Abel comes with a blood offering. Cain? He"
    },
    {
      "id": 21,
      "start": 1316.839973449707,
      "end": 1322.7599716186523,
      "text": " comes with an offering that's the work of his hands. And what does God say? He"
    },
    {
      "id": 22,
      "start": 1322.7599716186523,
      "end": 1327.6799697875977,
      "text": " says the works of your hands are insufficient. Many religions around the"
    },
    {
      "id": 23,
      "start": 1327.6799697875977,
      "end": 1334.0399780273438,
      "text": " world today, in fact I heard in the last couple of weeks a survey that was done,"
    },
    {
      "id": 24,
      "start": 1334.1199798583984,
      "end": 1340.3999786376953,
      "text": " and amongst those that were asked the question about salvation, nearly 70%"
    },
    {
      "id": 25,
      "start": 1340.3999786376953,
      "end": 1346.47998046875,
      "text": " responded by saying you could be good enough to get to heaven. That's not what"
    },
    {
      "id": 26,
      "start": 1346.47998046875,
      "end": 1351.5999755859375,
      "text": " the Word of God teaches. The Word of God tells us that we're all sinners, for all"
    },
    {
      "id": 27,
      "start": 1351.5999755859375,
      "end": 1356.7599792480469,
      "text": " have sinned and come short of the glory of God. Isaiah, in fact, says all of our"
    },
    {
      "id": 28,
      "start": 1356.7599792480469,
      "end": 1362.1199798583984,
      "text": " good works are as filthy rags. See, we could not earn our own salvation. It's"
    },
    {
      "id": 29,
      "start": 1362.1199798583984,
      "end": 1365.9199676513672,
      "text": " impossible, for by grace are you saved through faith, and that not of yourselves"
    },
    {
      "id": 30,
      "start": 1365.9199676513672,
      "end": 1371.4399719238281,
      "text": " is the gift of God, not of works, lest any man should boast. And we find that in"
    },
    {
      "id": 31,
      "start": 1371.4399719238281,
      "end": 1377.6399688720703,
      "text": " Abel's worship, that he would come and he would worship God in accordance to what"
    },
    {
      "id": 32,
      "start": 1377.6399688720703,
      "end": 1384.1599731445312,
      "text": " God had instructed, what God had commanded. I believe that Cain came with"
    },
    {
      "id": 33,
      "start": 1384.1599731445312,
      "end": 1390.3999786376953,
      "text": " a desire to worship God, but he came the wrong way. He came the wrong way. And so"
    },
    {
      "id": 34,
      "start": 1390.3999786376953,
      "end": 1394.959976196289,
      "text": " we find that God is worthy of our worship, but God has also defined how we"
    },
    {
      "id": 35,
      "start": 1394.959976196289,
      "end": 1399.6799774169922,
      "text": " are to worship Him. Notice with me back in Hebrews chapter 11, as we look at the"
    },
    {
      "id": 36,
      "start": 1399.6799774169922,
      "end": 1402.7599792480469,
      "text": " remainder of verse number four, I want you to notice what the Bible tells us"
    },
    {
      "id": 37,
      "start": 1402.7599792480469,
      "end": 1409.239974975586,
      "text": " about this man Abel. The Bible says this, by faith Abel offered unto God a more"
    },
    {
      "id": 38,
      "start": 1409.239974975586,
      "end": 1415.6399688720703,
      "text": " excellent sacrifice than Cain, by which he obtained witness that he was"
    },
    {
      "id": 39,
      "start": 1415.6399688720703,
      "end": 1422.1199798583984,
      "text": " righteous. That's a good testimony, by the way, is it not? In verse number four, we"
    },
    {
      "id": 40,
      "start": 1422.1199798583984,
      "end": 1427.8399658203125,
      "text": " find that when we would consider our righteousness, we understand that we are"
    },
    {
      "id": 41,
      "start": 1427.8399658203125,
      "end": 1434.5999755859375,
      "text": " clothed the imputed righteousness of Christ. For God hath made Him Christ to"
    },
    {
      "id": 42,
      "start": 1434.5999755859375,
      "end": 1440.1199798583984,
      "text": " be sin for us who knew no sin, that we might be made the righteousness of God"
    },
    {
      "id": 43,
      "start": 1440.1199798583984,
      "end": 1445.6799774169922,
      "text": " in Him. 2nd Corinthians 5 and verse number 21. Paul said, I'm not going about"
    },
    {
      "id": 44,
      "start": 1445.6799774169922,
      "end": 1449.7599792480469,
      "text": " to establish mine own righteousness, but Christ's righteousness in Philippians"
    },
    {
      "id": 45,
      "start": 1449.7599792480469,
      "end": 1454.2799682617188,
      "text": " chapter number 3. And you find that as we look at the the passage of Scripture,"
    },
    {
      "id": 46,
      "start": 1454.2799682617188,
      "end": 1458.5599670410156,
      "text": " you think about the testimony that we can stand and we can say, I've been"
    },
    {
      "id": 47,
      "start": 1458.5599670410156,
      "end": 1464.6599731445312,
      "text": " redeemed, I am saved by the blood of the Lamb, I am declared righteous, not because"
    },
    {
      "id": 48,
      "start": 1464.6599731445312,
      "end": 1469.6799621582031,
      "text": " of any work that I have done, but all because of what Jesus did. I came by way"
    },
    {
      "id": 49,
      "start": 1469.719970703125,
      "end": 1475.0399780273438,
      "text": " of the cross. Notice it continues and says this, God testifying of His gifts."
    },
    {
      "id": 50,
      "start": 1475.0399780273438,
      "end": 1481.7999877929688,
      "text": " And notice this last phrase in verse number four, and by it He being dead yet"
    },
    {
      "id": 51,
      "start": 1481.7999877929688,
      "end": 1489.3999633789062,
      "text": " speaketh. Oh, the testimony of this man. All of these years later, millennia later,"
    },
    {
      "id": 52,
      "start": 1489.3999633789062,
      "end": 1498.7599792480469,
      "text": " we're speaking about this offering of Abel. He being dead yet speaketh. We see"
    },
    {
      "id": 53,
      "start": 1498.7599792480469,
      "end": 1501.7599792480469,
      "text": " the worship of Abel as we continue to move through the passage of Scripture."
    },
    {
      "id": 54,
      "start": 1501.7599792480469,
      "end": 1505.3999633789062,
      "text": " Notice with me in verses five and six, number two this morning, the walk of"
    },
    {
      "id": 55,
      "start": 1505.3999633789062,
      "end": 1511.2799682617188,
      "text": " Enoch. The walk of Enoch. Oh, we're to worship God according to how He has"
    },
    {
      "id": 56,
      "start": 1511.2799682617188,
      "end": 1515.5599670410156,
      "text": " instructed us to worship Him, and no doubt He is worthy of our worship. But"
    },
    {
      "id": 57,
      "start": 1515.5599670410156,
      "end": 1520.1799621582031,
      "text": " we then find, as we move into verse number five, that the Bible says that by"
    },
    {
      "id": 58,
      "start": 1520.1799621582031,
      "end": 1525.7599792480469,
      "text": " faith Enoch was translated, that he should not see death and was not found,"
    },
    {
      "id": 59,
      "start": 1525.7599792480469,
      "end": 1531.2799682617188,
      "text": " because God had translated him, for before his translation he had this"
    },
    {
      "id": 60,
      "start": 1531.2799682617188,
      "end": 1536.2399597167969,
      "text": " testimony that he pleased God. We find that in Genesis chapter 5, verses 22"
    },
    {
      "id": 61,
      "start": 1536.2399597167969,
      "end": 1540.719970703125,
      "text": " through 24, again a reference to the beginning of the Bible, that the Bible"
    },
    {
      "id": 62,
      "start": 1540.719970703125,
      "end": 1546.1599731445312,
      "text": " says this, that Enoch walked with God and he was not, for God took him. I mean, what"
    },
    {
      "id": 63,
      "start": 1546.1599731445312,
      "end": 1551.0799865722656,
      "text": " a great picture that is. What a great testimony that is. And we find that as we"
    },
    {
      "id": 64,
      "start": 1551.0799865722656,
      "end": 1555.47998046875,
      "text": " consider the walk of Enoch, and we would understand this morning that as"
    },
    {
      "id": 65,
      "start": 1555.5999755859375,
      "end": 1560.8799743652344,
      "text": " Abel was the first human being to die, that Enoch was the first human being to"
    },
    {
      "id": 66,
      "start": 1560.8799743652344,
      "end": 1566.3599853515625,
      "text": " escape death. The Bible tells us of Enoch that he walked with God and he was not,"
    },
    {
      "id": 67,
      "start": 1566.3599853515625,
      "end": 1571.6799621582031,
      "text": " for God took him. It says that he had this testimony that he was, notice it"
    },
    {
      "id": 68,
      "start": 1571.6799621582031,
      "end": 1576.4399719238281,
      "text": " says that he was translated, that he should not see death and was not found."
    },
    {
      "id": 69,
      "start": 1576.4399719238281,
      "end": 1581.5999755859375,
      "text": " They couldn't find him because God took him, amen? And can you imagine, I mean, the"
    },
    {
      "id": 70,
      "start": 1581.5999755859375,
      "end": 1585.1999816894531,
      "text": " Bible gives us, look back in Genesis chapter number five, and I want you to"
    },
    {
      "id": 71,
      "start": 1585.1999816894531,
      "end": 1590.0399780273438,
      "text": " notice what the Bible says in verses 22 through 24. The Bible says this, in"
    },
    {
      "id": 72,
      "start": 1590.0399780273438,
      "end": 1595.47998046875,
      "text": " Genesis chapter number five, in verse number 22, and Enoch, well look at verse"
    },
    {
      "id": 73,
      "start": 1595.47998046875,
      "end": 1600.0799865722656,
      "text": " 21, it says, and Enoch lived sixty and five years and begat Methuselah. And"
    },
    {
      "id": 74,
      "start": 1600.0799865722656,
      "end": 1607.2799682617188,
      "text": " Enoch walked with God after he begat Methuselah three hundred years and begat"
    },
    {
      "id": 75,
      "start": 1607.2799682617188,
      "end": 1612.0799865722656,
      "text": " sons and daughters. And all the days of Enoch were three hundred sixty and five"
    },
    {
      "id": 76,
      "start": 1612.0799865722656,
      "end": 1618.5599670410156,
      "text": " years, and look at verse 24, and Enoch walked with God and he was not, for God"
    },
    {
      "id": 77,
      "start": 1618.5599670410156,
      "end": 1624.7599792480469,
      "text": " took him. Can you imagine just walking along in life, having that sweet communion"
    },
    {
      "id": 78,
      "start": 1624.7599792480469,
      "end": 1631.0399780273438,
      "text": " and fellowship with God, so much so that God took him? I mean, where did Enoch go?"
    },
    {
      "id": 79,
      "start": 1631.0399780273438,
      "end": 1635.7599792480469,
      "text": " Has anyone seen Enoch? He's missing. Isn't that awesome? I mean, I think it's great. I"
    },
    {
      "id": 80,
      "start": 1635.7599792480469,
      "end": 1641.7999877929688,
      "text": " also believe that it's a picture, a type, of the rapture. The fact that one day the"
    },
    {
      "id": 81,
      "start": 1641.7999877929688,
      "end": 1646.1999816894531,
      "text": " trumpet of the Lord is going to sound. We find that the Bible tells us in"
    },
    {
      "id": 82,
      "start": 1646.1999816894531,
      "end": 1650.6799621582031,
      "text": " Revelation chapter number four that John heard this voice that said, come up"
    },
    {
      "id": 83,
      "start": 1650.6799621582031,
      "end": 1655.6799621582031,
      "text": " hither. We find that in chapters two and three, all the churches in Asia are"
    },
    {
      "id": 84,
      "start": 1655.6799621582031,
      "end": 1660.47998046875,
      "text": " referenced in dealing with not only those physical churches that existed,"
    },
    {
      "id": 85,
      "start": 1660.47998046875,
      "end": 1665.0799865722656,
      "text": " those real churches, but also dealing with church age, if you will. And then you"
    },
    {
      "id": 86,
      "start": 1665.0799865722656,
      "end": 1669.5199584960938,
      "text": " find in the fourth chapter, come up hither. I'm mindful of what the Apostle"
    },
    {
      "id": 87,
      "start": 1669.6399841308594,
      "end": 1672.7999877929688,
      "text": " Paul says in 1 Thessalonians chapter number four with regard to the"
    },
    {
      "id": 88,
      "start": 1672.7999877929688,
      "end": 1678.0799865722656,
      "text": " instruction, the teaching that he gives us with regard to the rapture. Yes, I"
    },
    {
      "id": 89,
      "start": 1678.0799865722656,
      "end": 1682.9599609375,
      "text": " agree. Many people have said the word rapture is not in the Bible. It's not, but"
    },
    {
      "id": 90,
      "start": 1682.9599609375,
      "end": 1686.3199768066406,
      "text": " the word rapture means to be caught up. And in 1 Thessalonians chapter number four,"
    },
    {
      "id": 91,
      "start": 1686.3199768066406,
      "end": 1689.7999877929688,
      "text": " he says, then we which are alive and remain shall be caught up together to"
    },
    {
      "id": 92,
      "start": 1689.7999877929688,
      "end": 1695.3199768066406,
      "text": " meet the Lord in the clouds, and so shall we ever be with the Lord. And then he"
    },
    {
      "id": 93,
      "start": 1695.3199768066406,
      "end": 1699.4399719238281,
      "text": " says in verse number 18, wherefore comfort one another with these words. Oh,"
    },
    {
      "id": 94,
      "start": 1699.4399719238281,
      "end": 1705.0399780273438,
      "text": " how comforting those words are to understand that one day the Lord Jesus"
    },
    {
      "id": 95,
      "start": 1705.0399780273438,
      "end": 1710.3999633789062,
      "text": " Christ is going to call us home. Now, I'd like to believe that it would be in my"
    },
    {
      "id": 96,
      "start": 1710.3999633789062,
      "end": 1715.1199951171875,
      "text": " lifetime. I know there are preachers over the centuries that have had that same"
    },
    {
      "id": 97,
      "start": 1715.1199951171875,
      "end": 1718.9599609375,
      "text": " testimony and that same desire that the rapture of the church would happen"
    },
    {
      "id": 98,
      "start": 1718.9599609375,
      "end": 1721.9599609375,
      "text": " during their lifetime, and what a blessing it would be. Brother Mershawn"
    },
    {
      "id": 99,
      "start": 1722.0399780273438,
      "end": 1726.5199584960938,
      "text": " often says he's looking for the upper taker and not the undertaker, and I love"
    },
    {
      "id": 100,
      "start": 1726.5199584960938,
      "end": 1732.0799560546875,
      "text": " that quote, that phraseology that he uses. And we find that Enoch, he escaped"
    },
    {
      "id": 101,
      "start": 1732.0799560546875,
      "end": 1737.6399536132812,
      "text": " death. He walked with God. He had this testimony back in chapter number 11 of"
    },
    {
      "id": 102,
      "start": 1737.6399536132812,
      "end": 1741.7599487304688,
      "text": " Hebrews in verse number five, the verse in which we're looking at the walk of"
    },
    {
      "id": 103,
      "start": 1741.7599487304688,
      "end": 1749.7599487304688,
      "text": " Enoch. Notice what it says at the end of the verse. For before his translation, he"
    },
    {
      "id": 104,
      "start": 1749.7599487304688,
      "end": 1757.4400024414062,
      "text": " had this testimony. What is it? That he pleased God. Can I tell you this morning,"
    },
    {
      "id": 105,
      "start": 1757.4400024414062,
      "end": 1766.239990234375,
      "text": " that's a good testimony to have. Can I ask you this morning, what God say of us?"
    },
    {
      "id": 106,
      "start": 1766.239990234375,
      "end": 1772.8399658203125,
      "text": " What God say of you? That your walk pleases Him. I hope this morning you"
    },
    {
      "id": 107,
      "start": 1772.8399658203125,
      "end": 1778.7599487304688,
      "text": " could say yes. Not in a prideful, boastful way, but a way in which you have sought"
    },
    {
      "id": 108,
      "start": 1778.7599487304688,
      "end": 1783.1199951171875,
      "text": " to walk with the Lord and be obedient to His Word. That you've gone through the"
    },
    {
      "id": 109,
      "start": 1783.1199951171875,
      "end": 1787.4400024414062,
      "text": " process of proving what is acceptable unto the Lord, and that you've desired to"
    },
    {
      "id": 110,
      "start": 1787.4400024414062,
      "end": 1791.9199829101562,
      "text": " walk with Him and to please Him. And we find that the Bible tells us that Enoch"
    },
    {
      "id": 111,
      "start": 1791.9199829101562,
      "end": 1796.5599975585938,
      "text": " had this testimony, but when we look at verse number six, the Bible tells us but"
    },
    {
      "id": 112,
      "start": 1796.5599975585938,
      "end": 1801.5599975585938,
      "text": " without faith, it is impossible to please Him."
    },
    {
      "id": 0,
      "start": 1801.5599975585938,
      "end": 1803.85999751091,
      "text": " For he that cometh to God must believe that he is,"
    },
    {
      "id": 1,
      "start": 1803.85999751091,
      "end": 1806.5799975395203,
      "text": " and he is a rewarder of them that diligently seek him.\""
    },
    {
      "id": 2,
      "start": 1806.5799975395203,
      "end": 1809.7399978637695,
      "text": " And so I find that as I look at verses 5 and 6 together,"
    },
    {
      "id": 3,
      "start": 1809.7399978637695,
      "end": 1812.0199975967407,
      "text": " and I notice the walk of Enoch,"
    },
    {
      "id": 4,
      "start": 1812.0199975967407,
      "end": 1815.6599979400635,
      "text": " that I am encouraged not only by his walk,"
    },
    {
      "id": 5,
      "start": 1815.6599979400635,
      "end": 1817.2399978637695,
      "text": " challenged by his walk,"
    },
    {
      "id": 6,
      "start": 1817.2399978637695,
      "end": 1819.53999710083,
      "text": " but I'm encouraged to know that by faith"
    },
    {
      "id": 7,
      "start": 1819.53999710083,
      "end": 1821.379997253418,
      "text": " I can please God as well."
    },
    {
      "id": 8,
      "start": 1822.53999710083,
      "end": 1824.299997329712,
      "text": " And so can you."
    },
    {
      "id": 9,
      "start": 1824.299997329712,
      "end": 1826.8199977874756,
      "text": " We understand that the Bible says without faith,"
    },
    {
      "id": 10,
      "start": 1826.8199977874756,
      "end": 1829.7399978637695,
      "text": " it is impossible to please Him."
    },
    {
      "id": 11,
      "start": 1829.7399978637695,
      "end": 1833.2599983215332,
      "text": " Remember, as we've studied several weeks on Wednesdays"
    },
    {
      "id": 12,
      "start": 1833.2599983215332,
      "end": 1834.7399978637695,
      "text": " over the past couple of months,"
    },
    {
      "id": 13,
      "start": 1834.7399978637695,
      "end": 1837.4599990844727,
      "text": " we have referenced various passages of Scripture"
    },
    {
      "id": 14,
      "start": 1837.4599990844727,
      "end": 1840.4199981689453,
      "text": " after we ended our Elijah and Elisha study."
    },
    {
      "id": 15,
      "start": 1840.4199981689453,
      "end": 1843.1799964904785,
      "text": " And as we've looked at a number of different passages,"
    },
    {
      "id": 16,
      "start": 1843.1799964904785,
      "end": 1846.7199974060059,
      "text": " we have mentioned how that God marveled at their faith."
    },
    {
      "id": 17,
      "start": 1846.7199974060059,
      "end": 1849.8599967956543,
      "text": " He marveled also at their unbelief."
    },
    {
      "id": 18,
      "start": 1849.8599967956543,
      "end": 1852.8599967956543,
      "text": " He says to the disciples, he says to Peter, in fact,"
    },
    {
      "id": 19,
      "start": 1852.8599967956543,
      "end": 1854.9599990844727,
      "text": " how is it that your faith is so small?"
    },
    {
      "id": 20,
      "start": 1854.9599990844727,
      "end": 1856.8999977111816,
      "text": " How is it that you have no faith?"
    },
    {
      "id": 21,
      "start": 1856.8999977111816,
      "end": 1858.099998474121,
      "text": " Remember the disciples."
    },
    {
      "id": 22,
      "start": 1858.379997253418,
      "end": 1861.3399963378906,
      "text": " There was the feeding of the 5,000."
    },
    {
      "id": 23,
      "start": 1861.3399963378906,
      "end": 1864.4199981689453,
      "text": " What miraculous event that was."
    },
    {
      "id": 24,
      "start": 1864.4199981689453,
      "end": 1866.259994506836,
      "text": " We find that Jesus says,"
    },
    {
      "id": 25,
      "start": 1866.259994506836,
      "end": 1868.4599990844727,
      "text": " hey, we need to get them something to eat."
    },
    {
      "id": 26,
      "start": 1868.4599990844727,
      "end": 1870.2999954223633,
      "text": " The disciples say, hey, send them away."
    },
    {
      "id": 27,
      "start": 1870.2999954223633,
      "end": 1872.2999954223633,
      "text": " It's time is far spent."
    },
    {
      "id": 28,
      "start": 1872.2999954223633,
      "end": 1873.4599990844727,
      "text": " It's time for them to go home."
    },
    {
      "id": 29,
      "start": 1873.4599990844727,
      "end": 1874.979995727539,
      "text": " We have nothing to give them to eat."
    },
    {
      "id": 30,
      "start": 1874.979995727539,
      "end": 1878.3999938964844,
      "text": " And Jesus says, no, we're gonna give them something to eat."
    },
    {
      "id": 31,
      "start": 1878.3999938964844,
      "end": 1881.1399993896484,
      "text": " They have five loaves and two fish, right?"
    },
    {
      "id": 32,
      "start": 1881.1399993896484,
      "end": 1884.7399978637695,
      "text": " And the Bible tells us that He instructs the disciples"
    },
    {
      "id": 33,
      "start": 1884.7399978637695,
      "end": 1886.4199981689453,
      "text": " to have them sit in companies."
    },
    {
      "id": 34,
      "start": 1886.5,
      "end": 1889.1800003051758,
      "text": " And as they sit in companies by 50,"
    },
    {
      "id": 35,
      "start": 1889.1800003051758,
      "end": 1892.1399993896484,
      "text": " that He blessed and break and He distributed"
    },
    {
      "id": 36,
      "start": 1892.1399993896484,
      "end": 1894.4599990844727,
      "text": " through the disciples to all of those folks,"
    },
    {
      "id": 37,
      "start": 1894.4599990844727,
      "end": 1896.3399963378906,
      "text": " and they all were filled."
    },
    {
      "id": 38,
      "start": 1897.7399978637695,
      "end": 1900.2999954223633,
      "text": " And then they took up some baskets of the remains."
    },
    {
      "id": 39,
      "start": 1900.2999954223633,
      "end": 1901.6999969482422,
      "text": " How many baskets?"
    },
    {
      "id": 40,
      "start": 1901.6999969482422,
      "end": 1902.5400009155273,
      "text": " 12."
    },
    {
      "id": 41,
      "start": 1903.5400009155273,
      "end": 1906.8199996948242,
      "text": " They had more at the end than they had at the beginning."
    },
    {
      "id": 42,
      "start": 1906.8199996948242,
      "end": 1908.8199996948242,
      "text": " Now, the disciples saw that."
    },
    {
      "id": 43,
      "start": 1908.8199996948242,
      "end": 1910.5400009155273,
      "text": " The disciples experienced that."
    },
    {
      "id": 44,
      "start": 1910.5400009155273,
      "end": 1912.259994506836,
      "text": " The disciples were part of that."
    },
    {
      "id": 45,
      "start": 1912.259994506836,
      "end": 1914.0199966430664,
      "text": " They were the ones that were distributing."
    },
    {
      "id": 46,
      "start": 1914.0199966430664,
      "end": 1916.259994506836,
      "text": " They were the ones that picked up the fragments."
    },
    {
      "id": 47,
      "start": 1917.099998474121,
      "end": 1921.3399963378906,
      "text": " They witnessed the work of God and the power of God."
    },
    {
      "id": 48,
      "start": 1921.3399963378906,
      "end": 1924.3399963378906,
      "text": " But shortly thereafter, there were 4,000 that were gathered."
    },
    {
      "id": 49,
      "start": 1927.0,
      "end": 1928.6999969482422,
      "text": " You know what the disciples said?"
    },
    {
      "id": 50,
      "start": 1929.8999938964844,
      "end": 1932.3000030517578,
      "text": " How can a man provide bread for these folks?"
    },
    {
      "id": 51,
      "start": 1933.4599914550781,
      "end": 1934.5,
      "text": " That's what they say."
    },
    {
      "id": 52,
      "start": 1936.020004272461,
      "end": 1938.6399993896484,
      "text": " The question is, why don't they believe?"
    },
    {
      "id": 53,
      "start": 1938.6399993896484,
      "end": 1939.9400024414062,
      "text": " Why don't they have faith?"
    },
    {
      "id": 54,
      "start": 1941.4400024414062,
      "end": 1944.8600006103516,
      "text": " And I find myself so often,"
    },
    {
      "id": 55,
      "start": 1944.8600006103516,
      "end": 1946.6199951171875,
      "text": " as we would look at the Scriptures"
    },
    {
      "id": 56,
      "start": 1946.6199951171875,
      "end": 1949.1799926757812,
      "text": " and we would evaluate and understand what's going on,"
    },
    {
      "id": 57,
      "start": 1949.1799926757812,
      "end": 1951.9400024414062,
      "text": " and we would be able to identify things in the lives"
    },
    {
      "id": 58,
      "start": 1951.9400024414062,
      "end": 1953.4400024414062,
      "text": " of those that have gone before us,"
    },
    {
      "id": 59,
      "start": 1953.4400024414062,
      "end": 1957.6199951171875,
      "text": " but how often do we face the same situations in our life?"
    },
    {
      "id": 60,
      "start": 1957.6199951171875,
      "end": 1960.6600036621094,
      "text": " We've seen God work, we've witnessed God's power,"
    },
    {
      "id": 61,
      "start": 1960.6600036621094,
      "end": 1963.0999908447266,
      "text": " but we come to a particular situation in our life"
    },
    {
      "id": 62,
      "start": 1963.0999908447266,
      "end": 1965.259994506836,
      "text": " and we say, I just don't know how it's gonna work."
    },
    {
      "id": 63,
      "start": 1965.259994506836,
      "end": 1967.259994506836,
      "text": " I just don't know how it's gonna happen."
    },
    {
      "id": 64,
      "start": 1968.3800048828125,
      "end": 1970.0999908447266,
      "text": " Where's your faith?"
    },
    {
      "id": 65,
      "start": 1970.0999908447266,
      "end": 1971.0999908447266,
      "text": " Where's your faith?"
    },
    {
      "id": 66,
      "start": 1972.7799987792969,
      "end": 1974.5399932861328,
      "text": " And so we understand that without faith,"
    },
    {
      "id": 67,
      "start": 1975.1799926757812,
      "end": 1976.020004272461,
      "text": " it's impossible to please Him."
    },
    {
      "id": 68,
      "start": 1976.020004272461,
      "end": 1978.3800048828125,
      "text": " See, God wants us to believe Him."
    },
    {
      "id": 69,
      "start": 1978.3800048828125,
      "end": 1980.3399963378906,
      "text": " I'm mindful of the book of Numbers,"
    },
    {
      "id": 70,
      "start": 1981.239990234375,
      "end": 1985.0599975585938,
      "text": " the account that God gives us in chapters 13 and 14"
    },
    {
      "id": 71,
      "start": 1985.0599975585938,
      "end": 1987.1799926757812,
      "text": " with the spies that would be sent out."
    },
    {
      "id": 72,
      "start": 1988.7799987792969,
      "end": 1991.020004272461,
      "text": " We find that as the spies return,"
    },
    {
      "id": 73,
      "start": 1991.020004272461,
      "end": 1992.0999908447266,
      "text": " and there were 12 of them,"
    },
    {
      "id": 74,
      "start": 1992.0999908447266,
      "end": 1993.8199920654297,
      "text": " and we know that it was Caleb and Joshua"
    },
    {
      "id": 75,
      "start": 1993.8199920654297,
      "end": 1997.8999938964844,
      "text": " that brought back the good report, the faithful report."
    },
    {
      "id": 76,
      "start": 1997.8999938964844,
      "end": 2000.6600036621094,
      "text": " The other 10, they didn't believe God."
    },
    {
      "id": 77,
      "start": 2001.6600036621094,
      "end": 2003.8999938964844,
      "text": " God had said over and over,"
    },
    {
      "id": 78,
      "start": 2003.8999938964844,
      "end": 2006.0999908447266,
      "text": " I'm gonna give you this land."
    },
    {
      "id": 79,
      "start": 2006.0999908447266,
      "end": 2007.020004272461,
      "text": " I'm gonna go with you."
    },
    {
      "id": 80,
      "start": 2007.020004272461,
      "end": 2008.9400024414062,
      "text": " You're gonna possess this land."
    },
    {
      "id": 81,
      "start": 2010.0999908447266,
      "end": 2012.3000030517578,
      "text": " And yet they didn't believe."
    },
    {
      "id": 82,
      "start": 2012.3000030517578,
      "end": 2015.1799926757812,
      "text": " We know that those 10 individuals,"
    },
    {
      "id": 83,
      "start": 2015.1799926757812,
      "end": 2017.4199981689453,
      "text": " they influenced the entire congregation"
    },
    {
      "id": 84,
      "start": 2017.4199981689453,
      "end": 2018.6999969482422,
      "text": " of the nation of Israel."
    },
    {
      "id": 85,
      "start": 2019.739990234375,
      "end": 2021.8199920654297,
      "text": " Joshua and Caleb, they rent their clothes,"
    },
    {
      "id": 86,
      "start": 2021.8199920654297,
      "end": 2023.3000030517578,
      "text": " they plead with the people,"
    },
    {
      "id": 87,
      "start": 2023.3000030517578,
      "end": 2026.5999908447266,
      "text": " so much so that the people are ready to stone Joshua and Caleb."
    },
    {
      "id": 88,
      "start": 2027.9599914550781,
      "end": 2030.020004272461,
      "text": " God says to Moses, how long will it be,"
    },
    {
      "id": 89,
      "start": 2030.020004272461,
      "end": 2031.5800018310547,
      "text": " ere my people believe me?"
    },
    {
      "id": 90,
      "start": 2032.5800018310547,
      "end": 2034.0999908447266,
      "text": " What of this morning?"
    },
    {
      "id": 91,
      "start": 2034.0999908447266,
      "end": 2037.020004272461,
      "text": " We think about the walk of Enoch."
    },
    {
      "id": 92,
      "start": 2037.020004272461,
      "end": 2038.1399993896484,
      "text": " He walked with God."
    },
    {
      "id": 93,
      "start": 2038.1399993896484,
      "end": 2039.3000030517578,
      "text": " He believed God."
    },
    {
      "id": 94,
      "start": 2039.3000030517578,
      "end": 2040.8600006103516,
      "text": " He walked by faith."
    },
    {
      "id": 95,
      "start": 2040.8600006103516,
      "end": 2044.7799987792969,
      "text": " And we see that God blessed and God translated him."
    },
    {
      "id": 96,
      "start": 2044.7799987792969,
      "end": 2047.4199981689453,
      "text": " I mean, it's an amazing truth of the word of God."
    },
    {
      "id": 97,
      "start": 2047.4199981689453,
      "end": 2050.6199951171875,
      "text": " Again, as we look at these first references"
    },
    {
      "id": 98,
      "start": 2050.6199951171875,
      "end": 2052.220001220703,
      "text": " in Hebrews chapter 11,"
    },
    {
      "id": 99,
      "start": 2052.220001220703,
      "end": 2055.8399963378906,
      "text": " and we see how that they provide this reference"
    },
    {
      "id": 100,
      "start": 2055.8399963378906,
      "end": 2057.3800048828125,
      "text": " back to the book of Genesis,"
    },
    {
      "id": 101,
      "start": 2057.3800048828125,
      "end": 2061.6399841308594,
      "text": " giving credibility to what we read in the book of Genesis."
    },
    {
      "id": 102,
      "start": 2062.5799865722656,
      "end": 2064.2999877929688,
      "text": " We see the worship of Abel."
    },
    {
      "id": 103,
      "start": 2064.2999877929688,
      "end": 2068.0599975585938,
      "text": " We see the walk of Enoch in number three this morning."
    },
    {
      "id": 104,
      "start": 2068.0599975585938,
      "end": 2071.6600036621094,
      "text": " In verse number seven, we see the work of Noah."
    },
    {
      "id": 105,
      "start": 2071.6600036621094,
      "end": 2073.4199829101562,
      "text": " The work of Noah."
    },
    {
      "id": 106,
      "start": 2073.4199829101562,
      "end": 2075.739990234375,
      "text": " We understand that God spoke to Noah."
    },
    {
      "id": 107,
      "start": 2075.739990234375,
      "end": 2078.6600036621094,
      "text": " God informed Noah of coming judgment."
    },
    {
      "id": 108,
      "start": 2078.6600036621094,
      "end": 2081.980010986328,
      "text": " And God specifically instructed Moses"
    },
    {
      "id": 109,
      "start": 2081.980010986328,
      "end": 2084.6600036621094,
      "text": " with regard to what he needed to do."
    },
    {
      "id": 110,
      "start": 2084.6600036621094,
      "end": 2086.720001220703,
      "text": " We find that Noah believed God."
    },
    {
      "id": 111,
      "start": 2086.760009765625,
      "end": 2087.8399963378906,
      "text": " He acted with faith."
    },
    {
      "id": 112,
      "start": 2087.8399963378906,
      "end": 2089.279998779297,
      "text": " Notice in verse number seven,"
    },
    {
      "id": 113,
      "start": 2089.279998779297,
      "end": 2090.959991455078,
      "text": " and we're noticing the work of Noah."
    },
    {
      "id": 114,
      "start": 2090.959991455078,
      "end": 2092.2000122070312,
      "text": " It tells us in verse number seven,"
    },
    {
      "id": 115,
      "start": 2092.2000122070312,
      "end": 2095.3599853515625,
      "text": " by faith Noah being warned of God"
    },
    {
      "id": 116,
      "start": 2095.3599853515625,
      "end": 2097.2000122070312,
      "text": " of things not seen as yet."
    },
    {
      "id": 117,
      "start": 2097.2000122070312,
      "end": 2098.3599853515625,
      "text": " Notice what the Bible says."
    },
    {
      "id": 118,
      "start": 2098.3599853515625,
      "end": 2100.3999938964844,
      "text": " He moved with fear,"
    },
    {
      "id": 119,
      "start": 2100.3999938964844,
      "end": 2104.2000122070312,
      "text": " prepared an ark to the saving of his house,"
    },
    {
      "id": 120,
      "start": 2104.2000122070312,
      "end": 2105.959991455078,
      "text": " by the witch he condemned the world"
    },
    {
      "id": 121,
      "start": 2105.959991455078,
      "end": 2108.6399841308594,
      "text": " and became heir of the righteousness,"
    },
    {
      "id": 122,
      "start": 2108.6399841308594,
      "end": 2110.8399963378906,
      "text": " which is by faith."
    },
    {
      "id": 123,
      "start": 2110.8399963378906,
      "end": 2112.959991455078,
      "text": " In Genesis chapter six through eight,"
    },
    {
      "id": 124,
      "start": 2112.959991455078,
      "end": 2115.6399841308594,
      "text": " we find the Bible gives us a record"
    },
    {
      "id": 125,
      "start": 2115.6799926757812,
      "end": 2117.959991455078,
      "text": " of the Genesis flood."
    },
    {
      "id": 126,
      "start": 2117.959991455078,
      "end": 2120.3599853515625,
      "text": " We spent many weeks studying through"
    },
    {
      "id": 127,
      "start": 2120.3599853515625,
      "end": 2122.1199951171875,
      "text": " those chapters in Genesis."
    },
    {
      "id": 128,
      "start": 2122.1199951171875,
      "end": 2124.480010986328,
      "text": " And you notice in Genesis chapter number six,"
    },
    {
      "id": 129,
      "start": 2124.480010986328,
      "end": 2126.2000122070312,
      "text": " if you turn back there,"
    },
    {
      "id": 130,
      "start": 2126.2000122070312,
      "end": 2128.6799926757812,
      "text": " the Bible tells us that God sees"
    },
    {
      "id": 131,
      "start": 2128.6799926757812,
      "end": 2130.480010986328,
      "text": " the wickedness of mankind."
    },
    {
      "id": 132,
      "start": 2130.480010986328,
      "end": 2133.480010986328,
      "text": " And the Lord says that he's going to destroy man"
    },
    {
      "id": 133,
      "start": 2133.480010986328,
      "end": 2135.779998779297,
      "text": " whom he had created from the face of the earth."
    },
    {
      "id": 134,
      "start": 2135.779998779297,
      "end": 2139.1799926757812,
      "text": " But yet God tells us that Noah found grace"
    },
    {
      "id": 135,
      "start": 2139.1799926757812,
      "end": 2142.1199951171875,
      "text": " in the eyes of the Lord in verse number eight."
    },
    {
      "id": 136,
      "start": 2142.1199951171875,
      "end": 2144.6000061035156,
      "text": " And the Bible tells us that in verse number 13"
    },
    {
      "id": 137,
      "start": 2144.6399841308594,
      "end": 2146.0,
      "text": " of Genesis chapter number six,"
    },
    {
      "id": 138,
      "start": 2146.0,
      "end": 2147.6799926757812,
      "text": " that God said unto Noah,"
    },
    {
      "id": 139,
      "start": 2147.6799926757812,
      "end": 2150.1600036621094,
      "text": " the end of all flesh has come before me,"
    },
    {
      "id": 140,
      "start": 2150.1600036621094,
      "end": 2152.6000061035156,
      "text": " for the earth is filled with violence through them"
    },
    {
      "id": 141,
      "start": 2152.6000061035156,
      "end": 2154.6399841308594,
      "text": " and behold, notice what he says,"
    },
    {
      "id": 142,
      "start": 2154.6399841308594,
      "end": 2158.6399841308594,
      "text": " I will destroy them with the earth."
    },
    {
      "id": 143,
      "start": 2158.6399841308594,
      "end": 2161.5799865722656,
      "text": " The very next verse, verse 14,"
    },
    {
      "id": 144,
      "start": 2161.5799865722656,
      "end": 2164.0799865722656,
      "text": " make thee an ark of gopher wood."
    },
    {
      "id": 145,
      "start": 2164.0799865722656,
      "end": 2165.8399963378906,
      "text": " Room shalt thou make in the ark"
    },
    {
      "id": 146,
      "start": 2165.8399963378906,
      "end": 2169.1600036621094,
      "text": " and shalt pitch it within and without with pitch."
    },
    {
      "id": 147,
      "start": 2169.1600036621094,
      "end": 2171.040008544922,
      "text": " He goes through and he gives them the instruction"
    },
    {
      "id": 148,
      "start": 2171.040008544922,
      "end": 2173.6399841308594,
      "text": " with regard to what to do and how to do"
    },
    {
      "id": 149,
      "start": 2173.6399841308594,
      "end": 2177.519989013672,
      "text": " and the elements that he should use,"
    },
    {
      "id": 150,
      "start": 2177.519989013672,
      "end": 2179.6799926757812,
      "text": " the materials I shall say that he should use"
    },
    {
      "id": 151,
      "start": 2179.6799926757812,
      "end": 2182.7999877929688,
      "text": " and all of the details with regard to this ark."
    },
    {
      "id": 152,
      "start": 2182.7999877929688,
      "end": 2184.6000061035156,
      "text": " And we find that in verse number 22,"
    },
    {
      "id": 153,
      "start": 2184.6000061035156,
      "end": 2186.6000061035156,
      "text": " the Bible says this,"
    },
    {
      "id": 154,
      "start": 2186.6000061035156,
      "end": 2190.239990234375,
      "text": " thus did Noah,"
    },
    {
      "id": 155,
      "start": 2190.239990234375,
      "end": 2193.3599853515625,
      "text": " according to all that God commanded him,"
    },
    {
      "id": 156,
      "start": 2193.3599853515625,
      "end": 2196.760009765625,
      "text": " so did he."
    },
    {
      "id": 157,
      "start": 2196.760009765625,
      "end": 2199.7999877929688,
      "text": " He was a man of faith and he was a man of obedience."
    },
    {
      "id": 158,
      "start": 2199.7999877929688,
      "end": 2201.3999938964844,
      "text": " I think it's interesting,"
    },
    {
      "id": 159,
      "start": 2201.4400024414062,
      "end": 2204.3999938964844,
      "text": " the Bible tells us in Hebrews chapter 11,"
    },
    {
      "id": 160,
      "start": 2204.3999938964844,
      "end": 2206.040008544922,
      "text": " that he was warned of God,"
    },
    {
      "id": 161,
      "start": 2206.040008544922,
      "end": 2208.0799865722656,
      "text": " notice what it says,"
    },
    {
      "id": 162,
      "start": 2208.0799865722656,
      "end": 2211.760009765625,
      "text": " of things not seen as yet."
    },
    {
      "id": 163,
      "start": 2211.760009765625,
      "end": 2215.0799865722656,
      "text": " He was warned of God of things not seen as yet."
    },
    {
      "id": 164,
      "start": 2215.0799865722656,
      "end": 2217.6799926757812,
      "text": " As best we know and understand,"
    },
    {
      "id": 165,
      "start": 2217.6799926757812,
      "end": 2219.480010986328,
      "text": " there had not been any rain"
    },
    {
      "id": 166,
      "start": 2219.480010986328,
      "end": 2221.6399841308594,
      "text": " and God said he's gonna destroy the earth with rain,"
    },
    {
      "id": 167,
      "start": 2221.6399841308594,
      "end": 2222.480010986328,
      "text": " with a flood."
    },
    {
      "id": 168,
      "start": 2222.480010986328,
      "end": 2225.040008544922,
      "text": " It was gonna rain for 40 days and 40 nights."
    },
    {
      "id": 169,
      "start": 2225.040008544922,
      "end": 2226.959991455078,
      "text": " And we find that here,"
    },
    {
      "id": 170,
      "start": 2226.959991455078,
      "end": 2229.3599853515625,
      "text": " that God gives this instruction,"
    },
    {
      "id": 171,
      "start": 2229.3599853515625,
      "end": 2233.3200073242188,
      "text": " this warning to Noah of these things not seen as yet."
    },
    {
      "id": 172,
      "start": 2233.3200073242188,
      "end": 2234.8399963378906,
      "text": " He had never experienced rain,"
    },
    {
      "id": 173,
      "start": 2234.8399963378906,
      "end": 2238.3599853515625,
      "text": " nor had he ever endured a flood."
    },
    {
      "id": 174,
      "start": 2238.3599853515625,
      "end": 2240.519989013672,
      "text": " But God said it was gonna happen."
    },
    {
      "id": 175,
      "start": 2240.519989013672,
      "end": 2241.519989013672,
      "text": " And so guess what he did?"
    },
    {
      "id": 176,
      "start": 2241.519989013672,
      "end": 2243.480010986328,
      "text": " Notice it says this,"
    },
    {
      "id": 177,
      "start": 2243.480010986328,
      "end": 2247.1199951171875,
      "text": " that he moved with fear."
    },
    {
      "id": 178,
      "start": 2247.1199951171875,
      "end": 2249.2000122070312,
      "text": " He believed God."
    },
    {
      "id": 179,
      "start": 2249.2000122070312,
      "end": 2251.8800048828125,
      "text": " He believed that what God said he was going to do,"
    },
    {
      "id": 180,
      "start": 2251.8800048828125,
      "end": 2253.1600036621094,
      "text": " that he was going to do."
    },
    {
      "id": 181,
      "start": 2253.1600036621094,
      "end": 2255.480010986328,
      "text": " And God said, I'm gonna destroy."
    },
    {
      "id": 182,
      "start": 2255.480010986328,
      "end": 2257.8800048828125,
      "text": " But he says, make thee an ark of gopher wood."
    },
    {
      "id": 183,
      "start": 2257.8800048828125,
      "end": 2258.9199829101562,
      "text": " Here's the instruction."
    },
    {
      "id": 184,
      "start": 2258.959991455078,
      "end": 2262.279998779297,
      "text": " By the way, this work was a hard work."
    },
    {
      "id": 185,
      "start": 2262.279998779297,
      "end": 2264.8399963378906,
      "text": " It was a long, enduring work."
    },
    {
      "id": 186,
      "start": 2264.8399963378906,
      "end": 2267.6000061035156,
      "text": " We find that this warning is given"
    },
    {
      "id": 187,
      "start": 2267.6000061035156,
      "end": 2268.8800048828125,
      "text": " and it had an impact."
    },
    {
      "id": 188,
      "start": 2268.8800048828125,
      "end": 2272.3599853515625,
      "text": " And we find that he then prepared,"
    },
    {
      "id": 189,
      "start": 2272.3599853515625,
      "end": 2275.959991455078,
      "text": " it says here, an ark to the saving of his house."
    },
    {
      "id": 190,
      "start": 2276.9199829101562,
      "end": 2281.3599853515625,
      "text": " No doubt this was a lengthy, tiring work."
    },
    {
      "id": 191,
      "start": 2281.3599853515625,
      "end": 2283.0,
      "text": " We find that he was faithful to do"
    },
    {
      "id": 192,
      "start": 2283.0,
      "end": 2285.2000122070312,
      "text": " what God called him to do."
    },
    {
      "id": 193,
      "start": 2285.2000122070312,
      "end": 2287.040008544922,
      "text": " And God sustained him."
    },
    {
      "id": 194,
      "start": 2289.279998779297,
      "end": 2292.3599853515625,
      "text": " I think about Noah building that ark."
    },
    {
      "id": 195,
      "start": 2292.3599853515625,
      "end": 2293.720001220703,
      "text": " How many of you have been out to Kentucky"
    },
    {
      "id": 196,
      "start": 2293.720001220703,
      "end": 2295.959991455078,
      "text": " and you've seen the ark out there?"
    },
    {
      "id": 197,
      "start": 2295.959991455078,
      "end": 2297.480010986328,
      "text": " It's pretty neat, isn't it?"
    },
    {
      "id": 198,
      "start": 2297.480010986328,
      "end": 2298.3200073242188,
      "text": " I mean, you get up,"
    },
    {
      "id": 199,
      "start": 2298.3200073242188,
      "end": 2300.279998779297,
      "text": " you kind of come over the crest of the hill"
    },
    {
      "id": 200,
      "start": 2300.279998779297,
      "end": 2302.3599853515625,
      "text": " there in Kentucky where that ark is."
    },
    {
      "id": 201,
      "start": 2302.3599853515625,
      "end": 2304.480010986328,
      "text": " I can't remember the town in which it's located."
    },
    {
      "id": 202,
      "start": 2304.480010986328,
      "end": 2305.6399841308594,
      "text": " You come over the crest of the hill"
    },
    {
      "id": 203,
      "start": 2305.6399841308594,
      "end": 2308.1600036621094,
      "text": " and man, you just see this ark."
    },
    {
      "id": 204,
      "start": 2308.1600036621094,
      "end": 2309.6799926757812,
      "text": " It's humongous."
    },
    {
      "id": 205,
      "start": 2310.6799926757812,
      "end": 2312.4400024414062,
      "text": " Ken Ham answers in Genesis,"
    },
    {
      "id": 206,
      "start": 2312.4400024414062,
      "end": 2314.7999877929688,
      "text": " they wanted to build that model"
    },
    {
      "id": 207,
      "start": 2314.7999877929688,
      "end": 2317.4400024414062,
      "text": " and they did to scale based upon the cubits"
    },
    {
      "id": 208,
      "start": 2317.4400024414062,
      "end": 2319.5599975585938,
      "text": " and all the lengths that are mentioned"
    },
    {
      "id": 209,
      "start": 2319.5599975585938,
      "end": 2321.0,
      "text": " there in the Genesis record."
    },
    {
      "id": 210,
      "start": 2321.0,
      "end": 2322.760009765625,
      "text": " And I mean, it's amazing."
    },
    {
      "id": 211,
      "start": 2322.760009765625,
      "end": 2326.4000244140625,
      "text": " You go in that thing and you realize how small you are"
    },
    {
      "id": 212,
      "start": 2326.4000244140625,
      "end": 2327.760009765625,
      "text": " and how large this thing is"
    },
    {
      "id": 213,
      "start": 2327.760009765625,
      "end": 2330.760009765625,
      "text": " and the detail, the amount of time"
    },
    {
      "id": 214,
      "start": 2330.760009765625,
      "end": 2333.4400024414062,
      "text": " that it would have taken he and his family."
    },
    {
      "id": 215,
      "start": 2333.4400024414062,
      "end": 2337.0,
      "text": " And we find that he was preparing this ark."
    },
    {
      "id": 216,
      "start": 2337.0,
      "end": 2338.2799682617188,
      "text": " He was obedient to the work."
    },
    {
      "id": 217,
      "start": 2338.2799682617188,
      "end": 2340.8800048828125,
      "text": " Listen, no one ever said that working for God"
    },
    {
      "id": 218,
      "start": 2340.8800048828125,
      "end": 2342.1199951171875,
      "text": " was going to be easy."
    },
    {
      "id": 219,
      "start": 2343.239990234375,
      "end": 2346.47998046875,
      "text": " But the amazing thing is that God sustains us"
    },
    {
      "id": 220,
      "start": 2346.47998046875,
      "end": 2347.4400024414062,
      "text": " in the work."
    },
    {
      "id": 221,
      "start": 2347.4400024414062,
      "end": 2351.4000244140625,
      "text": " He gives us the strength when we have no strength."
    },
    {
      "id": 222,
      "start": 2351.4000244140625,
      "end": 2352.8400268554688,
      "text": " I think about the Apostle Paul"
    },
    {
      "id": 223,
      "start": 2352.8400268554688,
      "end": 2355.52001953125,
      "text": " and I think about his testimony as he's serving God"
    },
    {
      "id": 224,
      "start": 2355.52001953125,
      "end": 2357.2799682617188,
      "text": " as he's going on those missionary journeys"
    },
    {
      "id": 225,
      "start": 2357.2799682617188,
      "end": 2359.0399780273438,
      "text": " and all of the things that he endures"
    },
    {
      "id": 226,
      "start": 2359.0399780273438,
      "end": 2361.4000244140625,
      "text": " and all of the difficulties that he faces."
    },
    {
      "id": 227,
      "start": 2361.4000244140625,
      "end": 2364.1199951171875,
      "text": " And yet he says that the Lord delivered him"
    },
    {
      "id": 228,
      "start": 2364.1199951171875,
      "end": 2365.6799926757812,
      "text": " and the Lord sustained him."
    },
    {
      "id": 229,
      "start": 2368.3200073242188,
      "end": 2371.52001953125,
      "text": " We find this morning that Noah,"
    },
    {
      "id": 230,
      "start": 2371.52001953125,
      "end": 2374.1599731445312,
      "text": " he was working for the Lord."
    },
    {
      "id": 231,
      "start": 2374.1599731445312,
      "end": 2378.0399780273438,
      "text": " It's interesting as we would consider our work for God."
    },
    {
      "id": 232,
      "start": 2378.0399780273438,
      "end": 2380.0800170898438,
      "text": " I want you to look at a few verses of Scripture."
    },
    {
      "id": 233,
      "start": 2380.0800170898438,
      "end": 2381.2799682617188,
      "text": " I've referenced earlier,"
    },
    {
      "id": 234,
      "start": 2381.2799682617188,
      "end": 2383.3599853515625,
      "text": " turn to the book of Ephesians, if you will."
    },
    {
      "id": 235,
      "start": 2383.3599853515625,
      "end": 2385.3599853515625,
      "text": " And I referenced, I quoted for you earlier,"
    },
    {
      "id": 236,
      "start": 2385.3599853515625,
      "end": 2387.6400146484375,
      "text": " Ephesians 2, verses 8 and 9,"
    },
    {
      "id": 237,
      "start": 2387.6400146484375,
      "end": 2389.8400268554688,
      "text": " with regard to the subject matter of worship"
    },
    {
      "id": 238,
      "start": 2389.8400268554688,
      "end": 2392.8400268554688,
      "text": " and how that we're saved by grace through faith,"
    },
    {
      "id": 239,
      "start": 2392.8400268554688,
      "end": 2394.5599975585938,
      "text": " that it's nothing that we can do."
    },
    {
      "id": 240,
      "start": 2394.5599975585938,
      "end": 2396.239990234375,
      "text": " It's of no works that you could do."
    },
    {
      "id": 241,
      "start": 2396.239990234375,
      "end": 2399.5599975585938,
      "text": " It's of no works that I could do to earn my salvation."
    },
    {
      "id": 242,
      "start": 2399.5599975585938,
      "end": 2402.0,
      "text": " The Bible says that the gift of God..."
    },
    {
      "id": 0,
      "start": 2402.0,
      "end": 2405.2799999713898,
      "text": " God is eternal life through Jesus Christ, my Lord."
    },
    {
      "id": 1,
      "start": 2405.2799999713898,
      "end": 2408.3200001716614,
      "text": " Can I tell you this morning that if you work for it,"
    },
    {
      "id": 2,
      "start": 2408.3200001716614,
      "end": 2410.800000190735,
      "text": " it ceases to be a gift."
    },
    {
      "id": 3,
      "start": 2410.800000190735,
      "end": 2411.960000038147,
      "text": " Amen?"
    },
    {
      "id": 4,
      "start": 2411.960000038147,
      "end": 2415.159999847412,
      "text": " I go and I work for something"
    },
    {
      "id": 5,
      "start": 2415.159999847412,
      "end": 2416.720000267029,
      "text": " and somebody gives me something"
    },
    {
      "id": 6,
      "start": 2416.720000267029,
      "end": 2417.960000038147,
      "text": " and says, here's a gift for you."
    },
    {
      "id": 7,
      "start": 2417.960000038147,
      "end": 2419.680000305176,
      "text": " No, no, that's a wage, amen?"
    },
    {
      "id": 8,
      "start": 2419.680000305176,
      "end": 2422.0599994659424,
      "text": " I worked for that, I earned that, right?"
    },
    {
      "id": 9,
      "start": 2422.0599994659424,
      "end": 2423.840000152588,
      "text": " We understand that."
    },
    {
      "id": 10,
      "start": 2423.840000152588,
      "end": 2425.7199993133545,
      "text": " At the end of the week when you get your paycheck,"
    },
    {
      "id": 11,
      "start": 2425.7199993133545,
      "end": 2426.840000152588,
      "text": " your boss doesn't come to you and say,"
    },
    {
      "id": 12,
      "start": 2426.840000152588,
      "end": 2428.3600006103516,
      "text": " here's a gift for you."
    },
    {
      "id": 13,
      "start": 2428.3600006103516,
      "end": 2430.5400009155273,
      "text": " He's like, man, I work like a dog all week."
    },
    {
      "id": 14,
      "start": 2430.5400009155273,
      "end": 2432.7000007629395,
      "text": " What do you mean a gift for me, right?"
    },
    {
      "id": 15,
      "start": 2432.7000007629395,
      "end": 2434.0,
      "text": " It's a wage."
    },
    {
      "id": 16,
      "start": 2434.0,
      "end": 2435.2999992370605,
      "text": " You know what the Bible says about our sin?"
    },
    {
      "id": 17,
      "start": 2435.2999992370605,
      "end": 2438.5400009155273,
      "text": " The wages of sin is death."
    },
    {
      "id": 18,
      "start": 2438.5400009155273,
      "end": 2439.819999694824,
      "text": " The gift of God is eternal life"
    },
    {
      "id": 19,
      "start": 2439.819999694824,
      "end": 2441.2999992370605,
      "text": " through Jesus Christ, our Lord."
    },
    {
      "id": 20,
      "start": 2441.2999992370605,
      "end": 2443.4599990844727,
      "text": " And we find that that gift is based upon"
    },
    {
      "id": 21,
      "start": 2443.4599990844727,
      "end": 2445.220001220703,
      "text": " the grace and mercy of God"
    },
    {
      "id": 22,
      "start": 2445.220001220703,
      "end": 2447.659999847412,
      "text": " and the work that he did at the cross of Calvary."
    },
    {
      "id": 23,
      "start": 2447.659999847412,
      "end": 2450.5800018310547,
      "text": " However, we understand as the scriptures"
    },
    {
      "id": 24,
      "start": 2450.5800018310547,
      "end": 2453.659999847412,
      "text": " would unfold for us and tell us in verse number 10,"
    },
    {
      "id": 25,
      "start": 2453.659999847412,
      "end": 2457.7999992370605,
      "text": " that as we are saved, we become his workmen."
    },
    {
      "id": 26,
      "start": 2457.7999992370605,
      "end": 2459.740001678467,
      "text": " We become his servants."
    },
    {
      "id": 27,
      "start": 2459.740001678467,
      "end": 2461.7000007629395,
      "text": " And I love the way in which the writers"
    },
    {
      "id": 28,
      "start": 2461.7000007629395,
      "end": 2462.819999694824,
      "text": " of the New Testament,"
    },
    {
      "id": 29,
      "start": 2462.819999694824,
      "end": 2464.5400009155273,
      "text": " under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 30,
      "start": 2464.5400009155273,
      "end": 2466.699996948242,
      "text": " many of them, they'll begin the letters"
    },
    {
      "id": 31,
      "start": 2466.699996948242,
      "end": 2468.220001220703,
      "text": " in which they write by saying,"
    },
    {
      "id": 32,
      "start": 2468.220001220703,
      "end": 2469.6600036621094,
      "text": " Paul, a servant."
    },
    {
      "id": 33,
      "start": 2469.6600036621094,
      "end": 2470.9400024414062,
      "text": " Peter, a servant."
    },
    {
      "id": 34,
      "start": 2470.9400024414062,
      "end": 2472.779998779297,
      "text": " James, a servant."
    },
    {
      "id": 35,
      "start": 2472.779998779297,
      "end": 2476.319999694824,
      "text": " What a joy to be the servant of the Lord."
    },
    {
      "id": 36,
      "start": 2476.319999694824,
      "end": 2478.0599975585938,
      "text": " We find here in Ephesians 2,"
    },
    {
      "id": 37,
      "start": 2478.0599975585938,
      "end": 2479.5400009155273,
      "text": " in verse number 10, the Bible says,"
    },
    {
      "id": 38,
      "start": 2479.5400009155273,
      "end": 2482.180000305176,
      "text": " for we are his workmanship,"
    },
    {
      "id": 39,
      "start": 2482.180000305176,
      "end": 2485.4199981689453,
      "text": " created in Christ Jesus unto good works,"
    },
    {
      "id": 40,
      "start": 2485.4199981689453,
      "end": 2487.5800018310547,
      "text": " which God hath before ordained"
    },
    {
      "id": 41,
      "start": 2487.5800018310547,
      "end": 2490.5800018310547,
      "text": " that we should walk in them."
    },
    {
      "id": 42,
      "start": 2490.5800018310547,
      "end": 2494.5,
      "text": " Now let me help you understand something very important."
    },
    {
      "id": 43,
      "start": 2494.5,
      "end": 2498.0199966430664,
      "text": " We do not work to earn our salvation,"
    },
    {
      "id": 44,
      "start": 2498.0199966430664,
      "end": 2501.9800033569336,
      "text": " and we do not work to keep our salvation."
    },
    {
      "id": 45,
      "start": 2501.9800033569336,
      "end": 2504.4800033569336,
      "text": " We work because we're saved."
    },
    {
      "id": 46,
      "start": 2505.9800033569336,
      "end": 2509.0199966430664,
      "text": " That's our response to what God has done for us"
    },
    {
      "id": 47,
      "start": 2509.0199966430664,
      "end": 2510.620002746582,
      "text": " and how he's blessed us."
    },
    {
      "id": 48,
      "start": 2510.620002746582,
      "end": 2511.8600006103516,
      "text": " And what a joy, listen,"
    },
    {
      "id": 49,
      "start": 2511.8600006103516,
      "end": 2516.0199966430664,
      "text": " the reality today is that if God had deemed it to be so,"
    },
    {
      "id": 50,
      "start": 2516.0199966430664,
      "end": 2518.5,
      "text": " that at the moment that you trust at Christ your Savior,"
    },
    {
      "id": 51,
      "start": 2518.5,
      "end": 2520.9800033569336,
      "text": " we could have immediately gone to heaven."
    },
    {
      "id": 52,
      "start": 2520.9800033569336,
      "end": 2524.220001220703,
      "text": " And some say, man, that would have been wonderful."
    },
    {
      "id": 53,
      "start": 2524.220001220703,
      "end": 2525.0599975585938,
      "text": " But he's left us here,"
    },
    {
      "id": 54,
      "start": 2525.0599975585938,
      "end": 2527.099998474121,
      "text": " and he's left us here for a purpose."
    },
    {
      "id": 55,
      "start": 2527.099998474121,
      "end": 2531.0599975585938,
      "text": " He's left us here to be his representatives,"
    },
    {
      "id": 56,
      "start": 2531.0599975585938,
      "end": 2532.3999938964844,
      "text": " his ambassadors."
    },
    {
      "id": 57,
      "start": 2534.4199981689453,
      "end": 2537.300003051758,
      "text": " Remember, as we had that message on Sunday evening"
    },
    {
      "id": 58,
      "start": 2537.300003051758,
      "end": 2538.4199981689453,
      "text": " from Brother Hauser,"
    },
    {
      "id": 59,
      "start": 2538.4199981689453,
      "end": 2539.699996948242,
      "text": " that you're the salt of the earth,"
    },
    {
      "id": 60,
      "start": 2539.699996948242,
      "end": 2542.3399963378906,
      "text": " that you're the light of the world."
    },
    {
      "id": 61,
      "start": 2542.3399963378906,
      "end": 2544.3399963378906,
      "text": " And as we understand here this morning,"
    },
    {
      "id": 62,
      "start": 2544.3800048828125,
      "end": 2546.5,
      "text": " as we begin to look at what's going on"
    },
    {
      "id": 63,
      "start": 2546.5,
      "end": 2550.259994506836,
      "text": " and we see this truth that we are his workmanship"
    },
    {
      "id": 64,
      "start": 2550.259994506836,
      "end": 2553.5,
      "text": " created in Christ Jesus unto good works,"
    },
    {
      "id": 65,
      "start": 2554.5800018310547,
      "end": 2555.779998779297,
      "text": " in the book of Philippians,"
    },
    {
      "id": 66,
      "start": 2555.779998779297,
      "end": 2558.539993286133,
      "text": " Paul says this to the church in Philippi,"
    },
    {
      "id": 67,
      "start": 2558.539993286133,
      "end": 2561.1799926757812,
      "text": " just a few pages over in your Bible,"
    },
    {
      "id": 68,
      "start": 2561.1799926757812,
      "end": 2563.5800018310547,
      "text": " in Philippians 1 and verse number six,"
    },
    {
      "id": 69,
      "start": 2563.5800018310547,
      "end": 2566.300003051758,
      "text": " being confident of this very thing,"
    },
    {
      "id": 70,
      "start": 2566.300003051758,
      "end": 2568.979995727539,
      "text": " that he which hath begun a good work in you"
    },
    {
      "id": 71,
      "start": 2568.979995727539,
      "end": 2572.699996948242,
      "text": " will perform it until the day of Jesus Christ."
    },
    {
      "id": 72,
      "start": 2574.6199951171875,
      "end": 2577.460006713867,
      "text": " We're familiar with the truth that Peter gives"
    },
    {
      "id": 73,
      "start": 2577.460006713867,
      "end": 2580.0599975585938,
      "text": " in 1 Peter chapter number four"
    },
    {
      "id": 74,
      "start": 2580.0599975585938,
      "end": 2583.979995727539,
      "text": " with regard to the gift that we've been given."
    },
    {
      "id": 75,
      "start": 2583.979995727539,
      "end": 2586.3399963378906,
      "text": " I speak of this gift that he's mentioning"
    },
    {
      "id": 76,
      "start": 2586.3399963378906,
      "end": 2587.979995727539,
      "text": " in 1 Peter chapter number four."
    },
    {
      "id": 77,
      "start": 2587.979995727539,
      "end": 2589.6199951171875,
      "text": " It is the gift of serving,"
    },
    {
      "id": 78,
      "start": 2589.6199951171875,
      "end": 2592.3399963378906,
      "text": " the gifts of the Holy Spirit of God."
    },
    {
      "id": 79,
      "start": 2592.3399963378906,
      "end": 2595.259994506836,
      "text": " And here we find that he says in verse number 10"
    },
    {
      "id": 80,
      "start": 2595.259994506836,
      "end": 2596.4199981689453,
      "text": " of 1 Peter chapter number four,"
    },
    {
      "id": 81,
      "start": 2596.4199981689453,
      "end": 2599.3399963378906,
      "text": " as every man hath received the gift,"
    },
    {
      "id": 82,
      "start": 2599.3399963378906,
      "end": 2601.300003051758,
      "text": " even so minister the same one to another"
    },
    {
      "id": 83,
      "start": 2601.300003051758,
      "end": 2604.5,
      "text": " as good stewards of the manifold grace of God."
    },
    {
      "id": 84,
      "start": 2604.5,
      "end": 2606.979995727539,
      "text": " If any man speak, let him speak as the oracles of God."
    },
    {
      "id": 85,
      "start": 2606.979995727539,
      "end": 2609.1000061035156,
      "text": " If any man minister, let him do it as of the ability"
    },
    {
      "id": 86,
      "start": 2609.1000061035156,
      "end": 2610.6600036621094,
      "text": " which God giveth."
    },
    {
      "id": 87,
      "start": 2610.6600036621094,
      "end": 2611.5,
      "text": " Why?"
    },
    {
      "id": 88,
      "start": 2611.5,
      "end": 2614.5,
      "text": " That God in all things may be glorified through Jesus Christ"
    },
    {
      "id": 89,
      "start": 2614.5,
      "end": 2618.1799926757812,
      "text": " to whom be praise and dominion forever and ever, amen."
    },
    {
      "id": 90,
      "start": 2618.1799926757812,
      "end": 2621.779998779297,
      "text": " You see how it goes back to our first point of worship."
    },
    {
      "id": 91,
      "start": 2621.779998779297,
      "end": 2623.740005493164,
      "text": " He's glorified, he's exalted,"
    },
    {
      "id": 92,
      "start": 2623.740005493164,
      "end": 2627.1000061035156,
      "text": " he is receiving the glory that's due unto his name."
    },
    {
      "id": 93,
      "start": 2627.1000061035156,
      "end": 2628.8600006103516,
      "text": " And we find here that as we look"
    },
    {
      "id": 94,
      "start": 2628.979995727539,
      "end": 2632.460006713867,
      "text": " at these three individuals that are mentioned"
    },
    {
      "id": 95,
      "start": 2632.460006713867,
      "end": 2634.8999938964844,
      "text": " in Hebrews 11 verses four through seven,"
    },
    {
      "id": 96,
      "start": 2634.8999938964844,
      "end": 2638.1000061035156,
      "text": " we find that we notice that the worship of Abel,"
    },
    {
      "id": 97,
      "start": 2638.1000061035156,
      "end": 2640.1799926757812,
      "text": " we notice the walk of Enoch,"
    },
    {
      "id": 98,
      "start": 2640.1799926757812,
      "end": 2642.6600036621094,
      "text": " and we notice the work of Noah."
    },
    {
      "id": 99,
      "start": 2642.6600036621094,
      "end": 2644.259994506836,
      "text": " As we think about the work of Noah,"
    },
    {
      "id": 100,
      "start": 2644.259994506836,
      "end": 2646.0599975585938,
      "text": " we see that he prepared this ark."
    },
    {
      "id": 101,
      "start": 2646.0599975585938,
      "end": 2647.9400024414062,
      "text": " Notice what the result is."
    },
    {
      "id": 102,
      "start": 2647.9400024414062,
      "end": 2649.460006713867,
      "text": " Really, there's a twofold result"
    },
    {
      "id": 103,
      "start": 2649.460006713867,
      "end": 2652.9400024414062,
      "text": " that is given to us in verse number seven of Hebrews 11."
    },
    {
      "id": 104,
      "start": 2652.9400024414062,
      "end": 2654.4199981689453,
      "text": " The Bible says this,"
    },
    {
      "id": 105,
      "start": 2654.4199981689453,
      "end": 2659.4200134277344,
      "text": " that he prepared an ark, notice, to the saving of his house,"
    },
    {
      "id": 106,
      "start": 2659.459991455078,
      "end": 2661.1000061035156,
      "text": " to the saving of his house."
    },
    {
      "id": 107,
      "start": 2662.1000061035156,
      "end": 2665.5799865722656,
      "text": " We understand this morning that Noah and Mrs. Noah"
    },
    {
      "id": 108,
      "start": 2665.5799865722656,
      "end": 2669.9400024414062,
      "text": " and his three sons and their wives all got onto that ark."
    },
    {
      "id": 109,
      "start": 2669.9400024414062,
      "end": 2674.459991455078,
      "text": " And the only place of safety, of refuge was in the ark."
    },
    {
      "id": 110,
      "start": 2674.459991455078,
      "end": 2675.9400024414062,
      "text": " You had to be in the ark."
    },
    {
      "id": 111,
      "start": 2676.8599853515625,
      "end": 2678.8599853515625,
      "text": " I think about the fact that the Bible tells us"
    },
    {
      "id": 112,
      "start": 2678.8599853515625,
      "end": 2681.9400024414062,
      "text": " that Noah was a preacher of righteousness."
    },
    {
      "id": 113,
      "start": 2681.9400024414062,
      "end": 2684.260009765625,
      "text": " And I think about the way in which Noah preached"
    },
    {
      "id": 114,
      "start": 2684.260009765625,
      "end": 2687.980010986328,
      "text": " for all those years as he was preparing the ark."
    },
    {
      "id": 115,
      "start": 2687.980010986328,
      "end": 2689.220001220703,
      "text": " As we think about his preaching"
    },
    {
      "id": 116,
      "start": 2689.220001220703,
      "end": 2691.260009765625,
      "text": " and the way in which no doubt he was mocked"
    },
    {
      "id": 117,
      "start": 2691.260009765625,
      "end": 2693.3800048828125,
      "text": " and ridiculed and made fun of,"
    },
    {
      "id": 118,
      "start": 2693.3800048828125,
      "end": 2696.7000122070312,
      "text": " and we find that as that door was shut"
    },
    {
      "id": 119,
      "start": 2696.7000122070312,
      "end": 2700.5799865722656,
      "text": " and God shut that door in there in the ark,"
    },
    {
      "id": 120,
      "start": 2700.5799865722656,
      "end": 2702.5799865722656,
      "text": " that when that flood began,"
    },
    {
      "id": 121,
      "start": 2702.5799865722656,
      "end": 2704.459991455078,
      "text": " when those rains started to descend"
    },
    {
      "id": 122,
      "start": 2704.459991455078,
      "end": 2707.779998779297,
      "text": " and the depths of the earth opened up,"
    },
    {
      "id": 123,
      "start": 2707.779998779297,
      "end": 2712.779998779297,
      "text": " I believe that those individuals that had not listened,"
    },
    {
      "id": 124,
      "start": 2713.019989013672,
      "end": 2717.1000061035156,
      "text": " man, they were seeking some kind of refuge."
    },
    {
      "id": 125,
      "start": 2717.1000061035156,
      "end": 2721.220001220703,
      "text": " But there was no refuge because you had to be in the ark."
    },
    {
      "id": 126,
      "start": 2721.220001220703,
      "end": 2724.540008544922,
      "text": " As New Testament believers, we have to be in Christ."
    },
    {
      "id": 127,
      "start": 2724.540008544922,
      "end": 2726.6600036621094,
      "text": " If any man be in Christ, he is a new creature."
    },
    {
      "id": 128,
      "start": 2726.6600036621094,
      "end": 2727.540008544922,
      "text": " Old things are passed away."
    },
    {
      "id": 129,
      "start": 2727.540008544922,
      "end": 2730.8599853515625,
      "text": " Behold, all things are become new."
    },
    {
      "id": 130,
      "start": 2730.8599853515625,
      "end": 2733.459991455078,
      "text": " And so we find, as we look at the twofold result"
    },
    {
      "id": 131,
      "start": 2733.459991455078,
      "end": 2735.1799926757812,
      "text": " of the work of Noah, that number one,"
    },
    {
      "id": 132,
      "start": 2735.1799926757812,
      "end": 2737.220001220703,
      "text": " he and his family were spared"
    },
    {
      "id": 133,
      "start": 2737.220001220703,
      "end": 2739.5799865722656,
      "text": " to the saving of his house, the Bible says."
    },
    {
      "id": 134,
      "start": 2739.5799865722656,
      "end": 2743.0599975585938,
      "text": " And then notice this, by the witch, he condemned the world."
    },
    {
      "id": 135,
      "start": 2743.0599975585938,
      "end": 2744.8599853515625,
      "text": " We find that the world was condemned."
    },
    {
      "id": 136,
      "start": 2744.8599853515625,
      "end": 2746.779998779297,
      "text": " In 2 Peter 2, in verse number five,"
    },
    {
      "id": 137,
      "start": 2746.779998779297,
      "end": 2749.540008544922,
      "text": " a thought that I just referenced a moment ago,"
    },
    {
      "id": 138,
      "start": 2749.540008544922,
      "end": 2750.540008544922,
      "text": " but the Bible says this,"
    },
    {
      "id": 139,
      "start": 2750.540008544922,
      "end": 2752.220001220703,
      "text": " and spared not the old world,"
    },
    {
      "id": 140,
      "start": 2752.220001220703,
      "end": 2753.7000122070312,
      "text": " but saved Noah, the eighth person,"
    },
    {
      "id": 141,
      "start": 2753.7000122070312,
      "end": 2755.220001220703,
      "text": " a preacher of righteousness,"
    },
    {
      "id": 142,
      "start": 2755.220001220703,
      "end": 2759.220001220703,
      "text": " bringing in the flood upon the world of the ungodly."
    },
    {
      "id": 143,
      "start": 2761.779998779297,
      "end": 2764.220001220703,
      "text": " And it says that he became heir of the righteousness,"
    },
    {
      "id": 144,
      "start": 2764.220001220703,
      "end": 2766.1799926757812,
      "text": " which is by faith."
    },
    {
      "id": 145,
      "start": 2766.1799926757812,
      "end": 2767.6199951171875,
      "text": " Isn't that a great statement?"
    },
    {
      "id": 146,
      "start": 2768.6199951171875,
      "end": 2773.019989013672,
      "text": " We find this morning that righteousness is by faith."
    },
    {
      "id": 147,
      "start": 2773.019989013672,
      "end": 2774.739990234375,
      "text": " It's not by works."
    },
    {
      "id": 148,
      "start": 2774.739990234375,
      "end": 2777.5,
      "text": " And even as we look at the work of Noah here"
    },
    {
      "id": 149,
      "start": 2777.5,
      "end": 2778.8200073242188,
      "text": " in verse number seven,"
    },
    {
      "id": 150,
      "start": 2778.8200073242188,
      "end": 2781.6199951171875,
      "text": " we understand that it was not his work"
    },
    {
      "id": 151,
      "start": 2781.6199951171875,
      "end": 2783.8200073242188,
      "text": " that caused him to have this righteousness,"
    },
    {
      "id": 152,
      "start": 2783.8200073242188,
      "end": 2787.3800048828125,
      "text": " but it was his faith and obedience to God."
    },
    {
      "id": 153,
      "start": 2787.3800048828125,
      "end": 2790.0599975585938,
      "text": " And we find that as Noah would get off the ark,"
    },
    {
      "id": 154,
      "start": 2790.0599975585938,
      "end": 2792.7000122070312,
      "text": " that the first thing he does is he worships the Lord."
    },
    {
      "id": 155,
      "start": 2792.7000122070312,
      "end": 2793.8200073242188,
      "text": " He builds those altars,"
    },
    {
      "id": 156,
      "start": 2793.8200073242188,
      "end": 2795.6199951171875,
      "text": " and he provides an offering unto the Lord."
    },
    {
      "id": 157,
      "start": 2795.8999938964844,
      "end": 2798.459991455078,
      "text": " The first matter of business was worship"
    },
    {
      "id": 158,
      "start": 2798.459991455078,
      "end": 2800.1799926757812,
      "text": " after they got off of that ark."
    },
    {
      "id": 159,
      "start": 2801.1799926757812,
      "end": 2804.9400024414062,
      "text": " As we look at the truth of this first message"
    },
    {
      "id": 160,
      "start": 2804.9400024414062,
      "end": 2805.8999938964844,
      "text": " in Hebrews 11,"
    },
    {
      "id": 161,
      "start": 2805.8999938964844,
      "end": 2807.6600036621094,
      "text": " as we begin to deal with the individuals"
    },
    {
      "id": 162,
      "start": 2807.6600036621094,
      "end": 2809.8200073242188,
      "text": " that are referenced by name,"
    },
    {
      "id": 163,
      "start": 2809.8200073242188,
      "end": 2811.779998779297,
      "text": " we see the worship."
    },
    {
      "id": 164,
      "start": 2811.779998779297,
      "end": 2814.5799865722656,
      "text": " I hope this morning that we're worshiping God properly."
    },
    {
      "id": 165,
      "start": 2817.1000061035156,
      "end": 2818.3800048828125,
      "text": " That we understand this morning"
    },
    {
      "id": 166,
      "start": 2818.3800048828125,
      "end": 2820.4200134277344,
      "text": " that He is worthy of our worship."
    },
    {
      "id": 167,
      "start": 2821.5,
      "end": 2824.8999938964844,
      "text": " I hope this morning that we are walking with God."
    },
    {
      "id": 168,
      "start": 2826.6199951171875,
      "end": 2830.3399963378906,
      "text": " That we would have the testimony of Enoch,"
    },
    {
      "id": 169,
      "start": 2830.3399963378906,
      "end": 2831.7000122070312,
      "text": " that he walked with God,"
    },
    {
      "id": 170,
      "start": 2831.7000122070312,
      "end": 2834.0599975585938,
      "text": " and he was not, for God took him."
    },
    {
      "id": 171,
      "start": 2834.0599975585938,
      "end": 2835.260009765625,
      "text": " That we'd walk with him."
    },
    {
      "id": 172,
      "start": 2836.260009765625,
      "end": 2838.739990234375,
      "text": " That we'd enjoy that sweet communion and fellowship"
    },
    {
      "id": 173,
      "start": 2838.739990234375,
      "end": 2840.9400024414062,
      "text": " that is able to be enjoyed"
    },
    {
      "id": 174,
      "start": 2840.9400024414062,
      "end": 2843.3800048828125,
      "text": " because of what the Lord Jesus Christ did for us"
    },
    {
      "id": 175,
      "start": 2843.3800048828125,
      "end": 2844.6199951171875,
      "text": " on the cross of Calvary."
    },
    {
      "id": 176,
      "start": 2845.7000122070312,
      "end": 2848.3800048828125,
      "text": " And I hope this morning that we're working for the Lord."
    },
    {
      "id": 177,
      "start": 2848.3800048828125,
      "end": 2849.220001220703,
      "text": " The songwriter said,"
    },
    {
      "id": 178,
      "start": 2849.220001220703,
      "end": 2853.980010986328,
      "text": " work for the night is coming when man's work works no more."
    },
    {
      "id": 179,
      "start": 2854.1400146484375,
      "end": 2855.3399963378906,
      "text": " And this morning,"
    },
    {
      "id": 180,
      "start": 2855.3399963378906,
      "end": 2857.5,
      "text": " we have an opportunity to work for the Lord."
    },
    {
      "id": 181,
      "start": 2857.5,
      "end": 2858.3399963378906,
      "text": " By the way,"
    },
    {
      "id": 182,
      "start": 2858.3399963378906,
      "end": 2860.4200134277344,
      "text": " it's a great thing to be able to work for the Lord,"
    },
    {
      "id": 183,
      "start": 2860.4200134277344,
      "end": 2862.5,
      "text": " to be His servant."
    },
    {
      "id": 184,
      "start": 2862.5,
      "end": 2863.3399963378906,
      "text": " And again,"
    },
    {
      "id": 185,
      "start": 2863.3399963378906,
      "end": 2866.2999877929688,
      "text": " we do not confuse the teaching of the Word of God."
    },
    {
      "id": 186,
      "start": 2866.2999877929688,
      "end": 2867.6600036621094,
      "text": " We do not say that you work"
    },
    {
      "id": 187,
      "start": 2867.6600036621094,
      "end": 2870.779998779297,
      "text": " so that you can earn or keep your salvation."
    },
    {
      "id": 188,
      "start": 2870.779998779297,
      "end": 2872.6600036621094,
      "text": " It simply is out of a response"
    },
    {
      "id": 189,
      "start": 2872.6600036621094,
      "end": 2875.7000122070312,
      "text": " to all that God has done for us."
    },
    {
      "id": 190,
      "start": 2875.7000122070312,
      "end": 2877.019989013672,
      "text": " I desire to work for Him."
    },
    {
      "id": 191,
      "start": 2877.019989013672,
      "end": 2878.4200134277344,
      "text": " I desire to live for Him."
    },
    {
      "id": 192,
      "start": 2878.4200134277344,
      "end": 2880.540008544922,
      "text": " I desire to walk with Him"
    },
    {
      "id": 193,
      "start": 2880.540008544922,
      "end": 2882.0599975585938,
      "text": " because I understand what He's given me here"
    },
    {
      "id": 194,
      "start": 2882.0599975585938,
      "end": 2884.2999877929688,
      "text": " in this book and His Word."
    },
    {
      "id": 195,
      "start": 2884.2999877929688,
      "end": 2885.1400146484375,
      "text": " And this morning,"
    },
    {
      "id": 196,
      "start": 2885.1400146484375,
      "end": 2887.1400146484375,
      "text": " we see these three characters,"
    },
    {
      "id": 197,
      "start": 2887.1400146484375,
      "end": 2890.1799926757812,
      "text": " Abel, Enoch and Noah."
    },
    {
      "id": 198,
      "start": 2890.1799926757812,
      "end": 2891.019989013672,
      "text": " Next week,"
    },
    {
      "id": 199,
      "start": 2891.019989013672,
      "end": 2892.8999938964844,
      "text": " we'll continue looking at Abraham."
    },
    {
      "id": 200,
      "start": 2892.8999938964844,
      "end": 2896.220001220703,
      "text": " Begin to see how these individuals lived by faith,"
    },
    {
      "id": 201,
      "start": 2896.220001220703,
      "end": 2898.019989013672,
      "text": " living by faith."
    },
    {
      "id": 202,
      "start": 2898.019989013672,
      "end": 2899.1799926757812,
      "text": " But this morning,"
    },
    {
      "id": 203,
      "start": 2899.1799926757812,
      "end": 2901.5799865722656,
      "text": " how are we living by faith?"
    },
    {
      "id": 204,
      "start": 2901.5799865722656,
      "end": 2904.8999938964844,
      "text": " How is it in our lives that we are living by faith,"
    },
    {
      "id": 205,
      "start": 2904.8999938964844,
      "end": 2907.1799926757812,
      "text": " that we're taking God at His Word,"
    },
    {
      "id": 206,
      "start": 2907.1799926757812,
      "end": 2909.019989013672,
      "text": " that we're believing Him?"
    },
    {
      "id": 207,
      "start": 2909.019989013672,
      "end": 2909.8599853515625,
      "text": " See,"
    },
    {
      "id": 208,
      "start": 2909.8599853515625,
      "end": 2910.7000122070312,
      "text": " I'll tell you this morning,"
    },
    {
      "id": 209,
      "start": 2910.739990234375,
      "end": 2913.8999938964844,
      "text": " it's not easy for us to live by sight."
    },
    {
      "id": 210,
      "start": 2913.8999938964844,
      "end": 2914.8200073242188,
      "text": " It really is."
    },
    {
      "id": 211,
      "start": 2915.739990234375,
      "end": 2917.97998046875,
      "text": " I've been doing some reading here recently"
    },
    {
      "id": 212,
      "start": 2917.97998046875,
      "end": 2922.97998046875,
      "text": " of some believers that have gone on before us"
    },
    {
      "id": 213,
      "start": 2926.4000244140625,
      "end": 2927.8599853515625,
      "text": " over the centuries."
    },
    {
      "id": 214,
      "start": 2927.8599853515625,
      "end": 2930.1199951171875,
      "text": " Those that have served God faithfully."
    },
    {
      "id": 215,
      "start": 2931.260009765625,
      "end": 2932.9400024414062,
      "text": " And some of that which they endured"
    },
    {
      "id": 216,
      "start": 2932.9400024414062,
      "end": 2935.2999877929688,
      "text": " and how they lived by faith."
    },
    {
      "id": 217,
      "start": 2935.2999877929688,
      "end": 2939.0599975585938,
      "text": " They begin to think about our environment,"
    },
    {
      "id": 218,
      "start": 2939.0599975585938,
      "end": 2941.5399780273438,
      "text": " what we have in 2020."
    },
    {
      "id": 219,
      "start": 2941.5399780273438,
      "end": 2943.780029296875,
      "text": " It's easy for us to live by sight."
    },
    {
      "id": 220,
      "start": 2944.97998046875,
      "end": 2946.6799926757812,
      "text": " But without faith,"
    },
    {
      "id": 221,
      "start": 2946.6799926757812,
      "end": 2949.0999755859375,
      "text": " it is impossible to please Him."
    },
    {
      "id": 222,
      "start": 2949.0999755859375,
      "end": 2950.5399780273438,
      "text": " And so this morning,"
    },
    {
      "id": 223,
      "start": 2950.5399780273438,
      "end": 2955.3400268554688,
      "text": " we come to Him by faith with regard to salvation."
    },
    {
      "id": 224,
      "start": 2955.3400268554688,
      "end": 2958.0599975585938,
      "text": " But we must understand that we must live by faith"
    },
    {
      "id": 225,
      "start": 2958.0599975585938,
      "end": 2960.47998046875,
      "text": " all the days of our lives."
    },
    {
      "id": 226,
      "start": 2960.47998046875,
      "end": 2961.3200073242188,
      "text": " These men,"
    },
    {
      "id": 227,
      "start": 2961.3200073242188,
      "end": 2962.1400146484375,
      "text": " they lived by faith"
    },
    {
      "id": 228,
      "start": 2962.1400146484375,
      "end": 2964.739990234375,
      "text": " and the Bible tells us what they did by faith."
    },
    {
      "id": 229,
      "start": 2964.739990234375,
      "end": 2967.0599975585938,
      "text": " And we'll continue to see testimonies"
    },
    {
      "id": 230,
      "start": 2967.0599975585938,
      "end": 2969.1799926757812,
      "text": " of those that have gone before us."
    },
    {
      "id": 231,
      "start": 2969.1799926757812,
      "end": 2971.0,
      "text": " And know that we would have a testimony"
    },
    {
      "id": 232,
      "start": 2971.0,
      "end": 2972.7000122070312,
      "text": " of living by faith."
    },
    {
      "id": 233,
      "start": 2972.7000122070312,
      "end": 2973.9000244140625,
      "text": " Father, we love You this morning."
    },
    {
      "id": 234,
      "start": 2973.9000244140625,
      "end": 2975.5999755859375,
      "text": " We thank You for loving us."
    },
    {
      "id": 235,
      "start": 2977.0800170898438,
      "end": 2979.3400268554688,
      "text": " We thank You for the testimonies of these"
    },
    {
      "id": 236,
      "start": 2980.4199829101562,
      "end": 2981.739990234375,
      "text": " that have gone before us."
    },
    {
      "id": 237,
      "start": 2981.739990234375,
      "end": 2984.5399780273438,
      "text": " All the way back to the book of Genesis."
    },
    {
      "id": 238,
      "start": 2984.5399780273438,
      "end": 2989.260009765625,
      "text": " In reading in Genesis chapters four through eight"
    },
    {
      "id": 239,
      "start": 2989.260009765625,
      "end": 2992.5,
      "text": " of Abel and Enoch and Noah,"
    },
    {
      "id": 240,
      "start": 2992.5,
      "end": 2995.3400268554688,
      "text": " seeing their worship and their walk and their work."
    },
    {
      "id": 241,
      "start": 2995.4199829101562,
      "end": 3000.4199829101562,
      "text": " And God, I pray this morning that You would encourage us."
    },
    {
      "id": 242,
      "start": 3000.8200073242188,
      "end": 3002.5800170898438,
      "text": " I pray that You would challenge us."
    },
    {
      "id": 0,
      "start": 3002.5800170898438,
      "end": 3005.7800171375275,
      "text": " or to help us to live by faith."
    },
    {
      "id": 1,
      "start": 3005.7800171375275,
      "end": 3008.620017051697,
      "text": " There's one here that's not sure of heaven."
    },
    {
      "id": 2,
      "start": 3008.620017051697,
      "end": 3010.860016822815,
      "text": " As we shared testimony this morning,"
    },
    {
      "id": 3,
      "start": 3010.860016822815,
      "end": 3013.66001701355,
      "text": " as we were singing this morning about salvation"
    },
    {
      "id": 4,
      "start": 3013.66001701355,
      "end": 3015.940016746521,
      "text": " and knowing for sure that heaven's our home,"
    },
    {
      "id": 5,
      "start": 3015.940016746521,
      "end": 3016.980016708374,
      "text": " maybe there's someone this morning"
    },
    {
      "id": 6,
      "start": 3016.980016708374,
      "end": 3020.06001663208,
      "text": " that they just simply do not have 100% assurance"
    },
    {
      "id": 7,
      "start": 3020.06001663208,
      "end": 3022.1000175476074,
      "text": " that if they were to die today that heaven's their home."
    },
    {
      "id": 8,
      "start": 3022.1000175476074,
      "end": 3023.8600177764893,
      "text": " We pray that the Holy Spirit of God"
    },
    {
      "id": 9,
      "start": 3023.8600177764893,
      "end": 3025.820016860962,
      "text": " would convict them of their sin,"
    },
    {
      "id": 10,
      "start": 3025.820016860962,
      "end": 3028.220016479492,
      "text": " of Christ's righteousness, of judgment to come."
    },
    {
      "id": 11,
      "start": 3028.220016479492,
      "end": 3030.5000171661377,
      "text": " I pray that before they leave this place,"
    },
    {
      "id": 12,
      "start": 3030.5000171661377,
      "end": 3032.66001701355,
      "text": " they would get it settled."
    },
    {
      "id": 13,
      "start": 3034.740016937256,
      "end": 3037.0200157165527,
      "text": " I pray for each child of God this morning."
    },
    {
      "id": 14,
      "start": 3037.0200157165527,
      "end": 3039.1400184631348,
      "text": " God, would you help us to live by faith?"
    },
    {
      "id": 15,
      "start": 3040.340015411377,
      "end": 3043.06001663208,
      "text": " Help us to be challenged by the testimony of these men."
    },
    {
      "id": 16,
      "start": 3044.1400184631348,
      "end": 3046.460018157959,
      "text": " I pray that you would do a work in our lives"
    },
    {
      "id": 17,
      "start": 3047.460018157959,
      "end": 3049.7000160217285,
      "text": " in these next few moments"
    },
    {
      "id": 18,
      "start": 3049.7000160217285,
      "end": 3052.9400177001953,
      "text": " that would result in you being glorified and exalted,"
    },
    {
      "id": 19,
      "start": 3053.8600158691406,
      "end": 3057.4800186157227,
      "text": " and us being made conformed to the image of your Son."
    },
    {
      "id": 20,
      "start": 3057.4800186157227,
      "end": 3058.9200172424316,
      "text": " Well, thank you for the work that you'll do,"
    },
    {
      "id": 21,
      "start": 3058.9200172424316,
      "end": 3060.1400184631348,
      "text": " for it's in Christ's name we pray."
    },
    {
      "id": 22,
      "start": 3060.780017852783,
      "end": 3063.56001663208,
      "text": " Would you stand with me, heads are bowed, eyes are closed."
    },
    {
      "id": 23,
      "start": 3063.56001663208,
      "end": 3065.2600173950195,
      "text": " Kimberly's gonna play quietly on the piano."
    },
    {
      "id": 24,
      "start": 3065.2600173950195,
      "end": 3067.02001953125,
      "text": " As she does, the altar is open."
    },
    {
      "id": 25,
      "start": 3068.3200149536133,
      "end": 3069.240020751953,
      "text": " If you're not sure of heaven,"
    },
    {
      "id": 26,
      "start": 3069.240020751953,
      "end": 3070.400016784668,
      "text": " we'd love to take a Bible and show you"
    },
    {
      "id": 27,
      "start": 3070.400016784668,
      "end": 3072.8800201416016,
      "text": " how you can know for sure that heaven's your home."
    },
    {
      "id": 28,
      "start": 3072.8800201416016,
      "end": 3074.8600158691406,
      "text": " If you're a child of God,"
    },
    {
      "id": 29,
      "start": 3074.8600158691406,
      "end": 3076.52001953125,
      "text": " maybe you just wanna come and thank God"
    },
    {
      "id": 30,
      "start": 3076.52001953125,
      "end": 3078.1600189208984,
      "text": " for the gift of salvation."
    },
    {
      "id": 31,
      "start": 3078.1600189208984,
      "end": 3081.9200134277344,
      "text": " Maybe you just wanna come and commit to live by faith."
    },
    {
      "id": 32,
      "start": 3081.9200134277344,
      "end": 3084.0400161743164,
      "text": " As Kimberly plays, the altar is open."
    }
  ],
  "processed_at": "2025-04-17T14:05:11.973608"
}