{
  "video_id": "U_xKQPutdso",
  "text": "Deuteronomy chapter number 6, we'll be back in the book, Lord willing, of Colossians next Sunday morning and finishing up the third chapter, entering into the very beginning of the fourth chapter. That'll be next Sunday morning. This morning, however, we're having a unique opportunity to have a baby dedication. In fact, we're going to have three babies that will be dedicated this morning, and that is a blessing. Blake and Vanessa will be coming and having Ethan James to be able to dedicate to the Lord, and then Michael and Elizabeth will be coming to have Alice Danielle dedicated unto the Lord, and then Alfredo and Sharon will be coming to have Artemus James dedicated unto the Lord. And so that's a blessing. Now, that's also a lot of pressure, and the reason why that's a lot of pressure is because we don't want crying babies up here in just a little while, and so my timeline is maybe a little bit restricted this morning, but we'll try to do our best and make sure we don't have crying babies. And typically, in the past, every baby dedication that we've had has just been one baby at a time, and so I've held the baby and all that sort of thing. Well, I won't be doing that with three, and that is beyond the ability of a dad, amen? And some moms might be able to figure out how to carry three, but not this dad, and I'm thankful that Juliana and Brianna were able to walk before Joseph came along, amen? But I'm thankful that these families have expressed their desire to dedicate their children to the Lord, but really, when we think about a baby dedication, it's more about their commitment to bring their children up in the nurture and admonition of the Lord. The reality is that these children really have no idea what's going on. They're not aware of all the significance of what we're dealing with this morning, and perhaps in years to come, they'll have the opportunity to see the certificate, see the Bible, look at a picture, but they themselves, of course, are not aware of the entirety of what's taking place, and so the parents, really, the charge is more to them. As we look at this passage of Scripture in Deuteronomy 6, I trust that not only would it be a charge to these families, but really a charge to each and every one of us in helping us to understand the blessedness of God's instruction to us as His people. I want to preach a message that I've simply entitled this morning, Thou Shalt Teach Thy Children. Thou shalt teach thy children. Notice in verse number one of Deuteronomy 6, the Bible says, Now these are the commandments, the statutes, and the judgments, which the Lord your God commanded to teach you, that ye might do them in the land whither ye go to possess it, that thou mightest fear the Lord thy God to keep all His statutes and His commandments, which I command thee, thou, and thy son, and thy son's son, all the days of thy life, and that thy days may be prolonged. Hear therefore, O Israel, and observe to do it. Notice this, that it may be well with thee, and that ye may increase mightily, as the Lord God of thy fathers hath promised thee, in the land that floweth with milk and honey. Hear, O Israel, the Lord our God is one Lord, and thou shalt love the Lord thy God with all thine heart, with all thy soul, and with all thy might. And these words, which I command thee this day, shall be in thine heart. And thou shalt teach them diligently unto thy children, and shalt talk of them when thou sittest in thine house, and when thou walkest by the way, and when thou liest down, and when thou risest up. And thou shalt bind them for a sign upon thine hand, and they shalt be as frontlets between thine eyes. And thou shalt write them upon the post of thy house, and on thy gates.\" If you're taking notes this morning, I want you to notice, first of all, the importance of the instruction. I believe this morning, as we begin to look at the instruction that is provided here in Deuteronomy 6, that we ought to rejoice and thank God that He has been faithful to provide us with instruction. What a blessing to know that the God of the universe, the God of heaven, saw fit to provide His people with instruction. Not only did He give it by inspiration, but we understand that He has preserved it, and we hold in our hands the perfect Word of God, and it is profitable for us. And we understand this morning that when we think about the truth that is before us of the importance of the instruction, the source of the instruction is what makes it important. Amen? And when we think about the source of this instruction, in verse number one, Moses is faithful to distribute to the people of God the Word of God, but you note that he says, now these are the commandments, the statutes, and the judgments, notice, which the Lord your God commanded to teach you. This is not Moses figuring out for himself what instruction he should give to the children of Israel as they prepare to enter into the land of promise. No, this instruction comes direct from God, the Lord your God, and the source of the instruction really determines the importance of the instruction. And I'm thankful this morning that God has given us instruction. You'll notice in verse number one that the Bible says, commandments, statutes, and judgments. Commandments are laws or precepts. Really the idea of a commandment is to give orders to provide that command that God has given us. Statutes, really we could look at statutes as being, no doubt, a commandment. Not all commandments would be statutes, but statutes could fall into the category of being commandments. But really it's dealing with the requirement of a prescribed task, and I believe it this way that it gives us further detail as to how to carry out the command that has been given. And we find that even if you were to look at the Ten Commandments, that they're provided to us in very short form in Exodus, chapter number 20, in the first instance. But then you find that the law, as the statutes are provided, really it's opening up and providing further instruction as to how to carry out the particular commandment. And so we see that he says commandments, statutes, and then we notice the word judgments. And really this is carrying it with it, the idea of a procedure or litigation. Perhaps we would look at it as being a verdict, the execution of judgment, what happens when these commands that God gives, what happens when these commands are broken. And we find that God provides all of that detail. In the law, we find that the children of Israel had the understanding that here's a command, here are statutes that provide further explanation of this command, how to carry it out in your everyday life, and then if that is broken, here is the judgment, here's what the penalty is for breaking that particular command. And we find that God has contained that within the Word of God, within the law for the children of Israel. I find that as we look at the truth of the Old Testament and look at the law and we continue to think about us as New Testament believers, that God has clearly communicated to us through the law being our schoolmaster, as Paul would indicate in the book of Galatians, that we are all guilty. And the wages of sin is death, and that's what the Bible tells us in Romans chapter number 6. And so we find that everything is summed up. Remember, James says if you offend in one, you're guilty of all with regard to the law. So the judgment as New Testament believers understanding that the penalty, the wages of sin, is death. I'm so thankful, even as Jared sang this morning, that the Lord Jesus Christ suffered and bled and died on the cross of Calvary to pay the penalty that needed to be paid for mankind to be redeemed, amen? And what a blessing as we think about that borrowed tomb that was left empty, amen? He rose from the dead, conquering sin, death, and the grave, and what a blessing that is. And notice as we think about the importance of the instruction, he says this in verse number 3. Hear, therefore, O Israel, and observe to do it, notice, that it may be well with thee. I believe this morning that as we look at the instruction, we ought to rejoice and understand the importance of the instruction. However, I believe this morning that we can acknowledge with our minds that instruction has been given. We can even go to the point of acknowledging the importance of the instruction, and yet at times, we can set it aside, right? We know the instruction's been given. It's been provided. God has been faithful. We understand that it's from God, so it's important, but at times, we can set it aside. So we see the importance of instruction. I want you to notice number 2, and really the lengthy part of the message this morning, the implementation of instruction. I believe this morning that instruction is given to be obeyed. Amen? When someone provides you with instruction, they are providing you with instruction with details that if followed, when obeyed, the task can be fulfilled or satisfied. Oftentimes, we buy products that may have those little words, some assembly required, and every time you see those words, you hope that they included the directions, the instructions for assembling that piece of furniture or whatever it might be, and then you're able to follow those instructions. And as you follow those instructions, you get to the end, and you find that you have a product that looks like, in theory, what the picture was on the box, and you follow those instructions. So instructions are given to be obeyed. In fact, in verse number one, notice that he says, now these are the commandments, the statutes, and the judgments which the Lord your God commanded to teach you. Notice this phrase, that ye might do them. Do them in the land whither you go to possess it. Later on in the sixth chapter here of this particular book, we find that in verse number 24, he concludes with saying this, and the Lord commanded us to do all these statutes to fear the Lord our God. Notice this phrase, for our good always, that he might preserve us alive as it is at this day. And it shall be our righteousness if we deserve to do all these commandments before the Lord our God as he hath commanded us. And I'm thankful that God has given it to us for our benefit, and that helps us to understand the importance of implementing the instruction that has been given. I believe that first we must acknowledge this morning the necessity to implement the instruction in our own lives, in our own lives. You know, it's really a difficulty when you try to instruct someone to do something that you're not actively doing. We're speaking about living life and following the instruction, and you begin to try to communicate to someone, whether it's a child or otherwise, you begin to instruct them on how they should behave or what they should do, but you yourself are not implementing that same body of instruction, that same body of truth in your own life, the effectiveness of your instruction can fail miserably. And so we must acknowledge that in these first six verses of Deuteronomy 6, that really the necessity, the responsibility to implement the instruction is first in the lives of these that Moses is directly speaking to, of course, that God is giving this instruction to. We note the instruction, it says, to teach you, in verse number one, that ye might do them in the land whither you go to possess it, that thou mightest fear the Lord thy God. Notice it talks about the perpetuity in verse number two, but if you continue in verse number three, it says, hear therefore O Israel, and observe to do it, that it may be well with thee, and that ye may increase mightily. Look at verse number five, and thou shalt love the Lord thy God with all thine heart, with all thy soul, and with all thy might, and these words which I command thee this day shall be in thine heart. The necessity of first implementing God's Word in our own lives. Those that teach the Word of God ought to be doers of the Word of God. We find that, as James would say this in the book of James, that we are to be doers of the Word, not hearers only. I'm mindful of how the book of Acts begins as, what a great book, providing us with the history of the early church, but it begins by telling us this of the Lord Jesus Christ, the former treaties have I made, O Theophilus, of all that Jesus began both to do and teach. We find that Paul would later say to the believers in Philippi, when he's instructing them and as he's giving them that final bit of instruction in Philippians chapter number four, he says those things which he have both learned and received and heard, and then he says this, and seen in me do, and the God of peace shall be with you. So we find the necessity of implementing this truth, this instruction in our own lives, how important it is that when our lives are observed that people see that our walk matches our talk. I read a sign not long ago, everyone seems like in the last 18 months that they've gotten serious about washing their hands. I've washed my hands all the time, amen? And man, I always am washing my hands, but I was in a particular facility and I saw a sign and it said this, wash your hands like your mom's watching. And I thought, well that's kind of interesting. And you know, the reality is that we're to live our lives understanding that people are watching us. Not only does God see everything and we're to live a life that's holy and pleasing to our Savior, but we understand this morning that there are people watching us. There are little eyes that are observing us and how vital it is that we would take the truth of God's Word. By the way, this isn't just for parents. You say, man, I don't have any children, I can go to sleep on this message. No, no, my children are already raised, I can go to sleep on this message. No, no, this truth is to be implemented in our lives as individuals and then we see the application of teaching our children, for those that have children that are still in that circumstance of being able to train them and teach them. But how vital it is that we live this book, that we are people of the book. Notice as we think about the implementation of the instruction that we finally get to verse number seven where the Bible says this, and thou, so they've received the instruction, they understand the importance of the instruction, they understand and are implementing it in their own lives, and thou shalt teach them diligently unto thy children. I like that he uses the word diligently unto thy children. In fact, as we look at the remainder of verse number seven and even in verses eight and nine, you'll see the significance of what it means to do something diligently, and you'll see the the explanation that is provided in giving further detail to what it means to teach it diligently unto thy children. No doubt God could have ended verse number seven with a period at the end of thy children and just left us with the instruction that were to teach diligently these commandments, statutes, and judgments to our children, but yet he graciously provides us with what it looks like, practically speaking, to teach diligently these commandments, statutes, and judgments to our children. Notice there really are six references that are given in verses seven, eight, and nine with regard to what it looks like to to teach diligently. In verse number seven it says this, \"...and shalt talk of them,\" talk of what? Talk of the commandments, the statutes, and the judgments. This that has been provided, the instruction, \"...thou shalt talk of them, number one, when thou sittest in thine house.\" No doubt as we think about this in the home and the significance in the home and the importance of teaching the Word of God in the home, perhaps in view here when it speaks about when thou sittest in thine house, the idea of perhaps mealtime, having that opportunity during mealtime to teach diligently, to seize that opportunity, to teach the commandments, the statutes, and the judgments. There was a time in American history, and perhaps that time has has not been so much the case in recent years, where families had dinner together. They all just kind of got around the table and had a meal together, and it seems like the busyness of schedules and all that takes place in our society today, that Johnny has practice here and Susie has practice over here, and they got this thing and that thing, and sometimes that mealtime, that family gathering time, is a missing element in our homes today. But what a blessed opportunity to teach the commandments, the statutes, and the judgments, the instruction that God has provided. Notice he continues in verse number 7, he says, and shalt talk of them, not only when thou sittest in thine house, but number two, when thou walkest by the way. I think of this as really being the daily life, the routine, and the things that we must take and take care of and minister to. I think about perhaps travel time when thou walkest, and of course we know the mode of transportation would be that thou walkest by the way. Many of these folks, of course, as you would begin to think about their time as they would enter into the land that God had promised them, that this instruction is being provided for them, many would have fields that they would have to care for. Many would have livestock that they would have to tend to. And when thou walkest, not only do you take the opportunity as a father, perhaps, to take your sons and to teach them how to take care of the livestock and how to tend to all that the family has to take care of, but at the same time you're teaching them the commandments, the statutes, and the judgments when thou walkest in the way. And we think about the importance of this truth of just really, as we summarize, as we'll get to the end here, it's really this truth of diligently seizing those opportunities and teaching the Word of God. Notice he continues and says, not only when thou sittest in thine house and when thou walkest by the way, number three, when thou liest down, when thou liest down. Bedtime. And you think about the importance of having the time of devotion. Perhaps there are some, as families, that would have family devotion in the morning. For us, for all of the years of family devotions, we do our family devotions in the evening. And the reason we do family devotions in the evening is because we all have different schedules in the morning, and therefore we have family devotions in the evening. and we have that opportunity prior to bedtime that we're going to take some time and discuss the truth of God's Word and pray together as a family when thou liest down. Of course, we find the last part of verse number seven, it says, and when thou risest up. Now you think about this, not only the morning time that's given to us at the end of verse number seven, but when you really think about the entirety of verse number seven, when thou sittest in thine house, when thou walkest by the way, when thou liest down, and when thou risest up. You know what he's saying? All the time. Thou shalt teach them, what's them? The commandments, the statutes, and the judgments. Thou shalt teach them diligently unto thy children. How do we teach them diligently? We're engaged in it all the time. We're seizing opportunities that present themselves to us as we would teach them the truth of God's Word, providing them understanding that the instruction that God has provided us with, that we in like manner want to provide that instruction to them, understanding that this is the Word of God. He continues in verse number eight, and he tells us this, and thou shalt bind them for a sign upon thine hand, and they shall be as frontlets between thine eyes. I think that it's very similar to what we see here in verse number six, where the Bible says, in these words which I command thee this day, notice what it says, shall be in thine heart. Do you remember what the psalmist said in Psalm 119? He answers the question that is asked in verse number 11, wherewithal shall a young man cleanse his way? We find that he says, by taking heed thereto according to thy word, thy word have I hid in mine heart that I might not sin against thee. And we find that really, when we think about the impact of verse six and verse number eight, and the implementation of the instruction that's provided, is that it would be in our hearts. In other words, that it would be continually before us. The Jewish custom or practice would be this thing of phylacteries that you read about even during the time of the Lord Jesus Christ, where they would literally wear scripture on them. On their person, on their robes, on their garments, they would literally wear scripture. And oftentimes when you read about the interactions that the Lord Jesus Christ would have with some of those individuals that he interacted with during his earthly ministry, and he would say something about what this means, really he's pointing to them wearing scripture, and they don't even know what it means. It's not just an outward action that we're taking, it's not just some type of religious roe activity. No, that we've taken this instruction, we've understood that it's the source, it's God's instruction, we've understood the importance, the significance of the instruction, and we say we want this to be in our heart, we want it to be continually before us. We've sought to diligently teach it when thou sittest, when thou walkest, when thou liest, when thou risest. I mean, all of the time we're seeking to give and to implement the instruction that has been provided. We see in verse number nine that he says, and thou shalt write them upon the post of thy house and on thy gates. You think about this truth in verse number nine of really, again, this visible reminder, the idea of it being on our walls. And many, I know, have had scripture posted in their homes, on their walls, and it's that reminder. And you think about the significance and the impact of being able to go through a home and go through your home and your children, hearing you give them the instruction, but then visibly seeing the reminder as perhaps they would walk through the home, as they would leave the house, and they would see visibly the scripture that's posted upon the walls. It's so important because it's God's instruction. And we think about the implementation of the instruction, and we think about the responsibility that is given, what great responsibility. I mean, really, when we consider the mandate, the instruction that has been given here, we understand even, as I said on Wednesday evening, that God has commissioned, God has given the responsibility of teaching children to their parents. There is no other individual, there is no other organization that has been given the responsibility of teaching our children. By the way, that's not popular in our society today. There are some that are in government positions, some that are running for office, that do not believe that you as a parent have any say over what your children are taught. But God, in His Word, says, thou shalt teach them diligently unto thy children. Children are an heritage of the Lord. Amen? God has blessed and given the fruit of the womb as His reward, and we find that as He's given children, He's given responsibility. And that responsibility is ours. By the way, I believe this morning with all of my heart that we're gonna give an account for how we teach our children, for how we raise our children, for how we instruct them. Now, you can't force your kids to do anything. When they're real little, you can force them to do some things, but there comes a time when you can't force your children to do something. Amen? Some of you that have older kids, can you help me out? You can't force your kids to do anything anymore, right? Blake, your parents are sitting there, but man, it ain't gonna happen like it did when you were two, right? And the reality is that there comes a time where they have their own responsibility and accountability, and they're going to answer for their decisions, but we as parents, we have a great responsibility. And God's not gonna let us off the hook by simply saying, well, we left that for fill-in-the-blank, whoever that for is. No, no, God said, I gave you the responsibility. And in giving you the responsibility, you're accountable for that. Now, we may choose to have a variety of methodologies for how our children would be educated, but we must understand that we play a vital role in that education process. And you understand this morning that even as I started that message or that series on Wednesday evening, and I'll be sending out an email tomorrow, I hope that you'd be, if you're not here on Wednesday night, and I wish you would be, that you would at least tune in on Wednesday night, so starting a series on the danger of deception. I believe that we are living in an age of deception. And here's the reality, I said it on Wednesday night, the thing that infuriates me about that truth is that they're starting with the kids this age. And they're indoctrinating them. And then they want to attack you for trying to teach them this book and say, you're just indoctrinating your kids, so it's better to let you indoctrinate my kids? Oh, we're living in an age of deception. And how important it is that we understand this morning that the implementation of the instruction that God has given us, first in our lives, but then as we would then take and actively teach our children. Diligently teach our children. I want you to notice with me the, number three, if you're taking notes, the impact of this instruction. What's the impact? Well, notice in verse number two, he says this, that thou mightest fear the Lord thy God. By the way, it's a good thing to fear God. Our God is a consuming fire. Amen? It is a fearful thing to fall into the hands of an angry God. He is the judge of the universe. And I'm so thankful that he's given us instruction. And yes, that we have a godly fear and a godly reverence of who our God is. And as we take the instruction that he's given to us and we implement it in our lives, we don't have to fear the judgment of God. Isn't that a blessing? You know, how many times you see people that are driving down the highway and they see a Virginia State police officer, they see a county police officer, and all of a sudden, man, they're hitting their brakes and they're changing all of their behavior. Why? Because they're fearful of what the consequences are going to be of their disobedience to the law. But if you're not disobeying the law and you're driving, you don't have to hit your brakes when you're driving down the highway. You just keep on going. By the way, I've heard from some that are in that profession that when you hit your brakes and change your behavior, it makes you look more guilty. And that is the case, is it not? Because you're trying to hide something. But I don't have to fear when I've taken the truth that God has given, the instruction, and I've sought to diligently implement it in my own life and diligently instruct those that God has given to me to instruct. And I see the impact, not only will it be a fear, but it says this, to keep all his statutes and his commandments, notice this, which I command thee, thou and thy son and thy son's son. The impact is generational. It's a generational impact. And by the way, it's supposed to be that way. You notice at the end of verse number six, it says this, all the days of thy life. There never comes a time where you say, I've arrived and I don't have to worry about implementing these things anymore. No, no. Every day of our lives until we take that final breath here and we enter into the presence of our Savior, we must implement the truth that is given. And then it says this, and that thy days may... prolonged. Again, verse number three, I mentioned it earlier. Here, therefore, O Israel, and observe to do it that it may be well with thee, what we read in verse number 24, for our good always. Listen, the impact of this instruction, it's positive for us, it is beneficial for us. As Peter says, ye do well that ye take heed thereunto. It is in your best interest and in my best interest to obey the instruction that has been provided. The impact is given here, it's generational, as we see in verse number two, it's beneficial as it will be well with us. And I want you to think about the generational aspect of this particular instruction. Turn over to the book of Psalms, if you will, and then we'll close with a New Testament truth as well. But look at Psalm 78, if you will, and I want you to notice the first several verses of this great chapter. You know, the Bible has been given to us, and we can see not only through Bible history the failure of God's people to implement truth and to instruct a future generation, but we can see that even in contemporary history. We can find that as we have failed as the people of God to do what God has instructed us to do, that the consequences are grave. Do you remember that in the book of Joshua, we see the the great account of God's blessing and the entrance into the conquering of, the division of, and the inhabiting of the land, and what great truth is given to us in the book of Joshua? And then you open up into the book of Judges and you find that there's another generation that rose up that knew not the Lord. Wow. What sad commentary that is in the book of Judges, that there would be a generation that would rise up that did not know the Lord. They failed to give and to obey the instruction that is provided here in Deuteronomy 6 and Psalm 78. Notice what the Bible says, give ear, O my people, to my law. Incline your ears to the words of my mouth. I will open my mouth in a parable. I will utter dark sayings of old, which we have heard and known and our fathers have told us. Notice in verse number four, we will not hide them from their children, showing to the generation to come the praises of the Lord and his strength and his wonderful works that he hath done. Who's gonna teach our children how great God is? We better know how great God is and we better get busy teaching our children how great our God is. Amen? How do we discover the greatness of God? Through his word. He's revealed to us so many of his mighty acts and what a blessing to think about the the might and power and greatness of our God, but then we must declare his greatness. You understand that the schoolhouse and the White House and the Congress and Hollywood, they're not going to teach our children how great God is. No, on the contrary, they're going to attack the person of Jesus Christ. So we see that it says in verse number five, for he established a testimony in Jacob and appointed a law in Israel which he commanded our fathers that they should make them known to their children. Why? What's the what's the impact? Remember it's generational. That the generation to come in verse number six might know them, even the children which should be born who should arise and declare them to their children, that they might set their hope in God and not forget the works of God, but keep his commandments. Wow. God's given us the instruction. He's provided us with a pattern of how we're supposed to behave and how we're supposed to operate and how we're supposed to to give this truth to a future generation and how when we follow the instruction that God has given, we implement in our lives, we take heed to the truth of how we would further propagate these instructions, these commandments and statutes and judgments, that we find that the impact will be that this generation would set their hope in God. By the way, don't you want a generation to believe God? To have faith that God is able to set their hope in God? We find that it says this, and not forget the works of God, but keep his commandments. What a blessing it is when you see the generational impact that this instruction can have upon generations to come where they're still doing and still following and still obeying and still heeding to the instruction of God's Word. What a blessing. Look at 2nd Timothy chapter number three in closing this morning and 2nd Timothy chapter number three, I want you to notice that Paul is speaking here of course to Timothy, his son in the faith, and he begins really by providing us with an interesting piece of historical data in the first chapter of 2nd Timothy when he tells us this in verse number five, when I call to remembrance the unfeigned faith that is in thee, so in Timothy, which dwelt first in thy grandmother Lois and thy mother Eunice, and I am persuaded that in thee also. Do you see the generational impact there? He says, listen, Paul says, I'm thankful when I call to remembrance your unfeigned faith. He says, but understand, I recognize that it dwelt first in thy grandmother Lois and then in your mother Eunice and now in thee also. The passage that I had you turn to in chapter number three and beginning in verse number 14, Paul says this, but continue thou in the things which thou hast learned and has been assured of, knowing of whom thou hast learned them, and notice in verse number 15, and that from a child thou hast known the Holy Scriptures. From a child. Well, the impact that we read of in chapter number one of his mother and grandmother instructing him in the Holy Scriptures. We mentioned about the importance of the instruction, that we recognize that it was from God, the source determines the importance, and in Deuteronomy 6, Moses said, which the Lord your God commanded to teach you. Here we find that it says that from a child thou hast known the Holy Scriptures. What makes them holy? They're gods. God breathed inspiration. You see in the next verse, all Scripture is given by inspiration of God. The source is God. The understanding is that they're holy scriptures. Why? Because they come from a holy God. Amen? I'm thankful that our God is holy. In fact, we're instructed in the book of Psalms that we're to give thanks, the remembrance of his holiness. Our God is not becoming holy, he is holy. We read it in the book of Leviticus, we read in the book of 1st Peter when he says, I am holy, therefore you're to be holy. Be you holy as I am holy. We read that instruction. So we find that he says that from a child thou hast known the Holy Scriptures, and then notice this, which are able to make thee wise unto salvation through faith which is in Christ Jesus. Wow. We think about the impact of the the Word of God. These scriptures are holy scriptures, they're from God, and you've known them, Timothy, from the time that you were a child because of your mother and your grandmother and their faith, and they have diligently taught you the truth of the Word of God. And he says this, he says that these scriptures, these holy scriptures, are able to make thee wise unto salvation through faith which is in Christ Jesus. Aren't you thankful that the Word of God teaches us how to be saved? Where would we be without the instruction in the Word of God with regard to salvation? I am so thankful. I quote it in the beginning of the message, for the wages of sin is death in Romans 6 and verse 23, but the gift of God is eternal life through Jesus Christ our Lord. You read the fifth chapter of the book of Romans and you'll find the impact of that disobedience of Adam upon all men, but then you read about the obedience of the Lord Jesus Christ and the impact upon all that would trust him as Savior. And what a wonderful truth and blessing that is. We continue and see that he says in verse 16, all scripture is given by inspiration of God. It is profitable for doctrine, for reproof, for correction, for instruction in righteousness, that the man of God may be perfect, throughly furnished unto all good works. I am thankful that God has given us instruction, that God has given us commandments and statutes and judgments, that he has been faithful to provide us with the truth that we hold in our hands today. And as we understand the importance of this truth and the fact that the source causes it to be important, that it's from God, it's God's Word. And when I understand the importance of it and I find that I must implement it in my own life, that I need to be a doer of the Word and not a hearer only, that I need to dig into this book and find out what is it that God has for me. What are some commandments and some statutes and some judgments? What are some things that God has given me? As I look into the truth of God's Word and I allow the Word of God to examine me and to show me in my life things that I need to stop doing. doing and things that I need to start doing, and I seek to be obedient to His Word first in my life. Then as parents, I think about this child dedication today, this baby dedication, as parents we have that great responsibility of teaching them the commandment, statutes, and judgments, teaching them diligently unto our children. Listen, parenting is no easy job. Amen? Those of you that have children, parenting is not an easy job. Consistency is so vital. There are times, however, when we can be battle-weary, as Brother Wagar mentioned in the ministry, but sometimes as parents we can become battle-weary. We got all kinds of things going on, life has been thrown at us, it's been a tough week, it's been all sorts of, and we just, and I just don't, I just don't have the energy for this, but we understand the importance and we pray and we ask God to give us the energy and the strength, the determination to teach diligently the Word of God to our children. Why? Because we understand the impact of the instruction. We understand this morning that as we would teach the Word of God, that we would take and give to a future generation, that they will set their hope in God. It's our responsibility, and we must grab hold of and take seriously the responsibility that is before us, and what a great truth that God has given us in His Word. Thou shalt teach thy children. Let's pray. Father, we love you, we thank you for loving us, we thank you for the opportunity that you've given us to gather together this morning, we thank you for the truth of thy Word, and we thank you that you have been faithful to provide us with instruction, and what a what a wonderful blessing it is to have the Word of God, and that we can open the Scriptures and we can understand what you've commanded us, that we can prove what is acceptable unto the Lord, that as we find that truth in the book of Ephesians, and we understand the importance of proving what is acceptable, that we can allow your Word to be the guide and the lamp that you've designed it to be. I pray that a future generation would set their hope in God, not forget the works of God, keep His commandments. We thank you for these three families that have expressed their desire this morning to dedicate their children to thee, Lord, and I thank you for their desire to do that, but Lord, we understand in a greater sense the commitment that they're making to bring up their children in the nurture and admonition of the Lord. I pray for every family that's here, for every individual that's present this morning, God would you help us to be doers of the Word and not hearers only. We need a return to your Word, we need to understand the importance of allowing this book, the truth contained therein, to influence our behavior, to guide our steps, no longer being influenced by society and by culture, not allowing them to determine right and wrong, but we'd look to your Word and determine with clarity what thus saith the Lord, and then follow you. I pray that you'd move and work as only you can, for it's in Christ's name we pray, amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.800000190734863,
      "text": " Deuteronomy chapter number 6, we'll be back in the book, Lord willing, of Colossians next"
    },
    {
      "id": 1,
      "start": 4.800000190734863,
      "end": 8.800000190734863,
      "text": " Sunday morning and finishing up the third chapter, entering into the very beginning"
    },
    {
      "id": 2,
      "start": 8.800000190734863,
      "end": 9.800000190734863,
      "text": " of the fourth chapter."
    },
    {
      "id": 3,
      "start": 9.800000190734863,
      "end": 11.399999618530273,
      "text": " That'll be next Sunday morning."
    },
    {
      "id": 4,
      "start": 11.399999618530273,
      "end": 16.959999084472656,
      "text": " This morning, however, we're having a unique opportunity to have a baby dedication."
    },
    {
      "id": 5,
      "start": 16.959999084472656,
      "end": 21.200000762939453,
      "text": " In fact, we're going to have three babies that will be dedicated this morning, and that"
    },
    {
      "id": 6,
      "start": 21.200000762939453,
      "end": 22.360000610351562,
      "text": " is a blessing."
    },
    {
      "id": 7,
      "start": 22.360000610351562,
      "end": 28.8799991607666,
      "text": " Blake and Vanessa will be coming and having Ethan James to be able to dedicate to the"
    },
    {
      "id": 8,
      "start": 29.440000534057617,
      "end": 34.439998626708984,
      "text": " Lord, and then Michael and Elizabeth will be coming to have Alice Danielle dedicated"
    },
    {
      "id": 9,
      "start": 34.439998626708984,
      "end": 39.7599983215332,
      "text": " unto the Lord, and then Alfredo and Sharon will be coming to have Artemus James dedicated"
    },
    {
      "id": 10,
      "start": 39.7599983215332,
      "end": 40.7599983215332,
      "text": " unto the Lord."
    },
    {
      "id": 11,
      "start": 40.7599983215332,
      "end": 41.7599983215332,
      "text": " And so that's a blessing."
    },
    {
      "id": 12,
      "start": 41.7599983215332,
      "end": 46.279998779296875,
      "text": " Now, that's also a lot of pressure, and the reason why that's a lot of pressure is because"
    },
    {
      "id": 13,
      "start": 46.279998779296875,
      "end": 50.779998779296875,
      "text": " we don't want crying babies up here in just a little while, and so my timeline is maybe"
    },
    {
      "id": 14,
      "start": 50.779998779296875,
      "end": 55.08000183105469,
      "text": " a little bit restricted this morning, but we'll try to do our best and make sure we"
    },
    {
      "id": 15,
      "start": 55.08000183105469,
      "end": 56.84000015258789,
      "text": " don't have crying babies."
    },
    {
      "id": 16,
      "start": 56.84000015258789,
      "end": 61.439998626708984,
      "text": " And typically, in the past, every baby dedication that we've had has just been one baby at a"
    },
    {
      "id": 17,
      "start": 61.439998626708984,
      "end": 64.55999755859375,
      "text": " time, and so I've held the baby and all that sort of thing."
    },
    {
      "id": 18,
      "start": 64.55999755859375,
      "end": 71.0,
      "text": " Well, I won't be doing that with three, and that is beyond the ability of a dad, amen?"
    },
    {
      "id": 19,
      "start": 71.0,
      "end": 75.55999755859375,
      "text": " And some moms might be able to figure out how to carry three, but not this dad, and"
    },
    {
      "id": 20,
      "start": 75.55999755859375,
      "end": 80.72000122070312,
      "text": " I'm thankful that Juliana and Brianna were able to walk before Joseph came along, amen?"
    },
    {
      "id": 21,
      "start": 80.72000122070312,
      "end": 85.91999816894531,
      "text": " But I'm thankful that these families have expressed their desire to dedicate their children"
    },
    {
      "id": 22,
      "start": 86.0,
      "end": 91.31999969482422,
      "text": " to the Lord, but really, when we think about a baby dedication, it's more about their commitment"
    },
    {
      "id": 23,
      "start": 91.31999969482422,
      "end": 95.76000213623047,
      "text": " to bring their children up in the nurture and admonition of the Lord."
    },
    {
      "id": 24,
      "start": 95.76000213623047,
      "end": 99.63999938964844,
      "text": " The reality is that these children really have no idea what's going on."
    },
    {
      "id": 25,
      "start": 99.63999938964844,
      "end": 104.23999786376953,
      "text": " They're not aware of all the significance of what we're dealing with this morning, and"
    },
    {
      "id": 26,
      "start": 104.23999786376953,
      "end": 109.08000183105469,
      "text": " perhaps in years to come, they'll have the opportunity to see the certificate, see the"
    },
    {
      "id": 27,
      "start": 109.08000183105469,
      "end": 116.44000244140625,
      "text": " Bible, look at a picture, but they themselves, of course, are not aware of the entirety of"
    },
    {
      "id": 28,
      "start": 116.44000244140625,
      "end": 121.23999786376953,
      "text": " what's taking place, and so the parents, really, the charge is more to them."
    },
    {
      "id": 29,
      "start": 121.23999786376953,
      "end": 125.31999969482422,
      "text": " As we look at this passage of Scripture in Deuteronomy 6, I trust that not only would"
    },
    {
      "id": 30,
      "start": 125.31999969482422,
      "end": 130.0,
      "text": " it be a charge to these families, but really a charge to each and every one of us in helping"
    },
    {
      "id": 31,
      "start": 130.0,
      "end": 135.39999389648438,
      "text": " us to understand the blessedness of God's instruction to us as His people."
    },
    {
      "id": 32,
      "start": 135.9600067138672,
      "end": 139.32000732421875,
      "text": " I want to preach a message that I've simply entitled this morning,"
    },
    {
      "id": 33,
      "start": 139.32000732421875,
      "end": 142.83999633789062,
      "text": " Thou Shalt Teach Thy Children."
    },
    {
      "id": 34,
      "start": 142.83999633789062,
      "end": 146.24000549316406,
      "text": " Thou shalt teach thy children."
    },
    {
      "id": 35,
      "start": 146.24000549316406,
      "end": 148.52000427246094,
      "text": " Notice in verse number one of Deuteronomy 6, the Bible says,"
    },
    {
      "id": 36,
      "start": 148.52000427246094,
      "end": 153.44000244140625,
      "text": " Now these are the commandments, the statutes, and the judgments, which the Lord your God"
    },
    {
      "id": 37,
      "start": 153.44000244140625,
      "end": 159.24000549316406,
      "text": " commanded to teach you, that ye might do them in the land whither ye go to possess it, that"
    },
    {
      "id": 38,
      "start": 159.24000549316406,
      "end": 163.9199981689453,
      "text": " thou mightest fear the Lord thy God to keep all His statutes and His commandments, which"
    },
    {
      "id": 39,
      "start": 163.9199981689453,
      "end": 171.0399932861328,
      "text": " I command thee, thou, and thy son, and thy son's son, all the days of thy life, and"
    },
    {
      "id": 40,
      "start": 171.0399932861328,
      "end": 173.8000030517578,
      "text": " that thy days may be prolonged."
    },
    {
      "id": 41,
      "start": 173.8000030517578,
      "end": 177.72000122070312,
      "text": " Hear therefore, O Israel, and observe to do it."
    },
    {
      "id": 42,
      "start": 177.72000122070312,
      "end": 183.1999969482422,
      "text": " Notice this, that it may be well with thee, and that ye may increase mightily, as the"
    },
    {
      "id": 43,
      "start": 183.1999969482422,
      "end": 188.75999450683594,
      "text": " Lord God of thy fathers hath promised thee, in the land that floweth with milk and honey."
    },
    {
      "id": 44,
      "start": 188.75999450683594,
      "end": 195.0800018310547,
      "text": " Hear, O Israel, the Lord our God is one Lord, and thou shalt love the Lord thy God with"
    },
    {
      "id": 45,
      "start": 195.0800018310547,
      "end": 198.63999938964844,
      "text": " all thine heart, with all thy soul, and with all thy might."
    },
    {
      "id": 46,
      "start": 198.63999938964844,
      "end": 203.8800048828125,
      "text": " And these words, which I command thee this day, shall be in thine heart."
    },
    {
      "id": 47,
      "start": 203.8800048828125,
      "end": 209.75999450683594,
      "text": " And thou shalt teach them diligently unto thy children, and shalt talk of them when"
    },
    {
      "id": 48,
      "start": 209.75999450683594,
      "end": 214.9199981689453,
      "text": " thou sittest in thine house, and when thou walkest by the way, and when thou liest down,"
    },
    {
      "id": 49,
      "start": 214.9199981689453,
      "end": 217.0800018310547,
      "text": " and when thou risest up."
    },
    {
      "id": 50,
      "start": 217.0800018310547,
      "end": 221.55999755859375,
      "text": " And thou shalt bind them for a sign upon thine hand, and they shalt be as frontlets"
    },
    {
      "id": 51,
      "start": 221.55999755859375,
      "end": 223.3800048828125,
      "text": " between thine eyes."
    },
    {
      "id": 52,
      "start": 223.3800048828125,
      "end": 229.24000549316406,
      "text": " And thou shalt write them upon the post of thy house, and on thy gates.\""
    },
    {
      "id": 53,
      "start": 229.24000549316406,
      "end": 232.5,
      "text": " If you're taking notes this morning, I want you to notice, first of all, the importance"
    },
    {
      "id": 54,
      "start": 232.5,
      "end": 233.9199981689453,
      "text": " of the instruction."
    },
    {
      "id": 55,
      "start": 233.9199981689453,
      "end": 238.0,
      "text": " I believe this morning, as we begin to look at the instruction that is provided here in"
    },
    {
      "id": 56,
      "start": 238.0,
      "end": 242.8800048828125,
      "text": " Deuteronomy 6, that we ought to rejoice and thank God that He has been faithful to provide"
    },
    {
      "id": 57,
      "start": 242.8800048828125,
      "end": 245.02000427246094,
      "text": " us with instruction."
    },
    {
      "id": 58,
      "start": 245.02000427246094,
      "end": 251.17999267578125,
      "text": " What a blessing to know that the God of the universe, the God of heaven, saw fit to provide"
    },
    {
      "id": 59,
      "start": 251.17999267578125,
      "end": 253.74000549316406,
      "text": " His people with instruction."
    },
    {
      "id": 60,
      "start": 253.74000549316406,
      "end": 258.4599914550781,
      "text": " Not only did He give it by inspiration, but we understand that He has preserved it, and"
    },
    {
      "id": 61,
      "start": 258.4599914550781,
      "end": 263.5,
      "text": " we hold in our hands the perfect Word of God, and it is profitable for us."
    },
    {
      "id": 62,
      "start": 263.5,
      "end": 268.6199951171875,
      "text": " And we understand this morning that when we think about the truth that is before us of"
    },
    {
      "id": 63,
      "start": 268.6199951171875,
      "end": 273.82000732421875,
      "text": " the importance of the instruction, the source of the instruction is what makes it important."
    },
    {
      "id": 64,
      "start": 273.82000732421875,
      "end": 274.82000732421875,
      "text": " Amen?"
    },
    {
      "id": 65,
      "start": 274.82000732421875,
      "end": 278.5,
      "text": " And when we think about the source of this instruction, in verse number one, Moses is"
    },
    {
      "id": 66,
      "start": 278.5,
      "end": 283.94000244140625,
      "text": " faithful to distribute to the people of God the Word of God, but you note that he says,"
    },
    {
      "id": 67,
      "start": 283.94000244140625,
      "end": 288.94000244140625,
      "text": " now these are the commandments, the statutes, and the judgments, notice, which the Lord"
    },
    {
      "id": 68,
      "start": 288.94000244140625,
      "end": 292.8800048828125,
      "text": " your God commanded to teach you."
    },
    {
      "id": 69,
      "start": 292.8800048828125,
      "end": 297.3800048828125,
      "text": " This is not Moses figuring out for himself what instruction he should give to the children"
    },
    {
      "id": 70,
      "start": 297.3800048828125,
      "end": 300.5,
      "text": " of Israel as they prepare to enter into the land of promise."
    },
    {
      "id": 71,
      "start": 300.7799987792969,
      "end": 307.6199951171875,
      "text": " No, this instruction comes direct from God, the Lord your God, and the source of the instruction"
    },
    {
      "id": 72,
      "start": 307.6199951171875,
      "end": 311.05999755859375,
      "text": " really determines the importance of the instruction."
    },
    {
      "id": 73,
      "start": 311.05999755859375,
      "end": 314.260009765625,
      "text": " And I'm thankful this morning that God has given us instruction."
    },
    {
      "id": 74,
      "start": 314.260009765625,
      "end": 321.3800048828125,
      "text": " You'll notice in verse number one that the Bible says, commandments, statutes, and judgments."
    },
    {
      "id": 75,
      "start": 321.3800048828125,
      "end": 323.0199890136719,
      "text": " Commandments are laws or precepts."
    },
    {
      "id": 76,
      "start": 323.0199890136719,
      "end": 329.739990234375,
      "text": " Really the idea of a commandment is to give orders to provide that command that God has"
    },
    {
      "id": 77,
      "start": 329.739990234375,
      "end": 330.739990234375,
      "text": " given us."
    },
    {
      "id": 78,
      "start": 330.739990234375,
      "end": 337.94000244140625,
      "text": " Statutes, really we could look at statutes as being, no doubt, a commandment."
    },
    {
      "id": 79,
      "start": 337.94000244140625,
      "end": 342.94000244140625,
      "text": " Not all commandments would be statutes, but statutes could fall into the category of being"
    },
    {
      "id": 80,
      "start": 342.94000244140625,
      "end": 343.94000244140625,
      "text": " commandments."
    },
    {
      "id": 81,
      "start": 343.94000244140625,
      "end": 348.1400146484375,
      "text": " But really it's dealing with the requirement of a prescribed task, and I believe it this"
    },
    {
      "id": 82,
      "start": 348.1400146484375,
      "end": 354.8599853515625,
      "text": " way that it gives us further detail as to how to carry out the command that has been"
    },
    {
      "id": 83,
      "start": 354.8599853515625,
      "end": 355.8599853515625,
      "text": " given."
    },
    {
      "id": 84,
      "start": 355.8599853515625,
      "end": 360.4599914550781,
      "text": " And we find that even if you were to look at the Ten Commandments, that they're provided"
    },
    {
      "id": 85,
      "start": 360.4599914550781,
      "end": 365.1199951171875,
      "text": " to us in very short form in Exodus, chapter number 20, in the first instance."
    },
    {
      "id": 86,
      "start": 365.1199951171875,
      "end": 371.6000061035156,
      "text": " But then you find that the law, as the statutes are provided, really it's opening up and providing"
    },
    {
      "id": 87,
      "start": 371.6000061035156,
      "end": 378.05999755859375,
      "text": " further instruction as to how to carry out the particular commandment."
    },
    {
      "id": 88,
      "start": 378.05999755859375,
      "end": 383.5199890136719,
      "text": " And so we see that he says commandments, statutes, and then we notice the word judgments."
    },
    {
      "id": 89,
      "start": 383.5199890136719,
      "end": 388.67999267578125,
      "text": " And really this is carrying it with it, the idea of a procedure or litigation."
    },
    {
      "id": 90,
      "start": 388.67999267578125,
      "end": 393.8800048828125,
      "text": " Perhaps we would look at it as being a verdict, the execution of judgment, what happens when"
    },
    {
      "id": 91,
      "start": 393.8800048828125,
      "end": 399.5799865722656,
      "text": " these commands that God gives, what happens when these commands are broken."
    },
    {
      "id": 92,
      "start": 399.5799865722656,
      "end": 402.7200012207031,
      "text": " And we find that God provides all of that detail."
    },
    {
      "id": 93,
      "start": 402.7200012207031,
      "end": 409.44000244140625,
      "text": " In the law, we find that the children of Israel had the understanding that here's a command,"
    },
    {
      "id": 94,
      "start": 409.44000244140625,
      "end": 414.8800048828125,
      "text": " here are statutes that provide further explanation of this command, how to carry it out in your"
    },
    {
      "id": 95,
      "start": 414.8800048828125,
      "end": 422.0,
      "text": " everyday life, and then if that is broken, here is the judgment, here's what the penalty"
    },
    {
      "id": 96,
      "start": 422.0,
      "end": 425.0,
      "text": " is for breaking that particular command."
    },
    {
      "id": 97,
      "start": 425.0,
      "end": 428.9599914550781,
      "text": " And we find that God has contained that within the Word of God, within the law for the children"
    },
    {
      "id": 98,
      "start": 428.9599914550781,
      "end": 429.9599914550781,
      "text": " of Israel."
    },
    {
      "id": 99,
      "start": 429.9599914550781,
      "end": 435.32000732421875,
      "text": " I find that as we look at the truth of the Old Testament and look at the law and we continue"
    },
    {
      "id": 100,
      "start": 435.32000732421875,
      "end": 442.44000244140625,
      "text": " to think about us as New Testament believers, that God has clearly communicated to us through"
    },
    {
      "id": 101,
      "start": 442.44000244140625,
      "end": 448.0,
      "text": " the law being our schoolmaster, as Paul would indicate in the book of Galatians, that we"
    },
    {
      "id": 102,
      "start": 448.0,
      "end": 450.5799865722656,
      "text": " are all guilty."
    },
    {
      "id": 103,
      "start": 450.5799865722656,
      "end": 454.8399963378906,
      "text": " And the wages of sin is death, and that's what the Bible tells us in Romans chapter"
    },
    {
      "id": 104,
      "start": 454.8399963378906,
      "end": 455.8399963378906,
      "text": " number 6."
    },
    {
      "id": 105,
      "start": 455.8399963378906,
      "end": 458.1600036621094,
      "text": " And so we find that everything is summed up."
    },
    {
      "id": 106,
      "start": 458.1600036621094,
      "end": 462.79998779296875,
      "text": " Remember, James says if you offend in one, you're guilty of all with regard to the law."
    },
    {
      "id": 107,
      "start": 462.9200134277344,
      "end": 469.760009765625,
      "text": " So the judgment as New Testament believers understanding that the penalty, the wages"
    },
    {
      "id": 108,
      "start": 469.760009765625,
      "end": 472.4800109863281,
      "text": " of sin, is death."
    },
    {
      "id": 109,
      "start": 472.4800109863281,
      "end": 478.239990234375,
      "text": " I'm so thankful, even as Jared sang this morning, that the Lord Jesus Christ suffered and bled"
    },
    {
      "id": 110,
      "start": 478.239990234375,
      "end": 485.1199951171875,
      "text": " and died on the cross of Calvary to pay the penalty that needed to be paid for mankind"
    },
    {
      "id": 111,
      "start": 485.1199951171875,
      "end": 486.79998779296875,
      "text": " to be redeemed, amen?"
    },
    {
      "id": 112,
      "start": 486.79998779296875,
      "end": 492.4200134277344,
      "text": " And what a blessing as we think about that borrowed tomb that was left empty, amen?"
    },
    {
      "id": 113,
      "start": 492.4200134277344,
      "end": 497.3399963378906,
      "text": " He rose from the dead, conquering sin, death, and the grave, and what a blessing that is."
    },
    {
      "id": 114,
      "start": 497.3399963378906,
      "end": 500.739990234375,
      "text": " And notice as we think about the importance of the instruction, he says this in verse"
    },
    {
      "id": 115,
      "start": 500.739990234375,
      "end": 501.739990234375,
      "text": " number 3."
    },
    {
      "id": 116,
      "start": 501.739990234375,
      "end": 508.8599853515625,
      "text": " Hear, therefore, O Israel, and observe to do it, notice, that it may be well with thee."
    },
    {
      "id": 117,
      "start": 508.8599853515625,
      "end": 513.9000244140625,
      "text": " I believe this morning that as we look at the instruction, we ought to rejoice and understand"
    },
    {
      "id": 118,
      "start": 513.9000244140625,
      "end": 515.780029296875,
      "text": " the importance of the instruction."
    },
    {
      "id": 119,
      "start": 515.780029296875,
      "end": 521.97998046875,
      "text": " However, I believe this morning that we can acknowledge with our minds that instruction"
    },
    {
      "id": 120,
      "start": 522.0399780273438,
      "end": 523.3800048828125,
      "text": " has been given."
    },
    {
      "id": 121,
      "start": 523.3800048828125,
      "end": 529.739990234375,
      "text": " We can even go to the point of acknowledging the importance of the instruction, and yet"
    },
    {
      "id": 122,
      "start": 529.739990234375,
      "end": 533.3200073242188,
      "text": " at times, we can set it aside, right?"
    },
    {
      "id": 123,
      "start": 533.3200073242188,
      "end": 535.219970703125,
      "text": " We know the instruction's been given."
    },
    {
      "id": 124,
      "start": 535.219970703125,
      "end": 536.2999877929688,
      "text": " It's been provided."
    },
    {
      "id": 125,
      "start": 536.2999877929688,
      "end": 537.6199951171875,
      "text": " God has been faithful."
    },
    {
      "id": 126,
      "start": 537.6199951171875,
      "end": 544.3800048828125,
      "text": " We understand that it's from God, so it's important, but at times, we can set it aside."
    },
    {
      "id": 127,
      "start": 544.3800048828125,
      "end": 545.9400024414062,
      "text": " So we see the importance of instruction."
    },
    {
      "id": 128,
      "start": 545.9400024414062,
      "end": 550.739990234375,
      "text": " I want you to notice number 2, and really the lengthy part of the message this morning,"
    },
    {
      "id": 129,
      "start": 550.739990234375,
      "end": 554.2999877929688,
      "text": " the implementation of instruction."
    },
    {
      "id": 130,
      "start": 554.2999877929688,
      "end": 557.6199951171875,
      "text": " I believe this morning that instruction is given to be obeyed."
    },
    {
      "id": 131,
      "start": 557.6199951171875,
      "end": 558.6199951171875,
      "text": " Amen?"
    },
    {
      "id": 132,
      "start": 558.6199951171875,
      "end": 563.4600219726562,
      "text": " When someone provides you with instruction, they are providing you with instruction with"
    },
    {
      "id": 133,
      "start": 563.4600219726562,
      "end": 570.0999755859375,
      "text": " details that if followed, when obeyed, the task can be fulfilled or satisfied."
    },
    {
      "id": 134,
      "start": 570.0999755859375,
      "end": 576.5800170898438,
      "text": " Oftentimes, we buy products that may have those little words, some assembly required,"
    },
    {
      "id": 135,
      "start": 576.5800170898438,
      "end": 581.6199951171875,
      "text": " and every time you see those words, you hope that they included the directions, the instructions"
    },
    {
      "id": 136,
      "start": 581.6199951171875,
      "end": 587.1799926757812,
      "text": " for assembling that piece of furniture or whatever it might be, and then you're able"
    },
    {
      "id": 137,
      "start": 587.1799926757812,
      "end": 589.5800170898438,
      "text": " to follow those instructions."
    },
    {
      "id": 138,
      "start": 589.5800170898438,
      "end": 592.8599853515625,
      "text": " And as you follow those instructions, you get to the end, and you find that you have"
    },
    {
      "id": 139,
      "start": 592.8599853515625,
      "end": 599.97998046875,
      "text": " a product that looks like, in theory, what the picture was on the box, and you follow"
    },
    {
      "id": 0,
      "start": 599.97998046875,
      "end": 603.9199805259705,
      "text": " those instructions. So instructions are given to be obeyed. In fact, in verse"
    },
    {
      "id": 1,
      "start": 603.9199805259705,
      "end": 607.9599804878235,
      "text": " number one, notice that he says, now these are the commandments, the statutes, and"
    },
    {
      "id": 2,
      "start": 607.9599804878235,
      "end": 611.6799802780151,
      "text": " the judgments which the Lord your God commanded to teach you. Notice this"
    },
    {
      "id": 3,
      "start": 611.6799802780151,
      "end": 620.6799812316895,
      "text": " phrase, that ye might do them. Do them in the land whither you go to possess it."
    },
    {
      "id": 4,
      "start": 620.6799812316895,
      "end": 626.1999797821045,
      "text": " Later on in the sixth chapter here of this particular book, we find that in"
    },
    {
      "id": 5,
      "start": 626.2599811553955,
      "end": 630.899980545044,
      "text": " verse number 24, he concludes with saying this, and the Lord commanded us to do all"
    },
    {
      "id": 6,
      "start": 630.899980545044,
      "end": 637.8599815368652,
      "text": " these statutes to fear the Lord our God. Notice this phrase, for our good always,"
    },
    {
      "id": 7,
      "start": 637.8599815368652,
      "end": 644.4999809265137,
      "text": " that he might preserve us alive as it is at this day. And it shall be our"
    },
    {
      "id": 8,
      "start": 644.4999809265137,
      "end": 647.7399787902832,
      "text": " righteousness if we deserve to do all these commandments before the Lord our"
    },
    {
      "id": 9,
      "start": 647.7399787902832,
      "end": 653.9399795532227,
      "text": " God as he hath commanded us. And I'm thankful that God has given it to us for"
    },
    {
      "id": 10,
      "start": 653.9399795532227,
      "end": 658.6799812316895,
      "text": " our benefit, and that helps us to understand the importance of implementing"
    },
    {
      "id": 11,
      "start": 658.6799812316895,
      "end": 662.5199813842773,
      "text": " the instruction that has been given. I believe that first we must acknowledge"
    },
    {
      "id": 12,
      "start": 662.5199813842773,
      "end": 668.8199768066406,
      "text": " this morning the necessity to implement the instruction in our own lives, in our"
    },
    {
      "id": 13,
      "start": 668.8199768066406,
      "end": 672.1999816894531,
      "text": " own lives. You know, it's really a difficulty when you try to instruct"
    },
    {
      "id": 14,
      "start": 672.1999816894531,
      "end": 676.599983215332,
      "text": " someone to do something that you're not actively doing. We're speaking about"
    },
    {
      "id": 15,
      "start": 676.599983215332,
      "end": 681.3199768066406,
      "text": " living life and following the instruction, and you begin to try to"
    },
    {
      "id": 16,
      "start": 681.3399810791016,
      "end": 685.97998046875,
      "text": " communicate to someone, whether it's a child or otherwise, you begin to instruct"
    },
    {
      "id": 17,
      "start": 685.97998046875,
      "end": 691.1399841308594,
      "text": " them on how they should behave or what they should do, but you yourself are not"
    },
    {
      "id": 18,
      "start": 691.1399841308594,
      "end": 695.8999786376953,
      "text": " implementing that same body of instruction, that same body of truth in"
    },
    {
      "id": 19,
      "start": 695.8999786376953,
      "end": 702.4999771118164,
      "text": " your own life, the effectiveness of your instruction can fail miserably. And so we"
    },
    {
      "id": 20,
      "start": 702.4999771118164,
      "end": 707.4199829101562,
      "text": " must acknowledge that in these first six verses of Deuteronomy 6, that really the"
    },
    {
      "id": 21,
      "start": 707.4399795532227,
      "end": 712.2399826049805,
      "text": " necessity, the responsibility to implement the instruction is first in"
    },
    {
      "id": 22,
      "start": 712.2399826049805,
      "end": 717.7999801635742,
      "text": " the lives of these that Moses is directly speaking to, of course, that God"
    },
    {
      "id": 23,
      "start": 717.7999801635742,
      "end": 723.6399841308594,
      "text": " is giving this instruction to. We note the instruction, it says, to teach you, in"
    },
    {
      "id": 24,
      "start": 723.6399841308594,
      "end": 729.2399749755859,
      "text": " verse number one, that ye might do them in the land whither you go to possess it,"
    },
    {
      "id": 25,
      "start": 729.2399749755859,
      "end": 735.1599731445312,
      "text": " that thou mightest fear the Lord thy God. Notice it talks about the perpetuity in"
    },
    {
      "id": 26,
      "start": 735.1599731445312,
      "end": 739.2599792480469,
      "text": " verse number two, but if you continue in verse number three, it says, hear therefore"
    },
    {
      "id": 27,
      "start": 739.2599792480469,
      "end": 746.1399841308594,
      "text": " O Israel, and observe to do it, that it may be well with thee, and that ye may"
    },
    {
      "id": 28,
      "start": 746.1399841308594,
      "end": 751.6999816894531,
      "text": " increase mightily. Look at verse number five, and thou shalt love the Lord"
    },
    {
      "id": 29,
      "start": 751.6999816894531,
      "end": 756.1399841308594,
      "text": " thy God with all thine heart, with all thy soul, and with all thy might, and"
    },
    {
      "id": 30,
      "start": 756.1399841308594,
      "end": 764.0199737548828,
      "text": " these words which I command thee this day shall be in thine heart. The"
    },
    {
      "id": 31,
      "start": 764.0199737548828,
      "end": 770.7199859619141,
      "text": " necessity of first implementing God's Word in our own lives. Those that teach"
    },
    {
      "id": 32,
      "start": 770.7199859619141,
      "end": 776.1399841308594,
      "text": " the Word of God ought to be doers of the Word of God. We find that, as James would"
    },
    {
      "id": 33,
      "start": 776.1399841308594,
      "end": 781.2399749755859,
      "text": " say this in the book of James, that we are to be doers of the Word, not hearers"
    },
    {
      "id": 34,
      "start": 781.2399749755859,
      "end": 787.0399780273438,
      "text": " only. I'm mindful of how the book of Acts begins as, what a great book, providing"
    },
    {
      "id": 35,
      "start": 787.0399780273438,
      "end": 791.4399871826172,
      "text": " us with the history of the early church, but it begins by telling us this of the"
    },
    {
      "id": 36,
      "start": 791.4399871826172,
      "end": 796.3799743652344,
      "text": " Lord Jesus Christ, the former treaties have I made, O Theophilus, of all that"
    },
    {
      "id": 37,
      "start": 796.3799743652344,
      "end": 803.97998046875,
      "text": " Jesus began both to do and teach. We find that Paul would later say to the"
    },
    {
      "id": 38,
      "start": 803.97998046875,
      "end": 807.3799743652344,
      "text": " believers in Philippi, when he's instructing them and as he's giving"
    },
    {
      "id": 39,
      "start": 807.3799743652344,
      "end": 812.2999877929688,
      "text": " them that final bit of instruction in Philippians chapter number four, he says"
    },
    {
      "id": 40,
      "start": 812.2999877929688,
      "end": 816.8599853515625,
      "text": " those things which he have both learned and received and heard, and then he says"
    },
    {
      "id": 41,
      "start": 816.8599853515625,
      "end": 825.4399871826172,
      "text": " this, and seen in me do, and the God of peace shall be with you. So we find the"
    },
    {
      "id": 42,
      "start": 825.4399871826172,
      "end": 831.8399810791016,
      "text": " necessity of implementing this truth, this instruction in our own lives, how"
    },
    {
      "id": 43,
      "start": 831.8399810791016,
      "end": 839.3599853515625,
      "text": " important it is that when our lives are observed that people see that"
    },
    {
      "id": 44,
      "start": 839.3599853515625,
      "end": 846.6199798583984,
      "text": " our walk matches our talk. I read a sign not long ago, everyone seems like in the"
    },
    {
      "id": 45,
      "start": 846.6199798583984,
      "end": 849.8599853515625,
      "text": " last 18 months that they've gotten serious about washing their hands. I've"
    },
    {
      "id": 46,
      "start": 849.8599853515625,
      "end": 854.47998046875,
      "text": " washed my hands all the time, amen? And man, I always am washing my hands, but I"
    },
    {
      "id": 47,
      "start": 854.47998046875,
      "end": 860.0199890136719,
      "text": " was in a particular facility and I saw a sign and it said this, wash your"
    },
    {
      "id": 48,
      "start": 860.0199890136719,
      "end": 864.1399841308594,
      "text": " hands like your mom's watching. And I thought, well that's kind of interesting."
    },
    {
      "id": 49,
      "start": 864.1399841308594,
      "end": 868.6399841308594,
      "text": " And you know, the reality is that we're to live our lives understanding that"
    },
    {
      "id": 50,
      "start": 868.6399841308594,
      "end": 873.8599853515625,
      "text": " people are watching us. Not only does God see everything and we're to live a life"
    },
    {
      "id": 51,
      "start": 873.8599853515625,
      "end": 877.4199829101562,
      "text": " that's holy and pleasing to our Savior, but we understand this morning that"
    },
    {
      "id": 52,
      "start": 877.4199829101562,
      "end": 881.3799743652344,
      "text": " there are people watching us. There are little eyes that are observing us and"
    },
    {
      "id": 53,
      "start": 881.3799743652344,
      "end": 886.219970703125,
      "text": " how vital it is that we would take the truth of God's Word. By the way, this"
    },
    {
      "id": 54,
      "start": 886.219970703125,
      "end": 890.5399780273438,
      "text": " isn't just for parents. You say, man, I don't have any children, I can go to"
    },
    {
      "id": 55,
      "start": 890.5399780273438,
      "end": 893.9399719238281,
      "text": " sleep on this message. No, no, my children are already raised, I can go to sleep on"
    },
    {
      "id": 56,
      "start": 893.9399719238281,
      "end": 899.0999755859375,
      "text": " this message. No, no, this truth is to be implemented in our lives as individuals"
    },
    {
      "id": 57,
      "start": 899.0999755859375,
      "end": 903.739990234375,
      "text": " and then we see the application of teaching our children, for those that"
    },
    {
      "id": 58,
      "start": 903.739990234375,
      "end": 908.3399658203125,
      "text": " have children that are still in that circumstance of being able to train them"
    },
    {
      "id": 59,
      "start": 908.3399658203125,
      "end": 914.6999816894531,
      "text": " and teach them. But how vital it is that we live this book, that we are people of"
    },
    {
      "id": 60,
      "start": 914.6999816894531,
      "end": 919.219970703125,
      "text": " the book. Notice as we think about the implementation of the instruction that we"
    },
    {
      "id": 61,
      "start": 919.219970703125,
      "end": 924.8599853515625,
      "text": " finally get to verse number seven where the Bible says this, and thou, so they've"
    },
    {
      "id": 62,
      "start": 924.8999938964844,
      "end": 929.2999877929688,
      "text": " received the instruction, they understand the importance of the instruction, they"
    },
    {
      "id": 63,
      "start": 929.2999877929688,
      "end": 933.8599853515625,
      "text": " understand and are implementing it in their own lives, and thou shalt teach"
    },
    {
      "id": 64,
      "start": 933.8599853515625,
      "end": 941.739990234375,
      "text": " them diligently unto thy children. I like that he uses the word diligently unto"
    },
    {
      "id": 65,
      "start": 941.739990234375,
      "end": 945.8199768066406,
      "text": " thy children. In fact, as we look at the remainder of verse number seven and even"
    },
    {
      "id": 66,
      "start": 945.8199768066406,
      "end": 950.5399780273438,
      "text": " in verses eight and nine, you'll see the significance of what it means to do"
    },
    {
      "id": 67,
      "start": 950.5399780273438,
      "end": 955.6199951171875,
      "text": " something diligently, and you'll see the the explanation that is provided in"
    },
    {
      "id": 68,
      "start": 955.6199951171875,
      "end": 961.0999755859375,
      "text": " giving further detail to what it means to teach it diligently unto thy children."
    },
    {
      "id": 69,
      "start": 961.0999755859375,
      "end": 966.3399658203125,
      "text": " No doubt God could have ended verse number seven with a period at the end of"
    },
    {
      "id": 70,
      "start": 966.3399658203125,
      "end": 970.3399658203125,
      "text": " thy children and just left us with the instruction that were to teach"
    },
    {
      "id": 71,
      "start": 970.3399658203125,
      "end": 976.0599670410156,
      "text": " diligently these commandments, statutes, and judgments to our children, but yet he"
    },
    {
      "id": 72,
      "start": 976.0599670410156,
      "end": 984.0999755859375,
      "text": " graciously provides us with what it looks like, practically speaking, to teach"
    },
    {
      "id": 73,
      "start": 984.0999755859375,
      "end": 991.0599670410156,
      "text": " diligently these commandments, statutes, and judgments to our children. Notice"
    },
    {
      "id": 74,
      "start": 991.0599670410156,
      "end": 996.1399841308594,
      "text": " there really are six references that are given in verses seven, eight, and nine with"
    },
    {
      "id": 75,
      "start": 996.1399841308594,
      "end": 1001.4999694824219,
      "text": " regard to what it looks like to to teach diligently. In verse number seven it says"
    },
    {
      "id": 76,
      "start": 1001.4999694824219,
      "end": 1002.4999694824219,
      "text": " this,"
    },
    {
      "id": 77,
      "start": 1002.4999694824219,
      "end": 1007.6599731445312,
      "text": " \"...and shalt talk of them,\" talk of what? Talk of the commandments, the statutes, and"
    },
    {
      "id": 78,
      "start": 1007.6599731445312,
      "end": 1012.5799865722656,
      "text": " the judgments. This that has been provided, the instruction, \"...thou shalt talk of them,"
    },
    {
      "id": 79,
      "start": 1012.5799865722656,
      "end": 1019.6599731445312,
      "text": " number one, when thou sittest in thine house.\" No doubt as we think about this in"
    },
    {
      "id": 80,
      "start": 1019.6599731445312,
      "end": 1023.739990234375,
      "text": " the home and the significance in the home and the importance of teaching the"
    },
    {
      "id": 81,
      "start": 1023.739990234375,
      "end": 1029.2599792480469,
      "text": " Word of God in the home, perhaps in view here when it speaks about when thou"
    },
    {
      "id": 82,
      "start": 1029.4199829101562,
      "end": 1034.8999938964844,
      "text": " sittest in thine house, the idea of perhaps mealtime, having that opportunity"
    },
    {
      "id": 83,
      "start": 1034.8999938964844,
      "end": 1041.2999877929688,
      "text": " during mealtime to teach diligently, to seize that opportunity, to teach the"
    },
    {
      "id": 84,
      "start": 1041.2999877929688,
      "end": 1045.219970703125,
      "text": " commandments, the statutes, and the judgments. There was a time in American"
    },
    {
      "id": 85,
      "start": 1045.219970703125,
      "end": 1052.0199890136719,
      "text": " history, and perhaps that time has has not been so much the case in recent"
    },
    {
      "id": 86,
      "start": 1052.0199890136719,
      "end": 1056.5399780273438,
      "text": " years, where families had dinner together. They all just kind of got around"
    },
    {
      "id": 87,
      "start": 1056.6599731445312,
      "end": 1061.1399841308594,
      "text": " the table and had a meal together, and it seems like the busyness of schedules and"
    },
    {
      "id": 88,
      "start": 1061.1399841308594,
      "end": 1065.6599731445312,
      "text": " all that takes place in our society today, that Johnny has practice here and"
    },
    {
      "id": 89,
      "start": 1065.6599731445312,
      "end": 1068.8599853515625,
      "text": " Susie has practice over here, and they got this thing and that thing, and"
    },
    {
      "id": 90,
      "start": 1068.8599853515625,
      "end": 1074.9399719238281,
      "text": " sometimes that mealtime, that family gathering time, is a missing element in"
    },
    {
      "id": 91,
      "start": 1074.9399719238281,
      "end": 1080.4999694824219,
      "text": " our homes today. But what a blessed opportunity to teach the commandments,"
    },
    {
      "id": 92,
      "start": 1080.4999694824219,
      "end": 1085.739990234375,
      "text": " the statutes, and the judgments, the instruction that God has provided. Notice"
    },
    {
      "id": 93,
      "start": 1085.739990234375,
      "end": 1090.1799926757812,
      "text": " he continues in verse number 7, he says, and shalt talk of them, not only when"
    },
    {
      "id": 94,
      "start": 1090.1799926757812,
      "end": 1095.739990234375,
      "text": " thou sittest in thine house, but number two, when thou walkest by the way. I think"
    },
    {
      "id": 95,
      "start": 1095.739990234375,
      "end": 1101.0599670410156,
      "text": " of this as really being the daily life, the routine, and the things that we"
    },
    {
      "id": 96,
      "start": 1101.0599670410156,
      "end": 1107.7799682617188,
      "text": " must take and take care of and minister to. I think about perhaps travel time"
    },
    {
      "id": 97,
      "start": 1107.7799682617188,
      "end": 1112.4599609375,
      "text": " when thou walkest, and of course we know the mode of transportation would be that"
    },
    {
      "id": 98,
      "start": 1112.6199951171875,
      "end": 1117.1799926757812,
      "text": " thou walkest by the way. Many of these folks, of course, as you would begin to"
    },
    {
      "id": 99,
      "start": 1117.1799926757812,
      "end": 1120.6599731445312,
      "text": " think about their time as they would enter into the land that God had"
    },
    {
      "id": 100,
      "start": 1120.6599731445312,
      "end": 1124.6599731445312,
      "text": " promised them, that this instruction is being provided for them, many would have"
    },
    {
      "id": 101,
      "start": 1124.6599731445312,
      "end": 1128.2799682617188,
      "text": " fields that they would have to care for. Many would have livestock that they"
    },
    {
      "id": 102,
      "start": 1128.2799682617188,
      "end": 1133.0199584960938,
      "text": " would have to tend to. And when thou walkest, not only do you take the"
    },
    {
      "id": 103,
      "start": 1133.0199584960938,
      "end": 1138.1799926757812,
      "text": " opportunity as a father, perhaps, to take your sons and to teach them how to take"
    },
    {
      "id": 104,
      "start": 1138.1799926757812,
      "end": 1142.699951171875,
      "text": " care of the livestock and how to tend to all that the family has to take care"
    },
    {
      "id": 105,
      "start": 1142.699951171875,
      "end": 1147.699951171875,
      "text": " of, but at the same time you're teaching them the commandments, the statutes, and"
    },
    {
      "id": 106,
      "start": 1147.699951171875,
      "end": 1153.8599853515625,
      "text": " the judgments when thou walkest in the way. And we think about the importance of"
    },
    {
      "id": 107,
      "start": 1153.8599853515625,
      "end": 1158.8200073242188,
      "text": " this truth of just really, as we summarize, as we'll get to the end here,"
    },
    {
      "id": 108,
      "start": 1158.8200073242188,
      "end": 1164.699951171875,
      "text": " it's really this truth of diligently seizing those opportunities and teaching"
    },
    {
      "id": 109,
      "start": 1164.739990234375,
      "end": 1169.7799682617188,
      "text": " the Word of God. Notice he continues and says, not only when thou sittest in thine"
    },
    {
      "id": 110,
      "start": 1169.7799682617188,
      "end": 1175.0599975585938,
      "text": " house and when thou walkest by the way, number three, when thou liest down, when"
    },
    {
      "id": 111,
      "start": 1175.0599975585938,
      "end": 1181.1799926757812,
      "text": " thou liest down. Bedtime. And you think about the importance of having the time"
    },
    {
      "id": 112,
      "start": 1181.1799926757812,
      "end": 1185.739990234375,
      "text": " of devotion. Perhaps there are some, as families, that would have family devotion"
    },
    {
      "id": 113,
      "start": 1185.739990234375,
      "end": 1190.260009765625,
      "text": " in the morning. For us, for all of the years of family devotions, we do our"
    },
    {
      "id": 114,
      "start": 1190.260009765625,
      "end": 1193.8599853515625,
      "text": " family devotions in the evening. And the reason we do family devotions in the"
    },
    {
      "id": 115,
      "start": 1193.8599853515625,
      "end": 1197.219970703125,
      "text": " evening is because we all have different schedules in the morning, and"
    },
    {
      "id": 116,
      "start": 1197.219970703125,
      "end": 1201.97998046875,
      "text": " therefore we have family devotions in the evening."
    },
    {
      "id": 0,
      "start": 1201.97998046875,
      "end": 1207.1799802780151,
      "text": " and we have that opportunity prior to bedtime that we're going to take some"
    },
    {
      "id": 1,
      "start": 1207.1799802780151,
      "end": 1212.859980583191,
      "text": " time and discuss the truth of God's Word and pray together as a family when thou"
    },
    {
      "id": 2,
      "start": 1212.859980583191,
      "end": 1218.4199810028076,
      "text": " liest down. Of course, we find the last part of verse number seven, it"
    },
    {
      "id": 3,
      "start": 1218.4199810028076,
      "end": 1224.7199802398682,
      "text": " says, and when thou risest up. Now you think about this, not only the"
    },
    {
      "id": 4,
      "start": 1224.7199802398682,
      "end": 1227.4999809265137,
      "text": " morning time that's given to us at the end of verse number seven, but when you"
    },
    {
      "id": 5,
      "start": 1227.4999809265137,
      "end": 1232.7799797058105,
      "text": " really think about the entirety of verse number seven, when thou sittest in thine"
    },
    {
      "id": 6,
      "start": 1232.7799797058105,
      "end": 1238.3399810791016,
      "text": " house, when thou walkest by the way, when thou liest down, and when thou risest up."
    },
    {
      "id": 7,
      "start": 1238.3399810791016,
      "end": 1246.039981842041,
      "text": " You know what he's saying? All the time. Thou shalt teach them, what's them? The"
    },
    {
      "id": 8,
      "start": 1246.039981842041,
      "end": 1249.7799797058105,
      "text": " commandments, the statutes, and the judgments. Thou shalt teach them"
    },
    {
      "id": 9,
      "start": 1249.7799797058105,
      "end": 1254.97998046875,
      "text": " diligently unto thy children. How do we teach them diligently? We're engaged in"
    },
    {
      "id": 10,
      "start": 1254.97998046875,
      "end": 1258.7399787902832,
      "text": " it all the time. We're seizing opportunities that present themselves to"
    },
    {
      "id": 11,
      "start": 1258.7399787902832,
      "end": 1264.819980621338,
      "text": " us as we would teach them the truth of God's Word, providing them understanding"
    },
    {
      "id": 12,
      "start": 1264.819980621338,
      "end": 1268.379981994629,
      "text": " that the instruction that God has provided us with, that we in like manner"
    },
    {
      "id": 13,
      "start": 1268.379981994629,
      "end": 1272.9399795532227,
      "text": " want to provide that instruction to them, understanding that this is the Word of"
    },
    {
      "id": 14,
      "start": 1272.9399795532227,
      "end": 1279.97998046875,
      "text": " God. He continues in verse number eight, and he tells us this, and thou shalt bind"
    },
    {
      "id": 15,
      "start": 1279.97998046875,
      "end": 1285.6199798583984,
      "text": " them for a sign upon thine hand, and they shall be as frontlets between thine"
    },
    {
      "id": 16,
      "start": 1285.6199798583984,
      "end": 1289.9399795532227,
      "text": " eyes. I think that it's very similar to what we see here in verse number six,"
    },
    {
      "id": 17,
      "start": 1289.9399795532227,
      "end": 1293.7799835205078,
      "text": " where the Bible says, in these words which I command thee this day, notice"
    },
    {
      "id": 18,
      "start": 1293.7799835205078,
      "end": 1299.2599792480469,
      "text": " what it says, shall be in thine heart. Do you remember what the psalmist said in Psalm 119?"
    },
    {
      "id": 19,
      "start": 1299.2599792480469,
      "end": 1303.0599822998047,
      "text": " He answers the question that is asked in verse number 11, wherewithal shall a"
    },
    {
      "id": 20,
      "start": 1303.0599822998047,
      "end": 1307.0199813842773,
      "text": " young man cleanse his way? We find that he says, by taking heed thereto according"
    },
    {
      "id": 21,
      "start": 1307.0199813842773,
      "end": 1312.6599807739258,
      "text": " to thy word, thy word have I hid in mine heart that I might not sin against thee."
    },
    {
      "id": 22,
      "start": 1312.6599807739258,
      "end": 1318.0199813842773,
      "text": " And we find that really, when we think about the impact of verse six and"
    },
    {
      "id": 23,
      "start": 1318.0199813842773,
      "end": 1321.6999816894531,
      "text": " verse number eight, and the implementation of the instruction that's provided, is"
    },
    {
      "id": 24,
      "start": 1321.6999816894531,
      "end": 1325.4599838256836,
      "text": " that it would be in our hearts. In other words, that it would be continually before"
    },
    {
      "id": 25,
      "start": 1325.4599838256836,
      "end": 1331.1799774169922,
      "text": " us. The Jewish custom or practice would be this thing of phylacteries that you"
    },
    {
      "id": 26,
      "start": 1331.1799774169922,
      "end": 1334.3799743652344,
      "text": " read about even during the time of the Lord Jesus Christ, where they would"
    },
    {
      "id": 27,
      "start": 1334.3799743652344,
      "end": 1339.8999786376953,
      "text": " literally wear scripture on them. On their person, on their robes, on their"
    },
    {
      "id": 28,
      "start": 1339.8999786376953,
      "end": 1344.8199768066406,
      "text": " garments, they would literally wear scripture. And oftentimes when you read"
    },
    {
      "id": 29,
      "start": 1344.8199768066406,
      "end": 1349.0199737548828,
      "text": " about the interactions that the Lord Jesus Christ would have with some of"
    },
    {
      "id": 30,
      "start": 1349.0199737548828,
      "end": 1353.0999755859375,
      "text": " those individuals that he interacted with during his earthly ministry, and he"
    },
    {
      "id": 31,
      "start": 1353.0999755859375,
      "end": 1358.459976196289,
      "text": " would say something about what this means, really he's pointing to them"
    },
    {
      "id": 32,
      "start": 1358.459976196289,
      "end": 1363.8599853515625,
      "text": " wearing scripture, and they don't even know what it means. It's not just an"
    },
    {
      "id": 33,
      "start": 1363.8599853515625,
      "end": 1369.6599731445312,
      "text": " outward action that we're taking, it's not just some type of religious roe"
    },
    {
      "id": 34,
      "start": 1369.6599731445312,
      "end": 1375.5399780273438,
      "text": " activity. No, that we've taken this instruction, we've understood that it's"
    },
    {
      "id": 35,
      "start": 1375.5399780273438,
      "end": 1379.739974975586,
      "text": " the source, it's God's instruction, we've understood the importance, the"
    },
    {
      "id": 36,
      "start": 1379.739974975586,
      "end": 1383.6199798583984,
      "text": " significance of the instruction, and we say we want this to be in our heart,"
    },
    {
      "id": 37,
      "start": 1383.6199798583984,
      "end": 1388.9399871826172,
      "text": " we want it to be continually before us. We've sought to"
    },
    {
      "id": 38,
      "start": 1388.9399871826172,
      "end": 1393.1399841308594,
      "text": " diligently teach it when thou sittest, when thou walkest, when thou liest, when"
    },
    {
      "id": 39,
      "start": 1393.1799774169922,
      "end": 1398.6999816894531,
      "text": " thou risest. I mean, all of the time we're seeking to give and to implement the"
    },
    {
      "id": 40,
      "start": 1398.6999816894531,
      "end": 1403.1799774169922,
      "text": " instruction that has been provided. We see in verse number nine that he says,"
    },
    {
      "id": 41,
      "start": 1403.1799774169922,
      "end": 1410.6199798583984,
      "text": " and thou shalt write them upon the post of thy house and on thy gates. You think"
    },
    {
      "id": 42,
      "start": 1410.6199798583984,
      "end": 1416.1799774169922,
      "text": " about this truth in verse number nine of really, again, this visible reminder, the"
    },
    {
      "id": 43,
      "start": 1416.1799774169922,
      "end": 1422.2599792480469,
      "text": " idea of it being on our walls. And many, I know, have had scripture posted"
    },
    {
      "id": 44,
      "start": 1422.5799865722656,
      "end": 1427.499984741211,
      "text": " in their homes, on their walls, and it's that reminder. And you think about the"
    },
    {
      "id": 45,
      "start": 1427.499984741211,
      "end": 1432.5799865722656,
      "text": " significance and the impact of being able to go through a home and go"
    },
    {
      "id": 46,
      "start": 1432.5799865722656,
      "end": 1436.8999786376953,
      "text": " through your home and your children, hearing you give them the instruction,"
    },
    {
      "id": 47,
      "start": 1436.8999786376953,
      "end": 1441.6599731445312,
      "text": " but then visibly seeing the reminder as perhaps they would walk through the home,"
    },
    {
      "id": 48,
      "start": 1441.6599731445312,
      "end": 1446.1399841308594,
      "text": " as they would leave the house, and they would see visibly the scripture that's"
    },
    {
      "id": 49,
      "start": 1446.1399841308594,
      "end": 1453.2599792480469,
      "text": " posted upon the walls. It's so important because it's God's instruction. And we"
    },
    {
      "id": 50,
      "start": 1453.2599792480469,
      "end": 1456.1799774169922,
      "text": " think about the implementation of the instruction, and we think about the"
    },
    {
      "id": 51,
      "start": 1456.1799774169922,
      "end": 1460.97998046875,
      "text": " responsibility that is given, what great responsibility. I mean, really, when we"
    },
    {
      "id": 52,
      "start": 1460.97998046875,
      "end": 1465.9399719238281,
      "text": " consider the mandate, the instruction that has been given here, we understand"
    },
    {
      "id": 53,
      "start": 1465.9399719238281,
      "end": 1471.8199768066406,
      "text": " even, as I said on Wednesday evening, that God has commissioned, God has given the"
    },
    {
      "id": 54,
      "start": 1471.8199768066406,
      "end": 1476.7799682617188,
      "text": " responsibility of teaching children to their parents. There is no other"
    },
    {
      "id": 55,
      "start": 1476.7799682617188,
      "end": 1481.0199890136719,
      "text": " individual, there is no other organization that has been given the"
    },
    {
      "id": 56,
      "start": 1481.0199890136719,
      "end": 1486.4999694824219,
      "text": " responsibility of teaching our children. By the way, that's not popular in our"
    },
    {
      "id": 57,
      "start": 1486.4999694824219,
      "end": 1490.739990234375,
      "text": " society today. There are some that are in government positions, some that are"
    },
    {
      "id": 58,
      "start": 1490.739990234375,
      "end": 1496.2599792480469,
      "text": " running for office, that do not believe that you as a parent have any say over"
    },
    {
      "id": 59,
      "start": 1496.2599792480469,
      "end": 1504.8199768066406,
      "text": " what your children are taught. But God, in His Word, says, thou shalt teach them"
    },
    {
      "id": 60,
      "start": 1504.8199768066406,
      "end": 1513.7799682617188,
      "text": " diligently unto thy children. Children are an heritage of the Lord. Amen? God has"
    },
    {
      "id": 61,
      "start": 1513.7799682617188,
      "end": 1519.5799865722656,
      "text": " blessed and given the fruit of the womb as His reward, and we find that as He's"
    },
    {
      "id": 62,
      "start": 1519.5799865722656,
      "end": 1524.8999938964844,
      "text": " given children, He's given responsibility. And that responsibility is ours. By the"
    },
    {
      "id": 63,
      "start": 1524.8999938964844,
      "end": 1528.97998046875,
      "text": " way, I believe this morning with all of my heart that we're gonna give an"
    },
    {
      "id": 64,
      "start": 1528.97998046875,
      "end": 1534.4999694824219,
      "text": " account for how we teach our children, for how we raise our children, for how we"
    },
    {
      "id": 65,
      "start": 1534.4999694824219,
      "end": 1537.6999816894531,
      "text": " instruct them. Now, you can't force your kids to do anything. When they're"
    },
    {
      "id": 66,
      "start": 1537.6999816894531,
      "end": 1540.5799865722656,
      "text": " real little, you can force them to do some things, but there comes a time when"
    },
    {
      "id": 67,
      "start": 1540.5799865722656,
      "end": 1545.6199951171875,
      "text": " you can't force your children to do something. Amen? Some of you that have"
    },
    {
      "id": 68,
      "start": 1545.6199951171875,
      "end": 1548.3399658203125,
      "text": " older kids, can you help me out? You can't force your kids to do anything"
    },
    {
      "id": 69,
      "start": 1548.3399658203125,
      "end": 1554.0999755859375,
      "text": " anymore, right? Blake, your parents are sitting there, but man, it ain't gonna"
    },
    {
      "id": 70,
      "start": 1554.0999755859375,
      "end": 1558.8999938964844,
      "text": " happen like it did when you were two, right? And the reality is that there"
    },
    {
      "id": 71,
      "start": 1558.8999938964844,
      "end": 1564.5399780273438,
      "text": " comes a time where they have their own responsibility and accountability, and"
    },
    {
      "id": 72,
      "start": 1564.5399780273438,
      "end": 1568.1399841308594,
      "text": " they're going to answer for their decisions, but we as parents, we have a"
    },
    {
      "id": 73,
      "start": 1568.1399841308594,
      "end": 1573.4599914550781,
      "text": " great responsibility. And God's not gonna let us off the hook by simply saying,"
    },
    {
      "id": 74,
      "start": 1573.4599914550781,
      "end": 1580.219970703125,
      "text": " well, we left that for fill-in-the-blank, whoever that for is. No, no, God said, I"
    },
    {
      "id": 75,
      "start": 1580.219970703125,
      "end": 1584.8199768066406,
      "text": " gave you the responsibility. And in giving you the responsibility, you're"
    },
    {
      "id": 76,
      "start": 1584.8199768066406,
      "end": 1591.5399780273438,
      "text": " accountable for that. Now, we may choose to have a variety of methodologies for"
    },
    {
      "id": 77,
      "start": 1591.5399780273438,
      "end": 1596.2999877929688,
      "text": " how our children would be educated, but we must understand that we play a vital"
    },
    {
      "id": 78,
      "start": 1596.2999877929688,
      "end": 1601.0599670410156,
      "text": " role in that education process. And you understand this morning that even as I"
    },
    {
      "id": 79,
      "start": 1601.0599670410156,
      "end": 1604.739990234375,
      "text": " started that message or that series on Wednesday evening, and I'll be sending"
    },
    {
      "id": 80,
      "start": 1604.739990234375,
      "end": 1608.5799865722656,
      "text": " out an email tomorrow, I hope that you'd be, if you're not here on Wednesday"
    },
    {
      "id": 81,
      "start": 1608.5799865722656,
      "end": 1611.97998046875,
      "text": " night, and I wish you would be, that you would at least tune in on Wednesday"
    },
    {
      "id": 82,
      "start": 1611.97998046875,
      "end": 1615.97998046875,
      "text": " night, so starting a series on the danger of deception. I believe that we are"
    },
    {
      "id": 83,
      "start": 1615.97998046875,
      "end": 1620.1799926757812,
      "text": " living in an age of deception. And here's the reality, I said it on Wednesday"
    },
    {
      "id": 84,
      "start": 1620.1799926757812,
      "end": 1624.3799743652344,
      "text": " night, the thing that infuriates me about that truth is that they're starting with"
    },
    {
      "id": 85,
      "start": 1624.3799743652344,
      "end": 1630.6999816894531,
      "text": " the kids this age. And they're indoctrinating them. And then they want"
    },
    {
      "id": 86,
      "start": 1630.6999816894531,
      "end": 1634.5799865722656,
      "text": " to attack you for trying to teach them this book and say, you're just"
    },
    {
      "id": 87,
      "start": 1634.5799865722656,
      "end": 1640.8599853515625,
      "text": " indoctrinating your kids, so it's better to let you indoctrinate my kids? Oh, we're"
    },
    {
      "id": 88,
      "start": 1640.8599853515625,
      "end": 1645.3399658203125,
      "text": " living in an age of deception. And how important it is that we understand this"
    },
    {
      "id": 89,
      "start": 1645.3399658203125,
      "end": 1650.2599792480469,
      "text": " morning that the implementation of the instruction that God has given us,"
    },
    {
      "id": 90,
      "start": 1650.2599792480469,
      "end": 1658.219970703125,
      "text": " first in our lives, but then as we would then take and actively teach our"
    },
    {
      "id": 91,
      "start": 1658.4999694824219,
      "end": 1664.9399719238281,
      "text": " children. Diligently teach our children. I want you to notice with me the, number"
    },
    {
      "id": 92,
      "start": 1664.9399719238281,
      "end": 1670.8999938964844,
      "text": " three, if you're taking notes, the impact of this instruction. What's the impact?"
    },
    {
      "id": 93,
      "start": 1670.8999938964844,
      "end": 1678.2599792480469,
      "text": " Well, notice in verse number two, he says this, that thou mightest fear the Lord"
    },
    {
      "id": 94,
      "start": 1678.2599792480469,
      "end": 1683.0999755859375,
      "text": " thy God. By the way, it's a good thing to fear God. Our God is a consuming fire."
    },
    {
      "id": 95,
      "start": 1683.0999755859375,
      "end": 1688.0999755859375,
      "text": " Amen? It is a fearful thing to fall into the hands of an angry God. He is the judge"
    },
    {
      "id": 96,
      "start": 1688.0999755859375,
      "end": 1693.4199829101562,
      "text": " of the universe. And I'm so thankful that he's given us instruction. And yes,"
    },
    {
      "id": 97,
      "start": 1693.4199829101562,
      "end": 1698.1799926757812,
      "text": " that we have a godly fear and a godly reverence of who our God is. And as we"
    },
    {
      "id": 98,
      "start": 1698.1799926757812,
      "end": 1703.0199890136719,
      "text": " take the instruction that he's given to us and we implement it in our lives, we"
    },
    {
      "id": 99,
      "start": 1703.0199890136719,
      "end": 1708.1399841308594,
      "text": " don't have to fear the judgment of God. Isn't that a blessing? You know, how many"
    },
    {
      "id": 100,
      "start": 1708.1399841308594,
      "end": 1712.8199768066406,
      "text": " times you see people that are driving down the highway and they see a Virginia"
    },
    {
      "id": 101,
      "start": 1712.8199768066406,
      "end": 1717.0599975585938,
      "text": " State police officer, they see a county police officer, and all of a sudden, man,"
    },
    {
      "id": 102,
      "start": 1717.0599975585938,
      "end": 1719.5399780273438,
      "text": " they're hitting their brakes and they're changing all of their behavior. Why?"
    },
    {
      "id": 103,
      "start": 1719.5399780273438,
      "end": 1722.8999633789062,
      "text": " Because they're fearful of what the consequences are going to be of their"
    },
    {
      "id": 104,
      "start": 1722.8999633789062,
      "end": 1726.739990234375,
      "text": " disobedience to the law. But if you're not disobeying the law and you're"
    },
    {
      "id": 105,
      "start": 1726.739990234375,
      "end": 1729.0999755859375,
      "text": " driving, you don't have to hit your brakes when you're driving down the"
    },
    {
      "id": 106,
      "start": 1729.0999755859375,
      "end": 1733.5399780273438,
      "text": " highway. You just keep on going. By the way, I've heard from some that are in"
    },
    {
      "id": 107,
      "start": 1733.5399780273438,
      "end": 1737.0199584960938,
      "text": " that profession that when you hit your brakes and change your behavior, it makes"
    },
    {
      "id": 108,
      "start": 1737.0199584960938,
      "end": 1741.8599853515625,
      "text": " you look more guilty. And that is the case, is it not? Because you're trying to"
    },
    {
      "id": 109,
      "start": 1741.8599853515625,
      "end": 1748.4599609375,
      "text": " hide something. But I don't have to fear when I've taken the truth that God has"
    },
    {
      "id": 110,
      "start": 1748.4599609375,
      "end": 1753.8599853515625,
      "text": " given, the instruction, and I've sought to diligently implement it in my own life"
    },
    {
      "id": 111,
      "start": 1753.8599853515625,
      "end": 1758.8999633789062,
      "text": " and diligently instruct those that God has given to me to instruct. And I"
    },
    {
      "id": 112,
      "start": 1758.8999633789062,
      "end": 1762.3800048828125,
      "text": " see the impact, not only will it be a fear, but it says this, to keep all his"
    },
    {
      "id": 113,
      "start": 1762.3800048828125,
      "end": 1768.0599975585938,
      "text": " statutes and his commandments, notice this, which I command thee, thou and thy"
    },
    {
      "id": 114,
      "start": 1768.0599975585938,
      "end": 1775.1399536132812,
      "text": " son and thy son's son. The impact is generational. It's a generational impact."
    },
    {
      "id": 115,
      "start": 1775.1399536132812,
      "end": 1780.0599975585938,
      "text": " And by the way, it's supposed to be that way. You notice at the end of verse"
    },
    {
      "id": 116,
      "start": 1780.0599975585938,
      "end": 1785.0199584960938,
      "text": " number six, it says this, all the days of thy life. There never comes a time where"
    },
    {
      "id": 117,
      "start": 1785.0199584960938,
      "end": 1787.9400024414062,
      "text": " you say, I've arrived and I don't have to worry about implementing these things"
    },
    {
      "id": 118,
      "start": 1787.9400024414062,
      "end": 1793.1799926757812,
      "text": " anymore. No, no. Every day of our lives until we take that final breath here and"
    },
    {
      "id": 119,
      "start": 1793.1799926757812,
      "end": 1797.5799560546875,
      "text": " we enter into the presence of our Savior, we must implement the truth that is"
    },
    {
      "id": 120,
      "start": 1797.5799560546875,
      "end": 1803.7799682617188,
      "text": " given. And then it says this, and that thy days may..."
    },
    {
      "id": 0,
      "start": 1803.7799682617188,
      "end": 1808.3999681472778,
      "text": " prolonged. Again, verse number three, I mentioned it earlier. Here, therefore, O"
    },
    {
      "id": 1,
      "start": 1808.3999681472778,
      "end": 1812.679967880249,
      "text": " Israel, and observe to do it that it may be well with thee, what we read in verse"
    },
    {
      "id": 2,
      "start": 1812.679967880249,
      "end": 1817.8199682235718,
      "text": " number 24, for our good always. Listen, the impact of this instruction, it's"
    },
    {
      "id": 3,
      "start": 1817.8199682235718,
      "end": 1823.2399673461914,
      "text": " positive for us, it is beneficial for us. As Peter says, ye do well that ye take"
    },
    {
      "id": 4,
      "start": 1823.2399673461914,
      "end": 1829.2799682617188,
      "text": " heed thereunto. It is in your best interest and in my best interest to obey"
    },
    {
      "id": 5,
      "start": 1829.2799682617188,
      "end": 1834.9999675750732,
      "text": " the instruction that has been provided. The impact is given here, it's"
    },
    {
      "id": 6,
      "start": 1834.9999675750732,
      "end": 1840.5199699401855,
      "text": " generational, as we see in verse number two, it's beneficial as it will be well"
    },
    {
      "id": 7,
      "start": 1840.5199699401855,
      "end": 1844.039966583252,
      "text": " with us. And I want you to think about the generational aspect of this"
    },
    {
      "id": 8,
      "start": 1844.039966583252,
      "end": 1847.9599685668945,
      "text": " particular instruction. Turn over to the book of Psalms, if you will, and then"
    },
    {
      "id": 9,
      "start": 1847.9599685668945,
      "end": 1852.039966583252,
      "text": " we'll close with a New Testament truth as well. But look at Psalm 78, if you will,"
    },
    {
      "id": 10,
      "start": 1852.039966583252,
      "end": 1857.8399696350098,
      "text": " and I want you to notice the first several verses of this great chapter. You"
    },
    {
      "id": 11,
      "start": 1857.8399696350098,
      "end": 1861.9199676513672,
      "text": " know, the Bible has been given to us, and we can see not only"
    },
    {
      "id": 12,
      "start": 1861.9199676513672,
      "end": 1866.9599685668945,
      "text": " through Bible history the failure of God's people to implement truth and to"
    },
    {
      "id": 13,
      "start": 1866.9599685668945,
      "end": 1872.1599655151367,
      "text": " instruct a future generation, but we can see that even in contemporary history. We"
    },
    {
      "id": 14,
      "start": 1872.1599655151367,
      "end": 1876.9199676513672,
      "text": " can find that as we have failed as the people of God to do what God has"
    },
    {
      "id": 15,
      "start": 1876.9199676513672,
      "end": 1881.599967956543,
      "text": " instructed us to do, that the consequences are grave. Do you remember"
    },
    {
      "id": 16,
      "start": 1881.599967956543,
      "end": 1886.719970703125,
      "text": " that in the book of Joshua, we see the the great account of God's blessing and"
    },
    {
      "id": 17,
      "start": 1886.719970703125,
      "end": 1891.7599716186523,
      "text": " the entrance into the conquering of, the division of, and the inhabiting of the"
    },
    {
      "id": 18,
      "start": 1891.7599716186523,
      "end": 1896.0799713134766,
      "text": " land, and what great truth is given to us in the book of Joshua? And then you open"
    },
    {
      "id": 19,
      "start": 1896.0799713134766,
      "end": 1899.199966430664,
      "text": " up into the book of Judges and you find that there's another generation that rose"
    },
    {
      "id": 20,
      "start": 1899.199966430664,
      "end": 1904.599967956543,
      "text": " up that knew not the Lord. Wow. What sad commentary that is in the book of"
    },
    {
      "id": 21,
      "start": 1904.599967956543,
      "end": 1908.9599685668945,
      "text": " Judges, that there would be a generation that would rise up that did"
    },
    {
      "id": 22,
      "start": 1908.9599685668945,
      "end": 1914.8399658203125,
      "text": " not know the Lord. They failed to give and to obey the instruction that is"
    },
    {
      "id": 23,
      "start": 1914.8399658203125,
      "end": 1918.7999649047852,
      "text": " provided here in Deuteronomy 6 and Psalm 78. Notice what the Bible says,"
    },
    {
      "id": 24,
      "start": 1918.7999649047852,
      "end": 1924.7999649047852,
      "text": " give ear, O my people, to my law. Incline your ears to the words of my mouth. I"
    },
    {
      "id": 25,
      "start": 1924.7999649047852,
      "end": 1930.0799713134766,
      "text": " will open my mouth in a parable. I will utter dark sayings of old, which we have"
    },
    {
      "id": 26,
      "start": 1930.0799713134766,
      "end": 1933.4399719238281,
      "text": " heard and known and our fathers have told us. Notice in verse number four, we"
    },
    {
      "id": 27,
      "start": 1933.4399719238281,
      "end": 1938.8399658203125,
      "text": " will not hide them from their children, showing to the generation to come the"
    },
    {
      "id": 28,
      "start": 1938.8399658203125,
      "end": 1945.3199615478516,
      "text": " praises of the Lord and his strength and his wonderful works that he hath"
    },
    {
      "id": 29,
      "start": 1945.3199615478516,
      "end": 1951.239974975586,
      "text": " done. Who's gonna teach our children how great God is? We better know how great"
    },
    {
      "id": 30,
      "start": 1951.239974975586,
      "end": 1955.719970703125,
      "text": " God is and we better get busy teaching our children how great our God is. Amen?"
    },
    {
      "id": 31,
      "start": 1955.719970703125,
      "end": 1961.3999633789062,
      "text": " How do we discover the greatness of God? Through his word. He's revealed to us so"
    },
    {
      "id": 32,
      "start": 1961.3999633789062,
      "end": 1966.0399627685547,
      "text": " many of his mighty acts and what a blessing to think about the the might"
    },
    {
      "id": 33,
      "start": 1966.0799713134766,
      "end": 1971.4399719238281,
      "text": " and power and greatness of our God, but then we must declare his greatness. You"
    },
    {
      "id": 34,
      "start": 1971.4399719238281,
      "end": 1974.9599609375,
      "text": " understand that the schoolhouse and the White House and the Congress and"
    },
    {
      "id": 35,
      "start": 1974.9599609375,
      "end": 1979.4399719238281,
      "text": " Hollywood, they're not going to teach our children how great God is. No, on the"
    },
    {
      "id": 36,
      "start": 1979.4399719238281,
      "end": 1986.1599731445312,
      "text": " contrary, they're going to attack the person of Jesus Christ. So we see that it"
    },
    {
      "id": 37,
      "start": 1986.1599731445312,
      "end": 1990.239974975586,
      "text": " says in verse number five, for he established a testimony in Jacob and"
    },
    {
      "id": 38,
      "start": 1990.239974975586,
      "end": 1994.6399688720703,
      "text": " appointed a law in Israel which he commanded our fathers that they should"
    },
    {
      "id": 39,
      "start": 1994.6399688720703,
      "end": 2001.2799682617188,
      "text": " make them known to their children. Why? What's the what's the impact? Remember"
    },
    {
      "id": 40,
      "start": 2001.2799682617188,
      "end": 2006.1199645996094,
      "text": " it's generational. That the generation to come in verse number six might know them,"
    },
    {
      "id": 41,
      "start": 2006.1199645996094,
      "end": 2010.8399658203125,
      "text": " even the children which should be born who should arise and declare them to"
    },
    {
      "id": 42,
      "start": 2010.8399658203125,
      "end": 2016.7999725341797,
      "text": " their children, that they might set their hope in God and not forget the works of"
    },
    {
      "id": 43,
      "start": 2016.7999725341797,
      "end": 2025.6799621582031,
      "text": " God, but keep his commandments. Wow. God's given us the instruction. He's"
    },
    {
      "id": 44,
      "start": 2025.6799621582031,
      "end": 2029.9999694824219,
      "text": " provided us with a pattern of how we're supposed to behave and how we're"
    },
    {
      "id": 45,
      "start": 2029.9999694824219,
      "end": 2033.5599670410156,
      "text": " supposed to operate and how we're supposed to to give this truth to a"
    },
    {
      "id": 46,
      "start": 2033.5599670410156,
      "end": 2039.0799713134766,
      "text": " future generation and how when we follow the instruction that God has given, we"
    },
    {
      "id": 47,
      "start": 2039.0799713134766,
      "end": 2045.0799713134766,
      "text": " implement in our lives, we take heed to the truth of how we would"
    },
    {
      "id": 48,
      "start": 2045.0799713134766,
      "end": 2049.8799743652344,
      "text": " further propagate these instructions, these commandments and statutes and"
    },
    {
      "id": 49,
      "start": 2049.8799743652344,
      "end": 2054.6399688720703,
      "text": " judgments, that we find that the impact will be that this generation would set"
    },
    {
      "id": 50,
      "start": 2054.6399688720703,
      "end": 2060.239959716797,
      "text": " their hope in God. By the way, don't you want a generation to believe God? To have"
    },
    {
      "id": 51,
      "start": 2060.239959716797,
      "end": 2067.5199584960938,
      "text": " faith that God is able to set their hope in God? We find that it says this, and not"
    },
    {
      "id": 52,
      "start": 2067.5199584960938,
      "end": 2075.8399658203125,
      "text": " forget the works of God, but keep his commandments. What a blessing it is when"
    },
    {
      "id": 53,
      "start": 2075.8399658203125,
      "end": 2082.2799682617188,
      "text": " you see the generational impact that this instruction can have upon"
    },
    {
      "id": 54,
      "start": 2082.2799682617188,
      "end": 2087.239959716797,
      "text": " generations to come where they're still doing and still following and"
    },
    {
      "id": 55,
      "start": 2087.239959716797,
      "end": 2091.8399658203125,
      "text": " still obeying and still heeding to the instruction of God's Word. What a"
    },
    {
      "id": 56,
      "start": 2091.8399658203125,
      "end": 2096.679962158203,
      "text": " blessing. Look at 2nd Timothy chapter number three in closing this morning and"
    },
    {
      "id": 57,
      "start": 2096.679962158203,
      "end": 2105.47998046875,
      "text": " 2nd Timothy chapter number three, I want you to notice that Paul is speaking"
    },
    {
      "id": 58,
      "start": 2105.47998046875,
      "end": 2112.5199584960938,
      "text": " here of course to Timothy, his son in the faith, and he begins really by providing"
    },
    {
      "id": 59,
      "start": 2112.5199584960938,
      "end": 2117.719970703125,
      "text": " us with an interesting piece of historical data in the first chapter of"
    },
    {
      "id": 60,
      "start": 2117.719970703125,
      "end": 2122.1199645996094,
      "text": " 2nd Timothy when he tells us this in verse number five, when I call to"
    },
    {
      "id": 61,
      "start": 2122.1199645996094,
      "end": 2128.1199645996094,
      "text": " remembrance the unfeigned faith that is in thee, so in Timothy, which dwelt first"
    },
    {
      "id": 62,
      "start": 2128.1199645996094,
      "end": 2133.5999755859375,
      "text": " in thy grandmother Lois and thy mother Eunice, and I am persuaded that in thee"
    },
    {
      "id": 63,
      "start": 2133.5999755859375,
      "end": 2138.5599670410156,
      "text": " also. Do you see the generational impact there? He says, listen, Paul says, I'm"
    },
    {
      "id": 64,
      "start": 2138.5599670410156,
      "end": 2143.3599548339844,
      "text": " thankful when I call to remembrance your unfeigned faith. He says, but"
    },
    {
      "id": 65,
      "start": 2143.3599548339844,
      "end": 2148.9599609375,
      "text": " understand, I recognize that it dwelt first in thy grandmother Lois and then"
    },
    {
      "id": 66,
      "start": 2148.9599609375,
      "end": 2155.3599548339844,
      "text": " in your mother Eunice and now in thee also. The passage that I had you turn to"
    },
    {
      "id": 67,
      "start": 2155.3599548339844,
      "end": 2159.1599731445312,
      "text": " in chapter number three and beginning in verse number 14, Paul says this, but"
    },
    {
      "id": 68,
      "start": 2159.1599731445312,
      "end": 2164.3599548339844,
      "text": " continue thou in the things which thou hast learned and has been assured of,"
    },
    {
      "id": 69,
      "start": 2164.3599548339844,
      "end": 2169.5999755859375,
      "text": " knowing of whom thou hast learned them, and notice in verse number 15, and that"
    },
    {
      "id": 70,
      "start": 2169.5999755859375,
      "end": 2178.439971923828,
      "text": " from a child thou hast known the Holy Scriptures. From a child. Well, the"
    },
    {
      "id": 71,
      "start": 2178.439971923828,
      "end": 2183.9199829101562,
      "text": " impact that we read of in chapter number one of his mother and grandmother"
    },
    {
      "id": 72,
      "start": 2183.9199829101562,
      "end": 2190.0399780273438,
      "text": " instructing him in the Holy Scriptures. We mentioned about the importance of the"
    },
    {
      "id": 73,
      "start": 2190.0399780273438,
      "end": 2194.47998046875,
      "text": " instruction, that we recognize that it was from God, the source determines the"
    },
    {
      "id": 74,
      "start": 2194.47998046875,
      "end": 2200.439971923828,
      "text": " importance, and in Deuteronomy 6, Moses said, which the Lord your God commanded"
    },
    {
      "id": 75,
      "start": 2200.439971923828,
      "end": 2204.999969482422,
      "text": " to teach you. Here we find that it says that from a child thou hast known"
    },
    {
      "id": 76,
      "start": 2204.999969482422,
      "end": 2215.239959716797,
      "text": " the Holy Scriptures. What makes them holy? They're gods. God breathed inspiration."
    },
    {
      "id": 77,
      "start": 2215.239959716797,
      "end": 2222.0399780273438,
      "text": " You see in the next verse, all Scripture is given by inspiration of God. The"
    },
    {
      "id": 78,
      "start": 2222.0399780273438,
      "end": 2229.719970703125,
      "text": " source is God. The understanding is that they're holy scriptures. Why? Because"
    },
    {
      "id": 79,
      "start": 2229.719970703125,
      "end": 2236.239959716797,
      "text": " they come from a holy God. Amen? I'm thankful that our God is holy. In fact,"
    },
    {
      "id": 80,
      "start": 2236.239959716797,
      "end": 2239.679962158203,
      "text": " we're instructed in the book of Psalms that we're to give thanks, the"
    },
    {
      "id": 81,
      "start": 2239.679962158203,
      "end": 2246.8399658203125,
      "text": " remembrance of his holiness. Our God is not becoming holy, he is holy. We read it"
    },
    {
      "id": 82,
      "start": 2246.8399658203125,
      "end": 2250.3999633789062,
      "text": " in the book of Leviticus, we read in the book of 1st Peter when he says, I am"
    },
    {
      "id": 83,
      "start": 2250.3999633789062,
      "end": 2255.719970703125,
      "text": " holy, therefore you're to be holy. Be you holy as I am holy. We read that"
    },
    {
      "id": 84,
      "start": 2255.759979248047,
      "end": 2260.1599731445312,
      "text": " instruction. So we find that he says that from a child thou hast known the Holy"
    },
    {
      "id": 85,
      "start": 2260.1599731445312,
      "end": 2263.9199829101562,
      "text": " Scriptures, and then notice this, which are able to make thee wise unto"
    },
    {
      "id": 86,
      "start": 2263.9199829101562,
      "end": 2271.1199645996094,
      "text": " salvation through faith which is in Christ Jesus. Wow. We think about the"
    },
    {
      "id": 87,
      "start": 2271.1199645996094,
      "end": 2277.0599670410156,
      "text": " impact of the the Word of God. These scriptures are holy scriptures, they're"
    },
    {
      "id": 88,
      "start": 2277.0599670410156,
      "end": 2280.9199829101562,
      "text": " from God, and you've known them, Timothy, from the time that you were a child"
    },
    {
      "id": 89,
      "start": 2280.9199829101562,
      "end": 2284.3199768066406,
      "text": " because of your mother and your grandmother and their faith, and"
    },
    {
      "id": 90,
      "start": 2284.3199768066406,
      "end": 2288.679962158203,
      "text": " they have diligently taught you the truth of the Word of God. And he says"
    },
    {
      "id": 91,
      "start": 2288.679962158203,
      "end": 2293.239959716797,
      "text": " this, he says that these scriptures, these holy scriptures, are able to make thee"
    },
    {
      "id": 92,
      "start": 2293.239959716797,
      "end": 2299.0399780273438,
      "text": " wise unto salvation through faith which is in Christ Jesus. Aren't you thankful"
    },
    {
      "id": 93,
      "start": 2299.0399780273438,
      "end": 2305.5999755859375,
      "text": " that the Word of God teaches us how to be saved? Where would we be without the"
    },
    {
      "id": 94,
      "start": 2305.5999755859375,
      "end": 2310.9599609375,
      "text": " instruction in the Word of God with regard to salvation? I am so thankful. I"
    },
    {
      "id": 95,
      "start": 2310.999969482422,
      "end": 2314.439971923828,
      "text": " quote it in the beginning of the message, for the wages of sin is death in Romans"
    },
    {
      "id": 96,
      "start": 2314.439971923828,
      "end": 2319.239990234375,
      "text": " 6 and verse 23, but the gift of God is eternal life through Jesus Christ our"
    },
    {
      "id": 97,
      "start": 2319.239990234375,
      "end": 2323.9599609375,
      "text": " Lord. You read the fifth chapter of the book of Romans and you'll find the"
    },
    {
      "id": 98,
      "start": 2323.9599609375,
      "end": 2328.6799926757812,
      "text": " impact of that disobedience of Adam upon all men, but then you read about the"
    },
    {
      "id": 99,
      "start": 2328.6799926757812,
      "end": 2332.9999389648438,
      "text": " obedience of the Lord Jesus Christ and the impact upon all that would trust him"
    },
    {
      "id": 100,
      "start": 2332.9999389648438,
      "end": 2337.9999389648438,
      "text": " as Savior. And what a wonderful truth and blessing that is. We continue and see"
    },
    {
      "id": 101,
      "start": 2337.9999389648438,
      "end": 2342.3199462890625,
      "text": " that he says in verse 16, all scripture is given by inspiration of God. It is"
    },
    {
      "id": 102,
      "start": 2342.3199462890625,
      "end": 2345.47998046875,
      "text": " profitable for doctrine, for reproof, for correction, for instruction in"
    },
    {
      "id": 103,
      "start": 2345.47998046875,
      "end": 2350.719970703125,
      "text": " righteousness, that the man of God may be perfect, throughly furnished unto all"
    },
    {
      "id": 104,
      "start": 2350.719970703125,
      "end": 2358.8399658203125,
      "text": " good works. I am thankful that God has given us instruction, that God has given"
    },
    {
      "id": 105,
      "start": 2358.8399658203125,
      "end": 2362.7599487304688,
      "text": " us commandments and statutes and judgments, that he has been faithful to"
    },
    {
      "id": 106,
      "start": 2362.7999877929688,
      "end": 2368.239990234375,
      "text": " provide us with the truth that we hold in our hands today. And as we understand"
    },
    {
      "id": 107,
      "start": 2368.239990234375,
      "end": 2373.3599853515625,
      "text": " the importance of this truth and the fact that the source causes it to be"
    },
    {
      "id": 108,
      "start": 2373.3599853515625,
      "end": 2379.1599731445312,
      "text": " important, that it's from God, it's God's Word. And when I understand the importance"
    },
    {
      "id": 109,
      "start": 2379.1599731445312,
      "end": 2383.239990234375,
      "text": " of it and I find that I must implement it in my own life, that I need to be a"
    },
    {
      "id": 110,
      "start": 2383.239990234375,
      "end": 2387.9199829101562,
      "text": " doer of the Word and not a hearer only, that I need to dig into this book and"
    },
    {
      "id": 111,
      "start": 2387.9199829101562,
      "end": 2391.8799438476562,
      "text": " find out what is it that God has for me. What are some commandments and some"
    },
    {
      "id": 112,
      "start": 2391.9999389648438,
      "end": 2395.8399658203125,
      "text": " statutes and some judgments? What are some things that God has given me? As I"
    },
    {
      "id": 113,
      "start": 2395.8399658203125,
      "end": 2400.7999877929688,
      "text": " look into the truth of God's Word and I allow the Word of God to examine me and"
    },
    {
      "id": 114,
      "start": 2400.7999877929688,
      "end": 2403.7599487304688,
      "text": " to show me in my life things that I need to stop doing."
    },
    {
      "id": 0,
      "start": 2403.7599487304688,
      "end": 2408.199948787689,
      "text": " doing and things that I need to start doing, and I seek to be obedient to His"
    },
    {
      "id": 1,
      "start": 2408.199948787689,
      "end": 2415.839948654175,
      "text": " Word first in my life. Then as parents, I think about this child dedication today,"
    },
    {
      "id": 2,
      "start": 2415.839948654175,
      "end": 2421.4799480438232,
      "text": " this baby dedication, as parents we have that great responsibility of teaching"
    },
    {
      "id": 3,
      "start": 2421.4799480438232,
      "end": 2427.159948348999,
      "text": " them the commandment, statutes, and judgments, teaching them diligently unto"
    },
    {
      "id": 4,
      "start": 2427.159948348999,
      "end": 2435.239948272705,
      "text": " our children. Listen, parenting is no easy job. Amen? Those of you that have"
    },
    {
      "id": 5,
      "start": 2435.239948272705,
      "end": 2439.7199478149414,
      "text": " children, parenting is not an easy job."
    },
    {
      "id": 6,
      "start": 2440.1999473571777,
      "end": 2449.5599479675293,
      "text": " Consistency is so vital. There are times, however, when we can be battle-weary, as"
    },
    {
      "id": 7,
      "start": 2449.5599479675293,
      "end": 2454.0399475097656,
      "text": " Brother Wagar mentioned in the ministry, but sometimes as parents we can become"
    },
    {
      "id": 8,
      "start": 2454.0399475097656,
      "end": 2458.079948425293,
      "text": " battle-weary. We got all kinds of things going on, life has been thrown at us, it's"
    },
    {
      "id": 9,
      "start": 2458.079948425293,
      "end": 2462.519947052002,
      "text": " been a tough week, it's been all sorts of, and we just, and I just don't, I just"
    },
    {
      "id": 10,
      "start": 2462.519947052002,
      "end": 2467.959945678711,
      "text": " don't have the energy for this, but we understand the importance and we pray"
    },
    {
      "id": 11,
      "start": 2467.959945678711,
      "end": 2473.35994720459,
      "text": " and we ask God to give us the energy and the strength, the determination to teach"
    },
    {
      "id": 12,
      "start": 2473.35994720459,
      "end": 2478.459945678711,
      "text": " diligently the Word of God to our children. Why? Because we understand the"
    },
    {
      "id": 13,
      "start": 2478.459945678711,
      "end": 2483.879951477051,
      "text": " impact of the instruction. We understand this morning that as we would teach"
    },
    {
      "id": 14,
      "start": 2483.879951477051,
      "end": 2490.3199462890625,
      "text": " the Word of God, that we would take and give to a future generation, that they"
    },
    {
      "id": 15,
      "start": 2490.3199462890625,
      "end": 2499.35994720459,
      "text": " will set their hope in God. It's our responsibility, and we must grab hold of"
    },
    {
      "id": 16,
      "start": 2499.35994720459,
      "end": 2505.959945678711,
      "text": " and take seriously the responsibility that is before us, and what a great"
    },
    {
      "id": 17,
      "start": 2505.959945678711,
      "end": 2512.1599502563477,
      "text": " truth that God has given us in His Word. Thou shalt teach thy children. Let's"
    },
    {
      "id": 18,
      "start": 2512.199951171875,
      "end": 2515.919952392578,
      "text": " pray. Father, we love you, we thank you for loving us, we thank you for the"
    },
    {
      "id": 19,
      "start": 2515.919952392578,
      "end": 2519.799949645996,
      "text": " opportunity that you've given us to gather together this morning, we thank"
    },
    {
      "id": 20,
      "start": 2519.799949645996,
      "end": 2523.6399459838867,
      "text": " you for the truth of thy Word, and we thank you that you have been faithful to"
    },
    {
      "id": 21,
      "start": 2523.6399459838867,
      "end": 2528.399948120117,
      "text": " provide us with instruction, and what a what a wonderful blessing it is to have"
    },
    {
      "id": 22,
      "start": 2528.399948120117,
      "end": 2534.199951171875,
      "text": " the Word of God, and that we can open the Scriptures and we can understand what"
    },
    {
      "id": 23,
      "start": 2534.199951171875,
      "end": 2539.43994140625,
      "text": " you've commanded us, that we can prove what is acceptable unto the Lord, that as"
    },
    {
      "id": 24,
      "start": 2539.5199432373047,
      "end": 2543.999954223633,
      "text": " we find that truth in the book of Ephesians, and we understand the"
    },
    {
      "id": 25,
      "start": 2543.999954223633,
      "end": 2548.919952392578,
      "text": " importance of proving what is acceptable, that we can allow your Word to be the"
    },
    {
      "id": 26,
      "start": 2548.919952392578,
      "end": 2555.919952392578,
      "text": " guide and the lamp that you've designed it to be. I pray that a future generation"
    },
    {
      "id": 27,
      "start": 2555.919952392578,
      "end": 2562.7599487304688,
      "text": " would set their hope in God, not forget the works of God, keep His commandments."
    },
    {
      "id": 28,
      "start": 2562.7599487304688,
      "end": 2567.5599517822266,
      "text": " We thank you for these three families that have expressed their desire this"
    },
    {
      "id": 29,
      "start": 2567.5999450683594,
      "end": 2572.479949951172,
      "text": " morning to dedicate their children to thee, Lord, and I thank you for their"
    },
    {
      "id": 30,
      "start": 2572.479949951172,
      "end": 2577.6399536132812,
      "text": " desire to do that, but Lord, we understand in a greater sense the"
    },
    {
      "id": 31,
      "start": 2577.6399536132812,
      "end": 2582.7999420166016,
      "text": " commitment that they're making to bring up their children in the nurture and"
    },
    {
      "id": 32,
      "start": 2582.7999420166016,
      "end": 2587.199951171875,
      "text": " admonition of the Lord. I pray for every family that's here, for every individual"
    },
    {
      "id": 33,
      "start": 2587.199951171875,
      "end": 2590.7999420166016,
      "text": " that's present this morning, God would you help us to be doers of the Word and"
    },
    {
      "id": 34,
      "start": 2590.7999420166016,
      "end": 2595.8399505615234,
      "text": " not hearers only. We need a return to your Word, we need to understand the"
    },
    {
      "id": 35,
      "start": 2595.8399505615234,
      "end": 2601.1199493408203,
      "text": " importance of allowing this book, the truth contained therein, to influence our"
    },
    {
      "id": 36,
      "start": 2601.1199493408203,
      "end": 2607.479949951172,
      "text": " behavior, to guide our steps, no longer being influenced by society and by"
    },
    {
      "id": 37,
      "start": 2607.479949951172,
      "end": 2615.0399475097656,
      "text": " culture, not allowing them to determine right and wrong, but we'd look to your"
    },
    {
      "id": 38,
      "start": 2615.0399475097656,
      "end": 2623.959945678711,
      "text": " Word and determine with clarity what thus saith the Lord, and then follow you."
    },
    {
      "id": 39,
      "start": 2624.0799560546875,
      "end": 2628.479949951172,
      "text": " I pray that you'd move and work as only you can, for it's in Christ's name we pray,"
    },
    {
      "id": 40,
      "start": 2628.479949951172,
      "end": 2631.479949951172,
      "text": " amen."
    }
  ],
  "processed_at": "2025-04-17T03:14:16.882699"
}