{
  "video_id": "Ufw5LOw3rkA",
  "text": "Chapter number 10, verses 26 through 39, we're gonna try to finish this 10th chapter this morning. And I am so thankful for the book of Hebrews. I'm thankful for the opportunity that we've had so far in 2020 to study through the book of Hebrews. And we actually, in this particular passage of scripture, we'll end a particular section of the book of Hebrews. We'll end that section dealing with the superiority of the priesthood of the Lord Jesus Christ. And so as we think about the book of Hebrews and we think about how it proves to us the superiority of Christ, we also must acknowledge this morning that it reveals to us that biblical Christianity also is superior. Now understand what I mean when I say that and don't make any judgments at this point. Let me explain what I mean. When we consider the fact that what the writer of Hebrews is giving to these original recipients, of course, they were Jewish people that had been saved and there was this consideration, this immense amount of pressure to go back to Judaism. And so throughout the book of Hebrews, we're finding that Christ is better, he's superior. And we began that in chapter number one, we're going through that and we're dealing with the fact that he is superior. And we understand that really the application of such is therefore, if Christ is superior or since Christ is superior, that biblical Christianity in like fashion is superior. It is superior than what Judaism could offer you. It's superior to what that which was a shadow of good things to come could offer you. Now we must be careful, you notice that I use the terminology biblical Christianity. We must acknowledge this morning that all that is called Christianity does not line up with the Bible. The term is used very loosely. In fact, many people will use the term Christendom and they'll refer to themselves as being Christians and Christianity and what have you. But we understand this morning that is absolutely imperative that we as Bible believing Christians, that we follow the instruction given in the word of God and that our beliefs and behavior are aligned properly. Now we understand that as we go through and looking at the society in which we're living, in fact, you can see it all throughout history, the church in Corinth faced this and unfortunately they failed miserably. But there's a grave danger in watering down the clear teachings of God's word. There is a clear danger in having this understanding that the enemy would tell us and would like us to believe that it would be necessary for us to adapt so that we can be more relevant and so that we can have a greater impact. But I say baloney on that, amen? And that's not good Greek nor Hebrew, but the reality is that as we look at the truth of the word of God, Jesus Christ is the head of the church. He said that this is my church. He said, I will build my church. And we understand that there is this pull. There's this constant pull to waver and to water down and to become more accommodating, if you will. But the reality is that God has called us to be different. God has called us to make a difference. And we understand that as we look at the truth of the word of God, when we consider biblical Christianity, that it is imperative that we align with what God's word teaches. We do not want to waver from what the clear teaching of God's word is. We must stand where God stands, amen? I understand that's not super popular today. I understand that today we're living in the midst of a generation that wants to be able to waver and move and sway and so on and so forth and water down some of the teachings of the word of God, but we must understand that it is imperative that we follow the instruction of God's word. Now, let me say this. It is important that we understand that yes, Christ is superior, therefore biblical Christianity is superior, but we need to be careful that that perspective does not lead us to a place of pride. Can I tell you there's a danger in that? There's a danger in thinking, I'm right, I'm better, I have something that's superior, and therefore we elevate ourselves, and that's a huge danger. What we must acknowledge this morning when we consider the fact that those that have gone before us have faithfully preached the truth of the word of God and they've delivered it to us, and then we have a responsibility to deliver that to a next generation, what we do is we don't allow that to lead us to a place of pride, but it leads us to have grateful hearts. It leads us to have an understanding of what our responsibility is. Amen? We understand that we live in a world that's approaching a population of nearly eight billion people. It's amazing when you consider that a vast majority of the number of inhabitants upon the earth today have never even heard the name of the Lord Jesus Christ, nor understood the clear presentation of the gospel. It's becoming more and more common even here in the United States of America to meet people, to interact with people that have never heard the truth of God's word. Again, because we understand biblical Christianity, because we've been saved, doesn't make us come to this place of having this prideful air about us, but it should cause us to recognize the deep responsibility that has been given to us to deliver a message to a lost and dying world. Remember the principle Jesus taught this, we find it throughout the word of God, to whom much is given, much is required. Amen? As we think about these believers that are being written to and we consider all that has gone through in this particular section that we've been studying for a number of weeks now, really beginning in chapter number five, with the superiority of the priesthood of the Lord Jesus Christ, we conclude that section here this morning at the end of chapter number 10. Let me read a verse of Scripture for you. We'll get through the entire passage, but let me draw your attention to verse number 37. The Bible says this, for yet a little while, and he that shall come will come, and will not tarry. Aren't you thankful for that truth? This morning if you're taking notes, I've simply entitled the message, he that shall come will come. We notice that the Scripture says yet a little while. Many have said, how long is a little while? You can look in the Greek, you can look in anywhere. A little while is a little while. It's an unstated period of time. We find that Peter will use similar expression at the end of his first epistle in 1 Peter chapter number five. He says, after that you have suffered a while. And we understand here that a little while, we don't know the period of time, but we do know that Jesus is going to return right on time. Amen? And just as he came the first time, when the fullness of time was come, God sent forth his son. We understand that in the book of Galatians. We see the incarnation as you read through and study the Gospel records. And this morning when we are reminded of this truth, that Jesus is going to come and his time is perfect. He's never been late. He's seldom early, right? He's right on time. And what a joy to understand that truth. Let's dig into the passage this morning. If you're taking notes, number one, I want you to notice what is explained. In verses 26 through 31, these individuals that are being written to are given some explanation. Notice in verse 26, it says this, for if we sin willfully after that we have received the knowledge of the truth, there remaineth no more sacrifice for sins, but a certain fearful looking for of judgment and fiery indignation which shall devour the adversaries. He that despised Moses' law died without mercy under two or three witnesses. Of how much sorer punishment, suppose ye, shall he be thought worthy who hath trodden underfoot the Son of God and hath counted the blood of the covenant wherewith he was sanctified an unholy thing and hath done despite unto the Spirit of grace. For we know him that hath said, vengeance belongeth unto me. I will recompense, saith the Lord. And again, the Lord shall judge his people. Notice verse 31. It is a fearful thing to fall into the hands of the living God. We understand that we serve the Lord God Almighty, that he is omnipotent, that he ever liveth to make intercession for us. And we understand the sacrifice that was made by the Lord Jesus Christ when he offered himself. And we notice what is being explained. First of all, I believe that we see the efficacy of Christ's blood. That word means that it's efficient, it's effective to bring about the desired end. And we understand this morning that it has the power, the blood of Jesus Christ has the power to change lives, to save souls. And we understand there's power in the blood. We sing about that truth and we look at the word of God and we understand that he's gone through these last several chapters dealing with the offering of the Lord Jesus Christ and how the blood of those bulls and goats that was offered throughout the Old Testament, that Old Testament, sacrificial system that it was a picture, it was a type, it could never bring about the salvation that the blood of Jesus Christ brings about. There was a constant reminder of sin with that Old Testament sacrificial system, but with that one sacrifice for sins forever, when Jesus, God in flesh, offered His precious blood, He died, was buried, and rose in victory, He accomplished what was that that was set out to be accomplished, and that is the redemption of mankind. We understand this morning that the Bible tells us in verse number 18, now where remission of these is, there is no more offering for sin, and we spoke about the fact that in what Christ's offering provided for us was remission, not that remembrance of the Old Testament sacrificial system, and we can rejoice in that truth. The precious blood of the Lord Jesus Christ is the only payment that is acceptable for the sin debt of mankind. You believe that this morning? Notice what he says at the end of verse number 26, there remaineth no more sacrifice for sins. There's nothing else that can be offered that can take care of your sin debt. Nothing. Jesus's blood, that's it. The reality this morning is that when we speak about the blood of the Lord Jesus Christ, we speak about it and hold it in great reverence of understanding what it is that Jesus did for us. I'm so thankful this morning that He was willing to shed His precious blood, and that we have the privilege of speaking about, teaching about, singing about, sharing with others the truth of the redemption through the blood of Christ. There are a number of people in our world today that have the understanding that there's some other form of payment that is acceptable for their redemption. There are people that think that they can follow some creed, there are people that think they can do some deed, and that through these particular things they can find, can obtain, redemption. My friends, they've been sold a bill of goods. They have been deceived by the God of this world who has blinded the minds of them which believe not, lest the light of the glorious gospel should shine in unto them. We speak with people regularly. I hope that you have the opportunity regularly to interact with individuals, and I understand things have been different here in 2020 with COVID and all that's going on, but we understand this morning that God still gives divine appointments, God still uses His people, and as we have opportunity to be His spokesman, to be His representative, His ambassador, that we can speak to people. And I guarantee that as you would go out this week, and if you would purpose in your heart and in your life to confront some people about their need for Jesus, that you will meet some people that believe that by being a good person, by following some religious creed, that they can have salvation. My friends, Jesus paid it all. There's no other sacrifice for sin. There's nothing else that could atone for the sin of mankind. I'm thankful that someone gave me that truth. I hope this morning that you're thankful that someone's given you that truth, that we can understand that it's been settled. We sing that song, the old account was settled long ago, right? Why? Because I came to the Lord Jesus Christ understanding that He is God, and that He went to that cross and He paid for my sin with His precious blood. He was buried and He rose again, conquering sin, death, and the grave. The efficacy of Christ's blood. We notice that He then quickly goes into an example from Old Testament Israel. Notice what He says in verse number 28, He that despised Moses' law died without mercy under two or three witnesses. And so immediately in verse number 28, again understanding the original recipients to the book of Hebrews and understanding their knowledge of the Jewish history in Old Testament Israel, they would be able to quickly relate to what is being said here. And it's important that we'd understand that the law required many sacrifices and offerings, did it not? You read through Old Testament law, you read through all of those offerings, in fact Hebrews 10 was dealing with that. In verse number 11, and every priest standeth daily ministering and offering oftentimes the same sacrifices which could never take away sins, but they were following that which had been prescribed. They were bringing the appropriate sacrifice or offering, but we understand that though they would have some level of knowledge of these requirements, in fact many of them, no doubt in my mind, had practiced many of these things before they came to Christ. However, as the writer of Hebrews will say here in verse number 28, He that despised Moses' law died without mercy under two or three witnesses. What he's saying is that there were certain offenses that demanded that the offender be put to death. There was no sacrifice that could be brought for that particular offense, rather the offender had to be put to death. Let me share two examples with you. Number one is that of adultery. Look in Leviticus chapter number 20. I use that example because we understand that Jesus was confronted with that in John chapter number eight. You remember in John chapter number eight that they come to Jesus. Turn over to Leviticus 20, I'm going to just remind you of the event that took place in John chapter number eight when Jesus is there and those men come and they say, hey, we've caught this woman in the very act of adultery. She is to be put to death. That's what the law says. What say ye? You remember the account, right? Jesus bends down, He begins to write in the sand, and then all of a sudden all of the accusers are gone. Right? You remember John 8. What they're referring to, those folks that came, was this truth in Leviticus. Notice in chapter 20 in verse number 10, and the man that commit adultery with another man's wife, even he that committeth adultery with his neighbor's wife, notice what it says, the adulterer and the adulteress shall surely be put to death. There was no prescribed offering that they would bring for that offense. The offender was to be put to death. Not only that of adultery, but think about idolatry. Turn to the book of Deuteronomy, if you will, in chapter number 17. Now we understand that the nation of Israel was very often guilty of the sin of idolatry. Amen? You see it throughout their history. In fact, we live in a society today where many people are idolatrous. In fact, it's been interesting to me that in 2020, here in the United States of America, through this pandemic, that many of the idols that Americans served have been dealt with. What do I mean by that? Well, sports took a backseat in a hurry, did it not? You can't tell me this morning that sports is not an idol for many people in our land. We could continue to go on and deal with other examples, but we understand this morning that John says that little children, keep yourself from idols. We may not have some graven image as some other societies have, but we have idols and we understand that an idol is anything that takes the place of God, anything that is in front of God. The reality this morning is that Paul said this in the book of Colossians in chapter 1 and verse number 18, that in all things he, speaking of the Lord Jesus Christ, must have the preeminence. When we understand all that he's done for us, we would understand the unique opportunity that we have to live for him. Deuteronomy 17, notice in verse number 1, thou shalt not sacrifice unto the Lord thy God any bullock or sheep wherein is blemish or any evil favoredness, for that is an abomination to the Lord thy God. If you want to do a study on your own, mark Deuteronomy 17 and study the book of Malachi with it. You'll be overwhelmed with joy as you begin to see how God had warned them of these things and then confronts them with their evilness. They're saying, well we are bringing offerings, yeah, but he is a great king and they were bringing offerings that were not acceptable. In fact, in Malachi he says, you wouldn't even take it to your governor but yet you offer it to me. Go study it, it's a fascinating study. In verse number 2, if there be found among you within any of thy gates which the Lord thy God giveth thee man or woman that hath wrought wickedness in the sight of the Lord thy God and transgressing his covenant and hath gone, notice what it says, and served other gods and worshiped them either the sun or moon or any of the host of heaven which I have not commanded and it be told thee and thou hast heard of it and inquired diligently and behold it be true and the thing certain that such abomination is wrought in Israel then shalt thou bring forth that man or that woman which have committed that wicked thing unto thy gates even that man or that woman and shalt stone them with stones till they die at the mouth of two witnesses or three witnesses shall he that is worthy of death be put to death but at the mouth of one witness he shall not be put to death and so we understand that as we're here in Hebrews chapter number 10 and we see how that this example of Old Testament Israel is being used and no doubt they would be able to quickly relate back to these truths from the Pentateuch. You could jot down in your notes Numbers chapter 15 verses 30 and 31 and reference that as well and see how that he's dealing with this truth. Remember, throughout the book of Hebrews the writer often refers back to the Old Testament. We have found on many occasion that he refers back to the Old Testament and takes a messianic prophecy and applies it properly to the Lord Jesus Christ. And we find that he's used the Old Testament because they were familiar with the Old Testament. I'm bothered deeply when people today would say something like this, we're New Testament believers, we don't need the Old Testament, we've made a grave mistake. There are people that believe that, there are people that that operate in that fashion, oh we don't really need the Old Testament, we're New Testament believers. But Paul said that the Old Testament, the things that were written before time were written for our admonition, for our benefit, amen? And so we understand here as we continue in looking here at this example from Old Testament Israel, we see the the judgment, remember what he says in verse 28, that they died without mercy under two or three witnesses. Then notice how he makes the application of how much sore punishment, suppose ye, shall he be thought worthy who hath trodden underfoot the Son of God, and hath counted the blood of the covenant wherewith he was sanctified an unholy thing, and hath done despite under the Spirit of grace. To despise something is to have the lowest opinion of something. And we notice here in verse number 29, he is using this application, this illustration of Old Testament Israel, and saying, look, they died without mercy, but what if somebody rejects that which Christ has offered? They despise the blood of the Lord Jesus Christ, he's already dealt with the efficacy of Christ's blood, and now these ones that they, he says, how much sore or punishment, suppose ye, shall he be thought worthy who hath trodden underfoot the Son of God. To be exposed to the truth and to reject it, to be confronted with the teaching of biblical Christianity, to understand what Jesus Christ did on the cross of Calvary, paying for your sin once and for all, not to have this attitude of, let me consider that, or thinking about it, but saying, nope, I'm rejecting that. Oh, that's a dangerous place. There's no other sacrifice, and you're gonna face the judgment of God. The reality is, we understand as we compare Scripture with Scripture and look throughout the whole of God's Word, that that penalty is the second death. It is torment forever in the lake of fire. Notice verse 30, and it says this, for we know him that hath said, vengeance belongeth unto me, I will recompense, say it the Lord, and again, the Lord shall judge his people. Deuteronomy 32 verses 35 and 36 are in view here as he quotes this in verse 30. Notice he says, it is a fearful thing to fall into the hands of the living God. It's interesting, Peter says this, you can jot down the reference, I'll read it for you, in 2 Peter chapter number 2, in verses 20 through 22, it says, for if after they have escaped the pollutions of the world through the knowledge of the Lord and Savior Jesus Christ, they are again entangled therein and overcome, the latter end is worse with them than the beginning. For it had been better for them not to have known the way of righteousness, than after they have known it, to turn from the holy commandment delivered unto them. It says, but it has happened unto them according to the true proverb, the dog has turned to his own vomit again, and the sow that was washed to her wallowing in the mire. We understand throughout the Word of God that there are false teachers, there are people that pretend to outwardly identify as being followers of the Lord Jesus Christ. In fact, if you read the book of Jude, you understand that Jude says it's necessary for me to write these things unto you, that you earnestly contend for the faith. Why? In verse number 4, he says that there are certain men that have crept in unawares, unawares. And here's what he says that those individuals do, he says that they turned the grace of our God into lasciviousness, and they denied the only Lord God and our Lord Jesus Christ. That lasciviousness is unbridled lust. And we find here that we notice that the author of Hebrews is explaining some very important truth to these that he's writing to. Listen, there's no place to go. Who are we gonna go? Remember what Peter said when all of them forsook him? They all forsook the Lord, and we find that as they're there and Jesus speaks to them, it's recorded for us in John chapter number 6 at the end of the passage, many people left and they deserted them. And Jesus says, will you also go away? And Peter stands up in John 6 and verse number 68, and he says to whom? He says this, Lord, to whom shall we go? Thou hast the words of eternal life, and we believe and are sure that thou art that Christ, the Son of the living God. We notice not only what was explained as we continue looking at the passage of Scripture in Hebrews, notice what they endured. Number two, notice what they endured. Verses 32 through 35 reveal to us some of that which they suffered because of their conversion. It says this, but call to remembrance the former days. And so we see that there's a reminder here of what had been experienced, what they endured. It says this, in which after you were illuminated, ye endured a great fight of afflictions. We notice the afflictions of these individuals that is mentioned here in verse number 32, a great fight of afflictions, these sufferings. We understand that Peter, in fact, would write the book of 1 Peter to those that were suffering, those that were dealing with hardship and difficulty because of the very fact that they identified with the Lord Jesus Christ. This morning, for most of my lifetime and most of your lifetime in the United States of America, we have not really suffered because of our identifying with the Lord Jesus Christ. Amen? We find that there are folks around the globe that suffer greatly because they've identified with the Lord Jesus Christ. It was a very common thing in the first century that as they would identify with the Lord Jesus Christ, you find this still in many countries around the world today, that if you were to identify with the Lord Jesus Christ that your family would consider you dead. Because you have forsaken whatever your original religion was, and many nations around the world would look at their culture and religion being one in the same. And in those particular countries around the world, you find that believers face great levels of persecution and great levels of suffering simply because they've identified with the Lord Jesus Christ. When I trust that Christ is my Savior, there were people that were rejoicing. Honestly. And I'm going to assume this morning that when you trust that the Lord Jesus Christ is your Savior, that there were people that were rejoicing. Tomorrow is my spiritual birthday. I love being mindful of the day in which I trust that the Lord Jesus Christ is my Savior. It was 23 years ago tomorrow. And I'm so thankful. And there was rejoicing just a few weeks ago on a Sunday evening. We had a baptismal service, and we baptized three young men. And we were rejoicing. We were thankful for their following the Lord in believers' baptism. Amen? It doesn't happen in some nations around the world. And that wasn't a common thing in the first century. Yes, there'd be some that would rejoice, but we know that there'd be some that would say, they're dead to me. You know that those that had shops and various types of services, that if you identified with Christ, people would stop buying from you. They would try to starve you. Do you know that the raw materials that you would need for whatever occupation it was that you were engaged in, that those suppliers of those raw materials in many cases would stop selling to you. So that you would not have the ability to even make what you had been making. Yet alone do you have those that would not buy from you, but now you can't even get the raw materials that you need. It was a terrible situation. But God took care of them. That's why you see so often in the New Testament this truth about using hospitality and loving the brethren. And we often say that our brothers and sisters in Christ, that we have this bond. I'm so thankful for it. We can enjoy fellowship one with another. Why? Because our common bond is the Lord Jesus Christ. We notice that it says here in verse number 32, but call to remembrance the former days in which after you were illuminated you endured a great fight of afflictions. Notice this, partly, part of what you suffered whilst you were made a gazing stock both by reproaches and afflictions. And that idea of being a gazing stock is a spectacle. He says here, notice what it says as we continue in verse number 33. It says, and partly whilst you became companions of them that were so used. We see there not only afflictions that they endured, but were mindful here of their compassion as it kind of goes into verse number 34. It says, for you had compassion of me in my bonds. The compassion that they had towards those that were persecuted, to those that were in prison. We understand the Apostle Paul often faced imprisonment. In fact, in a number of the letters that Paul penned under the inspiration of the Holy Spirit of God, he penned from a prison. He mentions how We saw that specifically in the book of Philippians to the believers at Philippi, how they communicated with Him once and again as you read Philippians 4. We see here that they had compassion. Notice what it says. This is an interesting phrase in the middle of verse 34. \"...And took joyfully the spoiling of your goods.\" It's interesting to me that they took it joyfully. The spoiling of your goods. You might take it and be disappointed. Be overwhelmed. What are we going to do? I can't believe this happened. But they took it joyfully. Why? Because of some knowledge that they had. Look at the end of verse 34. \"...Knowing in yourselves that ye have in heaven a better and an enduring substance. Lay up for yourselves treasures in heaven, where neither moth nor rust doth decay.\" And what a joy to think about the fact that these individuals, how could they deal with the spoiling of their goods joyfully because they had an understanding that this world is not my home. I'm just a passing through. I'm not suggesting, listen, if you weren't here Wednesday night, you weren't tuned in on live stream, listen to the message. I trust it'll be a blessing to you. It's on YouTube. It's on our website. And as you think about that message, I spoke about the fact in Acts 4 that they had been with Jesus. And I said this in the message, and I believe it's so important for us to understand that being with Jesus does not prevent the hardship, but it certainly will help you be prepared for the hardship. Amen? These folks, they had, man, this world's not my home. I'm just passing through. I'm looking upward. I'm looking for my Savior. I'm looking for heaven. Amen? And we find here that he goes and we understand their confidence. We see that here in verse number 35. Cast not away therefore your confidence, which hath great recompense of reward. I remember back last Sunday morning, we looked at verse 23. Let us hold fast the profession of our faith. And remember it says without wavering. Having that confidence of that assurance. Why? Because he is faithful that promised. Remember, biblical Christianity is not pie in the sky. Let's hope everything's gonna work out. No, we're basing it upon revealed truth that Jesus has given us in His Word. And we're taking God at His Word. What does it mean to live by faith? To believe God. To trust Him. To have nothing wavering. Why? Because I know that He that is promised is faithful. And they could endure the things that they endured because of their understanding. Because they had an understanding of who Christ is. An understanding of their eternity. What a joy to see those that have gone before us that have suffered greatly that remain faithful. It's a challenge to me. It really is. I'm challenged often when I read about those that have gone before us and have been faithful and suffered great afflictions. Great difficulties. And yet they remain faithful. God's used them. What a joy. We notice that there's, as we begin this passage, we notice what is explained. We notice what they endured. Now I want you to see as we wrap up in verses 36 through 39, number three this morning, notice how they were encouraged. Notice how they were encouraged. You know, people need encouragement. You know that? There are times in which you need encouragement. You say, oh, not me, I'm always positive. There are times that you need encouragement. Amen? There are times that we all need to be encouraged. Can I tell you that the Word of God, the Word of God is powerful. It's precious. It's unique. The reason that I say the Word of God is unique is because I can read this book and in a sitting of reading the Word of God and a time of sitting and hearing the preaching of the Word of God, God can use His Word to convict me. Amen? God can use His Word to challenge me. To bring me to a place of decision. But at the same time, He can use the same Word to comfort me and to encourage me. It's amazing how that God can use His Word in so many ways in our lives. And we find that as we wrap up the 10th chapter of the book of Hebrews, that there is some encouragement. We notice how these recipients would be encouraged by that which they have received. I believe that there's a two-fold aspect of the encouragement. Number one, they are encouraged with a promise. I'm thankful for the promises of God's Word, aren't you? In fact, we understand that even as the ladies sang this morning, that they sang a little bit about the promises, right? About understanding that God has promised these things and God will not falter. The end of that first verse, thank you for typing it out. I could reference it. Your promises are ever new. I claim them for today. Peter said that they're exceeding great and precious promises, amen? And we can look at the promises of God's Word and they bring us encouragement. They give us hope. They give us reason and purpose. And we see here in verses 36 and 37, the first way in which they're encouraged is with this promise. It says in verse number 35, we just finished up and you kind of see how it segues right into verse 36. Cast not away therefore your confidence, which hath great recompense of reward, for ye have need of patience, that after ye have done the will of God, ye might receive the promise. And then he says this, we used it as our title this morning, for yet a little while, and he that shall come will come and will not tarry. Have you ever heard somebody say that the Lord's gonna tarry His return? You ever heard anyone say that? If the Lord does not tarry. You never heard anyone say that? I've heard it so many times. If the Lord does not tarry. You know what the word tarry means? It means to delay. It means to linger. The Word of God says that He will not tarry. So we don't have to say if the Lord tarries His coming. No, He's not going to. Based upon the authority of the Word of God, it says He will not tarry. For he that will come or shall come will come. For he that shall come will come. And we see that, and we don't know the time of His return, but we know that He promised that He was going to come back. Can I tell you this morning that the promise of Christ's return brings me encouragement? It really does. As we daily live with the understanding that today could be the day, as we daily understand that Jesus, my Savior, He's coming back, it gives me encouragement. Why? Because this is not all there is. Aren't you happy for that? I mean, seriously. I am so thankful that this world is not all, it's done and over with. No, no, no. We have heaven. Now, He's richly blessed us while we're here upon this earth. I'm so thankful that He's given us all these wonderful blessings, and He's blessed us with all spiritual blessings in heavenly places. But I understand this morning that the promise of the return of the Lord Jesus Christ, how this promise encourages the people of God. Remind yourself of it often. Do you remember in John chapter number 13, Jesus is telling the disciples, we often reference how that Jesus tells them that He gives them a new commandment at the end of the passage, that they're to love one another as He loved. And He tells them how that He was going to be leaving, right? He's going to the cross. He's explaining to them the events that are going to unfold in just hours and days ahead. And we understand that then He says to start the 14th chapter, I understand chapter and verses have been inserted after, so you think about the dialogue. He says this, let not your heart be troubled. Why was their heart troubled? Because of the things that they had just heard. Because of the fact that He was departing and where He was going, they could not come. And they didn't understand all of these things. Remember, after the resurrection, the Gospel accounts reveal to us that they remembered these things. You know, there's a danger in the midst of difficulty that we forget some things. Amen? We're overwhelmed with all that's going on and we're kind of living under the circumstances, if you will, and we forget the promises of God. And Jesus says, let not your heart be troubled. You believe in God, believe also in Me. In My Father's house are many mansions. If it were not so, I would have told you. He says this, I go to prepare a place for you. And if I go and prepare a place for you, I will come again and receive you unto Myself that where I am, there ye may be also. What a joy. In 2 Peter 3, there's scoffers and mockers. They're saying, where is His coming? All things remain the same. This they're willingly ignorant of, and we see that. But then we find that Peter says, the Lord is not slack concerning His promise, as some men count slackness. But as longsuffering to us, we're not willing that any should perish, but that all should come to repentance. In 2 Peter 3, verse number nine. Listen, the Lord is not slack concerning His promise. And we find that as these recipients would be encouraged, they're encouraged through this promise of the return of the Lord Jesus Christ, for yet a little while, yet a little while. and he that shall come will come and will not tarry.\" I'll be honest with you this morning, I hope he comes in my lifetime. I really do. I think of a wonderful thing. Not only a promise, but I believe he encourages them with a principle. Notice v. 38 and 39. Now the just shall live by faith, but if any man draw back, my soul shall have no pleasure in him. We are not of them who draw back unto perdition, but of them that believe to the saving of the soul. The principle that is given is really a reference back to the book of Habakkuk. In Habakkuk 2, verses 3 and 4, this truth of the just shall live by faith. And we find that this Old Testament principle is used by the Apostle Paul as he's speaking to those in Rome. The book of Romans references the just shall live by faith. The emphasis in the book of Romans is the just. How are we justified? Through faith. The book of Galatians deals with the just shall live by faith. And I believe in the book of Galatians, faith is what is emphasized there in the book of Galatians. Again, they're dealing with those folks there that were converted during the first missionary journey as the Apostle Paul went out from the church at Antioch and they were able to go and see people saved in the region of Galatia. And what a blessing, but there were some Judaizers that came in that said, hey, you have to keep doing these things and unless you're circumcised after the law of Moses, you cannot be saved. I mean, they go through all of these things and the just shall live by faith. I'm saved by faith. Here, he says, now the just shall live by faith. But if any man draw back, notice my soul shall have no pleasure in him. But we are not of them who draw back unto perdition, but of them that believe to the saving of the soul. No retreat, no drawback, amen. Onward, Christian soldier. That's what the songwriter said, isn't it? Amen. We're going onward and forward. The book of Joshua, forward by faith, really is an idea of that book. And you understand here, I believe that the emphasis in the book of Hebrews of this Old Testament principle the just shall live by faith. I'm thankful that I've been saved by faith. I'm thankful that I'm now justified and I'm redeemed. I've been reconciled to the Lord because of His precious blood, but I'm to live by faith. And we think about the theme of the book of Hebrews as we got there in chapter number six. Remember the idea of chapter number six, let us go on. Right, that's what he says. Go back to chapter six in verse number one and notice what he says. Remember, he was dealing at the end of chapter number five. He was ready to get into all of the truth with regard to Melchizedek, but he says you're not ready to receive these things. Why? Because you're slow of learning. You're dull of hearing. And he goes through and he gives this admonition, but he says in verse number one of chapter six, therefore, leaving the principles of the doctrine of Christ, let us go unto perfection. Let us go on. Let us continue. Let us, we find here, live by faith. Notice it says that if any man draw back, my soul shall have no pleasure in him. Listen, the fact of the matter is that when we live by faith, we please God. In just a few verses, a verse that I personally commonly reference and rehearse for you is found in Hebrews 11 six. Without faith, it is impossible to please Him. For he that cometh to God must believe that He is a rewarder of them that diligently seek Him. And so here we find that these folks are being encouraged by this promise that Jesus is coming. They're encouraged by this principle that we're to live by faith. We're not to draw back. We are of them, I love how verse number 39 ends, but of them that believe to the saving of the soul. We believe. Remember, Paul stood in Acts 27 and said, I believe God. I've often said, belief impacts behavior. That's why the just shall live by faith. What you believe will impact your behavior. How you behave will reveal what you believe. It's a two-sided coin. And this morning, this principle is given, I believe that it's a great introduction to the content that we find in Hebrews chapter 11, right? The great hall of faith. This one by faith and that one by faith and this one by faith. And here we find that as the people of God today that we too are to live by faith. Trusting God, believing Him. We're in Genesis chapter number 12. We studied the first nine verses last Sunday evening. We'll study verses 10 through 20 this evening. And we see that Abram, he exercised faith. He believed God. God said, nope, not in Haran. You're not staying here. He had already traveled from the ear of the Chaldeans up to Haran. Nope, this isn't the place. And he travels down the Canaan. And what a joy to see his faith and obedience. And this morning as the people of God, we are encouraged by this principle that the just shall live by faith. We don't live by sight. We live by faith. It does not mean that we are not aware of the surroundings and the things that we deal with in our life. It just means that our perspective is heavenward. It means that we're not looking at these things which are temporal, but at those things which are eternal. Second Corinthians four, verses 17 and 18. And you notice how the Apostle Paul, he makes note of the importance of having that eternal focus. It's a truth that we find there in the epistles as he's writing in the book of Colossians in chapter number three. If ye then be risen with Christ, seek those things which are above, where Christ is on the right hand of God. Set your affection on things above, not on things of the earth. Why? Because the just shall live by faith. This world is not my home. I'm so thankful for that. As we wrap up Hebrews chapter number 10 and really wrap up this entire section that's covered from chapter five all the way through chapter number 10, that the Lord Jesus Christ is superior in regard to his priesthood. He's superior to the Aaronic, the Levitical priesthood that they were so familiar with. Why? Because he's of a higher, a better priesthood. He's that of Melchizedek. We studied all of that and understood that. We find that he served in a better place. He offered a better offering. He presented a better offering when he offered himself. He accomplished in one offering for sin forever what those Old Testament sacrifices could never do. This morning, we wrap up chapter number 10 and we understand this truth. There's no other offering. It's only the blood of Christ. The efficacy of Christ's blood. This morning, it's imperative that we understand that it's only the blood of Christ. We can't, there's no other way to come, right? What did it say? We see the understanding after the children of Israel when they're going through all of those plagues and they come to the 10th plague before they would leave Egypt land and really that picture of being brought out and the exodus and all of that, what did they have to do? They had the Passover was instituted. When they killed that Passover lamb, there was something specific that they had to do with the blood. It had to be applied. The doorpost and the lintel, right? Really, picture's a cross. He said, when the angel came through, he said, when I see the blood, I will pass. We sing the song. When I see the blood, right? I'm not gonna sing for you. Everyone leave. But the reality is that it says, when I see the blood, I will pass. I will pass over you. Why? Because the blood was applied. What if someone said, you know what? I don't really think that's necessary. I'm gonna do all of these things instead. I mean, I'm gonna do the best I can. I'm gonna clean up my house. I'm gonna clean up this. I'm gonna do this. I'm gonna do all these things I'm gonna do, but I didn't apply the blood. There'd be death, right? There'd be death. It was only because of the blood that was applied. And we see all throughout the Old Testament, and we see the picture and the typology and how it's showing us that Messiah would one day come, God in flesh. Christ, our Passover. Isn't that what Paul said? He's writing to the believers in Corinth. He says, Christ, our Passover. And he, the Lord Jesus Christ, God in flesh, he went to the cross and he paid for your sin and mine. Paid for the sin of the world. And the only payment that is accepted by God Almighty is the blood of his son. That's it, there's no other payment. There's some things that the folks in Hebrews that are being written to, they endured because of their conversion. Can I tell you this morning, there may be some things that we have to endure. Some hardships, some afflictions, some reproaches, some difficulties. Can I tell you that we can endure them joyfully if we have the knowledge of this world is not my home? If we have the knowledge that I'm seeking a better city. Amen? We see that in Hebrews 11. And this morning, would you be encouraged by that? promises of God's Word. Be encouraged by the promise of a soon coming. A little while. He that shall come will come and will not tarry. I hope that encourages this morning. Hope you're encouraged by the principle that the just shall live by faith. We are not of them that draw back. No, no. We're pressing on forward by faith. Amen. We serve a great God. I am so thankful to have the truth of the Word of God. I am so thankful that someone was willing to give the gospel to our family. That someone gave the gospel to you. We sang to start our service this morning. I love to tell the story. I really do. I love to talk about Jesus and what he did for me. I hope it doesn't grow old for you. When you recognize what he did for you, what he can do for others, he is able to save. Amen. What a joy. Let's pray. Father, we love you. We thank you for loving us. We thank you for the truth of thy Word. We thank you for the efficacy of Christ's blood. Lord, I pray this morning that if there's one present in our property, there's one that's tuned in via live stream, that has never trusted the Lord Jesus Christ as their personal Savior. They're trying some other way. Trying to be a good person. They're trying to follow some religious creed or teaching. God, I pray this morning that the Holy Spirit of God would convince them of this truth. They're a sinner in need of a Savior. The only Savior is the Lord Jesus Christ. That he accomplished in the offering of himself remission of sin. And if this morning we accept the payment of Christ's blood to be applied to our account. That we believe that he is God and that he died on the cross. He was buried and rose in victory. And we receive the gift of God, which is eternal life through Jesus Christ our Lord. We can have that assurance of heaven. Lord, I pray that you'd work in hearts and lives. Lord, I think of the many that are here that would stand and testify, I've been saved. I've been born again. I belong to Jesus. I've accepted Christ as my Savior. This morning I pray that you'd help us to be encouraged and strengthened. I pray God that you'd help us to have our eyes on Jesus, the author and finisher of our faith. I pray God this morning that you'd use us to reach a lost and dying world. Help us to be mindful on a daily basis that he that shall come will come. Lord, help us to live our days for thee. I pray that you'd work during this time of invitation as only you can. I pray that we would respond and do business with thee. For it's in Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano. As she does, the altar's open. If you'd like to make your way to the altar, you're free to do so. If you want to pray in your seat right where you are, make your your pew an altar. It's perfectly acceptable. Let's respond to the Lord this morning. As Kimberly plays, the altar's open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.7200000286102295,
      "text": " Chapter number 10, verses 26 through 39,"
    },
    {
      "id": 1,
      "start": 2.7200000286102295,
      "end": 6.960000038146973,
      "text": " we're gonna try to finish this 10th chapter this morning."
    },
    {
      "id": 2,
      "start": 6.960000038146973,
      "end": 8.760000228881836,
      "text": " And I am so thankful for the book of Hebrews."
    },
    {
      "id": 3,
      "start": 8.760000228881836,
      "end": 12.239999771118164,
      "text": " I'm thankful for the opportunity that we've had so far"
    },
    {
      "id": 4,
      "start": 12.239999771118164,
      "end": 15.0,
      "text": " in 2020 to study through the book of Hebrews."
    },
    {
      "id": 5,
      "start": 15.0,
      "end": 18.68000030517578,
      "text": " And we actually, in this particular passage of scripture,"
    },
    {
      "id": 6,
      "start": 18.68000030517578,
      "end": 22.739999771118164,
      "text": " we'll end a particular section of the book of Hebrews."
    },
    {
      "id": 7,
      "start": 22.739999771118164,
      "end": 26.079999923706055,
      "text": " We'll end that section dealing with the superiority"
    },
    {
      "id": 8,
      "start": 26.079999923706055,
      "end": 28.15999984741211,
      "text": " of the priesthood of the Lord Jesus Christ."
    },
    {
      "id": 9,
      "start": 28.239999771118164,
      "end": 30.959999084472656,
      "text": " And so as we think about the book of Hebrews"
    },
    {
      "id": 10,
      "start": 30.959999084472656,
      "end": 32.959999084472656,
      "text": " and we think about how it proves to us"
    },
    {
      "id": 11,
      "start": 32.959999084472656,
      "end": 35.0,
      "text": " the superiority of Christ,"
    },
    {
      "id": 12,
      "start": 35.0,
      "end": 37.939998626708984,
      "text": " we also must acknowledge this morning"
    },
    {
      "id": 13,
      "start": 37.939998626708984,
      "end": 41.599998474121094,
      "text": " that it reveals to us that biblical Christianity"
    },
    {
      "id": 14,
      "start": 41.599998474121094,
      "end": 43.400001525878906,
      "text": " also is superior."
    },
    {
      "id": 15,
      "start": 43.400001525878906,
      "end": 45.880001068115234,
      "text": " Now understand what I mean when I say that"
    },
    {
      "id": 16,
      "start": 45.880001068115234,
      "end": 48.599998474121094,
      "text": " and don't make any judgments at this point."
    },
    {
      "id": 17,
      "start": 48.599998474121094,
      "end": 50.52000045776367,
      "text": " Let me explain what I mean."
    },
    {
      "id": 18,
      "start": 50.52000045776367,
      "end": 55.52000045776367,
      "text": " When we consider the fact that what the writer of Hebrews"
    },
    {
      "id": 19,
      "start": 55.52000045776367,
      "end": 57.599998474121094,
      "text": " is giving to these original recipients,"
    },
    {
      "id": 20,
      "start": 57.599998474121094,
      "end": 61.0,
      "text": " of course, they were Jewish people that had been saved"
    },
    {
      "id": 21,
      "start": 61.0,
      "end": 62.959999084472656,
      "text": " and there was this consideration,"
    },
    {
      "id": 22,
      "start": 62.959999084472656,
      "end": 66.80000305175781,
      "text": " this immense amount of pressure to go back to Judaism."
    },
    {
      "id": 23,
      "start": 66.80000305175781,
      "end": 68.44000244140625,
      "text": " And so throughout the book of Hebrews,"
    },
    {
      "id": 24,
      "start": 68.44000244140625,
      "end": 71.91999816894531,
      "text": " we're finding that Christ is better, he's superior."
    },
    {
      "id": 25,
      "start": 71.91999816894531,
      "end": 73.55999755859375,
      "text": " And we began that in chapter number one,"
    },
    {
      "id": 26,
      "start": 73.55999755859375,
      "end": 76.08000183105469,
      "text": " we're going through that and we're dealing with the fact"
    },
    {
      "id": 27,
      "start": 76.08000183105469,
      "end": 77.55999755859375,
      "text": " that he is superior."
    },
    {
      "id": 28,
      "start": 77.55999755859375,
      "end": 82.36000061035156,
      "text": " And we understand that really the application of such"
    },
    {
      "id": 29,
      "start": 82.36000061035156,
      "end": 85.0,
      "text": " is therefore, if Christ is superior"
    },
    {
      "id": 30,
      "start": 85.4000015258789,
      "end": 87.4800033569336,
      "text": " or since Christ is superior,"
    },
    {
      "id": 31,
      "start": 87.4800033569336,
      "end": 92.44000244140625,
      "text": " that biblical Christianity in like fashion is superior."
    },
    {
      "id": 32,
      "start": 92.44000244140625,
      "end": 95.5999984741211,
      "text": " It is superior than what Judaism could offer you."
    },
    {
      "id": 33,
      "start": 95.5999984741211,
      "end": 99.5999984741211,
      "text": " It's superior to what that which was a shadow"
    },
    {
      "id": 34,
      "start": 99.5999984741211,
      "end": 102.23999786376953,
      "text": " of good things to come could offer you."
    },
    {
      "id": 35,
      "start": 102.23999786376953,
      "end": 104.04000091552734,
      "text": " Now we must be careful,"
    },
    {
      "id": 36,
      "start": 104.04000091552734,
      "end": 108.41999816894531,
      "text": " you notice that I use the terminology biblical Christianity."
    },
    {
      "id": 37,
      "start": 108.41999816894531,
      "end": 110.05999755859375,
      "text": " We must acknowledge this morning"
    },
    {
      "id": 38,
      "start": 110.05999755859375,
      "end": 112.12000274658203,
      "text": " that all that is called Christianity"
    },
    {
      "id": 39,
      "start": 112.12000274658203,
      "end": 114.36000061035156,
      "text": " does not line up with the Bible."
    },
    {
      "id": 40,
      "start": 114.68000030517578,
      "end": 116.0,
      "text": " The term is used very loosely."
    },
    {
      "id": 41,
      "start": 116.0,
      "end": 119.23999786376953,
      "text": " In fact, many people will use the term Christendom"
    },
    {
      "id": 42,
      "start": 119.23999786376953,
      "end": 121.72000122070312,
      "text": " and they'll refer to themselves as being Christians"
    },
    {
      "id": 43,
      "start": 121.72000122070312,
      "end": 123.72000122070312,
      "text": " and Christianity and what have you."
    },
    {
      "id": 44,
      "start": 123.72000122070312,
      "end": 127.4000015258789,
      "text": " But we understand this morning that is absolutely imperative"
    },
    {
      "id": 45,
      "start": 127.4000015258789,
      "end": 130.39999389648438,
      "text": " that we as Bible believing Christians,"
    },
    {
      "id": 46,
      "start": 130.39999389648438,
      "end": 134.83999633789062,
      "text": " that we follow the instruction given in the word of God"
    },
    {
      "id": 47,
      "start": 134.83999633789062,
      "end": 139.27999877929688,
      "text": " and that our beliefs and behavior are aligned properly."
    },
    {
      "id": 48,
      "start": 139.27999877929688,
      "end": 142.5,
      "text": " Now we understand that as we go through"
    },
    {
      "id": 49,
      "start": 142.5,
      "end": 145.17999267578125,
      "text": " and looking at the society in which we're living,"
    },
    {
      "id": 50,
      "start": 145.17999267578125,
      "end": 147.10000610351562,
      "text": " in fact, you can see it all throughout history,"
    },
    {
      "id": 51,
      "start": 147.10000610351562,
      "end": 149.5399932861328,
      "text": " the church in Corinth faced this"
    },
    {
      "id": 52,
      "start": 149.5399932861328,
      "end": 152.97999572753906,
      "text": " and unfortunately they failed miserably."
    },
    {
      "id": 53,
      "start": 152.97999572753906,
      "end": 154.86000061035156,
      "text": " But there's a grave danger"
    },
    {
      "id": 54,
      "start": 154.86000061035156,
      "end": 159.10000610351562,
      "text": " in watering down the clear teachings of God's word."
    },
    {
      "id": 55,
      "start": 159.10000610351562,
      "end": 163.66000366210938,
      "text": " There is a clear danger in having this understanding"
    },
    {
      "id": 56,
      "start": 163.66000366210938,
      "end": 168.66000366210938,
      "text": " that the enemy would tell us and would like us to believe"
    },
    {
      "id": 57,
      "start": 168.8000030517578,
      "end": 172.33999633789062,
      "text": " that it would be necessary for us to adapt"
    },
    {
      "id": 58,
      "start": 173.17999267578125,
      "end": 174.74000549316406,
      "text": " so that we can be more relevant"
    },
    {
      "id": 59,
      "start": 174.74000549316406,
      "end": 177.74000549316406,
      "text": " and so that we can have a greater impact."
    },
    {
      "id": 60,
      "start": 177.74000549316406,
      "end": 180.13999938964844,
      "text": " But I say baloney on that, amen?"
    },
    {
      "id": 61,
      "start": 180.13999938964844,
      "end": 183.5,
      "text": " And that's not good Greek nor Hebrew,"
    },
    {
      "id": 62,
      "start": 183.5,
      "end": 186.55999755859375,
      "text": " but the reality is that as we look at the truth"
    },
    {
      "id": 63,
      "start": 186.55999755859375,
      "end": 190.10000610351562,
      "text": " of the word of God, Jesus Christ is the head of the church."
    },
    {
      "id": 64,
      "start": 190.10000610351562,
      "end": 192.1999969482422,
      "text": " He said that this is my church."
    },
    {
      "id": 65,
      "start": 192.1999969482422,
      "end": 194.6199951171875,
      "text": " He said, I will build my church."
    },
    {
      "id": 66,
      "start": 194.6199951171875,
      "end": 197.6199951171875,
      "text": " And we understand that there is this pull."
    },
    {
      "id": 67,
      "start": 197.6199951171875,
      "end": 201.9199981689453,
      "text": " There's this constant pull to waver"
    },
    {
      "id": 68,
      "start": 201.9199981689453,
      "end": 206.8000030517578,
      "text": " and to water down and to become more accommodating,"
    },
    {
      "id": 69,
      "start": 206.8000030517578,
      "end": 208.0,
      "text": " if you will."
    },
    {
      "id": 70,
      "start": 208.0,
      "end": 211.3000030517578,
      "text": " But the reality is that God has called us to be different."
    },
    {
      "id": 71,
      "start": 211.3000030517578,
      "end": 214.4199981689453,
      "text": " God has called us to make a difference."
    },
    {
      "id": 72,
      "start": 214.4199981689453,
      "end": 216.83999633789062,
      "text": " And we understand that as we look at the truth"
    },
    {
      "id": 73,
      "start": 216.83999633789062,
      "end": 218.05999755859375,
      "text": " of the word of God,"
    },
    {
      "id": 74,
      "start": 218.05999755859375,
      "end": 220.9199981689453,
      "text": " when we consider biblical Christianity,"
    },
    {
      "id": 75,
      "start": 220.9199981689453,
      "end": 223.63999938964844,
      "text": " that it is imperative that we align"
    },
    {
      "id": 76,
      "start": 223.63999938964844,
      "end": 225.86000061035156,
      "text": " with what God's word teaches."
    },
    {
      "id": 77,
      "start": 225.86000061035156,
      "end": 227.1199951171875,
      "text": " We do not want to waver"
    },
    {
      "id": 78,
      "start": 227.1199951171875,
      "end": 229.67999267578125,
      "text": " from what the clear teaching of God's word is."
    },
    {
      "id": 79,
      "start": 229.6999969482422,
      "end": 233.9199981689453,
      "text": " We must stand where God stands, amen?"
    },
    {
      "id": 80,
      "start": 233.9199981689453,
      "end": 236.3800048828125,
      "text": " I understand that's not super popular today."
    },
    {
      "id": 81,
      "start": 236.3800048828125,
      "end": 238.75999450683594,
      "text": " I understand that today we're living"
    },
    {
      "id": 82,
      "start": 238.75999450683594,
      "end": 240.32000732421875,
      "text": " in the midst of a generation"
    },
    {
      "id": 83,
      "start": 240.32000732421875,
      "end": 244.1199951171875,
      "text": " that wants to be able to waver and move"
    },
    {
      "id": 84,
      "start": 244.1199951171875,
      "end": 246.0800018310547,
      "text": " and sway and so on and so forth"
    },
    {
      "id": 85,
      "start": 246.0800018310547,
      "end": 249.1999969482422,
      "text": " and water down some of the teachings of the word of God,"
    },
    {
      "id": 86,
      "start": 249.1999969482422,
      "end": 252.22000122070312,
      "text": " but we must understand that it is imperative"
    },
    {
      "id": 87,
      "start": 252.22000122070312,
      "end": 254.9199981689453,
      "text": " that we follow the instruction of God's word."
    },
    {
      "id": 88,
      "start": 254.9199981689453,
      "end": 256.6199951171875,
      "text": " Now, let me say this."
    },
    {
      "id": 89,
      "start": 256.6199951171875,
      "end": 259.2799987792969,
      "text": " It is important that we understand"
    },
    {
      "id": 90,
      "start": 259.29998779296875,
      "end": 262.0199890136719,
      "text": " that yes, Christ is superior,"
    },
    {
      "id": 91,
      "start": 262.0199890136719,
      "end": 265.1400146484375,
      "text": " therefore biblical Christianity is superior,"
    },
    {
      "id": 92,
      "start": 265.1400146484375,
      "end": 266.6199951171875,
      "text": " but we need to be careful"
    },
    {
      "id": 93,
      "start": 266.6199951171875,
      "end": 269.29998779296875,
      "text": " that that perspective does not lead us"
    },
    {
      "id": 94,
      "start": 269.29998779296875,
      "end": 271.6600036621094,
      "text": " to a place of pride."
    },
    {
      "id": 95,
      "start": 271.6600036621094,
      "end": 273.6600036621094,
      "text": " Can I tell you there's a danger in that?"
    },
    {
      "id": 96,
      "start": 273.6600036621094,
      "end": 275.4599914550781,
      "text": " There's a danger in thinking,"
    },
    {
      "id": 97,
      "start": 275.4599914550781,
      "end": 277.05999755859375,
      "text": " I'm right, I'm better,"
    },
    {
      "id": 98,
      "start": 277.05999755859375,
      "end": 279.1199951171875,
      "text": " I have something that's superior,"
    },
    {
      "id": 99,
      "start": 279.1199951171875,
      "end": 282.2200012207031,
      "text": " and therefore we elevate ourselves,"
    },
    {
      "id": 100,
      "start": 282.2200012207031,
      "end": 284.2200012207031,
      "text": " and that's a huge danger."
    },
    {
      "id": 101,
      "start": 284.2200012207031,
      "end": 286.5199890136719,
      "text": " What we must acknowledge this morning"
    },
    {
      "id": 102,
      "start": 286.5199890136719,
      "end": 288.0,
      "text": " when we consider the fact"
    },
    {
      "id": 103,
      "start": 288.0400085449219,
      "end": 290.3599853515625,
      "text": " that those that have gone before us"
    },
    {
      "id": 104,
      "start": 290.3599853515625,
      "end": 293.3599853515625,
      "text": " have faithfully preached the truth of the word of God"
    },
    {
      "id": 105,
      "start": 293.3599853515625,
      "end": 295.760009765625,
      "text": " and they've delivered it to us,"
    },
    {
      "id": 106,
      "start": 295.760009765625,
      "end": 297.44000244140625,
      "text": " and then we have a responsibility"
    },
    {
      "id": 107,
      "start": 297.44000244140625,
      "end": 300.1600036621094,
      "text": " to deliver that to a next generation,"
    },
    {
      "id": 108,
      "start": 300.1600036621094,
      "end": 302.0799865722656,
      "text": " what we do is we don't allow that"
    },
    {
      "id": 109,
      "start": 302.0799865722656,
      "end": 303.79998779296875,
      "text": " to lead us to a place of pride,"
    },
    {
      "id": 110,
      "start": 303.79998779296875,
      "end": 306.8800048828125,
      "text": " but it leads us to have grateful hearts."
    },
    {
      "id": 111,
      "start": 306.8800048828125,
      "end": 309.8800048828125,
      "text": " It leads us to have an understanding"
    },
    {
      "id": 112,
      "start": 309.8800048828125,
      "end": 313.0400085449219,
      "text": " of what our responsibility is."
    },
    {
      "id": 113,
      "start": 313.0400085449219,
      "end": 313.8800048828125,
      "text": " Amen?"
    },
    {
      "id": 114,
      "start": 314.9200134277344,
      "end": 316.67999267578125,
      "text": " We understand that we live in a world"
    },
    {
      "id": 115,
      "start": 316.7200012207031,
      "end": 318.3599853515625,
      "text": " that's approaching a population"
    },
    {
      "id": 116,
      "start": 318.3599853515625,
      "end": 320.6400146484375,
      "text": " of nearly eight billion people."
    },
    {
      "id": 117,
      "start": 320.6400146484375,
      "end": 322.55999755859375,
      "text": " It's amazing when you consider"
    },
    {
      "id": 118,
      "start": 322.55999755859375,
      "end": 325.0799865722656,
      "text": " that a vast majority of the number"
    },
    {
      "id": 119,
      "start": 325.0799865722656,
      "end": 327.9200134277344,
      "text": " of inhabitants upon the earth today"
    },
    {
      "id": 120,
      "start": 327.9200134277344,
      "end": 331.2200012207031,
      "text": " have never even heard the name of the Lord Jesus Christ,"
    },
    {
      "id": 121,
      "start": 331.2200012207031,
      "end": 334.739990234375,
      "text": " nor understood the clear presentation of the gospel."
    },
    {
      "id": 122,
      "start": 334.739990234375,
      "end": 338.44000244140625,
      "text": " It's becoming more and more common"
    },
    {
      "id": 123,
      "start": 338.44000244140625,
      "end": 341.239990234375,
      "text": " even here in the United States of America"
    },
    {
      "id": 124,
      "start": 341.239990234375,
      "end": 343.6400146484375,
      "text": " to meet people, to interact with people"
    },
    {
      "id": 125,
      "start": 343.6400146484375,
      "end": 347.239990234375,
      "text": " that have never heard the truth of God's word."
    },
    {
      "id": 126,
      "start": 347.239990234375,
      "end": 351.0400085449219,
      "text": " Again, because we understand biblical Christianity,"
    },
    {
      "id": 127,
      "start": 351.0400085449219,
      "end": 353.1199951171875,
      "text": " because we've been saved,"
    },
    {
      "id": 128,
      "start": 353.1199951171875,
      "end": 355.55999755859375,
      "text": " doesn't make us come to this place"
    },
    {
      "id": 129,
      "start": 355.55999755859375,
      "end": 358.6600036621094,
      "text": " of having this prideful air about us,"
    },
    {
      "id": 130,
      "start": 358.6600036621094,
      "end": 360.7799987792969,
      "text": " but it should cause us to recognize"
    },
    {
      "id": 131,
      "start": 360.7799987792969,
      "end": 364.4800109863281,
      "text": " the deep responsibility that has been given to us"
    },
    {
      "id": 132,
      "start": 364.4800109863281,
      "end": 367.9599914550781,
      "text": " to deliver a message to a lost and dying world."
    },
    {
      "id": 133,
      "start": 367.9599914550781,
      "end": 370.0400085449219,
      "text": " Remember the principle Jesus taught this,"
    },
    {
      "id": 134,
      "start": 370.0400085449219,
      "end": 372.0,
      "text": " we find it throughout the word of God,"
    },
    {
      "id": 135,
      "start": 372.0,
      "end": 376.6400146484375,
      "text": " to whom much is given, much is required."
    },
    {
      "id": 136,
      "start": 376.6400146484375,
      "end": 377.5199890136719,
      "text": " Amen?"
    },
    {
      "id": 137,
      "start": 377.5199890136719,
      "end": 379.32000732421875,
      "text": " As we think about these believers"
    },
    {
      "id": 138,
      "start": 379.32000732421875,
      "end": 381.32000732421875,
      "text": " that are being written to and we consider"
    },
    {
      "id": 139,
      "start": 381.32000732421875,
      "end": 384.44000244140625,
      "text": " all that has gone through in this particular section"
    },
    {
      "id": 140,
      "start": 384.44000244140625,
      "end": 386.0799865722656,
      "text": " that we've been studying for a number of weeks now,"
    },
    {
      "id": 141,
      "start": 386.0799865722656,
      "end": 387.9200134277344,
      "text": " really beginning in chapter number five,"
    },
    {
      "id": 142,
      "start": 387.9200134277344,
      "end": 389.8800048828125,
      "text": " with the superiority of the priesthood"
    },
    {
      "id": 143,
      "start": 389.8800048828125,
      "end": 391.3999938964844,
      "text": " of the Lord Jesus Christ,"
    },
    {
      "id": 144,
      "start": 391.3999938964844,
      "end": 393.9599914550781,
      "text": " we conclude that section here this morning"
    },
    {
      "id": 145,
      "start": 393.9599914550781,
      "end": 395.9200134277344,
      "text": " at the end of chapter number 10."
    },
    {
      "id": 146,
      "start": 395.9200134277344,
      "end": 398.20001220703125,
      "text": " Let me read a verse of Scripture for you."
    },
    {
      "id": 147,
      "start": 398.20001220703125,
      "end": 399.67999267578125,
      "text": " We'll get through the entire passage,"
    },
    {
      "id": 148,
      "start": 399.67999267578125,
      "end": 403.20001220703125,
      "text": " but let me draw your attention to verse number 37."
    },
    {
      "id": 149,
      "start": 403.20001220703125,
      "end": 404.1600036621094,
      "text": " The Bible says this,"
    },
    {
      "id": 150,
      "start": 404.1600036621094,
      "end": 406.2799987792969,
      "text": " for yet a little while,"
    },
    {
      "id": 151,
      "start": 406.2799987792969,
      "end": 410.20001220703125,
      "text": " and he that shall come will come,"
    },
    {
      "id": 152,
      "start": 410.20001220703125,
      "end": 413.6000061035156,
      "text": " and will not tarry."
    },
    {
      "id": 153,
      "start": 413.6000061035156,
      "end": 415.5,
      "text": " Aren't you thankful for that truth?"
    },
    {
      "id": 154,
      "start": 415.5,
      "end": 416.8399963378906,
      "text": " This morning if you're taking notes,"
    },
    {
      "id": 155,
      "start": 416.8399963378906,
      "end": 418.760009765625,
      "text": " I've simply entitled the message,"
    },
    {
      "id": 156,
      "start": 418.760009765625,
      "end": 422.2799987792969,
      "text": " he that shall come will come."
    },
    {
      "id": 157,
      "start": 422.2799987792969,
      "end": 425.5199890136719,
      "text": " We notice that the Scripture says yet a little while."
    },
    {
      "id": 158,
      "start": 425.5199890136719,
      "end": 427.4800109863281,
      "text": " Many have said, how long is a little while?"
    },
    {
      "id": 159,
      "start": 427.4800109863281,
      "end": 428.5799865722656,
      "text": " You can look in the Greek,"
    },
    {
      "id": 160,
      "start": 428.5799865722656,
      "end": 429.94000244140625,
      "text": " you can look in anywhere."
    },
    {
      "id": 161,
      "start": 429.94000244140625,
      "end": 431.4599914550781,
      "text": " A little while is a little while."
    },
    {
      "id": 162,
      "start": 431.4599914550781,
      "end": 433.20001220703125,
      "text": " It's an unstated period of time."
    },
    {
      "id": 163,
      "start": 433.20001220703125,
      "end": 436.5,
      "text": " We find that Peter will use similar expression"
    },
    {
      "id": 164,
      "start": 436.5,
      "end": 438.5400085449219,
      "text": " at the end of his first epistle"
    },
    {
      "id": 165,
      "start": 438.5400085449219,
      "end": 439.9800109863281,
      "text": " in 1 Peter chapter number five."
    },
    {
      "id": 166,
      "start": 439.9800109863281,
      "end": 442.6600036621094,
      "text": " He says, after that you have suffered a while."
    },
    {
      "id": 167,
      "start": 442.6600036621094,
      "end": 445.3800048828125,
      "text": " And we understand here that a little while,"
    },
    {
      "id": 168,
      "start": 445.3800048828125,
      "end": 446.7799987792969,
      "text": " we don't know the period of time,"
    },
    {
      "id": 169,
      "start": 446.7799987792969,
      "end": 451.739990234375,
      "text": " but we do know that Jesus is going to return right on time."
    },
    {
      "id": 170,
      "start": 451.739990234375,
      "end": 452.5799865722656,
      "text": " Amen?"
    },
    {
      "id": 171,
      "start": 452.5799865722656,
      "end": 454.8800048828125,
      "text": " And just as he came the first time,"
    },
    {
      "id": 172,
      "start": 454.8800048828125,
      "end": 456.4200134277344,
      "text": " when the fullness of time was come,"
    },
    {
      "id": 173,
      "start": 456.4200134277344,
      "end": 457.739990234375,
      "text": " God sent forth his son."
    },
    {
      "id": 174,
      "start": 457.7799987792969,
      "end": 459.4599914550781,
      "text": " We understand that in the book of Galatians."
    },
    {
      "id": 175,
      "start": 459.4599914550781,
      "end": 462.05999755859375,
      "text": " We see the incarnation as you read through"
    },
    {
      "id": 176,
      "start": 462.05999755859375,
      "end": 464.05999755859375,
      "text": " and study the Gospel records."
    },
    {
      "id": 177,
      "start": 464.05999755859375,
      "end": 467.2200012207031,
      "text": " And this morning when we are reminded of this truth,"
    },
    {
      "id": 178,
      "start": 467.2200012207031,
      "end": 471.6600036621094,
      "text": " that Jesus is going to come and his time is perfect."
    },
    {
      "id": 179,
      "start": 471.6600036621094,
      "end": 473.1400146484375,
      "text": " He's never been late."
    },
    {
      "id": 180,
      "start": 473.1400146484375,
      "end": 474.29998779296875,
      "text": " He's seldom early, right?"
    },
    {
      "id": 181,
      "start": 474.29998779296875,
      "end": 476.05999755859375,
      "text": " He's right on time."
    },
    {
      "id": 182,
      "start": 476.05999755859375,
      "end": 478.4599914550781,
      "text": " And what a joy to understand that truth."
    },
    {
      "id": 183,
      "start": 478.4599914550781,
      "end": 480.2200012207031,
      "text": " Let's dig into the passage this morning."
    },
    {
      "id": 184,
      "start": 480.2200012207031,
      "end": 482.05999755859375,
      "text": " If you're taking notes, number one,"
    },
    {
      "id": 185,
      "start": 482.05999755859375,
      "end": 483.8999938964844,
      "text": " I want you to notice what is explained."
    },
    {
      "id": 186,
      "start": 483.8999938964844,
      "end": 486.05999755859375,
      "text": " In verses 26 through 31,"
    },
    {
      "id": 187,
      "start": 486.05999755859375,
      "end": 488.2200012207031,
      "text": " these individuals that are being written to"
    },
    {
      "id": 188,
      "start": 488.2200012207031,
      "end": 489.82000732421875,
      "text": " are given some explanation."
    },
    {
      "id": 189,
      "start": 489.82000732421875,
      "end": 492.2200012207031,
      "text": " Notice in verse 26, it says this,"
    },
    {
      "id": 190,
      "start": 492.2200012207031,
      "end": 494.739990234375,
      "text": " for if we sin willfully after that we have received"
    },
    {
      "id": 191,
      "start": 494.739990234375,
      "end": 496.29998779296875,
      "text": " the knowledge of the truth,"
    },
    {
      "id": 192,
      "start": 496.29998779296875,
      "end": 498.9599914550781,
      "text": " there remaineth no more sacrifice for sins,"
    },
    {
      "id": 193,
      "start": 498.9599914550781,
      "end": 500.9800109863281,
      "text": " but a certain fearful looking for of judgment"
    },
    {
      "id": 194,
      "start": 500.9800109863281,
      "end": 504.29998779296875,
      "text": " and fiery indignation which shall devour the adversaries."
    },
    {
      "id": 195,
      "start": 504.29998779296875,
      "end": 508.6199951171875,
      "text": " He that despised Moses' law died without mercy"
    },
    {
      "id": 196,
      "start": 508.6199951171875,
      "end": 510.4200134277344,
      "text": " under two or three witnesses."
    },
    {
      "id": 197,
      "start": 510.4200134277344,
      "end": 513.9400024414062,
      "text": " Of how much sorer punishment, suppose ye,"
    },
    {
      "id": 198,
      "start": 513.9400024414062,
      "end": 517.6599731445312,
      "text": " shall he be thought worthy who hath trodden underfoot"
    },
    {
      "id": 199,
      "start": 517.6599731445312,
      "end": 521.0599975585938,
      "text": " the Son of God and hath counted the blood of the covenant"
    },
    {
      "id": 200,
      "start": 521.0599975585938,
      "end": 525.0599975585938,
      "text": " wherewith he was sanctified an unholy thing"
    },
    {
      "id": 201,
      "start": 525.0599975585938,
      "end": 528.2999877929688,
      "text": " and hath done despite unto the Spirit of grace."
    },
    {
      "id": 202,
      "start": 528.2999877929688,
      "end": 529.97998046875,
      "text": " For we know him that hath said,"
    },
    {
      "id": 203,
      "start": 529.97998046875,
      "end": 531.780029296875,
      "text": " vengeance belongeth unto me."
    },
    {
      "id": 204,
      "start": 531.780029296875,
      "end": 533.6199951171875,
      "text": " I will recompense, saith the Lord."
    },
    {
      "id": 205,
      "start": 533.6199951171875,
      "end": 536.8599853515625,
      "text": " And again, the Lord shall judge his people."
    },
    {
      "id": 206,
      "start": 536.8599853515625,
      "end": 538.3400268554688,
      "text": " Notice verse 31."
    },
    {
      "id": 207,
      "start": 538.3400268554688,
      "end": 542.1400146484375,
      "text": " It is a fearful thing to fall into the hands"
    },
    {
      "id": 208,
      "start": 542.1400146484375,
      "end": 543.5399780273438,
      "text": " of the living God."
    },
    {
      "id": 209,
      "start": 544.0599975585938,
      "end": 546.219970703125,
      "text": " We understand that we serve the Lord God Almighty,"
    },
    {
      "id": 210,
      "start": 546.219970703125,
      "end": 549.219970703125,
      "text": " that he is omnipotent, that he ever liveth"
    },
    {
      "id": 211,
      "start": 549.219970703125,
      "end": 550.5,
      "text": " to make intercession for us."
    },
    {
      "id": 212,
      "start": 550.5,
      "end": 553.97998046875,
      "text": " And we understand the sacrifice that was made"
    },
    {
      "id": 213,
      "start": 553.97998046875,
      "end": 556.8200073242188,
      "text": " by the Lord Jesus Christ when he offered himself."
    },
    {
      "id": 214,
      "start": 556.8200073242188,
      "end": 559.0999755859375,
      "text": " And we notice what is being explained."
    },
    {
      "id": 215,
      "start": 559.0999755859375,
      "end": 560.7000122070312,
      "text": " First of all, I believe that we see"
    },
    {
      "id": 216,
      "start": 560.7000122070312,
      "end": 563.1400146484375,
      "text": " the efficacy of Christ's blood."
    },
    {
      "id": 217,
      "start": 563.1400146484375,
      "end": 565.0599975585938,
      "text": " That word means that it's efficient,"
    },
    {
      "id": 218,
      "start": 565.0599975585938,
      "end": 569.5800170898438,
      "text": " it's effective to bring about the desired end."
    },
    {
      "id": 219,
      "start": 569.5800170898438,
      "end": 572.8800048828125,
      "text": " And we understand this morning that it has the power,"
    },
    {
      "id": 220,
      "start": 573.280029296875,
      "end": 576.3200073242188,
      "text": " the blood of Jesus Christ has the power"
    },
    {
      "id": 221,
      "start": 576.3200073242188,
      "end": 579.6799926757812,
      "text": " to change lives, to save souls."
    },
    {
      "id": 222,
      "start": 579.6799926757812,
      "end": 581.52001953125,
      "text": " And we understand there's power in the blood."
    },
    {
      "id": 223,
      "start": 581.52001953125,
      "end": 586.52001953125,
      "text": " We sing about that truth and we look at the word of God"
    },
    {
      "id": 224,
      "start": 586.8400268554688,
      "end": 589.239990234375,
      "text": " and we understand that he's gone through"
    },
    {
      "id": 225,
      "start": 589.239990234375,
      "end": 592.3599853515625,
      "text": " these last several chapters dealing with the offering"
    },
    {
      "id": 226,
      "start": 592.3599853515625,
      "end": 595.8800048828125,
      "text": " of the Lord Jesus Christ and how the blood"
    },
    {
      "id": 227,
      "start": 595.8800048828125,
      "end": 598.1599731445312,
      "text": " of those bulls and goats that was offered"
    },
    {
      "id": 228,
      "start": 598.1599731445312,
      "end": 599.3599853515625,
      "text": " throughout the Old Testament,"
    },
    {
      "id": 229,
      "start": 599.3599853515625,
      "end": 600.2000122070312,
      "text": " that Old Testament,"
    },
    {
      "id": 0,
      "start": 600.2000122070312,
      "end": 606.3200120925903,
      "text": " sacrificial system that it was a picture, it was a type, it could never bring about"
    },
    {
      "id": 1,
      "start": 606.3200120925903,
      "end": 611.6000118255615,
      "text": " the salvation that the blood of Jesus Christ brings about. There was a constant"
    },
    {
      "id": 2,
      "start": 611.6000118255615,
      "end": 617.0800113677979,
      "text": " reminder of sin with that Old Testament sacrificial system, but with that one"
    },
    {
      "id": 3,
      "start": 617.0800113677979,
      "end": 623.880012512207,
      "text": " sacrifice for sins forever, when Jesus, God in flesh, offered His precious blood,"
    },
    {
      "id": 4,
      "start": 623.880012512207,
      "end": 630.9200115203857,
      "text": " He died, was buried, and rose in victory, He accomplished what was that that was"
    },
    {
      "id": 5,
      "start": 630.9200115203857,
      "end": 636.8400115966797,
      "text": " set out to be accomplished, and that is the redemption of mankind. We understand"
    },
    {
      "id": 6,
      "start": 636.8400115966797,
      "end": 641.5600128173828,
      "text": " this morning that the Bible tells us in verse number 18, now where remission of"
    },
    {
      "id": 7,
      "start": 641.5600128173828,
      "end": 646.2000122070312,
      "text": " these is, there is no more offering for sin, and we spoke about the fact that in"
    },
    {
      "id": 8,
      "start": 646.2000122070312,
      "end": 652.2800140380859,
      "text": " what Christ's offering provided for us was remission, not that remembrance of"
    },
    {
      "id": 9,
      "start": 652.2800140380859,
      "end": 657.4800109863281,
      "text": " the Old Testament sacrificial system, and we can rejoice in that truth. The"
    },
    {
      "id": 10,
      "start": 657.4800109863281,
      "end": 662.2400131225586,
      "text": " precious blood of the Lord Jesus Christ is the only payment that is acceptable"
    },
    {
      "id": 11,
      "start": 662.2400131225586,
      "end": 667.3600158691406,
      "text": " for the sin debt of mankind. You believe that this morning? Notice what he says at"
    },
    {
      "id": 12,
      "start": 667.3600158691406,
      "end": 673.2000122070312,
      "text": " the end of verse number 26, there remaineth no more sacrifice for sins."
    },
    {
      "id": 13,
      "start": 673.2000122070312,
      "end": 680.2000122070312,
      "text": " There's nothing else that can be offered that can take care of your sin debt."
    },
    {
      "id": 14,
      "start": 680.3200149536133,
      "end": 686.880012512207,
      "text": " Nothing. Jesus's blood, that's it. The reality this morning is that when we"
    },
    {
      "id": 15,
      "start": 686.880012512207,
      "end": 691.1600112915039,
      "text": " speak about the blood of the Lord Jesus Christ, we speak about it and hold it in"
    },
    {
      "id": 16,
      "start": 691.1600112915039,
      "end": 698.0400085449219,
      "text": " great reverence of understanding what it is that Jesus did for us. I'm so thankful"
    },
    {
      "id": 17,
      "start": 698.0400085449219,
      "end": 702.8000106811523,
      "text": " this morning that He was willing to shed His precious blood, and that we have the"
    },
    {
      "id": 18,
      "start": 702.8000106811523,
      "end": 707.6800155639648,
      "text": " privilege of speaking about, teaching about, singing about, sharing with others"
    },
    {
      "id": 19,
      "start": 707.6800155639648,
      "end": 712.4800109863281,
      "text": " the truth of the redemption through the blood of Christ. There are a number of"
    },
    {
      "id": 20,
      "start": 712.4800109863281,
      "end": 716.6400146484375,
      "text": " people in our world today that have the understanding that there's some other"
    },
    {
      "id": 21,
      "start": 716.6400146484375,
      "end": 721.5600128173828,
      "text": " form of payment that is acceptable for their redemption. There are people that"
    },
    {
      "id": 22,
      "start": 721.5600128173828,
      "end": 724.9200134277344,
      "text": " think that they can follow some creed, there are people that think they can do"
    },
    {
      "id": 23,
      "start": 724.9200134277344,
      "end": 729.6000061035156,
      "text": " some deed, and that through these particular things they can find, can"
    },
    {
      "id": 24,
      "start": 729.6000061035156,
      "end": 737.760009765625,
      "text": " obtain, redemption. My friends, they've been sold a bill of goods. They have been"
    },
    {
      "id": 25,
      "start": 737.760009765625,
      "end": 741.3600158691406,
      "text": " deceived by the God of this world who has blinded the minds of them which"
    },
    {
      "id": 26,
      "start": 741.3600158691406,
      "end": 745.4400177001953,
      "text": " believe not, lest the light of the glorious gospel should shine in unto"
    },
    {
      "id": 27,
      "start": 745.4400177001953,
      "end": 750.1600189208984,
      "text": " them. We speak with people regularly. I hope that you have the opportunity"
    },
    {
      "id": 28,
      "start": 750.1600189208984,
      "end": 754.4000091552734,
      "text": " regularly to interact with individuals, and I understand things have been"
    },
    {
      "id": 29,
      "start": 754.4000091552734,
      "end": 758.9600067138672,
      "text": " different here in 2020 with COVID and all that's going on, but we understand"
    },
    {
      "id": 30,
      "start": 758.9600067138672,
      "end": 764.0800170898438,
      "text": " this morning that God still gives divine appointments, God still uses His"
    },
    {
      "id": 31,
      "start": 764.0800170898438,
      "end": 769.1200103759766,
      "text": " people, and as we have opportunity to be His spokesman, to be His representative,"
    },
    {
      "id": 32,
      "start": 769.1200103759766,
      "end": 773.9600067138672,
      "text": " His ambassador, that we can speak to people. And I guarantee that as you would"
    },
    {
      "id": 33,
      "start": 773.9600067138672,
      "end": 778.0800170898438,
      "text": " go out this week, and if you would purpose in your heart and in your life"
    },
    {
      "id": 34,
      "start": 778.0800170898438,
      "end": 782.8000183105469,
      "text": " to confront some people about their need for Jesus, that you will meet some"
    },
    {
      "id": 35,
      "start": 782.8000183105469,
      "end": 788.8800048828125,
      "text": " people that believe that by being a good person, by following some religious creed,"
    },
    {
      "id": 36,
      "start": 788.8800048828125,
      "end": 797.0000152587891,
      "text": " that they can have salvation. My friends, Jesus paid it all. There's no other"
    },
    {
      "id": 37,
      "start": 797.0000152587891,
      "end": 804.4400177001953,
      "text": " sacrifice for sin. There's nothing else that could atone for the"
    },
    {
      "id": 38,
      "start": 804.4400177001953,
      "end": 810.9200134277344,
      "text": " sin of mankind. I'm thankful that someone gave me that truth. I hope this morning"
    },
    {
      "id": 39,
      "start": 810.9200134277344,
      "end": 814.7200164794922,
      "text": " that you're thankful that someone's given you that truth, that we can"
    },
    {
      "id": 40,
      "start": 814.7200164794922,
      "end": 818.9200134277344,
      "text": " understand that it's been settled. We sing that song, the old account was"
    },
    {
      "id": 41,
      "start": 818.9200134277344,
      "end": 824.0400085449219,
      "text": " settled long ago, right? Why? Because I came to the Lord Jesus Christ"
    },
    {
      "id": 42,
      "start": 824.0400085449219,
      "end": 830.3600158691406,
      "text": " understanding that He is God, and that He went to that cross and He paid for my"
    },
    {
      "id": 43,
      "start": 830.3600158691406,
      "end": 835.3600158691406,
      "text": " sin with His precious blood. He was buried and He rose again, conquering sin,"
    },
    {
      "id": 44,
      "start": 835.3600158691406,
      "end": 840.2000122070312,
      "text": " death, and the grave. The efficacy of Christ's blood. We notice that He then"
    },
    {
      "id": 45,
      "start": 840.2000122070312,
      "end": 844.6400146484375,
      "text": " quickly goes into an example from Old Testament Israel. Notice what He says"
    },
    {
      "id": 46,
      "start": 844.6400146484375,
      "end": 851.0800170898438,
      "text": " in verse number 28, He that despised Moses' law died without mercy under two"
    },
    {
      "id": 47,
      "start": 851.0800170898438,
      "end": 858.0,
      "text": " or three witnesses. And so immediately in verse number 28, again understanding the"
    },
    {
      "id": 48,
      "start": 858.0,
      "end": 861.3600158691406,
      "text": " original recipients to the book of Hebrews and understanding their"
    },
    {
      "id": 49,
      "start": 861.3600158691406,
      "end": 866.8400268554688,
      "text": " knowledge of the Jewish history in Old Testament Israel, they would be able to"
    },
    {
      "id": 50,
      "start": 866.8400268554688,
      "end": 870.760009765625,
      "text": " quickly relate to what is being said here. And it's important that we'd"
    },
    {
      "id": 51,
      "start": 870.760009765625,
      "end": 875.6000061035156,
      "text": " understand that the law required many sacrifices and offerings, did it not? You"
    },
    {
      "id": 52,
      "start": 875.6000061035156,
      "end": 879.3600158691406,
      "text": " read through Old Testament law, you read through all of those offerings, in fact"
    },
    {
      "id": 53,
      "start": 879.3600158691406,
      "end": 884.0800170898438,
      "text": " Hebrews 10 was dealing with that. In verse number 11, and every priest standeth"
    },
    {
      "id": 54,
      "start": 884.0800170898438,
      "end": 888.4400024414062,
      "text": " daily ministering and offering oftentimes the same sacrifices which"
    },
    {
      "id": 55,
      "start": 888.4400024414062,
      "end": 892.8800048828125,
      "text": " could never take away sins, but they were following that which had been prescribed."
    },
    {
      "id": 56,
      "start": 892.8800048828125,
      "end": 897.52001953125,
      "text": " They were bringing the appropriate sacrifice or offering, but we understand"
    },
    {
      "id": 57,
      "start": 897.6800231933594,
      "end": 902.0,
      "text": " that though they would have some level of knowledge of these requirements, in"
    },
    {
      "id": 58,
      "start": 902.0,
      "end": 906.8800048828125,
      "text": " fact many of them, no doubt in my mind, had practiced many of these things"
    },
    {
      "id": 59,
      "start": 906.8800048828125,
      "end": 915.3600158691406,
      "text": " before they came to Christ. However, as the writer of Hebrews will say here in"
    },
    {
      "id": 60,
      "start": 915.3600158691406,
      "end": 920.2400207519531,
      "text": " verse number 28, He that despised Moses' law died without mercy under two or three"
    },
    {
      "id": 61,
      "start": 920.2400207519531,
      "end": 924.3200073242188,
      "text": " witnesses. What he's saying is that there were certain offenses that demanded that"
    },
    {
      "id": 62,
      "start": 924.3200073242188,
      "end": 929.5599975585938,
      "text": " the offender be put to death. There was no sacrifice that could be brought for"
    },
    {
      "id": 63,
      "start": 929.5599975585938,
      "end": 934.52001953125,
      "text": " that particular offense, rather the offender had to be put to death. Let me"
    },
    {
      "id": 64,
      "start": 934.52001953125,
      "end": 939.0,
      "text": " share two examples with you. Number one is that of adultery. Look in Leviticus"
    },
    {
      "id": 65,
      "start": 939.0,
      "end": 943.8800048828125,
      "text": " chapter number 20. I use that example because we understand that Jesus was"
    },
    {
      "id": 66,
      "start": 943.8800048828125,
      "end": 947.760009765625,
      "text": " confronted with that in John chapter number eight. You remember in John"
    },
    {
      "id": 67,
      "start": 947.760009765625,
      "end": 951.0800170898438,
      "text": " chapter number eight that they come to Jesus. Turn over to Leviticus 20, I'm"
    },
    {
      "id": 68,
      "start": 951.0800170898438,
      "end": 955.1600036621094,
      "text": " going to just remind you of the event that took place in John chapter number"
    },
    {
      "id": 69,
      "start": 955.1600036621094,
      "end": 959.8400268554688,
      "text": " eight when Jesus is there and those men come and they say, hey, we've caught this"
    },
    {
      "id": 70,
      "start": 959.8400268554688,
      "end": 964.3600158691406,
      "text": " woman in the very act of adultery. She is to be put to death. That's what the law"
    },
    {
      "id": 71,
      "start": 964.3600158691406,
      "end": 968.8000183105469,
      "text": " says. What say ye? You remember the account, right? Jesus bends down, He begins"
    },
    {
      "id": 72,
      "start": 968.8000183105469,
      "end": 972.8000183105469,
      "text": " to write in the sand, and then all of a sudden all of the accusers are gone."
    },
    {
      "id": 73,
      "start": 972.8000183105469,
      "end": 979.1600036621094,
      "text": " Right? You remember John 8. What they're referring to, those folks that came, was"
    },
    {
      "id": 74,
      "start": 979.1600036621094,
      "end": 983.3600158691406,
      "text": " this truth in Leviticus. Notice in chapter 20 in verse number 10, and the"
    },
    {
      "id": 75,
      "start": 983.3600158691406,
      "end": 986.9600219726562,
      "text": " man that commit adultery with another man's wife, even he that committeth"
    },
    {
      "id": 76,
      "start": 986.9600219726562,
      "end": 991.0,
      "text": " adultery with his neighbor's wife, notice what it says, the adulterer and the"
    },
    {
      "id": 77,
      "start": 991.0,
      "end": 997.9200134277344,
      "text": " adulteress shall surely be put to death. There was no prescribed offering that"
    },
    {
      "id": 78,
      "start": 997.9200134277344,
      "end": 1002.5599975585938,
      "text": " they would bring for that offense. The offender was to be put to death. Not only"
    },
    {
      "id": 79,
      "start": 1002.5599975585938,
      "end": 1005.9600219726562,
      "text": " that of adultery, but think about idolatry. Turn to the book of Deuteronomy,"
    },
    {
      "id": 80,
      "start": 1005.9600219726562,
      "end": 1010.2400207519531,
      "text": " if you will, in chapter number 17. Now we understand that the nation of Israel was"
    },
    {
      "id": 81,
      "start": 1010.2400207519531,
      "end": 1016.5599975585938,
      "text": " very often guilty of the sin of idolatry. Amen? You see it throughout their"
    },
    {
      "id": 82,
      "start": 1016.5599975585938,
      "end": 1022.1200256347656,
      "text": " history. In fact, we live in a society today where many people are idolatrous."
    },
    {
      "id": 83,
      "start": 1022.1200256347656,
      "end": 1027.4000244140625,
      "text": " In fact, it's been interesting to me that in 2020, here in the United States of"
    },
    {
      "id": 84,
      "start": 1027.4000244140625,
      "end": 1032.5599975585938,
      "text": " America, through this pandemic, that many of the idols that Americans served have"
    },
    {
      "id": 85,
      "start": 1032.5599975585938,
      "end": 1036.4000244140625,
      "text": " been dealt with. What do I mean by that? Well, sports took a backseat in a hurry,"
    },
    {
      "id": 86,
      "start": 1036.4000244140625,
      "end": 1041.4000244140625,
      "text": " did it not? You can't tell me this morning that sports is not an idol for"
    },
    {
      "id": 87,
      "start": 1041.4000244140625,
      "end": 1045.760009765625,
      "text": " many people in our land. We could continue to go on and deal with other"
    },
    {
      "id": 88,
      "start": 1045.760009765625,
      "end": 1051.3600158691406,
      "text": " examples, but we understand this morning that John says that little children, keep"
    },
    {
      "id": 89,
      "start": 1051.3600158691406,
      "end": 1058.2799987792969,
      "text": " yourself from idols. We may not have some graven image as some other societies"
    },
    {
      "id": 90,
      "start": 1058.2799987792969,
      "end": 1063.8000183105469,
      "text": " have, but we have idols and we understand that an idol is anything that"
    },
    {
      "id": 91,
      "start": 1063.8000183105469,
      "end": 1068.8000183105469,
      "text": " takes the place of God, anything that is in front of God. The reality this"
    },
    {
      "id": 92,
      "start": 1068.8000183105469,
      "end": 1074.2400207519531,
      "text": " morning is that Paul said this in the book of Colossians in chapter 1 and verse"
    },
    {
      "id": 93,
      "start": 1074.2400207519531,
      "end": 1079.6800231933594,
      "text": " number 18, that in all things he, speaking of the Lord Jesus Christ, must have the"
    },
    {
      "id": 94,
      "start": 1079.6800231933594,
      "end": 1085.1200256347656,
      "text": " preeminence. When we understand all that he's done for us, we would understand the"
    },
    {
      "id": 95,
      "start": 1085.1200256347656,
      "end": 1091.0400085449219,
      "text": " unique opportunity that we have to live for him. Deuteronomy 17, notice in verse"
    },
    {
      "id": 96,
      "start": 1091.0400085449219,
      "end": 1095.5599975585938,
      "text": " number 1, thou shalt not sacrifice unto the Lord thy God any bullock or sheep"
    },
    {
      "id": 97,
      "start": 1095.5599975585938,
      "end": 1099.2799987792969,
      "text": " wherein is blemish or any evil favoredness, for that is an abomination"
    },
    {
      "id": 98,
      "start": 1099.2799987792969,
      "end": 1104.2400207519531,
      "text": " to the Lord thy God. If you want to do a study on your own, mark Deuteronomy 17"
    },
    {
      "id": 99,
      "start": 1104.2400207519531,
      "end": 1109.5599975585938,
      "text": " and study the book of Malachi with it. You'll be overwhelmed with joy as you"
    },
    {
      "id": 100,
      "start": 1109.5599975585938,
      "end": 1114.0800170898438,
      "text": " begin to see how God had warned them of these things and then confronts them"
    },
    {
      "id": 101,
      "start": 1114.0800170898438,
      "end": 1118.0800170898438,
      "text": " with their evilness. They're saying, well we are bringing offerings, yeah, but he is"
    },
    {
      "id": 102,
      "start": 1118.0800170898438,
      "end": 1122.3599853515625,
      "text": " a great king and they were bringing offerings that were not acceptable. In"
    },
    {
      "id": 103,
      "start": 1122.3599853515625,
      "end": 1126.2000122070312,
      "text": " fact, in Malachi he says, you wouldn't even take it to your governor but yet"
    },
    {
      "id": 104,
      "start": 1126.2000122070312,
      "end": 1130.239990234375,
      "text": " you offer it to me. Go study it, it's a fascinating study. In verse number 2, if"
    },
    {
      "id": 105,
      "start": 1130.239990234375,
      "end": 1134.4000244140625,
      "text": " there be found among you within any of thy gates which the Lord thy God giveth"
    },
    {
      "id": 106,
      "start": 1134.4000244140625,
      "end": 1138.4000244140625,
      "text": " thee man or woman that hath wrought wickedness in the sight of the Lord thy"
    },
    {
      "id": 107,
      "start": 1138.4000244140625,
      "end": 1143.0400390625,
      "text": " God and transgressing his covenant and hath gone, notice what it says, and served"
    },
    {
      "id": 108,
      "start": 1143.0400390625,
      "end": 1146.7999877929688,
      "text": " other gods and worshiped them either the sun or moon or any of the host of"
    },
    {
      "id": 109,
      "start": 1146.7999877929688,
      "end": 1151.9199829101562,
      "text": " heaven which I have not commanded and it be told thee and thou hast heard of it"
    },
    {
      "id": 110,
      "start": 1151.9199829101562,
      "end": 1156.8400268554688,
      "text": " and inquired diligently and behold it be true and the thing certain that such"
    },
    {
      "id": 111,
      "start": 1156.8400268554688,
      "end": 1162.9600219726562,
      "text": " abomination is wrought in Israel then shalt thou bring forth that man or that"
    },
    {
      "id": 112,
      "start": 1162.9600219726562,
      "end": 1167.280029296875,
      "text": " woman which have committed that wicked thing unto thy gates even that man or"
    },
    {
      "id": 113,
      "start": 1167.280029296875,
      "end": 1173.3200073242188,
      "text": " that woman and shalt stone them with stones till they die at the mouth of two"
    },
    {
      "id": 114,
      "start": 1173.3200073242188,
      "end": 1177.239990234375,
      "text": " witnesses or three witnesses shall he that is worthy of death be put to death"
    },
    {
      "id": 115,
      "start": 1177.239990234375,
      "end": 1182.3200073242188,
      "text": " but at the mouth of one witness he shall not be put to death and so we"
    },
    {
      "id": 116,
      "start": 1182.3200073242188,
      "end": 1186.4400024414062,
      "text": " understand that as we're here in Hebrews chapter number 10 and we see how that"
    },
    {
      "id": 117,
      "start": 1186.4400024414062,
      "end": 1190.9600219726562,
      "text": " this example of Old Testament Israel is being used and no doubt they would be"
    },
    {
      "id": 118,
      "start": 1190.9600219726562,
      "end": 1195.3599853515625,
      "text": " able to quickly relate back to these truths from the Pentateuch. You could"
    },
    {
      "id": 119,
      "start": 1195.3599853515625,
      "end": 1200.239990234375,
      "text": " jot down in your notes Numbers chapter 15 verses 30 and 31 and reference that"
    },
    {
      "id": 0,
      "start": 1200.239990234375,
      "end": 1205.6399903297424,
      "text": " as well and see how that he's dealing with this truth. Remember, throughout the"
    },
    {
      "id": 1,
      "start": 1205.6399903297424,
      "end": 1210.359990119934,
      "text": " book of Hebrews the writer often refers back to the Old Testament. We have found"
    },
    {
      "id": 2,
      "start": 1210.359990119934,
      "end": 1214.119990348816,
      "text": " on many occasion that he refers back to the Old Testament and takes a messianic"
    },
    {
      "id": 3,
      "start": 1214.119990348816,
      "end": 1219.1999893188477,
      "text": " prophecy and applies it properly to the Lord Jesus Christ. And we find that he's"
    },
    {
      "id": 4,
      "start": 1219.1999893188477,
      "end": 1223.079990386963,
      "text": " used the Old Testament because they were familiar with the Old Testament. I'm"
    },
    {
      "id": 5,
      "start": 1223.079990386963,
      "end": 1227.4399909973145,
      "text": " bothered deeply when people today would say something like this, we're New"
    },
    {
      "id": 6,
      "start": 1227.4399909973145,
      "end": 1230.8799896240234,
      "text": " Testament believers, we don't need the Old Testament, we've made a grave"
    },
    {
      "id": 7,
      "start": 1230.8799896240234,
      "end": 1236.3199920654297,
      "text": " mistake. There are people that believe that, there are people that that operate"
    },
    {
      "id": 8,
      "start": 1236.3199920654297,
      "end": 1239.1999893188477,
      "text": " in that fashion, oh we don't really need the Old Testament, we're New Testament"
    },
    {
      "id": 9,
      "start": 1239.1999893188477,
      "end": 1243.1599884033203,
      "text": " believers. But Paul said that the Old Testament, the things that were written"
    },
    {
      "id": 10,
      "start": 1243.1599884033203,
      "end": 1248.1199913024902,
      "text": " before time were written for our admonition, for our benefit, amen? And so"
    },
    {
      "id": 11,
      "start": 1248.1199913024902,
      "end": 1252.7199897766113,
      "text": " we understand here as we continue in looking here at this example from Old"
    },
    {
      "id": 12,
      "start": 1252.7199897766113,
      "end": 1257.079990386963,
      "text": " Testament Israel, we see the the judgment, remember what he says in verse 28, that"
    },
    {
      "id": 13,
      "start": 1257.079990386963,
      "end": 1260.5199890136719,
      "text": " they died without mercy under two or three witnesses. Then notice how he makes"
    },
    {
      "id": 14,
      "start": 1260.5199890136719,
      "end": 1265.9999923706055,
      "text": " the application of how much sore punishment, suppose ye, shall he be"
    },
    {
      "id": 15,
      "start": 1265.9999923706055,
      "end": 1270.3999938964844,
      "text": " thought worthy who hath trodden underfoot the Son of God, and hath"
    },
    {
      "id": 16,
      "start": 1270.3999938964844,
      "end": 1273.7199935913086,
      "text": " counted the blood of the covenant wherewith he was sanctified an unholy"
    },
    {
      "id": 17,
      "start": 1273.7199935913086,
      "end": 1278.9999923706055,
      "text": " thing, and hath done despite under the Spirit of grace. To despise something is"
    },
    {
      "id": 18,
      "start": 1278.9999923706055,
      "end": 1285.4799880981445,
      "text": " to have the lowest opinion of something. And we notice here in verse number 29, he"
    },
    {
      "id": 19,
      "start": 1285.4799880981445,
      "end": 1288.9199905395508,
      "text": " is using this application, this illustration of Old Testament Israel, and"
    },
    {
      "id": 20,
      "start": 1288.9199905395508,
      "end": 1293.5199890136719,
      "text": " saying, look, they died without mercy, but what if somebody rejects that which"
    },
    {
      "id": 21,
      "start": 1293.5199890136719,
      "end": 1299.3999938964844,
      "text": " Christ has offered? They despise the blood of the Lord Jesus Christ, he's"
    },
    {
      "id": 22,
      "start": 1299.3999938964844,
      "end": 1303.1999893188477,
      "text": " already dealt with the efficacy of Christ's blood, and now these ones that"
    },
    {
      "id": 23,
      "start": 1303.1999893188477,
      "end": 1308.119987487793,
      "text": " they, he says, how much sore or punishment, suppose ye, shall he be thought"
    },
    {
      "id": 24,
      "start": 1308.119987487793,
      "end": 1314.9199905395508,
      "text": " worthy who hath trodden underfoot the Son of God. To be exposed to the truth"
    },
    {
      "id": 25,
      "start": 1314.9199905395508,
      "end": 1321.7199935913086,
      "text": " and to reject it, to be confronted with the teaching of biblical Christianity, to"
    },
    {
      "id": 26,
      "start": 1321.7199935913086,
      "end": 1326.0399932861328,
      "text": " understand what Jesus Christ did on the cross of Calvary, paying for your sin"
    },
    {
      "id": 27,
      "start": 1326.0399932861328,
      "end": 1330.9199829101562,
      "text": " once and for all, not to have this attitude of, let me consider that, or"
    },
    {
      "id": 28,
      "start": 1330.9199829101562,
      "end": 1335.0399932861328,
      "text": " thinking about it, but saying, nope, I'm rejecting that. Oh, that's a dangerous"
    },
    {
      "id": 29,
      "start": 1335.0399932861328,
      "end": 1340.1999969482422,
      "text": " place. There's no other sacrifice, and you're gonna face the judgment of God."
    },
    {
      "id": 30,
      "start": 1340.1999969482422,
      "end": 1344.5199890136719,
      "text": " The reality is, we understand as we compare Scripture with Scripture and"
    },
    {
      "id": 31,
      "start": 1344.5199890136719,
      "end": 1348.6399841308594,
      "text": " look throughout the whole of God's Word, that that penalty is the second death."
    },
    {
      "id": 32,
      "start": 1348.6399841308594,
      "end": 1352.999984741211,
      "text": " It is torment forever in the lake of fire. Notice verse 30, and it says this,"
    },
    {
      "id": 33,
      "start": 1352.999984741211,
      "end": 1357.3599853515625,
      "text": " for we know him that hath said, vengeance belongeth unto me, I will recompense, say"
    },
    {
      "id": 34,
      "start": 1357.3599853515625,
      "end": 1361.3199920654297,
      "text": " it the Lord, and again, the Lord shall judge his people. Deuteronomy 32 verses"
    },
    {
      "id": 35,
      "start": 1361.3199920654297,
      "end": 1366.5999908447266,
      "text": " 35 and 36 are in view here as he quotes this in verse 30. Notice he says, it is a"
    },
    {
      "id": 36,
      "start": 1366.5999908447266,
      "end": 1372.3199920654297,
      "text": " fearful thing to fall into the hands of the living God. It's interesting, Peter"
    },
    {
      "id": 37,
      "start": 1372.4399871826172,
      "end": 1376.3999938964844,
      "text": " says this, you can jot down the reference, I'll read it for you, in 2 Peter"
    },
    {
      "id": 38,
      "start": 1376.3999938964844,
      "end": 1381.3599853515625,
      "text": " chapter number 2, in verses 20 through 22, it says, for if after they have"
    },
    {
      "id": 39,
      "start": 1381.3599853515625,
      "end": 1384.0399932861328,
      "text": " escaped the pollutions of the world through the knowledge of the Lord and"
    },
    {
      "id": 40,
      "start": 1384.0399932861328,
      "end": 1388.1999969482422,
      "text": " Savior Jesus Christ, they are again entangled therein and overcome, the latter"
    },
    {
      "id": 41,
      "start": 1388.1999969482422,
      "end": 1392.3199920654297,
      "text": " end is worse with them than the beginning. For it had been better for"
    },
    {
      "id": 42,
      "start": 1392.3199920654297,
      "end": 1395.239990234375,
      "text": " them not to have known the way of righteousness, than after they have"
    },
    {
      "id": 43,
      "start": 1395.239990234375,
      "end": 1400.759994506836,
      "text": " known it, to turn from the holy commandment delivered unto them. It says,"
    },
    {
      "id": 44,
      "start": 1400.7999877929688,
      "end": 1404.1199951171875,
      "text": " but it has happened unto them according to the true proverb, the dog has turned"
    },
    {
      "id": 45,
      "start": 1404.1199951171875,
      "end": 1409.5199890136719,
      "text": " to his own vomit again, and the sow that was washed to her wallowing in the mire."
    },
    {
      "id": 46,
      "start": 1409.5199890136719,
      "end": 1413.9199829101562,
      "text": " We understand throughout the Word of God that there are false teachers, there are"
    },
    {
      "id": 47,
      "start": 1413.9199829101562,
      "end": 1420.239990234375,
      "text": " people that pretend to outwardly identify as being followers of the Lord"
    },
    {
      "id": 48,
      "start": 1420.239990234375,
      "end": 1424.1999969482422,
      "text": " Jesus Christ. In fact, if you read the book of Jude, you understand that Jude"
    },
    {
      "id": 49,
      "start": 1424.1999969482422,
      "end": 1427.999984741211,
      "text": " says it's necessary for me to write these things unto you, that you earnestly"
    },
    {
      "id": 50,
      "start": 1428.1199951171875,
      "end": 1431.2799835205078,
      "text": " contend for the faith. Why? In verse number 4, he says that there are certain"
    },
    {
      "id": 51,
      "start": 1431.2799835205078,
      "end": 1437.9599914550781,
      "text": " men that have crept in unawares, unawares. And here's what he says that those"
    },
    {
      "id": 52,
      "start": 1437.9599914550781,
      "end": 1442.8199920654297,
      "text": " individuals do, he says that they turned the grace of our God into"
    },
    {
      "id": 53,
      "start": 1442.8199920654297,
      "end": 1448.1599884033203,
      "text": " lasciviousness, and they denied the only Lord God and our Lord Jesus Christ. That"
    },
    {
      "id": 54,
      "start": 1448.1599884033203,
      "end": 1455.9599914550781,
      "text": " lasciviousness is unbridled lust. And we find here that we notice that the author"
    },
    {
      "id": 55,
      "start": 1456.1599884033203,
      "end": 1460.0799865722656,
      "text": " of Hebrews is explaining some very important truth to these that he's"
    },
    {
      "id": 56,
      "start": 1460.0799865722656,
      "end": 1464.0799865722656,
      "text": " writing to. Listen, there's no place to go. Who are we gonna go?"
    },
    {
      "id": 57,
      "start": 1464.0799865722656,
      "end": 1468.7200012207031,
      "text": " Remember what Peter said when all of them forsook him? They all forsook the"
    },
    {
      "id": 58,
      "start": 1468.7200012207031,
      "end": 1473.3199768066406,
      "text": " Lord, and we find that as they're there and Jesus speaks to them, it's"
    },
    {
      "id": 59,
      "start": 1473.3199768066406,
      "end": 1477.7200012207031,
      "text": " recorded for us in John chapter number 6 at the end of the passage, many"
    },
    {
      "id": 60,
      "start": 1477.7200012207031,
      "end": 1482.6799926757812,
      "text": " people left and they deserted them. And Jesus says, will you also go away? And"
    },
    {
      "id": 61,
      "start": 1482.7200012207031,
      "end": 1488.2799987792969,
      "text": " Peter stands up in John 6 and verse number 68, and he says to whom? He says"
    },
    {
      "id": 62,
      "start": 1488.2799987792969,
      "end": 1494.6399841308594,
      "text": " this, Lord, to whom shall we go? Thou hast the words of eternal life, and we believe"
    },
    {
      "id": 63,
      "start": 1494.6399841308594,
      "end": 1501.4400024414062,
      "text": " and are sure that thou art that Christ, the Son of the living God. We notice not"
    },
    {
      "id": 64,
      "start": 1501.4400024414062,
      "end": 1504.7999877929688,
      "text": " only what was explained as we continue looking at the passage of Scripture in"
    },
    {
      "id": 65,
      "start": 1504.7999877929688,
      "end": 1509.1199951171875,
      "text": " Hebrews, notice what they endured. Number two, notice what they endured. Verses 32"
    },
    {
      "id": 66,
      "start": 1509.1999816894531,
      "end": 1514.7999877929688,
      "text": " through 35 reveal to us some of that which they suffered because of their"
    },
    {
      "id": 67,
      "start": 1514.7999877929688,
      "end": 1519.1199951171875,
      "text": " conversion. It says this, but call to remembrance the former days. And so we"
    },
    {
      "id": 68,
      "start": 1519.1199951171875,
      "end": 1524.3199768066406,
      "text": " see that there's a reminder here of what had been experienced, what they endured."
    },
    {
      "id": 69,
      "start": 1524.3199768066406,
      "end": 1530.4400024414062,
      "text": " It says this, in which after you were illuminated, ye endured a great fight of"
    },
    {
      "id": 70,
      "start": 1530.4400024414062,
      "end": 1536.1199951171875,
      "text": " afflictions. We notice the afflictions of these individuals that is mentioned here"
    },
    {
      "id": 71,
      "start": 1536.1199951171875,
      "end": 1540.9199829101562,
      "text": " in verse number 32, a great fight of afflictions, these sufferings. We"
    },
    {
      "id": 72,
      "start": 1540.9199829101562,
      "end": 1544.7999877929688,
      "text": " understand that Peter, in fact, would write the book of 1 Peter to those that"
    },
    {
      "id": 73,
      "start": 1544.7999877929688,
      "end": 1550.0399780273438,
      "text": " were suffering, those that were dealing with hardship and difficulty because of"
    },
    {
      "id": 74,
      "start": 1550.0399780273438,
      "end": 1557.0799865722656,
      "text": " the very fact that they identified with the Lord Jesus Christ. This morning, for"
    },
    {
      "id": 75,
      "start": 1557.0799865722656,
      "end": 1561.47998046875,
      "text": " most of my lifetime and most of your lifetime in the United States of America,"
    },
    {
      "id": 76,
      "start": 1561.47998046875,
      "end": 1565.3999938964844,
      "text": " we have not really suffered because of our identifying with the Lord Jesus"
    },
    {
      "id": 77,
      "start": 1565.4400024414062,
      "end": 1572.7200012207031,
      "text": " Christ. Amen? We find that there are folks around the globe that suffer greatly"
    },
    {
      "id": 78,
      "start": 1572.7200012207031,
      "end": 1577.4400024414062,
      "text": " because they've identified with the Lord Jesus Christ. It was a very common thing"
    },
    {
      "id": 79,
      "start": 1577.4400024414062,
      "end": 1582.1199951171875,
      "text": " in the first century that as they would identify with the Lord Jesus Christ, you"
    },
    {
      "id": 80,
      "start": 1582.1199951171875,
      "end": 1586.0,
      "text": " find this still in many countries around the world today, that if you were to"
    },
    {
      "id": 81,
      "start": 1586.0,
      "end": 1591.3199768066406,
      "text": " identify with the Lord Jesus Christ that your family would consider you dead."
    },
    {
      "id": 82,
      "start": 1591.9199829101562,
      "end": 1599.5999755859375,
      "text": " Because you have forsaken whatever your original religion was, and many nations"
    },
    {
      "id": 83,
      "start": 1599.5999755859375,
      "end": 1604.8399963378906,
      "text": " around the world would look at their culture and religion being one in the"
    },
    {
      "id": 84,
      "start": 1604.8399963378906,
      "end": 1610.7599792480469,
      "text": " same. And in those particular countries around the world, you find that believers"
    },
    {
      "id": 85,
      "start": 1610.7599792480469,
      "end": 1615.8399963378906,
      "text": " face great levels of persecution and great levels of suffering simply because"
    },
    {
      "id": 86,
      "start": 1615.8800048828125,
      "end": 1621.6399841308594,
      "text": " they've identified with the Lord Jesus Christ. When I trust that Christ is my"
    },
    {
      "id": 87,
      "start": 1621.6399841308594,
      "end": 1629.3999938964844,
      "text": " Savior, there were people that were rejoicing. Honestly. And I'm going to"
    },
    {
      "id": 88,
      "start": 1629.3999938964844,
      "end": 1632.5999755859375,
      "text": " assume this morning that when you trust that the Lord Jesus Christ is your"
    },
    {
      "id": 89,
      "start": 1632.5999755859375,
      "end": 1637.1999816894531,
      "text": " Savior, that there were people that were rejoicing. Tomorrow is my spiritual"
    },
    {
      "id": 90,
      "start": 1637.1999816894531,
      "end": 1643.1600036621094,
      "text": " birthday. I love being mindful of the day in which I trust that the Lord Jesus"
    },
    {
      "id": 91,
      "start": 1643.1999816894531,
      "end": 1649.1600036621094,
      "text": " Christ is my Savior. It was 23 years ago tomorrow. And I'm so thankful. And there"
    },
    {
      "id": 92,
      "start": 1649.1600036621094,
      "end": 1653.47998046875,
      "text": " was rejoicing just a few weeks ago on a Sunday evening. We had a baptismal"
    },
    {
      "id": 93,
      "start": 1653.47998046875,
      "end": 1659.8800048828125,
      "text": " service, and we baptized three young men. And we were rejoicing. We were thankful"
    },
    {
      "id": 94,
      "start": 1659.8800048828125,
      "end": 1664.6799926757812,
      "text": " for their following the Lord in believers' baptism. Amen? It doesn't"
    },
    {
      "id": 95,
      "start": 1664.6799926757812,
      "end": 1669.1999816894531,
      "text": " happen in some nations around the world. And that wasn't a common thing in the"
    },
    {
      "id": 96,
      "start": 1669.1999816894531,
      "end": 1671.9199829101562,
      "text": " first century. Yes, there'd be some that would rejoice, but we know that there'd"
    },
    {
      "id": 97,
      "start": 1671.9199829101562,
      "end": 1678.8800048828125,
      "text": " be some that would say, they're dead to me. You know that those that had shops"
    },
    {
      "id": 98,
      "start": 1678.8800048828125,
      "end": 1682.6799926757812,
      "text": " and various types of services, that if you identified with Christ, people would"
    },
    {
      "id": 99,
      "start": 1682.6799926757812,
      "end": 1687.9199829101562,
      "text": " stop buying from you. They would try to starve you. Do you know that the raw"
    },
    {
      "id": 100,
      "start": 1687.9199829101562,
      "end": 1691.0799865722656,
      "text": " materials that you would need for whatever occupation it was that you were"
    },
    {
      "id": 101,
      "start": 1691.0799865722656,
      "end": 1695.5999755859375,
      "text": " engaged in, that those suppliers of those raw materials in many cases would stop"
    },
    {
      "id": 102,
      "start": 1695.5999755859375,
      "end": 1700.3199768066406,
      "text": " selling to you. So that you would not have the ability to even make what you"
    },
    {
      "id": 103,
      "start": 1700.3599853515625,
      "end": 1705.9599914550781,
      "text": " had been making. Yet alone do you have those that would not buy from you, but"
    },
    {
      "id": 104,
      "start": 1705.9599914550781,
      "end": 1709.5599975585938,
      "text": " now you can't even get the raw materials that you need. It was a terrible"
    },
    {
      "id": 105,
      "start": 1709.5599975585938,
      "end": 1714.5999755859375,
      "text": " situation. But God took care of them. That's why you see so often in the New"
    },
    {
      "id": 106,
      "start": 1714.5999755859375,
      "end": 1720.47998046875,
      "text": " Testament this truth about using hospitality and loving the brethren. And"
    },
    {
      "id": 107,
      "start": 1720.47998046875,
      "end": 1725.0800170898438,
      "text": " we often say that our brothers and sisters in Christ, that we have this"
    },
    {
      "id": 108,
      "start": 1725.0800170898438,
      "end": 1732.2799682617188,
      "text": " bond. I'm so thankful for it. We can enjoy fellowship one with another. Why?"
    },
    {
      "id": 109,
      "start": 1732.2799682617188,
      "end": 1737.47998046875,
      "text": " Because our common bond is the Lord Jesus Christ. We notice that it says here"
    },
    {
      "id": 110,
      "start": 1737.47998046875,
      "end": 1740.52001953125,
      "text": " in verse number 32, but call to remembrance the former days in which"
    },
    {
      "id": 111,
      "start": 1740.52001953125,
      "end": 1744.0800170898438,
      "text": " after you were illuminated you endured a great fight of afflictions. Notice this,"
    },
    {
      "id": 112,
      "start": 1744.0800170898438,
      "end": 1749.260009765625,
      "text": " partly, part of what you suffered whilst you were made a gazing stock both by"
    },
    {
      "id": 113,
      "start": 1749.260009765625,
      "end": 1755.0399780273438,
      "text": " reproaches and afflictions. And that idea of being a gazing stock is a spectacle."
    },
    {
      "id": 114,
      "start": 1756.0,
      "end": 1762.1199951171875,
      "text": " He says here, notice what it says as we continue in verse number 33. It says,"
    },
    {
      "id": 115,
      "start": 1762.1199951171875,
      "end": 1769.0399780273438,
      "text": " and partly whilst you became companions of them that were so used. We see there"
    },
    {
      "id": 116,
      "start": 1769.0399780273438,
      "end": 1773.760009765625,
      "text": " not only afflictions that they endured, but were mindful here of their"
    },
    {
      "id": 117,
      "start": 1773.760009765625,
      "end": 1778.3599853515625,
      "text": " compassion as it kind of goes into verse number 34. It says, for you had compassion"
    },
    {
      "id": 118,
      "start": 1778.3599853515625,
      "end": 1783.6400146484375,
      "text": " of me in my bonds. The compassion that they had towards those that were"
    },
    {
      "id": 119,
      "start": 1783.6400146484375,
      "end": 1788.2799682617188,
      "text": " persecuted, to those that were in prison. We understand the Apostle Paul"
    },
    {
      "id": 120,
      "start": 1788.2799682617188,
      "end": 1793.0399780273438,
      "text": " often faced imprisonment. In fact, in a number of the letters that Paul penned"
    },
    {
      "id": 121,
      "start": 1793.0399780273438,
      "end": 1799.3599853515625,
      "text": " under the inspiration of the Holy Spirit of God, he penned from a prison. He"
    },
    {
      "id": 122,
      "start": 1799.3599853515625,
      "end": 1802.1199951171875,
      "text": " mentions how"
    },
    {
      "id": 0,
      "start": 1802.1199951171875,
      "end": 1804.9599950313568,
      "text": " We saw that specifically in the book of Philippians"
    },
    {
      "id": 1,
      "start": 1804.9599950313568,
      "end": 1806.559995174408,
      "text": " to the believers at Philippi,"
    },
    {
      "id": 2,
      "start": 1806.559995174408,
      "end": 1809.3599948883057,
      "text": " how they communicated with Him once and again"
    },
    {
      "id": 3,
      "start": 1809.3599948883057,
      "end": 1813.1999950408936,
      "text": " as you read Philippians 4."
    },
    {
      "id": 4,
      "start": 1813.1999950408936,
      "end": 1815.9199953079224,
      "text": " We see here that they had compassion."
    },
    {
      "id": 5,
      "start": 1815.9199953079224,
      "end": 1816.9199953079224,
      "text": " Notice what it says."
    },
    {
      "id": 6,
      "start": 1816.9199953079224,
      "end": 1818.319995880127,
      "text": " This is an interesting phrase"
    },
    {
      "id": 7,
      "start": 1818.319995880127,
      "end": 1819.7199954986572,
      "text": " in the middle of verse 34."
    },
    {
      "id": 8,
      "start": 1819.7199954986572,
      "end": 1826.0399951934814,
      "text": " \"...And took joyfully the spoiling of your goods.\""
    },
    {
      "id": 9,
      "start": 1826.0399951934814,
      "end": 1829.1999950408936,
      "text": " It's interesting to me that they took it joyfully."
    },
    {
      "id": 10,
      "start": 1829.1999950408936,
      "end": 1831.239995956421,
      "text": " The spoiling of your goods."
    },
    {
      "id": 11,
      "start": 1831.239995956421,
      "end": 1834.479995727539,
      "text": " You might take it and be disappointed."
    },
    {
      "id": 12,
      "start": 1834.479995727539,
      "end": 1835.6799964904785,
      "text": " Be overwhelmed."
    },
    {
      "id": 13,
      "start": 1835.6799964904785,
      "end": 1837.0799942016602,
      "text": " What are we going to do?"
    },
    {
      "id": 14,
      "start": 1837.0799942016602,
      "end": 1839.3599967956543,
      "text": " I can't believe this happened."
    },
    {
      "id": 15,
      "start": 1839.3599967956543,
      "end": 1840.9999961853027,
      "text": " But they took it joyfully."
    },
    {
      "id": 16,
      "start": 1840.9999961853027,
      "end": 1842.0799942016602,
      "text": " Why?"
    },
    {
      "id": 17,
      "start": 1842.0799942016602,
      "end": 1844.1599960327148,
      "text": " Because of some knowledge that they had."
    },
    {
      "id": 18,
      "start": 1844.1599960327148,
      "end": 1845.919994354248,
      "text": " Look at the end of verse 34."
    },
    {
      "id": 19,
      "start": 1845.919994354248,
      "end": 1849.759994506836,
      "text": " \"...Knowing in yourselves that ye have in heaven"
    },
    {
      "id": 20,
      "start": 1849.759994506836,
      "end": 1854.7999954223633,
      "text": " a better and an enduring substance."
    },
    {
      "id": 21,
      "start": 1854.7999954223633,
      "end": 1857.479995727539,
      "text": " Lay up for yourselves treasures in heaven,"
    },
    {
      "id": 22,
      "start": 1857.479995727539,
      "end": 1860.4399948120117,
      "text": " where neither moth nor rust doth decay.\""
    },
    {
      "id": 23,
      "start": 1861.3999938964844,
      "end": 1864.1599960327148,
      "text": " And what a joy to think about the fact"
    },
    {
      "id": 24,
      "start": 1864.1599960327148,
      "end": 1865.5199966430664,
      "text": " that these individuals,"
    },
    {
      "id": 25,
      "start": 1865.5199966430664,
      "end": 1868.759994506836,
      "text": " how could they deal with the spoiling of their goods joyfully"
    },
    {
      "id": 26,
      "start": 1868.759994506836,
      "end": 1870.2799987792969,
      "text": " because they had an understanding"
    },
    {
      "id": 27,
      "start": 1870.2799987792969,
      "end": 1872.479995727539,
      "text": " that this world is not my home."
    },
    {
      "id": 28,
      "start": 1872.479995727539,
      "end": 1874.1199951171875,
      "text": " I'm just a passing through."
    },
    {
      "id": 29,
      "start": 1874.1199951171875,
      "end": 1875.0799942016602,
      "text": " I'm not suggesting,"
    },
    {
      "id": 30,
      "start": 1875.0799942016602,
      "end": 1876.759994506836,
      "text": " listen, if you weren't here Wednesday night,"
    },
    {
      "id": 31,
      "start": 1876.759994506836,
      "end": 1878.2799987792969,
      "text": " you weren't tuned in on live stream,"
    },
    {
      "id": 32,
      "start": 1878.2799987792969,
      "end": 1879.599998474121,
      "text": " listen to the message."
    },
    {
      "id": 33,
      "start": 1879.599998474121,
      "end": 1881.1599960327148,
      "text": " I trust it'll be a blessing to you."
    },
    {
      "id": 34,
      "start": 1881.1599960327148,
      "end": 1881.9199981689453,
      "text": " It's on YouTube."
    },
    {
      "id": 35,
      "start": 1881.9199981689453,
      "end": 1883.0399932861328,
      "text": " It's on our website."
    },
    {
      "id": 36,
      "start": 1883.0399932861328,
      "end": 1884.879997253418,
      "text": " And as you think about that message,"
    },
    {
      "id": 37,
      "start": 1884.879997253418,
      "end": 1886.9199981689453,
      "text": " I spoke about the fact in Acts 4"
    },
    {
      "id": 38,
      "start": 1886.9199981689453,
      "end": 1889.0399932861328,
      "text": " that they had been with Jesus."
    },
    {
      "id": 39,
      "start": 1889.0399932861328,
      "end": 1890.639991760254,
      "text": " And I said this in the message,"
    },
    {
      "id": 40,
      "start": 1890.639991760254,
      "end": 1893.2399978637695,
      "text": " and I believe it's so important for us to understand"
    },
    {
      "id": 41,
      "start": 1893.2399978637695,
      "end": 1899.0399932861328,
      "text": " that being with Jesus does not prevent the hardship,"
    },
    {
      "id": 42,
      "start": 1899.0399932861328,
      "end": 1904.5199966430664,
      "text": " but it certainly will help you be prepared for the hardship."
    },
    {
      "id": 43,
      "start": 1904.5199966430664,
      "end": 1905.639991760254,
      "text": " Amen?"
    },
    {
      "id": 44,
      "start": 1905.639991760254,
      "end": 1906.5599975585938,
      "text": " These folks, they had,"
    },
    {
      "id": 45,
      "start": 1906.5599975585938,
      "end": 1908.1599960327148,
      "text": " man, this world's not my home."
    },
    {
      "id": 46,
      "start": 1908.1599960327148,
      "end": 1909.9599914550781,
      "text": " I'm just passing through."
    },
    {
      "id": 47,
      "start": 1909.9599914550781,
      "end": 1911.479995727539,
      "text": " I'm looking upward."
    },
    {
      "id": 48,
      "start": 1911.479995727539,
      "end": 1913.1999969482422,
      "text": " I'm looking for my Savior."
    },
    {
      "id": 49,
      "start": 1913.1999969482422,
      "end": 1914.5599975585938,
      "text": " I'm looking for heaven."
    },
    {
      "id": 50,
      "start": 1914.5599975585938,
      "end": 1915.5199966430664,
      "text": " Amen?"
    },
    {
      "id": 51,
      "start": 1915.5199966430664,
      "end": 1917.9999923706055,
      "text": " And we find here that he goes"
    },
    {
      "id": 52,
      "start": 1918.1199951171875,
      "end": 1920.1599960327148,
      "text": " and we understand their confidence."
    },
    {
      "id": 53,
      "start": 1920.1599960327148,
      "end": 1922.639991760254,
      "text": " We see that here in verse number 35."
    },
    {
      "id": 54,
      "start": 1922.639991760254,
      "end": 1924.8399963378906,
      "text": " Cast not away therefore your confidence,"
    },
    {
      "id": 55,
      "start": 1924.8399963378906,
      "end": 1927.599998474121,
      "text": " which hath great recompense of reward."
    },
    {
      "id": 56,
      "start": 1927.599998474121,
      "end": 1930.1199951171875,
      "text": " I remember back last Sunday morning,"
    },
    {
      "id": 57,
      "start": 1930.1199951171875,
      "end": 1931.479995727539,
      "text": " we looked at verse 23."
    },
    {
      "id": 58,
      "start": 1931.479995727539,
      "end": 1933.8799896240234,
      "text": " Let us hold fast the profession of our faith."
    },
    {
      "id": 59,
      "start": 1933.8799896240234,
      "end": 1936.239990234375,
      "text": " And remember it says without wavering."
    },
    {
      "id": 60,
      "start": 1937.2799987792969,
      "end": 1939.3999938964844,
      "text": " Having that confidence of that assurance."
    },
    {
      "id": 61,
      "start": 1939.3999938964844,
      "end": 1940.239990234375,
      "text": " Why?"
    },
    {
      "id": 62,
      "start": 1940.239990234375,
      "end": 1943.1599884033203,
      "text": " Because he is faithful that promised."
    },
    {
      "id": 63,
      "start": 1943.1599884033203,
      "end": 1945.8799896240234,
      "text": " Remember, biblical Christianity is not pie in the sky."
    },
    {
      "id": 64,
      "start": 1945.8799896240234,
      "end": 1947.5599975585938,
      "text": " Let's hope everything's gonna work out."
    },
    {
      "id": 65,
      "start": 1947.6399993896484,
      "end": 1950.6799926757812,
      "text": " No, we're basing it upon revealed truth"
    },
    {
      "id": 66,
      "start": 1950.6799926757812,
      "end": 1953.479995727539,
      "text": " that Jesus has given us in His Word."
    },
    {
      "id": 67,
      "start": 1953.479995727539,
      "end": 1955.1599884033203,
      "text": " And we're taking God at His Word."
    },
    {
      "id": 68,
      "start": 1955.1599884033203,
      "end": 1956.7200012207031,
      "text": " What does it mean to live by faith?"
    },
    {
      "id": 69,
      "start": 1956.7200012207031,
      "end": 1958.3199920654297,
      "text": " To believe God."
    },
    {
      "id": 70,
      "start": 1958.3199920654297,
      "end": 1960.239990234375,
      "text": " To trust Him."
    },
    {
      "id": 71,
      "start": 1960.239990234375,
      "end": 1961.9599914550781,
      "text": " To have nothing wavering."
    },
    {
      "id": 72,
      "start": 1961.9599914550781,
      "end": 1962.7999877929688,
      "text": " Why?"
    },
    {
      "id": 73,
      "start": 1962.7999877929688,
      "end": 1967.3199920654297,
      "text": " Because I know that He that is promised is faithful."
    },
    {
      "id": 74,
      "start": 1967.3199920654297,
      "end": 1969.8399963378906,
      "text": " And they could endure the things that they endured"
    },
    {
      "id": 75,
      "start": 1969.8399963378906,
      "end": 1972.7999877929688,
      "text": " because of their understanding."
    },
    {
      "id": 76,
      "start": 1972.7999877929688,
      "end": 1976.479995727539,
      "text": " Because they had an understanding of who Christ is."
    },
    {
      "id": 77,
      "start": 1976.479995727539,
      "end": 1978.3199920654297,
      "text": " An understanding of their eternity."
    },
    {
      "id": 78,
      "start": 1979.6399993896484,
      "end": 1984.5199890136719,
      "text": " What a joy to see those that have gone before us"
    },
    {
      "id": 79,
      "start": 1984.5199890136719,
      "end": 1987.7999877929688,
      "text": " that have suffered greatly that remain faithful."
    },
    {
      "id": 80,
      "start": 1987.7999877929688,
      "end": 1989.3999938964844,
      "text": " It's a challenge to me."
    },
    {
      "id": 81,
      "start": 1989.3999938964844,
      "end": 1990.2799987792969,
      "text": " It really is."
    },
    {
      "id": 82,
      "start": 1991.1999969482422,
      "end": 1993.9599914550781,
      "text": " I'm challenged often when I read"
    },
    {
      "id": 83,
      "start": 1993.9599914550781,
      "end": 1997.0,
      "text": " about those that have gone before us"
    },
    {
      "id": 84,
      "start": 1997.0,
      "end": 2001.0,
      "text": " and have been faithful and suffered great afflictions."
    },
    {
      "id": 85,
      "start": 2001.0,
      "end": 2003.239990234375,
      "text": " Great difficulties."
    },
    {
      "id": 86,
      "start": 2003.239990234375,
      "end": 2005.0800018310547,
      "text": " And yet they remain faithful."
    },
    {
      "id": 87,
      "start": 2005.0800018310547,
      "end": 2006.479995727539,
      "text": " God's used them."
    },
    {
      "id": 88,
      "start": 2006.479995727539,
      "end": 2008.1199951171875,
      "text": " What a joy."
    },
    {
      "id": 89,
      "start": 2008.1199951171875,
      "end": 2011.3999938964844,
      "text": " We notice that there's, as we begin this passage,"
    },
    {
      "id": 90,
      "start": 2011.3999938964844,
      "end": 2012.6799926757812,
      "text": " we notice what is explained."
    },
    {
      "id": 91,
      "start": 2012.6799926757812,
      "end": 2013.7200012207031,
      "text": " We notice what they endured."
    },
    {
      "id": 92,
      "start": 2013.7200012207031,
      "end": 2015.239990234375,
      "text": " Now I want you to see as we wrap up"
    },
    {
      "id": 93,
      "start": 2015.239990234375,
      "end": 2018.1999969482422,
      "text": " in verses 36 through 39, number three this morning,"
    },
    {
      "id": 94,
      "start": 2018.1999969482422,
      "end": 2021.2799987792969,
      "text": " notice how they were encouraged."
    },
    {
      "id": 95,
      "start": 2021.2799987792969,
      "end": 2022.5599975585938,
      "text": " Notice how they were encouraged."
    },
    {
      "id": 96,
      "start": 2022.5599975585938,
      "end": 2025.3600006103516,
      "text": " You know, people need encouragement."
    },
    {
      "id": 97,
      "start": 2026.3600006103516,
      "end": 2027.4400024414062,
      "text": " You know that?"
    },
    {
      "id": 98,
      "start": 2027.4400024414062,
      "end": 2029.6799926757812,
      "text": " There are times in which you need encouragement."
    },
    {
      "id": 99,
      "start": 2029.6799926757812,
      "end": 2032.0399932861328,
      "text": " You say, oh, not me, I'm always positive."
    },
    {
      "id": 100,
      "start": 2032.0399932861328,
      "end": 2033.8799896240234,
      "text": " There are times that you need encouragement."
    },
    {
      "id": 101,
      "start": 2033.8799896240234,
      "end": 2034.7200012207031,
      "text": " Amen?"
    },
    {
      "id": 102,
      "start": 2035.1199951171875,
      "end": 2037.5999908447266,
      "text": " There are times that we all need to be encouraged."
    },
    {
      "id": 103,
      "start": 2037.5999908447266,
      "end": 2039.3999938964844,
      "text": " Can I tell you that the Word of God,"
    },
    {
      "id": 104,
      "start": 2039.3999938964844,
      "end": 2041.0,
      "text": " the Word of God is powerful."
    },
    {
      "id": 105,
      "start": 2041.0,
      "end": 2041.8399963378906,
      "text": " It's precious."
    },
    {
      "id": 106,
      "start": 2041.8399963378906,
      "end": 2043.2799987792969,
      "text": " It's unique."
    },
    {
      "id": 107,
      "start": 2043.2799987792969,
      "end": 2045.3199920654297,
      "text": " The reason that I say the Word of God is unique"
    },
    {
      "id": 108,
      "start": 2045.3199920654297,
      "end": 2047.5999908447266,
      "text": " is because I can read this book"
    },
    {
      "id": 109,
      "start": 2047.5999908447266,
      "end": 2051.0800018310547,
      "text": " and in a sitting of reading the Word of God"
    },
    {
      "id": 110,
      "start": 2051.0800018310547,
      "end": 2052.3600006103516,
      "text": " and a time of sitting"
    },
    {
      "id": 111,
      "start": 2052.3600006103516,
      "end": 2054.279998779297,
      "text": " and hearing the preaching of the Word of God,"
    },
    {
      "id": 112,
      "start": 2054.279998779297,
      "end": 2057.1199951171875,
      "text": " God can use His Word to convict me."
    },
    {
      "id": 113,
      "start": 2058.6000061035156,
      "end": 2059.6799926757812,
      "text": " Amen?"
    },
    {
      "id": 114,
      "start": 2059.6799926757812,
      "end": 2062.3200073242188,
      "text": " God can use His Word to challenge me."
    },
    {
      "id": 115,
      "start": 2063.3200073242188,
      "end": 2066.1199951171875,
      "text": " To bring me to a place of decision."
    },
    {
      "id": 116,
      "start": 2066.1199951171875,
      "end": 2066.959991455078,
      "text": " But at the same time,"
    },
    {
      "id": 117,
      "start": 2066.959991455078,
      "end": 2068.7999877929688,
      "text": " He can use the same Word to comfort me"
    },
    {
      "id": 118,
      "start": 2068.7999877929688,
      "end": 2070.720001220703,
      "text": " and to encourage me."
    },
    {
      "id": 119,
      "start": 2070.720001220703,
      "end": 2074.3200073242188,
      "text": " It's amazing how that God can use His Word"
    },
    {
      "id": 120,
      "start": 2074.3200073242188,
      "end": 2076.3200073242188,
      "text": " in so many ways in our lives."
    },
    {
      "id": 121,
      "start": 2076.3200073242188,
      "end": 2078.0799865722656,
      "text": " And we find that as we wrap up"
    },
    {
      "id": 122,
      "start": 2078.0799865722656,
      "end": 2079.8800048828125,
      "text": " the 10th chapter of the book of Hebrews,"
    },
    {
      "id": 123,
      "start": 2079.8800048828125,
      "end": 2082.6399841308594,
      "text": " that there is some encouragement."
    },
    {
      "id": 124,
      "start": 2082.6399841308594,
      "end": 2085.9199829101562,
      "text": " We notice how these recipients would be encouraged"
    },
    {
      "id": 125,
      "start": 2085.9199829101562,
      "end": 2087.6399841308594,
      "text": " by that which they have received."
    },
    {
      "id": 126,
      "start": 2087.6399841308594,
      "end": 2090.1600036621094,
      "text": " I believe that there's a two-fold aspect"
    },
    {
      "id": 127,
      "start": 2090.1600036621094,
      "end": 2091.040008544922,
      "text": " of the encouragement."
    },
    {
      "id": 128,
      "start": 2091.040008544922,
      "end": 2094.279998779297,
      "text": " Number one, they are encouraged with a promise."
    },
    {
      "id": 129,
      "start": 2094.279998779297,
      "end": 2097.279998779297,
      "text": " I'm thankful for the promises of God's Word, aren't you?"
    },
    {
      "id": 130,
      "start": 2097.279998779297,
      "end": 2099.47998046875,
      "text": " In fact, we understand that even"
    },
    {
      "id": 131,
      "start": 2099.47998046875,
      "end": 2101.3599853515625,
      "text": " as the ladies sang this morning,"
    },
    {
      "id": 132,
      "start": 2101.3599853515625,
      "end": 2104.040008544922,
      "text": " that they sang a little bit about the promises, right?"
    },
    {
      "id": 133,
      "start": 2104.040008544922,
      "end": 2107.6399841308594,
      "text": " About understanding that God has promised these things"
    },
    {
      "id": 134,
      "start": 2107.6399841308594,
      "end": 2110.1199951171875,
      "text": " and God will not falter."
    },
    {
      "id": 135,
      "start": 2110.1199951171875,
      "end": 2111.6399841308594,
      "text": " The end of that first verse,"
    },
    {
      "id": 136,
      "start": 2111.6399841308594,
      "end": 2112.720001220703,
      "text": " thank you for typing it out."
    },
    {
      "id": 137,
      "start": 2112.720001220703,
      "end": 2113.5599975585938,
      "text": " I could reference it."
    },
    {
      "id": 138,
      "start": 2113.5599975585938,
      "end": 2115.760009765625,
      "text": " Your promises are ever new."
    },
    {
      "id": 139,
      "start": 2115.760009765625,
      "end": 2118.760009765625,
      "text": " I claim them for today."
    },
    {
      "id": 140,
      "start": 2119.760009765625,
      "end": 2121.1199951171875,
      "text": " Peter said that they're exceeding"
    },
    {
      "id": 141,
      "start": 2121.1199951171875,
      "end": 2123.6799926757812,
      "text": " great and precious promises, amen?"
    },
    {
      "id": 142,
      "start": 2123.6799926757812,
      "end": 2126.199981689453,
      "text": " And we can look at the promises of God's Word"
    },
    {
      "id": 143,
      "start": 2126.199981689453,
      "end": 2127.760009765625,
      "text": " and they bring us encouragement."
    },
    {
      "id": 144,
      "start": 2127.760009765625,
      "end": 2128.9199829101562,
      "text": " They give us hope."
    },
    {
      "id": 145,
      "start": 2128.9199829101562,
      "end": 2132.040008544922,
      "text": " They give us reason and purpose."
    },
    {
      "id": 146,
      "start": 2132.040008544922,
      "end": 2135.519989013672,
      "text": " And we see here in verses 36 and 37,"
    },
    {
      "id": 147,
      "start": 2135.519989013672,
      "end": 2137.47998046875,
      "text": " the first way in which they're encouraged"
    },
    {
      "id": 148,
      "start": 2137.47998046875,
      "end": 2139.239990234375,
      "text": " is with this promise."
    },
    {
      "id": 149,
      "start": 2139.239990234375,
      "end": 2141.47998046875,
      "text": " It says in verse number 35,"
    },
    {
      "id": 150,
      "start": 2141.47998046875,
      "end": 2142.959991455078,
      "text": " we just finished up and you kind of see"
    },
    {
      "id": 151,
      "start": 2142.959991455078,
      "end": 2144.7999877929688,
      "text": " how it segues right into verse 36."
    },
    {
      "id": 152,
      "start": 2144.7999877929688,
      "end": 2146.6000061035156,
      "text": " Cast not away therefore your confidence,"
    },
    {
      "id": 153,
      "start": 2146.7999877929688,
      "end": 2149.1600036621094,
      "text": " which hath great recompense of reward,"
    },
    {
      "id": 154,
      "start": 2149.1600036621094,
      "end": 2151.8399963378906,
      "text": " for ye have need of patience,"
    },
    {
      "id": 155,
      "start": 2151.8399963378906,
      "end": 2154.5599975585938,
      "text": " that after ye have done the will of God,"
    },
    {
      "id": 156,
      "start": 2154.5599975585938,
      "end": 2157.6799926757812,
      "text": " ye might receive the promise."
    },
    {
      "id": 157,
      "start": 2157.6799926757812,
      "end": 2158.720001220703,
      "text": " And then he says this,"
    },
    {
      "id": 158,
      "start": 2158.720001220703,
      "end": 2160.6399841308594,
      "text": " we used it as our title this morning,"
    },
    {
      "id": 159,
      "start": 2160.6399841308594,
      "end": 2161.8800048828125,
      "text": " for yet a little while,"
    },
    {
      "id": 160,
      "start": 2161.8800048828125,
      "end": 2164.6000061035156,
      "text": " and he that shall come will come"
    },
    {
      "id": 161,
      "start": 2164.6000061035156,
      "end": 2167.6799926757812,
      "text": " and will not tarry."
    },
    {
      "id": 162,
      "start": 2167.6799926757812,
      "end": 2169.47998046875,
      "text": " Have you ever heard somebody say"
    },
    {
      "id": 163,
      "start": 2172.760009765625,
      "end": 2174.959991455078,
      "text": " that the Lord's gonna tarry His return?"
    },
    {
      "id": 164,
      "start": 2174.959991455078,
      "end": 2176.199981689453,
      "text": " You ever heard anyone say that?"
    },
    {
      "id": 165,
      "start": 2176.239990234375,
      "end": 2177.8800048828125,
      "text": " If the Lord does not tarry."
    },
    {
      "id": 166,
      "start": 2177.8800048828125,
      "end": 2178.720001220703,
      "text": " You never heard anyone say that?"
    },
    {
      "id": 167,
      "start": 2178.720001220703,
      "end": 2180.239990234375,
      "text": " I've heard it so many times."
    },
    {
      "id": 168,
      "start": 2180.239990234375,
      "end": 2181.5599975585938,
      "text": " If the Lord does not tarry."
    },
    {
      "id": 169,
      "start": 2181.5599975585938,
      "end": 2182.720001220703,
      "text": " You know what the word tarry means?"
    },
    {
      "id": 170,
      "start": 2182.720001220703,
      "end": 2183.6000061035156,
      "text": " It means to delay."
    },
    {
      "id": 171,
      "start": 2183.6000061035156,
      "end": 2185.3200073242188,
      "text": " It means to linger."
    },
    {
      "id": 172,
      "start": 2185.3200073242188,
      "end": 2188.47998046875,
      "text": " The Word of God says that He will not tarry."
    },
    {
      "id": 173,
      "start": 2188.47998046875,
      "end": 2191.1199951171875,
      "text": " So we don't have to say if the Lord tarries His coming."
    },
    {
      "id": 174,
      "start": 2191.1199951171875,
      "end": 2193.1600036621094,
      "text": " No, He's not going to."
    },
    {
      "id": 175,
      "start": 2193.1600036621094,
      "end": 2194.8800048828125,
      "text": " Based upon the authority of the Word of God,"
    },
    {
      "id": 176,
      "start": 2194.8800048828125,
      "end": 2197.3599853515625,
      "text": " it says He will not tarry."
    },
    {
      "id": 177,
      "start": 2197.3599853515625,
      "end": 2200.239990234375,
      "text": " For he that will come or shall come will come."
    },
    {
      "id": 178,
      "start": 2200.239990234375,
      "end": 2202.6799926757812,
      "text": " For he that shall come will come."
    },
    {
      "id": 179,
      "start": 2202.6799926757812,
      "end": 2204.1600036621094,
      "text": " And we see that,"
    },
    {
      "id": 180,
      "start": 2204.1600036621094,
      "end": 2206.6799926757812,
      "text": " and we don't know the time of His return,"
    },
    {
      "id": 181,
      "start": 2206.6799926757812,
      "end": 2208.239990234375,
      "text": " but we know that He promised"
    },
    {
      "id": 182,
      "start": 2208.239990234375,
      "end": 2210.3200073242188,
      "text": " that He was going to come back."
    },
    {
      "id": 183,
      "start": 2210.3200073242188,
      "end": 2211.199981689453,
      "text": " Can I tell you this morning"
    },
    {
      "id": 184,
      "start": 2211.199981689453,
      "end": 2213.040008544922,
      "text": " that the promise of Christ's return"
    },
    {
      "id": 185,
      "start": 2213.040008544922,
      "end": 2214.4400024414062,
      "text": " brings me encouragement?"
    },
    {
      "id": 186,
      "start": 2215.279998779297,
      "end": 2216.3999938964844,
      "text": " It really does."
    },
    {
      "id": 187,
      "start": 2217.519989013672,
      "end": 2220.3599853515625,
      "text": " As we daily live with the understanding"
    },
    {
      "id": 188,
      "start": 2220.3599853515625,
      "end": 2222.3200073242188,
      "text": " that today could be the day,"
    },
    {
      "id": 189,
      "start": 2222.3200073242188,
      "end": 2225.6799926757812,
      "text": " as we daily understand that Jesus, my Savior,"
    },
    {
      "id": 190,
      "start": 2225.6799926757812,
      "end": 2227.7999877929688,
      "text": " He's coming back,"
    },
    {
      "id": 191,
      "start": 2227.7999877929688,
      "end": 2230.1199951171875,
      "text": " it gives me encouragement."
    },
    {
      "id": 192,
      "start": 2230.1199951171875,
      "end": 2230.959991455078,
      "text": " Why?"
    },
    {
      "id": 193,
      "start": 2230.959991455078,
      "end": 2233.6000061035156,
      "text": " Because this is not all there is."
    },
    {
      "id": 194,
      "start": 2233.6000061035156,
      "end": 2235.3599853515625,
      "text": " Aren't you happy for that?"
    },
    {
      "id": 195,
      "start": 2235.3599853515625,
      "end": 2237.0,
      "text": " I mean, seriously."
    },
    {
      "id": 196,
      "start": 2237.0,
      "end": 2239.4400024414062,
      "text": " I am so thankful that this world is not all,"
    },
    {
      "id": 197,
      "start": 2239.4400024414062,
      "end": 2241.1600036621094,
      "text": " it's done and over with."
    },
    {
      "id": 198,
      "start": 2241.1600036621094,
      "end": 2242.279998779297,
      "text": " No, no, no."
    },
    {
      "id": 199,
      "start": 2242.279998779297,
      "end": 2243.6399841308594,
      "text": " We have heaven."
    },
    {
      "id": 200,
      "start": 2244.9199829101562,
      "end": 2246.3999938964844,
      "text": " Now, He's richly blessed us"
    },
    {
      "id": 201,
      "start": 2246.3999938964844,
      "end": 2247.7999877929688,
      "text": " while we're here upon this earth."
    },
    {
      "id": 202,
      "start": 2247.7999877929688,
      "end": 2249.5599975585938,
      "text": " I'm so thankful that He's given us"
    },
    {
      "id": 203,
      "start": 2249.5599975585938,
      "end": 2251.6799926757812,
      "text": " all these wonderful blessings,"
    },
    {
      "id": 204,
      "start": 2251.6799926757812,
      "end": 2253.8399963378906,
      "text": " and He's blessed us with all spiritual blessings"
    },
    {
      "id": 205,
      "start": 2253.8399963378906,
      "end": 2254.7999877929688,
      "text": " in heavenly places."
    },
    {
      "id": 206,
      "start": 2254.7999877929688,
      "end": 2256.720001220703,
      "text": " But I understand this morning"
    },
    {
      "id": 207,
      "start": 2256.720001220703,
      "end": 2260.239990234375,
      "text": " that the promise of the return of the Lord Jesus Christ,"
    },
    {
      "id": 208,
      "start": 2260.239990234375,
      "end": 2263.8800048828125,
      "text": " how this promise encourages the people of God."
    },
    {
      "id": 209,
      "start": 2265.199981689453,
      "end": 2267.199981689453,
      "text": " Remind yourself of it often."
    },
    {
      "id": 210,
      "start": 2268.9199829101562,
      "end": 2271.199981689453,
      "text": " Do you remember in John chapter number 13,"
    },
    {
      "id": 211,
      "start": 2271.199981689453,
      "end": 2272.7999877929688,
      "text": " Jesus is telling the disciples,"
    },
    {
      "id": 212,
      "start": 2272.7999877929688,
      "end": 2275.9199829101562,
      "text": " we often reference how that Jesus tells them"
    },
    {
      "id": 213,
      "start": 2275.9199829101562,
      "end": 2277.279998779297,
      "text": " that He gives them a new commandment"
    },
    {
      "id": 214,
      "start": 2277.279998779297,
      "end": 2278.739990234375,
      "text": " at the end of the passage,"
    },
    {
      "id": 215,
      "start": 2278.739990234375,
      "end": 2281.1600036621094,
      "text": " that they're to love one another as He loved."
    },
    {
      "id": 216,
      "start": 2281.1600036621094,
      "end": 2284.3599853515625,
      "text": " And He tells them how that He was going to be leaving, right?"
    },
    {
      "id": 217,
      "start": 2284.3599853515625,
      "end": 2285.47998046875,
      "text": " He's going to the cross."
    },
    {
      "id": 218,
      "start": 2285.47998046875,
      "end": 2287.5599975585938,
      "text": " He's explaining to them the events"
    },
    {
      "id": 219,
      "start": 2287.5599975585938,
      "end": 2290.760009765625,
      "text": " that are going to unfold in just hours and days ahead."
    },
    {
      "id": 220,
      "start": 2290.760009765625,
      "end": 2292.959991455078,
      "text": " And we understand that then He says"
    },
    {
      "id": 221,
      "start": 2292.959991455078,
      "end": 2294.8800048828125,
      "text": " to start the 14th chapter,"
    },
    {
      "id": 222,
      "start": 2294.8800048828125,
      "end": 2297.519989013672,
      "text": " I understand chapter and verses have been inserted after,"
    },
    {
      "id": 223,
      "start": 2297.519989013672,
      "end": 2298.8800048828125,
      "text": " so you think about the dialogue."
    },
    {
      "id": 224,
      "start": 2298.8800048828125,
      "end": 2302.239990234375,
      "text": " He says this, let not your heart be troubled."
    },
    {
      "id": 225,
      "start": 2303.3200073242188,
      "end": 2305.1199951171875,
      "text": " Why was their heart troubled?"
    },
    {
      "id": 226,
      "start": 2305.1199951171875,
      "end": 2307.3200073242188,
      "text": " Because of the things that they had just heard."
    },
    {
      "id": 227,
      "start": 2307.3200073242188,
      "end": 2309.6399841308594,
      "text": " Because of the fact that He was departing"
    },
    {
      "id": 228,
      "start": 2309.6399841308594,
      "end": 2311.6799926757812,
      "text": " and where He was going, they could not come."
    },
    {
      "id": 229,
      "start": 2311.6799926757812,
      "end": 2314.3800048828125,
      "text": " And they didn't understand all of these things."
    },
    {
      "id": 230,
      "start": 2314.3800048828125,
      "end": 2316.97998046875,
      "text": " Remember, after the resurrection,"
    },
    {
      "id": 231,
      "start": 2316.97998046875,
      "end": 2319.6199951171875,
      "text": " the Gospel accounts reveal to us"
    },
    {
      "id": 232,
      "start": 2319.6199951171875,
      "end": 2322.1799926757812,
      "text": " that they remembered these things."
    },
    {
      "id": 233,
      "start": 2323.4600219726562,
      "end": 2325.8599853515625,
      "text": " You know, there's a danger in the midst of difficulty"
    },
    {
      "id": 234,
      "start": 2325.8599853515625,
      "end": 2328.1799926757812,
      "text": " that we forget some things."
    },
    {
      "id": 235,
      "start": 2328.1799926757812,
      "end": 2329.2999877929688,
      "text": " Amen?"
    },
    {
      "id": 236,
      "start": 2329.2999877929688,
      "end": 2331.8599853515625,
      "text": " We're overwhelmed with all that's going on"
    },
    {
      "id": 237,
      "start": 2331.8599853515625,
      "end": 2334.719970703125,
      "text": " and we're kind of living under the circumstances,"
    },
    {
      "id": 238,
      "start": 2334.719970703125,
      "end": 2339.2000122070312,
      "text": " if you will, and we forget the promises of God."
    },
    {
      "id": 239,
      "start": 2339.2000122070312,
      "end": 2341.9199829101562,
      "text": " And Jesus says, let not your heart be troubled."
    },
    {
      "id": 240,
      "start": 2341.9199829101562,
      "end": 2344.1400146484375,
      "text": " You believe in God, believe also in Me."
    },
    {
      "id": 241,
      "start": 2344.9000244140625,
      "end": 2345.8200073242188,
      "text": " In My Father's house are many mansions."
    },
    {
      "id": 242,
      "start": 2345.8200073242188,
      "end": 2347.1199951171875,
      "text": " If it were not so, I would have told you."
    },
    {
      "id": 243,
      "start": 2347.1199951171875,
      "end": 2349.6599731445312,
      "text": " He says this, I go to prepare a place for you."
    },
    {
      "id": 244,
      "start": 2349.6599731445312,
      "end": 2351.1599731445312,
      "text": " And if I go and prepare a place for you,"
    },
    {
      "id": 245,
      "start": 2351.1599731445312,
      "end": 2354.0999755859375,
      "text": " I will come again and receive you unto Myself"
    },
    {
      "id": 246,
      "start": 2354.0999755859375,
      "end": 2357.219970703125,
      "text": " that where I am, there ye may be also."
    },
    {
      "id": 247,
      "start": 2357.219970703125,
      "end": 2358.6199951171875,
      "text": " What a joy."
    },
    {
      "id": 248,
      "start": 2360.0399780273438,
      "end": 2364.1599731445312,
      "text": " In 2 Peter 3, there's scoffers and mockers."
    },
    {
      "id": 249,
      "start": 2364.1599731445312,
      "end": 2367.3599853515625,
      "text": " They're saying, where is His coming?"
    },
    {
      "id": 250,
      "start": 2369.219970703125,
      "end": 2371.02001953125,
      "text": " All things remain the same."
    },
    {
      "id": 251,
      "start": 2372.219970703125,
      "end": 2373.9000244140625,
      "text": " This they're willingly ignorant of,"
    },
    {
      "id": 252,
      "start": 2374.6599731445312,
      "end": 2375.5800170898438,
      "text": " and we see that."
    },
    {
      "id": 253,
      "start": 2375.5800170898438,
      "end": 2377.8599853515625,
      "text": " But then we find that Peter says,"
    },
    {
      "id": 254,
      "start": 2377.8599853515625,
      "end": 2380.5,
      "text": " the Lord is not slack concerning His promise,"
    },
    {
      "id": 255,
      "start": 2380.5,
      "end": 2382.5,
      "text": " as some men count slackness."
    },
    {
      "id": 256,
      "start": 2382.5,
      "end": 2383.6199951171875,
      "text": " But as longsuffering to us,"
    },
    {
      "id": 257,
      "start": 2383.6199951171875,
      "end": 2385.0599975585938,
      "text": " we're not willing that any should perish,"
    },
    {
      "id": 258,
      "start": 2385.0599975585938,
      "end": 2387.0999755859375,
      "text": " but that all should come to repentance."
    },
    {
      "id": 259,
      "start": 2387.0999755859375,
      "end": 2388.7000122070312,
      "text": " In 2 Peter 3, verse number nine."
    },
    {
      "id": 260,
      "start": 2388.7000122070312,
      "end": 2392.260009765625,
      "text": " Listen, the Lord is not slack concerning His promise."
    },
    {
      "id": 261,
      "start": 2392.260009765625,
      "end": 2395.5800170898438,
      "text": " And we find that as these recipients would be encouraged,"
    },
    {
      "id": 262,
      "start": 2395.5800170898438,
      "end": 2398.1400146484375,
      "text": " they're encouraged through this promise"
    },
    {
      "id": 263,
      "start": 2398.1400146484375,
      "end": 2400.4600219726562,
      "text": " of the return of the Lord Jesus Christ,"
    },
    {
      "id": 264,
      "start": 2400.4600219726562,
      "end": 2402.0999755859375,
      "text": " for yet a little while,"
    },
    {
      "id": 265,
      "start": 2402.0999755859375,
      "end": 2402.9400024414062,
      "text": " yet a little while."
    },
    {
      "id": 0,
      "start": 2402.9400024414062,
      "end": 2410.540002346039,
      "text": " and he that shall come will come and will not tarry.\""
    },
    {
      "id": 1,
      "start": 2410.540002346039,
      "end": 2412.280002593994,
      "text": " I'll be honest with you this morning,"
    },
    {
      "id": 2,
      "start": 2412.280002593994,
      "end": 2414.700002670288,
      "text": " I hope he comes in my lifetime."
    },
    {
      "id": 3,
      "start": 2414.700002670288,
      "end": 2416.120002746582,
      "text": " I really do."
    },
    {
      "id": 4,
      "start": 2416.120002746582,
      "end": 2418.6800022125244,
      "text": " I think of a wonderful thing."
    },
    {
      "id": 5,
      "start": 2418.6800022125244,
      "end": 2419.740001678467,
      "text": " Not only a promise,"
    },
    {
      "id": 6,
      "start": 2419.740001678467,
      "end": 2423.300003051758,
      "text": " but I believe he encourages them with a principle."
    },
    {
      "id": 7,
      "start": 2423.300003051758,
      "end": 2425.9800033569336,
      "text": " Notice v. 38 and 39."
    },
    {
      "id": 8,
      "start": 2425.9800033569336,
      "end": 2428.540002822876,
      "text": " Now the just shall live by faith,"
    },
    {
      "id": 9,
      "start": 2428.540002822876,
      "end": 2429.9400024414062,
      "text": " but if any man draw back,"
    },
    {
      "id": 10,
      "start": 2429.9400024414062,
      "end": 2432.300003051758,
      "text": " my soul shall have no pleasure in him."
    },
    {
      "id": 11,
      "start": 2432.300003051758,
      "end": 2434.6600017547607,
      "text": " We are not of them who draw back unto perdition,"
    },
    {
      "id": 12,
      "start": 2434.6600017547607,
      "end": 2439.7000007629395,
      "text": " but of them that believe to the saving of the soul."
    },
    {
      "id": 13,
      "start": 2439.7000007629395,
      "end": 2441.900001525879,
      "text": " The principle that is given is really a reference"
    },
    {
      "id": 14,
      "start": 2441.900001525879,
      "end": 2443.340003967285,
      "text": " back to the book of Habakkuk."
    },
    {
      "id": 15,
      "start": 2443.340003967285,
      "end": 2445.8600006103516,
      "text": " In Habakkuk 2, verses 3 and 4,"
    },
    {
      "id": 16,
      "start": 2445.8600006103516,
      "end": 2448.9400024414062,
      "text": " this truth of the just shall live by faith."
    },
    {
      "id": 17,
      "start": 2448.9400024414062,
      "end": 2451.3800010681152,
      "text": " And we find that this Old Testament principle"
    },
    {
      "id": 18,
      "start": 2451.3800010681152,
      "end": 2453.4200019836426,
      "text": " is used by the Apostle Paul"
    },
    {
      "id": 19,
      "start": 2453.4200019836426,
      "end": 2456.020004272461,
      "text": " as he's speaking to those in Rome."
    },
    {
      "id": 20,
      "start": 2456.020004272461,
      "end": 2458.060001373291,
      "text": " The book of Romans references"
    },
    {
      "id": 21,
      "start": 2458.060001373291,
      "end": 2460.5800018310547,
      "text": " the just shall live by faith."
    },
    {
      "id": 22,
      "start": 2460.5800018310547,
      "end": 2463.46000289917,
      "text": " The emphasis in the book of Romans is the just."
    },
    {
      "id": 23,
      "start": 2463.46000289917,
      "end": 2464.740001678467,
      "text": " How are we justified?"
    },
    {
      "id": 24,
      "start": 2464.740001678467,
      "end": 2466.5000038146973,
      "text": " Through faith."
    },
    {
      "id": 25,
      "start": 2466.5000038146973,
      "end": 2468.220001220703,
      "text": " The book of Galatians deals with"
    },
    {
      "id": 26,
      "start": 2468.220001220703,
      "end": 2470.620002746582,
      "text": " the just shall live by faith."
    },
    {
      "id": 27,
      "start": 2470.620002746582,
      "end": 2472.3800048828125,
      "text": " And I believe in the book of Galatians,"
    },
    {
      "id": 28,
      "start": 2472.3800048828125,
      "end": 2475.779998779297,
      "text": " faith is what is emphasized there in the book of Galatians."
    },
    {
      "id": 29,
      "start": 2475.779998779297,
      "end": 2478.4599990844727,
      "text": " Again, they're dealing with those folks there"
    },
    {
      "id": 30,
      "start": 2478.4599990844727,
      "end": 2481.819999694824,
      "text": " that were converted during the first missionary journey"
    },
    {
      "id": 31,
      "start": 2481.819999694824,
      "end": 2484.620002746582,
      "text": " as the Apostle Paul went out from the church at Antioch"
    },
    {
      "id": 32,
      "start": 2484.620002746582,
      "end": 2489.0600051879883,
      "text": " and they were able to go and see people saved"
    },
    {
      "id": 33,
      "start": 2489.0600051879883,
      "end": 2490.4599990844727,
      "text": " in the region of Galatia."
    },
    {
      "id": 34,
      "start": 2490.4599990844727,
      "end": 2491.300003051758,
      "text": " And what a blessing,"
    },
    {
      "id": 35,
      "start": 2491.300003051758,
      "end": 2493.2600021362305,
      "text": " but there were some Judaizers that came in that said,"
    },
    {
      "id": 36,
      "start": 2493.2600021362305,
      "end": 2495.1399993896484,
      "text": " hey, you have to keep doing these things"
    },
    {
      "id": 37,
      "start": 2495.1399993896484,
      "end": 2498.4599990844727,
      "text": " and unless you're circumcised after the law of Moses,"
    },
    {
      "id": 38,
      "start": 2498.4599990844727,
      "end": 2499.4599990844727,
      "text": " you cannot be saved."
    },
    {
      "id": 39,
      "start": 2499.4599990844727,
      "end": 2501.180000305176,
      "text": " I mean, they go through all of these things"
    },
    {
      "id": 40,
      "start": 2501.180000305176,
      "end": 2503.4599990844727,
      "text": " and the just shall live by faith."
    },
    {
      "id": 41,
      "start": 2503.4599990844727,
      "end": 2506.300003051758,
      "text": " I'm saved by faith."
    },
    {
      "id": 42,
      "start": 2506.300003051758,
      "end": 2508.340003967285,
      "text": " Here, he says,"
    },
    {
      "id": 43,
      "start": 2508.340003967285,
      "end": 2512.6600036621094,
      "text": " now the just shall live by faith."
    },
    {
      "id": 44,
      "start": 2512.6600036621094,
      "end": 2514.900001525879,
      "text": " But if any man draw back,"
    },
    {
      "id": 45,
      "start": 2514.900001525879,
      "end": 2519.1399993896484,
      "text": " notice my soul shall have no pleasure in him."
    },
    {
      "id": 46,
      "start": 2519.1399993896484,
      "end": 2521.779998779297,
      "text": " But we are not of them who draw back unto perdition,"
    },
    {
      "id": 47,
      "start": 2521.779998779297,
      "end": 2525.779998779297,
      "text": " but of them that believe to the saving of the soul."
    },
    {
      "id": 48,
      "start": 2527.779998779297,
      "end": 2532.0599975585938,
      "text": " No retreat, no drawback, amen."
    },
    {
      "id": 49,
      "start": 2532.0599975585938,
      "end": 2533.979995727539,
      "text": " Onward, Christian soldier."
    },
    {
      "id": 50,
      "start": 2533.979995727539,
      "end": 2536.6199951171875,
      "text": " That's what the songwriter said, isn't it?"
    },
    {
      "id": 51,
      "start": 2536.6199951171875,
      "end": 2537.6600036621094,
      "text": " Amen."
    },
    {
      "id": 52,
      "start": 2537.6600036621094,
      "end": 2539.8600006103516,
      "text": " We're going onward and forward."
    },
    {
      "id": 53,
      "start": 2539.8600006103516,
      "end": 2542.699996948242,
      "text": " The book of Joshua, forward by faith,"
    },
    {
      "id": 54,
      "start": 2542.699996948242,
      "end": 2544.6199951171875,
      "text": " really is an idea of that book."
    },
    {
      "id": 55,
      "start": 2544.6199951171875,
      "end": 2546.220001220703,
      "text": " And you understand here,"
    },
    {
      "id": 56,
      "start": 2546.220001220703,
      "end": 2548.540008544922,
      "text": " I believe that the emphasis in the book of Hebrews"
    },
    {
      "id": 57,
      "start": 2548.540008544922,
      "end": 2550.3800048828125,
      "text": " of this Old Testament principle"
    },
    {
      "id": 58,
      "start": 2550.3800048828125,
      "end": 2553.699996948242,
      "text": " the just shall live by faith."
    },
    {
      "id": 59,
      "start": 2553.699996948242,
      "end": 2556.020004272461,
      "text": " I'm thankful that I've been saved by faith."
    },
    {
      "id": 60,
      "start": 2556.020004272461,
      "end": 2559.8200073242188,
      "text": " I'm thankful that I'm now justified and I'm redeemed."
    },
    {
      "id": 61,
      "start": 2559.8200073242188,
      "end": 2562.1800079345703,
      "text": " I've been reconciled to the Lord"
    },
    {
      "id": 62,
      "start": 2562.1800079345703,
      "end": 2565.0599975585938,
      "text": " because of His precious blood,"
    },
    {
      "id": 63,
      "start": 2565.0599975585938,
      "end": 2567.8200073242188,
      "text": " but I'm to live by faith."
    },
    {
      "id": 64,
      "start": 2567.8200073242188,
      "end": 2570.1399993896484,
      "text": " And we think about the theme of the book of Hebrews"
    },
    {
      "id": 65,
      "start": 2570.1399993896484,
      "end": 2572.4199981689453,
      "text": " as we got there in chapter number six."
    },
    {
      "id": 66,
      "start": 2572.4199981689453,
      "end": 2574.8600006103516,
      "text": " Remember the idea of chapter number six,"
    },
    {
      "id": 67,
      "start": 2574.8600006103516,
      "end": 2576.699996948242,
      "text": " let us go on."
    },
    {
      "id": 68,
      "start": 2576.699996948242,
      "end": 2578.1399993896484,
      "text": " Right, that's what he says."
    },
    {
      "id": 69,
      "start": 2578.740005493164,
      "end": 2580.9000091552734,
      "text": " Go back to chapter six in verse number one"
    },
    {
      "id": 70,
      "start": 2580.9000091552734,
      "end": 2582.4199981689453,
      "text": " and notice what he says."
    },
    {
      "id": 71,
      "start": 2582.4199981689453,
      "end": 2584.8600006103516,
      "text": " Remember, he was dealing at the end of chapter number five."
    },
    {
      "id": 72,
      "start": 2584.8600006103516,
      "end": 2586.6600036621094,
      "text": " He was ready to get into all of the truth"
    },
    {
      "id": 73,
      "start": 2586.6600036621094,
      "end": 2588.300003051758,
      "text": " with regard to Melchizedek,"
    },
    {
      "id": 74,
      "start": 2588.300003051758,
      "end": 2590.5,
      "text": " but he says you're not ready to receive these things."
    },
    {
      "id": 75,
      "start": 2590.5,
      "end": 2591.3399963378906,
      "text": " Why?"
    },
    {
      "id": 76,
      "start": 2591.3399963378906,
      "end": 2592.5,
      "text": " Because you're slow of learning."
    },
    {
      "id": 77,
      "start": 2592.5,
      "end": 2593.9000091552734,
      "text": " You're dull of hearing."
    },
    {
      "id": 78,
      "start": 2595.300003051758,
      "end": 2597.4199981689453,
      "text": " And he goes through and he gives this admonition,"
    },
    {
      "id": 79,
      "start": 2597.4199981689453,
      "end": 2599.3399963378906,
      "text": " but he says in verse number one of chapter six,"
    },
    {
      "id": 80,
      "start": 2599.3399963378906,
      "end": 2602.3399963378906,
      "text": " therefore, leaving the principles of the doctrine of Christ,"
    },
    {
      "id": 81,
      "start": 2602.3399963378906,
      "end": 2605.979995727539,
      "text": " let us go unto perfection."
    },
    {
      "id": 82,
      "start": 2605.979995727539,
      "end": 2607.540008544922,
      "text": " Let us go on."
    },
    {
      "id": 83,
      "start": 2607.540008544922,
      "end": 2608.6199951171875,
      "text": " Let us continue."
    },
    {
      "id": 84,
      "start": 2608.6199951171875,
      "end": 2611.779998779297,
      "text": " Let us, we find here, live by faith."
    },
    {
      "id": 85,
      "start": 2611.779998779297,
      "end": 2614.0599975585938,
      "text": " Notice it says that if any man draw back,"
    },
    {
      "id": 86,
      "start": 2614.0599975585938,
      "end": 2615.5800018310547,
      "text": " my soul shall have no pleasure in him."
    },
    {
      "id": 87,
      "start": 2615.5800018310547,
      "end": 2617.9400024414062,
      "text": " Listen, the fact of the matter is that"
    },
    {
      "id": 88,
      "start": 2617.9400024414062,
      "end": 2620.779998779297,
      "text": " when we live by faith, we please God."
    },
    {
      "id": 89,
      "start": 2622.020004272461,
      "end": 2623.6600036621094,
      "text": " In just a few verses,"
    },
    {
      "id": 90,
      "start": 2623.6600036621094,
      "end": 2626.979995727539,
      "text": " a verse that I personally commonly reference"
    },
    {
      "id": 91,
      "start": 2626.979995727539,
      "end": 2630.260009765625,
      "text": " and rehearse for you is found in Hebrews 11 six."
    },
    {
      "id": 92,
      "start": 2630.260009765625,
      "end": 2633.540008544922,
      "text": " Without faith, it is impossible to please Him."
    },
    {
      "id": 93,
      "start": 2633.540008544922,
      "end": 2635.3800048828125,
      "text": " For he that cometh to God must believe that He is"
    },
    {
      "id": 94,
      "start": 2635.540008544922,
      "end": 2637.9400024414062,
      "text": " a rewarder of them that diligently seek Him."
    },
    {
      "id": 95,
      "start": 2637.9400024414062,
      "end": 2640.460006713867,
      "text": " And so here we find that these folks"
    },
    {
      "id": 96,
      "start": 2640.460006713867,
      "end": 2643.979995727539,
      "text": " are being encouraged by this promise that Jesus is coming."
    },
    {
      "id": 97,
      "start": 2643.979995727539,
      "end": 2645.8200073242188,
      "text": " They're encouraged by this principle"
    },
    {
      "id": 98,
      "start": 2645.8200073242188,
      "end": 2648.0599975585938,
      "text": " that we're to live by faith."
    },
    {
      "id": 99,
      "start": 2649.020004272461,
      "end": 2650.5,
      "text": " We're not to draw back."
    },
    {
      "id": 100,
      "start": 2651.460006713867,
      "end": 2654.300003051758,
      "text": " We are of them, I love how verse number 39 ends,"
    },
    {
      "id": 101,
      "start": 2654.300003051758,
      "end": 2658.9400024414062,
      "text": " but of them that believe to the saving of the soul."
    },
    {
      "id": 102,
      "start": 2658.9400024414062,
      "end": 2660.7000122070312,
      "text": " We believe."
    },
    {
      "id": 103,
      "start": 2660.7000122070312,
      "end": 2664.540008544922,
      "text": " Remember, Paul stood in Acts 27 and said, I believe God."
    },
    {
      "id": 104,
      "start": 2665.4200134277344,
      "end": 2670.4200134277344,
      "text": " I've often said, belief impacts behavior."
    },
    {
      "id": 105,
      "start": 2673.0599975585938,
      "end": 2675.779998779297,
      "text": " That's why the just shall live by faith."
    },
    {
      "id": 106,
      "start": 2675.779998779297,
      "end": 2679.1400146484375,
      "text": " What you believe will impact your behavior."
    },
    {
      "id": 107,
      "start": 2681.4200134277344,
      "end": 2686.4200134277344,
      "text": " How you behave will reveal what you believe."
    },
    {
      "id": 108,
      "start": 2687.1400146484375,
      "end": 2688.260009765625,
      "text": " It's a two-sided coin."
    },
    {
      "id": 109,
      "start": 2690.1799926757812,
      "end": 2693.3399963378906,
      "text": " And this morning, this principle is given,"
    },
    {
      "id": 110,
      "start": 2693.3399963378906,
      "end": 2696.8200073242188,
      "text": " I believe that it's a great introduction to the content"
    },
    {
      "id": 111,
      "start": 2696.8200073242188,
      "end": 2698.980010986328,
      "text": " that we find in Hebrews chapter 11, right?"
    },
    {
      "id": 112,
      "start": 2698.980010986328,
      "end": 2700.4200134277344,
      "text": " The great hall of faith."
    },
    {
      "id": 113,
      "start": 2701.4200134277344,
      "end": 2703.980010986328,
      "text": " This one by faith and that one by faith"
    },
    {
      "id": 114,
      "start": 2703.980010986328,
      "end": 2705.4200134277344,
      "text": " and this one by faith."
    },
    {
      "id": 115,
      "start": 2705.4200134277344,
      "end": 2708.3800048828125,
      "text": " And here we find that as the people of God today"
    },
    {
      "id": 116,
      "start": 2708.3800048828125,
      "end": 2711.3800048828125,
      "text": " that we too are to live by faith."
    },
    {
      "id": 117,
      "start": 2711.3800048828125,
      "end": 2714.4200134277344,
      "text": " Trusting God, believing Him."
    },
    {
      "id": 118,
      "start": 2714.4200134277344,
      "end": 2715.980010986328,
      "text": " We're in Genesis chapter number 12."
    },
    {
      "id": 119,
      "start": 2715.980010986328,
      "end": 2718.980010986328,
      "text": " We studied the first nine verses last Sunday evening."
    },
    {
      "id": 120,
      "start": 2718.980010986328,
      "end": 2721.4200134277344,
      "text": " We'll study verses 10 through 20 this evening."
    },
    {
      "id": 121,
      "start": 2721.4200134277344,
      "end": 2724.779998779297,
      "text": " And we see that Abram, he exercised faith."
    },
    {
      "id": 122,
      "start": 2724.779998779297,
      "end": 2726.8200073242188,
      "text": " He believed God."
    },
    {
      "id": 123,
      "start": 2726.8200073242188,
      "end": 2728.3800048828125,
      "text": " God said, nope, not in Haran."
    },
    {
      "id": 124,
      "start": 2728.3800048828125,
      "end": 2729.220001220703,
      "text": " You're not staying here."
    },
    {
      "id": 125,
      "start": 2729.220001220703,
      "end": 2730.980010986328,
      "text": " He had already traveled from the ear of the Chaldeans"
    },
    {
      "id": 126,
      "start": 2730.980010986328,
      "end": 2732.1000061035156,
      "text": " up to Haran."
    },
    {
      "id": 127,
      "start": 2732.1000061035156,
      "end": 2733.220001220703,
      "text": " Nope, this isn't the place."
    },
    {
      "id": 128,
      "start": 2733.220001220703,
      "end": 2734.779998779297,
      "text": " And he travels down the Canaan."
    },
    {
      "id": 129,
      "start": 2734.779998779297,
      "end": 2738.3800048828125,
      "text": " And what a joy to see his faith and obedience."
    },
    {
      "id": 130,
      "start": 2738.3800048828125,
      "end": 2740.7000122070312,
      "text": " And this morning as the people of God,"
    },
    {
      "id": 131,
      "start": 2740.7000122070312,
      "end": 2742.739990234375,
      "text": " we are encouraged by this principle"
    },
    {
      "id": 132,
      "start": 2742.739990234375,
      "end": 2745.0599975585938,
      "text": " that the just shall live by faith."
    },
    {
      "id": 133,
      "start": 2745.0599975585938,
      "end": 2746.459991455078,
      "text": " We don't live by sight."
    },
    {
      "id": 134,
      "start": 2747.3800048828125,
      "end": 2748.5800170898438,
      "text": " We live by faith."
    },
    {
      "id": 135,
      "start": 2749.540008544922,
      "end": 2751.220001220703,
      "text": " It does not mean that we are not aware"
    },
    {
      "id": 136,
      "start": 2751.8999938964844,
      "end": 2753.1400146484375,
      "text": " of the surroundings and the things"
    },
    {
      "id": 137,
      "start": 2753.1400146484375,
      "end": 2754.9400024414062,
      "text": " that we deal with in our life."
    },
    {
      "id": 138,
      "start": 2754.9400024414062,
      "end": 2757.5,
      "text": " It just means that our perspective is heavenward."
    },
    {
      "id": 139,
      "start": 2758.3800048828125,
      "end": 2760.2999877929688,
      "text": " It means that we're not looking at these things"
    },
    {
      "id": 140,
      "start": 2760.2999877929688,
      "end": 2763.5,
      "text": " which are temporal, but at those things which are eternal."
    },
    {
      "id": 141,
      "start": 2763.5,
      "end": 2767.019989013672,
      "text": " Second Corinthians four, verses 17 and 18."
    },
    {
      "id": 142,
      "start": 2767.019989013672,
      "end": 2768.779998779297,
      "text": " And you notice how the Apostle Paul,"
    },
    {
      "id": 143,
      "start": 2768.779998779297,
      "end": 2771.0599975585938,
      "text": " he makes note of the importance"
    },
    {
      "id": 144,
      "start": 2771.0599975585938,
      "end": 2773.3399963378906,
      "text": " of having that eternal focus."
    },
    {
      "id": 145,
      "start": 2773.3399963378906,
      "end": 2777.5800170898438,
      "text": " It's a truth that we find there in the epistles"
    },
    {
      "id": 146,
      "start": 2777.5800170898438,
      "end": 2779.7000122070312,
      "text": " as he's writing in the book of Colossians"
    },
    {
      "id": 147,
      "start": 2779.7000122070312,
      "end": 2780.779998779297,
      "text": " in chapter number three."
    },
    {
      "id": 148,
      "start": 2780.779998779297,
      "end": 2782.4200134277344,
      "text": " If ye then be risen with Christ,"
    },
    {
      "id": 149,
      "start": 2782.4200134277344,
      "end": 2785.540008544922,
      "text": " seek those things which are above,"
    },
    {
      "id": 150,
      "start": 2785.540008544922,
      "end": 2787.8600158691406,
      "text": " where Christ is on the right hand of God."
    },
    {
      "id": 151,
      "start": 2787.8600158691406,
      "end": 2790.2999877929688,
      "text": " Set your affection on things above,"
    },
    {
      "id": 152,
      "start": 2790.2999877929688,
      "end": 2791.9400024414062,
      "text": " not on things of the earth."
    },
    {
      "id": 153,
      "start": 2791.9400024414062,
      "end": 2792.779998779297,
      "text": " Why?"
    },
    {
      "id": 154,
      "start": 2792.779998779297,
      "end": 2794.3800048828125,
      "text": " Because the just shall live by faith."
    },
    {
      "id": 155,
      "start": 2795.3800048828125,
      "end": 2797.019989013672,
      "text": " This world is not my home."
    },
    {
      "id": 156,
      "start": 2798.1400146484375,
      "end": 2800.1799926757812,
      "text": " I'm so thankful for that."
    },
    {
      "id": 157,
      "start": 2800.1799926757812,
      "end": 2802.0599975585938,
      "text": " As we wrap up Hebrews chapter number 10"
    },
    {
      "id": 158,
      "start": 2802.0599975585938,
      "end": 2804.6600036621094,
      "text": " and really wrap up this entire section"
    },
    {
      "id": 159,
      "start": 2804.6600036621094,
      "end": 2807.0599975585938,
      "text": " that's covered from chapter five"
    },
    {
      "id": 160,
      "start": 2807.0599975585938,
      "end": 2809.1400146484375,
      "text": " all the way through chapter number 10,"
    },
    {
      "id": 161,
      "start": 2809.1799926757812,
      "end": 2811.3800048828125,
      "text": " that the Lord Jesus Christ is superior"
    },
    {
      "id": 162,
      "start": 2811.3800048828125,
      "end": 2813.5800170898438,
      "text": " in regard to his priesthood."
    },
    {
      "id": 163,
      "start": 2814.739990234375,
      "end": 2818.0599975585938,
      "text": " He's superior to the Aaronic, the Levitical priesthood"
    },
    {
      "id": 164,
      "start": 2818.0599975585938,
      "end": 2819.3399963378906,
      "text": " that they were so familiar with."
    },
    {
      "id": 165,
      "start": 2819.3399963378906,
      "end": 2820.220001220703,
      "text": " Why?"
    },
    {
      "id": 166,
      "start": 2820.220001220703,
      "end": 2822.459991455078,
      "text": " Because he's of a higher, a better priesthood."
    },
    {
      "id": 167,
      "start": 2822.459991455078,
      "end": 2823.6600036621094,
      "text": " He's that of Melchizedek."
    },
    {
      "id": 168,
      "start": 2823.6600036621094,
      "end": 2825.5,
      "text": " We studied all of that and understood that."
    },
    {
      "id": 169,
      "start": 2825.5,
      "end": 2827.5,
      "text": " We find that he served in a better place."
    },
    {
      "id": 170,
      "start": 2827.5,
      "end": 2829.4200134277344,
      "text": " He offered a better offering."
    },
    {
      "id": 171,
      "start": 2829.4200134277344,
      "end": 2831.980010986328,
      "text": " He presented a better offering when he offered himself."
    },
    {
      "id": 172,
      "start": 2831.980010986328,
      "end": 2835.739990234375,
      "text": " He accomplished in one offering for sin forever"
    },
    {
      "id": 173,
      "start": 2835.739990234375,
      "end": 2839.2999877929688,
      "text": " what those Old Testament sacrifices could never do."
    },
    {
      "id": 174,
      "start": 2840.8999938964844,
      "end": 2842.8999938964844,
      "text": " This morning, we wrap up chapter number 10"
    },
    {
      "id": 175,
      "start": 2842.8999938964844,
      "end": 2845.7000122070312,
      "text": " and we understand this truth."
    },
    {
      "id": 176,
      "start": 2845.7000122070312,
      "end": 2847.779998779297,
      "text": " There's no other offering."
    },
    {
      "id": 177,
      "start": 2847.779998779297,
      "end": 2849.5800170898438,
      "text": " It's only the blood of Christ."
    },
    {
      "id": 178,
      "start": 2849.5800170898438,
      "end": 2851.9400024414062,
      "text": " The efficacy of Christ's blood."
    },
    {
      "id": 179,
      "start": 2851.9400024414062,
      "end": 2854.779998779297,
      "text": " This morning, it's imperative that we understand"
    },
    {
      "id": 180,
      "start": 2854.779998779297,
      "end": 2856.5800170898438,
      "text": " that it's only the blood of Christ."
    },
    {
      "id": 181,
      "start": 2856.5800170898438,
      "end": 2859.980010986328,
      "text": " We can't, there's no other way to come, right?"
    },
    {
      "id": 182,
      "start": 2859.980010986328,
      "end": 2860.8200073242188,
      "text": " What did it say?"
    },
    {
      "id": 183,
      "start": 2860.8200073242188,
      "end": 2864.6600036621094,
      "text": " We see the understanding after the children of Israel"
    },
    {
      "id": 184,
      "start": 2864.6600036621094,
      "end": 2866.540008544922,
      "text": " when they're going through all of those plagues"
    },
    {
      "id": 185,
      "start": 2866.540008544922,
      "end": 2867.8999938964844,
      "text": " and they come to the 10th plague"
    },
    {
      "id": 186,
      "start": 2867.8999938964844,
      "end": 2869.5,
      "text": " before they would leave Egypt land"
    },
    {
      "id": 187,
      "start": 2869.5,
      "end": 2871.6199951171875,
      "text": " and really that picture of being brought out"
    },
    {
      "id": 188,
      "start": 2871.6199951171875,
      "end": 2873.2999877929688,
      "text": " and the exodus and all of that,"
    },
    {
      "id": 189,
      "start": 2873.2999877929688,
      "end": 2874.1400146484375,
      "text": " what did they have to do?"
    },
    {
      "id": 190,
      "start": 2874.1400146484375,
      "end": 2876.980010986328,
      "text": " They had the Passover was instituted."
    },
    {
      "id": 191,
      "start": 2876.980010986328,
      "end": 2878.7000122070312,
      "text": " When they killed that Passover lamb,"
    },
    {
      "id": 192,
      "start": 2878.7000122070312,
      "end": 2879.8999938964844,
      "text": " there was something specific"
    },
    {
      "id": 193,
      "start": 2879.8999938964844,
      "end": 2882.4200134277344,
      "text": " that they had to do with the blood."
    },
    {
      "id": 194,
      "start": 2882.4200134277344,
      "end": 2884.2999877929688,
      "text": " It had to be applied."
    },
    {
      "id": 195,
      "start": 2884.2999877929688,
      "end": 2886.2999877929688,
      "text": " The doorpost and the lintel, right?"
    },
    {
      "id": 196,
      "start": 2886.2999877929688,
      "end": 2887.8200073242188,
      "text": " Really, picture's a cross."
    },
    {
      "id": 197,
      "start": 2891.1799926757812,
      "end": 2892.4200134277344,
      "text": " He said, when the angel came through,"
    },
    {
      "id": 198,
      "start": 2892.4200134277344,
      "end": 2894.540008544922,
      "text": " he said, when I see the blood,"
    },
    {
      "id": 199,
      "start": 2895.3800048828125,
      "end": 2896.220001220703,
      "text": " I will pass."
    },
    {
      "id": 200,
      "start": 2896.220001220703,
      "end": 2897.739990234375,
      "text": " We sing the song."
    },
    {
      "id": 201,
      "start": 2897.739990234375,
      "end": 2899.9400024414062,
      "text": " When I see the blood, right?"
    },
    {
      "id": 202,
      "start": 2899.9400024414062,
      "end": 2901.1799926757812,
      "text": " I'm not gonna sing for you."
    },
    {
      "id": 203,
      "start": 2901.1799926757812,
      "end": 2902.7000122070312,
      "text": " Everyone leave."
    },
    {
      "id": 204,
      "start": 2902.7000122070312,
      "end": 2904.980010986328,
      "text": " But the reality is that it says,"
    },
    {
      "id": 205,
      "start": 2904.980010986328,
      "end": 2906.8999938964844,
      "text": " when I see the blood, I will pass."
    },
    {
      "id": 206,
      "start": 2906.8999938964844,
      "end": 2908.6199951171875,
      "text": " I will pass over you."
    },
    {
      "id": 207,
      "start": 2909.739990234375,
      "end": 2910.5800170898438,
      "text": " Why?"
    },
    {
      "id": 208,
      "start": 2910.5800170898438,
      "end": 2912.019989013672,
      "text": " Because the blood was applied."
    },
    {
      "id": 209,
      "start": 2912.019989013672,
      "end": 2914.1400146484375,
      "text": " What if someone said, you know what?"
    },
    {
      "id": 210,
      "start": 2914.1400146484375,
      "end": 2916.260009765625,
      "text": " I don't really think that's necessary."
    },
    {
      "id": 211,
      "start": 2916.260009765625,
      "end": 2918.8200073242188,
      "text": " I'm gonna do all of these things instead."
    },
    {
      "id": 212,
      "start": 2918.8200073242188,
      "end": 2920.260009765625,
      "text": " I mean, I'm gonna do the best I can."
    },
    {
      "id": 213,
      "start": 2920.260009765625,
      "end": 2921.52001953125,
      "text": " I'm gonna clean up my house."
    },
    {
      "id": 214,
      "start": 2921.52001953125,
      "end": 2922.3599853515625,
      "text": " I'm gonna clean up this."
    },
    {
      "id": 215,
      "start": 2922.3599853515625,
      "end": 2923.2000122070312,
      "text": " I'm gonna do this."
    },
    {
      "id": 216,
      "start": 2923.2000122070312,
      "end": 2925.3200073242188,
      "text": " I'm gonna do all these things I'm gonna do,"
    },
    {
      "id": 217,
      "start": 2925.3200073242188,
      "end": 2926.760009765625,
      "text": " but I didn't apply the blood."
    },
    {
      "id": 218,
      "start": 2927.7999877929688,
      "end": 2929.9600219726562,
      "text": " There'd be death, right?"
    },
    {
      "id": 219,
      "start": 2931.0599975585938,
      "end": 2931.9600219726562,
      "text": " There'd be death."
    },
    {
      "id": 220,
      "start": 2933.0399780273438,
      "end": 2936.239990234375,
      "text": " It was only because of the blood that was applied."
    },
    {
      "id": 221,
      "start": 2936.239990234375,
      "end": 2939.1199951171875,
      "text": " And we see all throughout the Old Testament,"
    },
    {
      "id": 222,
      "start": 2939.1199951171875,
      "end": 2942.0800170898438,
      "text": " and we see the picture and the typology"
    },
    {
      "id": 223,
      "start": 2942.0800170898438,
      "end": 2944.2000122070312,
      "text": " and how it's showing us that Messiah"
    },
    {
      "id": 224,
      "start": 2944.2000122070312,
      "end": 2947.02001953125,
      "text": " would one day come, God in flesh."
    },
    {
      "id": 225,
      "start": 2947.02001953125,
      "end": 2949.280029296875,
      "text": " Christ, our Passover."
    },
    {
      "id": 226,
      "start": 2949.280029296875,
      "end": 2951.1199951171875,
      "text": " Isn't that what Paul said?"
    },
    {
      "id": 227,
      "start": 2951.1199951171875,
      "end": 2952.239990234375,
      "text": " He's writing to the believers in Corinth."
    },
    {
      "id": 228,
      "start": 2952.239990234375,
      "end": 2954.0399780273438,
      "text": " He says, Christ, our Passover."
    },
    {
      "id": 229,
      "start": 2955.2000122070312,
      "end": 2957.8400268554688,
      "text": " And he, the Lord Jesus Christ, God in flesh,"
    },
    {
      "id": 230,
      "start": 2957.8400268554688,
      "end": 2962.8400268554688,
      "text": " he went to the cross and he paid for your sin and mine."
    },
    {
      "id": 231,
      "start": 2963.1599731445312,
      "end": 2964.6599731445312,
      "text": " Paid for the sin of the world."
    },
    {
      "id": 232,
      "start": 2965.760009765625,
      "end": 2968.7200317382812,
      "text": " And the only payment that is accepted by God Almighty"
    },
    {
      "id": 233,
      "start": 2968.7200317382812,
      "end": 2970.7200317382812,
      "text": " is the blood of his son."
    },
    {
      "id": 234,
      "start": 2970.7200317382812,
      "end": 2972.52001953125,
      "text": " That's it, there's no other payment."
    },
    {
      "id": 235,
      "start": 2974.8800048828125,
      "end": 2977.52001953125,
      "text": " There's some things that the folks in Hebrews"
    },
    {
      "id": 236,
      "start": 2977.52001953125,
      "end": 2978.3599853515625,
      "text": " that are being written to,"
    },
    {
      "id": 237,
      "start": 2978.3599853515625,
      "end": 2980.8400268554688,
      "text": " they endured because of their conversion."
    },
    {
      "id": 238,
      "start": 2980.8400268554688,
      "end": 2981.7200317382812,
      "text": " Can I tell you this morning,"
    },
    {
      "id": 239,
      "start": 2982.5599975585938,
      "end": 2983.4000244140625,
      "text": " there may be some things that we have to endure."
    },
    {
      "id": 240,
      "start": 2983.4000244140625,
      "end": 2984.7200317382812,
      "text": " Some hardships, some afflictions,"
    },
    {
      "id": 241,
      "start": 2984.7200317382812,
      "end": 2987.280029296875,
      "text": " some reproaches, some difficulties."
    },
    {
      "id": 242,
      "start": 2987.280029296875,
      "end": 2990.5999755859375,
      "text": " Can I tell you that we can endure them joyfully"
    },
    {
      "id": 243,
      "start": 2990.5999755859375,
      "end": 2993.4600219726562,
      "text": " if we have the knowledge of this world is not my home?"
    },
    {
      "id": 244,
      "start": 2994.6400146484375,
      "end": 2998.0800170898438,
      "text": " If we have the knowledge that I'm seeking a better city."
    },
    {
      "id": 245,
      "start": 2998.0800170898438,
      "end": 2998.9199829101562,
      "text": " Amen?"
    },
    {
      "id": 246,
      "start": 2998.9199829101562,
      "end": 3000.0800170898438,
      "text": " We see that in Hebrews 11."
    },
    {
      "id": 247,
      "start": 3000.9600219726562,
      "end": 3003.4600219726562,
      "text": " And this morning, would you be encouraged by that?"
    },
    {
      "id": 0,
      "start": 3003.4600219726562,
      "end": 3009.4600219726562,
      "text": " promises of God's Word. Be encouraged by the promise of a soon coming. A little"
    },
    {
      "id": 1,
      "start": 3009.4600219726562,
      "end": 3014.6200218200684,
      "text": " while. He that shall come will come and will not tarry. I hope that encourages"
    },
    {
      "id": 2,
      "start": 3014.6200218200684,
      "end": 3019.340022087097,
      "text": " this morning. Hope you're encouraged by the principle that the just shall live"
    },
    {
      "id": 3,
      "start": 3019.340022087097,
      "end": 3026.5800228118896,
      "text": " by faith. We are not of them that draw back. No, no. We're pressing on forward by"
    },
    {
      "id": 4,
      "start": 3026.5800228118896,
      "end": 3034.420021057129,
      "text": " faith. Amen. We serve a great God. I am so thankful to have the truth of the Word"
    },
    {
      "id": 5,
      "start": 3034.420021057129,
      "end": 3043.1000213623047,
      "text": " of God. I am so thankful that someone was willing to give the gospel to our family."
    },
    {
      "id": 6,
      "start": 3043.1000213623047,
      "end": 3048.580020904541,
      "text": " That someone gave the gospel to you. We sang to start our service this morning. I"
    },
    {
      "id": 7,
      "start": 3048.580020904541,
      "end": 3055.420021057129,
      "text": " love to tell the story. I really do. I love to talk about Jesus and what he did"
    },
    {
      "id": 8,
      "start": 3055.420021057129,
      "end": 3061.9400215148926,
      "text": " for me. I hope it doesn't grow old for you. When you recognize what he did for"
    },
    {
      "id": 9,
      "start": 3061.9400215148926,
      "end": 3067.860023498535,
      "text": " you, what he can do for others, he is able to save. Amen. What a joy. Let's pray."
    },
    {
      "id": 10,
      "start": 3067.860023498535,
      "end": 3073.9000244140625,
      "text": " Father, we love you. We thank you for loving us. We thank you for the truth of"
    },
    {
      "id": 11,
      "start": 3073.9000244140625,
      "end": 3081.3800201416016,
      "text": " thy Word. We thank you for the efficacy of Christ's blood. Lord, I pray this"
    },
    {
      "id": 12,
      "start": 3081.3800201416016,
      "end": 3086.6600189208984,
      "text": " morning that if there's one present in our property, there's one that's tuned in"
    },
    {
      "id": 13,
      "start": 3086.6600189208984,
      "end": 3091.300018310547,
      "text": " via live stream, that has never trusted the Lord Jesus Christ as their personal"
    },
    {
      "id": 14,
      "start": 3091.300018310547,
      "end": 3098.5800247192383,
      "text": " Savior. They're trying some other way. Trying to be a good person. They're"
    },
    {
      "id": 15,
      "start": 3098.5800247192383,
      "end": 3104.700019836426,
      "text": " trying to follow some religious creed or teaching. God, I pray this morning that"
    },
    {
      "id": 16,
      "start": 3104.700019836426,
      "end": 3111.3800201416016,
      "text": " the Holy Spirit of God would convince them of this truth. They're a sinner in"
    },
    {
      "id": 17,
      "start": 3111.3800201416016,
      "end": 3116.7800216674805,
      "text": " need of a Savior. The only Savior is the Lord Jesus Christ. That he accomplished"
    },
    {
      "id": 18,
      "start": 3116.7800216674805,
      "end": 3126.260025024414,
      "text": " in the offering of himself remission of sin. And if this morning we accept the"
    },
    {
      "id": 19,
      "start": 3126.260025024414,
      "end": 3133.300018310547,
      "text": " payment of Christ's blood to be applied to our account. That we believe that he"
    },
    {
      "id": 20,
      "start": 3133.300018310547,
      "end": 3138.9400177001953,
      "text": " is God and that he died on the cross. He was buried and rose in victory. And we"
    },
    {
      "id": 21,
      "start": 3138.9400177001953,
      "end": 3146.8600158691406,
      "text": " receive the gift of God, which is eternal life through Jesus Christ our Lord. We"
    },
    {
      "id": 22,
      "start": 3146.8600158691406,
      "end": 3151.1000213623047,
      "text": " can have that assurance of heaven. Lord, I pray that you'd work in hearts and"
    },
    {
      "id": 23,
      "start": 3151.1000213623047,
      "end": 3157.8600158691406,
      "text": " lives. Lord, I think of the many that are here that would stand and testify, I've"
    },
    {
      "id": 24,
      "start": 3157.8600158691406,
      "end": 3163.4600219726562,
      "text": " been saved. I've been born again. I belong to Jesus. I've accepted Christ as"
    },
    {
      "id": 25,
      "start": 3163.4600219726562,
      "end": 3168.4200286865234,
      "text": " my Savior. This morning I pray that you'd help us to be encouraged and"
    },
    {
      "id": 26,
      "start": 3168.4200286865234,
      "end": 3172.9400177001953,
      "text": " strengthened. I pray God that you'd help us to have our eyes on Jesus, the author"
    },
    {
      "id": 27,
      "start": 3172.9400177001953,
      "end": 3178.300018310547,
      "text": " and finisher of our faith. I pray God this morning that you'd use us to reach a"
    },
    {
      "id": 28,
      "start": 3178.300018310547,
      "end": 3185.1400146484375,
      "text": " lost and dying world. Help us to be mindful on a daily basis that he that"
    },
    {
      "id": 29,
      "start": 3185.1800231933594,
      "end": 3191.4600219726562,
      "text": " shall come will come. Lord, help us to live our days for thee. I pray that you'd"
    },
    {
      "id": 30,
      "start": 3191.4600219726562,
      "end": 3195.6200256347656,
      "text": " work during this time of invitation as only you can. I pray that we would"
    },
    {
      "id": 31,
      "start": 3195.6200256347656,
      "end": 3199.6600189208984,
      "text": " respond and do business with thee. For it's in Christ's name we pray. Would you"
    },
    {
      "id": 32,
      "start": 3199.6600189208984,
      "end": 3202.5800170898438,
      "text": " stand with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on"
    },
    {
      "id": 33,
      "start": 3202.5800170898438,
      "end": 3206.7000274658203,
      "text": " the piano. As she does, the altar's open. If you'd like to make your way to the"
    },
    {
      "id": 34,
      "start": 3206.7000274658203,
      "end": 3209.6200256347656,
      "text": " altar, you're free to do so. If you want to pray in your seat right where you are,"
    },
    {
      "id": 35,
      "start": 3209.780029296875,
      "end": 3216.300018310547,
      "text": " make your your pew an altar. It's perfectly acceptable. Let's respond to"
    },
    {
      "id": 36,
      "start": 3216.300018310547,
      "end": 3221.3800201416016,
      "text": " the Lord this morning. As Kimberly plays, the altar's open."
    }
  ],
  "processed_at": "2025-04-17T14:27:31.980108"
}