{
  "video_id": "UJuC0OTu5_I",
  "text": "of this evening, the book of Genesis, the 25th chapter, Genesis chapter number 25 this evening. And we have had the opportunity now for some time to be studying through the book of Genesis. And it's been a great encouragement to me. I trust to you as well. And this is lesson number 59 through the book of Genesis. I won't tell you when we started, but it's been a while and we will eventually. So there's 50 chapters. So we're halfway. Amen. Isn't that awesome? And praise the Lord. And Genesis 25, we'll be looking at verses 1 through 11 this evening. And of course, we were first introduced to Abram back at the end of Genesis chapter number 11. It was in the 12th chapter in the first part of the chapter that we read about the call that God placed on the life of Abram and his response to that call of departing from the Ur of the Chaldees. And he went to a place whether he knew not. And we find that as we've traced the steps of Abram, Abraham became his name in Genesis chapter number 17. We've had the privilege from the end of chapter number 11 all the way through the first part of here, chapter 25 this evening, to really trace the steps of a hundred years of this man's life. Isn't that exciting? And as you study the life of Abraham, of course, his name is very familiar to us and to many around the world. He is one of the patriarchs. He is one that often was referenced as you would study through the gospels. And you look at his course testimony throughout the word of God. And this evening, as we come to this chapter where his death and burial are recorded, I trust it'll be a great encouragement to each of us as we consider really a life well lived. A life in which, yes, had ebbs and flows, had mountain peaks and valleys, had disappointments and great victories. And you think about the way in which we can relate to a life like that because we too live in this flesh and we live in this fallen world. And there are days in which we deal with adversity and great opposition and disappointment. But we find that our God is always faithful and he is always trustworthy and dependable. He always does what he says he will do. And as we look at the life of Abraham tonight, as we look at this portion, I trust that you'd be encouraged. Look at verse number nine with me. We'll get right into the message. The Bible says this in verse number nine, and his sons, Isaac and Ishmael, buried him in the cave of Machpelah in the field of Ephraim, the son of Zohar the Hittite, which is before Mamre. I've just titled the message this evening from that phrase in verse number nine, Isaac and Ishmael buried Abraham. As we look at the portion of scripture, if you're taking notes this evening, what you notice first of all, the descendants of Abraham. We begin reading this portion of scripture and we find that as you enter down into and get familiar with the timeline, you find that Abraham, when he dies, is 175 years old. And so therefore, we would find that this particular text of scripture that is given to us takes place 38 years after the death of Sarah. Now, of course, we read and studied the portion of scripture a few weeks ago in Genesis 23, where the Bible told us of the death and burial of Sarah and how that Abraham came to mourn for Sarah and to weep for her. And we find that at that time he was 137 years old, and now we find that he's 175 years old. And so these 38 years have now passed, and the Bible begins by telling us in verse number one of the text of scripture, then again, Abraham took a wife and her name was Ketorah. We find that as we read the next few verses of scripture that we'll read of the sons that were born to Abraham through Ketorah. But before we look at that, as we think about the descendants of Abraham, of course, we'd first have to go back to Genesis chapter number 16 and see the birth of Ishmael. We find that he, of course, was the one that was born really after the flesh, Hagar being the the mother of Ishmael. We understand the disappointment that was contained within the portion of scriptures we studied many months ago and had the opportunity to see how that through the counsel of Sarah and all that had taken place. And Ishmael is born, and we find that it was after the flesh. This was not the son of promise, as we'll find. That, of course, was Isaac. And we find that in chapter number 21, the Bible tells us that God gave the instruction to Abraham to cast out Ishmael along with Hagar. We find that as we study that portion of scripture and coupled it with the book of Galatians that Paul references under the inspiration of the Holy Spirit of God that this is an allegory. And the reality is that the son of the flesh cannot dwell with the son of promise. We think about the truth of being redeemed, and we think about the old nature and the new nature, and we understand that the old nature must be mortified. It must be crucified. We must walk in the spirit so that we do not fulfill the lust of the flesh. And what great truth is given to us there. We find that as they were cast out according to Genesis 21, verses 20 and 21, that he, Ishmael, dwelt in the wilderness of Paran. We also find that the Bible tells us that his mother, Hagar, took him a wife out of Egypt. Now, we understand that that would be understood. Not only the scriptures tell us that, but she, of course, Hagar, was from Egypt, and so it would make sense that she would return to find a wife for her son from Egypt. We then read about Isaac, the birth of Isaac. It's given to us in Genesis 21, and as we would look at and refer to the birth of Ishmael as being after the flesh, we would find this birth of Isaac. He is the son of promise. We find that the Bible tells us in Genesis 21, in verse number one, and the Lord visited Sarah as he had said, and the Lord did unto Sarah as he had spoken. For Sarah conceived and bare Abraham a son in his old age at the set time of which God had spoken to him, and Abraham called the name of his son that was born unto him, whom Sarah bare to him, Isaac. Now, God had given many promises to Abraham over the years with regard to this son that would be born, but, of course, Abraham and Sarah to have a son and the covenant that would be established, and we find the fulfillment of that birth there in Genesis 21. We find here in our text of Scripture, well, last week in Genesis 24, we read about the wife of Isaac, Rebekah. We looked at the entirety of chapter 24, and we find in verse number five, the Bible says of Isaac, of Genesis 25, that Abraham gave all that he had unto Isaac. We now read of these sons of Keturah. It tells us that Abraham took a wife. Her name was Keturah. Notice in verses two and three, the Bible tells us, and she bare him Zimran, and Jokshan, and Midan, and Midian, and Ishbak, and Shuah, and Jokshan begat Sheba, and Dedan, and the sons of Dedan were Asheram, and Latusham, and Lamumim, and the sons of Midian, Ephah, and Epher, and Hanok, and Abida, and Eldah. All these were the children of Keturah. And so you read of the sons, Zimran, Jokshan, Midan, Midian, Ishbak, and Shuah, and then the grandsons that are mentioned there, the descendants of these particular sons that are listed for us as well. But we find that in this list, of course, many Arab nations would come from these sons that were born. We find that the name that is most familiar out of this list of names that is provided to us of these sons of Keturah would be that of Midian. Of course, as you look at Bible history and you read through the Scriptures, you will read many things with regard to the Midianites. And as you read about the Midianites and you read about some of the adversity between the descendants of Midian, the Midianites, and the people of God, the nation of Israel, you will see that there was some real hostility between the descendants of Midian and the descendants of Isaac. And we see that throughout the pages of Scripture. And so Midian is absolutely the most familiar, biblically speaking, that we see. But these particular sons of Abraham would be where many Arab nations would, of course, come from. And we read of those things historically. It tells us that Abraham gave all that he had unto Isaac in verse number five. We see in verse number six, it says this, but unto the sons of the concubines which Abraham had, Abraham gave gifts and sent them away from Isaac, his son, while he yet lived eastward unto the east country. And so we notice in verse number six, of course, in verse number five, it tells us that Abraham gave all that he had unto Isaac. There were some gifts that were given to these sons that are mentioned in verses two and three, and to these sons were given gifts. But I want you to notice that the Bible says that Abraham sent them away from Isaac, his son, and where did he send them? Eastward unto the east country. And again, as you would think about the Arab nations that would descend from these individuals, you would find that in that region of the world there would be able to trace their lineage, etc., and so we find that the place of where they were sent by Abraham is noted for us. And we see the descendants of Abraham, and we know that as we continue through the scripture, I want you to really look at verses 7 through 10, number 2 if you're taking notes, the death of Abraham. As we look at the death of Abraham, I am encouraged, it's just a couple of verses of scripture, but I believe that it's encouraging when you think about the opportunity to walk with the Lord and to live a life that is well-pleasing. Notice what the Bible says in verses 7 and 8. The Bible says this, and these are the days of the years of Abraham's life which he lived, and hundred, threescore, and fifteen years. Then Abraham gave up the ghost and died in a good old age, an old man, and full of years, and was gathered to his people. When you think about someone that dies, you understand that there are preparations that are made, even in our culture and our custom, with having funeral services, etc. And if I were to look at verses 7 and 8 this evening, I would look at those as really being a eulogy. And you think about the eulogy that would be given, and obviously the length of eulogy here is quite short, but we find that God gives us some very interesting things with regard to the life of Abraham. We find that he is 175 years old, according to verse number 7, and we find that he walked with the Lord for a hundred years. That's a lengthy period of time. You think about that, if you go all the way back to Genesis 12, as I mentioned by way of introduction, that God calls Abram, and he calls him from the Ur of the Chaldees, and over the next 100 years from that initial response, that call that God gave to Abram in Genesis chapter number 12, all that we've read in all of these chapters, and watching Abraham grow and develop, and thinking about the increase of his faith, and how God was revealing himself to Abraham, and how wonderful that is. We begin to reflect on our own lives, and we think about the journey that we're on, and we understand that no one's having a funeral service this evening, but we begin to think about when was it that we started walking with God, and however many days God would give us the length of our life, and to consider the opportunity that we have to walk with him. It's interesting, I was just praying yesterday about the importance of finishing well, and finishing strong, and understanding that it's good to start out strong, it's good to start out well, but to finish well, to hear as Paul, as it's recorded for us in 2 Timothy chapter 4, to think about a life where he's finished his course. Not only did he finish, but he kept the faith. And, you know, you can finish, but did you finish with the same beliefs that you started with? Did you finish serving the Lord as faithfully as you started? And we find that as we look at the life of Abraham, and we consider these 100 years of walking with God, and you consider the mountaintops, and the valleys, and you consider great victories, you consider the way in which God had revealed himself to Abraham, the names by which God gave to Abraham, and describing the character, the very nature of God, and how he revealed himself to Abraham. What a blessing! And, you know, we began as we looked and saw that God revealed himself as El Elyon, and you think about God being the possessor of heaven and earth, and the impact that that made upon Abraham. And then, of course, when he told him that his name was El Shaddai, and you think about the truth that he is the Almighty God. Abraham was wavering at times, and wondering as to the promise that God had given with regard to a descendant. We know that there were times that he said, what about this, that's the servant that's born in my house? And God says, no, that's not the way it's going to work. I'm going to give you a son, and Abraham, you and Sarah will have a son. And you think about the way in which God was proving Abraham, and the way in which God was showing us, even through the account of Scripture, the plan that God has, and the ways in which we just walk with him and trust him, and find that he is always faithful. It was in Genesis chapter 22 that we had the opportunity to read about the great test that Abraham faced when God says, take thine son, thine only son, and go up to the mount that I'll show thee of. And it was there that he was to offer Isaac as an offering. We find that it was in that text of Scripture that we really find a mountain peak of faith in the life of Abraham, where he believed that God would provide. And as we read the book of Hebrews in the 11th chapter, we find that it's revealed to us there that Abraham understood that even if he had to kill his son, that God was able to raise him up. And what faith! We mentioned this as we studied that portion of Scripture a few weeks ago, and even as we've looked at the miracles of the Lord Jesus Christ during our Sunday School series, and we've considered the fact that Abraham, at that particular time, there's no one in recorded biblical history that had been raised from the dead, but Abraham believed that God was able. What faith! And we read about all of these events, and we read of the record that God has given us of these hundred years, and we can rejoice, and we can thank God for the testimony of this man Abraham. We find that it's in verse number eight that the Bible describes it this way, and these are the days of, excuse me, verse number eight, that Abraham gave up the ghost and died. Notice what it says, in a good old age, an old man. 175, I guess that is pretty old, and he died an old man. And it says this, and full of years, and was gathered to his people. It's interesting that phrase, full of years, the word full, it literally means abounding or satisfied. And oftentimes when we read it as full of years, we may think about it as really the quantity, but really, when we look at the text of Scripture, we find that verse number seven and part of verse number eight deals with the quantity of life, that he was 175 years old, that he was an old man, and we find the quantity of life, but really, in that phrase in verse number eight, when it says, and full of years, really what's being focused upon is the quality of life. Not only the quantity, but the quality. To think about the satisfaction, to think about the abounding nature of Abraham's life. Remember, it was back in Genesis 24, in verse number one, when the Bible tells us that Abraham was old and well stricken in age, and the Lord had blessed Abraham in all things. What a great testimony. The Lord had blessed Abraham in all things. God blesses, or the blessings of God, we think, and we mention, and we thank God for his blessings, and we are encouraged through song to count your blessings, name them one by one. I mentioned last week how that the reality is that there are times in which our understanding or definition or description of a blessing may differ from what God would look at as being a blessing. There are times when God says no, and I would submit to you this evening that that's a blessing. We say, no, I want God to say yes. Sometimes God says no, and that's a blessing, and we need to thank God for it, and we think about the trials and difficulties and how God is growing us and developing us, and we find the blessings that God had bestowed upon Abraham. As we look at the Word of God, I want you to consider this truth that Moses gives us in Deuteronomy. Turn to the 11th chapter, if you will. We'll be back to Genesis here in just a moment, but I want you to think about this when the Bible tells us that God blessed him, and we understand the content of what God is telling us, and really the summary of the life of Abraham, and to think about the blessing of God upon him that the Lord had blessed Abraham in all things, and we find that in Deuteronomy chapter 11, and this is a biblical principle that we find throughout the Word of God. I want you to notice, begin looking with me in verse number 26 of Deuteronomy 11. The Bible says this, \"'Behold, I set before you this day a blessing and a curse.'\" That sounds like a pretty good deal. There's a blessing and a curse, and so I want the blessing, right? If we took and pretended this evening, used our sanctified imaginations to say that there were two lines and a header over the door where the line would be formed, and the description of that particular door, one says, \"'Blessing, enter here,' and the other says, \"'Cursing, enter here.'\" You'd be crazy to get in the line that said, \"'Cursing.'\" Right? Somebody thinks something's wrong with you. You say, but this line is shorter. There's a reason it's shorter, amen? And you get in the line that says, \"'Blessing.'\" You say, yeah, that's what I'm signing up for. I desire God's blessing upon my life. Do you desire the blessing of God upon your life? Sure you do. The favor of God, the blessing of God, knowing that all that God gives us is for our good and for his glory, amen? And we say, God, I want your blessing, I want your favor upon my life. But as we know that as Moses is giving this instruction to the children of Israel, and he's saying to them as they're preparing for entering into the land of promise, he says this in verse 27, a blessing if you obey the commandments of the Lord your God which I command you this day. So we'd find that blessing is directly tied to obedience, correct? A blessing if ye obey the commandments of the Lord your God which I command you this day. He says today, listen, behold, I set before you this day a blessing and a curse. A blessing, but it's tied directly to obedience. Notice in verse 28, and a curse if ye will not obey the commandments of the Lord your God, but turn aside out of the way which I command you this day to go after other gods which you have not known. As you study the history of Israel through the Old Testament, you'll find there are many times in which they obeyed God. They had the favor of God, they had the blessing of God. You find, however, that with much frequency you read that the nation of Israel disobeyed the commandments of the Lord, correct? Often, as you read the accounts throughout the Word of God of the disobedience of the people of God to the commandments of God, it was not the fact that the commandments were not known to the people of God, it was not that they were not given the truth, it was that they chose to disobey. It was that they rebelled against what God said and we find that there would be cursing, there would be judgment, there would be opposition and adversity, and we find that they would deal with great troubles and trials and various levels of opposition. We find eventually, of course, as you note, the nation of Israel as a whole, and you think about the divided kingdom and, of course, the ten tribes of the north being taken captive by the Assyrians, and years later, Judah, the tribes in the south, being taken captive by the Babylonians. Why? Because of their disobedience. When Jeremiah is prophesying to the nation of Judah on the eve of the Babylonian captivity, he's seeking to encourage them to trust the Lord and we find that God is revealing to Jeremiah and Jeremiah sees the Babylonians have laid siege against the city and he understands the the days are coming in which they'll be taken captive and there are people, the king and others, that would come and say, is there a word from the Lord? The word's not changed, you've disobeyed and judgment is coming. Will God fight for us? And Jeremiah says, actually God will fight against you. Wow, what tragic news received that God Almighty would fight against them, but it was because of their disobedience. And so when we see the life of Abraham and we see the eulogy that is provided and we think of the quantity of life, but we also think of the the quality of life, that he was full of years, that he was both abounding and satisfied, the reality that he had walked with God and that he had seen and experienced the blessing of God and that God had blessed him in all things, and we understand this evening that the blessing of God is tied to obedience. It's a biblical truth all throughout the pages of Scripture and how vital it is that we make that decision that we would obey the Lord, follow his word, I will obey, and what a place to be. We find that it's in James chapter number 2 and the the New Testament truth that is given to us here, what a powerful verse of Scripture where the Bible says that the Scripture was fulfilled which saith Abraham believed God and it was imputed unto him for righteousness and he was called the friend of God. In James 2 and verse number 23, Abraham was called the friend of God. I'm thankful for the life of Abraham and as we think about the eulogy and we think about and even reflect upon our own lives, you'll recall that in Genesis chapter 23 as we looked at the life of Sarah and the death and the burial of Sarah that we mentioned that we're told by Solomon that it's better that we would go to the house of mourning than to the house of feasting, and we understand that the reason that it's better, that it's more advantageous for us to go to the house of mourning than to the house of feasting is because that is the end of all men. Man goes to his long home. And as we think about the life of Abraham and we look at just a couple of verses of Scripture but really consider in very brief overview fashion the the hundred years that are summarized in these chapters in the book of Genesis where God allows us to have insight to the life and experiences of Abraham, I wonder this evening how it is that at the time of our death what will the eulogy sound like? What is it that that someone would say of us when they look at our life? Would they look at our life as being a testimony of a life that that was lived for the Lord? A life, a testimony of a believer that trusted the Lord, that followed the Lord, that had faith? Oh not anyone that's perfect for we know that none of us are perfect. But we've come to the place where we've yielded and we've surrendered and we have sought to walk with God and we've desired and longed for that blessing of God upon our lives. We find that Abraham had a wonderful testimony. We find not only as you would think about a death and a funeral, you think of the eulogy but you also think of the burial and we find it in verses 9 and 10 God gives us the record of the burial of Abraham. The Bible says that his sons Isaac and Ishmael buried him and so we find that in the beginning of verse number 9 that the people that are involved are revealed to us and we find here that the Bible tells us that Isaac and Ishmael buried him in the cave of Machpelah. Now it's interesting that Isaac and Ishmael are now referenced in this portion of scripture. We find that of course at this particular time when you do all of the calculations in determining the death of Abraham and his age being a hundred and seventy-five years old that Isaac at this time is 75 and Ishmael is 89. Now if you go back to the 21st chapter of the book of Genesis that's where we read of the birth of Isaac and you'll remember that as we went through the portion of scripture that we come down and you find that in verse number 8 of Genesis 21 the Bible says the child grew speaking of Isaac and was weaned and Abraham made a great feast the same day that Isaac was weaned and Sarah saw the son of Hagar that's Ishmael the Egyptian which she had born unto Abraham mocking and it was at that time in which Sarah said cast out this bondwoman and her son. In verse number 10 we see that and we find that Sarah said for the son of this bondwoman shall not be heir with my son even with Isaac. We referenced this a few moments ago but looking at it in more detail here we find that God also says to Abraham because it was something that was grievous in the sight of Abraham and verse number 11 tells us that that God says to Abraham let it not be grievous in thy sight because of the lad and because of thy bondwoman and all that Sarah hath said unto thee hearken unto her voice for in Isaac shall thy seed be called. We find that Abraham according to verse number 14 rose up early in the morning and took bread and a bowl of water and gave it unto Hagar putting it on her shoulder and the child and sent her away and she departed and wandered in the wilderness of Beersheba. And so we studied this and we looked at this portion of scripture and as we understand the the truth that God has given us and now we find in this portion of scripture in which we're looking at tonight at the death and the burial of Abraham that now Isaac is 75 and Ishmael is 89 but when we look at Genesis chapter number 21 and we look at all that's going on we talked about the age of Ishmael at that particular time and we said that Ishmael would be between 16 and 17 years old and so from that time Isaac just a few years old according to historical tradition and so now over 70 years has passed because what happened with Ishmael well as we mentioned by way of introduction Ishmael and Hagar they were sent and they went to the wilderness of Paran and we find now that at the burial of Abraham that Isaac and Ishmael are there together. Now it's of note because we find that of course many of us do not many things from our toddler years from the age of two or three. It's not common for us to have memories of those particular events. Oftentimes I find in my own life at least that when we talk about things that we remember from those ages it's typically from hearing stories and what have you and you begin to rehearse some of those things. But some of us have had conversations what's the earliest memory that you have as a child and so on and so forth and we try to figure out how old we were and so on and so forth and some of you say I don't remember yesterday so I'm not sure what my earliest memory was I understand but but what I'm saying to you this evening is that a lengthy period of time has passed at least 70 years 70 72 years has passed from the time in which Ishmael is cast out and now the death of Abraham and I make that statement because as we look at the portion of Scripture here the Bible tells us in verse number nine and his sons Isaac and Ishmael buried him there does not seem as we look at the text of Scripture there's no animosity whatsoever that is hinted at in the text of Scripture none in fact as we would study the scriptures I find oftentimes that we will and I've been guilty of this myself of making statements about the hostilities between the descendants of Isaac and the descendants of Ishmael but if you study the scriptures you actually find and I think even when you study history will prove this to be the case and we'll study this as we continue through the book of Genesis you will find that there's a whole lot more animosity between the descendants of Jacob and the descendants of Edom you read of that regularly you read even of the animosity that we spoke about in the beginning of Genesis 25 with the descendants of Ketorah and thinking of Midian and the Midianites and so we see that here in this portion of Scripture it seems as if it's not even hinted at that there's any animosity whatsoever between Isaac and Ishmael they're there together burying Abraham so we see the people that are involved we see the place it's the cave of Machpelah we find that it says in the field of Ephraim the son of Zohar the Hittite which is before Mamre and then the Bible tells us in verse number 10 referencing back to what we studied in Genesis 23 the field which Abraham purchased of the sons of Heth there was Abraham buried and Sarah his wife and so we find that as we look at this portion of Scripture we've seen now the descendants we've seen the death the eulogy the burial of Abraham and we find that a great patriarch has now passed off the scene this life we understand the Bible teaches us that the wages of sin is death we understand that that contains the the truth of the second death but also that by sin comes death we understand physical death in the Bible tells us in Hebrews 9 as and it's appointed unto man wants to die after this the judgment and we understand this evening that we're not gonna live forever amen I'm gonna live forever I've often said to people over the years are you prepared to die if you were to die today we say that to people we sang songs this evening evangelistic songs about the gospel and about whosoever will and Christ receive its sinful men and what great songs they are and the reality is that we understand biblically that there's a time to be born and there is a time to die we have an appointment and as I think about that I've often said to people over the years are you prepared for that appointment are you prepared for it and we understand this evening the importance of trusting Christ as our Savior to understand that my sins have been forgiven that I've been born again that heaven is my home that I have that assurance that confidence and as we look at the life of Abraham here and we read of his death and his burial we're once again confronted with the brevity of life you say the brevity of life is 175 years old in comparison to eternity it's a very short the life span of mankind today is even shorter and when we look at it in comparison with eternity it's just that long and so often we spend so much time with that long and forget about the eternity part of it I've said over the years that there are many times in which especially being guilty of this and in our country in our culture and I understand it's where we are it's what we're confronted with but so often there is so much attention and so much emphasis that is placed upon retirement planning but very little on eternity planning I would say to you this evening I've said this before but I'd say it again this evening that retirement is not certain eternity is certain and there's so much emphasis placed upon retirement planning estate planning all of these things I'm not suggesting that you shouldn't plan but I'm just suggesting that the emphasis placed upon it might need to be re-evaluated because there's so much emphasis on the retirement planning part and again very little on the eternity planning part and I'm thankful that God tells us that we can store up treasure in heaven amen what a blessing to think about the the dividends of of that type of planning and to understand that as we walk with God as we faithfully serve God that we can hear well done thou good and faithful servant that we can receive even as we looked at a few weeks ago from Colossians 4 and understanding the reward of the fellow worker and understanding that God has given us in his word record of crowns that can be received and Paul was confident of receiving a crown he mentions it in 2nd Timothy 4 and verse number 8 that crown of righteousness and we think about those crowns they're not for us to keep but for us to cast at the at the very throne of our God and what a blessing and to have that perspective see eternity is certain Abraham wasn't gonna live forever he lived 175 years old it's a long time but really just that long in light of eternity and for us this evening when we read a passage of scripture like this I hope that we would be confronted and we would be aware of our own mortality in our own life and the brevity of our life and that we would reevaluate we'd look and say what is it that's going to be said at the end of my life how is it that that by life will be remembered who is it that that I'm impacting what is the testimony of my life how is it that it would it be said that I lived a life of faith that I lived in fear what will be said it's very unusual for an individual to pen their own eulogy happens just a little unusual this evening we think about not only what others would say of us but as I've mentioned before what God would say what God would say and tonight I hope that we'd be challenged as the thought of even looking at this testimony of Abraham we finish in verse number 11 this evening and it kind of almost seems as if it's a little bit of an addendum but it's a quite an interesting phrase that is used here if you are taking notes I would give a third point this evening as being the distinct air the Bible says this and it came to pass after the death of Abraham and so we've read of the descendants we've read of the death we've understood the eulogy the burial we see the the people involved with the burial the place of the burial and we find that God says it came to pass after the death of Abraham notice this it says that God blessed his son Isaac and Isaac dwelt by the well le hey I row I and as we look at the that that phrase right in the middle of the verse it says that God blessed his son Isaac we speak about the distinct air we find that here in verse number five we've read a few moments ago where the Bible says that Abraham gave all that he had unto Isaac we've read back in chapter number 21 where God says to Abraham to cast out the Ishmael and Hagar why for an Isaac shall thy seed be called we find that in the middle of Genesis chapter 25 the text in which we'll study next week that the Bible gives us in verses 12 through 18 the the descendants of Ishmael and discusses for us the death of Ishmael but really as we look at verse number 11 of Genesis 25 apart from those next several verses of Scripture what we find happens is the focus of Scripture now shifts from the life of Abraham to the life of Isaac and we find that this happened remember as we studied back in Genesis chapter 11 for just a moment turn back there if you will and I want you to just notice what God is giving us in chapters really chapters 10 and 11 of the book of Genesis you begin to read of these genealogies and all of the the sons of Japheth and the sons of Ham and the sons of Shem and you read of all of these descendants and then we find at the end of chapter number 11 that the Bible gives us all the descendants of Shem, and it begins to provide us with all of these names and all of these years and all that's taken place, and we find that we come to this place where the Bible tells us in verse number 26 of Genesis 11, and Terah lived 70 years and begat Abram, Nahor, and Haran, and we find that it's at that point that the Bible begins to focus its attention on Abram, on Abraham. We find even as we studied and looked throughout the text of Scripture, beginning in those messages at that particular place in the book of Genesis, how that the Hebrew race and the promise that God had given with regard to the Lord Jesus Christ and the line, the messianic line, and all of the prophecies of Scripture, and we find how that the broadness of the scope of Genesis 10 and Genesis 11 of understanding the genealogies and all of these descendants and so on, and it just zeroes in on Abraham, and we read all of these chapters and all of these events of a hundred years of the life of Abraham. Remember it was that God said this as we read Galatians, and just hold your place, yeah, just turn over to Galatians, you don't need to hold your place in Genesis anymore, but go over to Galatians, if you will, and I want you to know what God tells us here in the book of Galatians in chapter number 3, and we find again how the the attention of Scripture, the focus of Scripture from Abraham now shifting to Isaac, and we see this in Galatians 3 and verse number 16. Notice what the Bible says, \"...now to Abraham and his seed were the promises made.\" Notice what it says, \"...he saith not unto seeds, plural, as of many, but as of one, and to thy seed, which is Christ.\" We've mentioned in the past the phraseology of the title of a book that was written by William Scroggie, the unfolding drama of redemption, and we find how God, no doubt He could have given us all of the history of any of the other descendants that He chose to give us because He knows everything, but in His plan, in His plan of redemption, the Messianic line, the birth of Christ, we find that the shift of Scripture, the focus now shifts from that of Abraham to Isaac specifically. Just a few verses given to us with regard to the descendants of Ishmael and the death of Ishmael, and then you begin to read about Isaac, you begin to read about his life, and then you begin to read about his sons, and you begin to read about Israel as a nation and the twelve tribes, the twelve sons, and you see the focus. And Matthew 1 says this, and we'll close with this text of Scripture as we think about the truth that God has given us with regard to the shift of Scripture and understanding that Isaac is the distinct heir. We find that the Bible tells us this in Matthew 1. Matthew 1, beginning in verse number 1, the book of the generation of Jesus Christ, the son of David, the son of Abraham. Abraham begat Isaac. Is that what it says in verse number 2? And Isaac begat Jacob, and Jacob begat Judas and his brethren. We're not gonna go down through all of the text of Scripture here, but we find that focus of Scripture. Why? Because it's showing us that messianic line in which Jesus Christ would come to this earth, God in flesh. We find that it's in verse number 16, it says, \"...and Jacob begat Joseph, the husband of Mary, of whom was born Jesus, who is called Christ.\" So all the generations from Abraham to David are 14 generations, and from David until the carrying away into Babylon are 14 generations, and from the carrying away into Babylon unto Christ are 14 generations. I'm so thankful that God has given us a record, the Word of God, the pure Word of God. He's given us a record of these descendants and how He's promised the birth of Christ, and through the pages of Scripture we can trace and route and understand what God is doing and how God is working. This evening, as we look at this portion of Scripture, we think about the death of Abraham, I'll just close with saying this, we can rejoice in the testimony of a life well lived. We can rejoice. Listen, it's a blessing to be able to go. I went to a funeral not long ago, and you know, when you attend a funeral service, there are times in which there's, it's a home-going service, I mean, it's a wonderful rejoicing time of knowing that the individual walked with God and served God, and they're now with God, and what joy. And I had the privilege of attending such a funeral not long ago, and it was just a sweet service, a testimony of a faithful follower of Jesus Christ. That's my desire. A pastor friend that was there, it was for Pastor Mike Reed's wife, and Mrs. Reed, we prayed for her for a long time, Mrs. Reed went home to be with the Lord, and man, it was a wonderful, wonderful service. And a pastor friend that was sitting next to me at that funeral, he tapped me on the arm at the end, he said, this is what all of us should desire in a funeral service, a celebration of a life that was lived for Christ. And as we think about Abraham, and we think about the life of Abraham, we ought to rejoice in a life lived for the Lord, a life in which he followed the Lord. He went out not knowing where he went, just following the Lord. And he saw God do some amazing things. Was he perfect? No, not by far. Can we find critique? Can we find criticism? Can we poke at and say, look at this failure, and look at that? Absolutely. There's flaws. He's a man. But we find that he's the friend of God. He's in Hebrews 11. He had great faith. We say, man, I desire that when I die, I don't know when it's gonna be, could be tonight, probably you're not gonna live to 175. But whatever the time is, that I would decide that I want to follow the Lord, all in, all for him, because I want to have a life that's well lived. Let's pray together. Father, we love you. We thank you for loving us. We thank you for the life of Abraham. And as we look at this portion of Scripture, we're encouraged. But I would admit this evening that in addition to being encouraged, we are challenged in our own lives. And I pray that we'd take a few moments by way of invitation tonight to evaluate our own lives, to consider our own mortality. I trust that each one that's gathered here this evening knows you as their personal Lord and Savior. But if there might be one that's not sure of heaven, it'd be our prayer that tonight they'd be saved. With the thought that primarily we're speaking to believers this evening, I pray that we would be purposed in our lives. That we'd find that it was not by accident that Paul was able to say that he finished his course. For he set out and declared this purpose in Acts 20, that I might finish my course with joy. And God, I pray that for each one of us this evening, we know not how much longer we have in this race. We know not when our course will end. It is my prayer that each of us would have a desire to finish our course with joy. That we'd seek to walk with you and obey you. That we'd be doers of the Word. That your favor would be upon us, because we walk in obedience. We pray that you'd move and work as only you can. We'll thank you for every decision that's made, for it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.519999980926514,
      "text": " of this evening, the book of Genesis, the 25th chapter, Genesis chapter number 25 this evening."
    },
    {
      "id": 1,
      "start": 5.519999980926514,
      "end": 12.079999923706055,
      "text": " And we have had the opportunity now for some time to be studying through the book of Genesis."
    },
    {
      "id": 2,
      "start": 12.079999923706055,
      "end": 18.719999313354492,
      "text": " And it's been a great encouragement to me. I trust to you as well. And this is lesson number 59"
    },
    {
      "id": 3,
      "start": 18.719999313354492,
      "end": 25.200000762939453,
      "text": " through the book of Genesis. I won't tell you when we started, but it's been a while and we will"
    },
    {
      "id": 4,
      "start": 25.200000762939453,
      "end": 32.15999984741211,
      "text": " eventually. So there's 50 chapters. So we're halfway. Amen. Isn't that awesome? And praise"
    },
    {
      "id": 5,
      "start": 32.15999984741211,
      "end": 38.720001220703125,
      "text": " the Lord. And Genesis 25, we'll be looking at verses 1 through 11 this evening. And of course,"
    },
    {
      "id": 6,
      "start": 38.720001220703125,
      "end": 46.47999954223633,
      "text": " we were first introduced to Abram back at the end of Genesis chapter number 11. It was in the 12th"
    },
    {
      "id": 7,
      "start": 46.47999954223633,
      "end": 52.08000183105469,
      "text": " chapter in the first part of the chapter that we read about the call that God placed on the life"
    },
    {
      "id": 8,
      "start": 52.08000183105469,
      "end": 57.84000015258789,
      "text": " of Abram and his response to that call of departing from the Ur of the Chaldees. And he"
    },
    {
      "id": 9,
      "start": 57.84000015258789,
      "end": 65.27999877929688,
      "text": " went to a place whether he knew not. And we find that as we've traced the steps of Abram, Abraham"
    },
    {
      "id": 10,
      "start": 65.27999877929688,
      "end": 71.19999694824219,
      "text": " became his name in Genesis chapter number 17. We've had the privilege from the end of chapter"
    },
    {
      "id": 11,
      "start": 71.19999694824219,
      "end": 78.16000366210938,
      "text": " number 11 all the way through the first part of here, chapter 25 this evening, to really trace"
    },
    {
      "id": 12,
      "start": 78.16000366210938,
      "end": 85.04000091552734,
      "text": " the steps of a hundred years of this man's life. Isn't that exciting? And as you study the life"
    },
    {
      "id": 13,
      "start": 85.04000091552734,
      "end": 92.87999725341797,
      "text": " of Abraham, of course, his name is very familiar to us and to many around the world. He is one of"
    },
    {
      "id": 14,
      "start": 92.87999725341797,
      "end": 98.4800033569336,
      "text": " the patriarchs. He is one that often was referenced as you would study through the gospels. And"
    },
    {
      "id": 15,
      "start": 99.04000091552734,
      "end": 104.63999938964844,
      "text": " you look at his course testimony throughout the word of God. And this evening, as we come to this"
    },
    {
      "id": 16,
      "start": 104.63999938964844,
      "end": 110.16000366210938,
      "text": " chapter where his death and burial are recorded, I trust it'll be a great encouragement to each of"
    },
    {
      "id": 17,
      "start": 110.16000366210938,
      "end": 117.19999694824219,
      "text": " us as we consider really a life well lived. A life in which, yes, had ebbs and flows, had"
    },
    {
      "id": 18,
      "start": 117.19999694824219,
      "end": 125.04000091552734,
      "text": " mountain peaks and valleys, had disappointments and great victories. And you think about the"
    },
    {
      "id": 19,
      "start": 125.04000091552734,
      "end": 131.9199981689453,
      "text": " way in which we can relate to a life like that because we too live in this flesh and we live"
    },
    {
      "id": 20,
      "start": 131.9199981689453,
      "end": 138.63999938964844,
      "text": " in this fallen world. And there are days in which we deal with adversity and great opposition and"
    },
    {
      "id": 21,
      "start": 138.63999938964844,
      "end": 146.32000732421875,
      "text": " disappointment. But we find that our God is always faithful and he is always trustworthy and dependable."
    },
    {
      "id": 22,
      "start": 146.32000732421875,
      "end": 152.8800048828125,
      "text": " He always does what he says he will do. And as we look at the life of Abraham tonight, as we look"
    },
    {
      "id": 23,
      "start": 152.8800048828125,
      "end": 156.8800048828125,
      "text": " at this portion, I trust that you'd be encouraged. Look at verse number nine with me. We'll get right"
    },
    {
      "id": 24,
      "start": 156.8800048828125,
      "end": 162.39999389648438,
      "text": " into the message. The Bible says this in verse number nine, and his sons, Isaac and Ishmael,"
    },
    {
      "id": 25,
      "start": 162.39999389648438,
      "end": 169.36000061035156,
      "text": " buried him in the cave of Machpelah in the field of Ephraim, the son of Zohar the Hittite, which is"
    },
    {
      "id": 26,
      "start": 169.36000061035156,
      "end": 176.0,
      "text": " before Mamre. I've just titled the message this evening from that phrase in verse number nine,"
    },
    {
      "id": 27,
      "start": 176.0,
      "end": 181.52000427246094,
      "text": " Isaac and Ishmael buried Abraham. As we look at the portion of scripture, if you're taking notes"
    },
    {
      "id": 28,
      "start": 181.52000427246094,
      "end": 187.27999877929688,
      "text": " this evening, what you notice first of all, the descendants of Abraham. We begin reading this"
    },
    {
      "id": 29,
      "start": 187.27999877929688,
      "end": 193.60000610351562,
      "text": " portion of scripture and we find that as you enter down into and get familiar with the timeline,"
    },
    {
      "id": 30,
      "start": 193.60000610351562,
      "end": 201.27999877929688,
      "text": " you find that Abraham, when he dies, is 175 years old. And so therefore, we would find that this"
    },
    {
      "id": 31,
      "start": 201.27999877929688,
      "end": 209.1999969482422,
      "text": " particular text of scripture that is given to us takes place 38 years after the death of Sarah."
    },
    {
      "id": 32,
      "start": 209.9199981689453,
      "end": 215.52000427246094,
      "text": " Now, of course, we read and studied the portion of scripture a few weeks ago in Genesis 23,"
    },
    {
      "id": 33,
      "start": 215.52000427246094,
      "end": 221.60000610351562,
      "text": " where the Bible told us of the death and burial of Sarah and how that Abraham came to mourn for"
    },
    {
      "id": 34,
      "start": 221.60000610351562,
      "end": 227.60000610351562,
      "text": " Sarah and to weep for her. And we find that at that time he was 137 years old, and now we find"
    },
    {
      "id": 35,
      "start": 227.60000610351562,
      "end": 234.32000732421875,
      "text": " that he's 175 years old. And so these 38 years have now passed, and the Bible begins by telling"
    },
    {
      "id": 36,
      "start": 234.32000732421875,
      "end": 240.72000122070312,
      "text": " us in verse number one of the text of scripture, then again, Abraham took a wife and her name"
    },
    {
      "id": 37,
      "start": 241.27999877929688,
      "end": 246.24000549316406,
      "text": " was Ketorah. We find that as we read the next few verses of scripture that we'll read of the sons"
    },
    {
      "id": 38,
      "start": 246.24000549316406,
      "end": 251.83999633789062,
      "text": " that were born to Abraham through Ketorah. But before we look at that, as we think about the"
    },
    {
      "id": 39,
      "start": 251.83999633789062,
      "end": 256.9599914550781,
      "text": " descendants of Abraham, of course, we'd first have to go back to Genesis chapter number 16"
    },
    {
      "id": 40,
      "start": 256.9599914550781,
      "end": 262.79998779296875,
      "text": " and see the birth of Ishmael. We find that he, of course, was the one that was born really after the"
    },
    {
      "id": 41,
      "start": 262.79998779296875,
      "end": 271.44000244140625,
      "text": " flesh, Hagar being the the mother of Ishmael. We understand the disappointment that was contained"
    },
    {
      "id": 42,
      "start": 271.44000244140625,
      "end": 276.79998779296875,
      "text": " within the portion of scriptures we studied many months ago and had the opportunity to see how that"
    },
    {
      "id": 43,
      "start": 277.6000061035156,
      "end": 283.67999267578125,
      "text": " through the counsel of Sarah and all that had taken place. And Ishmael is born, and we find"
    },
    {
      "id": 44,
      "start": 283.67999267578125,
      "end": 290.3999938964844,
      "text": " that it was after the flesh. This was not the son of promise, as we'll find. That, of course,"
    },
    {
      "id": 45,
      "start": 290.3999938964844,
      "end": 297.5199890136719,
      "text": " was Isaac. And we find that in chapter number 21, the Bible tells us that God gave the instruction"
    },
    {
      "id": 46,
      "start": 297.5199890136719,
      "end": 305.0400085449219,
      "text": " to Abraham to cast out Ishmael along with Hagar. We find that as we study that portion of scripture"
    },
    {
      "id": 47,
      "start": 305.0400085449219,
      "end": 310.0,
      "text": " and coupled it with the book of Galatians that Paul references under the inspiration of the Holy"
    },
    {
      "id": 48,
      "start": 310.0,
      "end": 317.9200134277344,
      "text": " Spirit of God that this is an allegory. And the reality is that the son of the flesh cannot dwell"
    },
    {
      "id": 49,
      "start": 317.9200134277344,
      "end": 324.0799865722656,
      "text": " with the son of promise. We think about the truth of being redeemed, and we think about the old nature"
    },
    {
      "id": 50,
      "start": 324.0799865722656,
      "end": 330.4800109863281,
      "text": " and the new nature, and we understand that the old nature must be mortified. It must be crucified."
    },
    {
      "id": 51,
      "start": 330.4800109863281,
      "end": 335.67999267578125,
      "text": " We must walk in the spirit so that we do not fulfill the lust of the flesh. And what great"
    },
    {
      "id": 52,
      "start": 335.67999267578125,
      "end": 341.5199890136719,
      "text": " truth is given to us there. We find that as they were cast out according to Genesis 21, verses 20"
    },
    {
      "id": 53,
      "start": 341.5199890136719,
      "end": 349.5199890136719,
      "text": " and 21, that he, Ishmael, dwelt in the wilderness of Paran. We also find that the Bible tells us"
    },
    {
      "id": 54,
      "start": 349.5199890136719,
      "end": 355.0400085449219,
      "text": " that his mother, Hagar, took him a wife out of Egypt. Now, we understand that that would be"
    },
    {
      "id": 55,
      "start": 356.0,
      "end": 361.9200134277344,
      "text": " understood. Not only the scriptures tell us that, but she, of course, Hagar, was from Egypt, and so"
    },
    {
      "id": 56,
      "start": 361.9200134277344,
      "end": 368.79998779296875,
      "text": " it would make sense that she would return to find a wife for her son from Egypt. We then read about"
    },
    {
      "id": 57,
      "start": 368.79998779296875,
      "end": 375.0400085449219,
      "text": " Isaac, the birth of Isaac. It's given to us in Genesis 21, and as we would look at and refer to"
    },
    {
      "id": 58,
      "start": 375.0400085449219,
      "end": 381.6000061035156,
      "text": " the birth of Ishmael as being after the flesh, we would find this birth of Isaac. He is the son of"
    },
    {
      "id": 59,
      "start": 381.6000061035156,
      "end": 386.239990234375,
      "text": " promise. We find that the Bible tells us in Genesis 21, in verse number one,"
    },
    {
      "id": 60,
      "start": 386.239990234375,
      "end": 392.9599914550781,
      "text": " and the Lord visited Sarah as he had said, and the Lord did unto Sarah as he had spoken."
    },
    {
      "id": 61,
      "start": 393.9200134277344,
      "end": 399.3599853515625,
      "text": " For Sarah conceived and bare Abraham a son in his old age at the set time of which God had spoken"
    },
    {
      "id": 62,
      "start": 399.3599853515625,
      "end": 404.32000732421875,
      "text": " to him, and Abraham called the name of his son that was born unto him, whom Sarah bare to him,"
    },
    {
      "id": 63,
      "start": 404.9599914550781,
      "end": 411.6000061035156,
      "text": " Isaac. Now, God had given many promises to Abraham over the years with regard to this son that would"
    },
    {
      "id": 64,
      "start": 411.6000061035156,
      "end": 418.3999938964844,
      "text": " be born, but, of course, Abraham and Sarah to have a son and the covenant that would be established,"
    },
    {
      "id": 65,
      "start": 418.3999938964844,
      "end": 424.239990234375,
      "text": " and we find the fulfillment of that birth there in Genesis 21. We find here in our text of"
    },
    {
      "id": 66,
      "start": 424.239990234375,
      "end": 430.1600036621094,
      "text": " Scripture, well, last week in Genesis 24, we read about the wife of Isaac, Rebekah. We looked at the"
    },
    {
      "id": 67,
      "start": 430.1600036621094,
      "end": 437.44000244140625,
      "text": " entirety of chapter 24, and we find in verse number five, the Bible says of Isaac, of Genesis 25,"
    },
    {
      "id": 68,
      "start": 437.44000244140625,
      "end": 445.6000061035156,
      "text": " that Abraham gave all that he had unto Isaac. We now read of these sons of Keturah. It tells us"
    },
    {
      "id": 69,
      "start": 445.6000061035156,
      "end": 450.4800109863281,
      "text": " that Abraham took a wife. Her name was Keturah. Notice in verses two and three, the Bible tells"
    },
    {
      "id": 70,
      "start": 450.4800109863281,
      "end": 458.32000732421875,
      "text": " us, and she bare him Zimran, and Jokshan, and Midan, and Midian, and Ishbak, and Shuah, and"
    },
    {
      "id": 71,
      "start": 458.32000732421875,
      "end": 467.67999267578125,
      "text": " Jokshan begat Sheba, and Dedan, and the sons of Dedan were Asheram, and Latusham, and Lamumim,"
    },
    {
      "id": 72,
      "start": 467.760009765625,
      "end": 475.44000244140625,
      "text": " and the sons of Midian, Ephah, and Epher, and Hanok, and Abida, and Eldah. All these were the"
    },
    {
      "id": 73,
      "start": 475.44000244140625,
      "end": 483.0400085449219,
      "text": " children of Keturah. And so you read of the sons, Zimran, Jokshan, Midan, Midian, Ishbak, and Shuah,"
    },
    {
      "id": 74,
      "start": 483.0400085449219,
      "end": 487.2799987792969,
      "text": " and then the grandsons that are mentioned there, the descendants of these particular sons that are"
    },
    {
      "id": 75,
      "start": 487.2799987792969,
      "end": 494.4800109863281,
      "text": " listed for us as well. But we find that in this list, of course, many Arab nations would come from"
    },
    {
      "id": 76,
      "start": 495.2799987792969,
      "end": 501.760009765625,
      "text": " these sons that were born. We find that the name that is most familiar out of this list of"
    },
    {
      "id": 77,
      "start": 501.760009765625,
      "end": 507.20001220703125,
      "text": " names that is provided to us of these sons of Keturah would be that of Midian. Of course,"
    },
    {
      "id": 78,
      "start": 507.20001220703125,
      "end": 512.6400146484375,
      "text": " as you look at Bible history and you read through the Scriptures, you will read many things with"
    },
    {
      "id": 79,
      "start": 512.6400146484375,
      "end": 518.1599731445312,
      "text": " regard to the Midianites. And as you read about the Midianites and you read about some of the"
    },
    {
      "id": 80,
      "start": 518.1599731445312,
      "end": 524.6400146484375,
      "text": " adversity between the descendants of Midian, the Midianites, and the people of God, the nation of"
    },
    {
      "id": 81,
      "start": 524.6400146484375,
      "end": 531.1199951171875,
      "text": " Israel, you will see that there was some real hostility between the descendants of Midian and"
    },
    {
      "id": 82,
      "start": 531.1199951171875,
      "end": 536.719970703125,
      "text": " the descendants of Isaac. And we see that throughout the pages of Scripture. And so"
    },
    {
      "id": 83,
      "start": 536.719970703125,
      "end": 543.3599853515625,
      "text": " Midian is absolutely the most familiar, biblically speaking, that we see. But these particular sons"
    },
    {
      "id": 84,
      "start": 543.3599853515625,
      "end": 551.8400268554688,
      "text": " of Abraham would be where many Arab nations would, of course, come from. And we read of those"
    },
    {
      "id": 85,
      "start": 551.8400268554688,
      "end": 556.239990234375,
      "text": " things historically. It tells us that Abraham gave all that he had unto Isaac in verse number five."
    },
    {
      "id": 86,
      "start": 556.239990234375,
      "end": 561.6799926757812,
      "text": " We see in verse number six, it says this, but unto the sons of the concubines which Abraham had,"
    },
    {
      "id": 87,
      "start": 561.6799926757812,
      "end": 568.3200073242188,
      "text": " Abraham gave gifts and sent them away from Isaac, his son, while he yet lived eastward unto"
    },
    {
      "id": 88,
      "start": 568.8800048828125,
      "end": 575.280029296875,
      "text": " the east country. And so we notice in verse number six, of course, in verse number five, it tells us"
    },
    {
      "id": 89,
      "start": 575.280029296875,
      "end": 579.6799926757812,
      "text": " that Abraham gave all that he had unto Isaac. There were some gifts that were given to these"
    },
    {
      "id": 90,
      "start": 579.6799926757812,
      "end": 584.5599975585938,
      "text": " sons that are mentioned in verses two and three, and to these sons were given gifts. But I want you"
    },
    {
      "id": 91,
      "start": 584.5599975585938,
      "end": 590.3200073242188,
      "text": " to notice that the Bible says that Abraham sent them away from Isaac, his son, and where did he"
    },
    {
      "id": 92,
      "start": 590.3200073242188,
      "end": 596.6400146484375,
      "text": " send them? Eastward unto the east country. And again, as you would think about the Arab nations"
    },
    {
      "id": 93,
      "start": 596.6400146484375,
      "end": 599.8400268554688,
      "text": " that would descend from these individuals, you would find"
    },
    {
      "id": 0,
      "start": 599.8400268554688,
      "end": 605.5200266838074,
      "text": " that in that region of the world there would be able to trace their lineage, etc., and so we find"
    },
    {
      "id": 1,
      "start": 605.5200266838074,
      "end": 611.6000270843506,
      "text": " that the place of where they were sent by Abraham is noted for us. And we see the descendants of"
    },
    {
      "id": 2,
      "start": 611.6000270843506,
      "end": 615.6800270080566,
      "text": " Abraham, and we know that as we continue through the scripture, I want you to really look at"
    },
    {
      "id": 3,
      "start": 616.4000263214111,
      "end": 622.0800266265869,
      "text": " verses 7 through 10, number 2 if you're taking notes, the death of Abraham. As we look at the"
    },
    {
      "id": 4,
      "start": 622.0800266265869,
      "end": 627.0400276184082,
      "text": " death of Abraham, I am encouraged, it's just a couple of verses of scripture, but I believe that"
    },
    {
      "id": 5,
      "start": 627.0400276184082,
      "end": 632.0800285339355,
      "text": " it's encouraging when you think about the opportunity to walk with the Lord and to live"
    },
    {
      "id": 6,
      "start": 632.0800285339355,
      "end": 638.3200263977051,
      "text": " a life that is well-pleasing. Notice what the Bible says in verses 7 and 8. The Bible says this,"
    },
    {
      "id": 7,
      "start": 638.3200263977051,
      "end": 644.0000267028809,
      "text": " and these are the days of the years of Abraham's life which he lived, and hundred, threescore,"
    },
    {
      "id": 8,
      "start": 644.0000267028809,
      "end": 650.8000259399414,
      "text": " and fifteen years. Then Abraham gave up the ghost and died in a good old age, an old man,"
    },
    {
      "id": 9,
      "start": 650.8000259399414,
      "end": 656.5600280761719,
      "text": " and full of years, and was gathered to his people. When you think about someone that dies,"
    },
    {
      "id": 10,
      "start": 656.5600280761719,
      "end": 661.5200271606445,
      "text": " you understand that there are preparations that are made, even in our culture and our custom,"
    },
    {
      "id": 11,
      "start": 661.5200271606445,
      "end": 666.6400299072266,
      "text": " with having funeral services, etc. And if I were to look at verses 7 and 8 this evening,"
    },
    {
      "id": 12,
      "start": 666.6400299072266,
      "end": 671.280029296875,
      "text": " I would look at those as really being a eulogy. And you think about the eulogy that would be"
    },
    {
      "id": 13,
      "start": 671.280029296875,
      "end": 678.4800262451172,
      "text": " given, and obviously the length of eulogy here is quite short, but we find that God gives us"
    },
    {
      "id": 14,
      "start": 678.4800262451172,
      "end": 685.280029296875,
      "text": " some very interesting things with regard to the life of Abraham. We find that he is 175 years"
    },
    {
      "id": 15,
      "start": 685.280029296875,
      "end": 690.2400283813477,
      "text": " old, according to verse number 7, and we find that he walked with the Lord for a hundred years."
    },
    {
      "id": 16,
      "start": 690.2400283813477,
      "end": 694.4800262451172,
      "text": " That's a lengthy period of time. You think about that, if you go all the way back to Genesis 12,"
    },
    {
      "id": 17,
      "start": 694.4800262451172,
      "end": 700.3200302124023,
      "text": " as I mentioned by way of introduction, that God calls Abram, and he calls him from the Ur of the"
    },
    {
      "id": 18,
      "start": 700.3200302124023,
      "end": 708.0800247192383,
      "text": " Chaldees, and over the next 100 years from that initial response, that call that God gave to"
    },
    {
      "id": 19,
      "start": 708.0800247192383,
      "end": 713.8400268554688,
      "text": " Abram in Genesis chapter number 12, all that we've read in all of these chapters, and watching"
    },
    {
      "id": 20,
      "start": 714.6400299072266,
      "end": 721.8400268554688,
      "text": " Abraham grow and develop, and thinking about the increase of his faith, and how God was"
    },
    {
      "id": 21,
      "start": 721.8400268554688,
      "end": 728.1600341796875,
      "text": " revealing himself to Abraham, and how wonderful that is. We begin to reflect on our own lives,"
    },
    {
      "id": 22,
      "start": 728.1600341796875,
      "end": 734.8000335693359,
      "text": " and we think about the journey that we're on, and we understand that no one's having a funeral"
    },
    {
      "id": 23,
      "start": 734.8000335693359,
      "end": 740.3200225830078,
      "text": " service this evening, but we begin to think about when was it that we started walking with God,"
    },
    {
      "id": 24,
      "start": 740.3200225830078,
      "end": 747.280029296875,
      "text": " and however many days God would give us the length of our life, and to consider the opportunity that"
    },
    {
      "id": 25,
      "start": 747.280029296875,
      "end": 753.52001953125,
      "text": " we have to walk with him. It's interesting, I was just praying yesterday about the importance of"
    },
    {
      "id": 26,
      "start": 753.52001953125,
      "end": 760.0800323486328,
      "text": " finishing well, and finishing strong, and understanding that it's good to start out"
    },
    {
      "id": 27,
      "start": 760.0800323486328,
      "end": 767.9200286865234,
      "text": " strong, it's good to start out well, but to finish well, to hear as Paul, as it's recorded for us in"
    },
    {
      "id": 28,
      "start": 767.9200286865234,
      "end": 774.7200317382812,
      "text": " 2 Timothy chapter 4, to think about a life where he's finished his course. Not only did he finish,"
    },
    {
      "id": 29,
      "start": 774.7200317382812,
      "end": 781.9200286865234,
      "text": " but he kept the faith. And, you know, you can finish, but did you finish with the same beliefs"
    },
    {
      "id": 30,
      "start": 781.9200286865234,
      "end": 787.6800231933594,
      "text": " that you started with? Did you finish serving the Lord as faithfully as you started? And we find that"
    },
    {
      "id": 31,
      "start": 787.6800231933594,
      "end": 793.52001953125,
      "text": " as we look at the life of Abraham, and we consider these 100 years of walking with God,"
    },
    {
      "id": 32,
      "start": 794.3200225830078,
      "end": 801.6000213623047,
      "text": " and you consider the mountaintops, and the valleys, and you consider great victories, you consider"
    },
    {
      "id": 33,
      "start": 801.6000213623047,
      "end": 810.4800262451172,
      "text": " the way in which God had revealed himself to Abraham, the names by which God gave to Abraham,"
    },
    {
      "id": 34,
      "start": 810.4800262451172,
      "end": 816.4000244140625,
      "text": " and describing the character, the very nature of God, and how he revealed himself to Abraham."
    },
    {
      "id": 35,
      "start": 816.4000244140625,
      "end": 824.3200225830078,
      "text": " What a blessing! And, you know, we began as we looked and saw that God revealed himself as"
    },
    {
      "id": 36,
      "start": 824.3200225830078,
      "end": 831.4400329589844,
      "text": " El Elyon, and you think about God being the possessor of heaven and earth, and the impact"
    },
    {
      "id": 37,
      "start": 831.4400329589844,
      "end": 837.7600250244141,
      "text": " that that made upon Abraham. And then, of course, when he told him that his name was El Shaddai,"
    },
    {
      "id": 38,
      "start": 837.7600250244141,
      "end": 844.1600341796875,
      "text": " and you think about the truth that he is the Almighty God. Abraham was wavering at times, and"
    },
    {
      "id": 39,
      "start": 844.9600219726562,
      "end": 850.7200317382812,
      "text": " wondering as to the promise that God had given with regard to a descendant. We know that there"
    },
    {
      "id": 40,
      "start": 850.7200317382812,
      "end": 857.3600158691406,
      "text": " were times that he said, what about this, that's the servant that's born in my house? And God says,"
    },
    {
      "id": 41,
      "start": 857.3600158691406,
      "end": 861.52001953125,
      "text": " no, that's not the way it's going to work. I'm going to give you a son, and Abraham,"
    },
    {
      "id": 42,
      "start": 862.1600341796875,
      "end": 867.52001953125,
      "text": " you and Sarah will have a son. And you think about the way in which God was proving Abraham,"
    },
    {
      "id": 43,
      "start": 867.6000366210938,
      "end": 874.4000244140625,
      "text": " and the way in which God was showing us, even through the account of Scripture, the plan that"
    },
    {
      "id": 44,
      "start": 874.4000244140625,
      "end": 879.9200134277344,
      "text": " God has, and the ways in which we just walk with him and trust him, and find that he is always"
    },
    {
      "id": 45,
      "start": 879.9200134277344,
      "end": 886.8800354003906,
      "text": " faithful. It was in Genesis chapter 22 that we had the opportunity to read about the great test"
    },
    {
      "id": 46,
      "start": 886.8800354003906,
      "end": 894.4800415039062,
      "text": " that Abraham faced when God says, take thine son, thine only son, and go up to the mount that I'll"
    },
    {
      "id": 47,
      "start": 894.4800415039062,
      "end": 900.2400207519531,
      "text": " show thee of. And it was there that he was to offer Isaac as an offering. We find that it was"
    },
    {
      "id": 48,
      "start": 900.2400207519531,
      "end": 906.4800415039062,
      "text": " in that text of Scripture that we really find a mountain peak of faith in the life of Abraham,"
    },
    {
      "id": 49,
      "start": 906.4800415039062,
      "end": 912.8000183105469,
      "text": " where he believed that God would provide. And as we read the book of Hebrews in the 11th chapter,"
    },
    {
      "id": 50,
      "start": 912.8000183105469,
      "end": 918.3200378417969,
      "text": " we find that it's revealed to us there that Abraham understood that even if he had to kill"
    },
    {
      "id": 51,
      "start": 918.3200378417969,
      "end": 926.1600341796875,
      "text": " his son, that God was able to raise him up. And what faith! We mentioned this as we studied that"
    },
    {
      "id": 52,
      "start": 926.1600341796875,
      "end": 930.9600219726562,
      "text": " portion of Scripture a few weeks ago, and even as we've looked at the miracles of the Lord Jesus"
    },
    {
      "id": 53,
      "start": 930.9600219726562,
      "end": 935.8400268554688,
      "text": " Christ during our Sunday School series, and we've considered the fact that Abraham, at that"
    },
    {
      "id": 54,
      "start": 935.8400268554688,
      "end": 941.6800231933594,
      "text": " particular time, there's no one in recorded biblical history that had been raised from the dead,"
    },
    {
      "id": 55,
      "start": 942.3200378417969,
      "end": 950.4800415039062,
      "text": " but Abraham believed that God was able. What faith! And we read about all of these events,"
    },
    {
      "id": 56,
      "start": 950.4800415039062,
      "end": 958.0000305175781,
      "text": " and we read of the record that God has given us of these hundred years, and we can rejoice,"
    },
    {
      "id": 57,
      "start": 958.0000305175781,
      "end": 964.6400146484375,
      "text": " and we can thank God for the testimony of this man Abraham. We find that it's in verse number eight"
    },
    {
      "id": 58,
      "start": 964.6400146484375,
      "end": 968.9600219726562,
      "text": " that the Bible describes it this way, and these are the days of, excuse me, verse number eight,"
    },
    {
      "id": 59,
      "start": 968.9600219726562,
      "end": 977.2000122070312,
      "text": " that Abraham gave up the ghost and died. Notice what it says, in a good old age, an old man. 175,"
    },
    {
      "id": 60,
      "start": 977.2000122070312,
      "end": 984.7200317382812,
      "text": " I guess that is pretty old, and he died an old man. And it says this, and full of years,"
    },
    {
      "id": 61,
      "start": 984.7200317382812,
      "end": 990.4000244140625,
      "text": " and was gathered to his people. It's interesting that phrase, full of years, the word full,"
    },
    {
      "id": 62,
      "start": 991.3600158691406,
      "end": 999.1200256347656,
      "text": " it literally means abounding or satisfied. And oftentimes when we read it as full of years,"
    },
    {
      "id": 63,
      "start": 999.1200256347656,
      "end": 1005.280029296875,
      "text": " we may think about it as really the quantity, but really, when we look at the text of Scripture,"
    },
    {
      "id": 64,
      "start": 1005.280029296875,
      "end": 1011.2000122070312,
      "text": " we find that verse number seven and part of verse number eight deals with the quantity of life,"
    },
    {
      "id": 65,
      "start": 1011.2000122070312,
      "end": 1019.6800231933594,
      "text": " that he was 175 years old, that he was an old man, and we find the quantity of life,"
    },
    {
      "id": 66,
      "start": 1019.6800231933594,
      "end": 1024.8800354003906,
      "text": " but really, in that phrase in verse number eight, when it says, and full of years,"
    },
    {
      "id": 67,
      "start": 1024.8800354003906,
      "end": 1032.9600219726562,
      "text": " really what's being focused upon is the quality of life. Not only the quantity, but the quality."
    },
    {
      "id": 68,
      "start": 1032.9600219726562,
      "end": 1039.52001953125,
      "text": " To think about the satisfaction, to think about the abounding nature of Abraham's life. Remember,"
    },
    {
      "id": 69,
      "start": 1039.52001953125,
      "end": 1044.5600280761719,
      "text": " it was back in Genesis 24, in verse number one, when the Bible tells us that Abraham was old and"
    },
    {
      "id": 70,
      "start": 1044.5600280761719,
      "end": 1051.6800231933594,
      "text": " well stricken in age, and the Lord had blessed Abraham in all things. What a great testimony."
    },
    {
      "id": 71,
      "start": 1051.6800231933594,
      "end": 1060.9600219726562,
      "text": " The Lord had blessed Abraham in all things. God blesses, or the blessings of God, we think,"
    },
    {
      "id": 72,
      "start": 1060.9600219726562,
      "end": 1066.2400207519531,
      "text": " and we mention, and we thank God for his blessings, and we are encouraged through song to"
    },
    {
      "id": 73,
      "start": 1066.2400207519531,
      "end": 1072.4800415039062,
      "text": " count your blessings, name them one by one. I mentioned last week how that the reality is that"
    },
    {
      "id": 74,
      "start": 1072.4800415039062,
      "end": 1078.4800415039062,
      "text": " there are times in which our understanding or definition or description of a blessing may differ"
    },
    {
      "id": 75,
      "start": 1078.4800415039062,
      "end": 1084.8000183105469,
      "text": " from what God would look at as being a blessing. There are times when God says no, and I would"
    },
    {
      "id": 76,
      "start": 1084.8000183105469,
      "end": 1090.8000183105469,
      "text": " submit to you this evening that that's a blessing. We say, no, I want God to say yes. Sometimes God"
    },
    {
      "id": 77,
      "start": 1090.8000183105469,
      "end": 1095.4400329589844,
      "text": " says no, and that's a blessing, and we need to thank God for it, and we think about the trials"
    },
    {
      "id": 78,
      "start": 1095.4400329589844,
      "end": 1101.4400329589844,
      "text": " and difficulties and how God is growing us and developing us, and we find the blessings that God"
    },
    {
      "id": 79,
      "start": 1101.4400329589844,
      "end": 1107.9200134277344,
      "text": " had bestowed upon Abraham. As we look at the Word of God, I want you to consider this truth that"
    },
    {
      "id": 80,
      "start": 1107.9200134277344,
      "end": 1112.6400146484375,
      "text": " Moses gives us in Deuteronomy. Turn to the 11th chapter, if you will. We'll be back to Genesis"
    },
    {
      "id": 81,
      "start": 1112.6400146484375,
      "end": 1117.1200561523438,
      "text": " here in just a moment, but I want you to think about this when the Bible tells us that God blessed"
    },
    {
      "id": 82,
      "start": 1117.1200561523438,
      "end": 1126.9600219726562,
      "text": " him, and we understand the content of what God is telling us, and really the summary of the life of"
    },
    {
      "id": 83,
      "start": 1126.9600219726562,
      "end": 1133.1200561523438,
      "text": " Abraham, and to think about the blessing of God upon him that the Lord had blessed Abraham in all"
    },
    {
      "id": 84,
      "start": 1133.1200561523438,
      "end": 1139.2000122070312,
      "text": " things, and we find that in Deuteronomy chapter 11, and this is a biblical principle that we find"
    },
    {
      "id": 85,
      "start": 1139.2000122070312,
      "end": 1144.800048828125,
      "text": " throughout the Word of God. I want you to notice, begin looking with me in verse number 26 of"
    },
    {
      "id": 86,
      "start": 1144.800048828125,
      "end": 1154.800048828125,
      "text": " Deuteronomy 11. The Bible says this, \"'Behold, I set before you this day a blessing and a curse.'\""
    },
    {
      "id": 87,
      "start": 1155.6000366210938,
      "end": 1160.3200073242188,
      "text": " That sounds like a pretty good deal. There's a blessing and a curse, and so I want the blessing,"
    },
    {
      "id": 88,
      "start": 1160.3200073242188,
      "end": 1165.760009765625,
      "text": " right? If we took and pretended this evening, used our sanctified imaginations to say"
    },
    {
      "id": 89,
      "start": 1166.4800415039062,
      "end": 1172.6400146484375,
      "text": " that there were two lines and a header over the door where the line would be formed, and"
    },
    {
      "id": 90,
      "start": 1172.6400146484375,
      "end": 1177.9200439453125,
      "text": " the description of that particular door, one says, \"'Blessing, enter here,' and the other says,"
    },
    {
      "id": 91,
      "start": 1177.9200439453125,
      "end": 1184.4000244140625,
      "text": " \"'Cursing, enter here.'\" You'd be crazy to get in the line that said, \"'Cursing.'\" Right? Somebody"
    },
    {
      "id": 92,
      "start": 1184.4000244140625,
      "end": 1188.3200073242188,
      "text": " thinks something's wrong with you. You say, but this line is shorter. There's a reason it's"
    },
    {
      "id": 93,
      "start": 1188.3200073242188,
      "end": 1193.0400390625,
      "text": " shorter, amen? And you get in the line that says, \"'Blessing.'\" You say, yeah, that's what I'm"
    },
    {
      "id": 94,
      "start": 1193.0400390625,
      "end": 1199.760009765625,
      "text": " signing up for. I desire God's blessing upon my life. Do you desire the blessing of God upon your"
    },
    {
      "id": 0,
      "start": 1199.760009765625,
      "end": 1205.2800097465515,
      "text": " life? Sure you do. The favor of God, the blessing of God, knowing that all that"
    },
    {
      "id": 1,
      "start": 1205.2800097465515,
      "end": 1210.9600095748901,
      "text": " God gives us is for our good and for his glory, amen? And we say, God, I want your"
    },
    {
      "id": 2,
      "start": 1210.9600095748901,
      "end": 1216.6400089263916,
      "text": " blessing, I want your favor upon my life. But as we know that as Moses is giving"
    },
    {
      "id": 3,
      "start": 1216.6400089263916,
      "end": 1221.1200103759766,
      "text": " this instruction to the children of Israel, and he's saying to them as"
    },
    {
      "id": 4,
      "start": 1221.1200103759766,
      "end": 1225.3600101470947,
      "text": " they're preparing for entering into the land of promise, he says this in verse"
    },
    {
      "id": 5,
      "start": 1225.3600101470947,
      "end": 1232.6400108337402,
      "text": " 27, a blessing if you obey the commandments of the Lord your God which"
    },
    {
      "id": 6,
      "start": 1232.6400108337402,
      "end": 1242.320011138916,
      "text": " I command you this day. So we'd find that blessing is directly tied to obedience,"
    },
    {
      "id": 7,
      "start": 1242.320011138916,
      "end": 1251.6400108337402,
      "text": " correct? A blessing if ye obey the commandments of the Lord your God which"
    },
    {
      "id": 8,
      "start": 1251.6400108337402,
      "end": 1259.760009765625,
      "text": " I command you this day. He says today, listen, behold, I set before you this day"
    },
    {
      "id": 9,
      "start": 1259.760009765625,
      "end": 1267.8400115966797,
      "text": " a blessing and a curse. A blessing, but it's tied directly to obedience. Notice"
    },
    {
      "id": 10,
      "start": 1267.8400115966797,
      "end": 1274.9200134277344,
      "text": " in verse 28, and a curse if ye will not obey the commandments of the Lord your"
    },
    {
      "id": 11,
      "start": 1274.9200134277344,
      "end": 1279.6800079345703,
      "text": " God, but turn aside out of the way which I command you this day to go after other"
    },
    {
      "id": 12,
      "start": 1279.760009765625,
      "end": 1288.3200073242188,
      "text": " gods which you have not known. As you study the history of Israel through the"
    },
    {
      "id": 13,
      "start": 1288.3200073242188,
      "end": 1293.6800079345703,
      "text": " Old Testament, you'll find there are many times in which they obeyed God. They had"
    },
    {
      "id": 14,
      "start": 1293.6800079345703,
      "end": 1300.3200073242188,
      "text": " the favor of God, they had the blessing of God. You find, however, that with much"
    },
    {
      "id": 15,
      "start": 1300.3200073242188,
      "end": 1306.160011291504,
      "text": " frequency you read that the nation of Israel disobeyed the commandments of the"
    },
    {
      "id": 16,
      "start": 1306.160011291504,
      "end": 1312.8400115966797,
      "text": " Lord, correct? Often, as you read the accounts throughout the Word of God of"
    },
    {
      "id": 17,
      "start": 1312.8400115966797,
      "end": 1319.360008239746,
      "text": " the disobedience of the people of God to the commandments of God, it was not the"
    },
    {
      "id": 18,
      "start": 1319.360008239746,
      "end": 1323.0000076293945,
      "text": " fact that the commandments were not known to the people of God, it was not"
    },
    {
      "id": 19,
      "start": 1323.0000076293945,
      "end": 1328.4000091552734,
      "text": " that they were not given the truth, it was that they chose to disobey. It was"
    },
    {
      "id": 20,
      "start": 1328.4000091552734,
      "end": 1333.240005493164,
      "text": " that they rebelled against what God said and we find that there would be cursing,"
    },
    {
      "id": 21,
      "start": 1333.240005493164,
      "end": 1337.760009765625,
      "text": " there would be judgment, there would be opposition and adversity, and we find"
    },
    {
      "id": 22,
      "start": 1337.760009765625,
      "end": 1343.8400115966797,
      "text": " that they would deal with great troubles and trials and various levels of"
    },
    {
      "id": 23,
      "start": 1343.8400115966797,
      "end": 1348.8000030517578,
      "text": " opposition. We find eventually, of course, as you note, the nation of Israel as a"
    },
    {
      "id": 24,
      "start": 1348.8000030517578,
      "end": 1353.3200073242188,
      "text": " whole, and you think about the divided kingdom and, of course, the ten tribes of"
    },
    {
      "id": 25,
      "start": 1353.3200073242188,
      "end": 1359.3600158691406,
      "text": " the north being taken captive by the Assyrians, and years later, Judah, the"
    },
    {
      "id": 26,
      "start": 1359.3600158691406,
      "end": 1363.6000061035156,
      "text": " tribes in the south, being taken captive by the Babylonians. Why? Because of their"
    },
    {
      "id": 27,
      "start": 1363.6000061035156,
      "end": 1371.1600036621094,
      "text": " disobedience. When Jeremiah is prophesying to the nation of Judah on"
    },
    {
      "id": 28,
      "start": 1371.1600036621094,
      "end": 1376.760009765625,
      "text": " the eve of the Babylonian captivity, he's seeking to encourage them to trust the"
    },
    {
      "id": 29,
      "start": 1376.760009765625,
      "end": 1383.5600128173828,
      "text": " Lord and we find that God is revealing to Jeremiah and Jeremiah sees the"
    },
    {
      "id": 30,
      "start": 1383.5600128173828,
      "end": 1388.9600067138672,
      "text": " Babylonians have laid siege against the city and he understands the the days are"
    },
    {
      "id": 31,
      "start": 1388.9600067138672,
      "end": 1393.520004272461,
      "text": " coming in which they'll be taken captive and there are people, the king"
    },
    {
      "id": 32,
      "start": 1393.520004272461,
      "end": 1397.520004272461,
      "text": " and others, that would come and say, is there a word from the Lord? The word's"
    },
    {
      "id": 33,
      "start": 1397.520004272461,
      "end": 1403.4400024414062,
      "text": " not changed, you've disobeyed and judgment is coming. Will God fight for us?"
    },
    {
      "id": 34,
      "start": 1403.4400024414062,
      "end": 1413.0800170898438,
      "text": " And Jeremiah says, actually God will fight against you. Wow, what tragic news"
    },
    {
      "id": 35,
      "start": 1413.0800170898438,
      "end": 1418.5600128173828,
      "text": " received that God Almighty would fight against them, but it was because of their"
    },
    {
      "id": 36,
      "start": 1418.6400146484375,
      "end": 1424.3600158691406,
      "text": " disobedience. And so when we see the life of Abraham and we see the eulogy that is"
    },
    {
      "id": 37,
      "start": 1424.3600158691406,
      "end": 1428.280014038086,
      "text": " provided and we think of the quantity of life, but we also think of the the"
    },
    {
      "id": 38,
      "start": 1428.280014038086,
      "end": 1432.760009765625,
      "text": " quality of life, that he was full of years, that he was both abounding and"
    },
    {
      "id": 39,
      "start": 1432.760009765625,
      "end": 1437.8800048828125,
      "text": " satisfied, the reality that he had walked with God and that he had seen and"
    },
    {
      "id": 40,
      "start": 1437.8800048828125,
      "end": 1442.4400024414062,
      "text": " experienced the blessing of God and that God had blessed him in all things, and we"
    },
    {
      "id": 41,
      "start": 1442.4400024414062,
      "end": 1446.760009765625,
      "text": " understand this evening that the blessing of God is tied to obedience."
    },
    {
      "id": 42,
      "start": 1446.760009765625,
      "end": 1451.4400024414062,
      "text": " It's a biblical truth all throughout the pages of Scripture and how vital it"
    },
    {
      "id": 43,
      "start": 1451.4400024414062,
      "end": 1457.52001953125,
      "text": " is that we make that decision that we would obey the Lord, follow his word, I"
    },
    {
      "id": 44,
      "start": 1457.52001953125,
      "end": 1463.8800048828125,
      "text": " will obey, and what a place to be. We find that it's in James chapter"
    },
    {
      "id": 45,
      "start": 1463.8800048828125,
      "end": 1469.52001953125,
      "text": " number 2 and the the New Testament truth that is given to us here, what a"
    },
    {
      "id": 46,
      "start": 1469.52001953125,
      "end": 1473.2799987792969,
      "text": " powerful verse of Scripture where the Bible says that the Scripture was"
    },
    {
      "id": 47,
      "start": 1473.2799987792969,
      "end": 1478.2400207519531,
      "text": " fulfilled which saith Abraham believed God and it was imputed unto him for"
    },
    {
      "id": 48,
      "start": 1478.2400207519531,
      "end": 1484.8399963378906,
      "text": " righteousness and he was called the friend of God. In James 2 and verse"
    },
    {
      "id": 49,
      "start": 1484.8399963378906,
      "end": 1492.3600158691406,
      "text": " number 23, Abraham was called the friend of God. I'm thankful for the life of"
    },
    {
      "id": 50,
      "start": 1492.3600158691406,
      "end": 1496.7200012207031,
      "text": " Abraham and as we think about the eulogy and we think about and even reflect"
    },
    {
      "id": 51,
      "start": 1496.7200012207031,
      "end": 1501.4800109863281,
      "text": " upon our own lives, you'll recall that in Genesis chapter 23 as we looked at the"
    },
    {
      "id": 52,
      "start": 1501.4800109863281,
      "end": 1505.8000183105469,
      "text": " life of Sarah and the death and the burial of Sarah that we mentioned that"
    },
    {
      "id": 53,
      "start": 1505.8000183105469,
      "end": 1510.4000244140625,
      "text": " we're told by Solomon that it's better that we would go to the house of mourning"
    },
    {
      "id": 54,
      "start": 1510.4000244140625,
      "end": 1515.9200134277344,
      "text": " than to the house of feasting, and we understand that the reason that it's"
    },
    {
      "id": 55,
      "start": 1515.9200134277344,
      "end": 1520.9600219726562,
      "text": " better, that it's more advantageous for us to go to the house of mourning"
    },
    {
      "id": 56,
      "start": 1520.9600219726562,
      "end": 1526.4000244140625,
      "text": " than to the house of feasting is because that is the end of all men. Man goes to"
    },
    {
      "id": 57,
      "start": 1526.4000244140625,
      "end": 1531.6000061035156,
      "text": " his long home. And as we think about the life of Abraham and we look at just a"
    },
    {
      "id": 58,
      "start": 1531.6000061035156,
      "end": 1536.8399963378906,
      "text": " couple of verses of Scripture but really consider in very brief overview fashion"
    },
    {
      "id": 59,
      "start": 1536.8399963378906,
      "end": 1541.8399963378906,
      "text": " the the hundred years that are summarized in these chapters in the"
    },
    {
      "id": 60,
      "start": 1541.8399963378906,
      "end": 1546.5599975585938,
      "text": " book of Genesis where God allows us to have insight to the life and experiences"
    },
    {
      "id": 61,
      "start": 1546.5599975585938,
      "end": 1553.4400024414062,
      "text": " of Abraham, I wonder this evening how it is that at the time of our death what"
    },
    {
      "id": 62,
      "start": 1553.4400024414062,
      "end": 1561.760009765625,
      "text": " will the eulogy sound like? What is it that that someone would say of us when"
    },
    {
      "id": 63,
      "start": 1561.760009765625,
      "end": 1566.7200012207031,
      "text": " they look at our life? Would they look at our life as being a testimony of a life"
    },
    {
      "id": 64,
      "start": 1566.7200012207031,
      "end": 1574.52001953125,
      "text": " that that was lived for the Lord? A life, a testimony of a believer that trusted"
    },
    {
      "id": 65,
      "start": 1574.52001953125,
      "end": 1578.6400146484375,
      "text": " the Lord, that followed the Lord, that had faith? Oh not anyone that's perfect for"
    },
    {
      "id": 66,
      "start": 1578.6400146484375,
      "end": 1583.4000244140625,
      "text": " we know that none of us are perfect. But we've come to the place where we've"
    },
    {
      "id": 67,
      "start": 1583.4000244140625,
      "end": 1588.2799987792969,
      "text": " yielded and we've surrendered and we have sought to walk with God and we've"
    },
    {
      "id": 68,
      "start": 1588.2799987792969,
      "end": 1595.0400085449219,
      "text": " desired and longed for that blessing of God upon our lives. We find that Abraham"
    },
    {
      "id": 69,
      "start": 1595.0400085449219,
      "end": 1602.2400207519531,
      "text": " had a wonderful testimony. We find not only as you would think about a death"
    },
    {
      "id": 70,
      "start": 1602.2400207519531,
      "end": 1607.1600036621094,
      "text": " and a funeral, you think of the eulogy but you also think of the burial and we"
    },
    {
      "id": 71,
      "start": 1607.1600036621094,
      "end": 1613.52001953125,
      "text": " find it in verses 9 and 10 God gives us the record of the burial of Abraham. The"
    },
    {
      "id": 72,
      "start": 1613.52001953125,
      "end": 1618.1600036621094,
      "text": " Bible says that his sons Isaac and Ishmael buried him and so we find that in"
    },
    {
      "id": 73,
      "start": 1618.1600036621094,
      "end": 1622.4000244140625,
      "text": " the beginning of verse number 9 that the people that are involved are revealed to"
    },
    {
      "id": 74,
      "start": 1622.4000244140625,
      "end": 1626.7200012207031,
      "text": " us and we find here that the Bible tells us that Isaac and Ishmael buried him in"
    },
    {
      "id": 75,
      "start": 1626.7200012207031,
      "end": 1630.7200012207031,
      "text": " the cave of Machpelah. Now it's interesting that Isaac and Ishmael are"
    },
    {
      "id": 76,
      "start": 1630.7200012207031,
      "end": 1635.6400146484375,
      "text": " now referenced in this portion of scripture. We find that of course at this"
    },
    {
      "id": 77,
      "start": 1635.6400146484375,
      "end": 1639.9200134277344,
      "text": " particular time when you do all of the calculations in determining the death of"
    },
    {
      "id": 78,
      "start": 1639.9200134277344,
      "end": 1644.9200134277344,
      "text": " Abraham and his age being a hundred and seventy-five years old that Isaac at"
    },
    {
      "id": 79,
      "start": 1644.9200134277344,
      "end": 1651.7200012207031,
      "text": " this time is 75 and Ishmael is 89. Now if you go back to the 21st chapter of the"
    },
    {
      "id": 80,
      "start": 1651.7200012207031,
      "end": 1657.0400085449219,
      "text": " book of Genesis that's where we read of the birth of Isaac and you'll remember"
    },
    {
      "id": 81,
      "start": 1657.0400085449219,
      "end": 1662.1600036621094,
      "text": " that as we went through the portion of scripture that we come down and you find"
    },
    {
      "id": 82,
      "start": 1662.1600036621094,
      "end": 1667.4000244140625,
      "text": " that in verse number 8 of Genesis 21 the Bible says the child grew speaking"
    },
    {
      "id": 83,
      "start": 1667.4000244140625,
      "end": 1671.9200134277344,
      "text": " of Isaac and was weaned and Abraham made a great feast the same day that Isaac"
    },
    {
      "id": 84,
      "start": 1671.9200134277344,
      "end": 1676.9600219726562,
      "text": " was weaned and Sarah saw the son of Hagar that's Ishmael the Egyptian which"
    },
    {
      "id": 85,
      "start": 1676.9600219726562,
      "end": 1682.1199951171875,
      "text": " she had born unto Abraham mocking and it was at that time in which Sarah said"
    },
    {
      "id": 86,
      "start": 1682.1199951171875,
      "end": 1687.3600158691406,
      "text": " cast out this bondwoman and her son. In verse number 10 we see that and we find"
    },
    {
      "id": 87,
      "start": 1687.3600158691406,
      "end": 1691.8399963378906,
      "text": " that Sarah said for the son of this bondwoman shall not be heir with my son"
    },
    {
      "id": 88,
      "start": 1691.8399963378906,
      "end": 1695.6800231933594,
      "text": " even with Isaac. We referenced this a few moments ago but looking at it in"
    },
    {
      "id": 89,
      "start": 1695.6800231933594,
      "end": 1701.0800170898438,
      "text": " more detail here we find that God also says to Abraham because it was something"
    },
    {
      "id": 90,
      "start": 1701.0800170898438,
      "end": 1705.4800109863281,
      "text": " that was grievous in the sight of Abraham and verse number 11 tells us"
    },
    {
      "id": 91,
      "start": 1705.4800109863281,
      "end": 1711.2000122070312,
      "text": " that that God says to Abraham let it not be grievous in thy sight because of the"
    },
    {
      "id": 92,
      "start": 1711.2000122070312,
      "end": 1715.3200073242188,
      "text": " lad and because of thy bondwoman and all that Sarah hath said unto thee hearken"
    },
    {
      "id": 93,
      "start": 1715.3200073242188,
      "end": 1722.0,
      "text": " unto her voice for in Isaac shall thy seed be called. We find that Abraham"
    },
    {
      "id": 94,
      "start": 1722.0,
      "end": 1725.1600341796875,
      "text": " according to verse number 14 rose up early in the morning and took bread and"
    },
    {
      "id": 95,
      "start": 1725.1600341796875,
      "end": 1728.6799926757812,
      "text": " a bowl of water and gave it unto Hagar putting it on her shoulder and the child"
    },
    {
      "id": 96,
      "start": 1728.6799926757812,
      "end": 1732.7999877929688,
      "text": " and sent her away and she departed and wandered in the wilderness of Beersheba."
    },
    {
      "id": 97,
      "start": 1732.7999877929688,
      "end": 1735.97998046875,
      "text": " And so we studied this and we looked at this portion of scripture and as we"
    },
    {
      "id": 98,
      "start": 1735.97998046875,
      "end": 1741.52001953125,
      "text": " understand the the truth that God has given us and now we find in this portion"
    },
    {
      "id": 99,
      "start": 1741.52001953125,
      "end": 1745.6000366210938,
      "text": " of scripture in which we're looking at tonight at the death and the burial of"
    },
    {
      "id": 100,
      "start": 1745.6000366210938,
      "end": 1752.6400146484375,
      "text": " Abraham that now Isaac is 75 and Ishmael is 89 but when we look at Genesis"
    },
    {
      "id": 101,
      "start": 1752.6400146484375,
      "end": 1757.47998046875,
      "text": " chapter number 21 and we look at all that's going on we talked about the age"
    },
    {
      "id": 102,
      "start": 1757.47998046875,
      "end": 1763.0800170898438,
      "text": " of Ishmael at that particular time and we said that Ishmael would be between"
    },
    {
      "id": 103,
      "start": 1763.0800170898438,
      "end": 1770.0800170898438,
      "text": " 16 and 17 years old and so from that time Isaac just a few years old"
    },
    {
      "id": 104,
      "start": 1770.0800170898438,
      "end": 1778.7200317382812,
      "text": " according to historical tradition and so now over 70 years has passed because"
    },
    {
      "id": 105,
      "start": 1778.7200317382812,
      "end": 1783.6000366210938,
      "text": " what happened with Ishmael well as we mentioned by way of introduction Ishmael"
    },
    {
      "id": 106,
      "start": 1783.6000366210938,
      "end": 1788.3599853515625,
      "text": " and Hagar they were sent and they went to the wilderness of Paran and we find"
    },
    {
      "id": 107,
      "start": 1788.3599853515625,
      "end": 1795.47998046875,
      "text": " now that at the burial of Abraham that Isaac and Ishmael are there together. Now"
    },
    {
      "id": 108,
      "start": 1795.47998046875,
      "end": 1801.6000366210938,
      "text": " it's of note because we find that of course many of us do not"
    },
    {
      "id": 0,
      "start": 1801.6000366210938,
      "end": 1806.3600368499756,
      "text": " many things from our toddler years from the age of two or three. It's not common"
    },
    {
      "id": 1,
      "start": 1806.3600368499756,
      "end": 1812.3200368881226,
      "text": " for us to have memories of those particular events. Oftentimes I find in"
    },
    {
      "id": 2,
      "start": 1812.3200368881226,
      "end": 1816.4800367355347,
      "text": " my own life at least that when we talk about things that we remember from those"
    },
    {
      "id": 3,
      "start": 1816.4800367355347,
      "end": 1820.3200359344482,
      "text": " ages it's typically from hearing stories and what have you and you begin to"
    },
    {
      "id": 4,
      "start": 1820.3200359344482,
      "end": 1825.2800369262695,
      "text": " rehearse some of those things. But some of us have had conversations what's the"
    },
    {
      "id": 5,
      "start": 1825.2800369262695,
      "end": 1829.3200359344482,
      "text": " earliest memory that you have as a child and so on and so forth and we try to"
    },
    {
      "id": 6,
      "start": 1829.3200359344482,
      "end": 1832.7200374603271,
      "text": " figure out how old we were and so on and so forth and some of you say I don't"
    },
    {
      "id": 7,
      "start": 1832.7200374603271,
      "end": 1837.2000350952148,
      "text": " remember yesterday so I'm not sure what my earliest memory was I understand but"
    },
    {
      "id": 8,
      "start": 1837.2000350952148,
      "end": 1841.3200378417969,
      "text": " but what I'm saying to you this evening is that a lengthy period of time has"
    },
    {
      "id": 9,
      "start": 1841.3200378417969,
      "end": 1847.640037536621,
      "text": " passed at least 70 years 70 72 years has passed from the time in which Ishmael is"
    },
    {
      "id": 10,
      "start": 1847.640037536621,
      "end": 1854.3800354003906,
      "text": " cast out and now the death of Abraham and I make that statement because as we"
    },
    {
      "id": 11,
      "start": 1854.3800354003906,
      "end": 1858.5600357055664,
      "text": " look at the portion of Scripture here the Bible tells us in verse number nine"
    },
    {
      "id": 12,
      "start": 1858.5600357055664,
      "end": 1864.0000381469727,
      "text": " and his sons Isaac and Ishmael buried him there does not seem as we look at"
    },
    {
      "id": 13,
      "start": 1864.0000381469727,
      "end": 1868.800033569336,
      "text": " the text of Scripture there's no animosity whatsoever that is hinted at"
    },
    {
      "id": 14,
      "start": 1868.800033569336,
      "end": 1875.0000381469727,
      "text": " in the text of Scripture none in fact as we would study the scriptures I find"
    },
    {
      "id": 15,
      "start": 1875.0000381469727,
      "end": 1879.5600357055664,
      "text": " oftentimes that we will and I've been guilty of this myself of making"
    },
    {
      "id": 16,
      "start": 1879.5600357055664,
      "end": 1884.520034790039,
      "text": " statements about the hostilities between the descendants of Isaac and the"
    },
    {
      "id": 17,
      "start": 1884.520034790039,
      "end": 1888.6000366210938,
      "text": " descendants of Ishmael but if you study the scriptures you actually find and I"
    },
    {
      "id": 18,
      "start": 1888.6000366210938,
      "end": 1892.1200332641602,
      "text": " think even when you study history will prove this to be the case and we'll"
    },
    {
      "id": 19,
      "start": 1892.1200332641602,
      "end": 1897.2000350952148,
      "text": " study this as we continue through the book of Genesis you will find that"
    },
    {
      "id": 20,
      "start": 1897.2000350952148,
      "end": 1901.0400390625,
      "text": " there's a whole lot more animosity between the descendants of Jacob and the"
    },
    {
      "id": 21,
      "start": 1901.0400390625,
      "end": 1907.2800369262695,
      "text": " descendants of Edom you read of that regularly you read even of the animosity"
    },
    {
      "id": 22,
      "start": 1907.2800369262695,
      "end": 1911.1200332641602,
      "text": " that we spoke about in the beginning of Genesis 25 with the descendants of"
    },
    {
      "id": 23,
      "start": 1911.1200332641602,
      "end": 1915.8400344848633,
      "text": " Ketorah and thinking of Midian and the Midianites and so we see that here in"
    },
    {
      "id": 24,
      "start": 1915.8400344848633,
      "end": 1919.6800384521484,
      "text": " this portion of Scripture it seems as if it's not even hinted at that there's any"
    },
    {
      "id": 25,
      "start": 1919.6800384521484,
      "end": 1925.3600387573242,
      "text": " animosity whatsoever between Isaac and Ishmael they're there together burying"
    },
    {
      "id": 26,
      "start": 1925.3600387573242,
      "end": 1929.520034790039,
      "text": " Abraham so we see the people that are involved we see the place it's the cave"
    },
    {
      "id": 27,
      "start": 1929.520034790039,
      "end": 1934.0000305175781,
      "text": " of Machpelah we find that it says in the field of Ephraim the son of Zohar the"
    },
    {
      "id": 28,
      "start": 1934.0000305175781,
      "end": 1937.9200439453125,
      "text": " Hittite which is before Mamre and then the Bible tells us in verse number 10"
    },
    {
      "id": 29,
      "start": 1937.9200439453125,
      "end": 1943.1600341796875,
      "text": " referencing back to what we studied in Genesis 23 the field which Abraham"
    },
    {
      "id": 30,
      "start": 1943.1600341796875,
      "end": 1950.280029296875,
      "text": " purchased of the sons of Heth there was Abraham buried and Sarah his wife and so"
    },
    {
      "id": 31,
      "start": 1950.280029296875,
      "end": 1954.0000305175781,
      "text": " we find that as we look at this portion of Scripture we've seen now the"
    },
    {
      "id": 32,
      "start": 1954.0000305175781,
      "end": 1958.8400421142578,
      "text": " descendants we've seen the death the eulogy the burial of Abraham and we find"
    },
    {
      "id": 33,
      "start": 1958.8400421142578,
      "end": 1964.6000366210938,
      "text": " that a great patriarch has now passed off the scene this life we understand"
    },
    {
      "id": 34,
      "start": 1964.6000366210938,
      "end": 1969.1200408935547,
      "text": " the Bible teaches us that the wages of sin is death we understand that that"
    },
    {
      "id": 35,
      "start": 1969.1200408935547,
      "end": 1974.4800415039062,
      "text": " contains the the truth of the second death but also that by sin comes death"
    },
    {
      "id": 36,
      "start": 1974.4800415039062,
      "end": 1979.560043334961,
      "text": " we understand physical death in the Bible tells us in Hebrews 9 as and it's"
    },
    {
      "id": 37,
      "start": 1979.560043334961,
      "end": 1985.1600341796875,
      "text": " appointed unto man wants to die after this the judgment and we understand this"
    },
    {
      "id": 38,
      "start": 1985.1600341796875,
      "end": 1990.7200317382812,
      "text": " evening that we're not gonna live forever amen I'm gonna live forever I've"
    },
    {
      "id": 39,
      "start": 1990.7200317382812,
      "end": 1994.0400390625,
      "text": " often said to people over the years are you prepared to die if you were to die"
    },
    {
      "id": 40,
      "start": 1994.0400390625,
      "end": 1999.4400329589844,
      "text": " today we say that to people we sang songs this evening evangelistic songs"
    },
    {
      "id": 41,
      "start": 1999.4400329589844,
      "end": 2004.0800323486328,
      "text": " about the gospel and about whosoever will and Christ receive its sinful men"
    },
    {
      "id": 42,
      "start": 2004.0800323486328,
      "end": 2007.9200439453125,
      "text": " and what great songs they are and the reality is that we understand"
    },
    {
      "id": 43,
      "start": 2007.9200439453125,
      "end": 2015.3600311279297,
      "text": " biblically that there's a time to be born and there is a time to die we have"
    },
    {
      "id": 44,
      "start": 2015.3600311279297,
      "end": 2019.8400421142578,
      "text": " an appointment and as I think about that I've often said to people over the years"
    },
    {
      "id": 45,
      "start": 2019.8400421142578,
      "end": 2025.1600341796875,
      "text": " are you prepared for that appointment are you prepared for it and we"
    },
    {
      "id": 46,
      "start": 2025.1600341796875,
      "end": 2029.7200317382812,
      "text": " understand this evening the importance of trusting Christ as our Savior to"
    },
    {
      "id": 47,
      "start": 2029.7200317382812,
      "end": 2034.4800415039062,
      "text": " understand that my sins have been forgiven that I've been born again that"
    },
    {
      "id": 48,
      "start": 2034.4800415039062,
      "end": 2038.8800354003906,
      "text": " heaven is my home that I have that assurance that confidence and as we look"
    },
    {
      "id": 49,
      "start": 2038.8800354003906,
      "end": 2042.800033569336,
      "text": " at the life of Abraham here and we read of his death and his burial we're once"
    },
    {
      "id": 50,
      "start": 2042.800033569336,
      "end": 2049.4800415039062,
      "text": " again confronted with the brevity of life you say the brevity of life is 175"
    },
    {
      "id": 51,
      "start": 2049.4800415039062,
      "end": 2058.0400390625,
      "text": " years old in comparison to eternity it's a very short the life span of"
    },
    {
      "id": 52,
      "start": 2058.0400390625,
      "end": 2062.2000427246094,
      "text": " mankind today is even shorter and when we look at it in comparison with"
    },
    {
      "id": 53,
      "start": 2062.2000427246094,
      "end": 2068.8400268554688,
      "text": " eternity it's just that long and so often we spend so much time with that"
    },
    {
      "id": 54,
      "start": 2068.8400268554688,
      "end": 2073.2400512695312,
      "text": " long and forget about the eternity part of it I've said over the years that"
    },
    {
      "id": 55,
      "start": 2073.2400512695312,
      "end": 2077.760040283203,
      "text": " there are many times in which especially being guilty of this and in our country"
    },
    {
      "id": 56,
      "start": 2077.760040283203,
      "end": 2082.520050048828,
      "text": " in our culture and I understand it's where we are it's what we're confronted"
    },
    {
      "id": 57,
      "start": 2082.520050048828,
      "end": 2088.560028076172,
      "text": " with but so often there is so much attention and so much emphasis that is"
    },
    {
      "id": 58,
      "start": 2088.560028076172,
      "end": 2098.000030517578,
      "text": " placed upon retirement planning but very little on eternity planning I would say"
    },
    {
      "id": 59,
      "start": 2098.000030517578,
      "end": 2101.4400329589844,
      "text": " to you this evening I've said this before but I'd say it again this evening"
    },
    {
      "id": 60,
      "start": 2101.4400329589844,
      "end": 2109.8400268554688,
      "text": " that retirement is not certain eternity is certain and there's so much emphasis"
    },
    {
      "id": 61,
      "start": 2109.8400268554688,
      "end": 2113.9200439453125,
      "text": " placed upon retirement planning estate planning all of these things I'm not"
    },
    {
      "id": 62,
      "start": 2113.9200439453125,
      "end": 2119.6400451660156,
      "text": " suggesting that you shouldn't plan but I'm just suggesting that the emphasis"
    },
    {
      "id": 63,
      "start": 2119.6400451660156,
      "end": 2124.6400451660156,
      "text": " placed upon it might need to be re-evaluated because there's so much"
    },
    {
      "id": 64,
      "start": 2124.6400451660156,
      "end": 2129.6000366210938,
      "text": " emphasis on the retirement planning part and again very little on the eternity"
    },
    {
      "id": 65,
      "start": 2129.6000366210938,
      "end": 2135.000030517578,
      "text": " planning part and I'm thankful that God tells us that we can store up treasure"
    },
    {
      "id": 66,
      "start": 2135.000030517578,
      "end": 2142.800048828125,
      "text": " in heaven amen what a blessing to think about the the dividends of of that type"
    },
    {
      "id": 67,
      "start": 2142.800048828125,
      "end": 2148.4000244140625,
      "text": " of planning and to understand that as we walk with God as we faithfully serve God"
    },
    {
      "id": 68,
      "start": 2148.4000244140625,
      "end": 2153.6800231933594,
      "text": " that we can hear well done thou good and faithful servant that we can receive"
    },
    {
      "id": 69,
      "start": 2153.6800231933594,
      "end": 2158.4800415039062,
      "text": " even as we looked at a few weeks ago from Colossians 4 and understanding the"
    },
    {
      "id": 70,
      "start": 2158.4800415039062,
      "end": 2163.2000427246094,
      "text": " reward of the fellow worker and understanding that God has given us in"
    },
    {
      "id": 71,
      "start": 2163.2000427246094,
      "end": 2168.7200317382812,
      "text": " his word record of crowns that can be received and Paul was confident of"
    },
    {
      "id": 72,
      "start": 2168.7200317382812,
      "end": 2174.7200317382812,
      "text": " receiving a crown he mentions it in 2nd Timothy 4 and verse number 8 that crown"
    },
    {
      "id": 73,
      "start": 2174.7200317382812,
      "end": 2178.320037841797,
      "text": " of righteousness and we think about those crowns they're not for us to keep"
    },
    {
      "id": 74,
      "start": 2178.320037841797,
      "end": 2184.320037841797,
      "text": " but for us to cast at the at the very throne of our God and what a blessing"
    },
    {
      "id": 75,
      "start": 2184.320037841797,
      "end": 2190.000030517578,
      "text": " and to have that perspective see eternity is certain Abraham wasn't"
    },
    {
      "id": 76,
      "start": 2190.000030517578,
      "end": 2195.760040283203,
      "text": " gonna live forever he lived 175 years old it's a long time but really just"
    },
    {
      "id": 77,
      "start": 2195.760040283203,
      "end": 2200.9600219726562,
      "text": " that long in light of eternity and for us this evening when we read a passage"
    },
    {
      "id": 78,
      "start": 2200.9600219726562,
      "end": 2204.8400268554688,
      "text": " of scripture like this I hope that we would be confronted and we would be"
    },
    {
      "id": 79,
      "start": 2204.8400268554688,
      "end": 2211.800048828125,
      "text": " aware of our own mortality in our own life and the brevity of our life and"
    },
    {
      "id": 80,
      "start": 2211.800048828125,
      "end": 2215.6800231933594,
      "text": " that we would reevaluate we'd look and say what is it that's going to be said"
    },
    {
      "id": 81,
      "start": 2215.6800231933594,
      "end": 2221.4400329589844,
      "text": " at the end of my life how is it that that by life will be remembered who is"
    },
    {
      "id": 82,
      "start": 2221.4400329589844,
      "end": 2229.000030517578,
      "text": " it that that I'm impacting what is the testimony of my life how is it that it"
    },
    {
      "id": 83,
      "start": 2229.000030517578,
      "end": 2233.6000366210938,
      "text": " would it be said that I lived a life of faith that I lived in fear what will be"
    },
    {
      "id": 84,
      "start": 2233.6000366210938,
      "end": 2242.9200439453125,
      "text": " said it's very unusual for an individual to pen their own eulogy"
    },
    {
      "id": 85,
      "start": 2242.9200439453125,
      "end": 2251.320037841797,
      "text": " happens just a little unusual this evening we think about not only what"
    },
    {
      "id": 86,
      "start": 2251.320037841797,
      "end": 2256.1600341796875,
      "text": " others would say of us but as I've mentioned before what God would say what"
    },
    {
      "id": 87,
      "start": 2256.1600341796875,
      "end": 2260.4400329589844,
      "text": " God would say and tonight I hope that we'd be challenged as the thought of"
    },
    {
      "id": 88,
      "start": 2260.4400329589844,
      "end": 2265.4800415039062,
      "text": " even looking at this testimony of Abraham we finish in verse number 11"
    },
    {
      "id": 89,
      "start": 2265.4800415039062,
      "end": 2270.9200439453125,
      "text": " this evening and it kind of almost seems as if it's a little bit of an addendum"
    },
    {
      "id": 90,
      "start": 2270.9200439453125,
      "end": 2275.6000366210938,
      "text": " but it's a quite an interesting phrase that is used here if you are taking"
    },
    {
      "id": 91,
      "start": 2275.6000366210938,
      "end": 2280.6800231933594,
      "text": " notes I would give a third point this evening as being the distinct air the"
    },
    {
      "id": 92,
      "start": 2280.6800231933594,
      "end": 2286.1200256347656,
      "text": " Bible says this and it came to pass after the death of Abraham and so we've"
    },
    {
      "id": 93,
      "start": 2286.1200256347656,
      "end": 2290.4000244140625,
      "text": " read of the descendants we've read of the death we've understood the eulogy"
    },
    {
      "id": 94,
      "start": 2290.4000244140625,
      "end": 2294.1600341796875,
      "text": " the burial we see the the people involved with the burial the place of"
    },
    {
      "id": 95,
      "start": 2294.1600341796875,
      "end": 2299.6800231933594,
      "text": " the burial and we find that God says it came to pass after the death of Abraham"
    },
    {
      "id": 96,
      "start": 2299.6800231933594,
      "end": 2308.080047607422,
      "text": " notice this it says that God blessed his son Isaac and Isaac dwelt by the well"
    },
    {
      "id": 97,
      "start": 2308.080047607422,
      "end": 2314.760009765625,
      "text": " le hey I row I and as we look at the that that phrase right in the middle of"
    },
    {
      "id": 98,
      "start": 2314.760009765625,
      "end": 2321.4400634765625,
      "text": " the verse it says that God blessed his son Isaac we speak about the distinct"
    },
    {
      "id": 99,
      "start": 2321.4400634765625,
      "end": 2326.56005859375,
      "text": " air we find that here in verse number five we've read a few moments ago where"
    },
    {
      "id": 100,
      "start": 2326.56005859375,
      "end": 2331.52001953125,
      "text": " the Bible says that Abraham gave all that he had unto Isaac we've read back"
    },
    {
      "id": 101,
      "start": 2331.52001953125,
      "end": 2338.4400634765625,
      "text": " in chapter number 21 where God says to Abraham to cast out the Ishmael and"
    },
    {
      "id": 102,
      "start": 2338.4400634765625,
      "end": 2345.280029296875,
      "text": " Hagar why for an Isaac shall thy seed be called we find that in the middle of"
    },
    {
      "id": 103,
      "start": 2345.280029296875,
      "end": 2349.4000244140625,
      "text": " Genesis chapter 25 the text in which we'll study next week that the Bible"
    },
    {
      "id": 104,
      "start": 2349.4000244140625,
      "end": 2355.2000122070312,
      "text": " gives us in verses 12 through 18 the the descendants of Ishmael and discusses for"
    },
    {
      "id": 105,
      "start": 2355.2000122070312,
      "end": 2360.7200317382812,
      "text": " us the death of Ishmael but really as we look at verse number 11 of Genesis 25"
    },
    {
      "id": 106,
      "start": 2360.7200317382812,
      "end": 2366.260009765625,
      "text": " apart from those next several verses of Scripture what we find happens is the"
    },
    {
      "id": 107,
      "start": 2366.260009765625,
      "end": 2371.8600463867188,
      "text": " focus of Scripture now shifts from the life of Abraham to the life of Isaac and"
    },
    {
      "id": 108,
      "start": 2371.8600463867188,
      "end": 2377.1000366210938,
      "text": " we find that this happened remember as we studied back in Genesis chapter 11"
    },
    {
      "id": 109,
      "start": 2377.1000366210938,
      "end": 2381.1400146484375,
      "text": " for just a moment turn back there if you will and I want you to just notice what"
    },
    {
      "id": 110,
      "start": 2381.1400146484375,
      "end": 2385.5000610351562,
      "text": " God is giving us in chapters really chapters 10 and 11 of the book of"
    },
    {
      "id": 111,
      "start": 2385.5000610351562,
      "end": 2390.1800537109375,
      "text": " Genesis you begin to read of these genealogies and all of the the sons of"
    },
    {
      "id": 112,
      "start": 2390.1800537109375,
      "end": 2395.260009765625,
      "text": " Japheth and the sons of Ham and the sons of Shem and you read of all of these"
    },
    {
      "id": 113,
      "start": 2395.260009765625,
      "end": 2400.5000610351562,
      "text": " descendants and then we find at the end of chapter number 11 that the Bible"
    },
    {
      "id": 114,
      "start": 2400.5000610351562,
      "end": 2403.7400512695312,
      "text": " gives us all the descendants"
    },
    {
      "id": 0,
      "start": 2403.7400512695312,
      "end": 2407.9800510406494,
      "text": " of Shem, and it begins to provide us with all of these names and all of these"
    },
    {
      "id": 1,
      "start": 2407.9800510406494,
      "end": 2412.7400512695312,
      "text": " years and all that's taken place, and we find that we come to this place where"
    },
    {
      "id": 2,
      "start": 2412.7400512695312,
      "end": 2418.1800508499146,
      "text": " the Bible tells us in verse number 26 of Genesis 11, and Terah lived 70 years and"
    },
    {
      "id": 3,
      "start": 2418.1800508499146,
      "end": 2424.9400520324707,
      "text": " begat Abram, Nahor, and Haran, and we find that it's at that point that the Bible"
    },
    {
      "id": 4,
      "start": 2424.9400520324707,
      "end": 2432.620050430298,
      "text": " begins to focus its attention on Abram, on Abraham. We find even as we"
    },
    {
      "id": 5,
      "start": 2432.620050430298,
      "end": 2438.3000526428223,
      "text": " studied and looked throughout the text of Scripture, beginning in those messages"
    },
    {
      "id": 6,
      "start": 2438.3000526428223,
      "end": 2442.980052947998,
      "text": " at that particular place in the book of Genesis, how that the Hebrew race and the"
    },
    {
      "id": 7,
      "start": 2442.980052947998,
      "end": 2449.3000526428223,
      "text": " promise that God had given with regard to the Lord Jesus Christ and the line,"
    },
    {
      "id": 8,
      "start": 2449.3000526428223,
      "end": 2454.540050506592,
      "text": " the messianic line, and all of the prophecies of Scripture, and we find how"
    },
    {
      "id": 9,
      "start": 2454.540050506592,
      "end": 2459.260051727295,
      "text": " that the broadness of the scope of Genesis 10 and Genesis 11 of"
    },
    {
      "id": 10,
      "start": 2459.260051727295,
      "end": 2463.2200508117676,
      "text": " understanding the genealogies and all of these descendants and so on, and it"
    },
    {
      "id": 11,
      "start": 2463.2200508117676,
      "end": 2469.100051879883,
      "text": " just zeroes in on Abraham, and we read all of these chapters and all of these"
    },
    {
      "id": 12,
      "start": 2469.100051879883,
      "end": 2474.8600540161133,
      "text": " events of a hundred years of the life of Abraham. Remember it was that God said"
    },
    {
      "id": 13,
      "start": 2474.8600540161133,
      "end": 2479.100051879883,
      "text": " this as we read Galatians, and just hold your place, yeah, just turn over to"
    },
    {
      "id": 14,
      "start": 2479.100051879883,
      "end": 2481.6600494384766,
      "text": " Galatians, you don't need to hold your place in Genesis anymore, but go over to"
    },
    {
      "id": 15,
      "start": 2481.6600494384766,
      "end": 2485.420051574707,
      "text": " Galatians, if you will, and I want you to know what God tells us here in the book"
    },
    {
      "id": 16,
      "start": 2485.420051574707,
      "end": 2492.5000534057617,
      "text": " of Galatians in chapter number 3, and we find again how the the attention of"
    },
    {
      "id": 17,
      "start": 2492.5000534057617,
      "end": 2498.8600540161133,
      "text": " Scripture, the focus of Scripture from Abraham now shifting to Isaac, and we see"
    },
    {
      "id": 18,
      "start": 2498.8600540161133,
      "end": 2502.620048522949,
      "text": " this in Galatians 3 and verse number 16. Notice what the Bible says,"
    },
    {
      "id": 19,
      "start": 2502.620048522949,
      "end": 2509.4600524902344,
      "text": " \"...now to Abraham and his seed were the promises made.\" Notice what it says, \"...he"
    },
    {
      "id": 20,
      "start": 2509.620048522949,
      "end": 2520.300048828125,
      "text": " saith not unto seeds, plural, as of many, but as of one, and to thy seed, which is"
    },
    {
      "id": 21,
      "start": 2520.300048828125,
      "end": 2528.020050048828,
      "text": " Christ.\" We've mentioned in the past the phraseology of the title of a book that"
    },
    {
      "id": 22,
      "start": 2528.020050048828,
      "end": 2533.2200469970703,
      "text": " was written by William Scroggie, the unfolding drama of redemption, and we"
    },
    {
      "id": 23,
      "start": 2533.2200469970703,
      "end": 2537.580047607422,
      "text": " find how God, no doubt He could have given us all of the history of any of"
    },
    {
      "id": 24,
      "start": 2537.6200561523438,
      "end": 2543.06005859375,
      "text": " the other descendants that He chose to give us because He knows everything, but"
    },
    {
      "id": 25,
      "start": 2543.06005859375,
      "end": 2550.020050048828,
      "text": " in His plan, in His plan of redemption, the Messianic line, the birth of"
    },
    {
      "id": 26,
      "start": 2550.020050048828,
      "end": 2554.9000549316406,
      "text": " Christ, we find that the shift of Scripture, the focus now shifts from that"
    },
    {
      "id": 27,
      "start": 2554.9000549316406,
      "end": 2559.9400482177734,
      "text": " of Abraham to Isaac specifically. Just a few verses given to us with regard to"
    },
    {
      "id": 28,
      "start": 2559.9400482177734,
      "end": 2564.540054321289,
      "text": " the descendants of Ishmael and the death of Ishmael, and then you begin to read"
    },
    {
      "id": 29,
      "start": 2564.540054321289,
      "end": 2568.100051879883,
      "text": " about Isaac, you begin to read about his life, and then you begin to read about"
    },
    {
      "id": 30,
      "start": 2568.100051879883,
      "end": 2572.580047607422,
      "text": " his sons, and you begin to read about Israel as a nation and the twelve tribes,"
    },
    {
      "id": 31,
      "start": 2572.580047607422,
      "end": 2578.580047607422,
      "text": " the twelve sons, and you see the focus. And Matthew 1 says this, and we'll close"
    },
    {
      "id": 32,
      "start": 2578.580047607422,
      "end": 2583.9000549316406,
      "text": " with this text of Scripture as we think about the truth that God has"
    },
    {
      "id": 33,
      "start": 2583.9000549316406,
      "end": 2589.820053100586,
      "text": " given us with regard to the shift of Scripture and understanding that Isaac"
    },
    {
      "id": 34,
      "start": 2589.820053100586,
      "end": 2594.6600494384766,
      "text": " is the distinct heir. We find that the Bible tells us this in Matthew 1."
    },
    {
      "id": 35,
      "start": 2594.6600494384766,
      "end": 2599.6200561523438,
      "text": " Matthew 1, beginning in verse number 1, the book of the generation of Jesus"
    },
    {
      "id": 36,
      "start": 2599.6200561523438,
      "end": 2610.9800567626953,
      "text": " Christ, the son of David, the son of Abraham. Abraham begat Isaac. Is that what it"
    },
    {
      "id": 37,
      "start": 2610.9800567626953,
      "end": 2616.1800537109375,
      "text": " says in verse number 2? And Isaac begat Jacob, and Jacob begat Judas and his"
    },
    {
      "id": 38,
      "start": 2616.2200469970703,
      "end": 2620.800048828125,
      "text": " brethren. We're not gonna go down through all of the text of Scripture here, but we"
    },
    {
      "id": 39,
      "start": 2620.800048828125,
      "end": 2628.9000549316406,
      "text": " find that focus of Scripture. Why? Because it's showing us that messianic line in"
    },
    {
      "id": 40,
      "start": 2628.9000549316406,
      "end": 2633.9800567626953,
      "text": " which Jesus Christ would come to this earth, God in flesh. We find that it's in"
    },
    {
      "id": 41,
      "start": 2633.9800567626953,
      "end": 2638.1800537109375,
      "text": " verse number 16, it says, \"...and Jacob begat Joseph, the husband of Mary, of whom was"
    },
    {
      "id": 42,
      "start": 2638.1800537109375,
      "end": 2643.1800537109375,
      "text": " born Jesus, who is called Christ.\" So all the generations from Abraham to David"
    },
    {
      "id": 43,
      "start": 2643.1800537109375,
      "end": 2647.06005859375,
      "text": " are 14 generations, and from David until the carrying away into Babylon are 14"
    },
    {
      "id": 44,
      "start": 2647.06005859375,
      "end": 2651.9800567626953,
      "text": " generations, and from the carrying away into Babylon unto Christ are 14"
    },
    {
      "id": 45,
      "start": 2651.9800567626953,
      "end": 2660.2200622558594,
      "text": " generations. I'm so thankful that God has given us a record, the Word of God, the"
    },
    {
      "id": 46,
      "start": 2660.2200622558594,
      "end": 2665.2200622558594,
      "text": " pure Word of God. He's given us a record of these descendants and how He's"
    },
    {
      "id": 47,
      "start": 2665.2200622558594,
      "end": 2671.2200622558594,
      "text": " promised the birth of Christ, and through the pages of Scripture we can trace and"
    },
    {
      "id": 48,
      "start": 2671.2200622558594,
      "end": 2678.300048828125,
      "text": " route and understand what God is doing and how God is working. This evening, as"
    },
    {
      "id": 49,
      "start": 2678.300048828125,
      "end": 2682.6600646972656,
      "text": " we look at this portion of Scripture, we think about the death of Abraham, I'll"
    },
    {
      "id": 50,
      "start": 2682.6600646972656,
      "end": 2688.1800537109375,
      "text": " just close with saying this, we can rejoice in the testimony of a life well"
    },
    {
      "id": 51,
      "start": 2688.1800537109375,
      "end": 2692.580047607422,
      "text": " lived. We can rejoice. Listen, it's a blessing to be able to go. I went to a"
    },
    {
      "id": 52,
      "start": 2692.580047607422,
      "end": 2697.5400390625,
      "text": " funeral not long ago, and you know, when you attend a funeral service, there are"
    },
    {
      "id": 53,
      "start": 2697.5400390625,
      "end": 2700.780059814453,
      "text": " times in which there's, it's a home-going service, I mean, it's a"
    },
    {
      "id": 54,
      "start": 2700.780059814453,
      "end": 2705.8600463867188,
      "text": " wonderful rejoicing time of knowing that the individual walked with God and"
    },
    {
      "id": 55,
      "start": 2705.8600463867188,
      "end": 2710.2200622558594,
      "text": " served God, and they're now with God, and what joy. And I had the privilege of"
    },
    {
      "id": 56,
      "start": 2710.2200622558594,
      "end": 2714.5400390625,
      "text": " attending such a funeral not long ago, and it was just a sweet service, a"
    },
    {
      "id": 57,
      "start": 2714.5400390625,
      "end": 2722.020050048828,
      "text": " testimony of a faithful follower of Jesus Christ. That's my desire. A pastor"
    },
    {
      "id": 58,
      "start": 2722.020050048828,
      "end": 2726.6600646972656,
      "text": " friend that was there, it was for Pastor Mike Reed's wife, and Mrs. Reed, we prayed"
    },
    {
      "id": 59,
      "start": 2726.6600646972656,
      "end": 2730.5400390625,
      "text": " for her for a long time, Mrs. Reed went home to be with the Lord, and man, it was"
    },
    {
      "id": 60,
      "start": 2730.5400390625,
      "end": 2735.1800537109375,
      "text": " a wonderful, wonderful service. And a pastor friend that was sitting next to"
    },
    {
      "id": 61,
      "start": 2735.1800537109375,
      "end": 2739.580047607422,
      "text": " me at that funeral, he tapped me on the arm at the end, he said, this is what all"
    },
    {
      "id": 62,
      "start": 2739.580047607422,
      "end": 2744.780059814453,
      "text": " of us should desire in a funeral service, a celebration of a life that was lived"
    },
    {
      "id": 63,
      "start": 2744.780059814453,
      "end": 2750.6200561523438,
      "text": " for Christ. And as we think about Abraham, and we think about the life of"
    },
    {
      "id": 64,
      "start": 2750.6200561523438,
      "end": 2755.5000610351562,
      "text": " Abraham, we ought to rejoice in a life lived for the Lord, a life in which he"
    },
    {
      "id": 65,
      "start": 2755.5000610351562,
      "end": 2760.1000366210938,
      "text": " followed the Lord. He went out not knowing where he went, just following the"
    },
    {
      "id": 66,
      "start": 2760.1000366210938,
      "end": 2769.06005859375,
      "text": " Lord. And he saw God do some amazing things. Was he perfect? No, not by far. Can"
    },
    {
      "id": 67,
      "start": 2769.06005859375,
      "end": 2773.4600524902344,
      "text": " we find critique? Can we find criticism? Can we poke at and say, look at this"
    },
    {
      "id": 68,
      "start": 2773.4600524902344,
      "end": 2778.780059814453,
      "text": " failure, and look at that? Absolutely. There's flaws. He's a man. But we find"
    },
    {
      "id": 69,
      "start": 2778.780059814453,
      "end": 2786.06005859375,
      "text": " that he's the friend of God. He's in Hebrews 11. He had great faith. We say,"
    },
    {
      "id": 70,
      "start": 2786.06005859375,
      "end": 2791.7400512695312,
      "text": " man, I desire that when I die, I don't know when it's gonna be, could be tonight,"
    },
    {
      "id": 71,
      "start": 2791.7400512695312,
      "end": 2799.300048828125,
      "text": " probably you're not gonna live to 175. But whatever the time is, that I would"
    },
    {
      "id": 72,
      "start": 2799.300048828125,
      "end": 2805.06005859375,
      "text": " decide that I want to follow the Lord, all in, all for him, because I want to"
    },
    {
      "id": 73,
      "start": 2805.06005859375,
      "end": 2810.1800537109375,
      "text": " have a life that's well lived. Let's pray together. Father, we love you. We thank"
    },
    {
      "id": 74,
      "start": 2810.1800537109375,
      "end": 2815.1400451660156,
      "text": " you for loving us. We thank you for the life of Abraham. And as we look at this"
    },
    {
      "id": 75,
      "start": 2815.1400451660156,
      "end": 2820.9000549316406,
      "text": " portion of Scripture, we're encouraged. But I would admit this evening that in"
    },
    {
      "id": 76,
      "start": 2820.9000549316406,
      "end": 2827.3800659179688,
      "text": " addition to being encouraged, we are challenged in our own lives. And I pray"
    },
    {
      "id": 77,
      "start": 2827.3800659179688,
      "end": 2834.300048828125,
      "text": " that we'd take a few moments by way of invitation tonight to evaluate our own"
    },
    {
      "id": 78,
      "start": 2834.340057373047,
      "end": 2843.9000549316406,
      "text": " lives, to consider our own mortality. I trust that each one that's gathered here"
    },
    {
      "id": 79,
      "start": 2843.9000549316406,
      "end": 2849.820037841797,
      "text": " this evening knows you as their personal Lord and Savior. But if there might be"
    },
    {
      "id": 80,
      "start": 2849.820037841797,
      "end": 2856.1400451660156,
      "text": " one that's not sure of heaven, it'd be our prayer that tonight they'd be saved."
    },
    {
      "id": 81,
      "start": 2857.1000366210938,
      "end": 2862.7000427246094,
      "text": " With the thought that primarily we're speaking to believers this evening, I"
    },
    {
      "id": 82,
      "start": 2862.7000427246094,
      "end": 2873.820037841797,
      "text": " pray that we would be purposed in our lives. That we'd find that it was not by"
    },
    {
      "id": 83,
      "start": 2873.820037841797,
      "end": 2882.7000427246094,
      "text": " accident that Paul was able to say that he finished his course. For he set out"
    },
    {
      "id": 84,
      "start": 2882.7000427246094,
      "end": 2891.260040283203,
      "text": " and declared this purpose in Acts 20, that I might finish my course with joy."
    },
    {
      "id": 85,
      "start": 2892.06005859375,
      "end": 2898.3800659179688,
      "text": " And God, I pray that for each one of us this evening, we know not how much longer"
    },
    {
      "id": 86,
      "start": 2898.3800659179688,
      "end": 2907.020050048828,
      "text": " we have in this race. We know not when our course will end. It is my prayer that"
    },
    {
      "id": 87,
      "start": 2907.020050048828,
      "end": 2915.1800537109375,
      "text": " each of us would have a desire to finish our course with joy. That we'd seek to"
    },
    {
      "id": 88,
      "start": 2915.1800537109375,
      "end": 2922.7000732421875,
      "text": " walk with you and obey you. That we'd be doers of the Word. That your favor would"
    },
    {
      "id": 89,
      "start": 2922.7000732421875,
      "end": 2929.0200805664062,
      "text": " be upon us, because we walk in obedience. We pray that you'd move and work as only"
    },
    {
      "id": 90,
      "start": 2929.0200805664062,
      "end": 2933.0200805664062,
      "text": " you can. We'll thank you for every decision that's made, for it's in Christ's"
    },
    {
      "id": 91,
      "start": 2933.0200805664062,
      "end": 2934.06005859375,
      "text": " name we pray."
    }
  ],
  "processed_at": "2025-04-17T01:47:39.618906"
}