{
  "video_id": "v93DvI0bY10",
  "text": "day and night, forever and ever. Amen. And he is a defeated foe. He's a foe, but he's a defeated foe. Amen. And what a wonderful song. So thankful for redemption through the blood of Jesus Christ. Hebrews chapter number six this morning, Hebrews chapter number six. And as you're turning there, I'm going to read, I'm going to read a passage of scripture to you. And then I'm going to read you the words of a familiar hymn. Hebrews chapter number six. We've been making our way through the book of Hebrews, of course, here in 2020. And we are going to finish the sixth chapter this morning and we're making progress. This of course is the last section of this warning that we're in the midst of. We've had several messages now at the end of chapter number five, really beginning in verse number 11, all the way through the end of chapter number six is what we'd refer to as another one of those warning passages that are found in the book of Hebrews. And this particular warning passage, we have noted how the recipients were confronted. They were confronted with their spiritual immaturity. The fact that they were saved, but they were not growing. They were immature. They could not receive the things that the writer wanted to give them because they were dull of hearing and the time that they ought to be teachers, they had need that one teach them. And they were confronted on their spiritual immaturity. We made the note as we studied the last part of chapter number five, as you would make a comparison between these recipients here in the book of Hebrews and those over in the book of first Corinthians, where the church in Corinth, they were a carnal church. They were not able to receive the things that the apostle Paul wanted to give them. And their carnality was seen through their envying and their strife and their division. And all of that is noted in the book of first Corinthians. And so we find that they were confronted with their spiritual immaturity, and then they were challenged to go on to spiritual maturity. We noticed in chapter number six and verse number one, that the writer says, therefore leaving the principles of the doctrine of Christ notice, let us go on unto perfection. And that idea of spiritual maturity last week, as we looked at the passage of scripture in verses nine through 12, we noted that there should be evidence that supports not only our salvation, but really our sanctification. And that evidence ought to be, it should be in our lives. It ought to be there. We find that the apostle, as he's writing this letter, it says, and things that accompany salvation, that evidence of our conversion, the evidence of our sanctification. As we conclude the warning passage, we'll look at it this morning in verses 13 through 20. Really, we find that this passage of scripture would be an encouragement to the believers and encouragement to continue and encouragement to endure. You remember last week, as we had mentioned in verse number 12, that you be not slothful. Let me read verse 11 with it. And we desire that every one of you do show the same diligence to the full assurance of hope, notice, unto the end. We spoke about the importance of continuing. We mentioned about those that had left us examples, as he mentions about the followers of them who through faith and patience inherit the promises, as we know in verse number 12. And we'd mentioned how there are so many examples that have gone before us. And I asked this question at the end of message, who could look at us as an example? Who could look at your life as being an example that would be worthy to follow? And we find that there's some encouragement here in verses 13 through 20 with this idea of enduring, of continuing. There will be challenges and obstacles in the Christian life. Amen? There will be. There will be weeks, days where we deal with a greater number of challenges and obstacles maybe than we had dealt with earlier. But the reality is that we must keep our eyes on our Lord and Savior, Jesus Christ, and we must rest in his promises. I'm so thankful for the promises of God. And really, as we look at this passage of Scripture, you'll see many references to the promises. Remember, at the end of verse number 12, inherit the promises. And it really leads us into the text of Scripture that we're looking at this morning. In verse 13, it says, for when God made promise to Abraham, because he could swear by no greater, he swear by himself. Isn't that good? There's no one greater than God. He is the Lord God omnipotent. You go into a court of law, and you're going to be under oath, and you will recite some words that used to be, so help me God. And I know that in some areas and instances that's been changed. But the reality is, the idea of that oath is that you're swearing by a higher power. There's no greater power than God. The Bible says that because he could swear by no greater, he swear by himself, saying, verse 14, surely blessing I will bless thee, and multiplying I will multiply thee. And so after he had patiently endured, he obtained the promise. For man verily swear by the greater, and an oath for confirmation is to them an end of all strife. Wherein God, willing more abundantly to show unto the heirs of promise the immutability of his counsel, confirmed it by an oath, that by two immutable things in which it was impossible for God to lie. Aren't you thankful for that? It says that we might have a strong consolation, who have fled for refuge to lay hold upon the hope set before us, which hope we have as an anchor of the soul, both sure and steadfast, and which entereth into that within the veil, whether the forerunner is for us entered. Even Jesus, made an high priest forever after the order of Melchizedek. You find that in verse number 20, really he's going back to what he had shared in chapter number five, verses one through ten, that Jesus is a high priest after the order of Melchizedek, not after the Aaronic priesthood. And we find here that in chapter number seven and eight, he's going to continue to expound upon those things, and we find that he's going to make that transition back in verse number 20 to the thought at hand that he had left in chapter number five. Why did he leave it? Remember, he said that he had many things to say, verse number 11 of chapter five, of whom we have many things to say and hard to be uttered, seeing your dull of hearing. And so before he gave all of the instruction with regard to Jesus being a high priest after the order of Melchizedek, he gives this warning. He confronts them, he challenges them, and now we find the encouragement, the title for the message, if you're taking notes, we have an anchor. You see in verse number 19, and of course it's a familiar hymn that we sing, number 516 in our hymnal, not that you have a hymnal in front of you, but I'm just going to read the words of this song. Will your anchor hold in the storms of life? When the clouds unfold their wings of strife, when the strong tides lift and the cables strain, will your anchor drift or firm remain? It is safely moored till the storm would stand, for it is well secured by the Savior's hand. And the cables passed from his heart to mine can defy that blast through strength divine. It will firmly hold in the straits of fear when the breakers have told the reef is near. Though the tempest rave and the wild winds blow, not an angry wave shall bark or flow. When our eyes behold through the gathering night, the city of gold, our harbor bright, we shall anchor fast by the heavenly shore, with the storms all past forevermore. We have an anchor that keeps the soul steadfast and sure while the billows roll, fastened to the rock which cannot move, grounded firm and deep in the Savior's love. Isn't that a wonderful hymn? And this morning as we look at this passage of scripture, we have an anchor. I want you to notice, first of all, if you're taking notes, the example of Abraham. In verses 13 through 16—we've just read the verses, I will not reread them at this moment—but we find that there is an example given. It's the example of Abraham. Again, the writer of Hebrews uses an example that the reader could easily relate to. We've noticed that throughout the book of Hebrews. We mentioned how the thought of the book of Hebrews that Christ is superior, and he's superior to the prophets, he's superior than the angels, he's superior to Moses, he's superior in his priesthood, and we noticed all of those things as we've studied through the book of Hebrews. And as we study, we find that the people, the Jewish believers that are being written to, that they would be able to identify with that which is being spoken of, with the examples that are being used. And now we find that we come to this example of Abraham that is given. He says about Abraham and using the example—it's interesting, by the way, during the life and ministry of the Lord Jesus Christ, it was in John chapter 8, when he was speaking to the Pharisees, some of the religious leaders of the day, and on two occasions in that particular passage of Scripture, in verse 33 and again in verse number 39, those religious leaders claimed to be Abraham's seed. And they made that claim. They understood some things about Abraham, but you'll remember at the end of the passage, it was Jesus that said, before Abraham was, I am. And what a great power! truth that the Lord Jesus Christ was given with regard to his eternality, the fact that he is God. We find here in the passage of Scripture that as he uses the example of Abraham, he's speaking about this subject of promise. And notice it tells us in verse number 13 that God made promise to Abraham. Notice it says for when God made promise to Abraham, because he could swear by no greater, he swear by himself. We'll note that these verses of Scripture in verse 13 and 14 would be referenced back to Genesis chapter 22 verses 16 and 17. And it's in that passage of Scripture that we read, of course, after the instruction that Abraham had received with regard to sacrificing his own son and all that would take place and how God had provided. Jehovah Jireh is what Abraham called the place, God who provides, what a blessing. But we find that it's in verse number 16 that God speaks back, and it says here, and said, by myself have I sworn, saith the Lord, for because thou hast done this thing and hast not withheld thy son, thine only son, that in blessing I will bless thee, and in multiplying I will multiply thy seed as the stars of the heaven and as the sand which is upon the seashore, and thy seed shall possess the gate of his enemies. Now it's interesting that we would understand about the fact that God made promise to Abraham. If you were to read several chapters earlier in the book of Genesis, in Genesis chapter number 15, you read the Abrahamic covenant, as we often would refer to it as. And we find that in that covenant God made promise to Abraham, and the promise really dealt with the seed and the land. The book of Joshua we've been studying throughout the weeks of this pandemic, and we've noted how that the book of Joshua provides us with the historical account of the entrance into, conquering of, and eventually the inhabiting of the land. We're not quite done with the conquering of in our study, but we will soon get there. And we find that as we understand the promise that was made to Abraham in that Abrahamic covenant in Genesis chapter number 15, with regard to the seed and the land, but as we note here in Hebrews chapter number 6, that as he refers back to Genesis chapter 22, it helps us to find specifically the promise in which is being dealt with, and it's the promise of the seed. It's important that we note that. We'll look at the book of Galatians here in just a moment, but we find that, again, dealing with the example of Abraham, God made a promise to Abraham. I don't think any of us could deny that. We understand that God made promise to Abraham, and Abraham, according to verse number 15, patiently endured. Now, it's sometimes challenging for us to wait, is it not? God's given promises, and we say, okay, hurry up, Lord, we're ready for that, we're ready for this. And we find that the Bible says, and so after he had patiently endured, in verse number 15, he obtained the promise. And so as we think about the example of Abraham, we find that God made promise to Abraham. It's referred to in these verses with regard to the specifics of the promise in chapter 22, verses 16 and 17, that he's dealing with the seed. But you know, the promise that was given in chapter 15 with regard to a son, it took a while before he received that promise, did it not? And the Bible says that he patiently endured, and then it says this, he obtained the promise. If you're back in the book of Genesis again, you find that it was in chapter number 15, as God is speaking to Abraham and giving him this wonderful truth and this promise. Remember, it was Abraham that said, in verse number 12, and he's still referred to as Abraham at this particular time, it says, But we find that the Lord responds in verse 4 of Genesis 15 and said, You notice, of course, there are several events that take place between God giving this promise and, of course, many visits from God reassuring Abraham of the promise, but it's not until chapter 21 where you see the birth of Isaac. And you find that in verse number 1, the Bible says this of Genesis 21, As he said, aren't those precious words? Because God always does what he says he will do. We may have to patiently endure, we may not get it exactly when we think it's going to come, but we find that God always does what God says he will do. And the Bible says, As he had spoken. As he said, as he had spoken. It says in verse 2, For Sarah conceived and bare Abraham a son in his old age, at the set time of which God had spoken to him. And Abraham called the name of his son that was born unto him, whom Sarah bare to him Isaac. What a blessing! You come to chapter 22 and you find the instruction to take and to offer Isaac to the Lord. It says, Take now thy son, thine only son Isaac, in verse 2 of chapter 22, whom thou lovest, and get thee into the land of Moriah and offer him there for a burnt offering upon one of the mountains, which I will tell thee of. We find that Abraham obeyed. He went and God provided. Remember, it was Isaac that said, My father, he said, the fire and the wood, but where is the lamb for a burnt offering? And Abraham said, he said, God will provide himself a lamb for a burnt offering. What great faith! We find that it's within the context of these passages of Scripture that the example is used here in the book of Hebrews of Abraham and how, yes, that promise had been given. Again, the Jewish believers, I mean, as we understand the truth of the book of Genesis and we can relate to the instruction that had been given to Abraham and how he patiently endured and all of those things, no doubt these Jewish believers would easily be able to relate to that which would be spoken to them here with regard to the example of Abraham. It's important that we know as we interpret Scripture with Scripture and Galatians chapter number three. I'm not planning to go back to the book of Genesis, so you don't need to go there or keep your place there, but look over in Galatians chapter number three, if you will, because I want to speak to you about this promise of a seed. Yes, there's a promise of seed and land, but we find that as we consider the example of Abraham here, as we make the transition between using an example and then giving the believers some instruction, as we find in the next several verses of Hebrews 6, we find that it's important that we understand that we would be the ones that are referenced there in verse 17 of Hebrews 6, unto the heirs of promise. Notice in Galatians 3, in verse number 6, even as Abraham believed God and it was accounted to him for righteousness, know you therefore that they which are of faith, the same are the children of Abraham. It says in verse number 8 in the Scripture, for seeing that God would justify the heathen through faith, preached before the gospel unto Abraham, saying, in thee shall all nations be blessed. So then they which be of faith are blessed with faithful Abraham. For as many, verse 10, as are of the works of the law are under the curse. For it is written, cursed is every one that continueth not in all things which are written in the book of the law to do them. But that no man is justified by the law in the sight of God. It is evident, for the just shall live by faith. And the law is not of faith, but the man that doeth them shall live in them. Christ hath redeemed us from the curse of the law, being made a curse for us. For it is written, cursed is everyone that hangeth on a tree. Notice that the blessing of Abraham might come on the Gentiles, how? Through Jesus Christ. That we might receive the promise of the Spirit through faith. Brethren, I speak after the manner of men, though it be but a man's covenant. Yet if it be confirmed, no man disannulleth or addeth thereto. Now to Abraham and his seed were the promise made. He sayeth not, and to seeds, as of many, but as of one. And to thy seed, which is Christ. And this I say, that the covenant that was confirmed before of God and Christ, the law, which was 430 years after, cannot disannul, that it should make the promise of none effect. For if the inheritance be of the law, it is no more of promise, but God gave it to Abraham, how? By promise. And so as we come to Hebrews chapter number 6 and we see, for when God made promise to Abraham, and we think about the truth of that which is being given to us here, and he gives us the truth of Genesis 22, the truth of Genesis 15, and then the truth of Galatians 3, as we put all of these things together and we understand the example here of this one Abraham, that God had made promise to him. That Abraham patiently endured, but then a Abraham, as we find at the end of verse number 15, he obtained the promise. Of course, that son, Isaac, that was born, and of course, you follow the lineage, if you will, and you see the seed being Christ. It's interesting to note, as you study throughout the Old Testament, so many evils that are given against the nation of Israel, and so many battles and people groups that come against them, you find that throughout the history, that really what's happening is Satan is working to destroy the line that Messiah would come from. That's what you find. Why was it that Haman said, we're going to destroy all of the Jews? Satan is working. See, there is an evil that is taking place in our world, even still today, and we understand that we are engaged in spiritual battle, spiritual warfare. Far too often, what happens is we look at some person as being the enemy, instead of us understanding who the true enemy is. I'm speaking as a child of God this morning, and as a child of God, we must understand when there's, listen, you understand the devil wants to destroy your home, but you understand that your wife or your husband isn't your enemy. Satan is the enemy. He's the one that wants to destroy your home, and we could use illustration after illustration, example after example, but we find that as we would understand these things that had happened in the Old Testament, and how they come to pass, and we come to verse 17 of Hebrews 6, and it says, Wherein God, willing more abundantly to show unto the, notice this, the heirs of promise, the immutability of his counsel, confirmed it by an oath. The reality is that God didn't have to confirm anything by an oath. He did because it was human, it was part of the customs of humans to do that sort of thing. Have you ever had somebody say, do you promise? You buy something, and you're going to sign something, you make this thing that you sign, and you've entered into an agreement, a contract, it's binding, and there's all sorts of legal language that is used in it to show you what the responsibilities of the parties are, and we find that God, listen, his word is enough. But in order to show the sureness of his promise, he took this step, as we find in verse 16 and 17, notice, he says, For men verily swear by the greater, but remember, there is no one greater than God. He could not appeal to a greater power, he is the greatest power, but in order to help man understand, it says that an oath for confirmation is to them an end of all strife, wherein God, appealing more abundantly to show unto the heirs of promise, notice this, the immutability of his counsel confirmed it, how? By an oath. You read the end of Genesis chapter number 15, Abraham sleeping, when it passes through the animals that have been set apart, and you see the reality of God making this promise, and he says in verse 18 that by two immutable things, that word immutable, unchanging, right? When we speak about the immutability of God, I'm so thankful that our God is the same yesterday and today and forever. He said in Malachi, I am the Lord, I change not. We can't say that, amen? We change sometimes multiple times in the same day, amen? I mean, sometimes we have good days, sometimes we have bad days, sometimes we have good moments and we have bad moments, but God doesn't change, he is the same, and we find that it says that by two immutable things, notice, in which it was impossible for God to lie. Paul mentioned this to Titus in Titus 1, you don't need to turn there, I'll read it to you, but in verse number 2 it says, in hope of eternal life, which God that cannot lie promised before the world began. Our God cannot lie, he's not a man that he should lie, remember the situation in Numbers between Balaam and Balak? And you understand our God, he is ever the same and he cannot lie. It says here that we might have a strong consolation, that word consolation, it means to comfort. In fact, it's the same word that's often used to refer to the Holy Spirit, the comforter. And what a joy to understand that he wants us to have this strong consolation, this comfort, because he's given us these promises and he's proven the surety of the promise. It says this, who have fled for refuge to lay hold upon the hope set before us. Now we find that he's speaking about the heirs of promise. We understand as we look at Galatians chapter number 3 that he's speaking about those that are redeemed, those that have trusted the Lord Jesus Christ as their personal Savior. And we find that it's interesting that in the passage of Scripture in Galatians chapter number 3, he's speaking of course to Gentiles and he makes it known here that the blessing of Abraham might come on the Gentiles through Jesus Christ. Isn't that wonderful? Salvation through Christ. It's the only way. We sang about what a glory I'm saved, right? Saved, saved, what a blessing. I'm saved how? By the blood of the crucified one. It's the only way to be saved. I've often said, and I don't want to get into all that's going on in our nation today, but there's great division that is going on. And I've often said throughout the years of ministry as I study the Word of God and I understand the truth of God's Word, that the Word of God, that Jesus Christ, the Gospel of Jesus Christ is the answer to man's problem. There's so many problems in our nation today, divisions that are man-made, by the way. And we find that those divisions that are man-made, we find that the Gospel is the healer. Why? Because there's really only two categories of people, saved and lost. That's it. Amen? And we understand that as God has given us His Word and as He's speaking here, He's writing to these believers and we take in context the entirety of this warning passage. And He says, listen, I'm going to confront you on your spiritual immaturity. I'm going to challenge you to spiritual maturity that you would grow, that you would go on to perfection. I'm going to share with you the evidences that ought to be in your life that would prove your salvation, that would prove your sanctification, and I want to encourage you to endure. See, the reality is that, as I mentioned at the very beginning of our study of the book of Hebrews, the book is written to people that are ready to go back to Judaism. They're looking to go back. Remember in John chapter number six when Jesus is speaking there and all of those disciples that had followed Him, they went away and Jesus says, are you going to go also? And Peter stands up and says this, to whom shall we go? He says that we know that thou art the Christ and that you have the words of eternal life. And so we find that the writer of Hebrews is seeking to encourage these individuals. Listen, they have been given promises. We have been given promises. Standing on the promises, we sing the song, we rejoice in the promises of God. Can I tell you that for the child of God, we've not received every promise that's been made to us. I'm not yet in heaven, amen? This world is not my home, I'm just a passing through. I have the promise that Christ is going to return. I have the promise that I will be with Him forever. But as we go through life, as these believers had received promise, He gives them the example of Abraham. Why? He received a promise but he didn't get it immediately. He endured. And he endured how? With patience. And then he obtained the promise. And so we find that he's reminding these believers on how they need to continue and to endure. So we've seen, first of all, notice the example of Abraham, number 2, in verses 17-20. Notice the expectation of the redeemed. The word hope is used in this passage of Scripture. In verse 18, again in verse number 19, we see the word hope that is used and we understand biblically speaking that the word hope, it's an expectation based upon God's gracious promises. Hope is confidence. It's an expectation. It's not like we so frequently use the word in our daily language today when we speak about hoping for this or hoping for that. But we find that when we deal with biblical hope, it is an expectation that is based upon God's gracious promises. I have this hope. We speak about the blessed hope that Paul refers to in Titus. What is he speaking about? The return of the Lord Jesus Christ. It is an expectation. There is a confidence that we have as God's people that He is going to return. Why? Because He said He would. And He's not slack concerning His promise. And what a blessing it is for us to understand that. We find that He says, as I've mentioned already there in verse number 18, that we might have strong consolation. And so we find that the recipients are given this word of comfort, of consolation, and we find that they are given this promise and it's being explained to them that they could have an expectation. I'm so glad that this world is not all that there is for us. Amen? There's so much more. And we find that the expectation is really illustrated in a few ways here in the passage of Scripture. Notice at the end of verse number 18, it says this, we might have a strong consolation who have fled for refuge to lay hold upon the hope set before us. I want to remind you this morning that God is our refuge. He's our refuge. In fact, the psalmist often cried out a verse that we dealt with, really a psalm that we dealt with a couple of months ago in one of our prayer meetings. In Psalm 46, in verse number 1, God is our refuge and strength, a very present help in trouble. He continues in verse 2 and says, Therefore will not we fear, though the earth be removed and though the mountains be carried into the midst of the sea, though the waters thereof roar and be troubled, though the mountains shake with the swelling thereof. Selah. See, God is our refuge. And we find this picture that is given, we'd be reminded of what the psalmist said, but we'd also understand of that which is in view here, really, we think about the cities of refuge. We haven't quite gotten there yet in our study of the book of Joshua, but as we get through the book of Joshua, you understand as the land is divided and the tribes receive their inheritance, that there are cities of refuge. There were six of them, three on the eastern side of the Jordan, three on the western side of Jordan, and they were strategically located as God had instructed them to place those cities of refuge. It was interesting, if someone would kill somebody unawares, it was not a premeditated murder, it was some type of an accident, they could flee to a city of refuge, and as they would flee to the city of refuge, they would have security within that city. The people of that city had a responsibility to provide a refuge, a place of safety for them, and you find there would be a hearing and all sorts of things that would go on, if they were guilty, then they were guilty, they'd be put to death if it was, in fact, a premeditated type of a thing. But we find that if it truly was an accident, that they'd have to stay there until when? The death of the priest. And when the priest died, they could return back. Now, it's interesting because God is our refuge, the Lord Jesus Christ is our refuge, and as we've often mentioned, and we'll get into even more of this as we've spoken about the death of our Savior, our high priest, but he rose again. He conquered sin, death, and the grave. We referenced in chapter number seven a few weeks ago how that he has this unchangeable priesthood. Why? Because he continueth ever. And we find here that God is our refuge, and what a joy to understand that. And the encouragement that's coming to these believers, he's saying, listen, there's an expectation that you ought to have as a redeemed person. And he speaks about God being our refuge. Number two, he speaks about the fact that he, God, is our anchor. Notice in verse 19, which hope we have as an anchor of the soul, both sure and steadfast, in which entereth into that within the veil. Isn't that precious? We think about the fact that we have an anchor. We use that as our title. We've read the words of the songwriter that he shared in penning those words, no doubt inspired from this truth of Hebrews 6. In verse number 19, and we'd understand that this anchor that we have, this anchor of the soul, that it's sure and steadfast, but notice it says, which entereth into that within the veil. Remember, as we continue to use the example of all that's taking place of the priesthood and all of those things, we find that in chapter number 14, and excuse me, in chapter number four, in verse number 14 of the book of Hebrews, that the writer says this, seeing then that we have a great high priest that is passed into the heavens, Jesus, the son of God, let us hold fast our profession. For we have not an high priest which cannot be touched with the feeling of our infirmities, but was in all points tempted like as we are, yet without sin. And we find that He, our Savior, our anchor, the anchor of our soul, that it's sure and steadfast, and that He is in heaven. Right? It's interesting about the priest. The priest could go and make offering for the people, but he could not lead the people into the place where the offering would be made. We find that Jesus, He entereth into that within the veil. He is seated in the heavenlies. We understand that He's sitting upon His throne. We understand that the Bible teaches us in chapter number 10 of this same book, in verse number 12, but this man, after he'd offered one sacrifice for sins forever, sat down on the right hand of God. He's our refuge. He's our anchor. He is our forerunner. Notice in verse number 20, the Bible says this, whither the forerunner is for us entered, even Jesus, made an high priest forever after the order of Melchizedek. As we think about the truth that is given to us in verse number 20 with regard to the usage of this word forerunner, it's an interesting word. It means one who comes in advance to a place where the rest are to follow. I like that. One who comes in advance to a place where the rest are to follow. Where's that place? In heaven. It says, in which entereth into that within the veil at the end of verse number 19, whither the forerunner is for us entered, even Jesus, made an high priest forever after the order of Melchizedek. As we look at the passage of Scripture and we conclude the warning section that is given to these Jewish believers, again, a group of people that because of the intense persecution, because of all that they were dealing with, because of the time in which they were living and the temple was still standing and sacrifices were still being made and they're dealing with all of those things and they were dealing with this level of persecution, there was a thought on the mind of some of these believers that they would just return to Judaism. And we find that the writer of Hebrews says, no, Jesus is superior. He begins that immediately in chapter number one and he deals with how Christ is superior throughout those first several chapters. And in this particular warning, as he's giving the expectation to these redeemed, he's saying, listen, you need to understand something. Let me remind you of Abraham. Let me remind you how God made promise to Abraham, but he didn't receive it immediately. And in like manner, as you have received promise, you can be assured of the promise that God has made. You can stand on the promises of God's Word. Amen. We find that Peter said that they were exceeding great and precious promises. What a great truth that is given to us with regard to that reference. I see Peter making that statement and what a joy it is. We find that Paul said this in 2 Corinthians 1, in verse number 20, for all the promises of God in him are yea, and in him amen unto the glory of God by us. But you don't understand my circumstances. You don't understand what I'm dealing with and you don't know how hard it is. These people were dealing with some very hard times. What did the writer remind them of? Remember the promises. Remember there's an expectant end. This world is not all there is to offer. Sometimes we get so caught up in the problems and the affairs of this world and we get underneath of them and we get burdened down by them and we get our eyes and our vision on those things. And Paul said in that book, 2 Corinthians chapter 4, he says, while we look not at the things which are temporal, and in verse number 18 of that fourth chapter, he says, but things which are eternal. Amen. And the reality is that these believers who had been struggling, who were dealing with difficulty, we find that the expectation of these believers is illustrated for them that we have that God is our refuge. That we have an anchor that it's sure and steadfast that He's our forerunner. That He's already gone to provide the way. The forerunner would be used often in a number of different ways. We use the military canvassing situation. He'd go before and if there were obstacles, if there were terrain difficulties, they would understand what was going on and they would come back and provide direction for how the rest of the group was to travel. And we find that as I've mentioned already, the Old Testament priest, he could not lead the people into the holy place, but we find that Jesus as our great high priest, that He in fact has made the way. Remember what Jesus said in John 14, in verse number 6, I am the way, the truth, and the life. No man cometh unto the Father, but by me. I'm so thankful that He made a way, that He is the way. And these believers and... they could easily relate to Abraham and they could understand the struggles. I mean if you read from chapter 15 to chapter 21 and you read some of the things that took place and you read about the laughter and you read about the situation with Ishmael and you read about all of those things and you understand what's taking place and as a Jewish believer you have this heritage as being the seed of Abraham physically speaking they could relate and understand Abraham received a promise but he didn't obtain a promise immediately he endured with patience and now as us as believers we understand the application from Galatians 3 that it's of that seed speaking spiritually because it's through Christ and we are the heirs of promise we can rejoice this morning in the promises of God I don't know what difficulty or challenge you're dealing with but I do know that God's Word has the answer and I do know that God he will provide us with the strength that we need he will give us the grace remember what Paul said as he besought the Lord thrice in 2nd Corinthians chapter number 12 for that infirmity that he dealt with that thorn in his flesh and the Bible tells us that God replied and said no why because my grace is sufficient for thee I wonder this morning as we deal with things even as these believers in the first century that are receiving this book of Hebrews I wonder if there are times in which we struggle with the thought of can we go any further I mean look at all of these obstacles and these challenges I'm dealing with can I remind you to turn to the promises of God can I remind you this morning that we are to endure can I remind you this morning that his grace is sufficient and I just wonder this morning in my life in your life have we found it to be so have we found that his grace indeed is sufficient God is not a liar he said that it would be sufficient and as we rest in him listen we sing the song amazing grace oh what a great song his grace is abundant toward me Paul's testimony and this morning let us be reminded we have an anchor it's illustrated that way at the end in verse 19 of Hebrews 6 and these believers that the writer is encouraging keep on go on to spiritual maturity don't give up don't turn back go on for us this morning let us keep our eyes on Jesus let us endure with patience let us understand that his promises are sure father we love you this morning we thank you for loving us we thank you for thy word the truth that's contained therein we thank you for the examples that you given us in your word we thank you for how this passage of Scripture this warning section for these believers how it concludes reminding these believers of the promises that have been given to us we're so thankful that this mortal shall put on immortality that this world is not our home we have the promise and the certainty of heaven not because of our own righteousness but because of redemption through the Lord Jesus Christ through the blood that was shed through his death burial and glorious resurrection I pray this morning they would help us to understand the expectation of the redeemed you'd help us to understand that though we deal with trials and obstacles and challenges in this world that this world is not my home help us to look on the eternal and not the temporal help us to rest in the fact that you are the way the truth and the life and that your grace indeed is sufficient if there's one that does not know you as their personal Lord and Savior it's our prayer that today before it's eternally too late they would trust Christ as their Savior for those that have been saved by the blood of the crucified one Lord I pray you'd help us to be encouraged this morning knowing that just as Abraham had received promise that he endured with patience and then he obtained the promise God would you help us to run a race we get to the twelfth chapter of this great book we see that that's the instruction that is given race how with patience knowing as we look to Jesus the author and finisher of our faith knowing that we have this expectant end that forever and ever for all of eternity we will be with thee and we'll worship thee and what a wonderful truth that is we pray that you'd work in hearts and lives as only you can help us Lord today to be encouraged well thank you for it in Christ's name we pray would you stand with me heads are bowed eyes are closed Kimberly's gonna play a song of invitation on the piano and as she does want to encourage",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 7.199999809265137,
      "text": " day and night, forever and ever. Amen. And he is a defeated foe. He's a foe,"
    },
    {
      "id": 1,
      "start": 7.199999809265137,
      "end": 12.479999542236328,
      "text": " but he's a defeated foe. Amen. And what a wonderful song. So thankful for redemption"
    },
    {
      "id": 2,
      "start": 12.479999542236328,
      "end": 17.280000686645508,
      "text": " through the blood of Jesus Christ. Hebrews chapter number six this morning, Hebrews chapter number"
    },
    {
      "id": 3,
      "start": 17.280000686645508,
      "end": 22.0,
      "text": " six. And as you're turning there, I'm going to read, I'm going to read a passage of scripture"
    },
    {
      "id": 4,
      "start": 22.0,
      "end": 29.600000381469727,
      "text": " to you. And then I'm going to read you the words of a familiar hymn. Hebrews chapter number six."
    },
    {
      "id": 5,
      "start": 30.559999465942383,
      "end": 38.15999984741211,
      "text": " We've been making our way through the book of Hebrews, of course, here in 2020. And we are"
    },
    {
      "id": 6,
      "start": 38.15999984741211,
      "end": 44.880001068115234,
      "text": " going to finish the sixth chapter this morning and we're making progress. This of course is the last"
    },
    {
      "id": 7,
      "start": 44.880001068115234,
      "end": 51.91999816894531,
      "text": " section of this warning that we're in the midst of. We've had several messages now at the end of"
    },
    {
      "id": 8,
      "start": 51.91999816894531,
      "end": 55.599998474121094,
      "text": " chapter number five, really beginning in verse number 11, all the way through the end of chapter"
    },
    {
      "id": 9,
      "start": 55.599998474121094,
      "end": 60.08000183105469,
      "text": " number six is what we'd refer to as another one of those warning passages that are found in the"
    },
    {
      "id": 10,
      "start": 60.08000183105469,
      "end": 66.08000183105469,
      "text": " book of Hebrews. And this particular warning passage, we have noted how the recipients were"
    },
    {
      "id": 11,
      "start": 66.08000183105469,
      "end": 71.91999816894531,
      "text": " confronted. They were confronted with their spiritual immaturity. The fact that they were"
    },
    {
      "id": 12,
      "start": 72.80000305175781,
      "end": 78.16000366210938,
      "text": " saved, but they were not growing. They were immature. They could not receive the things that"
    },
    {
      "id": 13,
      "start": 78.87999725341797,
      "end": 83.27999877929688,
      "text": " the writer wanted to give them because they were dull of hearing and the time that they ought to"
    },
    {
      "id": 14,
      "start": 83.27999877929688,
      "end": 88.16000366210938,
      "text": " be teachers, they had need that one teach them. And they were confronted on their spiritual"
    },
    {
      "id": 15,
      "start": 88.16000366210938,
      "end": 92.72000122070312,
      "text": " immaturity. We made the note as we studied the last part of chapter number five, as you would"
    },
    {
      "id": 16,
      "start": 92.72000122070312,
      "end": 98.63999938964844,
      "text": " make a comparison between these recipients here in the book of Hebrews and those over in the book"
    },
    {
      "id": 17,
      "start": 98.63999938964844,
      "end": 103.5999984741211,
      "text": " of first Corinthians, where the church in Corinth, they were a carnal church. They were not able to"
    },
    {
      "id": 18,
      "start": 103.5999984741211,
      "end": 109.91999816894531,
      "text": " receive the things that the apostle Paul wanted to give them. And their carnality was seen through"
    },
    {
      "id": 19,
      "start": 109.91999816894531,
      "end": 114.55999755859375,
      "text": " their envying and their strife and their division. And all of that is noted in the book of first"
    },
    {
      "id": 20,
      "start": 114.55999755859375,
      "end": 118.72000122070312,
      "text": " Corinthians. And so we find that they were confronted with their spiritual immaturity,"
    },
    {
      "id": 21,
      "start": 118.72000122070312,
      "end": 125.12000274658203,
      "text": " and then they were challenged to go on to spiritual maturity. We noticed in chapter number"
    },
    {
      "id": 22,
      "start": 125.12000274658203,
      "end": 129.1199951171875,
      "text": " six and verse number one, that the writer says, therefore leaving the principles of the doctrine"
    },
    {
      "id": 23,
      "start": 129.1199951171875,
      "end": 137.44000244140625,
      "text": " of Christ notice, let us go on unto perfection. And that idea of spiritual maturity last week,"
    },
    {
      "id": 24,
      "start": 137.44000244140625,
      "end": 143.1199951171875,
      "text": " as we looked at the passage of scripture in verses nine through 12, we noted that there"
    },
    {
      "id": 25,
      "start": 143.1199951171875,
      "end": 148.9600067138672,
      "text": " should be evidence that supports not only our salvation, but really our sanctification."
    },
    {
      "id": 26,
      "start": 148.9600067138672,
      "end": 154.39999389648438,
      "text": " And that evidence ought to be, it should be in our lives. It ought to be there. We find that"
    },
    {
      "id": 27,
      "start": 154.39999389648438,
      "end": 160.8800048828125,
      "text": " the apostle, as he's writing this letter, it says, and things that accompany salvation,"
    },
    {
      "id": 28,
      "start": 160.8800048828125,
      "end": 166.39999389648438,
      "text": " that evidence of our conversion, the evidence of our sanctification. As we conclude the warning"
    },
    {
      "id": 29,
      "start": 166.39999389648438,
      "end": 172.16000366210938,
      "text": " passage, we'll look at it this morning in verses 13 through 20. Really, we find that this passage"
    },
    {
      "id": 30,
      "start": 172.16000366210938,
      "end": 177.83999633789062,
      "text": " of scripture would be an encouragement to the believers and encouragement to continue and"
    },
    {
      "id": 31,
      "start": 177.83999633789062,
      "end": 183.60000610351562,
      "text": " encouragement to endure. You remember last week, as we had mentioned in verse number 12, that you"
    },
    {
      "id": 32,
      "start": 183.60000610351562,
      "end": 189.9199981689453,
      "text": " be not slothful. Let me read verse 11 with it. And we desire that every one of you do show the same"
    },
    {
      "id": 33,
      "start": 189.9199981689453,
      "end": 196.63999938964844,
      "text": " diligence to the full assurance of hope, notice, unto the end. We spoke about the importance of"
    },
    {
      "id": 34,
      "start": 196.63999938964844,
      "end": 201.52000427246094,
      "text": " continuing. We mentioned about those that had left us examples, as he mentions about the"
    },
    {
      "id": 35,
      "start": 201.52000427246094,
      "end": 207.0399932861328,
      "text": " followers of them who through faith and patience inherit the promises, as we know in verse number"
    },
    {
      "id": 36,
      "start": 207.0399932861328,
      "end": 211.9199981689453,
      "text": " 12. And we'd mentioned how there are so many examples that have gone before us. And I asked"
    },
    {
      "id": 37,
      "start": 211.9199981689453,
      "end": 217.44000244140625,
      "text": " this question at the end of message, who could look at us as an example? Who could look at your"
    },
    {
      "id": 38,
      "start": 217.44000244140625,
      "end": 222.9600067138672,
      "text": " life as being an example that would be worthy to follow? And we find that there's some encouragement"
    },
    {
      "id": 39,
      "start": 222.9600067138672,
      "end": 230.9600067138672,
      "text": " here in verses 13 through 20 with this idea of enduring, of continuing. There will be challenges"
    },
    {
      "id": 40,
      "start": 230.9600067138672,
      "end": 239.1199951171875,
      "text": " and obstacles in the Christian life. Amen? There will be. There will be weeks, days where we deal"
    },
    {
      "id": 41,
      "start": 239.1199951171875,
      "end": 245.1199951171875,
      "text": " with a greater number of challenges and obstacles maybe than we had dealt with earlier. But the"
    },
    {
      "id": 42,
      "start": 245.1199951171875,
      "end": 251.75999450683594,
      "text": " reality is that we must keep our eyes on our Lord and Savior, Jesus Christ, and we must rest in his"
    },
    {
      "id": 43,
      "start": 251.75999450683594,
      "end": 257.0400085449219,
      "text": " promises. I'm so thankful for the promises of God. And really, as we look at this passage of"
    },
    {
      "id": 44,
      "start": 257.0400085449219,
      "end": 262.239990234375,
      "text": " Scripture, you'll see many references to the promises. Remember, at the end of verse number 12,"
    },
    {
      "id": 45,
      "start": 262.239990234375,
      "end": 267.5199890136719,
      "text": " inherit the promises. And it really leads us into the text of Scripture that we're looking at this"
    },
    {
      "id": 46,
      "start": 267.5199890136719,
      "end": 273.2799987792969,
      "text": " morning. In verse 13, it says, for when God made promise to Abraham, because he could swear by no"
    },
    {
      "id": 47,
      "start": 273.2799987792969,
      "end": 279.5199890136719,
      "text": " greater, he swear by himself. Isn't that good? There's no one greater than God. He is the Lord"
    },
    {
      "id": 48,
      "start": 279.5199890136719,
      "end": 287.1199951171875,
      "text": " God omnipotent. You go into a court of law, and you're going to be under oath, and you will"
    },
    {
      "id": 49,
      "start": 287.1199951171875,
      "end": 292.79998779296875,
      "text": " recite some words that used to be, so help me God. And I know that in some areas and instances"
    },
    {
      "id": 50,
      "start": 292.79998779296875,
      "end": 298.0799865722656,
      "text": " that's been changed. But the reality is, the idea of that oath is that you're swearing by a"
    },
    {
      "id": 51,
      "start": 298.0799865722656,
      "end": 304.8800048828125,
      "text": " higher power. There's no greater power than God. The Bible says that because he could swear by no"
    },
    {
      "id": 52,
      "start": 304.8800048828125,
      "end": 310.9599914550781,
      "text": " greater, he swear by himself, saying, verse 14, surely blessing I will bless thee, and multiplying"
    },
    {
      "id": 53,
      "start": 310.9599914550781,
      "end": 315.8399963378906,
      "text": " I will multiply thee. And so after he had patiently endured, he obtained the promise."
    },
    {
      "id": 54,
      "start": 316.8800048828125,
      "end": 322.6400146484375,
      "text": " For man verily swear by the greater, and an oath for confirmation is to them an end of all strife."
    },
    {
      "id": 55,
      "start": 322.6400146484375,
      "end": 328.9599914550781,
      "text": " Wherein God, willing more abundantly to show unto the heirs of promise the immutability of his"
    },
    {
      "id": 56,
      "start": 328.9599914550781,
      "end": 335.8399963378906,
      "text": " counsel, confirmed it by an oath, that by two immutable things in which it was impossible for"
    },
    {
      "id": 57,
      "start": 335.8399963378906,
      "end": 342.32000732421875,
      "text": " God to lie. Aren't you thankful for that? It says that we might have a strong consolation,"
    },
    {
      "id": 58,
      "start": 342.32000732421875,
      "end": 350.32000732421875,
      "text": " who have fled for refuge to lay hold upon the hope set before us, which hope we have as an anchor"
    },
    {
      "id": 59,
      "start": 350.32000732421875,
      "end": 357.44000244140625,
      "text": " of the soul, both sure and steadfast, and which entereth into that within the veil, whether the"
    },
    {
      "id": 60,
      "start": 357.44000244140625,
      "end": 365.8399963378906,
      "text": " forerunner is for us entered. Even Jesus, made an high priest forever after the order of Melchizedek."
    },
    {
      "id": 61,
      "start": 365.8399963378906,
      "end": 371.5199890136719,
      "text": " You find that in verse number 20, really he's going back to what he had shared in chapter number"
    },
    {
      "id": 62,
      "start": 371.5199890136719,
      "end": 378.8800048828125,
      "text": " five, verses one through ten, that Jesus is a high priest after the order of Melchizedek,"
    },
    {
      "id": 63,
      "start": 378.8800048828125,
      "end": 384.3999938964844,
      "text": " not after the Aaronic priesthood. And we find here that in chapter number seven and eight, he's"
    },
    {
      "id": 64,
      "start": 384.3999938964844,
      "end": 390.239990234375,
      "text": " going to continue to expound upon those things, and we find that he's going to make that transition"
    },
    {
      "id": 65,
      "start": 390.239990234375,
      "end": 396.1600036621094,
      "text": " back in verse number 20 to the thought at hand that he had left in chapter number five."
    },
    {
      "id": 66,
      "start": 396.1600036621094,
      "end": 401.6000061035156,
      "text": " Why did he leave it? Remember, he said that he had many things to say, verse number 11 of chapter five,"
    },
    {
      "id": 67,
      "start": 401.6000061035156,
      "end": 406.8800048828125,
      "text": " of whom we have many things to say and hard to be uttered, seeing your dull of hearing. And so before"
    },
    {
      "id": 68,
      "start": 406.8800048828125,
      "end": 411.9200134277344,
      "text": " he gave all of the instruction with regard to Jesus being a high priest after the order of"
    },
    {
      "id": 69,
      "start": 411.9200134277344,
      "end": 418.8800048828125,
      "text": " Melchizedek, he gives this warning. He confronts them, he challenges them, and now we find the"
    },
    {
      "id": 70,
      "start": 418.8800048828125,
      "end": 424.6400146484375,
      "text": " encouragement, the title for the message, if you're taking notes, we have an anchor. You see in verse"
    },
    {
      "id": 71,
      "start": 424.6400146484375,
      "end": 430.4800109863281,
      "text": " number 19, and of course it's a familiar hymn that we sing, number 516 in our hymnal, not that you"
    },
    {
      "id": 72,
      "start": 430.4800109863281,
      "end": 436.8800048828125,
      "text": " have a hymnal in front of you, but I'm just going to read the words of this song."
    },
    {
      "id": 73,
      "start": 436.8800048828125,
      "end": 442.79998779296875,
      "text": " Will your anchor hold in the storms of life? When the clouds unfold their wings of strife,"
    },
    {
      "id": 74,
      "start": 443.3599853515625,
      "end": 451.760009765625,
      "text": " when the strong tides lift and the cables strain, will your anchor drift or firm remain? It is"
    },
    {
      "id": 75,
      "start": 451.760009765625,
      "end": 458.9599914550781,
      "text": " safely moored till the storm would stand, for it is well secured by the Savior's hand. And the cables"
    },
    {
      "id": 76,
      "start": 458.9599914550781,
      "end": 465.5199890136719,
      "text": " passed from his heart to mine can defy that blast through strength divine. It will firmly hold in"
    },
    {
      "id": 77,
      "start": 465.5199890136719,
      "end": 471.0400085449219,
      "text": " the straits of fear when the breakers have told the reef is near. Though the tempest rave and"
    },
    {
      "id": 78,
      "start": 471.0400085449219,
      "end": 478.4800109863281,
      "text": " the wild winds blow, not an angry wave shall bark or flow. When our eyes behold through the gathering"
    },
    {
      "id": 79,
      "start": 478.4800109863281,
      "end": 484.6400146484375,
      "text": " night, the city of gold, our harbor bright, we shall anchor fast by the heavenly shore,"
    },
    {
      "id": 80,
      "start": 484.6400146484375,
      "end": 493.0400085449219,
      "text": " with the storms all past forevermore. We have an anchor that keeps the soul steadfast and sure"
    },
    {
      "id": 81,
      "start": 493.0400085449219,
      "end": 501.8399963378906,
      "text": " while the billows roll, fastened to the rock which cannot move, grounded firm and deep in the Savior's"
    },
    {
      "id": 82,
      "start": 501.8399963378906,
      "end": 507.3599853515625,
      "text": " love. Isn't that a wonderful hymn? And this morning as we look at this passage of scripture, we"
    },
    {
      "id": 83,
      "start": 508.0,
      "end": 512.8800048828125,
      "text": " have an anchor. I want you to notice, first of all, if you're taking notes, the example of Abraham."
    },
    {
      "id": 84,
      "start": 512.8800048828125,
      "end": 517.52001953125,
      "text": " In verses 13 through 16—we've just read the verses, I will not reread them at this moment—but"
    },
    {
      "id": 85,
      "start": 517.52001953125,
      "end": 522.719970703125,
      "text": " we find that there is an example given. It's the example of Abraham. Again, the writer of Hebrews"
    },
    {
      "id": 86,
      "start": 522.719970703125,
      "end": 528.0800170898438,
      "text": " uses an example that the reader could easily relate to. We've noticed that throughout the"
    },
    {
      "id": 87,
      "start": 528.0800170898438,
      "end": 535.52001953125,
      "text": " book of Hebrews. We mentioned how the thought of the book of Hebrews that Christ is superior,"
    },
    {
      "id": 88,
      "start": 535.52001953125,
      "end": 540.8800048828125,
      "text": " and he's superior to the prophets, he's superior than the angels, he's superior to Moses,"
    },
    {
      "id": 89,
      "start": 540.8800048828125,
      "end": 546.9600219726562,
      "text": " he's superior in his priesthood, and we noticed all of those things as we've studied through the"
    },
    {
      "id": 90,
      "start": 546.9600219726562,
      "end": 552.9600219726562,
      "text": " book of Hebrews. And as we study, we find that the people, the Jewish believers that are being"
    },
    {
      "id": 91,
      "start": 552.9600219726562,
      "end": 558.239990234375,
      "text": " written to, that they would be able to identify with that which is being spoken of, with the"
    },
    {
      "id": 92,
      "start": 558.239990234375,
      "end": 564.4000244140625,
      "text": " examples that are being used. And now we find that we come to this example of Abraham that is given."
    },
    {
      "id": 93,
      "start": 565.2000122070312,
      "end": 570.47998046875,
      "text": " He says about Abraham and using the example—it's interesting, by the way, during the life and"
    },
    {
      "id": 94,
      "start": 570.47998046875,
      "end": 575.52001953125,
      "text": " ministry of the Lord Jesus Christ, it was in John chapter 8, when he was speaking to the Pharisees,"
    },
    {
      "id": 95,
      "start": 575.52001953125,
      "end": 580.0800170898438,
      "text": " some of the religious leaders of the day, and on two occasions in that particular passage"
    },
    {
      "id": 96,
      "start": 580.0800170898438,
      "end": 585.2000122070312,
      "text": " of Scripture, in verse 33 and again in verse number 39, those religious leaders claimed to"
    },
    {
      "id": 97,
      "start": 585.2000122070312,
      "end": 590.719970703125,
      "text": " be Abraham's seed. And they made that claim. They understood some things about Abraham,"
    },
    {
      "id": 98,
      "start": 590.719970703125,
      "end": 594.7999877929688,
      "text": " but you'll remember at the end of the passage, it was Jesus that said,"
    },
    {
      "id": 99,
      "start": 594.7999877929688,
      "end": 599.8400268554688,
      "text": " before Abraham was, I am. And what a great power!"
    },
    {
      "id": 0,
      "start": 599.8400268554688,
      "end": 606.5600266456604,
      "text": " truth that the Lord Jesus Christ was given with regard to his eternality, the"
    },
    {
      "id": 1,
      "start": 606.5600266456604,
      "end": 611.280026435852,
      "text": " fact that he is God. We find here in the passage of Scripture that as he uses the"
    },
    {
      "id": 2,
      "start": 611.280026435852,
      "end": 615.8000268936157,
      "text": " example of Abraham, he's speaking about this subject of promise. And notice it"
    },
    {
      "id": 3,
      "start": 615.8000268936157,
      "end": 620.3600273132324,
      "text": " tells us in verse number 13 that God made promise to Abraham. Notice it says"
    },
    {
      "id": 4,
      "start": 620.3600273132324,
      "end": 625.2800273895264,
      "text": " for when God made promise to Abraham, because he could swear by no greater, he"
    },
    {
      "id": 5,
      "start": 625.2800273895264,
      "end": 631.4400272369385,
      "text": " swear by himself. We'll note that these verses of Scripture in verse 13 and 14"
    },
    {
      "id": 6,
      "start": 631.4400272369385,
      "end": 636.5600280761719,
      "text": " would be referenced back to Genesis chapter 22 verses 16 and 17. And it's in"
    },
    {
      "id": 7,
      "start": 636.5600280761719,
      "end": 641.5600280761719,
      "text": " that passage of Scripture that we read, of course, after the instruction that"
    },
    {
      "id": 8,
      "start": 641.5600280761719,
      "end": 647.4000282287598,
      "text": " Abraham had received with regard to sacrificing his own son and all that"
    },
    {
      "id": 9,
      "start": 647.4000282287598,
      "end": 653.0000267028809,
      "text": " would take place and how God had provided. Jehovah Jireh is what Abraham"
    },
    {
      "id": 10,
      "start": 653.0000267028809,
      "end": 658.0400276184082,
      "text": " called the place, God who provides, what a blessing. But we find that it's in"
    },
    {
      "id": 11,
      "start": 658.0400276184082,
      "end": 662.8400268554688,
      "text": " verse number 16 that God speaks back, and it says here, and said,"
    },
    {
      "id": 12,
      "start": 662.8400268554688,
      "end": 668.160026550293,
      "text": " by myself have I sworn, saith the Lord, for because thou hast done this thing and"
    },
    {
      "id": 13,
      "start": 668.160026550293,
      "end": 673.0000305175781,
      "text": " hast not withheld thy son, thine only son, that in blessing I will bless thee, and"
    },
    {
      "id": 14,
      "start": 673.0000305175781,
      "end": 677.9200286865234,
      "text": " in multiplying I will multiply thy seed as the stars of the heaven and as the"
    },
    {
      "id": 15,
      "start": 677.9200286865234,
      "end": 683.4000244140625,
      "text": " sand which is upon the seashore, and thy seed shall possess the gate of his"
    },
    {
      "id": 16,
      "start": 683.4000244140625,
      "end": 687.9200286865234,
      "text": " enemies. Now it's interesting that we would understand about the fact that God"
    },
    {
      "id": 17,
      "start": 687.9200286865234,
      "end": 691.4800262451172,
      "text": " made promise to Abraham. If you were to read several chapters earlier in the"
    },
    {
      "id": 18,
      "start": 691.4800262451172,
      "end": 696.0400238037109,
      "text": " book of Genesis, in Genesis chapter number 15, you read the Abrahamic"
    },
    {
      "id": 19,
      "start": 696.0400238037109,
      "end": 701.280029296875,
      "text": " covenant, as we often would refer to it as. And we find that in that covenant God"
    },
    {
      "id": 20,
      "start": 701.280029296875,
      "end": 706.5200271606445,
      "text": " made promise to Abraham, and the promise really dealt with the seed and the land."
    },
    {
      "id": 21,
      "start": 706.5200271606445,
      "end": 711.4400253295898,
      "text": " The book of Joshua we've been studying throughout the weeks of this pandemic,"
    },
    {
      "id": 22,
      "start": 711.4400253295898,
      "end": 715.280029296875,
      "text": " and we've noted how that the book of Joshua provides us with the historical"
    },
    {
      "id": 23,
      "start": 715.280029296875,
      "end": 720.0000305175781,
      "text": " account of the entrance into, conquering of, and eventually the inhabiting of the"
    },
    {
      "id": 24,
      "start": 720.0000305175781,
      "end": 724.2200241088867,
      "text": " land. We're not quite done with the conquering of in our study, but we will"
    },
    {
      "id": 25,
      "start": 724.2200241088867,
      "end": 729.7600250244141,
      "text": " soon get there. And we find that as we understand the promise that was made to"
    },
    {
      "id": 26,
      "start": 729.7600250244141,
      "end": 734.7000274658203,
      "text": " Abraham in that Abrahamic covenant in Genesis chapter number 15, with regard to"
    },
    {
      "id": 27,
      "start": 734.7000274658203,
      "end": 740.4600219726562,
      "text": " the seed and the land, but as we note here in Hebrews chapter number 6, that as"
    },
    {
      "id": 28,
      "start": 740.4600219726562,
      "end": 747.6600341796875,
      "text": " he refers back to Genesis chapter 22, it helps us to find specifically the"
    },
    {
      "id": 29,
      "start": 747.6600341796875,
      "end": 752.5800323486328,
      "text": " promise in which is being dealt with, and it's the promise of the seed. It's"
    },
    {
      "id": 30,
      "start": 752.5800323486328,
      "end": 755.0400238037109,
      "text": " important that we note that. We'll look at the book of Galatians here in just a"
    },
    {
      "id": 31,
      "start": 755.0400238037109,
      "end": 759.6600341796875,
      "text": " moment, but we find that, again, dealing with the example of Abraham, God made a"
    },
    {
      "id": 32,
      "start": 759.6600341796875,
      "end": 763.7400207519531,
      "text": " promise to Abraham. I don't think any of us could deny that. We understand that"
    },
    {
      "id": 33,
      "start": 763.7400207519531,
      "end": 769.9000244140625,
      "text": " God made promise to Abraham, and Abraham, according to verse number 15, patiently"
    },
    {
      "id": 34,
      "start": 769.9000244140625,
      "end": 775.5000305175781,
      "text": " endured. Now, it's sometimes challenging for us to wait, is it not? God's given"
    },
    {
      "id": 35,
      "start": 775.5000305175781,
      "end": 780.8600311279297,
      "text": " promises, and we say, okay, hurry up, Lord, we're ready for that, we're ready for"
    },
    {
      "id": 36,
      "start": 780.8600311279297,
      "end": 785.1400299072266,
      "text": " this. And we find that the Bible says, and so after he had patiently endured, in"
    },
    {
      "id": 37,
      "start": 785.1400299072266,
      "end": 790.3800201416016,
      "text": " verse number 15, he obtained the promise. And so as we think about the example of"
    },
    {
      "id": 38,
      "start": 790.3800201416016,
      "end": 795.02001953125,
      "text": " Abraham, we find that God made promise to Abraham. It's referred to in these"
    },
    {
      "id": 39,
      "start": 795.02001953125,
      "end": 800.2600250244141,
      "text": " verses with regard to the specifics of the promise in chapter 22, verses 16 and"
    },
    {
      "id": 40,
      "start": 800.2600250244141,
      "end": 805.3400268554688,
      "text": " 17, that he's dealing with the seed. But you know, the promise that was given in"
    },
    {
      "id": 41,
      "start": 805.3400268554688,
      "end": 810.2200317382812,
      "text": " chapter 15 with regard to a son, it took a while before he received that promise,"
    },
    {
      "id": 42,
      "start": 810.2200317382812,
      "end": 815.2200317382812,
      "text": " did it not? And the Bible says that he patiently endured, and then it says this,"
    },
    {
      "id": 43,
      "start": 815.3800201416016,
      "end": 820.8200225830078,
      "text": " he obtained the promise. If you're back in the book of Genesis again, you find"
    },
    {
      "id": 44,
      "start": 820.8200225830078,
      "end": 826.8200225830078,
      "text": " that it was in chapter number 15, as God is speaking to Abraham and giving him"
    },
    {
      "id": 45,
      "start": 826.8200225830078,
      "end": 831.4600219726562,
      "text": " this wonderful truth and this promise. Remember, it was Abraham that said, in"
    },
    {
      "id": 46,
      "start": 831.4600219726562,
      "end": 836.02001953125,
      "text": " verse number 12, and he's still referred to as Abraham at this particular time, it"
    },
    {
      "id": 47,
      "start": 836.02001953125,
      "end": 840.02001953125,
      "text": " says,"
    },
    {
      "id": 48,
      "start": 840.02001953125,
      "end": 856.6200256347656,
      "text": " But we find that the Lord responds in verse 4 of Genesis 15 and said,"
    },
    {
      "id": 49,
      "start": 856.6200256347656,
      "end": 869.8200378417969,
      "text": " You notice, of course, there are several events that"
    },
    {
      "id": 50,
      "start": 869.8200378417969,
      "end": 874.7000122070312,
      "text": " take place between God giving this promise and, of course, many visits from"
    },
    {
      "id": 51,
      "start": 874.7000122070312,
      "end": 880.6600341796875,
      "text": " God reassuring Abraham of the promise, but it's not until chapter 21 where you"
    },
    {
      "id": 52,
      "start": 880.6600341796875,
      "end": 885.1400146484375,
      "text": " see the birth of Isaac. And you find that in verse number 1, the Bible says this of"
    },
    {
      "id": 53,
      "start": 885.1400146484375,
      "end": 887.7000122070312,
      "text": " Genesis 21,"
    },
    {
      "id": 54,
      "start": 887.7000122070312,
      "end": 893.780029296875,
      "text": " As he said, aren't those precious words? Because God always does what he says he"
    },
    {
      "id": 55,
      "start": 893.780029296875,
      "end": 898.8600158691406,
      "text": " will do. We may have to patiently endure, we may not get it exactly when we think"
    },
    {
      "id": 56,
      "start": 898.8600158691406,
      "end": 903.6200256347656,
      "text": " it's going to come, but we find that God always does what God says he will do."
    },
    {
      "id": 57,
      "start": 903.6200256347656,
      "end": 907.8600158691406,
      "text": " And the Bible says,"
    },
    {
      "id": 58,
      "start": 907.8600158691406,
      "end": 914.0600280761719,
      "text": " As he had spoken. As he said, as he had spoken. It says in verse 2,"
    },
    {
      "id": 59,
      "start": 914.0600280761719,
      "end": 918.3800354003906,
      "text": " For Sarah conceived and bare Abraham a son in his old age, at the set time of"
    },
    {
      "id": 60,
      "start": 918.3800354003906,
      "end": 922.780029296875,
      "text": " which God had spoken to him. And Abraham called the name of his son that was born"
    },
    {
      "id": 61,
      "start": 922.780029296875,
      "end": 929.6200256347656,
      "text": " unto him, whom Sarah bare to him Isaac. What a blessing! You come to chapter 22"
    },
    {
      "id": 62,
      "start": 929.6200256347656,
      "end": 936.1000366210938,
      "text": " and you find the instruction to take and to offer Isaac to the Lord. It says,"
    },
    {
      "id": 63,
      "start": 936.1000366210938,
      "end": 940.2200317382812,
      "text": " Take now thy son, thine only son Isaac, in verse 2 of chapter 22, whom thou"
    },
    {
      "id": 64,
      "start": 940.2200317382812,
      "end": 944.3400268554688,
      "text": " lovest, and get thee into the land of Moriah and offer him there for a burnt"
    },
    {
      "id": 65,
      "start": 944.3400268554688,
      "end": 949.4200134277344,
      "text": " offering upon one of the mountains, which I will tell thee of. We find that"
    },
    {
      "id": 66,
      "start": 949.4200134277344,
      "end": 955.7000122070312,
      "text": " Abraham obeyed. He went and God provided. Remember, it was Isaac that said, My"
    },
    {
      "id": 67,
      "start": 955.7000122070312,
      "end": 961.3400268554688,
      "text": " father, he said, the fire and the wood, but where is the lamb for a burnt offering?"
    },
    {
      "id": 68,
      "start": 961.3400268554688,
      "end": 967.4200134277344,
      "text": " And Abraham said, he said, God will provide himself a lamb for a burnt"
    },
    {
      "id": 69,
      "start": 967.4200134277344,
      "end": 972.7400207519531,
      "text": " offering. What great faith! We find that it's within the context of these"
    },
    {
      "id": 70,
      "start": 972.7400207519531,
      "end": 977.6600341796875,
      "text": " passages of Scripture that the example is used here in the book of Hebrews of"
    },
    {
      "id": 71,
      "start": 978.1000366210938,
      "end": 983.2200317382812,
      "text": " Abraham and how, yes, that promise had been given. Again, the Jewish believers, I"
    },
    {
      "id": 72,
      "start": 983.2200317382812,
      "end": 988.2600402832031,
      "text": " mean, as we understand the truth of the book of Genesis and we can relate to the"
    },
    {
      "id": 73,
      "start": 988.2600402832031,
      "end": 992.9800415039062,
      "text": " instruction that had been given to Abraham and how he patiently endured and"
    },
    {
      "id": 74,
      "start": 992.9800415039062,
      "end": 997.780029296875,
      "text": " all of those things, no doubt these Jewish believers would easily be able to"
    },
    {
      "id": 75,
      "start": 997.780029296875,
      "end": 1003.2200317382812,
      "text": " relate to that which would be spoken to them here with regard to the example of"
    },
    {
      "id": 76,
      "start": 1003.2200317382812,
      "end": 1007.4600219726562,
      "text": " Abraham. It's important that we know as we interpret Scripture with Scripture and"
    },
    {
      "id": 77,
      "start": 1007.4600219726562,
      "end": 1011.02001953125,
      "text": " Galatians chapter number three. I'm not planning to go back to the book of"
    },
    {
      "id": 78,
      "start": 1011.02001953125,
      "end": 1014.6600341796875,
      "text": " Genesis, so you don't need to go there or keep your place there, but look over in"
    },
    {
      "id": 79,
      "start": 1014.6600341796875,
      "end": 1018.2600402832031,
      "text": " Galatians chapter number three, if you will, because I want to speak to you"
    },
    {
      "id": 80,
      "start": 1018.2600402832031,
      "end": 1024.0600280761719,
      "text": " about this promise of a seed. Yes, there's a promise of seed and land, but we find"
    },
    {
      "id": 81,
      "start": 1024.0600280761719,
      "end": 1028.8600158691406,
      "text": " that as we consider the example of Abraham here, as we make the transition"
    },
    {
      "id": 82,
      "start": 1028.8600158691406,
      "end": 1035.0400390625,
      "text": " between using an example and then giving the believers some instruction, as we"
    },
    {
      "id": 83,
      "start": 1035.0400390625,
      "end": 1038.9200134277344,
      "text": " find in the next several verses of Hebrews 6, we find that it's important"
    },
    {
      "id": 84,
      "start": 1038.9200134277344,
      "end": 1043.52001953125,
      "text": " that we understand that we would be the ones that are referenced there in verse"
    },
    {
      "id": 85,
      "start": 1043.52001953125,
      "end": 1047.7200317382812,
      "text": " 17 of Hebrews 6, unto the heirs of promise. Notice in Galatians 3,"
    },
    {
      "id": 86,
      "start": 1047.7200317382812,
      "end": 1053.8400268554688,
      "text": " in verse number 6, even as Abraham believed God and it was accounted to him"
    },
    {
      "id": 87,
      "start": 1053.8400268554688,
      "end": 1059.0400390625,
      "text": " for righteousness, know you therefore that they which are of faith, the same"
    },
    {
      "id": 88,
      "start": 1059.0400390625,
      "end": 1064.0000305175781,
      "text": " are the children of Abraham. It says in verse number 8 in the Scripture, for"
    },
    {
      "id": 89,
      "start": 1064.0000305175781,
      "end": 1067.5600280761719,
      "text": " seeing that God would justify the heathen through faith, preached before"
    },
    {
      "id": 90,
      "start": 1067.5600280761719,
      "end": 1073.4800415039062,
      "text": " the gospel unto Abraham, saying, in thee shall all nations be blessed. So then"
    },
    {
      "id": 91,
      "start": 1073.4800415039062,
      "end": 1079.4400329589844,
      "text": " they which be of faith are blessed with faithful Abraham. For as many, verse 10,"
    },
    {
      "id": 92,
      "start": 1079.4400329589844,
      "end": 1084.0000305175781,
      "text": " as are of the works of the law are under the curse. For it is written, cursed is"
    },
    {
      "id": 93,
      "start": 1084.0000305175781,
      "end": 1088.0800170898438,
      "text": " every one that continueth not in all things which are written in the book of"
    },
    {
      "id": 94,
      "start": 1088.0800170898438,
      "end": 1093.6400146484375,
      "text": " the law to do them. But that no man is justified by the law in the sight of God."
    },
    {
      "id": 95,
      "start": 1093.7600402832031,
      "end": 1099.6800231933594,
      "text": " It is evident, for the just shall live by faith. And the law is not of faith, but"
    },
    {
      "id": 96,
      "start": 1099.6800231933594,
      "end": 1104.6000366210938,
      "text": " the man that doeth them shall live in them. Christ hath redeemed us from the"
    },
    {
      "id": 97,
      "start": 1104.6000366210938,
      "end": 1109.9200134277344,
      "text": " curse of the law, being made a curse for us. For it is written, cursed is everyone"
    },
    {
      "id": 98,
      "start": 1109.9200134277344,
      "end": 1115.2400512695312,
      "text": " that hangeth on a tree. Notice that the blessing of Abraham might come on the"
    },
    {
      "id": 99,
      "start": 1115.2400512695312,
      "end": 1121.2000122070312,
      "text": " Gentiles, how? Through Jesus Christ. That we might receive the promise of the"
    },
    {
      "id": 100,
      "start": 1121.2000122070312,
      "end": 1126.1600341796875,
      "text": " Spirit through faith. Brethren, I speak after the manner of men, though it be"
    },
    {
      "id": 101,
      "start": 1126.1600341796875,
      "end": 1130.8800048828125,
      "text": " but a man's covenant. Yet if it be confirmed, no man disannulleth or addeth"
    },
    {
      "id": 102,
      "start": 1130.8800048828125,
      "end": 1139.280029296875,
      "text": " thereto. Now to Abraham and his seed were the promise made. He sayeth not, and to"
    },
    {
      "id": 103,
      "start": 1139.280029296875,
      "end": 1150.0800170898438,
      "text": " seeds, as of many, but as of one. And to thy seed, which is Christ. And this I say,"
    },
    {
      "id": 104,
      "start": 1150.1200561523438,
      "end": 1154.2000122070312,
      "text": " that the covenant that was confirmed before of God and Christ, the law, which"
    },
    {
      "id": 105,
      "start": 1154.2000122070312,
      "end": 1159.5599975585938,
      "text": " was 430 years after, cannot disannul, that it should make the"
    },
    {
      "id": 106,
      "start": 1159.5599975585938,
      "end": 1163.4800415039062,
      "text": " promise of none effect. For if the inheritance be of the law, it is no more"
    },
    {
      "id": 107,
      "start": 1163.4800415039062,
      "end": 1169.4400024414062,
      "text": " of promise, but God gave it to Abraham, how? By promise. And so as we come to"
    },
    {
      "id": 108,
      "start": 1169.4400024414062,
      "end": 1174.3600463867188,
      "text": " Hebrews chapter number 6 and we see, for when God made promise to Abraham, and we"
    },
    {
      "id": 109,
      "start": 1174.3600463867188,
      "end": 1179.9200439453125,
      "text": " think about the truth of that which is being given to us here, and he gives us"
    },
    {
      "id": 110,
      "start": 1180.1600341796875,
      "end": 1185.6800537109375,
      "text": " the truth of Genesis 22, the truth of Genesis 15, and then the truth of"
    },
    {
      "id": 111,
      "start": 1185.6800537109375,
      "end": 1190.5599975585938,
      "text": " Galatians 3, as we put all of these things together and we understand the"
    },
    {
      "id": 112,
      "start": 1190.5599975585938,
      "end": 1197.5599975585938,
      "text": " example here of this one Abraham, that God had made promise to him. That"
    },
    {
      "id": 113,
      "start": 1197.5599975585938,
      "end": 1201.8800048828125,
      "text": " Abraham patiently endured, but then a"
    },
    {
      "id": 0,
      "start": 1201.8800048828125,
      "end": 1205.7600049972534,
      "text": " Abraham, as we find at the end of verse number 15, he obtained the promise."
    },
    {
      "id": 1,
      "start": 1205.7600049972534,
      "end": 1211.1200046539307,
      "text": " Of course, that son, Isaac, that was born, and of course, you follow the lineage, if"
    },
    {
      "id": 2,
      "start": 1211.1200046539307,
      "end": 1214.4800052642822,
      "text": " you will, and you see the seed being Christ."
    },
    {
      "id": 3,
      "start": 1214.4800052642822,
      "end": 1219.760004043579,
      "text": " It's interesting to note, as you study throughout the Old Testament, so many evils that are"
    },
    {
      "id": 4,
      "start": 1219.760004043579,
      "end": 1224.600004196167,
      "text": " given against the nation of Israel, and so many battles and people groups that come against"
    },
    {
      "id": 5,
      "start": 1224.600004196167,
      "end": 1230.760004043579,
      "text": " them, you find that throughout the history, that really what's happening is Satan is working"
    },
    {
      "id": 6,
      "start": 1230.760004043579,
      "end": 1235.0400047302246,
      "text": " to destroy the line that Messiah would come from."
    },
    {
      "id": 7,
      "start": 1235.0400047302246,
      "end": 1236.2800064086914,
      "text": " That's what you find."
    },
    {
      "id": 8,
      "start": 1236.2800064086914,
      "end": 1241.8000030517578,
      "text": " Why was it that Haman said, we're going to destroy all of the Jews?"
    },
    {
      "id": 9,
      "start": 1241.8000030517578,
      "end": 1243.0000038146973,
      "text": " Satan is working."
    },
    {
      "id": 10,
      "start": 1243.0000038146973,
      "end": 1248.8000030517578,
      "text": " See, there is an evil that is taking place in our world, even still today, and we understand"
    },
    {
      "id": 11,
      "start": 1248.8000030517578,
      "end": 1253.6400032043457,
      "text": " that we are engaged in spiritual battle, spiritual warfare."
    },
    {
      "id": 12,
      "start": 1253.6400032043457,
      "end": 1259.8000030517578,
      "text": " Far too often, what happens is we look at some person as being the enemy, instead of"
    },
    {
      "id": 13,
      "start": 1259.8000030517578,
      "end": 1262.3200035095215,
      "text": " us understanding who the true enemy is."
    },
    {
      "id": 14,
      "start": 1262.3200035095215,
      "end": 1267.8400039672852,
      "text": " I'm speaking as a child of God this morning, and as a child of God, we must understand"
    },
    {
      "id": 15,
      "start": 1267.8400039672852,
      "end": 1272.6000061035156,
      "text": " when there's, listen, you understand the devil wants to destroy your home, but you understand"
    },
    {
      "id": 16,
      "start": 1272.6000061035156,
      "end": 1275.7600021362305,
      "text": " that your wife or your husband isn't your enemy."
    },
    {
      "id": 17,
      "start": 1275.7600021362305,
      "end": 1277.0800018310547,
      "text": " Satan is the enemy."
    },
    {
      "id": 18,
      "start": 1277.0800018310547,
      "end": 1281.7200012207031,
      "text": " He's the one that wants to destroy your home, and we could use illustration after illustration,"
    },
    {
      "id": 19,
      "start": 1281.7200012207031,
      "end": 1286.8400039672852,
      "text": " example after example, but we find that as we would understand these things that had"
    },
    {
      "id": 20,
      "start": 1286.9600067138672,
      "end": 1292.520004272461,
      "text": " happened in the Old Testament, and how they come to pass, and we come to verse 17 of Hebrews"
    },
    {
      "id": 21,
      "start": 1292.520004272461,
      "end": 1293.520004272461,
      "text": " 6, and it says,"
    },
    {
      "id": 22,
      "start": 1293.520004272461,
      "end": 1300.8400039672852,
      "text": " Wherein God, willing more abundantly to show unto the, notice this, the heirs of promise,"
    },
    {
      "id": 23,
      "start": 1300.8400039672852,
      "end": 1305.860008239746,
      "text": " the immutability of his counsel, confirmed it by an oath."
    },
    {
      "id": 24,
      "start": 1305.860008239746,
      "end": 1309.8400039672852,
      "text": " The reality is that God didn't have to confirm anything by an oath."
    },
    {
      "id": 25,
      "start": 1309.8400039672852,
      "end": 1316.2000045776367,
      "text": " He did because it was human, it was part of the customs of humans to do that sort of thing."
    },
    {
      "id": 26,
      "start": 1316.2000045776367,
      "end": 1320.520004272461,
      "text": " Have you ever had somebody say, do you promise?"
    },
    {
      "id": 27,
      "start": 1320.520004272461,
      "end": 1326.0400085449219,
      "text": " You buy something, and you're going to sign something, you make this thing that you sign,"
    },
    {
      "id": 28,
      "start": 1326.0400085449219,
      "end": 1332.2799987792969,
      "text": " and you've entered into an agreement, a contract, it's binding, and there's all sorts of legal"
    },
    {
      "id": 29,
      "start": 1332.2799987792969,
      "end": 1339.2799987792969,
      "text": " language that is used in it to show you what the responsibilities of the parties are, and"
    },
    {
      "id": 30,
      "start": 1339.2799987792969,
      "end": 1343.6000061035156,
      "text": " we find that God, listen, his word is enough."
    },
    {
      "id": 31,
      "start": 1343.6000061035156,
      "end": 1351.1200103759766,
      "text": " But in order to show the sureness of his promise, he took this step, as we find in"
    },
    {
      "id": 32,
      "start": 1351.1200103759766,
      "end": 1353.4000091552734,
      "text": " verse 16 and 17, notice, he says,"
    },
    {
      "id": 33,
      "start": 1353.4000091552734,
      "end": 1358.8400115966797,
      "text": " For men verily swear by the greater, but remember, there is no one greater than God."
    },
    {
      "id": 34,
      "start": 1358.8400115966797,
      "end": 1365.2000122070312,
      "text": " He could not appeal to a greater power, he is the greatest power, but in order to help"
    },
    {
      "id": 35,
      "start": 1365.2000122070312,
      "end": 1372.520004272461,
      "text": " man understand, it says that an oath for confirmation is to them an end of all strife, wherein God,"
    },
    {
      "id": 36,
      "start": 1372.520004272461,
      "end": 1378.8400115966797,
      "text": " appealing more abundantly to show unto the heirs of promise, notice this, the immutability"
    },
    {
      "id": 37,
      "start": 1378.8400115966797,
      "end": 1381.4000091552734,
      "text": " of his counsel confirmed it, how?"
    },
    {
      "id": 38,
      "start": 1381.4000091552734,
      "end": 1382.4000091552734,
      "text": " By an oath."
    },
    {
      "id": 39,
      "start": 1382.4000091552734,
      "end": 1387.7200012207031,
      "text": " You read the end of Genesis chapter number 15, Abraham sleeping, when it passes through"
    },
    {
      "id": 40,
      "start": 1387.7200012207031,
      "end": 1395.0400085449219,
      "text": " the animals that have been set apart, and you see the reality of God making this promise,"
    },
    {
      "id": 41,
      "start": 1395.0400085449219,
      "end": 1401.6000061035156,
      "text": " and he says in verse 18 that by two immutable things, that word immutable, unchanging, right?"
    },
    {
      "id": 42,
      "start": 1401.6800079345703,
      "end": 1406.0800018310547,
      "text": " When we speak about the immutability of God, I'm so thankful that our God is the same yesterday"
    },
    {
      "id": 43,
      "start": 1406.0800018310547,
      "end": 1408.4400024414062,
      "text": " and today and forever."
    },
    {
      "id": 44,
      "start": 1408.4400024414062,
      "end": 1412.9199981689453,
      "text": " He said in Malachi, I am the Lord, I change not."
    },
    {
      "id": 45,
      "start": 1412.9199981689453,
      "end": 1414.8000030517578,
      "text": " We can't say that, amen?"
    },
    {
      "id": 46,
      "start": 1414.8000030517578,
      "end": 1418.4000091552734,
      "text": " We change sometimes multiple times in the same day, amen?"
    },
    {
      "id": 47,
      "start": 1418.4000091552734,
      "end": 1422.2799987792969,
      "text": " I mean, sometimes we have good days, sometimes we have bad days, sometimes we have good moments"
    },
    {
      "id": 48,
      "start": 1422.2799987792969,
      "end": 1428.8400115966797,
      "text": " and we have bad moments, but God doesn't change, he is the same, and we find that it says that"
    },
    {
      "id": 49,
      "start": 1428.8400115966797,
      "end": 1436.0800018310547,
      "text": " by two immutable things, notice, in which it was impossible for God to lie."
    },
    {
      "id": 50,
      "start": 1436.0800018310547,
      "end": 1440.0800018310547,
      "text": " Paul mentioned this to Titus in Titus 1, you don't need to turn there, I'll read it to"
    },
    {
      "id": 51,
      "start": 1440.0800018310547,
      "end": 1444.4800109863281,
      "text": " you, but in verse number 2 it says, in hope of eternal life, which God that cannot lie"
    },
    {
      "id": 52,
      "start": 1444.4800109863281,
      "end": 1450.4400024414062,
      "text": " promised before the world began."
    },
    {
      "id": 53,
      "start": 1450.4400024414062,
      "end": 1454.520004272461,
      "text": " Our God cannot lie, he's not a man that he should lie, remember the situation in Numbers"
    },
    {
      "id": 54,
      "start": 1454.520004272461,
      "end": 1457.6000061035156,
      "text": " between Balaam and Balak?"
    },
    {
      "id": 55,
      "start": 1457.6000061035156,
      "end": 1463.0,
      "text": " And you understand our God, he is ever the same and he cannot lie."
    },
    {
      "id": 56,
      "start": 1463.0,
      "end": 1471.9599914550781,
      "text": " It says here that we might have a strong consolation, that word consolation, it means to comfort."
    },
    {
      "id": 57,
      "start": 1471.9599914550781,
      "end": 1477.6600036621094,
      "text": " In fact, it's the same word that's often used to refer to the Holy Spirit, the comforter."
    },
    {
      "id": 58,
      "start": 1477.6600036621094,
      "end": 1483.1799926757812,
      "text": " And what a joy to understand that he wants us to have this strong consolation, this comfort,"
    },
    {
      "id": 59,
      "start": 1483.1799926757812,
      "end": 1488.9800109863281,
      "text": " because he's given us these promises and he's proven the surety of the promise."
    },
    {
      "id": 60,
      "start": 1488.9800109863281,
      "end": 1496.8000183105469,
      "text": " It says this, who have fled for refuge to lay hold upon the hope set before us."
    },
    {
      "id": 61,
      "start": 1496.8000183105469,
      "end": 1500.760009765625,
      "text": " Now we find that he's speaking about the heirs of promise."
    },
    {
      "id": 62,
      "start": 1500.760009765625,
      "end": 1504.7000122070312,
      "text": " We understand as we look at Galatians chapter number 3 that he's speaking about those that"
    },
    {
      "id": 63,
      "start": 1504.7000122070312,
      "end": 1510.0599975585938,
      "text": " are redeemed, those that have trusted the Lord Jesus Christ as their personal Savior."
    },
    {
      "id": 64,
      "start": 1510.0599975585938,
      "end": 1513.8999938964844,
      "text": " And we find that it's interesting that in the passage of Scripture in Galatians chapter"
    },
    {
      "id": 65,
      "start": 1513.8999938964844,
      "end": 1521.5800170898438,
      "text": " number 3, he's speaking of course to Gentiles and he makes it known here that the blessing"
    },
    {
      "id": 66,
      "start": 1521.5800170898438,
      "end": 1526.2200012207031,
      "text": " of Abraham might come on the Gentiles through Jesus Christ."
    },
    {
      "id": 67,
      "start": 1526.2200012207031,
      "end": 1528.9800109863281,
      "text": " Isn't that wonderful?"
    },
    {
      "id": 68,
      "start": 1528.9800109863281,
      "end": 1530.4200134277344,
      "text": " Salvation through Christ."
    },
    {
      "id": 69,
      "start": 1530.4200134277344,
      "end": 1531.4200134277344,
      "text": " It's the only way."
    },
    {
      "id": 70,
      "start": 1531.4200134277344,
      "end": 1535.1799926757812,
      "text": " We sang about what a glory I'm saved, right?"
    },
    {
      "id": 71,
      "start": 1535.1799926757812,
      "end": 1536.3000183105469,
      "text": " Saved, saved, what a blessing."
    },
    {
      "id": 72,
      "start": 1536.3000183105469,
      "end": 1537.3000183105469,
      "text": " I'm saved how?"
    },
    {
      "id": 73,
      "start": 1537.3000183105469,
      "end": 1540.1000061035156,
      "text": " By the blood of the crucified one."
    },
    {
      "id": 74,
      "start": 1540.1000061035156,
      "end": 1542.2200012207031,
      "text": " It's the only way to be saved."
    },
    {
      "id": 75,
      "start": 1542.2200012207031,
      "end": 1546.7000122070312,
      "text": " I've often said, and I don't want to get into all that's going on in our nation today, but"
    },
    {
      "id": 76,
      "start": 1546.7000122070312,
      "end": 1549.0599975585938,
      "text": " there's great division that is going on."
    },
    {
      "id": 77,
      "start": 1549.0599975585938,
      "end": 1554.1400146484375,
      "text": " And I've often said throughout the years of ministry as I study the Word of God and I"
    },
    {
      "id": 78,
      "start": 1554.1400146484375,
      "end": 1560.1400146484375,
      "text": " understand the truth of God's Word, that the Word of God, that Jesus Christ, the Gospel"
    },
    {
      "id": 79,
      "start": 1560.1400146484375,
      "end": 1564.02001953125,
      "text": " of Jesus Christ is the answer to man's problem."
    },
    {
      "id": 80,
      "start": 1564.02001953125,
      "end": 1569.2200012207031,
      "text": " There's so many problems in our nation today, divisions that are man-made, by the way."
    },
    {
      "id": 81,
      "start": 1569.2200012207031,
      "end": 1574.3000183105469,
      "text": " And we find that those divisions that are man-made, we find that the Gospel is the healer."
    },
    {
      "id": 82,
      "start": 1574.3000183105469,
      "end": 1575.3000183105469,
      "text": " Why?"
    },
    {
      "id": 83,
      "start": 1575.3000183105469,
      "end": 1579.5800170898438,
      "text": " Because there's really only two categories of people, saved and lost."
    },
    {
      "id": 84,
      "start": 1579.5800170898438,
      "end": 1580.5800170898438,
      "text": " That's it."
    },
    {
      "id": 85,
      "start": 1580.5800170898438,
      "end": 1581.5800170898438,
      "text": " Amen?"
    },
    {
      "id": 86,
      "start": 1581.5800170898438,
      "end": 1587.1400146484375,
      "text": " And we understand that as God has given us His Word and as He's speaking here, He's writing"
    },
    {
      "id": 87,
      "start": 1587.1400146484375,
      "end": 1592.7799987792969,
      "text": " to these believers and we take in context the entirety of this warning passage."
    },
    {
      "id": 88,
      "start": 1592.7799987792969,
      "end": 1596.739990234375,
      "text": " And He says, listen, I'm going to confront you on your spiritual immaturity."
    },
    {
      "id": 89,
      "start": 1596.739990234375,
      "end": 1602.02001953125,
      "text": " I'm going to challenge you to spiritual maturity that you would grow, that you would go on"
    },
    {
      "id": 90,
      "start": 1602.02001953125,
      "end": 1603.02001953125,
      "text": " to perfection."
    },
    {
      "id": 91,
      "start": 1603.02001953125,
      "end": 1608.4599914550781,
      "text": " I'm going to share with you the evidences that ought to be in your life that would prove"
    },
    {
      "id": 92,
      "start": 1608.4599914550781,
      "end": 1613.8600158691406,
      "text": " your salvation, that would prove your sanctification, and I want to encourage you to endure."
    },
    {
      "id": 93,
      "start": 1613.8600158691406,
      "end": 1618.4599914550781,
      "text": " See, the reality is that, as I mentioned at the very beginning of our study of the book"
    },
    {
      "id": 94,
      "start": 1618.4599914550781,
      "end": 1624.739990234375,
      "text": " of Hebrews, the book is written to people that are ready to go back to Judaism."
    },
    {
      "id": 95,
      "start": 1624.739990234375,
      "end": 1626.3800048828125,
      "text": " They're looking to go back."
    },
    {
      "id": 96,
      "start": 1626.3800048828125,
      "end": 1631.4599914550781,
      "text": " Remember in John chapter number six when Jesus is speaking there and all of those disciples"
    },
    {
      "id": 97,
      "start": 1631.4599914550781,
      "end": 1636.0400085449219,
      "text": " that had followed Him, they went away and Jesus says, are you going to go also?"
    },
    {
      "id": 98,
      "start": 1636.0400085449219,
      "end": 1640.6600036621094,
      "text": " And Peter stands up and says this, to whom shall we go?"
    },
    {
      "id": 99,
      "start": 1640.6600036621094,
      "end": 1647.3000183105469,
      "text": " He says that we know that thou art the Christ and that you have the words of eternal life."
    },
    {
      "id": 100,
      "start": 1647.3399963378906,
      "end": 1651.9400024414062,
      "text": " And so we find that the writer of Hebrews is seeking to encourage these individuals."
    },
    {
      "id": 101,
      "start": 1651.9400024414062,
      "end": 1654.0599975585938,
      "text": " Listen, they have been given promises."
    },
    {
      "id": 102,
      "start": 1654.0599975585938,
      "end": 1656.9800109863281,
      "text": " We have been given promises."
    },
    {
      "id": 103,
      "start": 1656.9800109863281,
      "end": 1661.52001953125,
      "text": " Standing on the promises, we sing the song, we rejoice in the promises of God."
    },
    {
      "id": 104,
      "start": 1661.52001953125,
      "end": 1666.4200134277344,
      "text": " Can I tell you that for the child of God, we've not received every promise that's been"
    },
    {
      "id": 105,
      "start": 1666.4200134277344,
      "end": 1667.8200073242188,
      "text": " made to us."
    },
    {
      "id": 106,
      "start": 1667.8200073242188,
      "end": 1669.9400024414062,
      "text": " I'm not yet in heaven, amen?"
    },
    {
      "id": 107,
      "start": 1669.9400024414062,
      "end": 1674.0599975585938,
      "text": " This world is not my home, I'm just a passing through."
    },
    {
      "id": 108,
      "start": 1674.0599975585938,
      "end": 1676.8600158691406,
      "text": " I have the promise that Christ is going to return."
    },
    {
      "id": 109,
      "start": 1676.8600158691406,
      "end": 1679.5599975585938,
      "text": " I have the promise that I will be with Him forever."
    },
    {
      "id": 110,
      "start": 1679.5599975585938,
      "end": 1685.4200134277344,
      "text": " But as we go through life, as these believers had received promise, He gives them the example"
    },
    {
      "id": 111,
      "start": 1685.4200134277344,
      "end": 1686.4200134277344,
      "text": " of Abraham."
    },
    {
      "id": 112,
      "start": 1686.4200134277344,
      "end": 1687.4200134277344,
      "text": " Why?"
    },
    {
      "id": 113,
      "start": 1687.4200134277344,
      "end": 1690.1799926757812,
      "text": " He received a promise but he didn't get it immediately."
    },
    {
      "id": 114,
      "start": 1690.1799926757812,
      "end": 1691.1799926757812,
      "text": " He endured."
    },
    {
      "id": 115,
      "start": 1691.1799926757812,
      "end": 1693.02001953125,
      "text": " And he endured how?"
    },
    {
      "id": 116,
      "start": 1693.02001953125,
      "end": 1694.6199951171875,
      "text": " With patience."
    },
    {
      "id": 117,
      "start": 1694.6199951171875,
      "end": 1696.8200073242188,
      "text": " And then he obtained the promise."
    },
    {
      "id": 118,
      "start": 1696.8200073242188,
      "end": 1703.9800109863281,
      "text": " And so we find that he's reminding these believers on how they need to continue and to endure."
    },
    {
      "id": 119,
      "start": 1704.0599975585938,
      "end": 1708.8200073242188,
      "text": " So we've seen, first of all, notice the example of Abraham, number 2, in verses 17-20."
    },
    {
      "id": 120,
      "start": 1708.8200073242188,
      "end": 1712.2200012207031,
      "text": " Notice the expectation of the redeemed."
    },
    {
      "id": 121,
      "start": 1712.2200012207031,
      "end": 1715.4000244140625,
      "text": " The word hope is used in this passage of Scripture."
    },
    {
      "id": 122,
      "start": 1715.4000244140625,
      "end": 1721.0999755859375,
      "text": " In verse 18, again in verse number 19, we see the word hope that is used and we understand"
    },
    {
      "id": 123,
      "start": 1721.0999755859375,
      "end": 1730.0599975585938,
      "text": " biblically speaking that the word hope, it's an expectation based upon God's gracious promises."
    },
    {
      "id": 124,
      "start": 1730.0599975585938,
      "end": 1732.780029296875,
      "text": " Hope is confidence."
    },
    {
      "id": 125,
      "start": 1732.780029296875,
      "end": 1734.97998046875,
      "text": " It's an expectation."
    },
    {
      "id": 126,
      "start": 1734.97998046875,
      "end": 1740.5399780273438,
      "text": " It's not like we so frequently use the word in our daily language today when we speak"
    },
    {
      "id": 127,
      "start": 1740.5399780273438,
      "end": 1743.5,
      "text": " about hoping for this or hoping for that."
    },
    {
      "id": 128,
      "start": 1743.5,
      "end": 1748.8599853515625,
      "text": " But we find that when we deal with biblical hope, it is an expectation that is based upon"
    },
    {
      "id": 129,
      "start": 1748.8599853515625,
      "end": 1751.239990234375,
      "text": " God's gracious promises."
    },
    {
      "id": 130,
      "start": 1751.239990234375,
      "end": 1752.5800170898438,
      "text": " I have this hope."
    },
    {
      "id": 131,
      "start": 1752.5800170898438,
      "end": 1756.4600219726562,
      "text": " We speak about the blessed hope that Paul refers to in Titus."
    },
    {
      "id": 132,
      "start": 1756.4600219726562,
      "end": 1757.4600219726562,
      "text": " What is he speaking about?"
    },
    {
      "id": 133,
      "start": 1757.4600219726562,
      "end": 1759.5399780273438,
      "text": " The return of the Lord Jesus Christ."
    },
    {
      "id": 134,
      "start": 1759.5399780273438,
      "end": 1761.0999755859375,
      "text": " It is an expectation."
    },
    {
      "id": 135,
      "start": 1761.0999755859375,
      "end": 1765.9400024414062,
      "text": " There is a confidence that we have as God's people that He is going to return."
    },
    {
      "id": 136,
      "start": 1765.9400024414062,
      "end": 1766.9400024414062,
      "text": " Why?"
    },
    {
      "id": 137,
      "start": 1766.9400024414062,
      "end": 1767.9400024414062,
      "text": " Because He said He would."
    },
    {
      "id": 138,
      "start": 1767.9400024414062,
      "end": 1770.5,
      "text": " And He's not slack concerning His promise."
    },
    {
      "id": 139,
      "start": 1770.5,
      "end": 1773.0999755859375,
      "text": " And what a blessing it is for us to understand that."
    },
    {
      "id": 140,
      "start": 1773.0999755859375,
      "end": 1777.3400268554688,
      "text": " We find that He says, as I've mentioned already there in verse number 18, that we might have"
    },
    {
      "id": 141,
      "start": 1777.3400268554688,
      "end": 1779.5800170898438,
      "text": " strong consolation."
    },
    {
      "id": 142,
      "start": 1779.5800170898438,
      "end": 1784.9000244140625,
      "text": " And so we find that the recipients are given this word of comfort, of consolation, and"
    },
    {
      "id": 143,
      "start": 1784.9000244140625,
      "end": 1790.6199951171875,
      "text": " we find that they are given this promise and it's being explained to them that they could"
    },
    {
      "id": 144,
      "start": 1790.6199951171875,
      "end": 1794.02001953125,
      "text": " have an expectation."
    },
    {
      "id": 145,
      "start": 1794.02001953125,
      "end": 1798.1799926757812,
      "text": " I'm so glad that this world is not all that there is for us."
    },
    {
      "id": 146,
      "start": 1798.1799926757812,
      "end": 1799.1799926757812,
      "text": " Amen?"
    },
    {
      "id": 147,
      "start": 1799.1799926757812,
      "end": 1800.9400024414062,
      "text": " There's so much more."
    },
    {
      "id": 0,
      "start": 1800.9400024414062,
      "end": 1805.3400025367737,
      "text": " And we find that the expectation is really illustrated in a few ways"
    },
    {
      "id": 1,
      "start": 1805.3400025367737,
      "end": 1806.8600025177002,
      "text": " here in the passage of Scripture."
    },
    {
      "id": 2,
      "start": 1806.8600025177002,
      "end": 1809.580002784729,
      "text": " Notice at the end of verse number 18, it says this,"
    },
    {
      "id": 3,
      "start": 1809.580002784729,
      "end": 1814.7800025939941,
      "text": " we might have a strong consolation who have fled for refuge"
    },
    {
      "id": 4,
      "start": 1814.7800025939941,
      "end": 1819.7400016784668,
      "text": " to lay hold upon the hope set before us."
    },
    {
      "id": 5,
      "start": 1819.7400016784668,
      "end": 1824.620002746582,
      "text": " I want to remind you this morning that God is our refuge."
    },
    {
      "id": 6,
      "start": 1824.620002746582,
      "end": 1826.540002822876,
      "text": " He's our refuge."
    },
    {
      "id": 7,
      "start": 1826.540002822876,
      "end": 1831.5800018310547,
      "text": " In fact, the psalmist often cried out a verse that we dealt with,"
    },
    {
      "id": 8,
      "start": 1831.5800018310547,
      "end": 1834.2200012207031,
      "text": " really a psalm that we dealt with a couple of months ago"
    },
    {
      "id": 9,
      "start": 1834.2200012207031,
      "end": 1835.6600036621094,
      "text": " in one of our prayer meetings."
    },
    {
      "id": 10,
      "start": 1835.6600036621094,
      "end": 1838.1400032043457,
      "text": " In Psalm 46, in verse number 1,"
    },
    {
      "id": 11,
      "start": 1838.1400032043457,
      "end": 1847.3400039672852,
      "text": " God is our refuge and strength, a very present help in trouble."
    },
    {
      "id": 12,
      "start": 1847.3400039672852,
      "end": 1849.2600021362305,
      "text": " He continues in verse 2 and says,"
    },
    {
      "id": 13,
      "start": 1849.2600021362305,
      "end": 1852.3800010681152,
      "text": " Therefore will not we fear, though the earth be removed"
    },
    {
      "id": 14,
      "start": 1852.3800010681152,
      "end": 1855.1000022888184,
      "text": " and though the mountains be carried into the midst of the sea,"
    },
    {
      "id": 15,
      "start": 1855.1000022888184,
      "end": 1857.3400039672852,
      "text": " though the waters thereof roar and be troubled,"
    },
    {
      "id": 16,
      "start": 1857.3400039672852,
      "end": 1860.3800010681152,
      "text": " though the mountains shake with the swelling thereof."
    },
    {
      "id": 17,
      "start": 1861.1000022888184,
      "end": 1861.6600036621094,
      "text": " Selah."
    },
    {
      "id": 18,
      "start": 1862.2200012207031,
      "end": 1863.5800018310547,
      "text": " See, God is our refuge."
    },
    {
      "id": 19,
      "start": 1864.7000007629395,
      "end": 1867.1800003051758,
      "text": " And we find this picture that is given,"
    },
    {
      "id": 20,
      "start": 1867.1800003051758,
      "end": 1870.4599990844727,
      "text": " we'd be reminded of what the psalmist said,"
    },
    {
      "id": 21,
      "start": 1870.4599990844727,
      "end": 1875.740005493164,
      "text": " but we'd also understand of that which is in view here,"
    },
    {
      "id": 22,
      "start": 1875.740005493164,
      "end": 1879.1000061035156,
      "text": " really, we think about the cities of refuge."
    },
    {
      "id": 23,
      "start": 1879.1000061035156,
      "end": 1881.9800033569336,
      "text": " We haven't quite gotten there yet in our study of the book of Joshua,"
    },
    {
      "id": 24,
      "start": 1881.9800033569336,
      "end": 1883.6600036621094,
      "text": " but as we get through the book of Joshua,"
    },
    {
      "id": 25,
      "start": 1883.740005493164,
      "end": 1885.8199996948242,
      "text": " you understand as the land is divided"
    },
    {
      "id": 26,
      "start": 1885.8199996948242,
      "end": 1888.3800048828125,
      "text": " and the tribes receive their inheritance,"
    },
    {
      "id": 27,
      "start": 1888.3800048828125,
      "end": 1889.9800033569336,
      "text": " that there are cities of refuge."
    },
    {
      "id": 28,
      "start": 1889.9800033569336,
      "end": 1891.4200057983398,
      "text": " There were six of them,"
    },
    {
      "id": 29,
      "start": 1891.4200057983398,
      "end": 1893.1800003051758,
      "text": " three on the eastern side of the Jordan,"
    },
    {
      "id": 30,
      "start": 1893.1800003051758,
      "end": 1894.9400024414062,
      "text": " three on the western side of Jordan,"
    },
    {
      "id": 31,
      "start": 1894.9400024414062,
      "end": 1896.4599990844727,
      "text": " and they were strategically located"
    },
    {
      "id": 32,
      "start": 1896.4599990844727,
      "end": 1899.5800018310547,
      "text": " as God had instructed them to place those cities of refuge."
    },
    {
      "id": 33,
      "start": 1899.5800018310547,
      "end": 1903.8199996948242,
      "text": " It was interesting, if someone would kill somebody unawares,"
    },
    {
      "id": 34,
      "start": 1903.8199996948242,
      "end": 1905.9800033569336,
      "text": " it was not a premeditated murder,"
    },
    {
      "id": 35,
      "start": 1905.9800033569336,
      "end": 1907.4200057983398,
      "text": " it was some type of an accident,"
    },
    {
      "id": 36,
      "start": 1907.4200057983398,
      "end": 1910.5400009155273,
      "text": " they could flee to a city of refuge,"
    },
    {
      "id": 37,
      "start": 1910.5400009155273,
      "end": 1912.3800048828125,
      "text": " and as they would flee to the city of refuge,"
    },
    {
      "id": 38,
      "start": 1912.3800048828125,
      "end": 1915.5800018310547,
      "text": " they would have security within that city."
    },
    {
      "id": 39,
      "start": 1916.7799987792969,
      "end": 1919.2600021362305,
      "text": " The people of that city had a responsibility"
    },
    {
      "id": 40,
      "start": 1919.2600021362305,
      "end": 1923.6600036621094,
      "text": " to provide a refuge, a place of safety for them,"
    },
    {
      "id": 41,
      "start": 1923.6600036621094,
      "end": 1925.020004272461,
      "text": " and you find there would be a hearing"
    },
    {
      "id": 42,
      "start": 1925.020004272461,
      "end": 1926.4599990844727,
      "text": " and all sorts of things that would go on,"
    },
    {
      "id": 43,
      "start": 1926.4599990844727,
      "end": 1927.9800033569336,
      "text": " if they were guilty, then they were guilty,"
    },
    {
      "id": 44,
      "start": 1927.9800033569336,
      "end": 1929.260009765625,
      "text": " they'd be put to death if it was,"
    },
    {
      "id": 45,
      "start": 1929.8200073242188,
      "end": 1932.3000030517578,
      "text": " in fact, a premeditated type of a thing."
    },
    {
      "id": 46,
      "start": 1932.3000030517578,
      "end": 1935.4199981689453,
      "text": " But we find that if it truly was an accident,"
    },
    {
      "id": 47,
      "start": 1935.4199981689453,
      "end": 1937.6600036621094,
      "text": " that they'd have to stay there until when?"
    },
    {
      "id": 48,
      "start": 1938.6199951171875,
      "end": 1940.3800048828125,
      "text": " The death of the priest."
    },
    {
      "id": 49,
      "start": 1941.1800079345703,
      "end": 1944.2200012207031,
      "text": " And when the priest died, they could return back."
    },
    {
      "id": 50,
      "start": 1944.7799987792969,
      "end": 1947.9000091552734,
      "text": " Now, it's interesting because God is our refuge,"
    },
    {
      "id": 51,
      "start": 1947.9000091552734,
      "end": 1950.6199951171875,
      "text": " the Lord Jesus Christ is our refuge,"
    },
    {
      "id": 52,
      "start": 1950.6199951171875,
      "end": 1953.020004272461,
      "text": " and as we've often mentioned,"
    },
    {
      "id": 53,
      "start": 1953.020004272461,
      "end": 1955.4199981689453,
      "text": " and we'll get into even more of this"
    },
    {
      "id": 54,
      "start": 1955.4199981689453,
      "end": 1958.0599975585938,
      "text": " as we've spoken about the death of our Savior,"
    },
    {
      "id": 55,
      "start": 1958.0599975585938,
      "end": 1960.2200012207031,
      "text": " our high priest, but he rose again."
    },
    {
      "id": 56,
      "start": 1960.8600006103516,
      "end": 1963.5800018310547,
      "text": " He conquered sin, death, and the grave."
    },
    {
      "id": 57,
      "start": 1963.5800018310547,
      "end": 1967.4199981689453,
      "text": " We referenced in chapter number seven a few weeks ago"
    },
    {
      "id": 58,
      "start": 1967.4199981689453,
      "end": 1971.1800079345703,
      "text": " how that he has this unchangeable priesthood."
    },
    {
      "id": 59,
      "start": 1971.1800079345703,
      "end": 1971.6600036621094,
      "text": " Why?"
    },
    {
      "id": 60,
      "start": 1971.6600036621094,
      "end": 1973.6600036621094,
      "text": " Because he continueth ever."
    },
    {
      "id": 61,
      "start": 1974.5400085449219,
      "end": 1978.3000030517578,
      "text": " And we find here that God is our refuge,"
    },
    {
      "id": 62,
      "start": 1978.3000030517578,
      "end": 1980.3800048828125,
      "text": " and what a joy to understand that."
    },
    {
      "id": 63,
      "start": 1980.3800048828125,
      "end": 1983.8200073242188,
      "text": " And the encouragement that's coming to these believers,"
    },
    {
      "id": 64,
      "start": 1983.8200073242188,
      "end": 1985.979995727539,
      "text": " he's saying, listen, there's an expectation"
    },
    {
      "id": 65,
      "start": 1985.979995727539,
      "end": 1988.8600006103516,
      "text": " that you ought to have as a redeemed person."
    },
    {
      "id": 66,
      "start": 1989.5,
      "end": 1991.5,
      "text": " And he speaks about God being our refuge."
    },
    {
      "id": 67,
      "start": 1991.5,
      "end": 1993.3399963378906,
      "text": " Number two, he speaks about the fact"
    },
    {
      "id": 68,
      "start": 1993.3399963378906,
      "end": 1995.5,
      "text": " that he, God, is our anchor."
    },
    {
      "id": 69,
      "start": 1996.4600067138672,
      "end": 1998.2200012207031,
      "text": " Notice in verse 19,"
    },
    {
      "id": 70,
      "start": 1998.2200012207031,
      "end": 2001.740005493164,
      "text": " which hope we have as an anchor of the soul,"
    },
    {
      "id": 71,
      "start": 2002.4600067138672,
      "end": 2004.1399993896484,
      "text": " both sure and steadfast,"
    },
    {
      "id": 72,
      "start": 2004.1399993896484,
      "end": 2008.3800048828125,
      "text": " in which entereth into that within the veil."
    },
    {
      "id": 73,
      "start": 2008.3800048828125,
      "end": 2009.3399963378906,
      "text": " Isn't that precious?"
    },
    {
      "id": 74,
      "start": 2009.9000091552734,
      "end": 2013.020004272461,
      "text": " We think about the fact that we have an anchor."
    },
    {
      "id": 75,
      "start": 2013.020004272461,
      "end": 2014.9400024414062,
      "text": " We use that as our title."
    },
    {
      "id": 76,
      "start": 2014.9400024414062,
      "end": 2017.4199981689453,
      "text": " We've read the words of the songwriter"
    },
    {
      "id": 77,
      "start": 2017.979995727539,
      "end": 2020.4600067138672,
      "text": " that he shared in penning those words,"
    },
    {
      "id": 78,
      "start": 2020.4600067138672,
      "end": 2023.5,
      "text": " no doubt inspired from this truth of Hebrews 6."
    },
    {
      "id": 79,
      "start": 2023.5800018310547,
      "end": 2024.9400024414062,
      "text": " In verse number 19,"
    },
    {
      "id": 80,
      "start": 2024.9400024414062,
      "end": 2028.3000030517578,
      "text": " and we'd understand that this anchor that we have,"
    },
    {
      "id": 81,
      "start": 2028.3000030517578,
      "end": 2029.5800018310547,
      "text": " this anchor of the soul,"
    },
    {
      "id": 82,
      "start": 2029.5800018310547,
      "end": 2031.5800018310547,
      "text": " that it's sure and steadfast,"
    },
    {
      "id": 83,
      "start": 2031.5800018310547,
      "end": 2033.1000061035156,
      "text": " but notice it says,"
    },
    {
      "id": 84,
      "start": 2033.1000061035156,
      "end": 2037.4199981689453,
      "text": " which entereth into that within the veil."
    },
    {
      "id": 85,
      "start": 2037.979995727539,
      "end": 2040.8600006103516,
      "text": " Remember, as we continue to use the example"
    },
    {
      "id": 86,
      "start": 2040.8600006103516,
      "end": 2043.740005493164,
      "text": " of all that's taking place of the priesthood"
    },
    {
      "id": 87,
      "start": 2043.740005493164,
      "end": 2044.8600006103516,
      "text": " and all of those things,"
    },
    {
      "id": 88,
      "start": 2044.8600006103516,
      "end": 2047.1000061035156,
      "text": " we find that in chapter number 14,"
    },
    {
      "id": 89,
      "start": 2047.1000061035156,
      "end": 2048.779998779297,
      "text": " and excuse me, in chapter number four,"
    },
    {
      "id": 90,
      "start": 2048.779998779297,
      "end": 2050.9400024414062,
      "text": " in verse number 14 of the book of Hebrews,"
    },
    {
      "id": 91,
      "start": 2050.9400024414062,
      "end": 2052.460006713867,
      "text": " that the writer says this,"
    },
    {
      "id": 92,
      "start": 2052.460006713867,
      "end": 2055.4199981689453,
      "text": " seeing then that we have a great high priest"
    },
    {
      "id": 93,
      "start": 2055.4199981689453,
      "end": 2057.260009765625,
      "text": " that is passed into the heavens,"
    },
    {
      "id": 94,
      "start": 2057.980010986328,
      "end": 2059.980010986328,
      "text": " Jesus, the son of God,"
    },
    {
      "id": 95,
      "start": 2059.980010986328,
      "end": 2062.540008544922,
      "text": " let us hold fast our profession."
    },
    {
      "id": 96,
      "start": 2064.0599975585938,
      "end": 2065.5,
      "text": " For we have not an high priest"
    },
    {
      "id": 97,
      "start": 2065.5,
      "end": 2067.6600036621094,
      "text": " which cannot be touched with the feeling of our infirmities,"
    },
    {
      "id": 98,
      "start": 2067.6600036621094,
      "end": 2069.8999938964844,
      "text": " but was in all points tempted like as we are,"
    },
    {
      "id": 99,
      "start": 2069.8999938964844,
      "end": 2071.8200073242188,
      "text": " yet without sin."
    },
    {
      "id": 100,
      "start": 2071.8200073242188,
      "end": 2076.220001220703,
      "text": " And we find that He, our Savior, our anchor,"
    },
    {
      "id": 101,
      "start": 2076.220001220703,
      "end": 2077.980010986328,
      "text": " the anchor of our soul,"
    },
    {
      "id": 102,
      "start": 2077.980010986328,
      "end": 2079.5,
      "text": " that it's sure and steadfast,"
    },
    {
      "id": 103,
      "start": 2079.5,
      "end": 2080.8600158691406,
      "text": " and that He is in heaven."
    },
    {
      "id": 104,
      "start": 2081.739990234375,
      "end": 2082.3800048828125,
      "text": " Right?"
    },
    {
      "id": 105,
      "start": 2082.3800048828125,
      "end": 2083.8200073242188,
      "text": " It's interesting about the priest."
    },
    {
      "id": 106,
      "start": 2083.8200073242188,
      "end": 2086.3800048828125,
      "text": " The priest could go and make offering for the people,"
    },
    {
      "id": 107,
      "start": 2087.1000061035156,
      "end": 2088.8600158691406,
      "text": " but he could not lead the people"
    },
    {
      "id": 108,
      "start": 2088.8600158691406,
      "end": 2091.5,
      "text": " into the place where the offering would be made."
    },
    {
      "id": 109,
      "start": 2092.3800048828125,
      "end": 2093.8200073242188,
      "text": " We find that Jesus,"
    },
    {
      "id": 110,
      "start": 2093.8200073242188,
      "end": 2097.739990234375,
      "text": " He entereth into that within the veil."
    },
    {
      "id": 111,
      "start": 2097.739990234375,
      "end": 2100.2999877929688,
      "text": " He is seated in the heavenlies."
    },
    {
      "id": 112,
      "start": 2100.2999877929688,
      "end": 2102.459991455078,
      "text": " We understand that He's sitting upon His throne."
    },
    {
      "id": 113,
      "start": 2102.459991455078,
      "end": 2105.019989013672,
      "text": " We understand that the Bible teaches us"
    },
    {
      "id": 114,
      "start": 2105.019989013672,
      "end": 2107.019989013672,
      "text": " in chapter number 10 of this same book,"
    },
    {
      "id": 115,
      "start": 2107.019989013672,
      "end": 2107.980010986328,
      "text": " in verse number 12,"
    },
    {
      "id": 116,
      "start": 2107.980010986328,
      "end": 2109.019989013672,
      "text": " but this man,"
    },
    {
      "id": 117,
      "start": 2109.019989013672,
      "end": 2111.8200073242188,
      "text": " after he'd offered one sacrifice for sins forever,"
    },
    {
      "id": 118,
      "start": 2111.8200073242188,
      "end": 2114.9400024414062,
      "text": " sat down on the right hand of God."
    },
    {
      "id": 119,
      "start": 2117.1000061035156,
      "end": 2118.1400146484375,
      "text": " He's our refuge."
    },
    {
      "id": 120,
      "start": 2118.779998779297,
      "end": 2119.739990234375,
      "text": " He's our anchor."
    },
    {
      "id": 121,
      "start": 2120.7000122070312,
      "end": 2122.459991455078,
      "text": " He is our forerunner."
    },
    {
      "id": 122,
      "start": 2122.459991455078,
      "end": 2123.739990234375,
      "text": " Notice in verse number 20,"
    },
    {
      "id": 123,
      "start": 2125.6600036621094,
      "end": 2126.7000122070312,
      "text": " the Bible says this,"
    },
    {
      "id": 124,
      "start": 2126.7000122070312,
      "end": 2129.980010986328,
      "text": " whither the forerunner is for us entered,"
    },
    {
      "id": 125,
      "start": 2130.6199951171875,
      "end": 2134.220001220703,
      "text": " even Jesus, made an high priest forever"
    },
    {
      "id": 126,
      "start": 2134.220001220703,
      "end": 2137.8999938964844,
      "text": " after the order of Melchizedek."
    },
    {
      "id": 127,
      "start": 2137.8999938964844,
      "end": 2139.8200073242188,
      "text": " As we think about the truth"
    },
    {
      "id": 128,
      "start": 2139.8200073242188,
      "end": 2141.8999938964844,
      "text": " that is given to us in verse number 20"
    },
    {
      "id": 129,
      "start": 2141.8999938964844,
      "end": 2144.779998779297,
      "text": " with regard to the usage of this word forerunner,"
    },
    {
      "id": 130,
      "start": 2144.779998779297,
      "end": 2146.0599975585938,
      "text": " it's an interesting word."
    },
    {
      "id": 131,
      "start": 2146.0599975585938,
      "end": 2150.220001220703,
      "text": " It means one who comes in advance to a place"
    },
    {
      "id": 132,
      "start": 2151.1799926757812,
      "end": 2153.260009765625,
      "text": " where the rest are to follow."
    },
    {
      "id": 133,
      "start": 2153.980010986328,
      "end": 2154.7000122070312,
      "text": " I like that."
    },
    {
      "id": 134,
      "start": 2155.4200134277344,
      "end": 2158.220001220703,
      "text": " One who comes in advance to a place"
    },
    {
      "id": 135,
      "start": 2159.739990234375,
      "end": 2162.220001220703,
      "text": " where the rest are to follow."
    },
    {
      "id": 136,
      "start": 2162.220001220703,
      "end": 2163.1799926757812,
      "text": " Where's that place?"
    },
    {
      "id": 137,
      "start": 2163.980010986328,
      "end": 2164.6199951171875,
      "text": " In heaven."
    },
    {
      "id": 138,
      "start": 2165.5,
      "end": 2165.8999938964844,
      "text": " It says,"
    },
    {
      "id": 139,
      "start": 2165.8999938964844,
      "end": 2168.1400146484375,
      "text": " in which entereth into that within the veil"
    },
    {
      "id": 140,
      "start": 2168.1400146484375,
      "end": 2169.5800170898438,
      "text": " at the end of verse number 19,"
    },
    {
      "id": 141,
      "start": 2169.5800170898438,
      "end": 2172.7000122070312,
      "text": " whither the forerunner is for us entered,"
    },
    {
      "id": 142,
      "start": 2172.7000122070312,
      "end": 2176.2999877929688,
      "text": " even Jesus, made an high priest forever"
    },
    {
      "id": 143,
      "start": 2176.2999877929688,
      "end": 2178.1400146484375,
      "text": " after the order of Melchizedek."
    },
    {
      "id": 144,
      "start": 2178.7000122070312,
      "end": 2180.7000122070312,
      "text": " As we look at the passage of Scripture"
    },
    {
      "id": 145,
      "start": 2180.7000122070312,
      "end": 2183.1000061035156,
      "text": " and we conclude the warning section"
    },
    {
      "id": 146,
      "start": 2183.1000061035156,
      "end": 2186.0599975585938,
      "text": " that is given to these Jewish believers,"
    },
    {
      "id": 147,
      "start": 2186.0599975585938,
      "end": 2187.8200073242188,
      "text": " again, a group of people that"
    },
    {
      "id": 148,
      "start": 2187.8200073242188,
      "end": 2189.8999938964844,
      "text": " because of the intense persecution,"
    },
    {
      "id": 149,
      "start": 2189.8999938964844,
      "end": 2191.8200073242188,
      "text": " because of all that they were dealing with,"
    },
    {
      "id": 150,
      "start": 2191.8200073242188,
      "end": 2194.8600158691406,
      "text": " because of the time in which they were living"
    },
    {
      "id": 151,
      "start": 2194.8600158691406,
      "end": 2196.2999877929688,
      "text": " and the temple was still standing"
    },
    {
      "id": 152,
      "start": 2196.2999877929688,
      "end": 2198.1400146484375,
      "text": " and sacrifices were still being made"
    },
    {
      "id": 153,
      "start": 2198.1400146484375,
      "end": 2199.739990234375,
      "text": " and they're dealing with all of those things"
    },
    {
      "id": 154,
      "start": 2199.739990234375,
      "end": 2202.6199951171875,
      "text": " and they were dealing with this level of persecution,"
    },
    {
      "id": 155,
      "start": 2202.6199951171875,
      "end": 2204.2999877929688,
      "text": " there was a thought on the mind"
    },
    {
      "id": 156,
      "start": 2204.2999877929688,
      "end": 2205.5,
      "text": " of some of these believers"
    },
    {
      "id": 157,
      "start": 2205.5,
      "end": 2207.5,
      "text": " that they would just return to Judaism."
    },
    {
      "id": 158,
      "start": 2208.540008544922,
      "end": 2210.7000122070312,
      "text": " And we find that the writer of Hebrews says,"
    },
    {
      "id": 159,
      "start": 2210.7000122070312,
      "end": 2213.1000061035156,
      "text": " no, Jesus is superior."
    },
    {
      "id": 160,
      "start": 2213.1000061035156,
      "end": 2215.8999938964844,
      "text": " He begins that immediately in chapter number one"
    },
    {
      "id": 161,
      "start": 2215.8999938964844,
      "end": 2218.220001220703,
      "text": " and he deals with how Christ is superior"
    },
    {
      "id": 162,
      "start": 2218.220001220703,
      "end": 2220.220001220703,
      "text": " throughout those first several chapters."
    },
    {
      "id": 163,
      "start": 2220.220001220703,
      "end": 2222.220001220703,
      "text": " And in this particular warning,"
    },
    {
      "id": 164,
      "start": 2222.220001220703,
      "end": 2226.0599975585938,
      "text": " as he's giving the expectation to these redeemed,"
    },
    {
      "id": 165,
      "start": 2226.0599975585938,
      "end": 2228.7000122070312,
      "text": " he's saying, listen, you need to understand something."
    },
    {
      "id": 166,
      "start": 2228.7000122070312,
      "end": 2231.3399963378906,
      "text": " Let me remind you of Abraham."
    },
    {
      "id": 167,
      "start": 2231.3399963378906,
      "end": 2234.6199951171875,
      "text": " Let me remind you how God made promise to Abraham,"
    },
    {
      "id": 168,
      "start": 2234.6199951171875,
      "end": 2237.019989013672,
      "text": " but he didn't receive it immediately."
    },
    {
      "id": 169,
      "start": 2237.019989013672,
      "end": 2240.8600158691406,
      "text": " And in like manner, as you have received promise,"
    },
    {
      "id": 170,
      "start": 2240.8600158691406,
      "end": 2245.1799926757812,
      "text": " you can be assured of the promise that God has made."
    },
    {
      "id": 171,
      "start": 2245.1799926757812,
      "end": 2249.1000061035156,
      "text": " You can stand on the promises of God's Word."
    },
    {
      "id": 172,
      "start": 2249.1799926757812,
      "end": 2249.6600036621094,
      "text": " Amen."
    },
    {
      "id": 173,
      "start": 2251.4200134277344,
      "end": 2253.739990234375,
      "text": " We find that Peter said that they were exceeding"
    },
    {
      "id": 174,
      "start": 2253.739990234375,
      "end": 2255.6600036621094,
      "text": " great and precious promises."
    },
    {
      "id": 175,
      "start": 2256.540008544922,
      "end": 2258.6199951171875,
      "text": " What a great truth that is given to us"
    },
    {
      "id": 176,
      "start": 2259.1799926757812,
      "end": 2261.6600036621094,
      "text": " with regard to that reference."
    },
    {
      "id": 177,
      "start": 2261.6600036621094,
      "end": 2264.220001220703,
      "text": " I see Peter making that statement"
    },
    {
      "id": 178,
      "start": 2264.220001220703,
      "end": 2265.5,
      "text": " and what a joy it is."
    },
    {
      "id": 179,
      "start": 2265.5,
      "end": 2268.2999877929688,
      "text": " We find that Paul said this in 2 Corinthians 1,"
    },
    {
      "id": 180,
      "start": 2268.2999877929688,
      "end": 2269.3399963378906,
      "text": " in verse number 20,"
    },
    {
      "id": 181,
      "start": 2269.3399963378906,
      "end": 2273.1799926757812,
      "text": " for all the promises of God in him are yea,"
    },
    {
      "id": 182,
      "start": 2273.8999938964844,
      "end": 2279.1799926757812,
      "text": " and in him amen unto the glory of God by us."
    },
    {
      "id": 183,
      "start": 2279.8999938964844,
      "end": 2281.8999938964844,
      "text": " But you don't understand my circumstances."
    },
    {
      "id": 184,
      "start": 2281.8999938964844,
      "end": 2283.3399963378906,
      "text": " You don't understand what I'm dealing with"
    },
    {
      "id": 185,
      "start": 2283.3399963378906,
      "end": 2285.1000061035156,
      "text": " and you don't know how hard it is."
    },
    {
      "id": 186,
      "start": 2285.1000061035156,
      "end": 2287.019989013672,
      "text": " These people were dealing with some very hard times."
    },
    {
      "id": 187,
      "start": 2288.6199951171875,
      "end": 2290.779998779297,
      "text": " What did the writer remind them of?"
    },
    {
      "id": 188,
      "start": 2290.779998779297,
      "end": 2291.8200073242188,
      "text": " Remember the promises."
    },
    {
      "id": 189,
      "start": 2293.019989013672,
      "end": 2294.8600158691406,
      "text": " Remember there's an expectant end."
    },
    {
      "id": 190,
      "start": 2295.5800170898438,
      "end": 2298.1400146484375,
      "text": " This world is not all there is to offer."
    },
    {
      "id": 191,
      "start": 2298.1400146484375,
      "end": 2300.6199951171875,
      "text": " Sometimes we get so caught up in the problems"
    },
    {
      "id": 192,
      "start": 2300.6199951171875,
      "end": 2302.3800048828125,
      "text": " and the affairs of this world"
    },
    {
      "id": 193,
      "start": 2302.3800048828125,
      "end": 2304.6199951171875,
      "text": " and we get underneath of them"
    },
    {
      "id": 194,
      "start": 2304.6199951171875,
      "end": 2306.6199951171875,
      "text": " and we get burdened down by them"
    },
    {
      "id": 195,
      "start": 2307.260009765625,
      "end": 2309.980010986328,
      "text": " and we get our eyes and our vision on those things."
    },
    {
      "id": 196,
      "start": 2309.980010986328,
      "end": 2311.5800170898438,
      "text": " And Paul said in that book,"
    },
    {
      "id": 197,
      "start": 2311.5800170898438,
      "end": 2312.7000122070312,
      "text": " 2 Corinthians chapter 4,"
    },
    {
      "id": 198,
      "start": 2312.7000122070312,
      "end": 2313.02001953125,
      "text": " he says,"
    },
    {
      "id": 199,
      "start": 2313.02001953125,
      "end": 2315.4199829101562,
      "text": " while we look not at the things which are temporal,"
    },
    {
      "id": 200,
      "start": 2315.4199829101562,
      "end": 2317.6599731445312,
      "text": " and in verse number 18 of that fourth chapter,"
    },
    {
      "id": 201,
      "start": 2317.6599731445312,
      "end": 2317.97998046875,
      "text": " he says,"
    },
    {
      "id": 202,
      "start": 2317.97998046875,
      "end": 2319.9000244140625,
      "text": " but things which are eternal."
    },
    {
      "id": 203,
      "start": 2319.9000244140625,
      "end": 2320.7000122070312,
      "text": " Amen."
    },
    {
      "id": 204,
      "start": 2320.7000122070312,
      "end": 2323.4199829101562,
      "text": " And the reality is that these believers"
    },
    {
      "id": 205,
      "start": 2323.4199829101562,
      "end": 2324.780029296875,
      "text": " who had been struggling,"
    },
    {
      "id": 206,
      "start": 2324.780029296875,
      "end": 2326.7000122070312,
      "text": " who were dealing with difficulty,"
    },
    {
      "id": 207,
      "start": 2326.7000122070312,
      "end": 2330.0599975585938,
      "text": " we find that the expectation of these believers"
    },
    {
      "id": 208,
      "start": 2330.0599975585938,
      "end": 2331.4199829101562,
      "text": " is illustrated for them"
    },
    {
      "id": 209,
      "start": 2331.4199829101562,
      "end": 2334.4600219726562,
      "text": " that we have that God is our refuge."
    },
    {
      "id": 210,
      "start": 2335.0999755859375,
      "end": 2338.8599853515625,
      "text": " That we have an anchor that it's sure and steadfast"
    },
    {
      "id": 211,
      "start": 2340.0599975585938,
      "end": 2341.8200073242188,
      "text": " that He's our forerunner."
    },
    {
      "id": 212,
      "start": 2341.8200073242188,
      "end": 2344.780029296875,
      "text": " That He's already gone to provide the way."
    },
    {
      "id": 213,
      "start": 2346.7000122070312,
      "end": 2348.7000122070312,
      "text": " The forerunner would be used often"
    },
    {
      "id": 214,
      "start": 2349.97998046875,
      "end": 2351.0999755859375,
      "text": " in a number of different ways."
    },
    {
      "id": 215,
      "start": 2351.0999755859375,
      "end": 2355.5800170898438,
      "text": " We use the military canvassing situation."
    },
    {
      "id": 216,
      "start": 2355.5800170898438,
      "end": 2357.5800170898438,
      "text": " He'd go before and if there were obstacles,"
    },
    {
      "id": 217,
      "start": 2357.5800170898438,
      "end": 2359.97998046875,
      "text": " if there were terrain difficulties,"
    },
    {
      "id": 218,
      "start": 2359.97998046875,
      "end": 2361.6599731445312,
      "text": " they would understand what was going on"
    },
    {
      "id": 219,
      "start": 2361.6599731445312,
      "end": 2364.5399780273438,
      "text": " and they would come back and provide direction"
    },
    {
      "id": 220,
      "start": 2364.5399780273438,
      "end": 2367.1799926757812,
      "text": " for how the rest of the group was to travel."
    },
    {
      "id": 221,
      "start": 2367.1799926757812,
      "end": 2369.0999755859375,
      "text": " And we find that as I've mentioned already,"
    },
    {
      "id": 222,
      "start": 2369.0999755859375,
      "end": 2370.3800048828125,
      "text": " the Old Testament priest,"
    },
    {
      "id": 223,
      "start": 2370.3800048828125,
      "end": 2373.1799926757812,
      "text": " he could not lead the people into the holy place,"
    },
    {
      "id": 224,
      "start": 2373.1799926757812,
      "end": 2377.02001953125,
      "text": " but we find that Jesus as our great high priest,"
    },
    {
      "id": 225,
      "start": 2377.02001953125,
      "end": 2379.5800170898438,
      "text": " that He in fact has made the way."
    },
    {
      "id": 226,
      "start": 2380.2999877929688,
      "end": 2382.6199951171875,
      "text": " Remember what Jesus said in John 14,"
    },
    {
      "id": 227,
      "start": 2382.6199951171875,
      "end": 2383.739990234375,
      "text": " in verse number 6,"
    },
    {
      "id": 228,
      "start": 2383.739990234375,
      "end": 2388.8599853515625,
      "text": " I am the way, the truth, and the life."
    },
    {
      "id": 229,
      "start": 2389.6599731445312,
      "end": 2393.5,
      "text": " No man cometh unto the Father, but by me."
    },
    {
      "id": 230,
      "start": 2394.0599975585938,
      "end": 2396.0599975585938,
      "text": " I'm so thankful that He made a way,"
    },
    {
      "id": 231,
      "start": 2396.0599975585938,
      "end": 2398.2999877929688,
      "text": " that He is the way."
    },
    {
      "id": 232,
      "start": 2399.02001953125,
      "end": 2400.780029296875,
      "text": " And these believers and..."
    },
    {
      "id": 0,
      "start": 2400.780029296875,
      "end": 2406.3400292396545,
      "text": " they could easily relate to Abraham and they could understand the struggles. I"
    },
    {
      "id": 1,
      "start": 2406.3400292396545,
      "end": 2410.98002910614,
      "text": " mean if you read from chapter 15 to chapter 21 and you read some of the"
    },
    {
      "id": 2,
      "start": 2410.98002910614,
      "end": 2415.3800296783447,
      "text": " things that took place and you read about the laughter and you read about"
    },
    {
      "id": 3,
      "start": 2415.3800296783447,
      "end": 2418.3800296783447,
      "text": " the situation with Ishmael and you read about all of those things and you"
    },
    {
      "id": 4,
      "start": 2418.3800296783447,
      "end": 2424.460029602051,
      "text": " understand what's taking place and as a Jewish believer you have this heritage"
    },
    {
      "id": 5,
      "start": 2424.460029602051,
      "end": 2429.5000286102295,
      "text": " as being the seed of Abraham physically speaking they could relate and"
    },
    {
      "id": 6,
      "start": 2429.5000286102295,
      "end": 2432.9800300598145,
      "text": " understand Abraham received a promise but he didn't obtain a promise"
    },
    {
      "id": 7,
      "start": 2432.9800300598145,
      "end": 2441.1400299072266,
      "text": " immediately he endured with patience and now as us as believers we understand the"
    },
    {
      "id": 8,
      "start": 2441.1400299072266,
      "end": 2446.460029602051,
      "text": " application from Galatians 3 that it's of that seed speaking spiritually"
    },
    {
      "id": 9,
      "start": 2446.460029602051,
      "end": 2453.380027770996,
      "text": " because it's through Christ and we are the heirs of promise we can rejoice this"
    },
    {
      "id": 10,
      "start": 2453.380027770996,
      "end": 2458.1400299072266,
      "text": " morning in the promises of God I don't know what difficulty or challenge you're"
    },
    {
      "id": 11,
      "start": 2458.1400299072266,
      "end": 2463.780029296875,
      "text": " dealing with but I do know that God's Word has the answer and I do know that"
    },
    {
      "id": 12,
      "start": 2463.780029296875,
      "end": 2471.2200317382812,
      "text": " God he will provide us with the strength that we need he will give us the grace"
    },
    {
      "id": 13,
      "start": 2471.2200317382812,
      "end": 2475.900032043457,
      "text": " remember what Paul said as he besought the Lord thrice in 2nd Corinthians"
    },
    {
      "id": 14,
      "start": 2475.900032043457,
      "end": 2480.5400314331055,
      "text": " chapter number 12 for that infirmity that he dealt with that thorn in his"
    },
    {
      "id": 15,
      "start": 2480.5400314331055,
      "end": 2486.500030517578,
      "text": " flesh and the Bible tells us that God replied and said no why because my grace"
    },
    {
      "id": 16,
      "start": 2486.500030517578,
      "end": 2494.4200286865234,
      "text": " is sufficient for thee I wonder this morning as we deal with things even as"
    },
    {
      "id": 17,
      "start": 2494.4200286865234,
      "end": 2499.580032348633,
      "text": " these believers in the first century that are receiving this book of Hebrews"
    },
    {
      "id": 18,
      "start": 2499.580032348633,
      "end": 2507.3000259399414,
      "text": " I wonder if there are times in which we struggle with the thought of can we go"
    },
    {
      "id": 19,
      "start": 2507.3000259399414,
      "end": 2512.4200286865234,
      "text": " any further I mean look at all of these obstacles and these challenges I'm"
    },
    {
      "id": 20,
      "start": 2512.4200286865234,
      "end": 2516.980026245117,
      "text": " dealing with can I remind you to turn to the promises of God can I remind you"
    },
    {
      "id": 21,
      "start": 2516.980026245117,
      "end": 2522.0200271606445,
      "text": " this morning that we are to endure can I remind you this morning that his grace"
    },
    {
      "id": 22,
      "start": 2522.0200271606445,
      "end": 2527.060028076172,
      "text": " is sufficient and I just wonder this morning in my life in your life have we"
    },
    {
      "id": 23,
      "start": 2527.060028076172,
      "end": 2533.820022583008,
      "text": " found it to be so have we found that his grace indeed is sufficient God is not a"
    },
    {
      "id": 24,
      "start": 2533.820022583008,
      "end": 2539.500030517578,
      "text": " liar he said that it would be sufficient and as we rest in him listen we sing the"
    },
    {
      "id": 25,
      "start": 2539.500030517578,
      "end": 2545.3800354003906,
      "text": " song amazing grace oh what a great song his grace is abundant toward me Paul's"
    },
    {
      "id": 26,
      "start": 2545.3800354003906,
      "end": 2552.9400329589844,
      "text": " testimony and this morning let us be reminded we have an anchor it's"
    },
    {
      "id": 27,
      "start": 2552.9400329589844,
      "end": 2558.9000244140625,
      "text": " illustrated that way at the end in verse 19 of Hebrews 6 and these believers that"
    },
    {
      "id": 28,
      "start": 2558.9000244140625,
      "end": 2563.820022583008,
      "text": " the writer is encouraging keep on go on to spiritual maturity don't give up"
    },
    {
      "id": 29,
      "start": 2563.820022583008,
      "end": 2569.3800354003906,
      "text": " don't turn back go on for us this morning let us keep our eyes on Jesus"
    },
    {
      "id": 30,
      "start": 2569.3800354003906,
      "end": 2576.3400268554688,
      "text": " let us endure with patience let us understand that his promises are sure"
    },
    {
      "id": 31,
      "start": 2576.3400268554688,
      "end": 2580.6200256347656,
      "text": " father we love you this morning we thank you for loving us we thank you for thy"
    },
    {
      "id": 32,
      "start": 2580.6200256347656,
      "end": 2584.500030517578,
      "text": " word the truth that's contained therein we thank you for the examples that you"
    },
    {
      "id": 33,
      "start": 2584.500030517578,
      "end": 2592.3400268554688,
      "text": " given us in your word we thank you for how this passage of Scripture this"
    },
    {
      "id": 34,
      "start": 2592.3400268554688,
      "end": 2601.780029296875,
      "text": " warning section for these believers how it concludes reminding these believers"
    },
    {
      "id": 35,
      "start": 2601.780029296875,
      "end": 2610.1000366210938,
      "text": " of the promises that have been given to us we're so thankful that this mortal"
    },
    {
      "id": 36,
      "start": 2610.1000366210938,
      "end": 2617.4200286865234,
      "text": " shall put on immortality that this world is not our home we have the promise and"
    },
    {
      "id": 37,
      "start": 2617.4200286865234,
      "end": 2621.580032348633,
      "text": " the certainty of heaven not because of our own righteousness but because of"
    },
    {
      "id": 38,
      "start": 2621.580032348633,
      "end": 2626.260025024414,
      "text": " redemption through the Lord Jesus Christ through the blood that was shed"
    },
    {
      "id": 39,
      "start": 2626.260025024414,
      "end": 2631.820022583008,
      "text": " through his death burial and glorious resurrection I pray this morning they"
    },
    {
      "id": 40,
      "start": 2631.820022583008,
      "end": 2636.300033569336,
      "text": " would help us to understand the expectation of the redeemed you'd help"
    },
    {
      "id": 41,
      "start": 2636.300033569336,
      "end": 2641.3800354003906,
      "text": " us to understand that though we deal with trials and obstacles and challenges"
    },
    {
      "id": 42,
      "start": 2641.3800354003906,
      "end": 2646.740036010742,
      "text": " in this world that this world is not my home help us to look on the eternal and"
    },
    {
      "id": 43,
      "start": 2646.740036010742,
      "end": 2653.1800231933594,
      "text": " not the temporal help us to rest in the fact that you are the way the truth and"
    },
    {
      "id": 44,
      "start": 2653.1800231933594,
      "end": 2658.780029296875,
      "text": " the life and that your grace indeed is sufficient if there's one that does not"
    },
    {
      "id": 45,
      "start": 2658.780029296875,
      "end": 2662.740020751953,
      "text": " know you as their personal Lord and Savior it's our prayer that today before"
    },
    {
      "id": 46,
      "start": 2662.740020751953,
      "end": 2667.2200317382812,
      "text": " it's eternally too late they would trust Christ as their Savior for those that"
    },
    {
      "id": 47,
      "start": 2667.2200317382812,
      "end": 2671.9400329589844,
      "text": " have been saved by the blood of the crucified one Lord I pray you'd help us"
    },
    {
      "id": 48,
      "start": 2671.9400329589844,
      "end": 2677.9400329589844,
      "text": " to be encouraged this morning knowing that just as Abraham had received"
    },
    {
      "id": 49,
      "start": 2677.9400329589844,
      "end": 2684.4600219726562,
      "text": " promise that he endured with patience and then he obtained the promise God"
    },
    {
      "id": 50,
      "start": 2684.4600219726562,
      "end": 2688.820037841797,
      "text": " would you help us to run a race we get to the twelfth chapter of this great"
    },
    {
      "id": 51,
      "start": 2688.820037841797,
      "end": 2695.780029296875,
      "text": " book we see that that's the instruction that is given race how with patience"
    },
    {
      "id": 52,
      "start": 2695.780029296875,
      "end": 2704.780029296875,
      "text": " knowing as we look to Jesus the author and finisher of our faith knowing that"
    },
    {
      "id": 53,
      "start": 2704.780029296875,
      "end": 2710.2200317382812,
      "text": " we have this expectant end that forever and ever for all of eternity we will be"
    },
    {
      "id": 54,
      "start": 2710.2200317382812,
      "end": 2715.3400268554688,
      "text": " with thee and we'll worship thee and what a wonderful truth that is we pray"
    },
    {
      "id": 55,
      "start": 2715.3400268554688,
      "end": 2719.2200317382812,
      "text": " that you'd work in hearts and lives as only you can help us Lord today to be"
    },
    {
      "id": 56,
      "start": 2719.2200317382812,
      "end": 2723.1400146484375,
      "text": " encouraged well thank you for it in Christ's name we pray would you stand"
    },
    {
      "id": 57,
      "start": 2723.1400146484375,
      "end": 2726.4200439453125,
      "text": " with me heads are bowed eyes are closed Kimberly's gonna play a song of"
    },
    {
      "id": 58,
      "start": 2726.4200439453125,
      "end": 2731.3800354003906,
      "text": " invitation on the piano and as she does want to encourage"
    }
  ],
  "processed_at": "2025-04-17T17:00:30.169329"
}