{
  "video_id": "VAwhGyZS5VU",
  "text": "this morning. Psalm 119, we'll begin in verse number 97, and we'll be looking at a number of portions of Scripture this morning. But I believe that as we sit here this morning, we hold in our hands, you hold in your lap, a treasure. And the reality is that the Word of God, this Bible, the precious book that we hold in our hands and sit in our laps this morning is more precious than gold. And I know that there's a number of people that would disagree with that statement. There are people that would love to argue and differ on that proclamation. But the psalmist declares in a number of portions of Scripture that this book, the Word of God, is more precious than gold, yea, than much fine gold. And I'm so thankful that God has given us this book. We understand that He gave it to us by inspiration. We understand this morning that He has divinely preserved this book. This morning, we are blessed to have a Bible. There are many people around the globe this morning that do not have a Bible. We've heard stories from our own missionaries who have sat in meeting places such as we're seated in this morning, and they did not have a Bible for those that were present. And Brother Savalle testifies of the very first time ever in his church after years of ministry in Samoa, after that first time when Bibles were printed and delivered and given to the people that for the first time in his ministry, he had the opportunity to say, take your Bibles and turn to. And he heard the pages of the precious Word of God as people were finding their place in the Bible. This morning, many of us have multiple copies of the Bible. This morning, we, if we're not careful, we can get used to the fact that we have a Bible, but it's a treasure. I would say this, this morning, I have not always appreciated this book like I do today. Before I was saved, I didn't know anything about the Bible. I didn't appreciate the Bible. I didn't know that the Bible was God's Word. I didn't know that it contained the truth of redemption and the love that God had for me. I had no idea. I didn't appreciate it then like I appreciate it now. The longer I walk with the Lord, the more I appreciate this book, the more I love this book. We're in Psalm 119, but I want to remind you of what Peter said. You don't need to turn there, but in 1 Peter 1, in verse 23-25, it says, Being born again, not of corruptible seed, but of incorruptible, by the Word of God, which liveth and abideth forever. For all flesh is as grass, and all the glory of man is the flower of grass. The grass withereth, and the flower thereof falleth away. But the Word of the Lord endureth forever. And this is the Word which by the gospel is preached unto you. I am thankful that I can place my hope, my confidence in the finished Word of God, the eternal Word of God. I'm not dependent on your opinion, my opinion, someone else's opinion. I just get to run to the Word of God and say, what does God say? What does God say on this subject, on that subject? And what God said settles the matter. I know for years there's been that statement, God said it, I believe it, that settles it. And I think that's a nice little saying. But the reality is whether you believe it or not really doesn't change the truth that God said it and that settles it. Now it's better for us if we believe it, amen? But if some disagree with it, if some reject it, oppose it, it's still truth. And for that we ought to rejoice. Notice with me what the psalmist says in Psalm 119. Of course this whole chapter is devoted to the love and to the truth of God's Word and the love of God's Word. And here the psalmist comes in verse number 97, oh how love I thy law, it is my meditation all the day. When I come to verse 97 as I read this precious chapter in the Word of God and I see all that he mentions in the preceding verses about God's Word and all that will be said after about God's Word, I understand why the psalmist declares almost right in the middle, it's not exactly the middle verse, but how he declares and I think it's with great excitement, there's emotion behind it, oh how love I thy law, it is my meditation all the day. I've used as our title this morning as you've seen in the bulletin, oh how love I thy law. This morning I would say this if you're taking notes, number one, as a follower of Jesus, I should love the Scriptures. As a follower of Jesus, I should love the Scriptures. Not only here in verse number 97, but I want you to walk with me through Psalm 119 and look at a number of verses, skip down if you will to verse number 140. Notice what the psalmist says, thy word is very pure, therefore thy servant loveth it. This book is pure. Every word of God is pure, every single word. He's given it by inspiration, he's divinely preserved it, and we find here that the psalmist acknowledges that the Word of God is very pure and his response to that truth is therefore thy servant loveth it. Look at verse number 159. The Bible says this, consider how I love thy precepts. Thy precepts is another word term that is used here in Psalm 119 referring to the Word of God. And it says, consider how I love thy precepts. Quicken me, O Lord, according to thy lovingkindness. Thy word is true from the beginning and every one of thy righteous judgments endureth forever. I look at verse number 159 and I consider it from this perspective that the psalmist has already declared his love for God's Word and as followers of the Lord Jesus Christ, we ought to love the Scriptures, we ought to love this book. But the reality is that I can stand with the psalmist and you can stand with the psalmist and say, oh, how love I thy law. But in verse number 159, the psalmist says, consider how I love thy precepts. It's one thing to say that we love it, it's another thing when our life proves that we love it. That the psalmist can really, I believe, cry out in prayer to God and say, consider how I love thy precepts. It's not just an expression that the psalmist is using, but know his behavior aligns with the claim. Often we find throughout the truth of God's Word, we've said this over the years, that people can claim a lot of things. If you're reading the devotion book, we read just a couple of nights ago about a man that in his will he willed lots of money to all sorts of places and cities and organizations and so on and so forth. And man, what a great thing. But the reality is that the man died poor. He had nothing to leave to anyone. We can say whatever we want to say. Jesus said, if you love me, keep my commandments. The proof of our love is through our behavior. The psalmist says, consider how I love thy precepts. Notice in verse 163, I hate and abhor lying, but thy law do I love. I love it. Notice verse 165, great peace have they which love thy law, and nothing shall offend them. You think about the peace that is absent in so many people's lives today. We live in a world where people do not know the peace of God. But our God, we understand we're able to make peace with God, according to Romans, through the Lord Jesus Christ. But then we have the peace of God that passeth all understanding. And we find here that the psalmist says, great peace have they which love thy law, and nothing shall offend them. And as we meditate and we feast upon the truth of God's Word, it impacts us to the place where we come, and we have that peace. My soul, verse 167, my soul hath kept thy testimonies. And notice what he says, and I love them exceedingly. I think about the expression that is used in verse 167. He's mentioned, as we've looked at all of these verses very quickly this morning, and we've noticed how the psalmist has expressed the fact that he loves the law, he loves the Word of God. And here in verse 167, he says, I love them exceedingly. I mean, you think about saying, I love something, I love someone, and we use that expression, and really that's the culmination of our emotions, and we make that statement, and it carries great weight. But then for the psalmist to say, I love them, but I love them exceedingly. This book is precious. And this morning, as followers of the Lord Jesus Christ, we ought to love the Scriptures. We ought to love the Word of God. But not only do we love the Word of God, number two, as a follower of Jesus, I should learn the Scriptures. I should learn the Scriptures. I think about it from this perspective. I love my wife, but I want to learn things about my wife. I want to learn what she, or her interests, and what she likes, and so on and so forth. And because I love her, I want to learn about my wife. And as I think about the love that we should have for the Word of God, the love that we have for the Scriptures, the reality is that as a follower of Jesus Christ, not only should I love the Scriptures, but I should learn the Scriptures. And it's amazing to me because I believe that there's a connection between these first two thoughts this morning, and it's this. The more I love the Word of God, the more I desire to learn the Word of God. And the more I learn the Word of God, the more I love the Word of God. And it just kind of continues in that cycle. I love it, so I want to learn it. I learn it, and I love it more, and so I want to learn more, and I love more. And we come to that place of 167 where the psalmist says, I love thy law exceedingly because I've learned the Scriptures, having that deeper, more intimate walk with God. It's sad, but I know that probably none of us have been contacted about these studies and surveys and what have you, but there are studies, surveys that are done regularly with regard to the American population and their relationship to the Word of God. I've never been called. I've never been surveyed, and I'm sure that many of you have not been either. But the statistics based upon those that have been surveyed are alarming. A continual decline over the last several decades of people who even, they claim, the people that are polled, the people that are surveyed, they claim to attend church at least somewhat regularly, but yet when they answer the question about the Bible, they very rarely ever pick it up to read it. It's sad. Statistics tell us that a number of people that have sat in churches for decades have never read the Bible in its entirety, from Genesis to Revelation. I hope that wouldn't be true of any of us. Why? Because we not only love the Bible, but we want to learn the Scriptures. How is it that I can learn the Word of God? How is it, as I know what the psalmist says and I understand the treasure that I hold in my hand and I begin to develop this love for the Word of God, how is it that I go about learning the Word of God? Number one, through our personal devotions, our personal Bible study. You know that the Word of God tells us, we referenced this verse in our Sunday school this morning in 1 Peter 2 and verse number 2, as newborn babes desire the sincere milk of the Word that ye may grow thereby. Paul instructs Timothy in 2 Timothy 2 and verse number 15, study to show thyself approved unto God, a workman that needeth not to be ashamed, rightly dividing the Word of truth And the reality this morning is that we need to learn personally to dig in and to study the Scriptures. Can I say to you this morning that you ought to learn the Scriptures in church? Through church attendance, you ought to learn the Scriptures. But if the only learning you get is what's given from this pulpit, you're not getting enough. You're not getting enough. Try to just eat physical food twice a week. See how that works for you. Many of us would never even attempt it. But spiritually speaking, there are those that come to church just a couple of times a week and then they don't have any other spiritual sustenance. Oh, we need to learn personally through our personal devotions, through our personal Bible study, digging into the Word of God, feasting upon the manna that God has given us and every single day getting into the Word of God and saying, God, what do you have for me? We should learn it through attending church. Number two, yes, the personal devotions, but through church attendance. You know that a church has been instructed throughout the New Testament, there are many instructions that are given to the church and we understand that God has equipped the church with spiritual leaders. In fact, as you read Ephesians chapter number four, he says that He gave some pastors and teachers and God has given the instruction in His Word in the New Testament with regard to church polity and the setup of a church. And not only has He given the responsibility, the office, the officers of a local church, the office of a pastor, the office of a deacon, but He's given what the responsibility is of those that would hold such position. In Acts chapter number 20, the apostle Paul is on his way to Jerusalem and as he's on his way to Jerusalem, he calls for the church leaders from Ephesus to come and to meet him. And as they meet, he begins to give them instruction, he begins to provide them with some details with regarding to his ministry there in Ephesus and he challenges these religious leaders of the church at Ephesus, the elders and the overseers is what they're referred to in verse 17 as elder and verse 28 as the overseer. And we find that as Paul is writing to these or speaking to these and as Luke would record the interaction, notice in Acts 20 and verse number 28, Paul says this to these leaders of the church at Ephesus, take heed therefore unto yourselves and to all the flock, notice, for the witch the Holy Ghost hath made you overseers to feed the church of God which He hath purchased with His own blood. He doesn't mean to set up a banquet table with a potluck dinner. I like potluck dinners, but that's not what Paul's referring to. When he says to these church leaders, these pastors at the church at Ephesus, he says feed the church of God. God has given you an entrusted position. God has placed you in this place of being an overseer and God has called you and God has placed you there and now your responsibility is to feed the church of God. Notice what he says, which He hath purchased with His own blood. We must always remember that it's God's church. We must always remember that the Lord Jesus Christ is the head of the church. We find that He continues and He says in verse 29, for I know this, that after my departing shall grievous wolves enter in among you, not sparing the flock. Also of your own selves shall men arise, speaking perverse things, to draw away disciples after them. Therefore, watch and remember that by the space of three years I cease not to warn everyone night and day with tears. The responsibility of the pastor to feed the church of God is because of the false teaching that is prevalent in those that would rise up and he says, you as a pastor, you have the responsibility. So when I say that as a follower of Jesus, I should love the Scriptures, but then I should learn the Scriptures, I not only learn them through my personal Bible study, but I learn them by church attendance. Instead I go to a church that preaches the Word of God. I desire, it's my prayer every single week that God would use me to preach the Word. Someone asked that was a visitor to our church a couple of years ago, and I do not say this except to say glory to God. They were visitors to our church, the purpose for them visiting our church is because they were looking for a place for their church to rent. They're looking for a facility to rent. They were not pastors, but they were in position of leadership at the particular church that they were representing. The close of the service in that back lobby, they said this, do you always feed the flock this way? That's humbling. And here's what I said, it's my responsibility. Listen, there's no reason to go to a church that's not feeding the church. There's no reason to go to a church where they're not preaching the Word of God. It's not my opinion that's going to change anybody's life. It is this book that is going to change lives. Paul says to Timothy in 2 Timothy chapter number 4, he says, listen, preach the Word. Be instant in season, out of season, reprove, rebuke, exhort with all longsuffering and doctrine. Oh, the time will come when they will not endure sound doctrine. But it does not change the responsibility, Timothy, to preach the Word of God. In 1 Timothy chapter number 4. I want you to turn there and notice what is said in 1 Timothy chapter number 4 with regard to this responsibility, and I believe that as a pastor is to fulfill the responsibility of feeding the church and feeding the flock of God that you can learn the Scriptures sitting in the pew at church, sitting in the Sunday school class, sitting in the morning service, the evening service, the midweek service, the opportunity to grow and to learn the Word of God. In 1 Timothy 4 and verse number 6, notice what Paul says to his son of the faith, Timothy. He says, If thou put the brethren in remembrance of these things, thou shalt be a good minister of Jesus Christ, nourished up in the words of faith and of good doctrine, whereunto thou hast attained. You know that God does not use as His measuring, if you will, for who a good minister is by the size of a congregation, by the number of ministries that a church has. Those are not the parameters that God uses. Paul says to Timothy under the inspiration of God, he says, This is what would make you a good minister of Jesus Christ, that you're putting the brethren in remembrance of these things, that you're teaching the Word of God, that you're preaching the Word of God. Peter would say this in 1 Peter 5 and verse number 2. We looked at verse number 1 a couple of weeks ago, dealing with the fact that he, Peter, was a witness of the sufferings of Christ, and he mentions about his own position of being an elder, and as he's writing to the elders, the leaders of the church, he says to them in verse number 2, again, similar to what Paul said to the church leaders in Ephesus in Acts 20, he says, Feed the flock of God, which is among you, taking the oversight thereof, not by constraint, but willingly, not for filthy lucre, but of a ready mind. Feed, feed the flock of God. How is it that I learn the Scriptures? Well, number one, through your own personal Bible study, your own personal devotion. Number two, through church attendance, into a church that teaches and preaches the Word of God, we can learn the Scriptures, we can learn the Word of God. We know that the truth of discipleship would really be my third thought of how we can learn the Scriptures. In Matthew chapter 28, we read the Great Commission, and we, often as we speak about the Great Commission, we're mindful of our responsibility to preach the gospel to every creature, and we know that after conversion, they're to be baptized. But we find that as Jesus would give, really in this passage that is recorded by Matthew, the fullest teaching with regard to the Great Commission, Mark simply says, Preach the gospel to every creature. But we find that Matthew, as he's recording the words of Christ, it says, All power is given unto me in heaven and earth, in verse 18, Go ye therefore and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost. And then he says this, teaching them, what? Teaching them to observe all things whatsoever I have commanded you. And lo, I am with you all the way, even unto the end of the world. Amen. I remember we were in California just after I got saved. We were in a church for just a short time, but we were involved in a discipleship program as a family. The four of us attended a discipleship program, my parents, my brother, and I. And we would learn. It was a very detailed discipleship program that we were involved in, just for a short period of time. But it was very interesting, and I love discipleship. I love the opportunity to sit in my office or to sit at some other, I don't like Starbucks, but go to Panera or something like that, and be able to sit and just use some Bible teaching and just disciple someone one-on-one and teach them the Word of God. You know, one way that you can learn the Scriptures is through getting involved in discipleship. Sometimes we don't learn the Scriptures because we're, please forgive me, I don't mean to be unkind, but at times we're too prideful to even acknowledge that we need to learn. You know, the reality is that as we go to the Word of God and we love the Scriptures, say, I want to learn the Scriptures, and we begin to have with a measure of humility that I need to learn God's Word. I want to learn the truth that God has given within His Word. We begin to go through the process of learning the Scriptures. Again, as I mentioned, the more I learn of God's Word, the more I love God's Word. The more I love it, the more I want to learn it. But as we finish this morning, I want you to think about this truth. As a follower of Jesus Christ, I should live the Scriptures. Yes, we ought to love the Word of God. It's precious. It's a treasure. Yes, we ought to learn the Word of God. But if we're not living the Word of God, it's not what it's about. It's not what it's about. I'm not learning it just so that I can have some measure of head knowledge, just so that I can win some Bible trivia game and be able to answer some questions. No, I'm learning it so that I would live it. And we find that as we look to the Word of God, we find, of course, and we often quote James 1 and verse 22, that we're to be doers of the Word and not hearers only. And the reality is that as I love the Book and as I learn the Book, I should be living the Book. You know, for years, perhaps even, you could look at decades, even some could look at and mention centuries, where Baptist people were called this, people of the Book. People of the Book. What a great compliment. Amen? What a great compliment. I've had people over the years say, well, you just believe the Bible. Thank you. Right? I mean, what else do you want me to believe? Yes, I believe the Bible. It's been given by inspiration of God. It is His Word. He is authoritative, and He has given us the authoritative Word. You're too narrow-minded. I'm as broad as the Word of God is. Amen? Where God has given us truth, we don't need to try to be more open-minded about it. It's not that we don't want to be kind and gracious. It's not that we don't want to reach people. But the reality is that truth is truth. When's the last time a student sat in a classroom, I don't know, things are crazy in our world today. Maybe it's happening, I don't know. But back in my day, and I'm not that old, but somebody told me that yesterday. You're a pretty young man. I said, thank you very much. I appreciate that. That was right after they told me they weren't sure who was my daughter when they were singing and who was my wife. But anyway, it's, you know, some good, some bad. Anyway, you know, there was never a teacher that I had in school that when I got the math problem wrong that I was able to just tell them, well, that's just, you've got to be more open-minded about it. No, it's wrong, right? Isn't that what they say? It's wrong. This is the right answer. Well, I want this to be the right answer. Well, I'm sorry. It doesn't matter if we're sincere. You know, people can be sincerely wrong. They can be. People can be sincere. People can be sincerely wrong. And it's God that uses His Word that convinces us of truth. And this morning, as I live the Scriptures, as I live out the Word of God, remember what Joshua was told. Turn back to Joshua chapter 1, and I want you to see what God told Joshua. And really, I believe that as you come to the book of Joshua that, of course, Moses has died. And who is it that was the human penman to the Pentateuch? It's Moses. He was the human penman of Genesis, Exodus, Leviticus, Numbers, and Deuteronomy. It was God that used Moses to write those books. And we find that Moses has now died. Moses, my servant, is dead. The Bible plainly tells us that. And Joshua is now the man that God would use to lead His people, God's people, into the land of promise. And I want you to notice, we're familiar with the verse of Scripture, but I want you to notice in verse number 8, this book of the law. This is the first time after the death of Moses and after the writing of the law, the Pentateuch, the first five books of the Bible, that God now says, this book of the law shall not depart out of thy mouth. Notice what he says, but thou shalt meditate therein day and night. Remember, how do I learn the Scriptures? Through my personal devotion. You don't come here day and night. Now, on Sunday, you can. Amen? We have service in the morning and in the evening on Sundays. You can come day and night, and you can feast on the Word of God. But in our own personal lives, he says, thou shalt meditate therein day and night. Notice what he says, that thou mayest observe, what are the next two words? To do. I love it, I learn it, but I must live it. To do according to all that you want to do. Nope. According to all that you want to do. that is written therein,\" right? Then notice what he says, for then. Now what is then? It is the result of the process that is laid out. Then does not come if we do not fulfill the process that is laid out, right? It's the result. It's the outcome. Would you agree? For then thou shalt make thy way prosperous, and then thou shalt have good success. How many people today in our world are looking for prosperity and success? Thousands, millions, they're looking for prosperity and they're looking for success. I would submit to you that they're using a different measurement for success and prosperity. Their perspective of being prosperous and being successful is different than what God's Word says. Many people today have the idea that prosperity and success is primarily based upon the size of your bank account. It's a very common belief. But you know there are some people that have some really big bank accounts and are miserable? Riches make themselves wings and fly away, that's what the Word of God says. Listen, when we take the truth of Joshua 1 and verse 8, and we take the Book of God, the Word of God, the Book that He has given us, the precious Bible, and we meditate there in day and night, and we're learning the Scriptures and we're loving the Scriptures, but we're going and seeking the Scriptures for the purpose of obedience, to do according to all that is written therein, then thou shalt make thy way prosperous and then thou shalt have good success. Psalm 19 and verse number 11, I want you to notice in this psalm, of course, we begin with the declaration of the glories of heaven and how the heavens declare the glory of God and the firmament showeth His handiwork. And you think about the way in which Psalm 19 begins with the creation and the glory of creation, but how the creation declares the glory of God. Why? Because the creation requires a creator. People have just thrown away that simple truth wholesale today in our society. You ask somebody that denies a creator, ask them if they have a watch on. Well, yeah, well, who designed the watch? The watch requires a designer, right? It didn't just... Somebody didn't just put all the pieces... First of all, where'd you get the pieces? But even if they could, they didn't just put all the pieces in a box and then came out a watch. If that could happen, they wouldn't be able to sell them for as much as they sell them for. Amen? But the reality is that the heavens declare the glory of God. And then the psalmist goes into the Word of God, beginning in verse number 7, the law of the Lord is perfect, converting the soul. The testimony of the Lord is sure, making wise the simple. The statutes of the Lord are right, rejoicing the heart. The commandment of the Lord is pure, enlightening the eyes. The fear of the Lord is clean, enduring forever. The judgments of the Lord are true and righteous altogether. Notice what he says. More to be desired are they than gold, yea, than much fine gold, sweeter also than honey and the honeycomb. But then notice what he says in verse number 11, moreover by them, by the Scriptures, by the Word of God, moreover by them is thy servant warned. Many people don't like warnings, but I'm thankful for warnings. You have containers at home that have warning labels, right? Those warning labels are there for a reason. Sometimes the elements that are contained within that package could kill you. They're poison, right? They have warning labels. The Word of God contains warnings, but then notice what he says at the end of verse number 11. In keeping of them, there is great reward. Great reward. I'm so thankful that God blesses obedience to His Word. In keeping of them, living out the Scriptures, doing what God has said in His Word, there is great reward. The psalmist cries out in Psalm 86 and verse number 11 his desire to learn the Scriptures. Of course, we've mentioned already that I love the Word of God, so I desire to learn the Word of God. And as I learn the Word of God, I love the Word of God, and I learn more of the Word of God. And here the psalmist says in Psalm 86 and verse number 11, teach me thy way, O Lord. I want to learn it. Why? I will walk in thy truth, unite my heart to fear thy name. I want to live it. I want to live out the Word of God. We started in 1 Peter by quoting a portion of Scripture of being born again, not of corruptible seed but of incorruptible. The Word of God which liveth and abideth forever. I want you to notice what Peter then says in 2 Peter chapter number 1. We'll finish with this portion of Scripture, and I want you to consider the truth that Peter is expressing to these that he's writing to. Now understand contextually in 2 Peter chapter number 1, Peter is just speaking about being an eyewitness of the majesty of God. He's speaking about his experience at the Mount of Transfiguration. We don't have time to develop all of that this morning, but that's what he's referring to in verse 15 down through verse number 18. Peter, James, and John, they went up on that day and they saw the glory of the Lord Jesus Christ and the Mount of Transfiguration. And Peter, after speaking about that experience, he says this in verse number 19, we have also a more sure word of prophecy. Now notice what he says, whereunto ye do well that ye take heed, as unto a light that shineth in a dark place, unto the day that dawn and the day star arise in your hearts. I remember speaking with Doc actually a number of years ago about this verse of Scripture. And it's interesting the analogy that is used, the imagery that is given to us when he talks about as unto a light that shineth in a dark place. You know what's interesting? If we're in this place, and it'd have to be late now because of the time change, but if we're in this room and it's completely dark, and your attention immediately would turn if there was a light that was turned on. If someone just had a little flashlight, those little flashlights that we give out that the kids love so much. I guess it was the missionaries last week, and man, that little kid pointed it right in his eye. The oldest of the kids. He's like, come on, man, seriously? He's like, it's bright, you think? But anyway, if we're in a completely dark place, and you just turn on a little light, you know where your attention is going to go? It's going to go to the light. It's going to go to the light. And Peter says that we have a more sure word of prophecy, whereunto ye do well that ye take heed. You know, it's in our best interest to obey the Word of God, to live the Word of God in our best interest. We're not going to take the time to go there, but in Acts 27, Paul is going to be shipwrecked, and it's a terrible situation. You know, it's interesting, before they ever set sail, Paul said we shouldn't go. You read it. Go back and read Acts 27. He says we shouldn't go. But the other people that were there, the owners of the ship and others, they said, you know, it's fine. We should go. It didn't work out so well for them. And I've often thought about this when I read that passage of Scripture. You know, everyone believes something, and everyone believes someone, right? The people that would like to criticize you for believing the Bible, they believe something. Whether they themselves are their own authority, or some other person is their authority, some other religion, some other science, whatever it might be, humanism. Somebody is their authority. They believe somebody. And this morning, we need to believe God. The psalmist declares, oh, how love I thy law. I wonder this morning, can we stand with the psalmist and say, I love the Word of God. I love it exceedingly. And that love that I have for the Word of God results in me learning the Word of God through my personal devotions. Every day, I can't wait to get to my time of devotion. You know, there are some people that have certain things that they do every day. They can't wait to get to read the news. I hate the news. I like to try to keep myself aware of what's going on, but man, I don't like it. I'd rather read the Word of God. And do we have that longing for I can't wait to get to God and His Word? I'm learning the Scriptures, but then I'm living the Scriptures. Every day when I go to the Word of God, God, what is it that You're showing me in Your Word that I need to apply in my life? How can I be a doer of Your Word? How do I take this truth and apply it in my life? As believers, as followers of the Lord Jesus Christ, I hope that it'd be said of us that we love the Word of God, that we're learning the Word of God, and that we're living the Word of God. Let's pray. Father, we love You. We thank You for loving us. We thank You so much for this precious book, the Bible. How thankful we are to have the Word of God. And I pray this morning that as we've spent just a little while speaking about our relationship to Your Word, I pray that each of us could say that we love Your Word and we're learning Your Word, we're living Your Word. God, I pray that Your Spirit would speak to us as individuals. Maybe we need to learn it more. Maybe we need to live it more. Maybe there's some things that we're not applying in our lives. Maybe our devotion life is not what it ought to be. Maybe our church attendance is not what it ought to be. And we're missing out on those meals, those spiritual meals, the milk and meat of the Word of God. God, I pray that You'd move in the moments of invitation. You'd help us, Lord, to respond in obedience. If there's one that's present with us that's not sure of heaven, they've never trusted the Lord Jesus Christ as their personal Savior. God, I pray that today they would understand the love that You have for them. We sang about being ransomed. We sang about the love, and can it be? We started with speaking about being born again, not of corruptible seed but of incorruptible by the Word of God which liveth and abideth forever. If there's one present that's not sure of heaven, we'd love to take a Bible, the authoritative Word of God, and show them how they can know for sure that heaven is their home. I pray that You'd move and work, have Your way. In Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 6.119999885559082,
      "text": " this morning. Psalm 119, we'll begin in verse number 97, and we'll be looking at a number"
    },
    {
      "id": 1,
      "start": 6.119999885559082,
      "end": 10.9399995803833,
      "text": " of portions of Scripture this morning. But I believe that as we sit here this morning,"
    },
    {
      "id": 2,
      "start": 10.9399995803833,
      "end": 18.079999923706055,
      "text": " we hold in our hands, you hold in your lap, a treasure. And the reality is that the Word"
    },
    {
      "id": 3,
      "start": 18.079999923706055,
      "end": 23.360000610351562,
      "text": " of God, this Bible, the precious book that we hold in our hands and sit in our laps this"
    },
    {
      "id": 4,
      "start": 23.360000610351562,
      "end": 28.65999984741211,
      "text": " morning is more precious than gold. And I know that there's a number of people that"
    },
    {
      "id": 5,
      "start": 28.65999984741211,
      "end": 34.619998931884766,
      "text": " would disagree with that statement. There are people that would love to argue and differ"
    },
    {
      "id": 6,
      "start": 34.619998931884766,
      "end": 41.29999923706055,
      "text": " on that proclamation. But the psalmist declares in a number of portions of Scripture that"
    },
    {
      "id": 7,
      "start": 41.29999923706055,
      "end": 49.13999938964844,
      "text": " this book, the Word of God, is more precious than gold, yea, than much fine gold. And I'm"
    },
    {
      "id": 8,
      "start": 49.13999938964844,
      "end": 55.400001525878906,
      "text": " so thankful that God has given us this book. We understand that He gave it to us by inspiration."
    },
    {
      "id": 9,
      "start": 55.400001525878906,
      "end": 62.880001068115234,
      "text": " We understand this morning that He has divinely preserved this book. This morning, we are"
    },
    {
      "id": 10,
      "start": 62.880001068115234,
      "end": 68.27999877929688,
      "text": " blessed to have a Bible. There are many people around the globe this morning that do not"
    },
    {
      "id": 11,
      "start": 68.27999877929688,
      "end": 75.19999694824219,
      "text": " have a Bible. We've heard stories from our own missionaries who have sat in meeting places"
    },
    {
      "id": 12,
      "start": 75.19999694824219,
      "end": 81.63999938964844,
      "text": " such as we're seated in this morning, and they did not have a Bible for those that were"
    },
    {
      "id": 13,
      "start": 81.63999938964844,
      "end": 87.87999725341797,
      "text": " present. And Brother Savalle testifies of the very first time ever in his church after"
    },
    {
      "id": 14,
      "start": 87.87999725341797,
      "end": 93.68000030517578,
      "text": " years of ministry in Samoa, after that first time when Bibles were printed and delivered"
    },
    {
      "id": 15,
      "start": 93.68000030517578,
      "end": 98.68000030517578,
      "text": " and given to the people that for the first time in his ministry, he had the opportunity"
    },
    {
      "id": 16,
      "start": 98.68000030517578,
      "end": 105.5199966430664,
      "text": " to say, take your Bibles and turn to. And he heard the pages of the precious Word of"
    },
    {
      "id": 17,
      "start": 105.5199966430664,
      "end": 114.12000274658203,
      "text": " God as people were finding their place in the Bible. This morning, many of us have multiple"
    },
    {
      "id": 18,
      "start": 114.12000274658203,
      "end": 120.04000091552734,
      "text": " copies of the Bible. This morning, we, if we're not careful, we can get used to the"
    },
    {
      "id": 19,
      "start": 120.04000091552734,
      "end": 126.12000274658203,
      "text": " fact that we have a Bible, but it's a treasure. I would say this, this morning, I have not"
    },
    {
      "id": 20,
      "start": 126.12000274658203,
      "end": 132.8000030517578,
      "text": " always appreciated this book like I do today. Before I was saved, I didn't know anything"
    },
    {
      "id": 21,
      "start": 132.8000030517578,
      "end": 138.27999877929688,
      "text": " about the Bible. I didn't appreciate the Bible. I didn't know that the Bible was God's"
    },
    {
      "id": 22,
      "start": 138.27999877929688,
      "end": 143.39999389648438,
      "text": " Word. I didn't know that it contained the truth of redemption and the love that God"
    },
    {
      "id": 23,
      "start": 143.39999389648438,
      "end": 150.44000244140625,
      "text": " had for me. I had no idea. I didn't appreciate it then like I appreciate it now. The longer"
    },
    {
      "id": 24,
      "start": 150.44000244140625,
      "end": 158.6199951171875,
      "text": " I walk with the Lord, the more I appreciate this book, the more I love this book. We're"
    },
    {
      "id": 25,
      "start": 158.6199951171875,
      "end": 163.5399932861328,
      "text": " in Psalm 119, but I want to remind you of what Peter said. You don't need to turn there,"
    },
    {
      "id": 26,
      "start": 163.5399932861328,
      "end": 167.97999572753906,
      "text": " but in 1 Peter 1, in verse 23-25, it says,"
    },
    {
      "id": 27,
      "start": 167.97999572753906,
      "end": 173.77999877929688,
      "text": " Being born again, not of corruptible seed, but of incorruptible, by the Word of God,"
    },
    {
      "id": 28,
      "start": 173.77999877929688,
      "end": 181.33999633789062,
      "text": " which liveth and abideth forever. For all flesh is as grass, and all the glory of man"
    },
    {
      "id": 29,
      "start": 181.33999633789062,
      "end": 185.94000244140625,
      "text": " is the flower of grass. The grass withereth, and the flower thereof falleth away. But the"
    },
    {
      "id": 30,
      "start": 185.94000244140625,
      "end": 194.3800048828125,
      "text": " Word of the Lord endureth forever. And this is the Word which by the gospel is preached"
    },
    {
      "id": 31,
      "start": 194.3800048828125,
      "end": 201.3800048828125,
      "text": " unto you. I am thankful that I can place my hope, my confidence in the finished Word of"
    },
    {
      "id": 32,
      "start": 201.3800048828125,
      "end": 208.5,
      "text": " God, the eternal Word of God. I'm not dependent on your opinion, my opinion, someone else's"
    },
    {
      "id": 33,
      "start": 208.5,
      "end": 213.17999267578125,
      "text": " opinion. I just get to run to the Word of God and say, what does God say? What does"
    },
    {
      "id": 34,
      "start": 213.17999267578125,
      "end": 220.3800048828125,
      "text": " God say on this subject, on that subject? And what God said settles the matter. I know"
    },
    {
      "id": 35,
      "start": 220.3800048828125,
      "end": 226.17999267578125,
      "text": " for years there's been that statement, God said it, I believe it, that settles it. And"
    },
    {
      "id": 36,
      "start": 226.17999267578125,
      "end": 231.8800048828125,
      "text": " I think that's a nice little saying. But the reality is whether you believe it or not really"
    },
    {
      "id": 37,
      "start": 231.8800048828125,
      "end": 236.17999267578125,
      "text": " doesn't change the truth that God said it and that settles it. Now it's better for us"
    },
    {
      "id": 38,
      "start": 236.17999267578125,
      "end": 243.5800018310547,
      "text": " if we believe it, amen? But if some disagree with it, if some reject it, oppose it, it's"
    },
    {
      "id": 39,
      "start": 243.5800018310547,
      "end": 250.10000610351562,
      "text": " still truth. And for that we ought to rejoice. Notice with me what the psalmist says in Psalm"
    },
    {
      "id": 40,
      "start": 250.10000610351562,
      "end": 256.05999755859375,
      "text": " 119. Of course this whole chapter is devoted to the love and to the truth of God's Word"
    },
    {
      "id": 41,
      "start": 256.05999755859375,
      "end": 263.1400146484375,
      "text": " and the love of God's Word. And here the psalmist comes in verse number 97, oh how love I thy"
    },
    {
      "id": 42,
      "start": 263.260009765625,
      "end": 271.260009765625,
      "text": " law, it is my meditation all the day. When I come to verse 97 as I read this precious"
    },
    {
      "id": 43,
      "start": 271.260009765625,
      "end": 276.5400085449219,
      "text": " chapter in the Word of God and I see all that he mentions in the preceding verses about"
    },
    {
      "id": 44,
      "start": 276.5400085449219,
      "end": 282.4200134277344,
      "text": " God's Word and all that will be said after about God's Word, I understand why the psalmist"
    },
    {
      "id": 45,
      "start": 282.4200134277344,
      "end": 287.1000061035156,
      "text": " declares almost right in the middle, it's not exactly the middle verse, but how he declares"
    },
    {
      "id": 46,
      "start": 287.1000061035156,
      "end": 294.739990234375,
      "text": " and I think it's with great excitement, there's emotion behind it, oh how love I thy law,"
    },
    {
      "id": 47,
      "start": 294.739990234375,
      "end": 301.5400085449219,
      "text": " it is my meditation all the day. I've used as our title this morning as you've seen in"
    },
    {
      "id": 48,
      "start": 301.5400085449219,
      "end": 306.70001220703125,
      "text": " the bulletin, oh how love I thy law. This morning I would say this if you're taking"
    },
    {
      "id": 49,
      "start": 306.70001220703125,
      "end": 312.70001220703125,
      "text": " notes, number one, as a follower of Jesus, I should love the Scriptures. As a follower"
    },
    {
      "id": 50,
      "start": 312.70001220703125,
      "end": 318.739990234375,
      "text": " of Jesus, I should love the Scriptures. Not only here in verse number 97, but I want you"
    },
    {
      "id": 51,
      "start": 318.739990234375,
      "end": 323.82000732421875,
      "text": " to walk with me through Psalm 119 and look at a number of verses, skip down if you will"
    },
    {
      "id": 52,
      "start": 323.82000732421875,
      "end": 332.1000061035156,
      "text": " to verse number 140. Notice what the psalmist says, thy word is very pure, therefore thy"
    },
    {
      "id": 53,
      "start": 332.1000061035156,
      "end": 341.3800048828125,
      "text": " servant loveth it. This book is pure. Every word of God is pure, every single word. He's"
    },
    {
      "id": 54,
      "start": 341.3800048828125,
      "end": 347.4200134277344,
      "text": " given it by inspiration, he's divinely preserved it, and we find here that the psalmist acknowledges"
    },
    {
      "id": 55,
      "start": 347.4200134277344,
      "end": 353.8999938964844,
      "text": " that the Word of God is very pure and his response to that truth is therefore thy servant"
    },
    {
      "id": 56,
      "start": 353.8999938964844,
      "end": 364.70001220703125,
      "text": " loveth it. Look at verse number 159. The Bible says this, consider how I love thy precepts."
    },
    {
      "id": 57,
      "start": 364.70001220703125,
      "end": 370.260009765625,
      "text": " Thy precepts is another word term that is used here in Psalm 119 referring to the Word"
    },
    {
      "id": 58,
      "start": 370.260009765625,
      "end": 377.0199890136719,
      "text": " of God. And it says, consider how I love thy precepts. Quicken me, O Lord, according"
    },
    {
      "id": 59,
      "start": 377.0199890136719,
      "end": 381.70001220703125,
      "text": " to thy lovingkindness. Thy word is true from the beginning and every one of thy righteous"
    },
    {
      "id": 60,
      "start": 381.70001220703125,
      "end": 388.6199951171875,
      "text": " judgments endureth forever. I look at verse number 159 and I consider it from this perspective"
    },
    {
      "id": 61,
      "start": 388.6199951171875,
      "end": 394.70001220703125,
      "text": " that the psalmist has already declared his love for God's Word and as followers of the"
    },
    {
      "id": 62,
      "start": 394.70001220703125,
      "end": 399.5400085449219,
      "text": " Lord Jesus Christ, we ought to love the Scriptures, we ought to love this book. But the reality"
    },
    {
      "id": 63,
      "start": 399.5400085449219,
      "end": 404.0199890136719,
      "text": " is that I can stand with the psalmist and you can stand with the psalmist and say, oh,"
    },
    {
      "id": 64,
      "start": 404.0199890136719,
      "end": 413.05999755859375,
      "text": " how love I thy law. But in verse number 159, the psalmist says, consider how I love thy"
    },
    {
      "id": 65,
      "start": 413.05999755859375,
      "end": 420.17999267578125,
      "text": " precepts. It's one thing to say that we love it, it's another thing when our life proves"
    },
    {
      "id": 66,
      "start": 420.17999267578125,
      "end": 427.739990234375,
      "text": " that we love it. That the psalmist can really, I believe, cry out in prayer to God and say,"
    },
    {
      "id": 67,
      "start": 427.739990234375,
      "end": 436.4200134277344,
      "text": " consider how I love thy precepts. It's not just an expression that the psalmist is using,"
    },
    {
      "id": 68,
      "start": 436.4200134277344,
      "end": 442.4200134277344,
      "text": " but know his behavior aligns with the claim. Often we find throughout the truth of God's"
    },
    {
      "id": 69,
      "start": 442.4200134277344,
      "end": 449.29998779296875,
      "text": " Word, we've said this over the years, that people can claim a lot of things. If you're"
    },
    {
      "id": 70,
      "start": 449.29998779296875,
      "end": 454.8999938964844,
      "text": " reading the devotion book, we read just a couple of nights ago about a man that in his"
    },
    {
      "id": 71,
      "start": 454.8999938964844,
      "end": 460.17999267578125,
      "text": " will he willed lots of money to all sorts of places and cities and organizations and"
    },
    {
      "id": 72,
      "start": 460.17999267578125,
      "end": 465.4200134277344,
      "text": " so on and so forth. And man, what a great thing. But the reality is that the man died"
    },
    {
      "id": 73,
      "start": 465.4200134277344,
      "end": 475.3800048828125,
      "text": " poor. He had nothing to leave to anyone. We can say whatever we want to say. Jesus said,"
    },
    {
      "id": 74,
      "start": 475.3800048828125,
      "end": 482.05999755859375,
      "text": " if you love me, keep my commandments. The proof of our love is through our behavior."
    },
    {
      "id": 75,
      "start": 482.17999267578125,
      "end": 491.94000244140625,
      "text": " The psalmist says, consider how I love thy precepts. Notice in verse 163, I hate and"
    },
    {
      "id": 76,
      "start": 491.94000244140625,
      "end": 502.739990234375,
      "text": " abhor lying, but thy law do I love. I love it. Notice verse 165, great peace have they"
    },
    {
      "id": 77,
      "start": 502.739990234375,
      "end": 510.5,
      "text": " which love thy law, and nothing shall offend them. You think about the peace that is absent"
    },
    {
      "id": 78,
      "start": 510.5,
      "end": 518.5800170898438,
      "text": " in so many people's lives today. We live in a world where people do not know the peace"
    },
    {
      "id": 79,
      "start": 518.5800170898438,
      "end": 527.5399780273438,
      "text": " of God. But our God, we understand we're able to make peace with God, according to Romans,"
    },
    {
      "id": 80,
      "start": 527.5399780273438,
      "end": 533.739990234375,
      "text": " through the Lord Jesus Christ. But then we have the peace of God that passeth all understanding."
    },
    {
      "id": 81,
      "start": 533.739990234375,
      "end": 540.5800170898438,
      "text": " And we find here that the psalmist says, great peace have they which love thy law,"
    },
    {
      "id": 82,
      "start": 540.5800170898438,
      "end": 547.0999755859375,
      "text": " and nothing shall offend them. And as we meditate and we feast upon the truth of God's Word,"
    },
    {
      "id": 83,
      "start": 547.0999755859375,
      "end": 555.0399780273438,
      "text": " it impacts us to the place where we come, and we have that peace. My soul, verse 167,"
    },
    {
      "id": 84,
      "start": 555.0399780273438,
      "end": 563.02001953125,
      "text": " my soul hath kept thy testimonies. And notice what he says, and I love them exceedingly."
    },
    {
      "id": 85,
      "start": 563.02001953125,
      "end": 567.7000122070312,
      "text": " I think about the expression that is used in verse 167. He's mentioned, as we've looked"
    },
    {
      "id": 86,
      "start": 567.7000122070312,
      "end": 573.219970703125,
      "text": " at all of these verses very quickly this morning, and we've noticed how the psalmist has expressed"
    },
    {
      "id": 87,
      "start": 573.219970703125,
      "end": 578.8599853515625,
      "text": " the fact that he loves the law, he loves the Word of God. And here in verse 167, he says,"
    },
    {
      "id": 88,
      "start": 578.8599853515625,
      "end": 586.5800170898438,
      "text": " I love them exceedingly. I mean, you think about saying, I love something, I love someone,"
    },
    {
      "id": 89,
      "start": 586.5800170898438,
      "end": 591.6599731445312,
      "text": " and we use that expression, and really that's the culmination of our emotions, and we make"
    },
    {
      "id": 90,
      "start": 591.6599731445312,
      "end": 597.0599975585938,
      "text": " that statement, and it carries great weight. But then for the psalmist to say, I love them,"
    },
    {
      "id": 91,
      "start": 597.0599975585938,
      "end": 598.9400024414062,
      "text": " but I love them exceedingly."
    },
    {
      "id": 0,
      "start": 598.9400024414062,
      "end": 602.7800023555756,
      "text": " This book is precious."
    },
    {
      "id": 1,
      "start": 602.7800023555756,
      "end": 607.4200019836426,
      "text": " And this morning, as followers of the Lord Jesus Christ, we ought to love the Scriptures."
    },
    {
      "id": 2,
      "start": 607.4200019836426,
      "end": 610.2200021743774,
      "text": " We ought to love the Word of God."
    },
    {
      "id": 3,
      "start": 610.2200021743774,
      "end": 615.3800029754639,
      "text": " But not only do we love the Word of God, number two, as a follower of Jesus, I should learn"
    },
    {
      "id": 4,
      "start": 615.3800029754639,
      "end": 617.5000019073486,
      "text": " the Scriptures."
    },
    {
      "id": 5,
      "start": 617.5000019073486,
      "end": 619.9000015258789,
      "text": " I should learn the Scriptures."
    },
    {
      "id": 6,
      "start": 619.9000015258789,
      "end": 621.8200016021729,
      "text": " I think about it from this perspective."
    },
    {
      "id": 7,
      "start": 621.8200016021729,
      "end": 625.1800022125244,
      "text": " I love my wife, but I want to learn things about my wife."
    },
    {
      "id": 8,
      "start": 625.5000019073486,
      "end": 631.5400009155273,
      "text": " I want to learn what she, or her interests, and what she likes, and so on and so forth."
    },
    {
      "id": 9,
      "start": 631.5400009155273,
      "end": 636.4000015258789,
      "text": " And because I love her, I want to learn about my wife."
    },
    {
      "id": 10,
      "start": 636.4000015258789,
      "end": 640.3800010681152,
      "text": " And as I think about the love that we should have for the Word of God, the love that we"
    },
    {
      "id": 11,
      "start": 640.3800010681152,
      "end": 645.4200019836426,
      "text": " have for the Scriptures, the reality is that as a follower of Jesus Christ, not only should"
    },
    {
      "id": 12,
      "start": 645.4200019836426,
      "end": 648.8200035095215,
      "text": " I love the Scriptures, but I should learn the Scriptures."
    },
    {
      "id": 13,
      "start": 648.8200035095215,
      "end": 653.4200019836426,
      "text": " And it's amazing to me because I believe that there's a connection between these first two"
    },
    {
      "id": 14,
      "start": 653.4600028991699,
      "end": 655.9800033569336,
      "text": " thoughts this morning, and it's this."
    },
    {
      "id": 15,
      "start": 655.9800033569336,
      "end": 662.060001373291,
      "text": " The more I love the Word of God, the more I desire to learn the Word of God."
    },
    {
      "id": 16,
      "start": 662.060001373291,
      "end": 666.9400024414062,
      "text": " And the more I learn the Word of God, the more I love the Word of God."
    },
    {
      "id": 17,
      "start": 666.9400024414062,
      "end": 669.1399993896484,
      "text": " And it just kind of continues in that cycle."
    },
    {
      "id": 18,
      "start": 669.1399993896484,
      "end": 671.2200012207031,
      "text": " I love it, so I want to learn it."
    },
    {
      "id": 19,
      "start": 671.2200012207031,
      "end": 675.5400009155273,
      "text": " I learn it, and I love it more, and so I want to learn more, and I love more."
    },
    {
      "id": 20,
      "start": 675.5400009155273,
      "end": 683.620002746582,
      "text": " And we come to that place of 167 where the psalmist says, I love thy law exceedingly"
    },
    {
      "id": 21,
      "start": 683.620002746582,
      "end": 694.1800003051758,
      "text": " because I've learned the Scriptures, having that deeper, more intimate walk with God."
    },
    {
      "id": 22,
      "start": 694.1800003051758,
      "end": 704.1000061035156,
      "text": " It's sad, but I know that probably none of us have been contacted about these studies"
    },
    {
      "id": 23,
      "start": 704.1000061035156,
      "end": 709.4200057983398,
      "text": " and surveys and what have you, but there are studies, surveys that are done regularly"
    },
    {
      "id": 24,
      "start": 709.4200057983398,
      "end": 716.1000061035156,
      "text": " with regard to the American population and their relationship to the Word of God."
    },
    {
      "id": 25,
      "start": 716.1000061035156,
      "end": 717.9400024414062,
      "text": " I've never been called."
    },
    {
      "id": 26,
      "start": 717.9400024414062,
      "end": 724.0200042724609,
      "text": " I've never been surveyed, and I'm sure that many of you have not been either."
    },
    {
      "id": 27,
      "start": 724.0200042724609,
      "end": 731.4600067138672,
      "text": " But the statistics based upon those that have been surveyed are alarming."
    },
    {
      "id": 28,
      "start": 731.4600067138672,
      "end": 740.8600006103516,
      "text": " A continual decline over the last several decades of people who even, they claim, the"
    },
    {
      "id": 29,
      "start": 740.8600006103516,
      "end": 745.8200073242188,
      "text": " people that are polled, the people that are surveyed, they claim to attend church at least"
    },
    {
      "id": 30,
      "start": 745.8200073242188,
      "end": 751.5,
      "text": " somewhat regularly, but yet when they answer the question about the Bible, they very rarely"
    },
    {
      "id": 31,
      "start": 751.5,
      "end": 755.0599975585938,
      "text": " ever pick it up to read it."
    },
    {
      "id": 32,
      "start": 755.0599975585938,
      "end": 757.7400054931641,
      "text": " It's sad."
    },
    {
      "id": 33,
      "start": 757.7400054931641,
      "end": 760.8600006103516,
      "text": " Statistics tell us that a number of people that have sat in churches for decades have"
    },
    {
      "id": 34,
      "start": 761.260009765625,
      "end": 766.7400054931641,
      "text": " never read the Bible in its entirety, from Genesis to Revelation."
    },
    {
      "id": 35,
      "start": 766.7400054931641,
      "end": 769.4600067138672,
      "text": " I hope that wouldn't be true of any of us."
    },
    {
      "id": 36,
      "start": 769.4600067138672,
      "end": 770.4600067138672,
      "text": " Why?"
    },
    {
      "id": 37,
      "start": 770.4600067138672,
      "end": 775.0599975585938,
      "text": " Because we not only love the Bible, but we want to learn the Scriptures."
    },
    {
      "id": 38,
      "start": 775.0599975585938,
      "end": 778.3800048828125,
      "text": " How is it that I can learn the Word of God?"
    },
    {
      "id": 39,
      "start": 778.3800048828125,
      "end": 785.5800018310547,
      "text": " How is it, as I know what the psalmist says and I understand the treasure that I hold"
    },
    {
      "id": 40,
      "start": 785.5800018310547,
      "end": 790.8399963378906,
      "text": " in my hand and I begin to develop this love for the Word of God, how is it that I go about"
    },
    {
      "id": 41,
      "start": 790.8399963378906,
      "end": 793.1199951171875,
      "text": " learning the Word of God?"
    },
    {
      "id": 42,
      "start": 793.1199951171875,
      "end": 797.4000091552734,
      "text": " Number one, through our personal devotions, our personal Bible study."
    },
    {
      "id": 43,
      "start": 797.4000091552734,
      "end": 800.8800048828125,
      "text": " You know that the Word of God tells us, we referenced this verse in our Sunday school"
    },
    {
      "id": 44,
      "start": 800.8800048828125,
      "end": 805.6000061035156,
      "text": " this morning in 1 Peter 2 and verse number 2, as newborn babes desire the sincere milk"
    },
    {
      "id": 45,
      "start": 805.6000061035156,
      "end": 808.7200012207031,
      "text": " of the Word that ye may grow thereby."
    },
    {
      "id": 46,
      "start": 808.7200012207031,
      "end": 814.7799987792969,
      "text": " Paul instructs Timothy in 2 Timothy 2 and verse number 15, study to show thyself approved"
    },
    {
      "id": 47,
      "start": 814.7799987792969,
      "end": 820.1199951171875,
      "text": " unto God, a workman that needeth not to be ashamed, rightly dividing the Word of truth"
    },
    {
      "id": 48,
      "start": 820.4000091552734,
      "end": 827.1600036621094,
      "text": " And the reality this morning is that we need to learn personally to dig in and to study"
    },
    {
      "id": 49,
      "start": 827.1600036621094,
      "end": 829.9600067138672,
      "text": " the Scriptures."
    },
    {
      "id": 50,
      "start": 829.9600067138672,
      "end": 835.9199981689453,
      "text": " Can I say to you this morning that you ought to learn the Scriptures in church?"
    },
    {
      "id": 51,
      "start": 835.9199981689453,
      "end": 839.5200042724609,
      "text": " Through church attendance, you ought to learn the Scriptures."
    },
    {
      "id": 52,
      "start": 839.5200042724609,
      "end": 843.9199981689453,
      "text": " But if the only learning you get is what's given from this pulpit, you're not getting"
    },
    {
      "id": 53,
      "start": 843.9199981689453,
      "end": 844.9199981689453,
      "text": " enough."
    },
    {
      "id": 54,
      "start": 844.9199981689453,
      "end": 849.3600006103516,
      "text": " You're not getting enough."
    },
    {
      "id": 55,
      "start": 849.3600006103516,
      "end": 852.5599975585938,
      "text": " Try to just eat physical food twice a week."
    },
    {
      "id": 56,
      "start": 852.5599975585938,
      "end": 856.6400146484375,
      "text": " See how that works for you."
    },
    {
      "id": 57,
      "start": 856.6400146484375,
      "end": 859.8800048828125,
      "text": " Many of us would never even attempt it."
    },
    {
      "id": 58,
      "start": 859.8800048828125,
      "end": 864.8999938964844,
      "text": " But spiritually speaking, there are those that come to church just a couple of times"
    },
    {
      "id": 59,
      "start": 864.8999938964844,
      "end": 869.1199951171875,
      "text": " a week and then they don't have any other spiritual sustenance."
    },
    {
      "id": 60,
      "start": 869.1199951171875,
      "end": 875.0,
      "text": " Oh, we need to learn personally through our personal devotions, through our personal Bible"
    },
    {
      "id": 61,
      "start": 875.0,
      "end": 882.1199951171875,
      "text": " study, digging into the Word of God, feasting upon the manna that God has given us and every"
    },
    {
      "id": 62,
      "start": 882.1199951171875,
      "end": 888.0400085449219,
      "text": " single day getting into the Word of God and saying, God, what do you have for me?"
    },
    {
      "id": 63,
      "start": 888.0400085449219,
      "end": 889.8800048828125,
      "text": " We should learn it through attending church."
    },
    {
      "id": 64,
      "start": 889.8800048828125,
      "end": 892.9599914550781,
      "text": " Number two, yes, the personal devotions, but through church attendance."
    },
    {
      "id": 65,
      "start": 892.9599914550781,
      "end": 896.4800109863281,
      "text": " You know that a church has been instructed throughout the New Testament, there are many"
    },
    {
      "id": 66,
      "start": 896.4800109863281,
      "end": 900.8800048828125,
      "text": " instructions that are given to the church and we understand that God has equipped the"
    },
    {
      "id": 67,
      "start": 900.8800048828125,
      "end": 903.9599914550781,
      "text": " church with spiritual leaders."
    },
    {
      "id": 68,
      "start": 903.9599914550781,
      "end": 908.2000122070312,
      "text": " In fact, as you read Ephesians chapter number four, he says that He gave some pastors and"
    },
    {
      "id": 69,
      "start": 908.2000122070312,
      "end": 913.6400146484375,
      "text": " teachers and God has given the instruction in His Word in the New Testament with regard"
    },
    {
      "id": 70,
      "start": 913.6400146484375,
      "end": 916.3999938964844,
      "text": " to church polity and the setup of a church."
    },
    {
      "id": 71,
      "start": 916.3999938964844,
      "end": 923.7999877929688,
      "text": " And not only has He given the responsibility, the office, the officers of a local church,"
    },
    {
      "id": 72,
      "start": 923.7999877929688,
      "end": 928.6199951171875,
      "text": " the office of a pastor, the office of a deacon, but He's given what the responsibility is"
    },
    {
      "id": 73,
      "start": 928.6199951171875,
      "end": 931.6600036621094,
      "text": " of those that would hold such position."
    },
    {
      "id": 74,
      "start": 931.6600036621094,
      "end": 936.0199890136719,
      "text": " In Acts chapter number 20, the apostle Paul is on his way to Jerusalem and as he's on"
    },
    {
      "id": 75,
      "start": 936.0199890136719,
      "end": 942.2200012207031,
      "text": " his way to Jerusalem, he calls for the church leaders from Ephesus to come and to meet him."
    },
    {
      "id": 76,
      "start": 942.2200012207031,
      "end": 947.2999877929688,
      "text": " And as they meet, he begins to give them instruction, he begins to provide them with some details"
    },
    {
      "id": 77,
      "start": 947.2999877929688,
      "end": 952.6600036621094,
      "text": " with regarding to his ministry there in Ephesus and he challenges these religious leaders"
    },
    {
      "id": 78,
      "start": 952.6600036621094,
      "end": 957.7799987792969,
      "text": " of the church at Ephesus, the elders and the overseers is what they're referred to in verse"
    },
    {
      "id": 79,
      "start": 957.9400024414062,
      "end": 961.5,
      "text": " 17 as elder and verse 28 as the overseer."
    },
    {
      "id": 80,
      "start": 961.5,
      "end": 967.8200073242188,
      "text": " And we find that as Paul is writing to these or speaking to these and as Luke would record"
    },
    {
      "id": 81,
      "start": 967.8200073242188,
      "end": 976.8200073242188,
      "text": " the interaction, notice in Acts 20 and verse number 28, Paul says this to these leaders"
    },
    {
      "id": 82,
      "start": 976.8200073242188,
      "end": 983.4599914550781,
      "text": " of the church at Ephesus, take heed therefore unto yourselves and to all the flock, notice,"
    },
    {
      "id": 83,
      "start": 983.4599914550781,
      "end": 991.1000061035156,
      "text": " for the witch the Holy Ghost hath made you overseers to feed the church of God which"
    },
    {
      "id": 84,
      "start": 991.1000061035156,
      "end": 995.1400146484375,
      "text": " He hath purchased with His own blood."
    },
    {
      "id": 85,
      "start": 995.1400146484375,
      "end": 1000.5400085449219,
      "text": " He doesn't mean to set up a banquet table with a potluck dinner."
    },
    {
      "id": 86,
      "start": 1000.5400085449219,
      "end": 1005.5599975585938,
      "text": " I like potluck dinners, but that's not what Paul's referring to."
    },
    {
      "id": 87,
      "start": 1005.5599975585938,
      "end": 1012.2999877929688,
      "text": " When he says to these church leaders, these pastors at the church at Ephesus, he says"
    },
    {
      "id": 88,
      "start": 1012.2999877929688,
      "end": 1014.739990234375,
      "text": " feed the church of God."
    },
    {
      "id": 89,
      "start": 1014.739990234375,
      "end": 1017.7799987792969,
      "text": " God has given you an entrusted position."
    },
    {
      "id": 90,
      "start": 1017.7799987792969,
      "end": 1023.260009765625,
      "text": " God has placed you in this place of being an overseer and God has called you and God"
    },
    {
      "id": 91,
      "start": 1023.260009765625,
      "end": 1030.5,
      "text": " has placed you there and now your responsibility is to feed the church of God."
    },
    {
      "id": 92,
      "start": 1030.5,
      "end": 1034.2999877929688,
      "text": " Notice what he says, which He hath purchased with His own blood."
    },
    {
      "id": 93,
      "start": 1034.2999877929688,
      "end": 1038.8600158691406,
      "text": " We must always remember that it's God's church."
    },
    {
      "id": 94,
      "start": 1038.8600158691406,
      "end": 1044.6000061035156,
      "text": " We must always remember that the Lord Jesus Christ is the head of the church."
    },
    {
      "id": 95,
      "start": 1044.6000061035156,
      "end": 1049.2999877929688,
      "text": " We find that He continues and He says in verse 29, for I know this, that after my departing"
    },
    {
      "id": 96,
      "start": 1049.2999877929688,
      "end": 1054.9400024414062,
      "text": " shall grievous wolves enter in among you, not sparing the flock."
    },
    {
      "id": 97,
      "start": 1054.9400024414062,
      "end": 1059.3800048828125,
      "text": " Also of your own selves shall men arise, speaking perverse things, to draw away disciples after"
    },
    {
      "id": 98,
      "start": 1059.3800048828125,
      "end": 1060.3800048828125,
      "text": " them."
    },
    {
      "id": 99,
      "start": 1060.3800048828125,
      "end": 1066.1000061035156,
      "text": " Therefore, watch and remember that by the space of three years I cease not to warn everyone"
    },
    {
      "id": 100,
      "start": 1066.1000061035156,
      "end": 1070.8600158691406,
      "text": " night and day with tears."
    },
    {
      "id": 101,
      "start": 1070.8600158691406,
      "end": 1075.9800109863281,
      "text": " The responsibility of the pastor to feed the church of God is because of the false teaching"
    },
    {
      "id": 102,
      "start": 1075.9800109863281,
      "end": 1080.2200012207031,
      "text": " that is prevalent in those that would rise up and he says, you as a pastor, you have"
    },
    {
      "id": 103,
      "start": 1080.2200012207031,
      "end": 1081.5,
      "text": " the responsibility."
    },
    {
      "id": 104,
      "start": 1081.5,
      "end": 1085.8200073242188,
      "text": " So when I say that as a follower of Jesus, I should love the Scriptures, but then I should"
    },
    {
      "id": 105,
      "start": 1085.8200073242188,
      "end": 1090.1000061035156,
      "text": " learn the Scriptures, I not only learn them through my personal Bible study, but I learn"
    },
    {
      "id": 106,
      "start": 1090.1000061035156,
      "end": 1093.739990234375,
      "text": " them by church attendance."
    },
    {
      "id": 107,
      "start": 1093.739990234375,
      "end": 1097.6600036621094,
      "text": " Instead I go to a church that preaches the Word of God."
    },
    {
      "id": 108,
      "start": 1097.6600036621094,
      "end": 1106.1000061035156,
      "text": " I desire, it's my prayer every single week that God would use me to preach the Word."
    },
    {
      "id": 109,
      "start": 1106.1000061035156,
      "end": 1111.1199951171875,
      "text": " Someone asked that was a visitor to our church a couple of years ago, and I do not say this"
    },
    {
      "id": 110,
      "start": 1111.1199951171875,
      "end": 1114.4199829101562,
      "text": " except to say glory to God."
    },
    {
      "id": 111,
      "start": 1114.4199829101562,
      "end": 1118.02001953125,
      "text": " They were visitors to our church, the purpose for them visiting our church is because they"
    },
    {
      "id": 112,
      "start": 1118.02001953125,
      "end": 1122.5800170898438,
      "text": " were looking for a place for their church to rent."
    },
    {
      "id": 113,
      "start": 1122.5800170898438,
      "end": 1126.2999877929688,
      "text": " They're looking for a facility to rent."
    },
    {
      "id": 114,
      "start": 1126.2999877929688,
      "end": 1133.5800170898438,
      "text": " They were not pastors, but they were in position of leadership at the particular church that"
    },
    {
      "id": 115,
      "start": 1133.5800170898438,
      "end": 1136.0599975585938,
      "text": " they were representing."
    },
    {
      "id": 116,
      "start": 1136.0599975585938,
      "end": 1142.5,
      "text": " The close of the service in that back lobby, they said this, do you always feed the flock"
    },
    {
      "id": 117,
      "start": 1142.5,
      "end": 1144.9400024414062,
      "text": " this way?"
    },
    {
      "id": 118,
      "start": 1144.9400024414062,
      "end": 1147.4600219726562,
      "text": " That's humbling."
    },
    {
      "id": 119,
      "start": 1147.4600219726562,
      "end": 1152.1400146484375,
      "text": " And here's what I said, it's my responsibility."
    },
    {
      "id": 120,
      "start": 1152.1400146484375,
      "end": 1158.9000244140625,
      "text": " Listen, there's no reason to go to a church that's not feeding the church."
    },
    {
      "id": 121,
      "start": 1158.9000244140625,
      "end": 1163.4600219726562,
      "text": " There's no reason to go to a church where they're not preaching the Word of God."
    },
    {
      "id": 122,
      "start": 1163.4600219726562,
      "end": 1167.1400146484375,
      "text": " It's not my opinion that's going to change anybody's life."
    },
    {
      "id": 123,
      "start": 1167.1400146484375,
      "end": 1172.5,
      "text": " It is this book that is going to change lives."
    },
    {
      "id": 124,
      "start": 1172.5,
      "end": 1180.0599975585938,
      "text": " Paul says to Timothy in 2 Timothy chapter number 4, he says, listen, preach the Word."
    },
    {
      "id": 125,
      "start": 1180.0599975585938,
      "end": 1185.5399780273438,
      "text": " Be instant in season, out of season, reprove, rebuke, exhort with all longsuffering and"
    },
    {
      "id": 126,
      "start": 1185.5399780273438,
      "end": 1186.5399780273438,
      "text": " doctrine."
    },
    {
      "id": 127,
      "start": 1186.5399780273438,
      "end": 1191.4199829101562,
      "text": " Oh, the time will come when they will not endure sound doctrine."
    },
    {
      "id": 128,
      "start": 1191.4199829101562,
      "end": 1197.6199951171875,
      "text": " But it does not change the responsibility, Timothy, to preach the Word of God."
    },
    {
      "id": 129,
      "start": 1197.6199951171875,
      "end": 1199.02001953125,
      "text": " In 1 Timothy chapter number 4."
    },
    {
      "id": 0,
      "start": 1199.02001953125,
      "end": 1203.7000193595886,
      "text": " I want you to turn there and notice what is said in 1 Timothy chapter number 4 with regard"
    },
    {
      "id": 1,
      "start": 1203.7000193595886,
      "end": 1208.8800191879272,
      "text": " to this responsibility, and I believe that as a pastor is to fulfill the responsibility"
    },
    {
      "id": 2,
      "start": 1208.8800191879272,
      "end": 1216.02001953125,
      "text": " of feeding the church and feeding the flock of God that you can learn the Scriptures sitting"
    },
    {
      "id": 3,
      "start": 1216.02001953125,
      "end": 1222.1400203704834,
      "text": " in the pew at church, sitting in the Sunday school class, sitting in the morning service,"
    },
    {
      "id": 4,
      "start": 1222.1400203704834,
      "end": 1228.1400203704834,
      "text": " the evening service, the midweek service, the opportunity to grow and to learn the Word"
    },
    {
      "id": 5,
      "start": 1228.1400203704834,
      "end": 1235.7400207519531,
      "text": " of God. In 1 Timothy 4 and verse number 6, notice what Paul says to his son of the faith,"
    },
    {
      "id": 6,
      "start": 1235.7400207519531,
      "end": 1241.5400199890137,
      "text": " Timothy. He says, If thou put the brethren in remembrance of these things, thou shalt"
    },
    {
      "id": 7,
      "start": 1241.5400199890137,
      "end": 1247.620018005371,
      "text": " be a good minister of Jesus Christ, nourished up in the words of faith and of good doctrine,"
    },
    {
      "id": 8,
      "start": 1247.620018005371,
      "end": 1257.02001953125,
      "text": " whereunto thou hast attained. You know that God does not use as His measuring, if you"
    },
    {
      "id": 9,
      "start": 1257.02001953125,
      "end": 1264.5800170898438,
      "text": " will, for who a good minister is by the size of a congregation, by the number of ministries"
    },
    {
      "id": 10,
      "start": 1264.5800170898438,
      "end": 1274.02001953125,
      "text": " that a church has. Those are not the parameters that God uses. Paul says to Timothy under"
    },
    {
      "id": 11,
      "start": 1274.02001953125,
      "end": 1279.3000183105469,
      "text": " the inspiration of God, he says, This is what would make you a good minister of Jesus Christ,"
    },
    {
      "id": 12,
      "start": 1279.3000183105469,
      "end": 1283.5000228881836,
      "text": " that you're putting the brethren in remembrance of these things, that you're teaching the"
    },
    {
      "id": 13,
      "start": 1283.5000228881836,
      "end": 1290.1000213623047,
      "text": " Word of God, that you're preaching the Word of God. Peter would say this in 1 Peter 5"
    },
    {
      "id": 14,
      "start": 1290.1000213623047,
      "end": 1297.140022277832,
      "text": " and verse number 2. We looked at verse number 1 a couple of weeks ago, dealing with the"
    },
    {
      "id": 15,
      "start": 1297.140022277832,
      "end": 1302.2600173950195,
      "text": " fact that he, Peter, was a witness of the sufferings of Christ, and he mentions about"
    },
    {
      "id": 16,
      "start": 1302.2600173950195,
      "end": 1307.3800201416016,
      "text": " his own position of being an elder, and as he's writing to the elders, the leaders of"
    },
    {
      "id": 17,
      "start": 1307.3800201416016,
      "end": 1312.1000213623047,
      "text": " the church, he says to them in verse number 2, again, similar to what Paul said to the"
    },
    {
      "id": 18,
      "start": 1312.1000213623047,
      "end": 1318.3000183105469,
      "text": " church leaders in Ephesus in Acts 20, he says, Feed the flock of God, which is among"
    },
    {
      "id": 19,
      "start": 1318.3000183105469,
      "end": 1323.140022277832,
      "text": " you, taking the oversight thereof, not by constraint, but willingly, not for filthy"
    },
    {
      "id": 20,
      "start": 1323.140022277832,
      "end": 1330.8200225830078,
      "text": " lucre, but of a ready mind. Feed, feed the flock of God. How is it that I learn the Scriptures?"
    },
    {
      "id": 21,
      "start": 1330.8200225830078,
      "end": 1335.4200134277344,
      "text": " Well, number one, through your own personal Bible study, your own personal devotion. Number"
    },
    {
      "id": 22,
      "start": 1335.4200134277344,
      "end": 1341.02001953125,
      "text": " two, through church attendance, into a church that teaches and preaches the Word of God,"
    },
    {
      "id": 23,
      "start": 1341.4200134277344,
      "end": 1347.9000244140625,
      "text": " we can learn the Scriptures, we can learn the Word of God. We know that the truth of"
    },
    {
      "id": 24,
      "start": 1347.9000244140625,
      "end": 1352.6600189208984,
      "text": " discipleship would really be my third thought of how we can learn the Scriptures. In Matthew"
    },
    {
      "id": 25,
      "start": 1352.6600189208984,
      "end": 1357.2200164794922,
      "text": " chapter 28, we read the Great Commission, and we, often as we speak about the Great"
    },
    {
      "id": 26,
      "start": 1357.2200164794922,
      "end": 1362.1800231933594,
      "text": " Commission, we're mindful of our responsibility to preach the gospel to every creature, and"
    },
    {
      "id": 27,
      "start": 1362.1800231933594,
      "end": 1368.0600128173828,
      "text": " we know that after conversion, they're to be baptized. But we find that as Jesus would"
    },
    {
      "id": 28,
      "start": 1368.1000213623047,
      "end": 1375.1000213623047,
      "text": " give, really in this passage that is recorded by Matthew, the fullest teaching with regard"
    },
    {
      "id": 29,
      "start": 1375.6600189208984,
      "end": 1381.780014038086,
      "text": " to the Great Commission, Mark simply says, Preach the gospel to every creature. But we"
    },
    {
      "id": 30,
      "start": 1381.780014038086,
      "end": 1386.9400177001953,
      "text": " find that Matthew, as he's recording the words of Christ, it says, All power is given unto"
    },
    {
      "id": 31,
      "start": 1386.9400177001953,
      "end": 1391.3000183105469,
      "text": " me in heaven and earth, in verse 18, Go ye therefore and teach all nations, baptizing"
    },
    {
      "id": 32,
      "start": 1391.3000183105469,
      "end": 1394.8200225830078,
      "text": " them in the name of the Father, and of the Son, and of the Holy Ghost. And then he says"
    },
    {
      "id": 33,
      "start": 1394.9400177001953,
      "end": 1400.9400177001953,
      "text": " this, teaching them, what? Teaching them to observe all things whatsoever I have commanded"
    },
    {
      "id": 34,
      "start": 1400.9400177001953,
      "end": 1406.780014038086,
      "text": " you. And lo, I am with you all the way, even unto the end of the world. Amen."
    },
    {
      "id": 35,
      "start": 1406.780014038086,
      "end": 1412.4200134277344,
      "text": " I remember we were in California just after I got saved. We were in a church for just"
    },
    {
      "id": 36,
      "start": 1412.4200134277344,
      "end": 1417.9000244140625,
      "text": " a short time, but we were involved in a discipleship program as a family. The four of us attended"
    },
    {
      "id": 37,
      "start": 1417.9400177001953,
      "end": 1424.9400177001953,
      "text": " a discipleship program, my parents, my brother, and I. And we would learn. It was a very detailed"
    },
    {
      "id": 38,
      "start": 1425.4200134277344,
      "end": 1430.3400268554688,
      "text": " discipleship program that we were involved in, just for a short period of time. But it"
    },
    {
      "id": 39,
      "start": 1430.3400268554688,
      "end": 1435.8600158691406,
      "text": " was very interesting, and I love discipleship. I love the opportunity to sit in my office"
    },
    {
      "id": 40,
      "start": 1435.8600158691406,
      "end": 1440.9400177001953,
      "text": " or to sit at some other, I don't like Starbucks, but go to Panera or something like that, and"
    },
    {
      "id": 41,
      "start": 1440.9400177001953,
      "end": 1447.9400177001953,
      "text": " be able to sit and just use some Bible teaching and just disciple someone one-on-one and teach"
    },
    {
      "id": 42,
      "start": 1448.260025024414,
      "end": 1452.3400268554688,
      "text": " them the Word of God. You know, one way that you can learn the Scriptures is through getting"
    },
    {
      "id": 43,
      "start": 1452.3400268554688,
      "end": 1459.0600280761719,
      "text": " involved in discipleship. Sometimes we don't learn the Scriptures because we're, please"
    },
    {
      "id": 44,
      "start": 1459.0600280761719,
      "end": 1463.1800231933594,
      "text": " forgive me, I don't mean to be unkind, but at times we're too prideful to even acknowledge"
    },
    {
      "id": 45,
      "start": 1463.1800231933594,
      "end": 1470.1800231933594,
      "text": " that we need to learn. You know, the reality is that as we go to the Word of God and we"
    },
    {
      "id": 46,
      "start": 1471.1800231933594,
      "end": 1475.3400268554688,
      "text": " love the Scriptures, say, I want to learn the Scriptures, and we begin to have with"
    },
    {
      "id": 47,
      "start": 1475.3400268554688,
      "end": 1482.3400268554688,
      "text": " a measure of humility that I need to learn God's Word. I want to learn the truth that"
    },
    {
      "id": 48,
      "start": 1484.9400329589844,
      "end": 1491.9400329589844,
      "text": " God has given within His Word. We begin to go through the process of learning the Scriptures."
    },
    {
      "id": 49,
      "start": 1492.1000061035156,
      "end": 1496.9000244140625,
      "text": " Again, as I mentioned, the more I learn of God's Word, the more I love God's Word. The"
    },
    {
      "id": 50,
      "start": 1496.9000244140625,
      "end": 1501.9400329589844,
      "text": " more I love it, the more I want to learn it. But as we finish this morning, I want"
    },
    {
      "id": 51,
      "start": 1501.9400329589844,
      "end": 1507.9800109863281,
      "text": " you to think about this truth. As a follower of Jesus Christ, I should live the Scriptures."
    },
    {
      "id": 52,
      "start": 1507.9800109863281,
      "end": 1514.9800109863281,
      "text": " Yes, we ought to love the Word of God. It's precious. It's a treasure. Yes, we ought to"
    },
    {
      "id": 53,
      "start": 1515.4600219726562,
      "end": 1522.4600219726562,
      "text": " learn the Word of God. But if we're not living the Word of God, it's not what it's about."
    },
    {
      "id": 54,
      "start": 1523.02001953125,
      "end": 1528.02001953125,
      "text": " It's not what it's about. I'm not learning it just so that I can have some measure of"
    },
    {
      "id": 55,
      "start": 1528.02001953125,
      "end": 1533.7000122070312,
      "text": " head knowledge, just so that I can win some Bible trivia game and be able to answer some"
    },
    {
      "id": 56,
      "start": 1533.7000122070312,
      "end": 1539.8600158691406,
      "text": " questions. No, I'm learning it so that I would live it. And we find that as we look to the"
    },
    {
      "id": 57,
      "start": 1539.8600158691406,
      "end": 1545.3000183105469,
      "text": " Word of God, we find, of course, and we often quote James 1 and verse 22, that we're to"
    },
    {
      "id": 58,
      "start": 1545.3000183105469,
      "end": 1551.5000305175781,
      "text": " be doers of the Word and not hearers only. And the reality is that as I love the Book"
    },
    {
      "id": 59,
      "start": 1551.5000305175781,
      "end": 1558.1800231933594,
      "text": " and as I learn the Book, I should be living the Book. You know, for years, perhaps even,"
    },
    {
      "id": 60,
      "start": 1558.1800231933594,
      "end": 1563.6600341796875,
      "text": " you could look at decades, even some could look at and mention centuries, where Baptist"
    },
    {
      "id": 61,
      "start": 1563.6600341796875,
      "end": 1570.6600341796875,
      "text": " people were called this, people of the Book. People of the Book. What a great compliment."
    },
    {
      "id": 62,
      "start": 1571.4600219726562,
      "end": 1578.4600219726562,
      "text": " Amen? What a great compliment. I've had people over the years say, well, you just believe"
    },
    {
      "id": 63,
      "start": 1579.3800048828125,
      "end": 1586.3800048828125,
      "text": " the Bible. Thank you. Right? I mean, what else do you want me to believe? Yes, I believe"
    },
    {
      "id": 64,
      "start": 1587.4600219726562,
      "end": 1593.7400207519531,
      "text": " the Bible. It's been given by inspiration of God. It is His Word. He is authoritative,"
    },
    {
      "id": 65,
      "start": 1593.7400207519531,
      "end": 1600.7400207519531,
      "text": " and He has given us the authoritative Word. You're too narrow-minded. I'm as broad as"
    },
    {
      "id": 66,
      "start": 1601.6200256347656,
      "end": 1608.6200256347656,
      "text": " the Word of God is. Amen? Where God has given us truth, we don't need to try to be more"
    },
    {
      "id": 67,
      "start": 1608.9000244140625,
      "end": 1614.1000061035156,
      "text": " open-minded about it. It's not that we don't want to be kind and gracious. It's not that"
    },
    {
      "id": 68,
      "start": 1614.1000061035156,
      "end": 1620.260009765625,
      "text": " we don't want to reach people. But the reality is that truth is truth. When's the last time"
    },
    {
      "id": 69,
      "start": 1620.260009765625,
      "end": 1623.780029296875,
      "text": " a student sat in a classroom, I don't know, things are crazy in our world today. Maybe"
    },
    {
      "id": 70,
      "start": 1623.780029296875,
      "end": 1628.6200256347656,
      "text": " it's happening, I don't know. But back in my day, and I'm not that old, but somebody"
    },
    {
      "id": 71,
      "start": 1628.6200256347656,
      "end": 1632.1000061035156,
      "text": " told me that yesterday. You're a pretty young man. I said, thank you very much. I appreciate"
    },
    {
      "id": 72,
      "start": 1632.1000061035156,
      "end": 1635.3400268554688,
      "text": " that. That was right after they told me they weren't sure who was my daughter when they"
    },
    {
      "id": 73,
      "start": 1635.3400268554688,
      "end": 1642.3400268554688,
      "text": " were singing and who was my wife. But anyway, it's, you know, some good, some bad. Anyway,"
    },
    {
      "id": 74,
      "start": 1642.6200256347656,
      "end": 1647.9400329589844,
      "text": " you know, there was never a teacher that I had in school that when I got the math problem"
    },
    {
      "id": 75,
      "start": 1647.9400329589844,
      "end": 1651.9600219726562,
      "text": " wrong that I was able to just tell them, well, that's just, you've got to be more open-minded"
    },
    {
      "id": 76,
      "start": 1651.9600219726562,
      "end": 1658.9600219726562,
      "text": " about it. No, it's wrong, right? Isn't that what they say? It's wrong. This is the right"
    },
    {
      "id": 77,
      "start": 1660.8000183105469,
      "end": 1666.8800048828125,
      "text": " answer. Well, I want this to be the right answer. Well, I'm sorry. It doesn't matter"
    },
    {
      "id": 78,
      "start": 1666.8800048828125,
      "end": 1673.8800048828125,
      "text": " if we're sincere. You know, people can be sincerely wrong. They can be. People can be"
    },
    {
      "id": 79,
      "start": 1673.8800048828125,
      "end": 1680.8800048828125,
      "text": " sincere. People can be sincerely wrong. And it's God that uses His Word that convinces"
    },
    {
      "id": 80,
      "start": 1682.3600158691406,
      "end": 1688.3600158691406,
      "text": " us of truth. And this morning, as I live the Scriptures, as I live out the Word of God,"
    },
    {
      "id": 81,
      "start": 1688.3600158691406,
      "end": 1692.8800048828125,
      "text": " remember what Joshua was told. Turn back to Joshua chapter 1, and I want you to see what"
    },
    {
      "id": 82,
      "start": 1692.8800048828125,
      "end": 1698.1600341796875,
      "text": " God told Joshua. And really, I believe that as you come to the book of Joshua that, of"
    },
    {
      "id": 83,
      "start": 1698.1600341796875,
      "end": 1703.7200317382812,
      "text": " course, Moses has died. And who is it that was the human penman to the Pentateuch? It's"
    },
    {
      "id": 84,
      "start": 1703.7200317382812,
      "end": 1708.8600158691406,
      "text": " Moses. He was the human penman of Genesis, Exodus, Leviticus, Numbers, and Deuteronomy."
    },
    {
      "id": 85,
      "start": 1708.8600158691406,
      "end": 1714.9600219726562,
      "text": " It was God that used Moses to write those books. And we find that Moses has now died."
    },
    {
      "id": 86,
      "start": 1714.9600219726562,
      "end": 1721.52001953125,
      "text": " Moses, my servant, is dead. The Bible plainly tells us that. And Joshua is now the man that"
    },
    {
      "id": 87,
      "start": 1721.760009765625,
      "end": 1728.760009765625,
      "text": " God would use to lead His people, God's people, into the land of promise. And I want you to"
    },
    {
      "id": 88,
      "start": 1728.800048828125,
      "end": 1733.760009765625,
      "text": " notice, we're familiar with the verse of Scripture, but I want you to notice in verse number 8,"
    },
    {
      "id": 89,
      "start": 1733.760009765625,
      "end": 1740.4200439453125,
      "text": " this book of the law. This is the first time after the death of Moses and after the writing"
    },
    {
      "id": 90,
      "start": 1740.4200439453125,
      "end": 1746.6400146484375,
      "text": " of the law, the Pentateuch, the first five books of the Bible, that God now says, this"
    },
    {
      "id": 91,
      "start": 1746.8800048828125,
      "end": 1753.8800048828125,
      "text": " book of the law shall not depart out of thy mouth. Notice what he says, but thou shalt"
    },
    {
      "id": 92,
      "start": 1755.52001953125,
      "end": 1761.4000244140625,
      "text": " meditate therein day and night. Remember, how do I learn the Scriptures? Through my"
    },
    {
      "id": 93,
      "start": 1761.4000244140625,
      "end": 1767.4400024414062,
      "text": " personal devotion. You don't come here day and night. Now, on Sunday, you can. Amen?"
    },
    {
      "id": 94,
      "start": 1767.4400024414062,
      "end": 1772.239990234375,
      "text": " We have service in the morning and in the evening on Sundays. You can come day and night,"
    },
    {
      "id": 95,
      "start": 1772.239990234375,
      "end": 1776.52001953125,
      "text": " and you can feast on the Word of God. But in our own personal lives, he says, thou shalt"
    },
    {
      "id": 96,
      "start": 1776.52001953125,
      "end": 1781.0400390625,
      "text": " meditate therein day and night. Notice what he says, that thou mayest observe, what are"
    },
    {
      "id": 97,
      "start": 1781.0400390625,
      "end": 1788.0400390625,
      "text": " the next two words? To do. I love it, I learn it, but I must live it. To do according to"
    },
    {
      "id": 98,
      "start": 1793.8400268554688,
      "end": 1798.8400268554688,
      "text": " all that you want to do. Nope. According to all that you want to do."
    },
    {
      "id": 0,
      "start": 1798.8400268554688,
      "end": 1803.9600267410278,
      "text": " that is written therein,\" right?"
    },
    {
      "id": 1,
      "start": 1803.9600267410278,
      "end": 1808.0600271224976,
      "text": " Then notice what he says, for then."
    },
    {
      "id": 2,
      "start": 1808.0600271224976,
      "end": 1810.6400270462036,
      "text": " Now what is then?"
    },
    {
      "id": 3,
      "start": 1810.6400270462036,
      "end": 1815.0400276184082,
      "text": " It is the result of the process that is laid out."
    },
    {
      "id": 4,
      "start": 1815.0400276184082,
      "end": 1820.9600276947021,
      "text": " Then does not come if we do not fulfill the process that is laid out, right?"
    },
    {
      "id": 5,
      "start": 1820.9600276947021,
      "end": 1821.9600276947021,
      "text": " It's the result."
    },
    {
      "id": 6,
      "start": 1821.9600276947021,
      "end": 1823.7200260162354,
      "text": " It's the outcome."
    },
    {
      "id": 7,
      "start": 1823.7200260162354,
      "end": 1825.240026473999,
      "text": " Would you agree?"
    },
    {
      "id": 8,
      "start": 1825.240026473999,
      "end": 1834.5600280761719,
      "text": " For then thou shalt make thy way prosperous, and then thou shalt have good success."
    },
    {
      "id": 9,
      "start": 1834.5600280761719,
      "end": 1838.720027923584,
      "text": " How many people today in our world are looking for prosperity and success?"
    },
    {
      "id": 10,
      "start": 1838.720027923584,
      "end": 1845.9200286865234,
      "text": " Thousands, millions, they're looking for prosperity and they're looking for success."
    },
    {
      "id": 11,
      "start": 1845.9200286865234,
      "end": 1854.3600273132324,
      "text": " I would submit to you that they're using a different measurement for success and prosperity."
    },
    {
      "id": 12,
      "start": 1854.3600273132324,
      "end": 1860.6400260925293,
      "text": " Their perspective of being prosperous and being successful is different than what God's"
    },
    {
      "id": 13,
      "start": 1860.6400260925293,
      "end": 1862.4000282287598,
      "text": " Word says."
    },
    {
      "id": 14,
      "start": 1862.4000282287598,
      "end": 1868.1200256347656,
      "text": " Many people today have the idea that prosperity and success is primarily based upon the size"
    },
    {
      "id": 15,
      "start": 1868.1200256347656,
      "end": 1869.6400299072266,
      "text": " of your bank account."
    },
    {
      "id": 16,
      "start": 1869.6400299072266,
      "end": 1872.4800262451172,
      "text": " It's a very common belief."
    },
    {
      "id": 17,
      "start": 1872.4800262451172,
      "end": 1879.7200241088867,
      "text": " But you know there are some people that have some really big bank accounts and are miserable?"
    },
    {
      "id": 18,
      "start": 1879.7200241088867,
      "end": 1886.880027770996,
      "text": " Riches make themselves wings and fly away, that's what the Word of God says."
    },
    {
      "id": 19,
      "start": 1886.880027770996,
      "end": 1895.4800262451172,
      "text": " Listen, when we take the truth of Joshua 1 and verse 8, and we take the Book of God,"
    },
    {
      "id": 20,
      "start": 1895.4800262451172,
      "end": 1900.9200286865234,
      "text": " the Word of God, the Book that He has given us, the precious Bible, and we meditate there"
    },
    {
      "id": 21,
      "start": 1900.9200286865234,
      "end": 1905.2400283813477,
      "text": " in day and night, and we're learning the Scriptures and we're loving the Scriptures, but we're"
    },
    {
      "id": 22,
      "start": 1905.2400283813477,
      "end": 1912.160026550293,
      "text": " going and seeking the Scriptures for the purpose of obedience, to do according to"
    },
    {
      "id": 23,
      "start": 1912.160026550293,
      "end": 1921.9200286865234,
      "text": " all that is written therein, then thou shalt make thy way prosperous and then thou shalt"
    },
    {
      "id": 24,
      "start": 1921.9200286865234,
      "end": 1923.8400268554688,
      "text": " have good success."
    },
    {
      "id": 25,
      "start": 1923.8400268554688,
      "end": 1928.4400329589844,
      "text": " Psalm 19 and verse number 11, I want you to notice in this psalm, of course, we begin"
    },
    {
      "id": 26,
      "start": 1928.4400329589844,
      "end": 1934.9600219726562,
      "text": " with the declaration of the glories of heaven and how the heavens declare the glory of God"
    },
    {
      "id": 27,
      "start": 1934.9600219726562,
      "end": 1937.1200256347656,
      "text": " and the firmament showeth His handiwork."
    },
    {
      "id": 28,
      "start": 1937.1200256347656,
      "end": 1941.280029296875,
      "text": " And you think about the way in which Psalm 19 begins with the creation and the glory"
    },
    {
      "id": 29,
      "start": 1941.280029296875,
      "end": 1945.6400299072266,
      "text": " of creation, but how the creation declares the glory of God."
    },
    {
      "id": 30,
      "start": 1945.6400299072266,
      "end": 1946.6400299072266,
      "text": " Why?"
    },
    {
      "id": 31,
      "start": 1946.6400299072266,
      "end": 1951.2400207519531,
      "text": " Because the creation requires a creator."
    },
    {
      "id": 32,
      "start": 1951.2400207519531,
      "end": 1958.4000244140625,
      "text": " People have just thrown away that simple truth wholesale today in our society."
    },
    {
      "id": 33,
      "start": 1958.4000244140625,
      "end": 1961.5600280761719,
      "text": " You ask somebody that denies a creator, ask them if they have a watch on."
    },
    {
      "id": 34,
      "start": 1961.5600280761719,
      "end": 1966.6800231933594,
      "text": " Well, yeah, well, who designed the watch?"
    },
    {
      "id": 35,
      "start": 1966.6800231933594,
      "end": 1971.4400329589844,
      "text": " The watch requires a designer, right?"
    },
    {
      "id": 36,
      "start": 1971.4400329589844,
      "end": 1972.4400329589844,
      "text": " It didn't just..."
    },
    {
      "id": 37,
      "start": 1972.4400329589844,
      "end": 1974.800033569336,
      "text": " Somebody didn't just put all the pieces..."
    },
    {
      "id": 38,
      "start": 1974.800033569336,
      "end": 1976.280029296875,
      "text": " First of all, where'd you get the pieces?"
    },
    {
      "id": 39,
      "start": 1976.280029296875,
      "end": 1979.800033569336,
      "text": " But even if they could, they didn't just put all the pieces in a box and then came out"
    },
    {
      "id": 40,
      "start": 1979.800033569336,
      "end": 1982.52001953125,
      "text": " a watch."
    },
    {
      "id": 41,
      "start": 1982.52001953125,
      "end": 1985.1200256347656,
      "text": " If that could happen, they wouldn't be able to sell them for as much as they sell them"
    },
    {
      "id": 42,
      "start": 1985.1200256347656,
      "end": 1986.1200256347656,
      "text": " for."
    },
    {
      "id": 43,
      "start": 1986.1200256347656,
      "end": 1987.1200256347656,
      "text": " Amen?"
    },
    {
      "id": 44,
      "start": 1988.1200256347656,
      "end": 1992.800033569336,
      "text": " But the reality is that the heavens declare the glory of God."
    },
    {
      "id": 45,
      "start": 1992.800033569336,
      "end": 1996.0800323486328,
      "text": " And then the psalmist goes into the Word of God, beginning in verse number 7, the law"
    },
    {
      "id": 46,
      "start": 1996.0800323486328,
      "end": 1999.280029296875,
      "text": " of the Lord is perfect, converting the soul."
    },
    {
      "id": 47,
      "start": 1999.280029296875,
      "end": 2002.0800323486328,
      "text": " The testimony of the Lord is sure, making wise the simple."
    },
    {
      "id": 48,
      "start": 2002.0800323486328,
      "end": 2004.52001953125,
      "text": " The statutes of the Lord are right, rejoicing the heart."
    },
    {
      "id": 49,
      "start": 2004.52001953125,
      "end": 2007.4400329589844,
      "text": " The commandment of the Lord is pure, enlightening the eyes."
    },
    {
      "id": 50,
      "start": 2007.4400329589844,
      "end": 2009.800033569336,
      "text": " The fear of the Lord is clean, enduring forever."
    },
    {
      "id": 51,
      "start": 2009.800033569336,
      "end": 2013.0800323486328,
      "text": " The judgments of the Lord are true and righteous altogether."
    },
    {
      "id": 52,
      "start": 2013.0800323486328,
      "end": 2014.0800323486328,
      "text": " Notice what he says."
    },
    {
      "id": 53,
      "start": 2014.0800323486328,
      "end": 2023.260025024414,
      "text": " More to be desired are they than gold, yea, than much fine gold, sweeter also than honey"
    },
    {
      "id": 54,
      "start": 2023.260025024414,
      "end": 2024.260025024414,
      "text": " and the honeycomb."
    },
    {
      "id": 55,
      "start": 2024.260025024414,
      "end": 2030.6000213623047,
      "text": " But then notice what he says in verse number 11, moreover by them, by the Scriptures, by"
    },
    {
      "id": 56,
      "start": 2030.6000213623047,
      "end": 2035.1000213623047,
      "text": " the Word of God, moreover by them is thy servant warned."
    },
    {
      "id": 57,
      "start": 2035.1000213623047,
      "end": 2040.800033569336,
      "text": " Many people don't like warnings, but I'm thankful for warnings."
    },
    {
      "id": 58,
      "start": 2040.800033569336,
      "end": 2048.4000244140625,
      "text": " You have containers at home that have warning labels, right?"
    },
    {
      "id": 59,
      "start": 2048.4000244140625,
      "end": 2052.040023803711,
      "text": " Those warning labels are there for a reason."
    },
    {
      "id": 60,
      "start": 2052.040023803711,
      "end": 2056.8400268554688,
      "text": " Sometimes the elements that are contained within that package could kill you."
    },
    {
      "id": 61,
      "start": 2056.8400268554688,
      "end": 2058.4000244140625,
      "text": " They're poison, right?"
    },
    {
      "id": 62,
      "start": 2058.4000244140625,
      "end": 2060.9200134277344,
      "text": " They have warning labels."
    },
    {
      "id": 63,
      "start": 2060.9200134277344,
      "end": 2065.760040283203,
      "text": " The Word of God contains warnings, but then notice what he says at the end of verse number"
    },
    {
      "id": 64,
      "start": 2065.760040283203,
      "end": 2066.760040283203,
      "text": " 11."
    },
    {
      "id": 65,
      "start": 2066.760040283203,
      "end": 2072.280029296875,
      "text": " In keeping of them, there is great reward."
    },
    {
      "id": 66,
      "start": 2072.280029296875,
      "end": 2073.280029296875,
      "text": " Great reward."
    },
    {
      "id": 67,
      "start": 2073.280029296875,
      "end": 2077.4200134277344,
      "text": " I'm so thankful that God blesses obedience to His Word."
    },
    {
      "id": 68,
      "start": 2077.4200134277344,
      "end": 2084.2000122070312,
      "text": " In keeping of them, living out the Scriptures, doing what God has said in His Word, there"
    },
    {
      "id": 69,
      "start": 2084.2000122070312,
      "end": 2085.6400146484375,
      "text": " is great reward."
    },
    {
      "id": 70,
      "start": 2085.6400146484375,
      "end": 2091.52001953125,
      "text": " The psalmist cries out in Psalm 86 and verse number 11 his desire to learn the Scriptures."
    },
    {
      "id": 71,
      "start": 2091.52001953125,
      "end": 2096.060028076172,
      "text": " Of course, we've mentioned already that I love the Word of God, so I desire to learn"
    },
    {
      "id": 72,
      "start": 2096.060028076172,
      "end": 2097.1200256347656,
      "text": " the Word of God."
    },
    {
      "id": 73,
      "start": 2097.1200256347656,
      "end": 2100.4200134277344,
      "text": " And as I learn the Word of God, I love the Word of God, and I learn more of the Word"
    },
    {
      "id": 74,
      "start": 2100.4200134277344,
      "end": 2101.4200134277344,
      "text": " of God."
    },
    {
      "id": 75,
      "start": 2101.4200134277344,
      "end": 2105.740020751953,
      "text": " And here the psalmist says in Psalm 86 and verse number 11, teach me thy way, O Lord."
    },
    {
      "id": 76,
      "start": 2105.740020751953,
      "end": 2107.1000366210938,
      "text": " I want to learn it."
    },
    {
      "id": 77,
      "start": 2107.1000366210938,
      "end": 2108.1000366210938,
      "text": " Why?"
    },
    {
      "id": 78,
      "start": 2108.1000366210938,
      "end": 2113.820037841797,
      "text": " I will walk in thy truth, unite my heart to fear thy name."
    },
    {
      "id": 79,
      "start": 2113.820037841797,
      "end": 2114.820037841797,
      "text": " I want to live it."
    },
    {
      "id": 80,
      "start": 2114.820037841797,
      "end": 2118.760040283203,
      "text": " I want to live out the Word of God."
    },
    {
      "id": 81,
      "start": 2118.760040283203,
      "end": 2123.280029296875,
      "text": " We started in 1 Peter by quoting a portion of Scripture of being born again, not of corruptible"
    },
    {
      "id": 82,
      "start": 2123.280029296875,
      "end": 2125.7000122070312,
      "text": " seed but of incorruptible."
    },
    {
      "id": 83,
      "start": 2125.7000122070312,
      "end": 2129.6200256347656,
      "text": " The Word of God which liveth and abideth forever."
    },
    {
      "id": 84,
      "start": 2129.6200256347656,
      "end": 2134.6200256347656,
      "text": " I want you to notice what Peter then says in 2 Peter chapter number 1."
    },
    {
      "id": 85,
      "start": 2134.6200256347656,
      "end": 2141.260040283203,
      "text": " We'll finish with this portion of Scripture, and I want you to consider the truth that"
    },
    {
      "id": 86,
      "start": 2141.260040283203,
      "end": 2146.1000366210938,
      "text": " Peter is expressing to these that he's writing to."
    },
    {
      "id": 87,
      "start": 2146.1000366210938,
      "end": 2151.060028076172,
      "text": " Now understand contextually in 2 Peter chapter number 1, Peter is just speaking about being"
    },
    {
      "id": 88,
      "start": 2151.060028076172,
      "end": 2153.7000122070312,
      "text": " an eyewitness of the majesty of God."
    },
    {
      "id": 89,
      "start": 2153.7000122070312,
      "end": 2156.7000122070312,
      "text": " He's speaking about his experience at the Mount of Transfiguration."
    },
    {
      "id": 90,
      "start": 2156.7000122070312,
      "end": 2160.4600219726562,
      "text": " We don't have time to develop all of that this morning, but that's what he's referring"
    },
    {
      "id": 91,
      "start": 2160.4600219726562,
      "end": 2165.1800231933594,
      "text": " to in verse 15 down through verse number 18."
    },
    {
      "id": 92,
      "start": 2165.1800231933594,
      "end": 2170.740020751953,
      "text": " Peter, James, and John, they went up on that day and they saw the glory of the Lord Jesus"
    },
    {
      "id": 93,
      "start": 2170.740020751953,
      "end": 2174.060028076172,
      "text": " Christ and the Mount of Transfiguration."
    },
    {
      "id": 94,
      "start": 2174.060028076172,
      "end": 2181.5800170898438,
      "text": " And Peter, after speaking about that experience, he says this in verse number 19, we have also"
    },
    {
      "id": 95,
      "start": 2181.5800170898438,
      "end": 2187.2000122070312,
      "text": " a more sure word of prophecy."
    },
    {
      "id": 96,
      "start": 2187.2000122070312,
      "end": 2195.820037841797,
      "text": " Now notice what he says, whereunto ye do well that ye take heed, as unto a light that shineth"
    },
    {
      "id": 97,
      "start": 2195.820037841797,
      "end": 2200.02001953125,
      "text": " in a dark place, unto the day that dawn and the day star arise in your hearts."
    },
    {
      "id": 98,
      "start": 2200.02001953125,
      "end": 2204.7000122070312,
      "text": " I remember speaking with Doc actually a number of years ago about this verse of Scripture."
    },
    {
      "id": 99,
      "start": 2204.7000122070312,
      "end": 2209.780029296875,
      "text": " And it's interesting the analogy that is used, the imagery that is given to us when he talks"
    },
    {
      "id": 100,
      "start": 2209.780029296875,
      "end": 2213.9800415039062,
      "text": " about as unto a light that shineth in a dark place."
    },
    {
      "id": 101,
      "start": 2213.9800415039062,
      "end": 2215.3400268554688,
      "text": " You know what's interesting?"
    },
    {
      "id": 102,
      "start": 2215.3400268554688,
      "end": 2219.1000366210938,
      "text": " If we're in this place, and it'd have to be late now because of the time change, but if"
    },
    {
      "id": 103,
      "start": 2219.1000366210938,
      "end": 2226.5800170898438,
      "text": " we're in this room and it's completely dark, and your attention immediately would turn"
    },
    {
      "id": 104,
      "start": 2226.5800170898438,
      "end": 2229.2200317382812,
      "text": " if there was a light that was turned on."
    },
    {
      "id": 105,
      "start": 2229.2200317382812,
      "end": 2232.9800415039062,
      "text": " If someone just had a little flashlight, those little flashlights that we give out that the"
    },
    {
      "id": 106,
      "start": 2232.9800415039062,
      "end": 2233.9800415039062,
      "text": " kids love so much."
    },
    {
      "id": 107,
      "start": 2233.9800415039062,
      "end": 2237.2200317382812,
      "text": " I guess it was the missionaries last week, and man, that little kid pointed it right"
    },
    {
      "id": 108,
      "start": 2237.2200317382812,
      "end": 2238.2200317382812,
      "text": " in his eye."
    },
    {
      "id": 109,
      "start": 2238.2200317382812,
      "end": 2239.2200317382812,
      "text": " The oldest of the kids."
    },
    {
      "id": 110,
      "start": 2239.6600341796875,
      "end": 2241.6600341796875,
      "text": " He's like, come on, man, seriously?"
    },
    {
      "id": 111,
      "start": 2241.6600341796875,
      "end": 2245.02001953125,
      "text": " He's like, it's bright, you think?"
    },
    {
      "id": 112,
      "start": 2245.02001953125,
      "end": 2249.5400390625,
      "text": " But anyway, if we're in a completely dark place, and you just turn on a little light,"
    },
    {
      "id": 113,
      "start": 2249.5400390625,
      "end": 2250.5400390625,
      "text": " you know where your attention is going to go?"
    },
    {
      "id": 114,
      "start": 2250.5400390625,
      "end": 2251.5400390625,
      "text": " It's going to go to the light."
    },
    {
      "id": 115,
      "start": 2251.5400390625,
      "end": 2257.6200256347656,
      "text": " It's going to go to the light."
    },
    {
      "id": 116,
      "start": 2257.6200256347656,
      "end": 2264.5800170898438,
      "text": " And Peter says that we have a more sure word of prophecy, whereunto ye do well that ye"
    },
    {
      "id": 117,
      "start": 2264.5800170898438,
      "end": 2265.5800170898438,
      "text": " take heed."
    },
    {
      "id": 118,
      "start": 2265.7000122070312,
      "end": 2270.300018310547,
      "text": " You know, it's in our best interest to obey the Word of God, to live the Word of God in"
    },
    {
      "id": 119,
      "start": 2270.300018310547,
      "end": 2272.7000122070312,
      "text": " our best interest."
    },
    {
      "id": 120,
      "start": 2272.7000122070312,
      "end": 2278.4200134277344,
      "text": " We're not going to take the time to go there, but in Acts 27, Paul is going to be shipwrecked,"
    },
    {
      "id": 121,
      "start": 2278.4200134277344,
      "end": 2279.9000244140625,
      "text": " and it's a terrible situation."
    },
    {
      "id": 122,
      "start": 2279.9000244140625,
      "end": 2288.060028076172,
      "text": " You know, it's interesting, before they ever set sail, Paul said we shouldn't go."
    },
    {
      "id": 123,
      "start": 2288.060028076172,
      "end": 2289.060028076172,
      "text": " You read it."
    },
    {
      "id": 124,
      "start": 2289.060028076172,
      "end": 2290.060028076172,
      "text": " Go back and read Acts 27."
    },
    {
      "id": 125,
      "start": 2290.060028076172,
      "end": 2291.740020751953,
      "text": " He says we shouldn't go."
    },
    {
      "id": 126,
      "start": 2291.740020751953,
      "end": 2294.5800170898438,
      "text": " But the other people that were there, the owners of the ship and others, they said,"
    },
    {
      "id": 127,
      "start": 2294.5800170898438,
      "end": 2295.5800170898438,
      "text": " you know, it's fine."
    },
    {
      "id": 128,
      "start": 2295.5800170898438,
      "end": 2296.5800170898438,
      "text": " We should go."
    },
    {
      "id": 129,
      "start": 2296.5800170898438,
      "end": 2299.3400268554688,
      "text": " It didn't work out so well for them."
    },
    {
      "id": 130,
      "start": 2299.3400268554688,
      "end": 2302.4200134277344,
      "text": " And I've often thought about this when I read that passage of Scripture."
    },
    {
      "id": 131,
      "start": 2302.4200134277344,
      "end": 2309.260040283203,
      "text": " You know, everyone believes something, and everyone believes someone, right?"
    },
    {
      "id": 132,
      "start": 2309.260040283203,
      "end": 2316.6600341796875,
      "text": " The people that would like to criticize you for believing the Bible, they believe something."
    },
    {
      "id": 133,
      "start": 2316.6600341796875,
      "end": 2323.9400024414062,
      "text": " Whether they themselves are their own authority, or some other person is their authority, some"
    },
    {
      "id": 134,
      "start": 2323.9400024414062,
      "end": 2329.1000366210938,
      "text": " other religion, some other science, whatever it might be, humanism."
    },
    {
      "id": 135,
      "start": 2329.1000366210938,
      "end": 2330.1000366210938,
      "text": " Somebody is their authority."
    },
    {
      "id": 136,
      "start": 2330.1000366210938,
      "end": 2331.1000366210938,
      "text": " They believe somebody."
    },
    {
      "id": 137,
      "start": 2331.1000366210938,
      "end": 2337.1000366210938,
      "text": " And this morning, we need to believe God."
    },
    {
      "id": 138,
      "start": 2337.1000366210938,
      "end": 2341.1400146484375,
      "text": " The psalmist declares, oh, how love I thy law."
    },
    {
      "id": 139,
      "start": 2341.1400146484375,
      "end": 2346.9800415039062,
      "text": " I wonder this morning, can we stand with the psalmist and say, I love the Word of God."
    },
    {
      "id": 140,
      "start": 2346.9800415039062,
      "end": 2351.6600341796875,
      "text": " I love it exceedingly."
    },
    {
      "id": 141,
      "start": 2351.6600341796875,
      "end": 2357.2200317382812,
      "text": " And that love that I have for the Word of God results in me learning the Word of God"
    },
    {
      "id": 142,
      "start": 2357.2200317382812,
      "end": 2359.7400512695312,
      "text": " through my personal devotions."
    },
    {
      "id": 143,
      "start": 2359.7400512695312,
      "end": 2363.6600341796875,
      "text": " Every day, I can't wait to get to my time of devotion."
    },
    {
      "id": 144,
      "start": 2363.6600341796875,
      "end": 2367.780029296875,
      "text": " You know, there are some people that have certain things that they do every day."
    },
    {
      "id": 145,
      "start": 2367.780029296875,
      "end": 2369.780029296875,
      "text": " They can't wait to get to read the news."
    },
    {
      "id": 146,
      "start": 2369.780029296875,
      "end": 2373.3800048828125,
      "text": " I hate the news."
    },
    {
      "id": 147,
      "start": 2373.3800048828125,
      "end": 2377.5,
      "text": " I like to try to keep myself aware of what's going on, but man, I don't like it."
    },
    {
      "id": 148,
      "start": 2377.5,
      "end": 2381.9400024414062,
      "text": " I'd rather read the Word of God."
    },
    {
      "id": 149,
      "start": 2381.9400024414062,
      "end": 2388.02001953125,
      "text": " And do we have that longing for I can't wait to get to God and His Word?"
    },
    {
      "id": 150,
      "start": 2388.02001953125,
      "end": 2392.3800048828125,
      "text": " I'm learning the Scriptures, but then I'm living the Scriptures."
    },
    {
      "id": 151,
      "start": 2392.3800048828125,
      "end": 2396.300048828125,
      "text": " Every day when I go to the Word of God, God, what is it that You're showing me in Your"
    },
    {
      "id": 152,
      "start": 2396.300048828125,
      "end": 2398.4200439453125,
      "text": " Word that I need to apply in my life?"
    },
    {
      "id": 0,
      "start": 2398.4200439453125,
      "end": 2402.82004404068,
      "text": " How can I be a doer of Your Word?"
    },
    {
      "id": 1,
      "start": 2402.82004404068,
      "end": 2407.900043487549,
      "text": " How do I take this truth and apply it in my life?"
    },
    {
      "id": 2,
      "start": 2407.900043487549,
      "end": 2413.7000436782837,
      "text": " As believers, as followers of the Lord Jesus Christ, I hope that it'd be said of us that"
    },
    {
      "id": 3,
      "start": 2413.7000436782837,
      "end": 2418.1800441741943,
      "text": " we love the Word of God, that we're learning the Word of God, and that we're living the"
    },
    {
      "id": 4,
      "start": 2418.1800441741943,
      "end": 2419.1800441741943,
      "text": " Word of God."
    },
    {
      "id": 5,
      "start": 2419.1800441741943,
      "end": 2420.1800441741943,
      "text": " Let's pray."
    },
    {
      "id": 6,
      "start": 2420.1800441741943,
      "end": 2421.1800441741943,
      "text": " Father, we love You."
    },
    {
      "id": 7,
      "start": 2421.1800441741943,
      "end": 2422.1800441741943,
      "text": " We thank You for loving us."
    },
    {
      "id": 8,
      "start": 2422.1800441741943,
      "end": 2425.3400440216064,
      "text": " We thank You so much for this precious book, the Bible."
    },
    {
      "id": 9,
      "start": 2425.3400440216064,
      "end": 2430.5800437927246,
      "text": " How thankful we are to have the Word of God."
    },
    {
      "id": 10,
      "start": 2430.5800437927246,
      "end": 2435.620044708252,
      "text": " And I pray this morning that as we've spent just a little while speaking about our relationship"
    },
    {
      "id": 11,
      "start": 2435.620044708252,
      "end": 2440.620044708252,
      "text": " to Your Word, I pray that each of us could say that we love Your Word and we're learning"
    },
    {
      "id": 12,
      "start": 2440.620044708252,
      "end": 2443.9800453186035,
      "text": " Your Word, we're living Your Word."
    },
    {
      "id": 13,
      "start": 2443.9800453186035,
      "end": 2449.4200439453125,
      "text": " God, I pray that Your Spirit would speak to us as individuals."
    },
    {
      "id": 14,
      "start": 2449.4200439453125,
      "end": 2455.620044708252,
      "text": " Maybe we need to learn it more."
    },
    {
      "id": 15,
      "start": 2455.620044708252,
      "end": 2458.0800437927246,
      "text": " Maybe we need to live it more."
    },
    {
      "id": 16,
      "start": 2458.0800437927246,
      "end": 2465.780044555664,
      "text": " Maybe there's some things that we're not applying in our lives."
    },
    {
      "id": 17,
      "start": 2465.780044555664,
      "end": 2470.1000442504883,
      "text": " Maybe our devotion life is not what it ought to be."
    },
    {
      "id": 18,
      "start": 2470.1000442504883,
      "end": 2474.500045776367,
      "text": " Maybe our church attendance is not what it ought to be."
    },
    {
      "id": 19,
      "start": 2474.500045776367,
      "end": 2483.780044555664,
      "text": " And we're missing out on those meals, those spiritual meals, the milk and meat of the"
    },
    {
      "id": 20,
      "start": 2483.780044555664,
      "end": 2485.060043334961,
      "text": " Word of God."
    },
    {
      "id": 21,
      "start": 2485.060043334961,
      "end": 2490.7400436401367,
      "text": " God, I pray that You'd move in the moments of invitation."
    },
    {
      "id": 22,
      "start": 2490.7400436401367,
      "end": 2495.6400451660156,
      "text": " You'd help us, Lord, to respond in obedience."
    },
    {
      "id": 23,
      "start": 2495.6400451660156,
      "end": 2500.1400451660156,
      "text": " If there's one that's present with us that's not sure of heaven, they've never trusted"
    },
    {
      "id": 24,
      "start": 2500.1400451660156,
      "end": 2502.9800415039062,
      "text": " the Lord Jesus Christ as their personal Savior."
    },
    {
      "id": 25,
      "start": 2503.46004486084,
      "end": 2511.7000427246094,
      "text": " God, I pray that today they would understand the love that You have for them."
    },
    {
      "id": 26,
      "start": 2511.7000427246094,
      "end": 2513.4200439453125,
      "text": " We sang about being ransomed."
    },
    {
      "id": 27,
      "start": 2513.4200439453125,
      "end": 2519.0200424194336,
      "text": " We sang about the love, and can it be?"
    },
    {
      "id": 28,
      "start": 2519.0200424194336,
      "end": 2523.340042114258,
      "text": " We started with speaking about being born again, not of corruptible seed but of incorruptible"
    },
    {
      "id": 29,
      "start": 2523.340042114258,
      "end": 2526.3000411987305,
      "text": " by the Word of God which liveth and abideth forever."
    },
    {
      "id": 30,
      "start": 2526.3000411987305,
      "end": 2531.5400390625,
      "text": " If there's one present that's not sure of heaven, we'd love to take a Bible, the authoritative"
    },
    {
      "id": 31,
      "start": 2531.5400390625,
      "end": 2536.260040283203,
      "text": " Word of God, and show them how they can know for sure that heaven is their home."
    },
    {
      "id": 32,
      "start": 2536.260040283203,
      "end": 2539.1000366210938,
      "text": " I pray that You'd move and work, have Your way."
    },
    {
      "id": 33,
      "start": 2539.1000366210938,
      "end": 2540.4600372314453,
      "text": " In Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T15:14:00.223220"
}