{
  "video_id": "VUxY_FF000Q",
  "text": "but he knoweth the way that I take. When he hath tried me, I shall come forth as gold.\" What a great truth. You think about Job. We mentioned a little bit in Sunday school about Job this morning in my class, and you think about the trial that he endured, and God is at work. The psalmist said this, \"'It was good for me that I was afflicted.'\" It was good for me that I was afflicted, why? Because then I learned thy statutes. And what a blessing when we have that perspective that God doeth all things well, that he has a perfect plan, and what a blessing. His goal for us as his people is that we would be conformed to the image of his dear son. Romans 8 and verse 29, and what a blessed truth of God's word. If you have your Bible with you this morning, 1 Timothy chapter six, 1 Timothy chapter number six this morning, and we dealt with the beginning of this passage of scripture last week, and looked at verses one through 10, and we talked about the importance last week of developing biblical perspective, and we talked about biblical perspective with regard to conversion, with regard to contending, and that we're to earnestly contend for the faith, and then also a biblical perspective on contentment. As we enter into the next portion, we're just gonna look at verses 11 and 12 this morning. These two verses of scripture are full. They're just packed with truth that is so important for us to understand, and we do not wanna just quickly go through them. As we look at the text of scripture in verse 11, notice the Bible says, \"'But thou, O man of God, flee these things, \"'and follow after righteousness, godliness, \"'faith, love, patience, meekness. \"'Fight the good fight of faith. \"'Lay hold on eternal life, \"'whereunto thou art also called, \"'and hast professed a good profession \"'before many witnesses.'\" I've titled the message this morning, Flee, Follow, Fight. As we look at this text of scripture, what's of great interest to me right in the beginning by way of introduction, is the way in which the apostle Paul, under the inspiration of the Holy Spirit of God, addresses Timothy. You find that right in the middle of this portion of scripture, that verse number 11 begins, \"'But thou, O man of God.'\" And I believe that just as that kinda jumps off of the pages of scripture for me, I believe that as Timothy was receiving this letter, as he was reading what Paul was giving him by way of instruction, by way of encouragement, because of all that was being dealt with as he's there in Ephesus, and we find that Timothy comes near the end of this letter, and it says, \"'But thou, O man of God.'\" And I wonder, as I look at that statement, as I look at that reference this morning, I wonder this morning, what is it about an individual that would make them a man or woman of God? What is it about the individual? Why is it that Paul, under the inspiration of the Holy Spirit of God, would say, \"'But thou, O man of God.'\" I wonder this morning, would God look at you? Would God look at me? Would he say, would he refer to us as being a man of God, or for the ladies, a woman of God? Would he look at us and refer to us in that manner? What is it that must be evidenced in our life that would result in that type of a title, if you will? Well, I think, first of all, you must be saved. If you're not saved, if you're not saved by the blood of Christ, then you're not going to be referred to as a man or woman of God. We find this morning the truth of salvation has been plainly dealt with, even in the book of 1 Timothy, that Paul says this at the beginning of the book. He talks about the importance of understanding the grace and mercy of God, and he says this is a faithful saying and worthy of all acceptation, that Christ Jesus came into the world to save sinners, of whom I am chief. I am thankful this morning that Jesus Christ left heaven's glory. He left the throne room of heaven. He left all that he had. He that was rich, he became poor for us. He humbled himself and he became obedient unto death, even the death of the cross. Why? So that mankind could be redeemed. And we find this morning that Paul would then say in the second chapter of the book of 1 Timothy, speaking of God, he says, who will have all men to be saved and to come unto the knowledge of the truth. And what a blessing it is for us to understand and to have that biblical perspective with regard to conversion, that all men must be saved. If you're a human being, you're in need of salvation. If you're here this morning and you've already trust that Christ is your savior, then you can rejoice, and I rejoice with you that you've been born again, that you're heaven bound. If you're not yet saved, if you've never trust that Christ is your savior, if there's not been that moment in your life where you understood that you were a sinner and that there's a penalty for sin and it's separation from God for all of eternity in the lake of fire and that Jesus Christ is the only way. He said, I am the way, the truth and the life. No man cometh unto the father but by me. Could I tell you this morning, if you've not trust that Christ that today is the day of salvation, no longer delay. Do not put it off for a moment longer. Trust Christ today. He is ready to save you. He loves you. He died for you. So we find that Timothy, before he could be referred to as being a man of God, he must be a child of God. He must be saved by the grace of God. I believe one that would be referred to as being a man or woman of God would be one that is growing spiritually, not just somebody that's saved, but somebody that's growing, somebody that's walking with Christ, that's showing, demonstrating, displaying in their life the fruit of the spirit, someone that the attributes of God are evidenced in their life. They're growing in their walk with Christ. The reality is that we understand as we study the scripture that God intends for his people to grow spiritually. He does not just save us and say, now we're heaven bound and just do what you want, live how you want because you're going to heaven. No, we find that God desires that we as his children would walk in obedience, that we would walk as children of the light, that we would walk in such a way that he would be pleased, that he would be honored and glorified. And we find that the individual that is walking in the spirit, the Bible says they shall not fulfill the lust of the flesh. He that is walking in the spirit that has the fruit of the spirit evidence displayed in their lives, the one who according to John 15 is abiding in Christ, that individual I believe is the one that God would refer to as a man or a woman of God. The end of the text or at the end of the message this morning, we'll look at some of the testimony of Timothy and understand a little bit more as we look at a few other portions of scripture why it is that Timothy would be referred to as a man of God. But I want you to think about the beginning of this portion of scripture in verse 11 when God uses the apostle Paul to write to Timothy and says, but thou, O man of God. Notice the instruction that is provided. Number one, if you're taking notes, the instruction to flee, the instruction to flee. Notice very simply, we find that as we start this verse of scripture, but thou, O man of God, notice these three words, flee these things. We find in other portions of scripture that God specifically tells us certain things, specific things that were to flee. If you go to 1 Corinthians 6, flee fornication. And you can look at a number of other portions of scripture where something specifically is mentioned with regard to fleeing. Here it says flee these things. So we have to understand contextually as we look at the content of this passage of scripture, what is it that Paul is telling Timothy to flee? Well, I believe as we just studied last week and we look specifically in verses six through 10, and we dealt with the perspective that we're to have on contentment. And we find that in verse number nine, it says they that will be rich. Again, I mentioned last week, I took great time to explain last Sunday that it does not say they that are rich. It says they that will be rich. That is their drive. That is their motivation. That is what they're seeking is riches. And he says, they that will be rich fall into temptation and a snare into many foolish and hurtful lusts, which drown men in destruction and perdition. Verse 10, for the love of money. It doesn't say for money. It says the love of money is the root of all evil, which while some coveted after, they have erred from the faith and pierced themselves through with many sorrows. And so we look at this truth with regard to contentment, verse six and seven, but godliness with contentment is great gain, for we brought nothing into this world and this certainly can carry nothing out. We find that Paul then says to Timothy, flee these things. You understand that Timothy, though he's not a young man, like as a teenager, he still. is younger, as Paul refers to him as a youth. He's probably about 35, 40 years old, really, in this portion of scripture when it's being written to him. But we find that he's still younger. But you understand that there is, if you think about the young people here this morning, there is a perspective, a worldview that is painted for them that they are to seek after and follow after wealth and riches, and that's their driving force. I remember when I first shared with my grandfather, who passed away a number of years ago, that God was calling me to the ministry, and I believe that God wanted me to pastor. And I remember his first response to me was this, does it pay well? That was his perspective. That was his thought. And we find here that Paul says to Timothy to flee these things. What are these things? Well, really, these are temporary things. These are temporal things. And we find as a man of God, or as a woman of God, we should be not focused on those things which are temporary, those things which in a moment can fade away, can flee away. We find that we ought to be eternally focused. And so the apostle Paul, as he's writing to Timothy, he says, listen, flee these things. We understand that he doesn't simply say to avoid them, but to flee them. There had to be some great pressure, some great influence there with regard to those that were seeking, that will be rich, those that were loving money, and they were, this attitude, this worldview was being developed. And Paul says to Timothy, flee these things. Actively make a decision that you will flee from these things. Notice with me that Paul says, he gives instruction to flee. Number two, the instruction to follow, the instruction to follow. I think it's a great contrast that we find in our text of scripture between these things that are referenced, which would be the riches that are spoken of in verses 9 and 10, with that which we're to follow after. As Timothy being again referred to as this man of God, he has a higher calling, a higher plane, if you will. We sing the song, higher ground. Lord, plant my feet on higher ground, right? And we think about the importance, Paul mentions it in the book of 2 Corinthians, about having an eternal perspective and not a temporal perspective, and we find that this instruction is given to follow. So, understand with me this morning, he says, flee these things. There's some things that you're to flee, but then follow after these things. By the way, every time we take something out of our life, we ought to replace it with something that is appropriate and biblical, something that is God honoring. God doesn't just say, flee these things, and then there's a void. God says, flee these things because you're following these things. By the way, if I'm actively following what I'm supposed to be following after, then at the same time I'm fleeing the things that I'm not supposed to be following. Does that make sense? I cannot follow after the things that are mentioned here, while at the same time following the things that he says to flee. So, I'm fleeing, but I'm following. And we find here in verse number 11, he says, follow after righteousness, godliness, faith, love, patience, and meekness. As we look at these particular words that are given, six things that Paul instructs Timothy with regard to what he is to follow after, I want you to find this morning how this helps to shape and to mold a direction of an individual. We find this morning that we're to seek after God, we're to follow after the Lord, and he says here, follow after righteousness, that which is right. I understand today that there are some that have sought to redefine what is right and what is wrong, what is holy and what is evil, and we find that even today this is nothing new. This is something that's been going on for centuries. We find that all the way back as Jeremiah and Isaiah are prophesying in Israel and Judah that they call evil good and good evil, and we find today that we live in that type of situation where we have had those individuals seek to redefine what is right. Can I tell you this morning that God defines what is right? We find that God defines what is good and what is right, and he says follow after righteousness, that which is right, that which is pleasing to God, that which is right in the eyes of our God, of our Savior. Follow after righteousness. Notice he not only says righteousness, but then he says godliness, the things of God, the things of God. You understand that Timothy, again, being a born-again believer, being a child of God, that he is to follow after righteousness, but also godliness, the things of God. You know, the reality this morning is that we can be about our own business or we can be about our Father's business. You think about what Jesus said. He said he was about his Father's business, and this morning we must understand that we need to be following after godliness, the things that are of God, the things that pertain to God that were about our Father's business. As we look at our lives, as we examine our lives, and we begin to use this list of these six items that are given to us this morning that we're to follow after, we could, at each point, examine our own lives and say, am I following after, am I pursuing righteousness, godliness? Notice number three, faith. The Bible tells us that the just shall live by faith. The simplest definition that I know that I could give you of faith is taking God at His word, just believing God. Paul stood up in the book of Acts when they're dealing with a great storm in Acts 27, and all hope that they should live was gone, and it was as if they were certain they would perish, and we find that God sends and gives Him word that they would be spared, that there would be destruction of the ship, but no lives would be lost, and Paul stands up, and he makes this bold statement. He says, I believe God, that it shall be. It's going to be just as God said it would be, and this morning we must have faith. We must believe God. In fact, in the book of Hebrews, in the 11th chapter, a passage of scripture that we've often referred to as being the hall of faith chapter, we see how God lists throughout that portion of scripture, by faith this individual did this, and by faith this individual did this. What did they do? They believed God. They simply acted in obedience. They responded in faith that God would do what God said He would do. How do we get faith? Well, faith cometh by hearing, and hearing by the word of God. We must be in the Bible. We must be in the scriptures if we're going to have our faith increased, and if we're going to live by faith. Hebrews 11, I referenced a moment ago, but verse number six says this, that without faith it is impossible to please Him, to please God, for he that cometh to God must believe that He is, and that He is a rewarder of them that diligently seek Him, and we find this morning, listen, we're to live by faith. It pleases God when we live by faith, not by sight. We live by faith, and I'm so thankful this morning. I want you to think about what God says, the Lord Jesus Christ says to Thomas. Hold your place here in the book of 1 Timothy, and turn to the book of John, if you will, and I want you to see what we read here in John chapter number 20, and I want you to think about this truth, and we oftentimes, we are familiar with Thomas. In fact, many times we'll be referred to as being doubting Thomas. You've heard that phraseology that's been given to him, and we find that Thomas, he makes this statement because he was not where he should have been, and Jesus showed up, and the disciples tell him about Jesus being there, and he wasn't there to see it, and he says this, I will not believe. Wow, what a statement at the end of verse number 25. After eight days again, verse number 26, his disciples were within, and notice the Bible says, and Thomas with them. That's just always of interest to me. The Holy Spirit includes those words, and Thomas with them. He wasn't going to miss it again. The Bible says this, then came Jesus, the doors being shut, and stood in the midst, and said, peace be unto you. Then saith he to Thomas, now I love this. You know why I love this so much, is because God wants to see our faith increased. He wants us to believe. Do you remember Gideon? God comes to Gideon and says, thou mighty man of valor. The Midianites, a great host of people that were oppressing the children of Israel at that time, he says he's going to provide deliverance through Gideon. Gideon's like, you got the wrong guy. Gideon had small faith. But you know what God did for Gideon? He built his faith. You can look through those portions of Scripture and you can see in Judges 6 and 7 how that Gideon's faith is increased and God doesn't get angry with Gideon for saying, I'm going to put this fleece out and let... No, God doesn't get mad at Gideon. You know what God does? He builds his faith. We have a God who is so gracious, who is so kind. We have a God who knows our frame. He wants us to be people of faith and here we find that Jesus, he goes to Thomas and notice what he says, reach hither thy finger, behold my hands and reach hither thy hand and thrust it into my side and be not faithless, but believing. Thomas answered and said unto him, my Lord and my God. By the way, Jesus didn't rebuke him. Why? Because he's God. If you came up here and said to me, my Lord and my God, I'd stop you in a heartless and I am not, but Jesus is God. So when Thomas says, my Lord and my God, Thomas is not rebuked for that because it's the truth. But I want you to notice what Jesus says in verse 29, Jesus saith unto him, Thomas, because thou hast seen me, thou hast believed. What are they that have not seen and yet have believed? I want you to understand this morning that God wants us to be people of faith. He wants us to have faith that God is real, that God's on his throne, that we believe this book. I preached a message on Wednesday evening, the totality of scripture and dealing with the fact that Paul says, I believe all things that are written in the law and in the prophets and the importance that we understand that we take God at his word, that we believe God. What are we to follow after? Righteousness, godliness, faith, notice love. Back in 1 Timothy 6 and verse number 11, he says, not only to follow after righteousness, godliness and faith, but also to follow after love. There's a whole chapter, 1 Corinthians 13, that's committed to charity or to love. And we understand that Jesus said this as the end of John, chapter number 13, he says, a new commandment I give you. What is this new commandment I give unto you that you love not in the same way that you love yourself, but as I have loved? See, in the Old Testament, love your neighbor as thyself, but in the New Testament, we find that he says, love as I have loved. It's amazing. He says, by this, by what, by your love one for another, you'll know, all men will know that you are my disciples. First John deals with it very plainly. Don't say that you love God, but you don't love your brethren. How can you love God if you don't love your brethren? We find this morning that here he says love. Now understand with me, I believe that as we're pursuing love, that first and foremost, we're speaking about love for God, love for God. We're to love him with every part of our being, love him supremely. Now understand this morning that when we say that we love the Lord, we love him because he first loved us. I wasn't seeking him, he was seeking me. He's been so gracious and so merciful and so loving. And we find that John, first John in the fourth chapter deals very plainly with this truth that I love him because he first loved me. What a joy. Listen, if we love him, first John continues, then we're to keep his commandments. By the way, John in chapter 14 deals with that as well. If you love me, keep my commandments. That is the demonstration, that is the evidence of our love for God. People can run around and say they love God, they can say whatever they want to say, but the reality is, does the evidence bring forth the truth that we love God? So we're pursuing, we're following after love, love first and foremost for God, but also love for people, love for people. I can't love people the way I'm supposed to love people and you can't love people the way you're supposed to love people if we're not walking in the Spirit. It is God who, his Holy Spirit sheds his love through us to others. I can't love like I'm supposed to love without the help of the Holy Spirit. By the way, the fruit of the Spirit is love, joy, peace, long suffering, so on and so forth. And so we find that the fruit of the Spirit is love. What does Paul say? Look in 1 Corinthians 13, as I mentioned a moment ago, this chapter that is dedicated to charity, notice the Bible says this in 1 Corinthians 13, I mean, he lists through it, we don't have time to go through every verse and give, expound upon it, but Paul says in 1 Corinthians 13 and verse number 1, though I speak with the tongues of men and of angels and have not charity, I am become a sounding brass or a tinkling cymbal. Though I have the gift of prophecy, verse 2, and understand all mysteries and all knowledge, and though I have all faith so that I could remove mountains and have not charity, I am nothing, verse number 3, and though I bestow all my goods to feed the poor, and though I give my body to be burned and have not charity, it profiteth me nothing. He then goes on in the next few verses to explain, to describe detail what charity, what love is, it suffereth long, it is kind, it envieth not, it vaunteth not itself, is not puffed up, doth not behave itself unseemly, seeketh not her own, is not easily provoked, thinketh no evil, rejoiceth not in iniquity, but rejoiceth in the truth, beareth all things, believeth all things, hopeth all things, endureth all things. Charity, you know what it says, never faileth. Now it says this, but whether they be prophecies, they shall fail. Whether they be tongues, they shall cease. Whether they be knowledge, it shall vanish away. But charity, notice the end of verse number 13, but the greatest of these is charity. I believe that as you study the book of 1 Thessalonians and you begin to see a little bit of the heart of the Apostle Paul, we won't take time to look at any verses there, but if you study the life of the Apostle Paul and his ministry to the believers in Thessalonica, I believe that you see something abundantly clear in the book of 1 Thessalonians. You know what it is, I think that you see, is that Paul loved the people of Thessalonica. He cared about them. It was genuine love for those people in Thessalonica. And you know, because he loved them and because they knew that he loved them, he was able to effectively minister to them. He was able to help them grow in their walk with Christ. Why? Because he loved them. We find that here, Paul says, there's some things that you're to flee, but let me give you some things you're to follow, righteousness, godliness, faith, love. Notice back in 1 Timothy chapter 6, the fifth one that's listed, patience, patience. Long-suffering is how it's worded in the fruit of the Spirit in Galatians chapter number 5, and you see it there. But we find here that he says patience. You think about this truth of being patient, and I've heard all sorts of things about people that talk about patience and you should never pray for patience and all this kind of thing, but the reality is that I'm thankful that our God is long-suffering, I'm thankful that our God is patient toward us, and we too ought to be long-suffering and we ought to be patient. Again, it's not a work in my own flesh, it's not a work in your flesh, it's the Holy Spirit of God working through us. As I think about this verse here in 1 Timothy chapter 6 and verse number 11 with the idea of patience, it's waiting for God to work. Have you found in your life that God's work is not always done on your timeline, on your timetable? I mean, honestly, have you found it to be the case in your life that God's work is not always done on your timetable or on my timetable? But can I tell you this morning that God's work is always done on time? God's doing a work, and we need to be patient as God is working. I say often as the psalmist says in Psalm 119, it is time, Lord, for you to work. I mean, it is time for God to work, but the reality is that God is working, God is working. You know, there are times that God's working and we don't even see how God is working. There are times that God's working on the other end. You're praying for an individual, maybe you're not seeing the results that you'd like to see because the timeline is not your timeline, but it's God's timeline, but we can rest in the fact that God is at work. We have to have patience. I'm thankful as I think about Timothy and his responsibility as it was outlined at the end of chapter number five and all of chapter number four is his responsibility as a pastor, as an elder there in Ephesus, the job that he was given to do, that he was going to have the need for patience, for long-suffering. You say people annoy me, well, you annoy people, amen? The reality is that we can't get so distracted with that and become impatient. No, we pray that God would do a work. Is God able? Sure He is. We sang this morning, He is able to deliver thee. Is God sovereign? Yes. Is God all-powerful? Yes. Is there the need of the individual to surrender themselves and yield themselves? Absolutely. But God is at work. You know, sometimes I feel like we pray at times, although we reject Calvinism, there are times in which we almost pray like we're Calvinist. What do I mean by that? Lord, would you save that person? God wants to save the person, but the person has to trust Christ as their Savior. But sometimes we pray almost like we're Calvinistic in our prayer, instead of understanding the need for the individual to respond to the gospel that's been presented. Oftentimes I pray, if I know that there's someone that's not saved and I've been sharing the gospel with them and there's a heavy burden to see them saved, I'll pray that God will allow someone else to cross into their path, that maybe the individual's taking a flight, and you know how awesome it would be for the person right next to them on the airplane to be a Christian that speaks up and shares the gospel on that. Listen, it is a time in which God would give you a unique opportunity. I heard a story about an individual that he'd always get on the plane at the end, and he'd get on the plane, he always wore the same shirt when he was flying, he flew quite a bit, and he would walk down the center aisle after everyone's getting seated, and he had written on his shirt, if you want to go to heaven, come talk to me. And he'd walk down the aisle, he'd try to get to the furthest to the back of the plane he could possibly get to, and he'd try to stop and make sure everyone could read his shirt. And that man testified of many, many opportunities that God gave him to be able to share the gospel with individuals because of wearing a shirt that said that. But I pray that God would work and that God would send a coworker, a friend, a neighbor, someone to bring the gospel. So we have to be patient, knowing that God is working. Sometimes we want God to hurry up and work, and we say, this is not my timeline, this is not the timing that I had planned, but we must have patience. We must have patience. Notice finally he says this, meekness, meekness. Some have wrongly concluded that meekness is weakness. Meekness is not weakness. To be meek is not to be weak. In fact, meek is really power under control. In fact, as we look at this truth of meekness here and we think about the truth that our Lord Jesus Christ, he was meek. He was not weak, but he was meek. We think about the Old Testament and Moses. Moses was meek. The Bible tells us that. He was not weak, but he was meek as a leader. And Timothy would have this responsibility as he would fulfill the role that God gave him to fulfill, to follow after these things, righteousness, godliness, faith, love, patience, and meekness, to have gentleness or mildness in the manner in which he ministered. See, look at 1 Peter chapter 5, if you will. Here's the flip side of the coin, if you will, with regard to this instruction to follow after meekness. We find that in 1 Peter chapter 5, Peter is writing to the elders which are among you and he's giving them an exhortation. He's giving them some instruction. And notice in verse number 1 of 1 Peter 5, as Peter is providing again under the inspiration of the Holy Spirit of God this truth, he says, the elders which are among you I exhort who am also an elder and a witness of the sufferings of Christ and also a partaker of the glory that shall be revealed, feed the flock of God which is among you, taking the oversight thereof, but then notice this, not by constraint but willingly, not for filthy lucre but of a ready mind, neither as being lords over God's heritage but being in samples to the flock. That's meekness. See you've heard there's been charges that have been raised against those that are dictators as far as being leaders, the pastor is a dictator type of a leader. No, God says meekness, not as being lords over God's heritage. Understand that the people that are saved are God's people. I'm thankful I belong to God, aren't you? And here, as Paul would give this instruction to Timothy, he says, listen, you need to flee these things, why? Because you have a higher calling, a higher plane, these temporal things, the seeking, the being driven to be rich, the love for money, no, flee those things and follow after righteousness, godliness, faith, love, patience and meekness. And then number three this morning, he says, not only is there instruction to flee and instruction to follow, but number three, the instruction to fight the good fight. Notice, it doesn't just say fight. I'm thankful for that. It says fight the good fight of faith. Fight the good fight of faith. We're not just fighting to fight, but we are to fight the good fight of faith. We are to earnestly contend for the faith. We are to be able to stand and give an answer for why we believe the things that we believe and understanding that God has given us the word of God. And here, Paul says, of course, you know that there have been many references already in this book with regard to the false teachers that are at Ephesus and their activity and all that's taking place, and so now Paul says to Timothy, fight the good fight of faith. It's often been said, it's a battleground, not a playground. It's a battleground, not a playground. I think Tozer was the first one that coined that phrase, at least as best I can tell, and many after that have repeated that phrase and how appropriate it is. We won't take the time this morning, but if you look at Ephesians chapter 6 and look at verses 10 through 17, you can see the detail with regard to the fight, the battle, the spiritual battle that we're engaged in. It's a battleground, not a playground. Therefore, Paul is instructing Timothy to fight the good fight of faith. It's interesting to me that in the next letter that we'll begin studying here in a few weeks on Sunday mornings that Paul says to Timothy in 2 Timothy chapter number 2, he tells him, Thou therefore, my son, be strong in the grace that is in Christ Jesus and the things that thou hast heard of me among many witnesses. The same commit thou to faithful men who shall be able to teach others also. Thou therefore endure hardness as a good soldier of Jesus Christ. O man, that warreth and tangleth himself with the affairs of this life, that he may please him who hath chosen him to be a soldier. Those verses of Scripture go perfect with what we're looking at in 1 Timothy 6 verses 11 and 12. The one that's warring, the good soldier that's going to endure hardness, he's not going to entangle himself with the things, the affairs of this world, verses 9 and 10 in 1 Timothy chapter 6, but he's going to seek after, he's going to follow after why that he might please him who hath chosen him to be a soldier. And oh, as we look here at this truth of the battleground that we're engaged in, this battle that's raging all around us. Many today have tried to use various terms to describe the battle. Cultural wars, social wars, you name whatever it might be, political wars. I want you to understand it's spiritual war. It is spiritual war. And we're engaged in spiritual warfare. I'm thankful that Paul, as he's writing to the church in Corinth, that our weapons are not carnal. No, they're spiritual. Can I tell you that we must recognize that we're fighting a spiritual battle. We wrestle not against flesh and blood, according to Ephesians 6. We wrestle against spiritual wickedness in high places. And can I tell you this morning, every day of your life you better put on the whole armor of God because there's not a day off in this battle. There's not a day off in this battle. And the day that you think that there's a day off is the day that the enemy will fire as many fiery darts at you as he possibly can fire. You say, oh, I wish I had the shield of faith that can quench all the fiery darts. No, I went out without the armor on. Put on the whole armor of God. Be strong in the Lord and the power of His might. It's a battleground. Notice in verse number 12 of 1 Timothy 6, he says, fight the good fight of faith. But then he gives this following truth that's so important for us to understand. He says, lay hold. on eternal life, whereunto thou art also called and hast professed a good profession before many witnesses. This phraseology of lay hold on eternal life, it's not the idea of getting saved, it's the idea that because you are saved, you are a possessor of eternal life, now live like it. Lay hold on eternal life. Listen, we are more than conquerors through him. We are, as the song says, and Curtis Hudson used to sing it so often, we are on the winning side. And the reality is that we sing the song victory in Jesus, but thanks be to God, 1 Corinthians 15, which giveth us the victory through our Lord Jesus Christ. 1 Corinthians 15 and verse 57. This morning he says lay hold on eternal life. It's not get saved, it's the fact that you are saved. We are a possessor of eternal life. As a possessor of eternal life, we need to live our lives in that fashion. I'm saved, I'm a child of God. I live different than I used to live. I know for many of us here this morning, we can remember how we lived before we got saved. I can remember how I lived before I got saved. And I think if you'd be honest this morning, if you got saved, if you were old enough when you got saved to have lived a certain way and can recall that, there should be a contrast, a difference in your life as a believer, as a possessor of eternal life. I'm so thankful that I'm going to heaven one day, but we need to live like we're possessors of eternal life. It's interesting that then Paul says this, lay hold on eternal life. Then he says this, were unto thou art also called and hast professed a good profession before many witnesses. Now, I love the end of verse number 12 because what Paul is saying to Timothy at the end of verse number 12, he's really referring to the testimony of Timothy. He's saying to Timothy, you have professed a good profession before many witnesses. You have lived a life. You have passed a test, so to speak. Your testimony is known. But can I tell you this? We can't live in the past. We can't live in the past. Timothy, you have, he says this, thou hast professed a good profession before many witnesses. I wish I could have had the time to deal with the entirety of this passage of scripture in one week. So I hope you come back next week so that you can find the followup to this. He says, I give thee charge in the sight of God, according to verse number 13. And we find that he tells him that he's to keep on doing these things until the appearing of our Lord Jesus Christ. See, it's great, Timothy, that you have this good profession before many witnesses, but don't stop. Understanding that your testimony continues to be important and you must continue to profess this good profession before those that you come in contact with. You know, there's some people, Obadiah, if you remember, not the prophet Obadiah, but the one that was working with Ahab when Elijah was on the run. Remember, God hid Elijah. And he says, well, do you know what I've done? Do you know how many I hid? Do you know how I? Listen, sometimes we can live in the past. Let me tell you what I used to do. Let me tell you how I used to. No, we need to live in the present. Notice the testimony of this man, Timothy. Paul says you have, at the end of verse number 12, and hast professed a good profession before many witnesses. Notice in 1 Corinthians chapter four, I'm gonna look at just a couple of verses quickly to look at the testimony of Timothy. In 1 Corinthians chapter four, in verse number 17, Paul is writing to the church in Corinth, and here's what he says. For this cause have I sent unto you Timotheus, who is my beloved son and faithful in the Lord, who shall bring you into remembrance of my ways, which be in Christ as I teach everywhere in every church. So Paul is saying I'm sending, I have sent Timothy to you, and here's the testimony of Timothy. He is my beloved son, he is faithful in the Lord, and he's going to be able to bring you in remembrance of the things that I taught. Wow, that's why Paul said I can send Timothy to Corinth. Notice in Philippians chapter number two, Paul sends Timothy to the church in Philippi, and we find that as Paul would give in Philippians chapter number two, some of the reason that Timothy was being sent, it helps us to understand this profession that he had Timothy before many witnesses. In Philippians chapter two, in verse 19, Paul says, but I trust in the Lord Jesus to send Timotheus shortly unto you, that I also may be of good comfort when I know your state. Notice what he says, he says, for I have no man like-minded who will naturally care for your state. For all seek their own, not the things which are Jesus Christ, but ye know the proof of him. Who's him? Well, that's Timothy, go back to verse 19. He says, you know the proof of him that as a son with the father, he hath served me in the gospel. He said, I have no one else to send, but I have Timothy to send. And Paul, he desires to send Timothy, he has this longing to be able to send Timothy, why? Because Timothy had a testimony that was God-honoring. We read in 1 Thessalonians chapter number three, this truth with regard to Timothy being sent to the church in Thessalonica. Why is it that Paul would send Timothy to the church in Thessalonica? Well, the same reason he would send him to Corinth and the same reason he'd send him to Philippi, because he was faithful. 1 Thessalonians three, it says in verse number one, wherefore, when we could no longer forbear, we thought it good to be left at Athens alone and sent Timotheus, our brother and minister of God and our fellow labor in the gospel of Christ to establish you and to comfort you concerning your faith. Timothy, he had lived a life that was honoring to the Lord. He's referred to in verse number 11, O thou man of God. But Timothy, don't live in the past. You know, sometimes it's easy for us to live in the past. Sometimes it will be referred to this way as a group of people get together and they talk about the good old days. You ever hear people use that terminology? And they're reminiscing and they're talking about the good old days. But I want you to understand that we have the present and we must live in the present as possessors of eternal life. And we must live in the present, fleeing those things and following after these things and understanding that God says to fight the good fight of faith. It is an active, listen, in each of these instances, there is instruction that is given. There is a decision that has to be made. And it's in the present that you're going to flee. You're going to follow. You're going to fight. This morning, Paul, we know, fought the good fight. He's able to say at the end of 2 Timothy chapter number four about the fact that he had finished. He says in verse number seven, I have fought a good fight. I have finished my course. I have kept the faith. You know what I believe Paul's desire was for Timothy? Was that Timothy could say the same thing. That Timothy could say, I have fought a good fight. You know what my desire is for my life is that I would be able to say, I have fought a good fight. But you know what my desire is for your life is that you too would be able to say, I have fought a good fight. That we would live our lives in such a way that Christ is exalted and magnified, that he alone is pleased. That we would take the truth of his word, apply it in our lives, be doers of the word, and please him. So that we would not be ashamed as appearing, no, that we would be able to say, as Paul said, I have fought a good fight. I have finished my course. I have kept the faith. Can I tell you this morning, it's not going to happen by accident. It's not going to happen by chance. You must actively make some decisions. You must flee these things. You must follow these things, and you must fight the good fight of faith. One day, every single one of us are gonna stand before God. Absolutely, every single one of us gonna stand before God. I've seen people in the store wear a shirt or a hat that says only God can judge me. I don't know if you've ever seen someone wearing that. But when I see it, it actually breaks my heart because the reality is that God will judge them one day. God will judge me knowing the terror of the Lord, 1 Corinthians, or 2 Corinthians 4. We persuade men. Listen, we're gonna stand before God. And I wonder today, I hope you're saved, but I hope you're living for Christ, making that active decision. There's some things I need to flee. There's some things I need to follow. Why? Because I'm a possessor of eternal life. I am saved by the blood of the Lamb. I am heaven bound, and I need to live like a Christian. Flee, follow, fight. Let's pray. Father we love you. Thank you for loving us. Thank you for the opportunity to study your word this morning. Thank you for the example, the testimony of Timothy. I pray that you'd help us to have a testimony like Timothy. Lord, help us to be able to say, as Paul said at the end of his life, the time of my departure is at hand. But he said this, I have fought a good fight. I finished my course. I have kept the faith. And Lord, I pray that you'd help us, as we are challenged with these commands, these instructions this morning, to flee, follow, and fight. Lord, help us to be doers of the word. If there's one not sure of heaven, God, I pray that the Holy Spirit of God would convict them and convince them of their need for Christ, that they would not leave here today without knowing for sure that heaven is their home. I pray that you do a work in these moments of invitation and we'll thank you for it. In Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's going to play quietly on the piano. And as she does, the altar is open.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 1.9199999570846558,
      "text": " but he knoweth the way that I take."
    },
    {
      "id": 1,
      "start": 1.9199999570846558,
      "end": 6.920000076293945,
      "text": " When he hath tried me, I shall come forth as gold.\""
    },
    {
      "id": 2,
      "start": 8.479999542236328,
      "end": 9.640000343322754,
      "text": " What a great truth."
    },
    {
      "id": 3,
      "start": 9.640000343322754,
      "end": 10.640000343322754,
      "text": " You think about Job."
    },
    {
      "id": 4,
      "start": 10.640000343322754,
      "end": 12.079999923706055,
      "text": " We mentioned a little bit in Sunday school"
    },
    {
      "id": 5,
      "start": 12.079999923706055,
      "end": 14.680000305175781,
      "text": " about Job this morning in my class,"
    },
    {
      "id": 6,
      "start": 14.680000305175781,
      "end": 17.31999969482422,
      "text": " and you think about the trial that he endured,"
    },
    {
      "id": 7,
      "start": 17.31999969482422,
      "end": 19.719999313354492,
      "text": " and God is at work."
    },
    {
      "id": 8,
      "start": 19.719999313354492,
      "end": 20.719999313354492,
      "text": " The psalmist said this,"
    },
    {
      "id": 9,
      "start": 20.719999313354492,
      "end": 23.200000762939453,
      "text": " \"'It was good for me that I was afflicted.'\""
    },
    {
      "id": 10,
      "start": 23.200000762939453,
      "end": 26.360000610351562,
      "text": " It was good for me that I was afflicted, why?"
    },
    {
      "id": 11,
      "start": 26.360000610351562,
      "end": 28.81999969482422,
      "text": " Because then I learned thy statutes."
    },
    {
      "id": 12,
      "start": 28.81999969482422,
      "end": 32.2599983215332,
      "text": " And what a blessing when we have that perspective"
    },
    {
      "id": 13,
      "start": 32.2599983215332,
      "end": 34.13999938964844,
      "text": " that God doeth all things well,"
    },
    {
      "id": 14,
      "start": 34.13999938964844,
      "end": 37.13999938964844,
      "text": " that he has a perfect plan, and what a blessing."
    },
    {
      "id": 15,
      "start": 37.13999938964844,
      "end": 39.65999984741211,
      "text": " His goal for us as his people"
    },
    {
      "id": 16,
      "start": 39.65999984741211,
      "end": 43.540000915527344,
      "text": " is that we would be conformed to the image of his dear son."
    },
    {
      "id": 17,
      "start": 43.540000915527344,
      "end": 45.540000915527344,
      "text": " Romans 8 and verse 29,"
    },
    {
      "id": 18,
      "start": 45.540000915527344,
      "end": 48.97999954223633,
      "text": " and what a blessed truth of God's word."
    },
    {
      "id": 19,
      "start": 48.97999954223633,
      "end": 50.2599983215332,
      "text": " If you have your Bible with you this morning,"
    },
    {
      "id": 20,
      "start": 50.2599983215332,
      "end": 52.060001373291016,
      "text": " 1 Timothy chapter six,"
    },
    {
      "id": 21,
      "start": 52.060001373291016,
      "end": 54.70000076293945,
      "text": " 1 Timothy chapter number six this morning,"
    },
    {
      "id": 22,
      "start": 54.70000076293945,
      "end": 56.34000015258789,
      "text": " and we dealt with the beginning"
    },
    {
      "id": 23,
      "start": 56.34000015258789,
      "end": 58.70000076293945,
      "text": " of this passage of scripture last week,"
    },
    {
      "id": 24,
      "start": 59.540000915527344,
      "end": 61.18000030517578,
      "text": " and looked at verses one through 10,"
    },
    {
      "id": 25,
      "start": 61.18000030517578,
      "end": 63.459999084472656,
      "text": " and we talked about the importance last week"
    },
    {
      "id": 26,
      "start": 63.459999084472656,
      "end": 66.18000030517578,
      "text": " of developing biblical perspective,"
    },
    {
      "id": 27,
      "start": 66.18000030517578,
      "end": 68.0199966430664,
      "text": " and we talked about biblical perspective"
    },
    {
      "id": 28,
      "start": 68.0199966430664,
      "end": 69.81999969482422,
      "text": " with regard to conversion,"
    },
    {
      "id": 29,
      "start": 69.81999969482422,
      "end": 71.94000244140625,
      "text": " with regard to contending,"
    },
    {
      "id": 30,
      "start": 71.94000244140625,
      "end": 74.30000305175781,
      "text": " and that we're to earnestly contend for the faith,"
    },
    {
      "id": 31,
      "start": 74.30000305175781,
      "end": 78.0999984741211,
      "text": " and then also a biblical perspective on contentment."
    },
    {
      "id": 32,
      "start": 78.0999984741211,
      "end": 79.72000122070312,
      "text": " As we enter into the next portion,"
    },
    {
      "id": 33,
      "start": 79.72000122070312,
      "end": 82.4800033569336,
      "text": " we're just gonna look at verses 11 and 12 this morning."
    },
    {
      "id": 34,
      "start": 82.4800033569336,
      "end": 85.13999938964844,
      "text": " These two verses of scripture are full."
    },
    {
      "id": 35,
      "start": 85.13999938964844,
      "end": 86.66000366210938,
      "text": " They're just packed with truth"
    },
    {
      "id": 36,
      "start": 86.69999694824219,
      "end": 88.94000244140625,
      "text": " that is so important for us to understand,"
    },
    {
      "id": 37,
      "start": 88.94000244140625,
      "end": 91.66000366210938,
      "text": " and we do not wanna just quickly go through them."
    },
    {
      "id": 38,
      "start": 91.66000366210938,
      "end": 93.81999969482422,
      "text": " As we look at the text of scripture in verse 11,"
    },
    {
      "id": 39,
      "start": 93.81999969482422,
      "end": 94.66000366210938,
      "text": " notice the Bible says,"
    },
    {
      "id": 40,
      "start": 94.66000366210938,
      "end": 99.66000366210938,
      "text": " \"'But thou, O man of God, flee these things,"
    },
    {
      "id": 41,
      "start": 99.9800033569336,
      "end": 103.5,
      "text": " \"'and follow after righteousness, godliness,"
    },
    {
      "id": 42,
      "start": 103.5,
      "end": 107.44000244140625,
      "text": " \"'faith, love, patience, meekness."
    },
    {
      "id": 43,
      "start": 107.44000244140625,
      "end": 110.18000030517578,
      "text": " \"'Fight the good fight of faith."
    },
    {
      "id": 44,
      "start": 110.18000030517578,
      "end": 111.9000015258789,
      "text": " \"'Lay hold on eternal life,"
    },
    {
      "id": 45,
      "start": 111.9000015258789,
      "end": 114.9000015258789,
      "text": " \"'whereunto thou art also called,"
    },
    {
      "id": 46,
      "start": 114.94000244140625,
      "end": 118.19999694824219,
      "text": " \"'and hast professed a good profession"
    },
    {
      "id": 47,
      "start": 118.19999694824219,
      "end": 121.30000305175781,
      "text": " \"'before many witnesses.'\""
    },
    {
      "id": 48,
      "start": 121.30000305175781,
      "end": 122.86000061035156,
      "text": " I've titled the message this morning,"
    },
    {
      "id": 49,
      "start": 122.86000061035156,
      "end": 126.45999908447266,
      "text": " Flee, Follow, Fight."
    },
    {
      "id": 50,
      "start": 126.45999908447266,
      "end": 127.9800033569336,
      "text": " As we look at this text of scripture,"
    },
    {
      "id": 51,
      "start": 127.9800033569336,
      "end": 130.4199981689453,
      "text": " what's of great interest to me right in the beginning"
    },
    {
      "id": 52,
      "start": 130.4199981689453,
      "end": 132.17999267578125,
      "text": " by way of introduction,"
    },
    {
      "id": 53,
      "start": 132.17999267578125,
      "end": 133.86000061035156,
      "text": " is the way in which the apostle Paul,"
    },
    {
      "id": 54,
      "start": 133.86000061035156,
      "end": 135.77999877929688,
      "text": " under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 55,
      "start": 135.77999877929688,
      "end": 137.67999267578125,
      "text": " addresses Timothy."
    },
    {
      "id": 56,
      "start": 137.67999267578125,
      "end": 139.0399932861328,
      "text": " You find that right in the middle"
    },
    {
      "id": 57,
      "start": 139.0399932861328,
      "end": 140.33999633789062,
      "text": " of this portion of scripture,"
    },
    {
      "id": 58,
      "start": 140.33999633789062,
      "end": 142.3800048828125,
      "text": " that verse number 11 begins,"
    },
    {
      "id": 59,
      "start": 142.4199981689453,
      "end": 145.97999572753906,
      "text": " \"'But thou, O man of God.'\""
    },
    {
      "id": 60,
      "start": 145.97999572753906,
      "end": 148.86000061035156,
      "text": " And I believe that just as that kinda jumps off"
    },
    {
      "id": 61,
      "start": 148.86000061035156,
      "end": 150.5800018310547,
      "text": " of the pages of scripture for me,"
    },
    {
      "id": 62,
      "start": 150.5800018310547,
      "end": 153.5399932861328,
      "text": " I believe that as Timothy was receiving this letter,"
    },
    {
      "id": 63,
      "start": 153.5399932861328,
      "end": 156.32000732421875,
      "text": " as he was reading what Paul was giving him"
    },
    {
      "id": 64,
      "start": 156.32000732421875,
      "end": 160.05999755859375,
      "text": " by way of instruction, by way of encouragement,"
    },
    {
      "id": 65,
      "start": 160.05999755859375,
      "end": 162.4199981689453,
      "text": " because of all that was being dealt with"
    },
    {
      "id": 66,
      "start": 162.4199981689453,
      "end": 163.72000122070312,
      "text": " as he's there in Ephesus,"
    },
    {
      "id": 67,
      "start": 163.72000122070312,
      "end": 168.10000610351562,
      "text": " and we find that Timothy comes near the end of this letter,"
    },
    {
      "id": 68,
      "start": 169.05999755859375,
      "end": 173.6199951171875,
      "text": " and it says, \"'But thou, O man of God.'\""
    },
    {
      "id": 69,
      "start": 173.6199951171875,
      "end": 175.6999969482422,
      "text": " And I wonder, as I look at that statement,"
    },
    {
      "id": 70,
      "start": 175.6999969482422,
      "end": 178.10000610351562,
      "text": " as I look at that reference this morning,"
    },
    {
      "id": 71,
      "start": 178.10000610351562,
      "end": 181.82000732421875,
      "text": " I wonder this morning, what is it about an individual"
    },
    {
      "id": 72,
      "start": 181.82000732421875,
      "end": 186.33999633789062,
      "text": " that would make them a man or woman of God?"
    },
    {
      "id": 73,
      "start": 186.33999633789062,
      "end": 188.05999755859375,
      "text": " What is it about the individual?"
    },
    {
      "id": 74,
      "start": 188.05999755859375,
      "end": 189.44000244140625,
      "text": " Why is it that Paul,"
    },
    {
      "id": 75,
      "start": 189.44000244140625,
      "end": 191.13999938964844,
      "text": " under the inspiration of the Holy Spirit of God,"
    },
    {
      "id": 76,
      "start": 191.13999938964844,
      "end": 196.13999938964844,
      "text": " would say, \"'But thou, O man of God.'\""
    },
    {
      "id": 77,
      "start": 196.3000030517578,
      "end": 199.5,
      "text": " I wonder this morning, would God look at you?"
    },
    {
      "id": 78,
      "start": 199.5,
      "end": 201.22000122070312,
      "text": " Would God look at me?"
    },
    {
      "id": 79,
      "start": 201.22000122070312,
      "end": 205.22000122070312,
      "text": " Would he say, would he refer to us as being a man of God,"
    },
    {
      "id": 80,
      "start": 205.22000122070312,
      "end": 207.66000366210938,
      "text": " or for the ladies, a woman of God?"
    },
    {
      "id": 81,
      "start": 207.66000366210938,
      "end": 211.33999633789062,
      "text": " Would he look at us and refer to us in that manner?"
    },
    {
      "id": 82,
      "start": 211.33999633789062,
      "end": 215.5800018310547,
      "text": " What is it that must be evidenced in our life"
    },
    {
      "id": 83,
      "start": 215.5800018310547,
      "end": 219.74000549316406,
      "text": " that would result in that type of a title, if you will?"
    },
    {
      "id": 84,
      "start": 219.74000549316406,
      "end": 222.66000366210938,
      "text": " Well, I think, first of all, you must be saved."
    },
    {
      "id": 85,
      "start": 222.66000366210938,
      "end": 223.5399932861328,
      "text": " If you're not saved,"
    },
    {
      "id": 86,
      "start": 223.5399932861328,
      "end": 225.6199951171875,
      "text": " if you're not saved by the blood of Christ,"
    },
    {
      "id": 87,
      "start": 226.13999938964844,
      "end": 227.10000610351562,
      "text": " then you're not going to be referred to"
    },
    {
      "id": 88,
      "start": 227.10000610351562,
      "end": 230.10000610351562,
      "text": " as a man or woman of God."
    },
    {
      "id": 89,
      "start": 230.10000610351562,
      "end": 232.3800048828125,
      "text": " We find this morning the truth of salvation"
    },
    {
      "id": 90,
      "start": 232.3800048828125,
      "end": 235.02000427246094,
      "text": " has been plainly dealt with,"
    },
    {
      "id": 91,
      "start": 235.02000427246094,
      "end": 237.10000610351562,
      "text": " even in the book of 1 Timothy,"
    },
    {
      "id": 92,
      "start": 237.10000610351562,
      "end": 240.13999938964844,
      "text": " that Paul says this at the beginning of the book."
    },
    {
      "id": 93,
      "start": 240.13999938964844,
      "end": 243.05999755859375,
      "text": " He talks about the importance of understanding"
    },
    {
      "id": 94,
      "start": 243.05999755859375,
      "end": 245.02000427246094,
      "text": " the grace and mercy of God,"
    },
    {
      "id": 95,
      "start": 245.02000427246094,
      "end": 246.94000244140625,
      "text": " and he says this is a faithful saying"
    },
    {
      "id": 96,
      "start": 246.94000244140625,
      "end": 248.4199981689453,
      "text": " and worthy of all acceptation,"
    },
    {
      "id": 97,
      "start": 248.4199981689453,
      "end": 251.4199981689453,
      "text": " that Christ Jesus came into the world"
    },
    {
      "id": 98,
      "start": 251.4199981689453,
      "end": 255.0399932861328,
      "text": " to save sinners, of whom I am chief."
    },
    {
      "id": 99,
      "start": 255.0399932861328,
      "end": 257.1199951171875,
      "text": " I am thankful this morning"
    },
    {
      "id": 100,
      "start": 257.1199951171875,
      "end": 260.6000061035156,
      "text": " that Jesus Christ left heaven's glory."
    },
    {
      "id": 101,
      "start": 260.6000061035156,
      "end": 262.5199890136719,
      "text": " He left the throne room of heaven."
    },
    {
      "id": 102,
      "start": 262.5199890136719,
      "end": 264.55999755859375,
      "text": " He left all that he had."
    },
    {
      "id": 103,
      "start": 264.55999755859375,
      "end": 267.5199890136719,
      "text": " He that was rich, he became poor for us."
    },
    {
      "id": 104,
      "start": 267.5199890136719,
      "end": 270.9599914550781,
      "text": " He humbled himself and he became obedient unto death,"
    },
    {
      "id": 105,
      "start": 270.9599914550781,
      "end": 272.4800109863281,
      "text": " even the death of the cross."
    },
    {
      "id": 106,
      "start": 272.4800109863281,
      "end": 273.32000732421875,
      "text": " Why?"
    },
    {
      "id": 107,
      "start": 273.32000732421875,
      "end": 276.239990234375,
      "text": " So that mankind could be redeemed."
    },
    {
      "id": 108,
      "start": 276.239990234375,
      "end": 279.1199951171875,
      "text": " And we find this morning that Paul would then say"
    },
    {
      "id": 109,
      "start": 279.1199951171875,
      "end": 281.760009765625,
      "text": " in the second chapter of the book of 1 Timothy,"
    },
    {
      "id": 110,
      "start": 281.760009765625,
      "end": 283.3999938964844,
      "text": " speaking of God, he says,"
    },
    {
      "id": 111,
      "start": 283.4800109863281,
      "end": 285.9599914550781,
      "text": " who will have all men to be saved"
    },
    {
      "id": 112,
      "start": 285.9599914550781,
      "end": 289.239990234375,
      "text": " and to come unto the knowledge of the truth."
    },
    {
      "id": 113,
      "start": 289.239990234375,
      "end": 291.6000061035156,
      "text": " And what a blessing it is for us to understand"
    },
    {
      "id": 114,
      "start": 291.6000061035156,
      "end": 293.67999267578125,
      "text": " and to have that biblical perspective"
    },
    {
      "id": 115,
      "start": 293.67999267578125,
      "end": 295.32000732421875,
      "text": " with regard to conversion,"
    },
    {
      "id": 116,
      "start": 295.32000732421875,
      "end": 297.2799987792969,
      "text": " that all men must be saved."
    },
    {
      "id": 117,
      "start": 297.2799987792969,
      "end": 301.4800109863281,
      "text": " If you're a human being, you're in need of salvation."
    },
    {
      "id": 118,
      "start": 301.4800109863281,
      "end": 302.6000061035156,
      "text": " If you're here this morning"
    },
    {
      "id": 119,
      "start": 302.6000061035156,
      "end": 304.8399963378906,
      "text": " and you've already trust that Christ is your savior,"
    },
    {
      "id": 120,
      "start": 304.8399963378906,
      "end": 307.4599914550781,
      "text": " then you can rejoice, and I rejoice with you"
    },
    {
      "id": 121,
      "start": 307.4599914550781,
      "end": 310.0799865722656,
      "text": " that you've been born again, that you're heaven bound."
    },
    {
      "id": 122,
      "start": 310.0799865722656,
      "end": 311.29998779296875,
      "text": " If you're not yet saved,"
    },
    {
      "id": 123,
      "start": 311.29998779296875,
      "end": 313.6600036621094,
      "text": " if you've never trust that Christ is your savior,"
    },
    {
      "id": 124,
      "start": 313.6600036621094,
      "end": 316.29998779296875,
      "text": " if there's not been that moment in your life"
    },
    {
      "id": 125,
      "start": 316.29998779296875,
      "end": 318.2200012207031,
      "text": " where you understood that you were a sinner"
    },
    {
      "id": 126,
      "start": 318.2200012207031,
      "end": 319.8999938964844,
      "text": " and that there's a penalty for sin"
    },
    {
      "id": 127,
      "start": 319.8999938964844,
      "end": 322.5400085449219,
      "text": " and it's separation from God for all of eternity"
    },
    {
      "id": 128,
      "start": 322.5400085449219,
      "end": 326.5799865722656,
      "text": " in the lake of fire and that Jesus Christ is the only way."
    },
    {
      "id": 129,
      "start": 326.5799865722656,
      "end": 329.5,
      "text": " He said, I am the way, the truth and the life."
    },
    {
      "id": 130,
      "start": 329.5,
      "end": 332.94000244140625,
      "text": " No man cometh unto the father but by me."
    },
    {
      "id": 131,
      "start": 332.94000244140625,
      "end": 334.1000061035156,
      "text": " Could I tell you this morning,"
    },
    {
      "id": 132,
      "start": 334.1000061035156,
      "end": 335.5799865722656,
      "text": " if you've not trust that Christ"
    },
    {
      "id": 133,
      "start": 335.5799865722656,
      "end": 339.82000732421875,
      "text": " that today is the day of salvation, no longer delay."
    },
    {
      "id": 134,
      "start": 339.82000732421875,
      "end": 342.94000244140625,
      "text": " Do not put it off for a moment longer."
    },
    {
      "id": 135,
      "start": 342.94000244140625,
      "end": 344.5400085449219,
      "text": " Trust Christ today."
    },
    {
      "id": 136,
      "start": 344.5400085449219,
      "end": 346.1000061035156,
      "text": " He is ready to save you."
    },
    {
      "id": 137,
      "start": 346.1000061035156,
      "end": 346.94000244140625,
      "text": " He loves you."
    },
    {
      "id": 138,
      "start": 346.94000244140625,
      "end": 349.05999755859375,
      "text": " He died for you."
    },
    {
      "id": 139,
      "start": 349.05999755859375,
      "end": 351.1000061035156,
      "text": " So we find that Timothy,"
    },
    {
      "id": 140,
      "start": 351.1000061035156,
      "end": 353.82000732421875,
      "text": " before he could be referred to as being a man of God,"
    },
    {
      "id": 141,
      "start": 353.82000732421875,
      "end": 356.5,
      "text": " he must be a child of God."
    },
    {
      "id": 142,
      "start": 356.5,
      "end": 359.17999267578125,
      "text": " He must be saved by the grace of God."
    },
    {
      "id": 143,
      "start": 359.17999267578125,
      "end": 361.5799865722656,
      "text": " I believe one that would be referred to as being a man"
    },
    {
      "id": 144,
      "start": 361.5799865722656,
      "end": 364.9800109863281,
      "text": " or woman of God would be one that is growing spiritually,"
    },
    {
      "id": 145,
      "start": 364.9800109863281,
      "end": 368.5,
      "text": " not just somebody that's saved, but somebody that's growing,"
    },
    {
      "id": 146,
      "start": 368.5,
      "end": 370.7799987792969,
      "text": " somebody that's walking with Christ,"
    },
    {
      "id": 147,
      "start": 370.7799987792969,
      "end": 375.17999267578125,
      "text": " that's showing, demonstrating, displaying in their life"
    },
    {
      "id": 148,
      "start": 375.17999267578125,
      "end": 376.4200134277344,
      "text": " the fruit of the spirit,"
    },
    {
      "id": 149,
      "start": 376.4200134277344,
      "end": 379.05999755859375,
      "text": " someone that the attributes of God"
    },
    {
      "id": 150,
      "start": 379.05999755859375,
      "end": 380.82000732421875,
      "text": " are evidenced in their life."
    },
    {
      "id": 151,
      "start": 380.82000732421875,
      "end": 385.4200134277344,
      "text": " They're growing in their walk with Christ."
    },
    {
      "id": 152,
      "start": 385.4200134277344,
      "end": 388.5799865722656,
      "text": " The reality is that we understand as we study the scripture"
    },
    {
      "id": 153,
      "start": 388.5799865722656,
      "end": 392.1400146484375,
      "text": " that God intends for his people to grow spiritually."
    },
    {
      "id": 154,
      "start": 392.1400146484375,
      "end": 394.70001220703125,
      "text": " He does not just save us and say,"
    },
    {
      "id": 155,
      "start": 394.70001220703125,
      "end": 397.1400146484375,
      "text": " now we're heaven bound and just do what you want,"
    },
    {
      "id": 156,
      "start": 397.1400146484375,
      "end": 399.6600036621094,
      "text": " live how you want because you're going to heaven."
    },
    {
      "id": 157,
      "start": 399.6600036621094,
      "end": 404.29998779296875,
      "text": " No, we find that God desires that we as his children"
    },
    {
      "id": 158,
      "start": 404.29998779296875,
      "end": 406.05999755859375,
      "text": " would walk in obedience,"
    },
    {
      "id": 159,
      "start": 406.05999755859375,
      "end": 409.05999755859375,
      "text": " that we would walk as children of the light,"
    },
    {
      "id": 160,
      "start": 409.05999755859375,
      "end": 412.82000732421875,
      "text": " that we would walk in such a way that he would be pleased,"
    },
    {
      "id": 161,
      "start": 412.82000732421875,
      "end": 415.7799987792969,
      "text": " that he would be honored and glorified."
    },
    {
      "id": 162,
      "start": 415.7799987792969,
      "end": 417.7799987792969,
      "text": " And we find that the individual"
    },
    {
      "id": 163,
      "start": 417.7799987792969,
      "end": 420.6600036621094,
      "text": " that is walking in the spirit,"
    },
    {
      "id": 164,
      "start": 420.6600036621094,
      "end": 423.739990234375,
      "text": " the Bible says they shall not fulfill the lust of the flesh."
    },
    {
      "id": 165,
      "start": 423.739990234375,
      "end": 425.6199951171875,
      "text": " He that is walking in the spirit"
    },
    {
      "id": 166,
      "start": 425.6199951171875,
      "end": 428.6600036621094,
      "text": " that has the fruit of the spirit evidence"
    },
    {
      "id": 167,
      "start": 428.6600036621094,
      "end": 430.29998779296875,
      "text": " displayed in their lives,"
    },
    {
      "id": 168,
      "start": 430.29998779296875,
      "end": 435.29998779296875,
      "text": " the one who according to John 15 is abiding in Christ,"
    },
    {
      "id": 169,
      "start": 435.5799865722656,
      "end": 438.82000732421875,
      "text": " that individual I believe is the one"
    },
    {
      "id": 170,
      "start": 438.82000732421875,
      "end": 443.82000732421875,
      "text": " that God would refer to as a man or a woman of God."
    },
    {
      "id": 171,
      "start": 443.8599853515625,
      "end": 444.82000732421875,
      "text": " The end of the text"
    },
    {
      "id": 172,
      "start": 444.82000732421875,
      "end": 446.4200134277344,
      "text": " or at the end of the message this morning,"
    },
    {
      "id": 173,
      "start": 446.4200134277344,
      "end": 450.4200134277344,
      "text": " we'll look at some of the testimony of Timothy"
    },
    {
      "id": 174,
      "start": 450.4200134277344,
      "end": 452.17999267578125,
      "text": " and understand a little bit more"
    },
    {
      "id": 175,
      "start": 452.17999267578125,
      "end": 454.29998779296875,
      "text": " as we look at a few other portions of scripture"
    },
    {
      "id": 176,
      "start": 454.29998779296875,
      "end": 457.5400085449219,
      "text": " why it is that Timothy would be referred to"
    },
    {
      "id": 177,
      "start": 457.5400085449219,
      "end": 459.05999755859375,
      "text": " as a man of God."
    },
    {
      "id": 178,
      "start": 459.05999755859375,
      "end": 460.6600036621094,
      "text": " But I want you to think about the beginning"
    },
    {
      "id": 179,
      "start": 460.6600036621094,
      "end": 463.3399963378906,
      "text": " of this portion of scripture in verse 11"
    },
    {
      "id": 180,
      "start": 463.3399963378906,
      "end": 467.3800048828125,
      "text": " when God uses the apostle Paul to write to Timothy"
    },
    {
      "id": 181,
      "start": 467.3800048828125,
      "end": 470.94000244140625,
      "text": " and says, but thou, O man of God."
    },
    {
      "id": 182,
      "start": 470.94000244140625,
      "end": 472.70001220703125,
      "text": " Notice the instruction that is provided."
    },
    {
      "id": 183,
      "start": 472.70001220703125,
      "end": 474.3800048828125,
      "text": " Number one, if you're taking notes,"
    },
    {
      "id": 184,
      "start": 474.3800048828125,
      "end": 479.3800048828125,
      "text": " the instruction to flee, the instruction to flee."
    },
    {
      "id": 185,
      "start": 479.3800048828125,
      "end": 480.7799987792969,
      "text": " Notice very simply,"
    },
    {
      "id": 186,
      "start": 480.7799987792969,
      "end": 483.2200012207031,
      "text": " we find that as we start this verse of scripture,"
    },
    {
      "id": 187,
      "start": 483.2200012207031,
      "end": 484.9800109863281,
      "text": " but thou, O man of God,"
    },
    {
      "id": 188,
      "start": 484.9800109863281,
      "end": 488.94000244140625,
      "text": " notice these three words, flee these things."
    },
    {
      "id": 189,
      "start": 488.94000244140625,
      "end": 490.82000732421875,
      "text": " We find in other portions of scripture"
    },
    {
      "id": 190,
      "start": 490.82000732421875,
      "end": 494.4200134277344,
      "text": " that God specifically tells us certain things,"
    },
    {
      "id": 191,
      "start": 494.4200134277344,
      "end": 496.5400085449219,
      "text": " specific things that were to flee."
    },
    {
      "id": 192,
      "start": 496.5400085449219,
      "end": 499.9800109863281,
      "text": " If you go to 1 Corinthians 6, flee fornication."
    },
    {
      "id": 193,
      "start": 499.9800109863281,
      "end": 502.6600036621094,
      "text": " And you can look at a number of other portions of scripture"
    },
    {
      "id": 194,
      "start": 502.6600036621094,
      "end": 505.6199951171875,
      "text": " where something specifically is mentioned"
    },
    {
      "id": 195,
      "start": 505.6199951171875,
      "end": 507.17999267578125,
      "text": " with regard to fleeing."
    },
    {
      "id": 196,
      "start": 507.17999267578125,
      "end": 509.5799865722656,
      "text": " Here it says flee these things."
    },
    {
      "id": 197,
      "start": 509.5799865722656,
      "end": 512.219970703125,
      "text": " So we have to understand contextually"
    },
    {
      "id": 198,
      "start": 512.260009765625,
      "end": 515.6199951171875,
      "text": " as we look at the content of this passage of scripture,"
    },
    {
      "id": 199,
      "start": 515.6199951171875,
      "end": 519.6599731445312,
      "text": " what is it that Paul is telling Timothy to flee?"
    },
    {
      "id": 200,
      "start": 519.6599731445312,
      "end": 522.0999755859375,
      "text": " Well, I believe as we just studied last week"
    },
    {
      "id": 201,
      "start": 522.0999755859375,
      "end": 524.9000244140625,
      "text": " and we look specifically in verses six through 10,"
    },
    {
      "id": 202,
      "start": 524.9000244140625,
      "end": 526.97998046875,
      "text": " and we dealt with the perspective"
    },
    {
      "id": 203,
      "start": 526.97998046875,
      "end": 529.97998046875,
      "text": " that we're to have on contentment."
    },
    {
      "id": 204,
      "start": 529.97998046875,
      "end": 531.8200073242188,
      "text": " And we find that in verse number nine,"
    },
    {
      "id": 205,
      "start": 531.8200073242188,
      "end": 534.219970703125,
      "text": " it says they that will be rich."
    },
    {
      "id": 206,
      "start": 534.219970703125,
      "end": 536.0999755859375,
      "text": " Again, I mentioned last week,"
    },
    {
      "id": 207,
      "start": 536.0999755859375,
      "end": 539.6599731445312,
      "text": " I took great time to explain last Sunday"
    },
    {
      "id": 208,
      "start": 539.7000122070312,
      "end": 542.4600219726562,
      "text": " that it does not say they that are rich."
    },
    {
      "id": 209,
      "start": 542.4600219726562,
      "end": 544.6199951171875,
      "text": " It says they that will be rich."
    },
    {
      "id": 210,
      "start": 544.6199951171875,
      "end": 545.97998046875,
      "text": " That is their drive."
    },
    {
      "id": 211,
      "start": 545.97998046875,
      "end": 547.4600219726562,
      "text": " That is their motivation."
    },
    {
      "id": 212,
      "start": 547.4600219726562,
      "end": 550.3400268554688,
      "text": " That is what they're seeking is riches."
    },
    {
      "id": 213,
      "start": 550.3400268554688,
      "end": 552.3400268554688,
      "text": " And he says, they that will be rich"
    },
    {
      "id": 214,
      "start": 552.3400268554688,
      "end": 554.260009765625,
      "text": " fall into temptation and a snare"
    },
    {
      "id": 215,
      "start": 554.260009765625,
      "end": 556.260009765625,
      "text": " into many foolish and hurtful lusts,"
    },
    {
      "id": 216,
      "start": 556.260009765625,
      "end": 560.5,
      "text": " which drown men in destruction and perdition."
    },
    {
      "id": 217,
      "start": 560.5,
      "end": 563.0599975585938,
      "text": " Verse 10, for the love of money."
    },
    {
      "id": 218,
      "start": 563.0599975585938,
      "end": 564.5399780273438,
      "text": " It doesn't say for money."
    },
    {
      "id": 219,
      "start": 564.5399780273438,
      "end": 568.3400268554688,
      "text": " It says the love of money is the root of all evil,"
    },
    {
      "id": 220,
      "start": 568.3400268554688,
      "end": 570.97998046875,
      "text": " which while some coveted after,"
    },
    {
      "id": 221,
      "start": 570.97998046875,
      "end": 572.6599731445312,
      "text": " they have erred from the faith"
    },
    {
      "id": 222,
      "start": 572.6599731445312,
      "end": 575.5399780273438,
      "text": " and pierced themselves through with many sorrows."
    },
    {
      "id": 223,
      "start": 575.5399780273438,
      "end": 577.0599975585938,
      "text": " And so we look at this truth"
    },
    {
      "id": 224,
      "start": 577.0599975585938,
      "end": 580.0599975585938,
      "text": " with regard to contentment, verse six and seven,"
    },
    {
      "id": 225,
      "start": 580.0599975585938,
      "end": 583.1400146484375,
      "text": " but godliness with contentment is great gain,"
    },
    {
      "id": 226,
      "start": 583.1400146484375,
      "end": 585.0999755859375,
      "text": " for we brought nothing into this world"
    },
    {
      "id": 227,
      "start": 585.0999755859375,
      "end": 587.5,
      "text": " and this certainly can carry nothing out."
    },
    {
      "id": 228,
      "start": 587.5,
      "end": 590.8200073242188,
      "text": " We find that Paul then says to Timothy,"
    },
    {
      "id": 229,
      "start": 590.8200073242188,
      "end": 594.0599975585938,
      "text": " flee these things."
    },
    {
      "id": 230,
      "start": 594.0599975585938,
      "end": 596.1400146484375,
      "text": " You understand that Timothy,"
    },
    {
      "id": 231,
      "start": 596.1400146484375,
      "end": 599.5800170898438,
      "text": " though he's not a young man, like as a teenager,"
    },
    {
      "id": 232,
      "start": 599.5800170898438,
      "end": 600.4199829101562,
      "text": " he still."
    },
    {
      "id": 0,
      "start": 600.4199829101562,
      "end": 608.2599830627441,
      "text": " is younger, as Paul refers to him as a youth. He's probably about 35, 40 years old, really,"
    },
    {
      "id": 1,
      "start": 608.2599830627441,
      "end": 612.5799827575684,
      "text": " in this portion of scripture when it's being written to him. But we find that he's still"
    },
    {
      "id": 2,
      "start": 612.5799827575684,
      "end": 618.3399829864502,
      "text": " younger. But you understand that there is, if you think about the young people here this morning,"
    },
    {
      "id": 3,
      "start": 618.3399829864502,
      "end": 626.4199829101562,
      "text": " there is a perspective, a worldview that is painted for them that they are to seek after"
    },
    {
      "id": 4,
      "start": 626.4199829101562,
      "end": 633.6199836730957,
      "text": " and follow after wealth and riches, and that's their driving force. I remember when I first"
    },
    {
      "id": 5,
      "start": 633.6199836730957,
      "end": 639.2199821472168,
      "text": " shared with my grandfather, who passed away a number of years ago, that God was calling me to"
    },
    {
      "id": 6,
      "start": 639.2199821472168,
      "end": 644.5799827575684,
      "text": " the ministry, and I believe that God wanted me to pastor. And I remember his first response to me"
    },
    {
      "id": 7,
      "start": 644.5799827575684,
      "end": 652.8199844360352,
      "text": " was this, does it pay well? That was his perspective. That was his thought. And we"
    },
    {
      "id": 8,
      "start": 652.8199844360352,
      "end": 658.3399810791016,
      "text": " find here that Paul says to Timothy to flee these things. What are these things? Well, really,"
    },
    {
      "id": 9,
      "start": 658.3399810791016,
      "end": 664.97998046875,
      "text": " these are temporary things. These are temporal things. And we find as a man of God, or as a"
    },
    {
      "id": 10,
      "start": 664.97998046875,
      "end": 671.4599838256836,
      "text": " woman of God, we should be not focused on those things which are temporary, those things which"
    },
    {
      "id": 11,
      "start": 671.4599838256836,
      "end": 678.8999862670898,
      "text": " in a moment can fade away, can flee away. We find that we ought to be eternally focused."
    },
    {
      "id": 12,
      "start": 678.8999862670898,
      "end": 684.97998046875,
      "text": " And so the apostle Paul, as he's writing to Timothy, he says, listen, flee these things. We"
    },
    {
      "id": 13,
      "start": 684.97998046875,
      "end": 689.4599838256836,
      "text": " understand that he doesn't simply say to avoid them, but to flee them. There had to be some"
    },
    {
      "id": 14,
      "start": 689.4599838256836,
      "end": 695.9399795532227,
      "text": " great pressure, some great influence there with regard to those that were seeking, that will be"
    },
    {
      "id": 15,
      "start": 695.9399795532227,
      "end": 703.0599822998047,
      "text": " rich, those that were loving money, and they were, this attitude, this worldview was being developed."
    },
    {
      "id": 16,
      "start": 703.0599822998047,
      "end": 711.2199859619141,
      "text": " And Paul says to Timothy, flee these things. Actively make a decision that you will flee"
    },
    {
      "id": 17,
      "start": 711.2199859619141,
      "end": 716.8999862670898,
      "text": " from these things. Notice with me that Paul says, he gives instruction to flee. Number two, the"
    },
    {
      "id": 18,
      "start": 716.8999862670898,
      "end": 723.7799835205078,
      "text": " instruction to follow, the instruction to follow. I think it's a great contrast that we find in our"
    },
    {
      "id": 19,
      "start": 723.7799835205078,
      "end": 728.4999847412109,
      "text": " text of scripture between these things that are referenced, which would be the riches that are"
    },
    {
      "id": 20,
      "start": 728.4999847412109,
      "end": 735.2199859619141,
      "text": " spoken of in verses 9 and 10, with that which we're to follow after. As Timothy being again"
    },
    {
      "id": 21,
      "start": 735.2199859619141,
      "end": 741.4599761962891,
      "text": " referred to as this man of God, he has a higher calling, a higher plane, if you will. We sing the"
    },
    {
      "id": 22,
      "start": 741.4599761962891,
      "end": 747.2999877929688,
      "text": " song, higher ground. Lord, plant my feet on higher ground, right? And we think about the importance,"
    },
    {
      "id": 23,
      "start": 747.2999877929688,
      "end": 753.2199859619141,
      "text": " Paul mentions it in the book of 2 Corinthians, about having an eternal perspective and not"
    },
    {
      "id": 24,
      "start": 753.2999877929688,
      "end": 759.6999816894531,
      "text": " a temporal perspective, and we find that this instruction is given to follow. So, understand"
    },
    {
      "id": 25,
      "start": 759.6999816894531,
      "end": 764.4999847412109,
      "text": " with me this morning, he says, flee these things. There's some things that you're to flee, but then"
    },
    {
      "id": 26,
      "start": 764.4999847412109,
      "end": 772.3399810791016,
      "text": " follow after these things. By the way, every time we take something out of our life, we ought to"
    },
    {
      "id": 27,
      "start": 772.3399810791016,
      "end": 778.2599792480469,
      "text": " replace it with something that is appropriate and biblical, something that is God honoring."
    },
    {
      "id": 28,
      "start": 778.2599792480469,
      "end": 783.8599853515625,
      "text": " God doesn't just say, flee these things, and then there's a void. God says, flee these things"
    },
    {
      "id": 29,
      "start": 783.8599853515625,
      "end": 789.4599761962891,
      "text": " because you're following these things. By the way, if I'm actively following what I'm supposed"
    },
    {
      "id": 30,
      "start": 789.4599761962891,
      "end": 795.2199859619141,
      "text": " to be following after, then at the same time I'm fleeing the things that I'm not supposed to be"
    },
    {
      "id": 31,
      "start": 795.2199859619141,
      "end": 801.5399780273438,
      "text": " following. Does that make sense? I cannot follow after the things that are mentioned here, while"
    },
    {
      "id": 32,
      "start": 801.5399780273438,
      "end": 808.6599884033203,
      "text": " at the same time following the things that he says to flee. So, I'm fleeing, but I'm following."
    },
    {
      "id": 33,
      "start": 809.6999816894531,
      "end": 817.2199859619141,
      "text": " And we find here in verse number 11, he says, follow after righteousness, godliness, faith,"
    },
    {
      "id": 34,
      "start": 818.0199890136719,
      "end": 826.3399810791016,
      "text": " love, patience, and meekness. As we look at these particular words that are given, six things"
    },
    {
      "id": 35,
      "start": 826.3399810791016,
      "end": 833.0599822998047,
      "text": " that Paul instructs Timothy with regard to what he is to follow after, I want you to find this"
    },
    {
      "id": 36,
      "start": 833.0599822998047,
      "end": 839.3799896240234,
      "text": " morning how this helps to shape and to mold a direction of an individual. We find this morning"
    },
    {
      "id": 37,
      "start": 839.3799896240234,
      "end": 845.3799896240234,
      "text": " that we're to seek after God, we're to follow after the Lord, and he says here, follow after"
    },
    {
      "id": 38,
      "start": 845.3799896240234,
      "end": 853.6999816894531,
      "text": " righteousness, that which is right. I understand today that there are some that have sought to"
    },
    {
      "id": 39,
      "start": 853.6999816894531,
      "end": 860.0199890136719,
      "text": " redefine what is right and what is wrong, what is holy and what is evil, and we find that even"
    },
    {
      "id": 40,
      "start": 860.739990234375,
      "end": 866.8199768066406,
      "text": " today this is nothing new. This is something that's been going on for centuries. We find that"
    },
    {
      "id": 41,
      "start": 866.8199768066406,
      "end": 872.3399963378906,
      "text": " all the way back as Jeremiah and Isaiah are prophesying in Israel and Judah that they call"
    },
    {
      "id": 42,
      "start": 872.3399963378906,
      "end": 880.0999755859375,
      "text": " evil good and good evil, and we find today that we live in that type of situation where we have"
    },
    {
      "id": 43,
      "start": 880.0999755859375,
      "end": 887.219970703125,
      "text": " had those individuals seek to redefine what is right. Can I tell you this morning that God defines"
    },
    {
      "id": 44,
      "start": 887.219970703125,
      "end": 894.5799865722656,
      "text": " what is right? We find that God defines what is good and what is right, and he says follow after"
    },
    {
      "id": 45,
      "start": 895.2999877929688,
      "end": 903.219970703125,
      "text": " righteousness, that which is right, that which is pleasing to God, that which is right in the eyes"
    },
    {
      "id": 46,
      "start": 903.7799682617188,
      "end": 909.8599853515625,
      "text": " of our God, of our Savior. Follow after righteousness. Notice he not only says"
    },
    {
      "id": 47,
      "start": 909.8599853515625,
      "end": 916.2599792480469,
      "text": " righteousness, but then he says godliness, the things of God, the things of God."
    },
    {
      "id": 48,
      "start": 916.8199768066406,
      "end": 923.219970703125,
      "text": " You understand that Timothy, again, being a born-again believer, being a child of God,"
    },
    {
      "id": 49,
      "start": 923.219970703125,
      "end": 930.3399963378906,
      "text": " that he is to follow after righteousness, but also godliness, the things of God. You know,"
    },
    {
      "id": 50,
      "start": 930.3399963378906,
      "end": 936.739990234375,
      "text": " the reality this morning is that we can be about our own business or we can be about our Father's"
    },
    {
      "id": 51,
      "start": 936.739990234375,
      "end": 941.7799682617188,
      "text": " business. You think about what Jesus said. He said he was about his Father's business,"
    },
    {
      "id": 52,
      "start": 942.739990234375,
      "end": 948.4999694824219,
      "text": " and this morning we must understand that we need to be following after godliness, the things"
    },
    {
      "id": 53,
      "start": 949.0599975585938,
      "end": 955.6999816894531,
      "text": " that are of God, the things that pertain to God that were about our Father's business."
    },
    {
      "id": 54,
      "start": 956.6599731445312,
      "end": 962.4199829101562,
      "text": " As we look at our lives, as we examine our lives, and we begin to use this list of these six items"
    },
    {
      "id": 55,
      "start": 962.4199829101562,
      "end": 967.0599975585938,
      "text": " that are given to us this morning that we're to follow after, we could, at each point,"
    },
    {
      "id": 56,
      "start": 967.6999816894531,
      "end": 975.5399780273438,
      "text": " examine our own lives and say, am I following after, am I pursuing righteousness, godliness?"
    },
    {
      "id": 57,
      "start": 975.6199951171875,
      "end": 983.5399780273438,
      "text": " Notice number three, faith. The Bible tells us that the just shall live by faith."
    },
    {
      "id": 58,
      "start": 984.739990234375,
      "end": 990.8199768066406,
      "text": " The simplest definition that I know that I could give you of faith is taking God at His word,"
    },
    {
      "id": 59,
      "start": 990.8199768066406,
      "end": 995.219970703125,
      "text": " just believing God. Paul stood up in the book of Acts when they're dealing with"
    },
    {
      "id": 60,
      "start": 996.0999755859375,
      "end": 1002.8999938964844,
      "text": " a great storm in Acts 27, and all hope that they should live was gone, and it was as if they were"
    },
    {
      "id": 61,
      "start": 1002.8999938964844,
      "end": 1008.6599731445312,
      "text": " certain they would perish, and we find that God sends and gives Him word that they would be spared,"
    },
    {
      "id": 62,
      "start": 1008.6599731445312,
      "end": 1013.3799743652344,
      "text": " that there would be destruction of the ship, but no lives would be lost, and Paul stands up,"
    },
    {
      "id": 63,
      "start": 1013.3799743652344,
      "end": 1022.6599731445312,
      "text": " and he makes this bold statement. He says, I believe God, that it shall be. It's going to be"
    },
    {
      "id": 64,
      "start": 1022.6599731445312,
      "end": 1029.7799682617188,
      "text": " just as God said it would be, and this morning we must have faith. We must believe God. In fact,"
    },
    {
      "id": 65,
      "start": 1029.8599853515625,
      "end": 1033.6199951171875,
      "text": " in the book of Hebrews, in the 11th chapter, a passage of scripture that we've often referred"
    },
    {
      "id": 66,
      "start": 1033.6199951171875,
      "end": 1039.4599914550781,
      "text": " to as being the hall of faith chapter, we see how God lists throughout that portion of scripture,"
    },
    {
      "id": 67,
      "start": 1039.4599914550781,
      "end": 1045.0599975585938,
      "text": " by faith this individual did this, and by faith this individual did this. What did they do? They"
    },
    {
      "id": 68,
      "start": 1045.0599975585938,
      "end": 1053.7799682617188,
      "text": " believed God. They simply acted in obedience. They responded in faith that God would do what God said"
    },
    {
      "id": 69,
      "start": 1053.7799682617188,
      "end": 1060.4199829101562,
      "text": " He would do. How do we get faith? Well, faith cometh by hearing, and hearing by the word of God."
    },
    {
      "id": 70,
      "start": 1060.4199829101562,
      "end": 1065.2999877929688,
      "text": " We must be in the Bible. We must be in the scriptures if we're going to have our faith"
    },
    {
      "id": 71,
      "start": 1065.2999877929688,
      "end": 1071.7799682617188,
      "text": " increased, and if we're going to live by faith. Hebrews 11, I referenced a moment ago, but verse"
    },
    {
      "id": 72,
      "start": 1071.7799682617188,
      "end": 1079.6999816894531,
      "text": " number six says this, that without faith it is impossible to please Him, to please God,"
    },
    {
      "id": 73,
      "start": 1079.6999816894531,
      "end": 1084.97998046875,
      "text": " for he that cometh to God must believe that He is, and that He is a rewarder of them that"
    },
    {
      "id": 74,
      "start": 1084.97998046875,
      "end": 1092.0999755859375,
      "text": " diligently seek Him, and we find this morning, listen, we're to live by faith. It pleases God"
    },
    {
      "id": 75,
      "start": 1092.0999755859375,
      "end": 1099.7799682617188,
      "text": " when we live by faith, not by sight. We live by faith, and I'm so thankful this morning. I want"
    },
    {
      "id": 76,
      "start": 1099.7799682617188,
      "end": 1104.739990234375,
      "text": " you to think about what God says, the Lord Jesus Christ says to Thomas. Hold your place here in the"
    },
    {
      "id": 77,
      "start": 1104.739990234375,
      "end": 1109.6999816894531,
      "text": " book of 1 Timothy, and turn to the book of John, if you will, and I want you to see what we read"
    },
    {
      "id": 78,
      "start": 1109.6999816894531,
      "end": 1116.8200073242188,
      "text": " here in John chapter number 20, and I want you to think about this truth, and we oftentimes, we"
    },
    {
      "id": 79,
      "start": 1117.5399780273438,
      "end": 1122.4199829101562,
      "text": " are familiar with Thomas. In fact, many times we'll be referred to as being doubting Thomas. You've"
    },
    {
      "id": 80,
      "start": 1122.4199829101562,
      "end": 1129.1399536132812,
      "text": " heard that phraseology that's been given to him, and we find that Thomas, he makes this statement"
    },
    {
      "id": 81,
      "start": 1129.1399536132812,
      "end": 1135.219970703125,
      "text": " because he was not where he should have been, and Jesus showed up, and the disciples tell him"
    },
    {
      "id": 82,
      "start": 1135.219970703125,
      "end": 1141.5399780273438,
      "text": " about Jesus being there, and he wasn't there to see it, and he says this, I will not believe."
    },
    {
      "id": 83,
      "start": 1142.739990234375,
      "end": 1149.0599975585938,
      "text": " Wow, what a statement at the end of verse number 25. After eight days again, verse number 26,"
    },
    {
      "id": 84,
      "start": 1149.0599975585938,
      "end": 1154.260009765625,
      "text": " his disciples were within, and notice the Bible says, and Thomas with them. That's just always"
    },
    {
      "id": 85,
      "start": 1154.260009765625,
      "end": 1159.7799682617188,
      "text": " of interest to me. The Holy Spirit includes those words, and Thomas with them. He wasn't"
    },
    {
      "id": 86,
      "start": 1159.7799682617188,
      "end": 1164.8200073242188,
      "text": " going to miss it again. The Bible says this, then came Jesus, the doors being shut, and stood in the"
    },
    {
      "id": 87,
      "start": 1164.8200073242188,
      "end": 1171.5399780273438,
      "text": " midst, and said, peace be unto you. Then saith he to Thomas, now I love this. You know why I love"
    },
    {
      "id": 88,
      "start": 1171.5399780273438,
      "end": 1178.4199829101562,
      "text": " this so much, is because God wants to see our faith increased. He wants us to believe. Do you"
    },
    {
      "id": 89,
      "start": 1178.4199829101562,
      "end": 1188.0999755859375,
      "text": " remember Gideon? God comes to Gideon and says, thou mighty man of valor. The Midianites, a great"
    },
    {
      "id": 90,
      "start": 1188.0999755859375,
      "end": 1194.0999755859375,
      "text": " host of people that were oppressing the children of Israel at that time, he says he's going to"
    },
    {
      "id": 91,
      "start": 1194.0999755859375,
      "end": 1200.1799926757812,
      "text": " provide deliverance through Gideon. Gideon's like, you got the wrong guy. Gideon had small faith."
    },
    {
      "id": 0,
      "start": 1200.1799926757812,
      "end": 1202.6199927330017,
      "text": " But you know what God did for Gideon?"
    },
    {
      "id": 1,
      "start": 1202.6199927330017,
      "end": 1204.1799926757812,
      "text": " He built his faith."
    },
    {
      "id": 2,
      "start": 1204.1799926757812,
      "end": 1209.739993095398,
      "text": " You can look through those portions of Scripture and you can see in Judges 6 and 7 how that"
    },
    {
      "id": 3,
      "start": 1209.739993095398,
      "end": 1214.859992980957,
      "text": " Gideon's faith is increased and God doesn't get angry with Gideon for saying, I'm going"
    },
    {
      "id": 4,
      "start": 1214.859992980957,
      "end": 1216.5799922943115,
      "text": " to put this fleece out and let..."
    },
    {
      "id": 5,
      "start": 1216.5799922943115,
      "end": 1218.4599933624268,
      "text": " No, God doesn't get mad at Gideon."
    },
    {
      "id": 6,
      "start": 1218.4599933624268,
      "end": 1220.3799934387207,
      "text": " You know what God does?"
    },
    {
      "id": 7,
      "start": 1220.3799934387207,
      "end": 1223.0199928283691,
      "text": " He builds his faith."
    },
    {
      "id": 8,
      "start": 1223.0199928283691,
      "end": 1227.3799934387207,
      "text": " We have a God who is so gracious, who is so kind."
    },
    {
      "id": 9,
      "start": 1227.3799934387207,
      "end": 1229.9799919128418,
      "text": " We have a God who knows our frame."
    },
    {
      "id": 10,
      "start": 1229.9799919128418,
      "end": 1234.8999938964844,
      "text": " He wants us to be people of faith and here we find that Jesus, he goes to Thomas and"
    },
    {
      "id": 11,
      "start": 1234.8999938964844,
      "end": 1241.259994506836,
      "text": " notice what he says, reach hither thy finger, behold my hands and reach hither thy hand"
    },
    {
      "id": 12,
      "start": 1241.259994506836,
      "end": 1247.859992980957,
      "text": " and thrust it into my side and be not faithless, but believing."
    },
    {
      "id": 13,
      "start": 1247.859992980957,
      "end": 1252.8999938964844,
      "text": " Thomas answered and said unto him, my Lord and my God."
    },
    {
      "id": 14,
      "start": 1252.8999938964844,
      "end": 1254.9399909973145,
      "text": " By the way, Jesus didn't rebuke him."
    },
    {
      "id": 15,
      "start": 1254.9399909973145,
      "end": 1255.9399909973145,
      "text": " Why?"
    },
    {
      "id": 16,
      "start": 1255.9399909973145,
      "end": 1256.9399909973145,
      "text": " Because he's God."
    },
    {
      "id": 17,
      "start": 1257.4999923706055,
      "end": 1260.9799919128418,
      "text": " If you came up here and said to me, my Lord and my God, I'd stop you in a heartless and"
    },
    {
      "id": 18,
      "start": 1260.9799919128418,
      "end": 1264.859992980957,
      "text": " I am not, but Jesus is God."
    },
    {
      "id": 19,
      "start": 1264.859992980957,
      "end": 1272.9399948120117,
      "text": " So when Thomas says, my Lord and my God, Thomas is not rebuked for that because it's the truth."
    },
    {
      "id": 20,
      "start": 1272.9399948120117,
      "end": 1280.4199905395508,
      "text": " But I want you to notice what Jesus says in verse 29, Jesus saith unto him, Thomas, because"
    },
    {
      "id": 21,
      "start": 1280.4199905395508,
      "end": 1284.5399932861328,
      "text": " thou hast seen me, thou hast believed."
    },
    {
      "id": 22,
      "start": 1284.5399932861328,
      "end": 1288.3799896240234,
      "text": " What are they that have not seen and yet have believed?"
    },
    {
      "id": 23,
      "start": 1288.3799896240234,
      "end": 1292.8199920654297,
      "text": " I want you to understand this morning that God wants us to be people of faith."
    },
    {
      "id": 24,
      "start": 1292.8199920654297,
      "end": 1298.0199890136719,
      "text": " He wants us to have faith that God is real, that God's on his throne, that we believe"
    },
    {
      "id": 25,
      "start": 1298.0199890136719,
      "end": 1299.0199890136719,
      "text": " this book."
    },
    {
      "id": 26,
      "start": 1299.0199890136719,
      "end": 1302.6999893188477,
      "text": " I preached a message on Wednesday evening, the totality of scripture and dealing with"
    },
    {
      "id": 27,
      "start": 1302.6999893188477,
      "end": 1308.979995727539,
      "text": " the fact that Paul says, I believe all things that are written in the law and in the prophets"
    },
    {
      "id": 28,
      "start": 1308.979995727539,
      "end": 1315.4999923706055,
      "text": " and the importance that we understand that we take God at his word, that we believe God."
    },
    {
      "id": 29,
      "start": 1315.4999923706055,
      "end": 1316.859992980957,
      "text": " What are we to follow after?"
    },
    {
      "id": 30,
      "start": 1316.859992980957,
      "end": 1321.0199890136719,
      "text": " Righteousness, godliness, faith, notice love."
    },
    {
      "id": 31,
      "start": 1321.0199890136719,
      "end": 1325.9399948120117,
      "text": " Back in 1 Timothy 6 and verse number 11, he says, not only to follow after righteousness,"
    },
    {
      "id": 32,
      "start": 1325.9399948120117,
      "end": 1328.6599884033203,
      "text": " godliness and faith, but also to follow after love."
    },
    {
      "id": 33,
      "start": 1328.6599884033203,
      "end": 1334.6199951171875,
      "text": " There's a whole chapter, 1 Corinthians 13, that's committed to charity or to love."
    },
    {
      "id": 34,
      "start": 1334.6199951171875,
      "end": 1339.259994506836,
      "text": " And we understand that Jesus said this as the end of John, chapter number 13, he says,"
    },
    {
      "id": 35,
      "start": 1339.259994506836,
      "end": 1341.2999877929688,
      "text": " a new commandment I give you."
    },
    {
      "id": 36,
      "start": 1341.2999877929688,
      "end": 1348.219985961914,
      "text": " What is this new commandment I give unto you that you love not in the same way that you"
    },
    {
      "id": 37,
      "start": 1348.219985961914,
      "end": 1351.219985961914,
      "text": " love yourself, but as I have loved?"
    },
    {
      "id": 38,
      "start": 1351.219985961914,
      "end": 1356.5399932861328,
      "text": " See, in the Old Testament, love your neighbor as thyself, but in the New Testament, we find"
    },
    {
      "id": 39,
      "start": 1356.5399932861328,
      "end": 1358.6999969482422,
      "text": " that he says, love as I have loved."
    },
    {
      "id": 40,
      "start": 1358.6999969482422,
      "end": 1359.6999969482422,
      "text": " It's amazing."
    },
    {
      "id": 41,
      "start": 1359.6999969482422,
      "end": 1365.0999908447266,
      "text": " He says, by this, by what, by your love one for another, you'll know, all men will know"
    },
    {
      "id": 42,
      "start": 1365.0999908447266,
      "end": 1367.6999969482422,
      "text": " that you are my disciples."
    },
    {
      "id": 43,
      "start": 1367.6999969482422,
      "end": 1370.5399932861328,
      "text": " First John deals with it very plainly."
    },
    {
      "id": 44,
      "start": 1370.5399932861328,
      "end": 1375.219985961914,
      "text": " Don't say that you love God, but you don't love your brethren."
    },
    {
      "id": 45,
      "start": 1375.219985961914,
      "end": 1379.8599853515625,
      "text": " How can you love God if you don't love your brethren?"
    },
    {
      "id": 46,
      "start": 1379.8599853515625,
      "end": 1382.8599853515625,
      "text": " We find this morning that here he says love."
    },
    {
      "id": 47,
      "start": 1382.8599853515625,
      "end": 1387.5,
      "text": " Now understand with me, I believe that as we're pursuing love, that first and foremost,"
    },
    {
      "id": 48,
      "start": 1387.5,
      "end": 1391.5399932861328,
      "text": " we're speaking about love for God, love for God."
    },
    {
      "id": 49,
      "start": 1391.5399932861328,
      "end": 1397.3399963378906,
      "text": " We're to love him with every part of our being, love him supremely."
    },
    {
      "id": 50,
      "start": 1397.3399963378906,
      "end": 1402.259994506836,
      "text": " Now understand this morning that when we say that we love the Lord, we love him because"
    },
    {
      "id": 51,
      "start": 1402.259994506836,
      "end": 1404.7799987792969,
      "text": " he first loved us."
    },
    {
      "id": 52,
      "start": 1404.7799987792969,
      "end": 1407.7799987792969,
      "text": " I wasn't seeking him, he was seeking me."
    },
    {
      "id": 53,
      "start": 1407.7799987792969,
      "end": 1410.5,
      "text": " He's been so gracious and so merciful and so loving."
    },
    {
      "id": 54,
      "start": 1410.5,
      "end": 1416.1399993896484,
      "text": " And we find that John, first John in the fourth chapter deals very plainly with this truth"
    },
    {
      "id": 55,
      "start": 1416.1799926757812,
      "end": 1420.1799926757812,
      "text": " that I love him because he first loved me."
    },
    {
      "id": 56,
      "start": 1420.1799926757812,
      "end": 1421.1799926757812,
      "text": " What a joy."
    },
    {
      "id": 57,
      "start": 1421.1799926757812,
      "end": 1426.979995727539,
      "text": " Listen, if we love him, first John continues, then we're to keep his commandments."
    },
    {
      "id": 58,
      "start": 1426.979995727539,
      "end": 1430.5399932861328,
      "text": " By the way, John in chapter 14 deals with that as well."
    },
    {
      "id": 59,
      "start": 1430.5399932861328,
      "end": 1433.0999908447266,
      "text": " If you love me, keep my commandments."
    },
    {
      "id": 60,
      "start": 1433.0999908447266,
      "end": 1439.1799926757812,
      "text": " That is the demonstration, that is the evidence of our love for God."
    },
    {
      "id": 61,
      "start": 1439.1799926757812,
      "end": 1443.5799865722656,
      "text": " People can run around and say they love God, they can say whatever they want to say, but"
    },
    {
      "id": 62,
      "start": 1443.5799865722656,
      "end": 1451.8599853515625,
      "text": " the reality is, does the evidence bring forth the truth that we love God?"
    },
    {
      "id": 63,
      "start": 1451.8599853515625,
      "end": 1456.5799865722656,
      "text": " So we're pursuing, we're following after love, love first and foremost for God, but also"
    },
    {
      "id": 64,
      "start": 1456.5799865722656,
      "end": 1459.4599914550781,
      "text": " love for people, love for people."
    },
    {
      "id": 65,
      "start": 1459.4599914550781,
      "end": 1464.4599914550781,
      "text": " I can't love people the way I'm supposed to love people and you can't love people the"
    },
    {
      "id": 66,
      "start": 1464.4599914550781,
      "end": 1468.739990234375,
      "text": " way you're supposed to love people if we're not walking in the Spirit."
    },
    {
      "id": 67,
      "start": 1468.739990234375,
      "end": 1475.2200012207031,
      "text": " It is God who, his Holy Spirit sheds his love through us to others."
    },
    {
      "id": 68,
      "start": 1475.2200012207031,
      "end": 1479.9400024414062,
      "text": " I can't love like I'm supposed to love without the help of the Holy Spirit."
    },
    {
      "id": 69,
      "start": 1479.9400024414062,
      "end": 1486.97998046875,
      "text": " By the way, the fruit of the Spirit is love, joy, peace, long suffering, so on and so forth."
    },
    {
      "id": 70,
      "start": 1486.97998046875,
      "end": 1491.2599792480469,
      "text": " And so we find that the fruit of the Spirit is love."
    },
    {
      "id": 71,
      "start": 1491.2599792480469,
      "end": 1492.2599792480469,
      "text": " What does Paul say?"
    },
    {
      "id": 72,
      "start": 1492.2599792480469,
      "end": 1497.6199951171875,
      "text": " Look in 1 Corinthians 13, as I mentioned a moment ago, this chapter that is dedicated"
    },
    {
      "id": 73,
      "start": 1497.6199951171875,
      "end": 1503.4199829101562,
      "text": " to charity, notice the Bible says this in 1 Corinthians 13, I mean, he lists through"
    },
    {
      "id": 74,
      "start": 1503.4199829101562,
      "end": 1508.6999816894531,
      "text": " it, we don't have time to go through every verse and give, expound upon it, but Paul"
    },
    {
      "id": 75,
      "start": 1508.6999816894531,
      "end": 1512.5,
      "text": " says in 1 Corinthians 13 and verse number 1, though I speak with the tongues of men"
    },
    {
      "id": 76,
      "start": 1512.5,
      "end": 1519.4599914550781,
      "text": " and of angels and have not charity, I am become a sounding brass or a tinkling cymbal."
    },
    {
      "id": 77,
      "start": 1519.4599914550781,
      "end": 1523.739990234375,
      "text": " Though I have the gift of prophecy, verse 2, and understand all mysteries and all knowledge,"
    },
    {
      "id": 78,
      "start": 1523.739990234375,
      "end": 1528.5799865722656,
      "text": " and though I have all faith so that I could remove mountains and have not charity, I"
    },
    {
      "id": 79,
      "start": 1528.5799865722656,
      "end": 1534.7799987792969,
      "text": " am nothing, verse number 3, and though I bestow all my goods to feed the poor, and though"
    },
    {
      "id": 80,
      "start": 1534.7799987792969,
      "end": 1540.97998046875,
      "text": " I give my body to be burned and have not charity, it profiteth me nothing."
    },
    {
      "id": 81,
      "start": 1540.97998046875,
      "end": 1547.1000061035156,
      "text": " He then goes on in the next few verses to explain, to describe detail what charity,"
    },
    {
      "id": 82,
      "start": 1547.1000061035156,
      "end": 1553.1000061035156,
      "text": " what love is, it suffereth long, it is kind, it envieth not, it vaunteth not itself, is"
    },
    {
      "id": 83,
      "start": 1553.1000061035156,
      "end": 1559.1799926757812,
      "text": " not puffed up, doth not behave itself unseemly, seeketh not her own, is not easily provoked,"
    },
    {
      "id": 84,
      "start": 1559.1799926757812,
      "end": 1565.9400024414062,
      "text": " thinketh no evil, rejoiceth not in iniquity, but rejoiceth in the truth, beareth all things,"
    },
    {
      "id": 85,
      "start": 1565.9400024414062,
      "end": 1570.2200012207031,
      "text": " believeth all things, hopeth all things, endureth all things."
    },
    {
      "id": 86,
      "start": 1570.2200012207031,
      "end": 1575.6399841308594,
      "text": " Charity, you know what it says, never faileth."
    },
    {
      "id": 87,
      "start": 1575.6399841308594,
      "end": 1581.0599975585938,
      "text": " Now it says this, but whether they be prophecies, they shall fail."
    },
    {
      "id": 88,
      "start": 1581.0599975585938,
      "end": 1582.5399780273438,
      "text": " Whether they be tongues, they shall cease."
    },
    {
      "id": 89,
      "start": 1582.5399780273438,
      "end": 1584.4599914550781,
      "text": " Whether they be knowledge, it shall vanish away."
    },
    {
      "id": 90,
      "start": 1584.4599914550781,
      "end": 1591.5399780273438,
      "text": " But charity, notice the end of verse number 13, but the greatest of these is charity."
    },
    {
      "id": 91,
      "start": 1591.5399780273438,
      "end": 1595.5799865722656,
      "text": " I believe that as you study the book of 1 Thessalonians and you begin to see a little"
    },
    {
      "id": 92,
      "start": 1595.5799865722656,
      "end": 1599.8999938964844,
      "text": " bit of the heart of the Apostle Paul, we won't take time to look at any verses there, but"
    },
    {
      "id": 93,
      "start": 1599.8999938964844,
      "end": 1604.5799865722656,
      "text": " if you study the life of the Apostle Paul and his ministry to the believers in Thessalonica,"
    },
    {
      "id": 94,
      "start": 1604.5799865722656,
      "end": 1609.5399780273438,
      "text": " I believe that you see something abundantly clear in the book of 1 Thessalonians."
    },
    {
      "id": 95,
      "start": 1609.5399780273438,
      "end": 1614.97998046875,
      "text": " You know what it is, I think that you see, is that Paul loved the people of Thessalonica."
    },
    {
      "id": 96,
      "start": 1614.97998046875,
      "end": 1615.97998046875,
      "text": " He cared about them."
    },
    {
      "id": 97,
      "start": 1615.97998046875,
      "end": 1620.4199829101562,
      "text": " It was genuine love for those people in Thessalonica."
    },
    {
      "id": 98,
      "start": 1620.4199829101562,
      "end": 1625.3399963378906,
      "text": " And you know, because he loved them and because they knew that he loved them, he was able"
    },
    {
      "id": 99,
      "start": 1625.3399963378906,
      "end": 1628.8599853515625,
      "text": " to effectively minister to them."
    },
    {
      "id": 100,
      "start": 1628.8599853515625,
      "end": 1633.2599792480469,
      "text": " He was able to help them grow in their walk with Christ."
    },
    {
      "id": 101,
      "start": 1633.2599792480469,
      "end": 1634.2599792480469,
      "text": " Why?"
    },
    {
      "id": 102,
      "start": 1634.2599792480469,
      "end": 1635.2599792480469,
      "text": " Because he loved them."
    },
    {
      "id": 103,
      "start": 1635.97998046875,
      "end": 1640.6199951171875,
      "text": " We find that here, Paul says, there's some things that you're to flee, but let me give"
    },
    {
      "id": 104,
      "start": 1640.6199951171875,
      "end": 1646.6600036621094,
      "text": " you some things you're to follow, righteousness, godliness, faith, love."
    },
    {
      "id": 105,
      "start": 1646.6600036621094,
      "end": 1652.8200073242188,
      "text": " Notice back in 1 Timothy chapter 6, the fifth one that's listed, patience, patience."
    },
    {
      "id": 106,
      "start": 1652.8200073242188,
      "end": 1656.6600036621094,
      "text": " Long-suffering is how it's worded in the fruit of the Spirit in Galatians chapter number"
    },
    {
      "id": 107,
      "start": 1656.6600036621094,
      "end": 1658.9400024414062,
      "text": " 5, and you see it there."
    },
    {
      "id": 108,
      "start": 1658.9400024414062,
      "end": 1661.6199951171875,
      "text": " But we find here that he says patience."
    },
    {
      "id": 109,
      "start": 1661.6199951171875,
      "end": 1666.8999938964844,
      "text": " You think about this truth of being patient, and I've heard all sorts of things about people"
    },
    {
      "id": 110,
      "start": 1666.8999938964844,
      "end": 1671.8200073242188,
      "text": " that talk about patience and you should never pray for patience and all this kind of thing,"
    },
    {
      "id": 111,
      "start": 1671.8200073242188,
      "end": 1675.7999877929688,
      "text": " but the reality is that I'm thankful that our God is long-suffering, I'm thankful that"
    },
    {
      "id": 112,
      "start": 1675.7999877929688,
      "end": 1682.0199890136719,
      "text": " our God is patient toward us, and we too ought to be long-suffering and we ought to be patient."
    },
    {
      "id": 113,
      "start": 1682.0199890136719,
      "end": 1686.7799987792969,
      "text": " Again, it's not a work in my own flesh, it's not a work in your flesh, it's the Holy Spirit"
    },
    {
      "id": 114,
      "start": 1686.7799987792969,
      "end": 1691.1999816894531,
      "text": " of God working through us."
    },
    {
      "id": 115,
      "start": 1691.1999816894531,
      "end": 1696.1199951171875,
      "text": " As I think about this verse here in 1 Timothy chapter 6 and verse number 11 with the idea"
    },
    {
      "id": 116,
      "start": 1696.1199951171875,
      "end": 1699.7200012207031,
      "text": " of patience, it's waiting for God to work."
    },
    {
      "id": 117,
      "start": 1699.7200012207031,
      "end": 1704.6000061035156,
      "text": " Have you found in your life that God's work is not always done on your timeline, on your"
    },
    {
      "id": 118,
      "start": 1704.6000061035156,
      "end": 1705.6000061035156,
      "text": " timetable?"
    },
    {
      "id": 119,
      "start": 1705.6000061035156,
      "end": 1710.7599792480469,
      "text": " I mean, honestly, have you found it to be the case in your life that God's work is not"
    },
    {
      "id": 120,
      "start": 1710.7599792480469,
      "end": 1715.3200073242188,
      "text": " always done on your timetable or on my timetable?"
    },
    {
      "id": 121,
      "start": 1715.3200073242188,
      "end": 1720.6400146484375,
      "text": " But can I tell you this morning that God's work is always done on time?"
    },
    {
      "id": 122,
      "start": 1720.6400146484375,
      "end": 1725.2000122070312,
      "text": " God's doing a work, and we need to be patient as God is working."
    },
    {
      "id": 123,
      "start": 1725.2000122070312,
      "end": 1731.3200073242188,
      "text": " I say often as the psalmist says in Psalm 119, it is time, Lord, for you to work."
    },
    {
      "id": 124,
      "start": 1731.3200073242188,
      "end": 1737.7999877929688,
      "text": " I mean, it is time for God to work, but the reality is that God is working, God is working."
    },
    {
      "id": 125,
      "start": 1737.7999877929688,
      "end": 1742.6799926757812,
      "text": " You know, there are times that God's working and we don't even see how God is working."
    },
    {
      "id": 126,
      "start": 1742.6799926757812,
      "end": 1745.3399658203125,
      "text": " There are times that God's working on the other end."
    },
    {
      "id": 127,
      "start": 1745.3399658203125,
      "end": 1748.8800048828125,
      "text": " You're praying for an individual, maybe you're not seeing the results that you'd like to"
    },
    {
      "id": 128,
      "start": 1748.8800048828125,
      "end": 1753.719970703125,
      "text": " see because the timeline is not your timeline, but it's God's timeline, but we can rest"
    },
    {
      "id": 129,
      "start": 1753.719970703125,
      "end": 1757.0800170898438,
      "text": " in the fact that God is at work."
    },
    {
      "id": 130,
      "start": 1757.0800170898438,
      "end": 1759.739990234375,
      "text": " We have to have patience."
    },
    {
      "id": 131,
      "start": 1759.739990234375,
      "end": 1765.9600219726562,
      "text": " I'm thankful as I think about Timothy and his responsibility as it was outlined at the"
    },
    {
      "id": 132,
      "start": 1765.9600219726562,
      "end": 1772.5599975585938,
      "text": " end of chapter number five and all of chapter number four is his responsibility as a pastor,"
    },
    {
      "id": 133,
      "start": 1772.5599975585938,
      "end": 1778.0800170898438,
      "text": " as an elder there in Ephesus, the job that he was given to do, that he was going to have"
    },
    {
      "id": 134,
      "start": 1778.0800170898438,
      "end": 1784.8200073242188,
      "text": " the need for patience, for long-suffering."
    },
    {
      "id": 135,
      "start": 1784.8200073242188,
      "end": 1790.0399780273438,
      "text": " You say people annoy me, well, you annoy people, amen?"
    },
    {
      "id": 136,
      "start": 1790.0399780273438,
      "end": 1797.0,
      "text": " The reality is that we can't get so distracted with that and become impatient."
    },
    {
      "id": 137,
      "start": 1797.0,
      "end": 1799.52001953125,
      "text": " No, we pray that God would do a work."
    },
    {
      "id": 0,
      "start": 1799.52001953125,
      "end": 1801.6800196170807,
      "text": " Is God able?"
    },
    {
      "id": 1,
      "start": 1801.6800196170807,
      "end": 1802.6800196170807,
      "text": " Sure He is."
    },
    {
      "id": 2,
      "start": 1802.6800196170807,
      "end": 1804.8000197410583,
      "text": " We sang this morning, He is able to deliver thee."
    },
    {
      "id": 3,
      "start": 1804.8000197410583,
      "end": 1805.8000197410583,
      "text": " Is God sovereign?"
    },
    {
      "id": 4,
      "start": 1805.8000197410583,
      "end": 1806.8000197410583,
      "text": " Yes."
    },
    {
      "id": 5,
      "start": 1806.8000197410583,
      "end": 1807.8000192642212,
      "text": " Is God all-powerful?"
    },
    {
      "id": 6,
      "start": 1807.8000192642212,
      "end": 1808.8000192642212,
      "text": " Yes."
    },
    {
      "id": 7,
      "start": 1808.8000192642212,
      "end": 1814.8800191879272,
      "text": " Is there the need of the individual to surrender themselves and yield themselves?"
    },
    {
      "id": 8,
      "start": 1814.8800191879272,
      "end": 1816.2400188446045,
      "text": " Absolutely."
    },
    {
      "id": 9,
      "start": 1816.2400188446045,
      "end": 1818.1200199127197,
      "text": " But God is at work."
    },
    {
      "id": 10,
      "start": 1818.1200199127197,
      "end": 1824.7200202941895,
      "text": " You know, sometimes I feel like we pray at times, although we reject Calvinism, there"
    },
    {
      "id": 11,
      "start": 1824.7200202941895,
      "end": 1827.52001953125,
      "text": " are times in which we almost pray like we're Calvinist."
    },
    {
      "id": 12,
      "start": 1828.52001953125,
      "end": 1829.52001953125,
      "text": " What do I mean by that?"
    },
    {
      "id": 13,
      "start": 1829.52001953125,
      "end": 1831.440019607544,
      "text": " Lord, would you save that person?"
    },
    {
      "id": 14,
      "start": 1831.440019607544,
      "end": 1837.52001953125,
      "text": " God wants to save the person, but the person has to trust Christ as their Savior."
    },
    {
      "id": 15,
      "start": 1837.52001953125,
      "end": 1844.4800186157227,
      "text": " But sometimes we pray almost like we're Calvinistic in our prayer, instead of understanding the"
    },
    {
      "id": 16,
      "start": 1844.4800186157227,
      "end": 1850.120018005371,
      "text": " need for the individual to respond to the gospel that's been presented."
    },
    {
      "id": 17,
      "start": 1850.120018005371,
      "end": 1853.920021057129,
      "text": " Oftentimes I pray, if I know that there's someone that's not saved and I've been sharing"
    },
    {
      "id": 18,
      "start": 1853.920021057129,
      "end": 1858.2400207519531,
      "text": " the gospel with them and there's a heavy burden to see them saved, I'll pray that"
    },
    {
      "id": 19,
      "start": 1858.2400207519531,
      "end": 1863.7200164794922,
      "text": " God will allow someone else to cross into their path, that maybe the individual's taking"
    },
    {
      "id": 20,
      "start": 1863.7200164794922,
      "end": 1867.1600189208984,
      "text": " a flight, and you know how awesome it would be for the person right next to them on the"
    },
    {
      "id": 21,
      "start": 1867.1600189208984,
      "end": 1871.640022277832,
      "text": " airplane to be a Christian that speaks up and shares the gospel on that."
    },
    {
      "id": 22,
      "start": 1871.640022277832,
      "end": 1876.0800170898438,
      "text": " Listen, it is a time in which God would give you a unique opportunity."
    },
    {
      "id": 23,
      "start": 1876.0800170898438,
      "end": 1881.2800216674805,
      "text": " I heard a story about an individual that he'd always get on the plane at the end, and he'd"
    },
    {
      "id": 24,
      "start": 1881.2800216674805,
      "end": 1884.52001953125,
      "text": " get on the plane, he always wore the same shirt when he was flying, he flew quite a"
    },
    {
      "id": 25,
      "start": 1884.52001953125,
      "end": 1890.5600204467773,
      "text": " bit, and he would walk down the center aisle after everyone's getting seated, and he had"
    },
    {
      "id": 26,
      "start": 1890.5600204467773,
      "end": 1896.8400192260742,
      "text": " written on his shirt, if you want to go to heaven, come talk to me."
    },
    {
      "id": 27,
      "start": 1896.8400192260742,
      "end": 1900.2800216674805,
      "text": " And he'd walk down the aisle, he'd try to get to the furthest to the back of the plane"
    },
    {
      "id": 28,
      "start": 1900.2800216674805,
      "end": 1903.920021057129,
      "text": " he could possibly get to, and he'd try to stop and make sure everyone could read his"
    },
    {
      "id": 29,
      "start": 1903.920021057129,
      "end": 1905.640022277832,
      "text": " shirt."
    },
    {
      "id": 30,
      "start": 1905.640022277832,
      "end": 1911.8800201416016,
      "text": " And that man testified of many, many opportunities that God gave him to be able to share the"
    },
    {
      "id": 31,
      "start": 1911.8800201416016,
      "end": 1917.6800231933594,
      "text": " gospel with individuals because of wearing a shirt that said that."
    },
    {
      "id": 32,
      "start": 1917.6800231933594,
      "end": 1924.2400207519531,
      "text": " But I pray that God would work and that God would send a coworker, a friend, a neighbor,"
    },
    {
      "id": 33,
      "start": 1924.2400207519531,
      "end": 1926.5600204467773,
      "text": " someone to bring the gospel."
    },
    {
      "id": 34,
      "start": 1926.5600204467773,
      "end": 1931.3600158691406,
      "text": " So we have to be patient, knowing that God is working."
    },
    {
      "id": 35,
      "start": 1931.3600158691406,
      "end": 1935.2400207519531,
      "text": " Sometimes we want God to hurry up and work, and we say, this is not my timeline, this"
    },
    {
      "id": 36,
      "start": 1935.3200225830078,
      "end": 1941.8400268554688,
      "text": " is not the timing that I had planned, but we must have patience."
    },
    {
      "id": 37,
      "start": 1941.8400268554688,
      "end": 1943.7200164794922,
      "text": " We must have patience."
    },
    {
      "id": 38,
      "start": 1943.7200164794922,
      "end": 1950.040023803711,
      "text": " Notice finally he says this, meekness, meekness."
    },
    {
      "id": 39,
      "start": 1950.040023803711,
      "end": 1957.3200225830078,
      "text": " Some have wrongly concluded that meekness is weakness."
    },
    {
      "id": 40,
      "start": 1957.3200225830078,
      "end": 1958.3200225830078,
      "text": " Meekness is not weakness."
    },
    {
      "id": 41,
      "start": 1958.3200225830078,
      "end": 1961.8800201416016,
      "text": " To be meek is not to be weak."
    },
    {
      "id": 42,
      "start": 1961.8800201416016,
      "end": 1966.000015258789,
      "text": " In fact, meek is really power under control."
    },
    {
      "id": 43,
      "start": 1966.000015258789,
      "end": 1971.8800201416016,
      "text": " In fact, as we look at this truth of meekness here and we think about the truth that our"
    },
    {
      "id": 44,
      "start": 1971.8800201416016,
      "end": 1974.8000183105469,
      "text": " Lord Jesus Christ, he was meek."
    },
    {
      "id": 45,
      "start": 1974.8000183105469,
      "end": 1977.4800262451172,
      "text": " He was not weak, but he was meek."
    },
    {
      "id": 46,
      "start": 1977.4800262451172,
      "end": 1980.8400268554688,
      "text": " We think about the Old Testament and Moses."
    },
    {
      "id": 47,
      "start": 1980.8400268554688,
      "end": 1982.5600128173828,
      "text": " Moses was meek."
    },
    {
      "id": 48,
      "start": 1982.5600128173828,
      "end": 1983.8400268554688,
      "text": " The Bible tells us that."
    },
    {
      "id": 49,
      "start": 1983.8400268554688,
      "end": 1988.52001953125,
      "text": " He was not weak, but he was meek as a leader."
    },
    {
      "id": 50,
      "start": 1988.52001953125,
      "end": 1993.9600219726562,
      "text": " And Timothy would have this responsibility as he would fulfill the role that God gave"
    },
    {
      "id": 51,
      "start": 1993.9600219726562,
      "end": 1999.6800231933594,
      "text": " him to fulfill, to follow after these things, righteousness, godliness, faith, love, patience,"
    },
    {
      "id": 52,
      "start": 1999.6800231933594,
      "end": 2006.4000244140625,
      "text": " and meekness, to have gentleness or mildness in the manner in which he ministered."
    },
    {
      "id": 53,
      "start": 2006.4000244140625,
      "end": 2010.5600128173828,
      "text": " See, look at 1 Peter chapter 5, if you will."
    },
    {
      "id": 54,
      "start": 2010.5600128173828,
      "end": 2016.1600189208984,
      "text": " Here's the flip side of the coin, if you will, with regard to this instruction to follow"
    },
    {
      "id": 55,
      "start": 2016.1600189208984,
      "end": 2017.760025024414,
      "text": " after meekness."
    },
    {
      "id": 56,
      "start": 2017.760025024414,
      "end": 2023.6400146484375,
      "text": " We find that in 1 Peter chapter 5, Peter is writing to the elders which are among you"
    },
    {
      "id": 57,
      "start": 2023.6400146484375,
      "end": 2026.2000122070312,
      "text": " and he's giving them an exhortation."
    },
    {
      "id": 58,
      "start": 2026.2000122070312,
      "end": 2027.8000183105469,
      "text": " He's giving them some instruction."
    },
    {
      "id": 59,
      "start": 2027.8000183105469,
      "end": 2033.6800231933594,
      "text": " And notice in verse number 1 of 1 Peter 5, as Peter is providing again under the inspiration"
    },
    {
      "id": 60,
      "start": 2033.6800231933594,
      "end": 2038.3200225830078,
      "text": " of the Holy Spirit of God this truth, he says, the elders which are among you I exhort who"
    },
    {
      "id": 61,
      "start": 2038.3200225830078,
      "end": 2043.8800201416016,
      "text": " am also an elder and a witness of the sufferings of Christ and also a partaker of the glory"
    },
    {
      "id": 62,
      "start": 2043.8800201416016,
      "end": 2050.2000122070312,
      "text": " that shall be revealed, feed the flock of God which is among you, taking the oversight"
    },
    {
      "id": 63,
      "start": 2050.2000122070312,
      "end": 2057.1600341796875,
      "text": " thereof, but then notice this, not by constraint but willingly, not for filthy lucre but of"
    },
    {
      "id": 64,
      "start": 2057.1600341796875,
      "end": 2063.760009765625,
      "text": " a ready mind, neither as being lords over God's heritage but being in samples to the"
    },
    {
      "id": 65,
      "start": 2063.760009765625,
      "end": 2065.9600219726562,
      "text": " flock."
    },
    {
      "id": 66,
      "start": 2065.9600219726562,
      "end": 2066.9600219726562,
      "text": " That's meekness."
    },
    {
      "id": 67,
      "start": 2067.6800231933594,
      "end": 2075.1200256347656,
      "text": " See you've heard there's been charges that have been raised against those that are dictators"
    },
    {
      "id": 68,
      "start": 2075.1200256347656,
      "end": 2080.6800231933594,
      "text": " as far as being leaders, the pastor is a dictator type of a leader."
    },
    {
      "id": 69,
      "start": 2080.6800231933594,
      "end": 2090.280029296875,
      "text": " No, God says meekness, not as being lords over God's heritage."
    },
    {
      "id": 70,
      "start": 2090.280029296875,
      "end": 2095.8800048828125,
      "text": " Understand that the people that are saved are God's people."
    },
    {
      "id": 71,
      "start": 2095.8800048828125,
      "end": 2099.2000122070312,
      "text": " I'm thankful I belong to God, aren't you?"
    },
    {
      "id": 72,
      "start": 2099.2000122070312,
      "end": 2104.8800048828125,
      "text": " And here, as Paul would give this instruction to Timothy, he says, listen, you need to flee"
    },
    {
      "id": 73,
      "start": 2104.8800048828125,
      "end": 2106.8600158691406,
      "text": " these things, why?"
    },
    {
      "id": 74,
      "start": 2106.8600158691406,
      "end": 2113.240020751953,
      "text": " Because you have a higher calling, a higher plane, these temporal things, the seeking,"
    },
    {
      "id": 75,
      "start": 2113.240020751953,
      "end": 2118.7200317382812,
      "text": " the being driven to be rich, the love for money, no, flee those things and follow after"
    },
    {
      "id": 76,
      "start": 2118.7200317382812,
      "end": 2125.280029296875,
      "text": " righteousness, godliness, faith, love, patience and meekness."
    },
    {
      "id": 77,
      "start": 2125.280029296875,
      "end": 2128.760009765625,
      "text": " And then number three this morning, he says, not only is there instruction to flee and"
    },
    {
      "id": 78,
      "start": 2128.760009765625,
      "end": 2133.6400146484375,
      "text": " instruction to follow, but number three, the instruction to fight the good fight."
    },
    {
      "id": 79,
      "start": 2133.6400146484375,
      "end": 2137.7200317382812,
      "text": " Notice, it doesn't just say fight."
    },
    {
      "id": 80,
      "start": 2137.7200317382812,
      "end": 2139.3200073242188,
      "text": " I'm thankful for that."
    },
    {
      "id": 81,
      "start": 2139.3200073242188,
      "end": 2144.4200134277344,
      "text": " It says fight the good fight of faith."
    },
    {
      "id": 82,
      "start": 2144.4200134277344,
      "end": 2146.7200317382812,
      "text": " Fight the good fight of faith."
    },
    {
      "id": 83,
      "start": 2146.7200317382812,
      "end": 2153.060028076172,
      "text": " We're not just fighting to fight, but we are to fight the good fight of faith."
    },
    {
      "id": 84,
      "start": 2153.060028076172,
      "end": 2156.3800048828125,
      "text": " We are to earnestly contend for the faith."
    },
    {
      "id": 85,
      "start": 2156.3800048828125,
      "end": 2161.6200256347656,
      "text": " We are to be able to stand and give an answer for why we believe the things that we believe"
    },
    {
      "id": 86,
      "start": 2161.6200256347656,
      "end": 2167.02001953125,
      "text": " and understanding that God has given us the word of God."
    },
    {
      "id": 87,
      "start": 2167.02001953125,
      "end": 2172.9000244140625,
      "text": " And here, Paul says, of course, you know that there have been many references already in"
    },
    {
      "id": 88,
      "start": 2172.9000244140625,
      "end": 2177.300018310547,
      "text": " this book with regard to the false teachers that are at Ephesus and their activity and"
    },
    {
      "id": 89,
      "start": 2177.300018310547,
      "end": 2185.6600341796875,
      "text": " all that's taking place, and so now Paul says to Timothy, fight the good fight of faith."
    },
    {
      "id": 90,
      "start": 2185.6600341796875,
      "end": 2190.9000244140625,
      "text": " It's often been said, it's a battleground, not a playground."
    },
    {
      "id": 91,
      "start": 2190.9000244140625,
      "end": 2193.1400146484375,
      "text": " It's a battleground, not a playground."
    },
    {
      "id": 92,
      "start": 2193.1400146484375,
      "end": 2199.260009765625,
      "text": " I think Tozer was the first one that coined that phrase, at least as best I can tell,"
    },
    {
      "id": 93,
      "start": 2199.260009765625,
      "end": 2205.300018310547,
      "text": " and many after that have repeated that phrase and how appropriate it is."
    },
    {
      "id": 94,
      "start": 2205.300018310547,
      "end": 2209.540008544922,
      "text": " We won't take the time this morning, but if you look at Ephesians chapter 6 and look"
    },
    {
      "id": 95,
      "start": 2209.540008544922,
      "end": 2216.02001953125,
      "text": " at verses 10 through 17, you can see the detail with regard to the fight, the battle, the"
    },
    {
      "id": 96,
      "start": 2216.02001953125,
      "end": 2219.1800231933594,
      "text": " spiritual battle that we're engaged in."
    },
    {
      "id": 97,
      "start": 2219.1800231933594,
      "end": 2222.780029296875,
      "text": " It's a battleground, not a playground."
    },
    {
      "id": 98,
      "start": 2222.780029296875,
      "end": 2227.500030517578,
      "text": " Therefore, Paul is instructing Timothy to fight the good fight of faith."
    },
    {
      "id": 99,
      "start": 2227.500030517578,
      "end": 2232.2200317382812,
      "text": " It's interesting to me that in the next letter that we'll begin studying here in a few weeks"
    },
    {
      "id": 100,
      "start": 2232.2200317382812,
      "end": 2239.1800231933594,
      "text": " on Sunday mornings that Paul says to Timothy in 2 Timothy chapter number 2, he tells him,"
    },
    {
      "id": 101,
      "start": 2239.1800231933594,
      "end": 2244.540008544922,
      "text": " Thou therefore, my son, be strong in the grace that is in Christ Jesus and the things that"
    },
    {
      "id": 102,
      "start": 2244.540008544922,
      "end": 2246.780029296875,
      "text": " thou hast heard of me among many witnesses."
    },
    {
      "id": 103,
      "start": 2246.780029296875,
      "end": 2250.9400329589844,
      "text": " The same commit thou to faithful men who shall be able to teach others also."
    },
    {
      "id": 104,
      "start": 2250.9400329589844,
      "end": 2257.7000122070312,
      "text": " Thou therefore endure hardness as a good soldier of Jesus Christ."
    },
    {
      "id": 105,
      "start": 2257.7000122070312,
      "end": 2262.8600158691406,
      "text": " O man, that warreth and tangleth himself with the affairs of this life, that he may"
    },
    {
      "id": 106,
      "start": 2262.8600158691406,
      "end": 2267.260009765625,
      "text": " please him who hath chosen him to be a soldier."
    },
    {
      "id": 107,
      "start": 2267.260009765625,
      "end": 2271.6200256347656,
      "text": " Those verses of Scripture go perfect with what we're looking at in 1 Timothy 6 verses"
    },
    {
      "id": 108,
      "start": 2271.6200256347656,
      "end": 2273.1000061035156,
      "text": " 11 and 12."
    },
    {
      "id": 109,
      "start": 2273.1000061035156,
      "end": 2278.500030517578,
      "text": " The one that's warring, the good soldier that's going to endure hardness, he's not going to"
    },
    {
      "id": 110,
      "start": 2278.500030517578,
      "end": 2283.8200073242188,
      "text": " entangle himself with the things, the affairs of this world, verses 9 and 10 in 1 Timothy"
    },
    {
      "id": 111,
      "start": 2283.8200073242188,
      "end": 2289.300018310547,
      "text": " chapter 6, but he's going to seek after, he's going to follow after why that he might"
    },
    {
      "id": 112,
      "start": 2289.300018310547,
      "end": 2294.02001953125,
      "text": " please him who hath chosen him to be a soldier."
    },
    {
      "id": 113,
      "start": 2294.02001953125,
      "end": 2302.6400146484375,
      "text": " And oh, as we look here at this truth of the battleground that we're engaged in, this battle"
    },
    {
      "id": 114,
      "start": 2302.6400146484375,
      "end": 2305.540008544922,
      "text": " that's raging all around us."
    },
    {
      "id": 115,
      "start": 2305.540008544922,
      "end": 2313.5400390625,
      "text": " Many today have tried to use various terms to describe the battle."
    },
    {
      "id": 116,
      "start": 2313.5400390625,
      "end": 2318.2200317382812,
      "text": " Cultural wars, social wars, you name whatever it might be, political wars."
    },
    {
      "id": 117,
      "start": 2318.2200317382812,
      "end": 2322.02001953125,
      "text": " I want you to understand it's spiritual war."
    },
    {
      "id": 118,
      "start": 2322.02001953125,
      "end": 2324.02001953125,
      "text": " It is spiritual war."
    },
    {
      "id": 119,
      "start": 2324.02001953125,
      "end": 2326.8200073242188,
      "text": " And we're engaged in spiritual warfare."
    },
    {
      "id": 120,
      "start": 2326.8200073242188,
      "end": 2331.6199951171875,
      "text": " I'm thankful that Paul, as he's writing to the church in Corinth, that our weapons are"
    },
    {
      "id": 121,
      "start": 2331.6199951171875,
      "end": 2332.6199951171875,
      "text": " not carnal."
    },
    {
      "id": 122,
      "start": 2333.6199951171875,
      "end": 2336.1400146484375,
      "text": " No, they're spiritual."
    },
    {
      "id": 123,
      "start": 2336.1400146484375,
      "end": 2341.9800415039062,
      "text": " Can I tell you that we must recognize that we're fighting a spiritual battle."
    },
    {
      "id": 124,
      "start": 2341.9800415039062,
      "end": 2346.02001953125,
      "text": " We wrestle not against flesh and blood, according to Ephesians 6."
    },
    {
      "id": 125,
      "start": 2346.02001953125,
      "end": 2349.9000244140625,
      "text": " We wrestle against spiritual wickedness in high places."
    },
    {
      "id": 126,
      "start": 2349.9000244140625,
      "end": 2354.4600219726562,
      "text": " And can I tell you this morning, every day of your life you better put on the whole armor"
    },
    {
      "id": 127,
      "start": 2354.4600219726562,
      "end": 2358.52001953125,
      "text": " of God because there's not a day off in this battle."
    },
    {
      "id": 128,
      "start": 2358.52001953125,
      "end": 2360.9800415039062,
      "text": " There's not a day off in this battle."
    },
    {
      "id": 129,
      "start": 2360.9800415039062,
      "end": 2366.5,
      "text": " And the day that you think that there's a day off is the day that the enemy will fire"
    },
    {
      "id": 130,
      "start": 2366.5,
      "end": 2371.1400146484375,
      "text": " as many fiery darts at you as he possibly can fire."
    },
    {
      "id": 131,
      "start": 2371.1400146484375,
      "end": 2375.1400146484375,
      "text": " You say, oh, I wish I had the shield of faith that can quench all the fiery darts."
    },
    {
      "id": 132,
      "start": 2375.1400146484375,
      "end": 2378.8600463867188,
      "text": " No, I went out without the armor on."
    },
    {
      "id": 133,
      "start": 2378.8600463867188,
      "end": 2380.739990234375,
      "text": " Put on the whole armor of God."
    },
    {
      "id": 134,
      "start": 2380.739990234375,
      "end": 2384.02001953125,
      "text": " Be strong in the Lord and the power of His might."
    },
    {
      "id": 135,
      "start": 2384.02001953125,
      "end": 2386.02001953125,
      "text": " It's a battleground."
    },
    {
      "id": 136,
      "start": 2386.02001953125,
      "end": 2391.1400146484375,
      "text": " Notice in verse number 12 of 1 Timothy 6, he says, fight the good fight of faith."
    },
    {
      "id": 137,
      "start": 2391.1400146484375,
      "end": 2397.2200317382812,
      "text": " But then he gives this following truth that's so important for us to understand."
    },
    {
      "id": 138,
      "start": 2397.2200317382812,
      "end": 2399.4600219726562,
      "text": " He says, lay hold."
    },
    {
      "id": 0,
      "start": 2399.4600219726562,
      "end": 2404.4600219726562,
      "text": " on eternal life, whereunto thou art also called"
    },
    {
      "id": 1,
      "start": 2404.560021877289,
      "end": 2408.0400218963623,
      "text": " and hast professed a good profession before many witnesses."
    },
    {
      "id": 2,
      "start": 2408.0400218963623,
      "end": 2410.5000219345093,
      "text": " This phraseology of lay hold on eternal life,"
    },
    {
      "id": 3,
      "start": 2410.5000219345093,
      "end": 2412.98002243042,
      "text": " it's not the idea of getting saved,"
    },
    {
      "id": 4,
      "start": 2412.98002243042,
      "end": 2415.6000213623047,
      "text": " it's the idea that because you are saved,"
    },
    {
      "id": 5,
      "start": 2415.6000213623047,
      "end": 2420.6000213623047,
      "text": " you are a possessor of eternal life, now live like it."
    },
    {
      "id": 6,
      "start": 2421.920021057129,
      "end": 2423.5800228118896,
      "text": " Lay hold on eternal life."
    },
    {
      "id": 7,
      "start": 2423.5800228118896,
      "end": 2426.720022201538,
      "text": " Listen, we are more than conquerors through him."
    },
    {
      "id": 8,
      "start": 2426.720022201538,
      "end": 2429.900022506714,
      "text": " We are, as the song says, and Curtis Hudson"
    },
    {
      "id": 9,
      "start": 2429.900022506714,
      "end": 2433.1200218200684,
      "text": " used to sing it so often, we are on the winning side."
    },
    {
      "id": 10,
      "start": 2433.98002243042,
      "end": 2438.8400230407715,
      "text": " And the reality is that we sing the song victory in Jesus,"
    },
    {
      "id": 11,
      "start": 2438.8400230407715,
      "end": 2441.040023803711,
      "text": " but thanks be to God, 1 Corinthians 15,"
    },
    {
      "id": 12,
      "start": 2441.040023803711,
      "end": 2445.5200233459473,
      "text": " which giveth us the victory through our Lord Jesus Christ."
    },
    {
      "id": 13,
      "start": 2445.5200233459473,
      "end": 2447.4400215148926,
      "text": " 1 Corinthians 15 and verse 57."
    },
    {
      "id": 14,
      "start": 2448.800022125244,
      "end": 2451.040023803711,
      "text": " This morning he says lay hold on eternal life."
    },
    {
      "id": 15,
      "start": 2451.040023803711,
      "end": 2453.9600219726562,
      "text": " It's not get saved, it's the fact that you are saved."
    },
    {
      "id": 16,
      "start": 2453.9600219726562,
      "end": 2458.200023651123,
      "text": " We are a possessor of eternal life."
    },
    {
      "id": 17,
      "start": 2458.200023651123,
      "end": 2460.0000228881836,
      "text": " As a possessor of eternal life,"
    },
    {
      "id": 18,
      "start": 2460.0000228881836,
      "end": 2464.200019836426,
      "text": " we need to live our lives in that fashion."
    },
    {
      "id": 19,
      "start": 2464.200019836426,
      "end": 2465.640022277832,
      "text": " I'm saved, I'm a child of God."
    },
    {
      "id": 20,
      "start": 2465.640022277832,
      "end": 2470.140022277832,
      "text": " I live different than I used to live."
    },
    {
      "id": 21,
      "start": 2470.140022277832,
      "end": 2472.200019836426,
      "text": " I know for many of us here this morning,"
    },
    {
      "id": 22,
      "start": 2473.2800216674805,
      "end": 2476.0800247192383,
      "text": " we can remember how we lived before we got saved."
    },
    {
      "id": 23,
      "start": 2477.260025024414,
      "end": 2479.5600204467773,
      "text": " I can remember how I lived before I got saved."
    },
    {
      "id": 24,
      "start": 2480.7200241088867,
      "end": 2483.0800247192383,
      "text": " And I think if you'd be honest this morning,"
    },
    {
      "id": 25,
      "start": 2483.0800247192383,
      "end": 2485.320022583008,
      "text": " if you got saved, if you were old enough"
    },
    {
      "id": 26,
      "start": 2485.320022583008,
      "end": 2489.040023803711,
      "text": " when you got saved to have lived a certain way"
    },
    {
      "id": 27,
      "start": 2489.040023803711,
      "end": 2492.7200241088867,
      "text": " and can recall that, there should be a contrast,"
    },
    {
      "id": 28,
      "start": 2492.7200241088867,
      "end": 2496.760025024414,
      "text": " a difference in your life as a believer,"
    },
    {
      "id": 29,
      "start": 2496.760025024414,
      "end": 2500.640022277832,
      "text": " as a possessor of eternal life."
    },
    {
      "id": 30,
      "start": 2500.640022277832,
      "end": 2503.5600204467773,
      "text": " I'm so thankful that I'm going to heaven one day,"
    },
    {
      "id": 31,
      "start": 2503.5600204467773,
      "end": 2507.44002532959,
      "text": " but we need to live like we're possessors of eternal life."
    },
    {
      "id": 32,
      "start": 2507.44002532959,
      "end": 2509.420021057129,
      "text": " It's interesting that then Paul says this,"
    },
    {
      "id": 33,
      "start": 2509.420021057129,
      "end": 2511.4000244140625,
      "text": " lay hold on eternal life."
    },
    {
      "id": 34,
      "start": 2511.4000244140625,
      "end": 2512.240020751953,
      "text": " Then he says this,"
    },
    {
      "id": 35,
      "start": 2512.240020751953,
      "end": 2514.760025024414,
      "text": " were unto thou art also called"
    },
    {
      "id": 36,
      "start": 2514.760025024414,
      "end": 2519.760025024414,
      "text": " and hast professed a good profession before many witnesses."
    },
    {
      "id": 37,
      "start": 2519.9600219726562,
      "end": 2521.800018310547,
      "text": " Now, I love the end of verse number 12"
    },
    {
      "id": 38,
      "start": 2521.800018310547,
      "end": 2523.52001953125,
      "text": " because what Paul is saying to Timothy"
    },
    {
      "id": 39,
      "start": 2523.52001953125,
      "end": 2524.52001953125,
      "text": " at the end of verse number 12,"
    },
    {
      "id": 40,
      "start": 2524.52001953125,
      "end": 2527.1200256347656,
      "text": " he's really referring to the testimony of Timothy."
    },
    {
      "id": 41,
      "start": 2527.1200256347656,
      "end": 2528.320022583008,
      "text": " He's saying to Timothy,"
    },
    {
      "id": 42,
      "start": 2528.320022583008,
      "end": 2532.52001953125,
      "text": " you have professed a good profession before many witnesses."
    },
    {
      "id": 43,
      "start": 2532.52001953125,
      "end": 2534.280029296875,
      "text": " You have lived a life."
    },
    {
      "id": 44,
      "start": 2534.280029296875,
      "end": 2537.540023803711,
      "text": " You have passed a test, so to speak."
    },
    {
      "id": 45,
      "start": 2537.540023803711,
      "end": 2540.6800231933594,
      "text": " Your testimony is known."
    },
    {
      "id": 46,
      "start": 2540.6800231933594,
      "end": 2541.6000213623047,
      "text": " But can I tell you this?"
    },
    {
      "id": 47,
      "start": 2541.6000213623047,
      "end": 2543.8400268554688,
      "text": " We can't live in the past."
    },
    {
      "id": 48,
      "start": 2543.8400268554688,
      "end": 2545.320022583008,
      "text": " We can't live in the past."
    },
    {
      "id": 49,
      "start": 2545.320022583008,
      "end": 2548.0800170898438,
      "text": " Timothy, you have, he says this,"
    },
    {
      "id": 50,
      "start": 2548.0800170898438,
      "end": 2553.0800170898438,
      "text": " thou hast professed a good profession before many witnesses."
    },
    {
      "id": 51,
      "start": 2553.240020751953,
      "end": 2556.560028076172,
      "text": " I wish I could have had the time to deal with the entirety"
    },
    {
      "id": 52,
      "start": 2556.560028076172,
      "end": 2558.560028076172,
      "text": " of this passage of scripture in one week."
    },
    {
      "id": 53,
      "start": 2558.560028076172,
      "end": 2560.2000274658203,
      "text": " So I hope you come back next week"
    },
    {
      "id": 54,
      "start": 2560.2000274658203,
      "end": 2562.1200256347656,
      "text": " so that you can find the followup to this."
    },
    {
      "id": 55,
      "start": 2562.1200256347656,
      "end": 2565.220016479492,
      "text": " He says, I give thee charge in the sight of God,"
    },
    {
      "id": 56,
      "start": 2565.220016479492,
      "end": 2566.6800231933594,
      "text": " according to verse number 13."
    },
    {
      "id": 57,
      "start": 2566.6800231933594,
      "end": 2568.320022583008,
      "text": " And we find that he tells him"
    },
    {
      "id": 58,
      "start": 2568.320022583008,
      "end": 2570.280029296875,
      "text": " that he's to keep on doing these things"
    },
    {
      "id": 59,
      "start": 2570.9200286865234,
      "end": 2573.1600189208984,
      "text": " until the appearing of our Lord Jesus Christ."
    },
    {
      "id": 60,
      "start": 2573.1600189208984,
      "end": 2574.52001953125,
      "text": " See, it's great, Timothy,"
    },
    {
      "id": 61,
      "start": 2574.52001953125,
      "end": 2578.040023803711,
      "text": " that you have this good profession before many witnesses,"
    },
    {
      "id": 62,
      "start": 2578.040023803711,
      "end": 2579.760025024414,
      "text": " but don't stop."
    },
    {
      "id": 63,
      "start": 2580.6400146484375,
      "end": 2584.2000274658203,
      "text": " Understanding that your testimony continues to be important"
    },
    {
      "id": 64,
      "start": 2584.2000274658203,
      "end": 2587.6800231933594,
      "text": " and you must continue to profess this good profession"
    },
    {
      "id": 65,
      "start": 2587.6800231933594,
      "end": 2590.4400177001953,
      "text": " before those that you come in contact with."
    },
    {
      "id": 66,
      "start": 2591.3600158691406,
      "end": 2594.4400177001953,
      "text": " You know, there's some people, Obadiah,"
    },
    {
      "id": 67,
      "start": 2594.4400177001953,
      "end": 2596.480026245117,
      "text": " if you remember, not the prophet Obadiah,"
    },
    {
      "id": 68,
      "start": 2596.480026245117,
      "end": 2599.240020751953,
      "text": " but the one that was working with Ahab"
    },
    {
      "id": 69,
      "start": 2599.240020751953,
      "end": 2600.8800201416016,
      "text": " when Elijah was on the run."
    },
    {
      "id": 70,
      "start": 2600.8800201416016,
      "end": 2602.6800231933594,
      "text": " Remember, God hid Elijah."
    },
    {
      "id": 71,
      "start": 2602.6800231933594,
      "end": 2605.1600189208984,
      "text": " And he says, well, do you know what I've done?"
    },
    {
      "id": 72,
      "start": 2605.1600189208984,
      "end": 2606.4400177001953,
      "text": " Do you know how many I hid?"
    },
    {
      "id": 73,
      "start": 2606.4400177001953,
      "end": 2607.740020751953,
      "text": " Do you know how I?"
    },
    {
      "id": 74,
      "start": 2607.740020751953,
      "end": 2610.4200286865234,
      "text": " Listen, sometimes we can live in the past."
    },
    {
      "id": 75,
      "start": 2610.4200286865234,
      "end": 2611.6400146484375,
      "text": " Let me tell you what I used to do."
    },
    {
      "id": 76,
      "start": 2611.6400146484375,
      "end": 2612.740020751953,
      "text": " Let me tell you how I used to."
    },
    {
      "id": 77,
      "start": 2612.740020751953,
      "end": 2615.0800170898438,
      "text": " No, we need to live in the present."
    },
    {
      "id": 78,
      "start": 2615.9200286865234,
      "end": 2619.040023803711,
      "text": " Notice the testimony of this man, Timothy."
    },
    {
      "id": 79,
      "start": 2619.040023803711,
      "end": 2622.560028076172,
      "text": " Paul says you have, at the end of verse number 12,"
    },
    {
      "id": 80,
      "start": 2622.560028076172,
      "end": 2625.52001953125,
      "text": " and hast professed a good profession before many witnesses."
    },
    {
      "id": 81,
      "start": 2625.52001953125,
      "end": 2629.0800170898438,
      "text": " Notice in 1 Corinthians chapter four,"
    },
    {
      "id": 82,
      "start": 2629.9200286865234,
      "end": 2631.1200256347656,
      "text": " I'm gonna look at just a couple of verses quickly"
    },
    {
      "id": 83,
      "start": 2631.1200256347656,
      "end": 2633.6000213623047,
      "text": " to look at the testimony of Timothy."
    },
    {
      "id": 84,
      "start": 2633.6000213623047,
      "end": 2638.560028076172,
      "text": " In 1 Corinthians chapter four, in verse number 17,"
    },
    {
      "id": 85,
      "start": 2638.560028076172,
      "end": 2640.6400146484375,
      "text": " Paul is writing to the church in Corinth,"
    },
    {
      "id": 86,
      "start": 2640.6400146484375,
      "end": 2642.000015258789,
      "text": " and here's what he says."
    },
    {
      "id": 87,
      "start": 2644.6000213623047,
      "end": 2648.8400268554688,
      "text": " For this cause have I sent unto you Timotheus,"
    },
    {
      "id": 88,
      "start": 2648.8400268554688,
      "end": 2652.9600219726562,
      "text": " who is my beloved son and faithful in the Lord,"
    },
    {
      "id": 89,
      "start": 2652.9600219726562,
      "end": 2655.9200134277344,
      "text": " who shall bring you into remembrance of my ways,"
    },
    {
      "id": 90,
      "start": 2655.9200134277344,
      "end": 2659.560028076172,
      "text": " which be in Christ as I teach everywhere in every church."
    },
    {
      "id": 91,
      "start": 2659.560028076172,
      "end": 2662.8600158691406,
      "text": " So Paul is saying I'm sending, I have sent Timothy to you,"
    },
    {
      "id": 92,
      "start": 2662.8600158691406,
      "end": 2665.3200073242188,
      "text": " and here's the testimony of Timothy."
    },
    {
      "id": 93,
      "start": 2665.3200073242188,
      "end": 2669.1200256347656,
      "text": " He is my beloved son, he is faithful in the Lord,"
    },
    {
      "id": 94,
      "start": 2669.1200256347656,
      "end": 2671.760009765625,
      "text": " and he's going to be able to bring you in remembrance"
    },
    {
      "id": 95,
      "start": 2671.760009765625,
      "end": 2673.7200317382812,
      "text": " of the things that I taught."
    },
    {
      "id": 96,
      "start": 2673.7200317382812,
      "end": 2677.1000366210938,
      "text": " Wow, that's why Paul said I can send Timothy to Corinth."
    },
    {
      "id": 97,
      "start": 2677.1000366210938,
      "end": 2679.52001953125,
      "text": " Notice in Philippians chapter number two,"
    },
    {
      "id": 98,
      "start": 2679.52001953125,
      "end": 2682.4000244140625,
      "text": " Paul sends Timothy to the church in Philippi,"
    },
    {
      "id": 99,
      "start": 2682.4000244140625,
      "end": 2684.300018310547,
      "text": " and we find that as Paul would give"
    },
    {
      "id": 100,
      "start": 2684.300018310547,
      "end": 2685.9400329589844,
      "text": " in Philippians chapter number two,"
    },
    {
      "id": 101,
      "start": 2685.9400329589844,
      "end": 2689.4200134277344,
      "text": " some of the reason that Timothy was being sent,"
    },
    {
      "id": 102,
      "start": 2689.4200134277344,
      "end": 2692.540008544922,
      "text": " it helps us to understand this profession"
    },
    {
      "id": 103,
      "start": 2692.540008544922,
      "end": 2696.9400329589844,
      "text": " that he had Timothy before many witnesses."
    },
    {
      "id": 104,
      "start": 2696.9400329589844,
      "end": 2699.9000244140625,
      "text": " In Philippians chapter two, in verse 19,"
    },
    {
      "id": 105,
      "start": 2699.9000244140625,
      "end": 2702.1800231933594,
      "text": " Paul says, but I trust in the Lord Jesus"
    },
    {
      "id": 106,
      "start": 2702.1800231933594,
      "end": 2704.4600219726562,
      "text": " to send Timotheus shortly unto you,"
    },
    {
      "id": 107,
      "start": 2704.4600219726562,
      "end": 2707.780029296875,
      "text": " that I also may be of good comfort when I know your state."
    },
    {
      "id": 108,
      "start": 2707.780029296875,
      "end": 2712.1000366210938,
      "text": " Notice what he says, he says, for I have no man like-minded"
    },
    {
      "id": 109,
      "start": 2712.1000366210938,
      "end": 2716.3800354003906,
      "text": " who will naturally care for your state."
    },
    {
      "id": 110,
      "start": 2716.3800354003906,
      "end": 2719.000030517578,
      "text": " For all seek their own, not the things"
    },
    {
      "id": 111,
      "start": 2719.000030517578,
      "end": 2722.780029296875,
      "text": " which are Jesus Christ, but ye know the proof of him."
    },
    {
      "id": 112,
      "start": 2722.780029296875,
      "end": 2723.6200256347656,
      "text": " Who's him?"
    },
    {
      "id": 113,
      "start": 2723.6200256347656,
      "end": 2725.540008544922,
      "text": " Well, that's Timothy, go back to verse 19."
    },
    {
      "id": 114,
      "start": 2725.540008544922,
      "end": 2727.02001953125,
      "text": " He says, you know the proof of him"
    },
    {
      "id": 115,
      "start": 2727.02001953125,
      "end": 2728.4200134277344,
      "text": " that as a son with the father,"
    },
    {
      "id": 116,
      "start": 2728.4200134277344,
      "end": 2731.9200134277344,
      "text": " he hath served me in the gospel."
    },
    {
      "id": 117,
      "start": 2731.9200134277344,
      "end": 2733.8200073242188,
      "text": " He said, I have no one else to send,"
    },
    {
      "id": 118,
      "start": 2733.8200073242188,
      "end": 2736.02001953125,
      "text": " but I have Timothy to send."
    },
    {
      "id": 119,
      "start": 2736.02001953125,
      "end": 2739.6600341796875,
      "text": " And Paul, he desires to send Timothy,"
    },
    {
      "id": 120,
      "start": 2739.7000122070312,
      "end": 2743.4200134277344,
      "text": " he has this longing to be able to send Timothy, why?"
    },
    {
      "id": 121,
      "start": 2743.4200134277344,
      "end": 2748.060028076172,
      "text": " Because Timothy had a testimony that was God-honoring."
    },
    {
      "id": 122,
      "start": 2748.060028076172,
      "end": 2750.8600158691406,
      "text": " We read in 1 Thessalonians chapter number three,"
    },
    {
      "id": 123,
      "start": 2752.800018310547,
      "end": 2755.300018310547,
      "text": " this truth with regard to Timothy"
    },
    {
      "id": 124,
      "start": 2755.300018310547,
      "end": 2757.980010986328,
      "text": " being sent to the church in Thessalonica."
    },
    {
      "id": 125,
      "start": 2757.980010986328,
      "end": 2760.5800170898438,
      "text": " Why is it that Paul would send Timothy"
    },
    {
      "id": 126,
      "start": 2760.5800170898438,
      "end": 2761.780029296875,
      "text": " to the church in Thessalonica?"
    },
    {
      "id": 127,
      "start": 2761.780029296875,
      "end": 2764.1400146484375,
      "text": " Well, the same reason he would send him to Corinth"
    },
    {
      "id": 128,
      "start": 2764.1400146484375,
      "end": 2766.2200317382812,
      "text": " and the same reason he'd send him to Philippi,"
    },
    {
      "id": 129,
      "start": 2766.2200317382812,
      "end": 2768.1800231933594,
      "text": " because he was faithful."
    },
    {
      "id": 130,
      "start": 2768.1800231933594,
      "end": 2770.3800354003906,
      "text": " 1 Thessalonians three, it says in verse number one,"
    },
    {
      "id": 131,
      "start": 2770.3800354003906,
      "end": 2773.3800354003906,
      "text": " wherefore, when we could no longer forbear,"
    },
    {
      "id": 132,
      "start": 2773.3800354003906,
      "end": 2775.740020751953,
      "text": " we thought it good to be left at Athens alone"
    },
    {
      "id": 133,
      "start": 2775.740020751953,
      "end": 2780.02001953125,
      "text": " and sent Timotheus, our brother and minister of God"
    },
    {
      "id": 134,
      "start": 2780.02001953125,
      "end": 2782.6600341796875,
      "text": " and our fellow labor in the gospel of Christ"
    },
    {
      "id": 135,
      "start": 2782.6600341796875,
      "end": 2787.6600341796875,
      "text": " to establish you and to comfort you concerning your faith."
    },
    {
      "id": 136,
      "start": 2789.4000244140625,
      "end": 2794.060028076172,
      "text": " Timothy, he had lived a life"
    },
    {
      "id": 137,
      "start": 2794.060028076172,
      "end": 2795.4600219726562,
      "text": " that was honoring to the Lord."
    },
    {
      "id": 138,
      "start": 2795.52001953125,
      "end": 2797.480010986328,
      "text": " He's referred to in verse number 11,"
    },
    {
      "id": 139,
      "start": 2797.480010986328,
      "end": 2800.6800231933594,
      "text": " O thou man of God."
    },
    {
      "id": 140,
      "start": 2800.6800231933594,
      "end": 2803.800018310547,
      "text": " But Timothy, don't live in the past."
    },
    {
      "id": 141,
      "start": 2803.800018310547,
      "end": 2807.2200317382812,
      "text": " You know, sometimes it's easy for us to live in the past."
    },
    {
      "id": 142,
      "start": 2807.2200317382812,
      "end": 2809.2000122070312,
      "text": " Sometimes it will be referred to this way"
    },
    {
      "id": 143,
      "start": 2809.2000122070312,
      "end": 2810.760009765625,
      "text": " as a group of people get together"
    },
    {
      "id": 144,
      "start": 2810.760009765625,
      "end": 2813.9600219726562,
      "text": " and they talk about the good old days."
    },
    {
      "id": 145,
      "start": 2813.9600219726562,
      "end": 2816.280029296875,
      "text": " You ever hear people use that terminology?"
    },
    {
      "id": 146,
      "start": 2816.280029296875,
      "end": 2817.2000122070312,
      "text": " And they're reminiscing"
    },
    {
      "id": 147,
      "start": 2817.2000122070312,
      "end": 2819.500030517578,
      "text": " and they're talking about the good old days."
    },
    {
      "id": 148,
      "start": 2819.500030517578,
      "end": 2823.6800231933594,
      "text": " But I want you to understand that we have the present"
    },
    {
      "id": 149,
      "start": 2823.6800231933594,
      "end": 2827.1200256347656,
      "text": " and we must live in the present"
    },
    {
      "id": 150,
      "start": 2827.1200256347656,
      "end": 2829.500030517578,
      "text": " as possessors of eternal life."
    },
    {
      "id": 151,
      "start": 2829.500030517578,
      "end": 2831.2200317382812,
      "text": " And we must live in the present,"
    },
    {
      "id": 152,
      "start": 2831.2200317382812,
      "end": 2836.2200317382812,
      "text": " fleeing those things and following after these things"
    },
    {
      "id": 153,
      "start": 2836.3400268554688,
      "end": 2838.4600219726562,
      "text": " and understanding that God says"
    },
    {
      "id": 154,
      "start": 2838.4600219726562,
      "end": 2840.7000122070312,
      "text": " to fight the good fight of faith."
    },
    {
      "id": 155,
      "start": 2840.7000122070312,
      "end": 2844.1800231933594,
      "text": " It is an active, listen, in each of these instances,"
    },
    {
      "id": 156,
      "start": 2844.1800231933594,
      "end": 2846.4200134277344,
      "text": " there is instruction that is given."
    },
    {
      "id": 157,
      "start": 2846.4200134277344,
      "end": 2849.1400146484375,
      "text": " There is a decision that has to be made."
    },
    {
      "id": 158,
      "start": 2849.1400146484375,
      "end": 2851.4200134277344,
      "text": " And it's in the present that you're going to flee."
    },
    {
      "id": 159,
      "start": 2851.4200134277344,
      "end": 2852.52001953125,
      "text": " You're going to follow."
    },
    {
      "id": 160,
      "start": 2852.52001953125,
      "end": 2854.060028076172,
      "text": " You're going to fight."
    },
    {
      "id": 161,
      "start": 2855.7200317382812,
      "end": 2860.4400329589844,
      "text": " This morning, Paul, we know, fought the good fight."
    },
    {
      "id": 162,
      "start": 2860.4400329589844,
      "end": 2864.1600341796875,
      "text": " He's able to say at the end of 2 Timothy chapter number four"
    },
    {
      "id": 163,
      "start": 2864.1600341796875,
      "end": 2867.000030517578,
      "text": " about the fact that he had finished."
    },
    {
      "id": 164,
      "start": 2867.000030517578,
      "end": 2869.560028076172,
      "text": " He says in verse number seven, I have fought a good fight."
    },
    {
      "id": 165,
      "start": 2869.560028076172,
      "end": 2871.3200073242188,
      "text": " I have finished my course."
    },
    {
      "id": 166,
      "start": 2871.3200073242188,
      "end": 2873.4000244140625,
      "text": " I have kept the faith."
    },
    {
      "id": 167,
      "start": 2873.4000244140625,
      "end": 2876.52001953125,
      "text": " You know what I believe Paul's desire was for Timothy?"
    },
    {
      "id": 168,
      "start": 2876.52001953125,
      "end": 2878.6400146484375,
      "text": " Was that Timothy could say the same thing."
    },
    {
      "id": 169,
      "start": 2879.500030517578,
      "end": 2883.1200256347656,
      "text": " That Timothy could say, I have fought a good fight."
    },
    {
      "id": 170,
      "start": 2883.1200256347656,
      "end": 2885.9400329589844,
      "text": " You know what my desire is for my life"
    },
    {
      "id": 171,
      "start": 2885.9400329589844,
      "end": 2889.4600219726562,
      "text": " is that I would be able to say, I have fought a good fight."
    },
    {
      "id": 172,
      "start": 2889.4600219726562,
      "end": 2891.1800231933594,
      "text": " But you know what my desire is for your life"
    },
    {
      "id": 173,
      "start": 2891.1800231933594,
      "end": 2893.6200256347656,
      "text": " is that you too would be able to say,"
    },
    {
      "id": 174,
      "start": 2893.6200256347656,
      "end": 2896.6200256347656,
      "text": " I have fought a good fight."
    },
    {
      "id": 175,
      "start": 2896.6200256347656,
      "end": 2899.3200073242188,
      "text": " That we would live our lives in such a way"
    },
    {
      "id": 176,
      "start": 2899.3200073242188,
      "end": 2902.280029296875,
      "text": " that Christ is exalted and magnified,"
    },
    {
      "id": 177,
      "start": 2902.280029296875,
      "end": 2904.8600158691406,
      "text": " that he alone is pleased."
    },
    {
      "id": 178,
      "start": 2904.8600158691406,
      "end": 2907.740020751953,
      "text": " That we would take the truth of his word,"
    },
    {
      "id": 179,
      "start": 2907.760009765625,
      "end": 2911.1600341796875,
      "text": " apply it in our lives, be doers of the word,"
    },
    {
      "id": 180,
      "start": 2911.1600341796875,
      "end": 2912.8400268554688,
      "text": " and please him."
    },
    {
      "id": 181,
      "start": 2912.8400268554688,
      "end": 2914.9400024414062,
      "text": " So that we would not be ashamed as appearing,"
    },
    {
      "id": 182,
      "start": 2914.9400024414062,
      "end": 2919.9400024414062,
      "text": " no, that we would be able to say, as Paul said,"
    },
    {
      "id": 183,
      "start": 2920.9600219726562,
      "end": 2923.6199951171875,
      "text": " I have fought a good fight."
    },
    {
      "id": 184,
      "start": 2923.6199951171875,
      "end": 2926.0800170898438,
      "text": " I have finished my course."
    },
    {
      "id": 185,
      "start": 2926.0800170898438,
      "end": 2928.4200439453125,
      "text": " I have kept the faith."
    },
    {
      "id": 186,
      "start": 2928.4200439453125,
      "end": 2929.4200439453125,
      "text": " Can I tell you this morning,"
    },
    {
      "id": 187,
      "start": 2929.4200439453125,
      "end": 2931.260009765625,
      "text": " it's not going to happen by accident."
    },
    {
      "id": 188,
      "start": 2932.280029296875,
      "end": 2934.4600219726562,
      "text": " It's not going to happen by chance."
    },
    {
      "id": 189,
      "start": 2934.4600219726562,
      "end": 2937.0400390625,
      "text": " You must actively make some decisions."
    },
    {
      "id": 190,
      "start": 2937.0400390625,
      "end": 2939.4600219726562,
      "text": " You must flee these things."
    },
    {
      "id": 191,
      "start": 2939.4600219726562,
      "end": 2941.3600463867188,
      "text": " You must follow these things,"
    },
    {
      "id": 192,
      "start": 2941.3600463867188,
      "end": 2944.8400268554688,
      "text": " and you must fight the good fight of faith."
    },
    {
      "id": 193,
      "start": 2944.8400268554688,
      "end": 2948.4200439453125,
      "text": " One day, every single one of us are gonna stand before God."
    },
    {
      "id": 194,
      "start": 2949.9800415039062,
      "end": 2953.5,
      "text": " Absolutely, every single one of us gonna stand before God."
    },
    {
      "id": 195,
      "start": 2953.5,
      "end": 2956.0,
      "text": " I've seen people in the store wear a shirt or a hat"
    },
    {
      "id": 196,
      "start": 2956.0,
      "end": 2958.5400390625,
      "text": " that says only God can judge me."
    },
    {
      "id": 197,
      "start": 2958.5400390625,
      "end": 2961.2400512695312,
      "text": " I don't know if you've ever seen someone wearing that."
    },
    {
      "id": 198,
      "start": 2961.2400512695312,
      "end": 2963.0599975585938,
      "text": " But when I see it, it actually breaks my heart"
    },
    {
      "id": 199,
      "start": 2963.0599975585938,
      "end": 2966.2400512695312,
      "text": " because the reality is that God will judge them one day."
    },
    {
      "id": 200,
      "start": 2966.2400512695312,
      "end": 2969.02001953125,
      "text": " God will judge me knowing the terror of the Lord,"
    },
    {
      "id": 201,
      "start": 2969.02001953125,
      "end": 2971.1799926757812,
      "text": " 1 Corinthians, or 2 Corinthians 4."
    },
    {
      "id": 202,
      "start": 2971.1799926757812,
      "end": 2972.9000244140625,
      "text": " We persuade men."
    },
    {
      "id": 203,
      "start": 2972.9000244140625,
      "end": 2975.6199951171875,
      "text": " Listen, we're gonna stand before God."
    },
    {
      "id": 204,
      "start": 2975.6199951171875,
      "end": 2979.6600341796875,
      "text": " And I wonder today, I hope you're saved,"
    },
    {
      "id": 205,
      "start": 2979.6600341796875,
      "end": 2981.7200317382812,
      "text": " but I hope you're living for Christ,"
    },
    {
      "id": 206,
      "start": 2981.7200317382812,
      "end": 2983.4200439453125,
      "text": " making that active decision."
    },
    {
      "id": 207,
      "start": 2983.4200439453125,
      "end": 2985.3200073242188,
      "text": " There's some things I need to flee."
    },
    {
      "id": 208,
      "start": 2985.3200073242188,
      "end": 2987.1400146484375,
      "text": " There's some things I need to follow."
    },
    {
      "id": 209,
      "start": 2987.1400146484375,
      "end": 2987.9800415039062,
      "text": " Why?"
    },
    {
      "id": 210,
      "start": 2987.9800415039062,
      "end": 2989.9600219726562,
      "text": " Because I'm a possessor of eternal life."
    },
    {
      "id": 211,
      "start": 2989.9600219726562,
      "end": 2991.9000244140625,
      "text": " I am saved by the blood of the Lamb."
    },
    {
      "id": 212,
      "start": 2991.9200439453125,
      "end": 2996.5599975585938,
      "text": " I am heaven bound, and I need to live like a Christian."
    },
    {
      "id": 213,
      "start": 2996.5599975585938,
      "end": 2998.8400268554688,
      "text": " Flee, follow, fight."
    },
    {
      "id": 214,
      "start": 2998.8400268554688,
      "end": 2999.6799926757812,
      "text": " Let's pray."
    },
    {
      "id": 0,
      "start": 2999.6799926757812,
      "end": 3004.0399928092957,
      "text": " Father we love you. Thank you for loving us. Thank you for the opportunity to study your"
    },
    {
      "id": 1,
      "start": 3004.0399928092957,
      "end": 3008.2999925613403,
      "text": " word this morning. Thank you for the example, the testimony of Timothy. I pray that you'd"
    },
    {
      "id": 2,
      "start": 3008.2999925613403,
      "end": 3013.279993057251,
      "text": " help us to have a testimony like Timothy. Lord, help us to be able to say, as Paul said"
    },
    {
      "id": 3,
      "start": 3013.279993057251,
      "end": 3018.519992828369,
      "text": " at the end of his life, the time of my departure is at hand. But he said this, I have fought"
    },
    {
      "id": 4,
      "start": 3018.519992828369,
      "end": 3023.1599922180176,
      "text": " a good fight. I finished my course. I have kept the faith. And Lord, I pray that you'd"
    },
    {
      "id": 5,
      "start": 3023.1599922180176,
      "end": 3031.039993286133,
      "text": " help us, as we are challenged with these commands, these instructions this morning,"
    },
    {
      "id": 6,
      "start": 3031.039993286133,
      "end": 3036.8399925231934,
      "text": " to flee, follow, and fight. Lord, help us to be doers of the word. If there's one not"
    },
    {
      "id": 7,
      "start": 3036.8399925231934,
      "end": 3041.639991760254,
      "text": " sure of heaven, God, I pray that the Holy Spirit of God would convict them and convince"
    },
    {
      "id": 8,
      "start": 3041.639991760254,
      "end": 3046.519992828369,
      "text": " them of their need for Christ, that they would not leave here today without knowing for sure"
    },
    {
      "id": 9,
      "start": 3046.519992828369,
      "end": 3051.2399940490723,
      "text": " that heaven is their home. I pray that you do a work in these moments of invitation and"
    },
    {
      "id": 10,
      "start": 3051.2399940490723,
      "end": 3055.1199913024902,
      "text": " we'll thank you for it. In Christ's name we pray. Would you stand with me? Heads are"
    },
    {
      "id": 11,
      "start": 3055.1199913024902,
      "end": 3059.1199913024902,
      "text": " bowed, eyes are closed. Kimberly's going to play quietly on the piano. And as she does,"
    },
    {
      "id": 12,
      "start": 3059.1199913024902,
      "end": 3060.07999420166,
      "text": " the altar is open."
    }
  ],
  "processed_at": "2025-04-15T01:24:43.448660"
}