{
  "video_id": "wb3Da9z0nOk",
  "text": "That blessed my heart and I just want to, glad to have the opportunity to share it with you this evening. Did everyone get a prayer bulletin? If you didn't, please snag one. In the middle, there's a half piece of paper. We'll get to it in just a minute, but I just wanted to let you know it's hiding in there for you. It's a late Christmas present, all right? But I want to open up with just one verse from Genesis, chapter 22, and this is the account of Abraham and Isaac, and they're heading up to Mount Moriah where Isaac is to be offered, but he doesn't know it. And the Bible says in Genesis 22, verse 7, Isaac turns to his father, Abraham, and the Bible says, and Isaac spake unto Abraham, his father, and said, My father, and he said, Where am I, my son? And he said, Behold, the fire and the wood, but where is the lamb for the burnt offering? Let's open in a word of prayer. Dear Heavenly Father, Lord, Lord, it's been a busy week. Lord, there's a lot of things. I know folks may be tired tonight. Our minds may be on a million other things, but Lord, I pray that you would just, Lord, let us put all those things out of our mind, open our ears, open our hearts, and Lord, I pray that the message you would have for us to hear tonight would come through. I pray these things in Jesus' name, amen. Here we have a very familiar account of the sacrifice on Mount Moriah between Abraham and Isaac, and the Old Testament is filled with many different offerings and sacrifices. You can go all the way back to Genesis chapter 4 with Cain and Abel, the very first offering. You know, when Abel brought his offering and God honored it, vice Cain, and you go through Noah, we read in Genesis 8, Noah offered sacrifices to the Lord. In Genesis 8.20, the Bible says, and Noah built an altar unto the Lord, and took of every clean beast and every clean fowl, and offered burnt offerings on the altar. You read about offerings in Job, he offered sacrifices, and Jacob. And it's not until you get to the book of Exodus and Leviticus that God actually lays out specific guidance for the different sacrifices and when and why they were to be offered. And if you're like me, if you're going through your Bible reading and you come to Leviticus, all right, and you're starting to read through all of these different sacrifices and offerings, it's like, oh, this is horrible, right? And you go back, it's like a Burger King menu. You read about national offerings and individual offerings. There's sin offerings, burnt offerings of different types. There's meat offerings, which the word meat in our King James Version means food. And if you look, it's not actual meat, it's bread and grain. And there's drink offerings. There's offerings for different occasions. There's ceremonial offerings at different festivals. If you were to dedicate a house, there was an offering that you would bring or the birth of a child. And if you're like me, it's pretty easy to read over those passages and just to think, well, you know what? That was the Old Testament. That was awesome for them. And there's not really much here for me. As a matter of fact, the Bible says that all of that is in the past. In Luke 16, 16, the Bible says, the law and the prophets were until John. Since that time, the kingdom of God is preached and every man presseth into it. So I know that the law, the ceremonial law doesn't apply to me. So can't I just skip over those passages? I mean, what does it really help me besides knowing that they did them? Well, I was reminded in 2 Timothy 3, 16, the Bible says, all scripture is given by inspiration of God and is profitable for doctrine, for reproof, correction, for instruction in righteousness. Even Leviticus? Yes. How? You may be asking, and that's the point of the short, very short message tonight is when we look back at the sacrifices, we see a beautiful picture. You know, when Christ was on, during his three years, his earthly ministry, he taught. And most of the time when he was teaching, what did he use? Parables, right? Pictures, word pictures, so that you could understand something that you can't see, the kingdom of God, salvation, all right? Being born again, you can't really see that. So he would take things that you could see, all right? So do you understand dirt? You understand what dirt is? All right. Dirt, that is your heart. And he would use a parable to explain something that you couldn't see with your eyes. And here we have, as we look back into the Old Testament, we know that these sacrifices and these offerings from Hebrews chapter 10, verse 1, the Bible says, for the law having a shadow of good things to come and not the very image of the things, all right, can never with these sacrifices which they offered year by year continually make the comers thereunto perfect for then would they not have ceased to be offered. Here the Bible is saying, yeah, look back at all those sacrifices and offerings that they were done. They were just a shadow. They were just a picture. And I realize that we often will understand, especially if you've been in church for a little bit, you'll understand, oh, yeah, you know, they had a sacrifice in that picture of the coming of Jesus Christ to offer himself on the cross to wash away our sins. And it's true. There was a sin offering in the Old Testament, but there were many others. What about all those other ones? Do they mean anything? Was it just something that they did? Well, I would like you to shift your focus now to the New Testament, and I want to talk about some New Testament offerings. In 1 Peter 2, verse 9, the Bible says, but ye, Christians, believers, sons and daughters of God, but ye are a chosen generation, a royal priesthood, a holy nation, a peculiar people that ye should show forth the praises of him who hath called you out of darkness into his marvelous light. And in Revelation 1, verse 5, it says, unto him that loved us and washed us from our sins in his own blood, and hath made us kings and priests unto God and his Father. To him be glory and dominion forever and ever. Amen. What does that mean? Well, when we look back in the Old Testament, there were kings and there were priests, people that were specifically chosen to go into the temple, to stand before God, and to serve the Lord. But here, God is calling us priests. You, if you're sitting here and you know the Lord as your Savior, God is calling you a king and a priest. Why? Well, as a king, we are adopted into the family. We are the sons and the daughters of the king of kings, and we will reign with him. That's not a figure of speech. We literally will reign. You and I are of the kingdom. He calls us kings, and we're priests because, like the Old Testament priests, we have access to God. In the Old Testament times, not everyone had that privilege. It was only a select few who could come before the Lord, who could offer the sacrifices. But today, every one of us can. We have free access to come before the Lord. Additionally, as priests in 1 Peter 2.5, we're commanded to bring sacrifices. In 1 Peter 2.5, the Bible says, \"...Ye also, as lively stones, are built up a spiritual house, a holy priesthood, to offer up spiritual sacrifices acceptable to God by Jesus Christ.\" What are some of the sacrifices today that God wants us to bring to Him? Anyone? Anyone come to mind? What's that? Praise? Yeah. How about our bodies, Romans 12.1? Yeah, our life. In Romans, it says, \"...We teach you, therefore, brethren, by the mercies of God, that you present your bodies a living sacrifice.\" Praise, Hebrews 13.15, \"...By Him, therefore, let us offer the sacrifice of praise to God continually.\" Mercy, in Hebrews 13.16, the next verse, \"...But to do good and to communicate, forget not, for with such sacrifices God is well-pleased.\" It goes on here. So, I see that, I get it. We're called priests because we have access to God. But if I look back in the Old Testament, the priests and all those sacrifices and offerings that they brought, is there a connection between all of those? Is there an actual picture that I can look at and be like, Oh, now I get it. now I understand what God wants to be happening in my life?\" And the answer is yes, and specifically we're going to look at three types of sacrifices, and these are from Exodus 29, and these are the sacrifices that the priests brought for them to be consecrated or set apart for the Lord. These were the sacrifices that the priest had to do in order to come to the point where they were set apart, where they were sanctified and consecrated for the Lord. We, as New Testament priests, can learn by looking back at the Old Testament picture, okay? And what are these three types? There's three groups here. There's actually four sacrifices on the little handout that I gave you, and I'm not going to read through all the verses, but I just want to skim over. In Exodus chapter 29, verses 10 through 14, the Bible talks about a bullock being brought, and this was specifically for a sin offering. In verse 14, the Bible says, \"...but the flesh of the bullock, and his skin, and his dung, shalt thou burn with fire without the camp.\" It is a sin offering, and I have a copy of that, too. I just want to look at this, make sure I'm following along with you guys. The sin offering, picture of salvation, the forgiveness of our sins, that came first. That came first, and if you're curious for more, you can read the first five chapters of Leviticus, and they expound these sacrifices. But that one came first. The second one was the burnt offering, verses 15 through 18, and this was a ram, and it was a burnt offering. That means all of it was burned on the altar. Nothing was left. All of it was burned, and this is a beautiful picture of surrender. All of our hearts offered up to the Lord. And then came, verses 19 through 33, it was a second ram, and also bread, grain. It was the meat offering, which pictured service. They didn't bring all of it, they brought some of it to the Lord, and some of it they enjoyed themselves. And also the peace offering, picturing the beautiful peace of God that we can have with him in fellowship. Where some of it was offered on the altar, and some of it was eaten by the giver. It's a beautiful picture of having supper. Some of it was given to the Lord, and some of it, the offer that the person giving it got to enjoy themselves. It was having supper together. It's a beautiful picture of supplication, having supper, sweet fellowship. That's what it pictured. It was a joyous time, and if you look at Leviticus, the sin offering was mandatory. All of us must come to Christ, we must be saved, that comes first. But the other ones were voluntary. The fellowship, maintaining that fellowship with the Lord, if you look, these were free will offerings, all right? They were given. Well, I'm reminded of Revelation 3.20, talking about supplication. The Bible says Jesus is speaking to the church, to believers, and he's saying, Behold, I stand at the door and knock. If any man hear my voice and open the door, I will come in to him and will sup with him. I want to have supper with you. I want to have fellowship, all right? And that's the point here that God wants us to get to, but there's a problem. Perhaps, I know I've been here, all right? Perhaps you've been here as well, perhaps you're there right now, you're saying, hey, you know, Jeff, I get it, you know, I'm doing these things, I'm sacrificing to the Lord, I'm giving tithes and offerings, I'm, you know, I'm here, it's Wednesday night, I'm here in church, I'm giving my time, all right? And I'm doing all these things, but it seems like I'm not enjoying the peace of God, that sweet fellowship and the blessings. It just seems like something's missing. What's wrong? What am I missing here? And to answer that, I would like you to notice two details of these sacrifices. The first is the order. The first is the order of them. Salvation comes first, and then comes the burnt offering, surrender. You know, when the Bible says, present your bodies a living sacrifice, this is a daily surrender. It's obeying God's Word, it's a humbling of ourselves. Lord, I surrender my will to you. What did Christ say, not my will but thine be done? It's a surrender. And when we humble ourselves, when we surrender our will to Him, there is some beautiful things that happen. In James, the Bible says, but he giveth more grace, wherefore he saith, God resisteth the proud, but giveth grace unto the humble, the person who has surrendered themselves to the Lord. Lord, I'm not holding anything back. I want your will to be done. In James 4.10, humble yourselves in the sight of the Lord, and He shall lift you up. What comes after salvation? There's a surrender. There's a surrendering of our will. There's a humbling of ourselves. And then comes service. Then comes the meat offering, all right? Then comes us doing things. You know, service, while we still have unsurrendered areas or sins in our life, will certainly lead to frustration at a minimum. And if we're not careful, it can quickly lead to a bitter, unfruitful life. God, look at what I'm doing for you. Why aren't you blessing me? Bible warns us about this in Hebrews 12. It says, looking diligently, lest any man fail of the grace of God, lest any root of bitterness springing up trouble you. I've kind of summed it up this way. Works without a walk leads to weariness. It's having the wrong order of the sacrifices. It's trying to skip the burnt offering and going straight to the meat offering and wondering why we don't have the peace of God in our life. It is the order here. But I want you to notice a second detail of the sacrifices. And I was struggling to find another O word, so I used operation, all right? But when that offering was brought to the Lord, when the sacrifice was put on the altar, how was it offered up to God? Did they wave their hands in the air and voila, it was offered to the Lord? What's that? It was burned. It was burned. In Exodus 29 18, now shalt burn the whole ram upon the altar. Okay, it is a burnt offering. The part that was offered up to God was burned and it was offered up to him in the smoke. What is that a picture of? Deuteronomy 4 24, the Bible says, for the Lord thy God is a consuming fire, even a jealous God. Hmm. In Song of Solomon 8 6, set me as a seal upon thine heart, as a seal upon thine arm. For love is strong as death. Jealousy is cruel as the grave. The coals thereof are coals of fire, which hath a most vehement flame. Many waters cannot quench love, neither can the floods drown it. What is the Old Testament fire a picture of? If we're to offer spiritual sacrifices today, what is spiritual fire? It's love. Putting this together physically, Old Testament, if there was no fire, there was no offering. They would bring their sacrifice and plunk, they would throw it on the altar. Everyone could look at it like, oh wow, did you see what they brought? But it wasn't offered to the Lord until it was burned. New Testament, 1st Corinthians 13 3, and though I bestow all my goods to feed the poor, that sounds like a sacrifice to me. Plunk, there it is on the altar. And though I give my body to be burned, that sounds like a sacrifice to me. Plunk, there's another one. And have not charity, love, it profit me, it profiteth me nothing. Here we have a picture, bringing things, doing things, all right? But there's no charity. We're not doing it with a love for God or a love for others. And the Bible says, you're not offering it to me. There's no fire. fire, it's not coming up to me. Oh, you can bring it, plunk it, it's there on the altar and others can look at it, all right? But it's not being offered to me. So why is it that perhaps we ask the question, Lord, I'm doing all these things, why aren't you blessing me? Well, number one, do we have the right order? And number two, how's your fire? You know, we opened with a verse from Abraham and Isaac about Isaac asking his dad the question, behold, the wood and the fire, but where's the sacrifice? I think, perhaps, I know the Lord often answers a question with a question as a way to teach. And I think maybe the question he would respond to us would be this, behold, the sacrifice and the wood, but where's the fire? And that's the title for the message tonight, Where's the Fire? How is your fire doing tonight? Is your passion for the Lord as hot as it should be? If it's not, would you allow me to share with you three quick helps in closing tonight? What's the solution? Perhaps our fire, our zeal, our love for the Lord has gone cold. What can we do? What are some practical things we can do? Well, I have three quick helps, and I have the mnemonic. Hopefully this is cheesy enough for you to remember it, but it's hot, H-O-T, all right? The first one is put on the helmet of salvation. What does it mean to put on the helmet of salvation? Well, if you put something on your head, the helmet, all right, that means you're thinking about it. What is it that we're to be thinking about every day? What is salvation? It is the gift of God. It's a demonstration of His love for us. In 1 Thessalonians 5, 8, but let us who are of the day be sober, putting on the breastplate of faith and love, and for a helmet, the hope of salvation. In 1 John 4, 19, hopefully I'm not stealing any of the pastor's verses coming up in 1 John, but he says, but the Bible says, we love Him because He first loved us. My friends, if you're thoroughly convinced that God loves you, it puts a zeal in your heart. It gives you a thirst and a hunger to want to know more about Him. I know many of you may have remembered an old, I don't know, he was a French guy, Victor Hugo, not a Christian, but at least he got it, the picture of love. He says, the greatest happiness of life is the conviction that we are loved, loved for ourselves, or rather, loved in spite of ourselves. We can quickly get discouraged, distracted, and we can lose sight of how much God loves us. And when that happens, boy, it's a downward spiral, isn't it? What's the solution? Take some time. When you put the helmet of salvation on, you're reflecting, you're remembering all that God has done for us and what He's going to do for us. What did it cost God to come to the cross to die for you and for me? It cost Him everything. He gave up heaven. He came to this earth, and He was forsaken by all. And He hung on the cross, forsaken by all those who called Him friend and master. They all fled. And if that wasn't enough, His own Father turned His back on Him. And there He hung, utterly and completely alone. And He did all of that, not for the angels, not for any of the animals, not for any other created being, but you and me. Do you feel special tonight? You should. You are loved. All right? How often do we forget that? We need to be daily reminded of it. We need to be getting in God's Word and opening up the love letter that He's given to us and remind ourselves how much He loves us. What's the first thing that you can do to help rekindle that fire? Put the helmet of salvation on, P-H. Number two, Obey. You know, nothing will cool our hearts faster than unrepentant sin. The Bible says in Matthew 24, 12, and because iniquity shall abound, the love of many shall wax cold. What happens to the fire? It's cold. All right? Because of iniquity. And in John 15, 10, if you keep my commandments, you shall abide in my love, even as I have kept my Father's commandments and abide in His love. Obey. And the last one I have for you, number T, it's often been said that love is spelled T-I-M-E, time. You will spend time with those that you love. You'll spend time doing the things that you love. And the more time that we spend with God, number one, the more that we will be like Him. The Bible says God is love. The more time that we spend in His Word, more time that we spend in prayer, we can't help it, you will start to become like the people you are next to. I see this, you know, even it's kind of humorous, but some of the couples who've been together for a long time, all right, they can't tell, but someone from the outside looking, they start sounding like each other. They even start looking like each other. They have the same facial expressions, same mannerisms. You know, do others see Christ in us? Are we spending time with Him daily? If so, you can't help it. Love is going to come out of you. He says, abide in me and I in you. As a branch cannot bear fruit of itself except it abide in the vine, no more can ye except ye abide in me. It's not a decision. You know what? Jeff, you're right. I need to be more loving. I've made the decision. I'm going to be more loving. It's going to last about as long as it takes for you to drive out onto the highway, all right? We'll see how far that goes. Where does love come from? It doesn't come from us. It comes from God. And if we're not spending time with Him every day, you're not going to have the love of God within you. And you know, the more time that we spend with God, not only do we become more like Him, but we become warmed when we're next to the fire. I'm reminded of the disciples on the road to Emmaus. You know what they said? And they turned after the Lord had showed Himself to them and He disappeared. And they said one to another, did not our hearts burn within us when He talked with us by the way and while He opened us the Scriptures? My friends, you don't have to stand alone, cold and miserable in this Christian life. God wants you to be near. Draw an eye to God and He will draw an eye to you. He wants you to be warm. He wants you to be on fire. Spending time with God and also spending time with others, you know, love is contagious. Fire is hot, it's bright and it spreads. In Hebrews 10.24, and let us consider one another to provoke unto love and to good works, not forsaking the assembling of ourselves together as the manner of some is, but exhorting one another and so much the more as you see the day approaching. Are you encouraging one another? Are you praying for one another? I tell you what, you know, it's such an encouragement, such a blessing just to get around another brother or sister, whether it's even a phone call, whether it's to sit down and have a coffee and you just share what God's doing in your life. It's like, wow, that was good, you know. My friends, if you need that, so does your brother, so does your sister. You know, in conclusion tonight, God wants us to have life and to have it more abundantly. He wants our lives to be overflowing with joy and peace and blessings. We will only experience those if our sacrifices are in the right order and are set aflame. How is your fire tonight? Does it need stoking? You know, a fire needs daily care. It's a daily walk. Apart from him will quickly grow cold. In order, do you have it in the right order? Have you skipped over the burnt offering? Are there areas in your life that you haven't surrendered? You know, God isn't asking for all of our money or all of our time or all of our things. That's the meat offering. Those are things that we give back apart to him and we get to enjoy the rest. But there's one thing that he will not share. The burnt offering was not shared. Matthew 22, 37, and Jesus said unto him, Thou shalt love the Lord thy God. with all thy heart, and with all thy soul, and with all thy mind. God wants all of our hearts to be consumed in flames of passion for Him. You know there's a song, is your all on the altar? The first verse says this, you have longed for sweet peace, and for faith to increase, and have earnestly, fervently prayed, but you cannot have rest or be perfectly blessed until all on the altar is laid. I pray that's an encouragement or a blessing to you tonight, and I don't know how this normally goes, a little different tonight, but why don't we close in a word of prayer, and then I think Brother Dean, are you coming back up? Okay, all right, well let's just go ahead and go to Lord in prayer. Dear Lord, again I just want to thank you for tonight. I want to thank you Lord for giving pastor and the family safety as they were driving down lower to North Carolina. I pray that they have a good time with the family down there, and bring them home safe, and Lord I just want to thank you for speaking to my heart tonight, and Lord it is good to be together. Lord, I just want to thank you for all that you do for us. I want to thank you for the rest of this evening, and I pray that you'd be with the prayer time to follow. In Jesus name I pray, amen. you you Thank you.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.380000114440918,
      "text": " That blessed my heart and I just want to, glad to have the opportunity to share it with"
    },
    {
      "id": 1,
      "start": 4.380000114440918,
      "end": 5.380000114440918,
      "text": " you this evening."
    },
    {
      "id": 2,
      "start": 5.380000114440918,
      "end": 7.860000133514404,
      "text": " Did everyone get a prayer bulletin?"
    },
    {
      "id": 3,
      "start": 7.860000133514404,
      "end": 11.4399995803833,
      "text": " If you didn't, please snag one."
    },
    {
      "id": 4,
      "start": 11.4399995803833,
      "end": 13.680000305175781,
      "text": " In the middle, there's a half piece of paper."
    },
    {
      "id": 5,
      "start": 13.680000305175781,
      "end": 16.8799991607666,
      "text": " We'll get to it in just a minute, but I just wanted to let you know it's hiding in there"
    },
    {
      "id": 6,
      "start": 16.8799991607666,
      "end": 17.8799991607666,
      "text": " for you."
    },
    {
      "id": 7,
      "start": 17.8799991607666,
      "end": 20.040000915527344,
      "text": " It's a late Christmas present, all right?"
    },
    {
      "id": 8,
      "start": 20.040000915527344,
      "end": 27.899999618530273,
      "text": " But I want to open up with just one verse from Genesis, chapter 22, and this is the"
    },
    {
      "id": 9,
      "start": 27.899999618530273,
      "end": 34.2599983215332,
      "text": " account of Abraham and Isaac, and they're heading up to Mount Moriah where Isaac is"
    },
    {
      "id": 10,
      "start": 34.2599983215332,
      "end": 37.2599983215332,
      "text": " to be offered, but he doesn't know it."
    },
    {
      "id": 11,
      "start": 37.2599983215332,
      "end": 45.65999984741211,
      "text": " And the Bible says in Genesis 22, verse 7, Isaac turns to his father, Abraham, and the"
    },
    {
      "id": 12,
      "start": 45.65999984741211,
      "end": 51.79999923706055,
      "text": " Bible says, and Isaac spake unto Abraham, his father, and said, My father, and he said,"
    },
    {
      "id": 13,
      "start": 51.79999923706055,
      "end": 53.599998474121094,
      "text": " Where am I, my son?"
    },
    {
      "id": 14,
      "start": 53.599998474121094,
      "end": 62.119998931884766,
      "text": " And he said, Behold, the fire and the wood, but where is the lamb for the burnt offering?"
    },
    {
      "id": 15,
      "start": 62.119998931884766,
      "end": 63.599998474121094,
      "text": " Let's open in a word of prayer."
    },
    {
      "id": 16,
      "start": 63.599998474121094,
      "end": 68.16000366210938,
      "text": " Dear Heavenly Father, Lord, Lord, it's been a busy week."
    },
    {
      "id": 17,
      "start": 68.16000366210938,
      "end": 70.08000183105469,
      "text": " Lord, there's a lot of things."
    },
    {
      "id": 18,
      "start": 70.08000183105469,
      "end": 73.31999969482422,
      "text": " I know folks may be tired tonight."
    },
    {
      "id": 19,
      "start": 73.31999969482422,
      "end": 78.55999755859375,
      "text": " Our minds may be on a million other things, but Lord, I pray that you would just, Lord,"
    },
    {
      "id": 20,
      "start": 78.55999755859375,
      "end": 83.80000305175781,
      "text": " let us put all those things out of our mind, open our ears, open our hearts, and Lord,"
    },
    {
      "id": 21,
      "start": 83.80000305175781,
      "end": 87.44000244140625,
      "text": " I pray that the message you would have for us to hear tonight would come through."
    },
    {
      "id": 22,
      "start": 87.44000244140625,
      "end": 92.0,
      "text": " I pray these things in Jesus' name, amen."
    },
    {
      "id": 23,
      "start": 92.0,
      "end": 99.9800033569336,
      "text": " Here we have a very familiar account of the sacrifice on Mount Moriah between Abraham"
    },
    {
      "id": 24,
      "start": 99.9800033569336,
      "end": 105.26000213623047,
      "text": " and Isaac, and the Old Testament is filled with many different offerings and sacrifices."
    },
    {
      "id": 25,
      "start": 105.26000213623047,
      "end": 111.45999908447266,
      "text": " You can go all the way back to Genesis chapter 4 with Cain and Abel, the very first offering."
    },
    {
      "id": 26,
      "start": 111.45999908447266,
      "end": 117.0999984741211,
      "text": " You know, when Abel brought his offering and God honored it, vice Cain, and you go through"
    },
    {
      "id": 27,
      "start": 117.0999984741211,
      "end": 124.22000122070312,
      "text": " Noah, we read in Genesis 8, Noah offered sacrifices to the Lord."
    },
    {
      "id": 28,
      "start": 124.22000122070312,
      "end": 128.5800018310547,
      "text": " In Genesis 8.20, the Bible says, and Noah built an altar unto the Lord, and took of"
    },
    {
      "id": 29,
      "start": 128.5800018310547,
      "end": 134.25999450683594,
      "text": " every clean beast and every clean fowl, and offered burnt offerings on the altar."
    },
    {
      "id": 30,
      "start": 134.25999450683594,
      "end": 139.4600067138672,
      "text": " You read about offerings in Job, he offered sacrifices, and Jacob."
    },
    {
      "id": 31,
      "start": 139.4600067138672,
      "end": 143.22000122070312,
      "text": " And it's not until you get to the book of Exodus and Leviticus that God actually lays"
    },
    {
      "id": 32,
      "start": 143.22000122070312,
      "end": 151.25999450683594,
      "text": " out specific guidance for the different sacrifices and when and why they were to be offered."
    },
    {
      "id": 33,
      "start": 151.25999450683594,
      "end": 154.6199951171875,
      "text": " And if you're like me, if you're going through your Bible reading and you come to Leviticus,"
    },
    {
      "id": 34,
      "start": 154.6199951171875,
      "end": 159.77999877929688,
      "text": " all right, and you're starting to read through all of these different sacrifices and offerings,"
    },
    {
      "id": 35,
      "start": 159.77999877929688,
      "end": 164.24000549316406,
      "text": " it's like, oh, this is horrible, right?"
    },
    {
      "id": 36,
      "start": 164.24000549316406,
      "end": 166.39999389648438,
      "text": " And you go back, it's like a Burger King menu."
    },
    {
      "id": 37,
      "start": 166.39999389648438,
      "end": 170.8000030517578,
      "text": " You read about national offerings and individual offerings."
    },
    {
      "id": 38,
      "start": 170.8000030517578,
      "end": 174.16000366210938,
      "text": " There's sin offerings, burnt offerings of different types."
    },
    {
      "id": 39,
      "start": 174.16000366210938,
      "end": 181.8800048828125,
      "text": " There's meat offerings, which the word meat in our King James Version means food."
    },
    {
      "id": 40,
      "start": 181.8800048828125,
      "end": 185.25999450683594,
      "text": " And if you look, it's not actual meat, it's bread and grain."
    },
    {
      "id": 41,
      "start": 185.25999450683594,
      "end": 186.67999267578125,
      "text": " And there's drink offerings."
    },
    {
      "id": 42,
      "start": 186.67999267578125,
      "end": 188.52000427246094,
      "text": " There's offerings for different occasions."
    },
    {
      "id": 43,
      "start": 188.52000427246094,
      "end": 191.52000427246094,
      "text": " There's ceremonial offerings at different festivals."
    },
    {
      "id": 44,
      "start": 191.52000427246094,
      "end": 195.39999389648438,
      "text": " If you were to dedicate a house, there was an offering that you would bring or the birth"
    },
    {
      "id": 45,
      "start": 195.39999389648438,
      "end": 198.27999877929688,
      "text": " of a child."
    },
    {
      "id": 46,
      "start": 198.27999877929688,
      "end": 203.8000030517578,
      "text": " And if you're like me, it's pretty easy to read over those passages and just to think,"
    },
    {
      "id": 47,
      "start": 203.8000030517578,
      "end": 204.8000030517578,
      "text": " well, you know what?"
    },
    {
      "id": 48,
      "start": 204.8000030517578,
      "end": 206.0800018310547,
      "text": " That was the Old Testament."
    },
    {
      "id": 49,
      "start": 206.0800018310547,
      "end": 209.36000061035156,
      "text": " That was awesome for them."
    },
    {
      "id": 50,
      "start": 209.36000061035156,
      "end": 211.1999969482422,
      "text": " And there's not really much here for me."
    },
    {
      "id": 51,
      "start": 211.1999969482422,
      "end": 214.52000427246094,
      "text": " As a matter of fact, the Bible says that all of that is in the past."
    },
    {
      "id": 52,
      "start": 214.52000427246094,
      "end": 222.24000549316406,
      "text": " In Luke 16, 16, the Bible says, the law and the prophets were until John."
    },
    {
      "id": 53,
      "start": 222.24000549316406,
      "end": 226.75999450683594,
      "text": " Since that time, the kingdom of God is preached and every man presseth into it."
    },
    {
      "id": 54,
      "start": 226.75999450683594,
      "end": 230.6199951171875,
      "text": " So I know that the law, the ceremonial law doesn't apply to me."
    },
    {
      "id": 55,
      "start": 230.6199951171875,
      "end": 233.1199951171875,
      "text": " So can't I just skip over those passages?"
    },
    {
      "id": 56,
      "start": 233.1199951171875,
      "end": 240.39999389648438,
      "text": " I mean, what does it really help me besides knowing that they did them?"
    },
    {
      "id": 57,
      "start": 241.27999877929688,
      "end": 248.27999877929688,
      "text": " Well, I was reminded in 2 Timothy 3, 16, the Bible says, all scripture is given by inspiration"
    },
    {
      "id": 58,
      "start": 248.27999877929688,
      "end": 258.8399963378906,
      "text": " of God and is profitable for doctrine, for reproof, correction, for instruction in righteousness."
    },
    {
      "id": 59,
      "start": 258.8399963378906,
      "end": 260.3999938964844,
      "text": " Even Leviticus?"
    },
    {
      "id": 60,
      "start": 260.3999938964844,
      "end": 261.9200134277344,
      "text": " Yes."
    },
    {
      "id": 61,
      "start": 261.9200134277344,
      "end": 262.9200134277344,
      "text": " How?"
    },
    {
      "id": 62,
      "start": 262.9200134277344,
      "end": 267.9200134277344,
      "text": " You may be asking, and that's the point of the short, very short message tonight is when"
    },
    {
      "id": 63,
      "start": 267.9200134277344,
      "end": 274.7200012207031,
      "text": " we look back at the sacrifices, we see a beautiful picture."
    },
    {
      "id": 64,
      "start": 274.7200012207031,
      "end": 282.5,
      "text": " You know, when Christ was on, during his three years, his earthly ministry, he taught."
    },
    {
      "id": 65,
      "start": 282.5,
      "end": 286.9599914550781,
      "text": " And most of the time when he was teaching, what did he use?"
    },
    {
      "id": 66,
      "start": 286.9599914550781,
      "end": 287.9599914550781,
      "text": " Parables, right?"
    },
    {
      "id": 67,
      "start": 287.9599914550781,
      "end": 293.4800109863281,
      "text": " Pictures, word pictures, so that you could understand something that you can't see, the"
    },
    {
      "id": 68,
      "start": 293.4800109863281,
      "end": 296.67999267578125,
      "text": " kingdom of God, salvation, all right?"
    },
    {
      "id": 69,
      "start": 296.67999267578125,
      "end": 298.3599853515625,
      "text": " Being born again, you can't really see that."
    },
    {
      "id": 70,
      "start": 298.3599853515625,
      "end": 301.20001220703125,
      "text": " So he would take things that you could see, all right?"
    },
    {
      "id": 71,
      "start": 301.20001220703125,
      "end": 303.1199951171875,
      "text": " So do you understand dirt?"
    },
    {
      "id": 72,
      "start": 303.1199951171875,
      "end": 304.3599853515625,
      "text": " You understand what dirt is?"
    },
    {
      "id": 73,
      "start": 304.3599853515625,
      "end": 305.3599853515625,
      "text": " All right."
    },
    {
      "id": 74,
      "start": 305.3599853515625,
      "end": 307.0799865722656,
      "text": " Dirt, that is your heart."
    },
    {
      "id": 75,
      "start": 307.0799865722656,
      "end": 312.55999755859375,
      "text": " And he would use a parable to explain something that you couldn't see with your eyes."
    },
    {
      "id": 76,
      "start": 312.55999755859375,
      "end": 319.3599853515625,
      "text": " And here we have, as we look back into the Old Testament, we know that these sacrifices"
    },
    {
      "id": 77,
      "start": 319.3599853515625,
      "end": 325.6000061035156,
      "text": " and these offerings from Hebrews chapter 10, verse 1, the Bible says, for the law having"
    },
    {
      "id": 78,
      "start": 325.6000061035156,
      "end": 336.0400085449219,
      "text": " a shadow of good things to come and not the very image of the things, all right, can never"
    },
    {
      "id": 79,
      "start": 336.0400085449219,
      "end": 340.8399963378906,
      "text": " with these sacrifices which they offered year by year continually make the comers thereunto"
    },
    {
      "id": 80,
      "start": 340.8399963378906,
      "end": 344.79998779296875,
      "text": " perfect for then would they not have ceased to be offered."
    },
    {
      "id": 81,
      "start": 344.79998779296875,
      "end": 348.5199890136719,
      "text": " Here the Bible is saying, yeah, look back at all those sacrifices and offerings that"
    },
    {
      "id": 82,
      "start": 348.5199890136719,
      "end": 349.5199890136719,
      "text": " they were done."
    },
    {
      "id": 83,
      "start": 349.5199890136719,
      "end": 350.5199890136719,
      "text": " They were just a shadow."
    },
    {
      "id": 84,
      "start": 350.5199890136719,
      "end": 353.3599853515625,
      "text": " They were just a picture."
    },
    {
      "id": 85,
      "start": 353.3999938964844,
      "end": 358.32000732421875,
      "text": " And I realize that we often will understand, especially if you've been in church for a"
    },
    {
      "id": 86,
      "start": 358.32000732421875,
      "end": 362.2799987792969,
      "text": " little bit, you'll understand, oh, yeah, you know, they had a sacrifice in that picture"
    },
    {
      "id": 87,
      "start": 362.2799987792969,
      "end": 367.8399963378906,
      "text": " of the coming of Jesus Christ to offer himself on the cross to wash away our sins."
    },
    {
      "id": 88,
      "start": 367.8399963378906,
      "end": 368.8399963378906,
      "text": " And it's true."
    },
    {
      "id": 89,
      "start": 368.8399963378906,
      "end": 374.0400085449219,
      "text": " There was a sin offering in the Old Testament, but there were many others."
    },
    {
      "id": 90,
      "start": 374.0400085449219,
      "end": 376.2799987792969,
      "text": " What about all those other ones?"
    },
    {
      "id": 91,
      "start": 376.2799987792969,
      "end": 377.5199890136719,
      "text": " Do they mean anything?"
    },
    {
      "id": 92,
      "start": 377.5199890136719,
      "end": 380.1199951171875,
      "text": " Was it just something that they did?"
    },
    {
      "id": 93,
      "start": 380.1199951171875,
      "end": 387.3999938964844,
      "text": " Well, I would like you to shift your focus now to the New Testament, and I want to talk"
    },
    {
      "id": 94,
      "start": 387.3999938964844,
      "end": 391.3999938964844,
      "text": " about some New Testament offerings."
    },
    {
      "id": 95,
      "start": 391.3999938964844,
      "end": 401.1600036621094,
      "text": " In 1 Peter 2, verse 9, the Bible says, but ye, Christians, believers, sons and daughters"
    },
    {
      "id": 96,
      "start": 401.1600036621094,
      "end": 409.6400146484375,
      "text": " of God, but ye are a chosen generation, a royal priesthood, a holy nation, a peculiar"
    },
    {
      "id": 97,
      "start": 409.6400146484375,
      "end": 416.8800048828125,
      "text": " people that ye should show forth the praises of him who hath called you out of darkness"
    },
    {
      "id": 98,
      "start": 416.8800048828125,
      "end": 419.67999267578125,
      "text": " into his marvelous light."
    },
    {
      "id": 99,
      "start": 419.67999267578125,
      "end": 426.0400085449219,
      "text": " And in Revelation 1, verse 5, it says, unto him that loved us and washed us from our sins"
    },
    {
      "id": 100,
      "start": 426.0400085449219,
      "end": 434.9599914550781,
      "text": " in his own blood, and hath made us kings and priests unto God and his Father."
    },
    {
      "id": 101,
      "start": 434.9599914550781,
      "end": 437.6000061035156,
      "text": " To him be glory and dominion forever and ever."
    },
    {
      "id": 102,
      "start": 437.6000061035156,
      "end": 438.6000061035156,
      "text": " Amen."
    },
    {
      "id": 103,
      "start": 438.6000061035156,
      "end": 439.6000061035156,
      "text": " What does that mean?"
    },
    {
      "id": 104,
      "start": 439.6000061035156,
      "end": 445.1199951171875,
      "text": " Well, when we look back in the Old Testament, there were kings and there were priests, people"
    },
    {
      "id": 105,
      "start": 445.1199951171875,
      "end": 450.9200134277344,
      "text": " that were specifically chosen to go into the temple, to stand before God, and to serve"
    },
    {
      "id": 106,
      "start": 450.9200134277344,
      "end": 451.9200134277344,
      "text": " the Lord."
    },
    {
      "id": 107,
      "start": 451.9200134277344,
      "end": 455.79998779296875,
      "text": " But here, God is calling us priests."
    },
    {
      "id": 108,
      "start": 455.79998779296875,
      "end": 460.0799865722656,
      "text": " You, if you're sitting here and you know the Lord as your Savior, God is calling you a"
    },
    {
      "id": 109,
      "start": 460.0799865722656,
      "end": 462.2799987792969,
      "text": " king and a priest."
    },
    {
      "id": 110,
      "start": 462.2799987792969,
      "end": 463.2799987792969,
      "text": " Why?"
    },
    {
      "id": 111,
      "start": 463.2799987792969,
      "end": 467.0,
      "text": " Well, as a king, we are adopted into the family."
    },
    {
      "id": 112,
      "start": 467.0,
      "end": 472.2799987792969,
      "text": " We are the sons and the daughters of the king of kings, and we will reign with him."
    },
    {
      "id": 113,
      "start": 472.2799987792969,
      "end": 473.32000732421875,
      "text": " That's not a figure of speech."
    },
    {
      "id": 114,
      "start": 473.32000732421875,
      "end": 475.79998779296875,
      "text": " We literally will reign."
    },
    {
      "id": 115,
      "start": 475.79998779296875,
      "end": 479.4200134277344,
      "text": " You and I are of the kingdom."
    },
    {
      "id": 116,
      "start": 479.4200134277344,
      "end": 483.82000732421875,
      "text": " He calls us kings, and we're priests because, like the Old Testament priests, we have access"
    },
    {
      "id": 117,
      "start": 483.82000732421875,
      "end": 485.3800048828125,
      "text": " to God."
    },
    {
      "id": 118,
      "start": 485.3800048828125,
      "end": 488.29998779296875,
      "text": " In the Old Testament times, not everyone had that privilege."
    },
    {
      "id": 119,
      "start": 488.29998779296875,
      "end": 494.739990234375,
      "text": " It was only a select few who could come before the Lord, who could offer the sacrifices."
    },
    {
      "id": 120,
      "start": 494.739990234375,
      "end": 498.1199951171875,
      "text": " But today, every one of us can."
    },
    {
      "id": 121,
      "start": 498.1199951171875,
      "end": 503.17999267578125,
      "text": " We have free access to come before the Lord."
    },
    {
      "id": 122,
      "start": 504.17999267578125,
      "end": 512.6599731445312,
      "text": " Additionally, as priests in 1 Peter 2.5, we're commanded to bring sacrifices."
    },
    {
      "id": 123,
      "start": 512.6599731445312,
      "end": 514.0999755859375,
      "text": " In 1 Peter 2.5, the Bible says,"
    },
    {
      "id": 124,
      "start": 514.0999755859375,
      "end": 520.2999877929688,
      "text": " \"...Ye also, as lively stones, are built up a spiritual house, a holy priesthood, to offer"
    },
    {
      "id": 125,
      "start": 520.2999877929688,
      "end": 526.8200073242188,
      "text": " up spiritual sacrifices acceptable to God by Jesus Christ.\""
    },
    {
      "id": 126,
      "start": 526.8200073242188,
      "end": 533.8200073242188,
      "text": " What are some of the sacrifices today that God wants us to bring to Him?"
    },
    {
      "id": 127,
      "start": 533.8200073242188,
      "end": 534.8200073242188,
      "text": " Anyone?"
    },
    {
      "id": 128,
      "start": 534.8200073242188,
      "end": 537.8200073242188,
      "text": " Anyone come to mind?"
    },
    {
      "id": 129,
      "start": 537.8200073242188,
      "end": 540.8200073242188,
      "text": " What's that?"
    },
    {
      "id": 130,
      "start": 540.8200073242188,
      "end": 542.8200073242188,
      "text": " Praise?"
    },
    {
      "id": 131,
      "start": 542.8200073242188,
      "end": 543.8200073242188,
      "text": " Yeah."
    },
    {
      "id": 132,
      "start": 543.8200073242188,
      "end": 546.8200073242188,
      "text": " How about our bodies, Romans 12.1?"
    },
    {
      "id": 133,
      "start": 546.8200073242188,
      "end": 549.8200073242188,
      "text": " Yeah, our life."
    },
    {
      "id": 134,
      "start": 549.8200073242188,
      "end": 550.8200073242188,
      "text": " In Romans, it says,"
    },
    {
      "id": 135,
      "start": 550.8200073242188,
      "end": 553.739990234375,
      "text": " \"...We teach you, therefore, brethren, by the mercies of God, that you present your"
    },
    {
      "id": 136,
      "start": 553.739990234375,
      "end": 555.8200073242188,
      "text": " bodies a living sacrifice.\""
    },
    {
      "id": 137,
      "start": 555.8200073242188,
      "end": 558.8200073242188,
      "text": " Praise, Hebrews 13.15,"
    },
    {
      "id": 138,
      "start": 558.8200073242188,
      "end": 563.8200073242188,
      "text": " \"...By Him, therefore, let us offer the sacrifice of praise to God continually.\""
    },
    {
      "id": 139,
      "start": 563.8200073242188,
      "end": 566.8200073242188,
      "text": " Mercy, in Hebrews 13.16, the next verse,"
    },
    {
      "id": 140,
      "start": 566.8200073242188,
      "end": 572.8200073242188,
      "text": " \"...But to do good and to communicate, forget not, for with such sacrifices God is well-pleased.\""
    },
    {
      "id": 141,
      "start": 572.8200073242188,
      "end": 576.8200073242188,
      "text": " It goes on here."
    },
    {
      "id": 142,
      "start": 576.8200073242188,
      "end": 579.8200073242188,
      "text": " So, I see that, I get it."
    },
    {
      "id": 143,
      "start": 579.8200073242188,
      "end": 582.8200073242188,
      "text": " We're called priests because we have access to God."
    },
    {
      "id": 144,
      "start": 582.8200073242188,
      "end": 586.8200073242188,
      "text": " But if I look back in the Old Testament, the priests and all those sacrifices and offerings"
    },
    {
      "id": 145,
      "start": 586.8200073242188,
      "end": 590.8200073242188,
      "text": " that they brought, is there a connection between all of those?"
    },
    {
      "id": 146,
      "start": 590.8200073242188,
      "end": 596.8200073242188,
      "text": " Is there an actual picture that I can look at and be like,"
    },
    {
      "id": 147,
      "start": 596.8200073242188,
      "end": 599.8200073242188,
      "text": " Oh, now I get it."
    },
    {
      "id": 0,
      "start": 599.8200073242188,
      "end": 606.3000073432922,
      "text": " now I understand what God wants to be happening in my life?\" And the answer is"
    },
    {
      "id": 1,
      "start": 606.3000073432922,
      "end": 612.1200075149536,
      "text": " yes, and specifically we're going to look at three types of sacrifices, and these"
    },
    {
      "id": 2,
      "start": 612.1200075149536,
      "end": 621.4200077056885,
      "text": " are from Exodus 29, and these are the sacrifices that the priests brought for"
    },
    {
      "id": 3,
      "start": 621.4200077056885,
      "end": 626.3800067901611,
      "text": " them to be consecrated or set apart for the Lord. These were the sacrifices that"
    },
    {
      "id": 4,
      "start": 626.3800067901611,
      "end": 631.4600067138672,
      "text": " the priest had to do in order to come to the point where they were set apart,"
    },
    {
      "id": 5,
      "start": 631.4600067138672,
      "end": 635.580005645752,
      "text": " where they were sanctified and consecrated for the Lord. We, as New"
    },
    {
      "id": 6,
      "start": 635.580005645752,
      "end": 640.7800064086914,
      "text": " Testament priests, can learn by looking back at the Old Testament picture, okay?"
    },
    {
      "id": 7,
      "start": 640.7800064086914,
      "end": 646.7400054931641,
      "text": " And what are these three types? There's three groups here. There's actually four"
    },
    {
      "id": 8,
      "start": 646.7400054931641,
      "end": 650.5400085449219,
      "text": " sacrifices on the little handout that I gave you, and I'm not going to read"
    },
    {
      "id": 9,
      "start": 650.5400085449219,
      "end": 655.2600059509277,
      "text": " through all the verses, but I just want to skim over. In Exodus chapter 29, verses"
    },
    {
      "id": 10,
      "start": 655.2600059509277,
      "end": 660.4200057983398,
      "text": " 10 through 14, the Bible talks about a bullock being brought, and this was"
    },
    {
      "id": 11,
      "start": 660.4200057983398,
      "end": 666.2200088500977,
      "text": " specifically for a sin offering. In verse 14, the Bible says,"
    },
    {
      "id": 12,
      "start": 666.2200088500977,
      "end": 670.0200042724609,
      "text": " \"...but the flesh of the bullock, and his skin, and his dung, shalt thou burn with"
    },
    {
      "id": 13,
      "start": 670.0200042724609,
      "end": 676.5800094604492,
      "text": " fire without the camp.\" It is a sin offering, and I have a copy of that, too."
    },
    {
      "id": 14,
      "start": 676.5800094604492,
      "end": 682.0600051879883,
      "text": " I just want to look at this, make sure I'm following along with you guys. The sin"
    },
    {
      "id": 15,
      "start": 682.0600051879883,
      "end": 687.5800094604492,
      "text": " offering, picture of salvation, the forgiveness of our sins, that came first."
    },
    {
      "id": 16,
      "start": 687.5800094604492,
      "end": 693.9400100708008,
      "text": " That came first, and if you're curious for more, you can read the first five"
    },
    {
      "id": 17,
      "start": 693.9400100708008,
      "end": 701.7800064086914,
      "text": " chapters of Leviticus, and they expound these sacrifices. But that one"
    },
    {
      "id": 18,
      "start": 701.7800064086914,
      "end": 708.3800048828125,
      "text": " came first. The second one was the burnt offering, verses 15 through 18, and this"
    },
    {
      "id": 19,
      "start": 708.3800048828125,
      "end": 715.3600082397461,
      "text": " was a ram, and it was a burnt offering. That means all of it was burned on the"
    },
    {
      "id": 20,
      "start": 715.3600082397461,
      "end": 721.5800094604492,
      "text": " altar. Nothing was left. All of it was burned, and this is a beautiful picture"
    },
    {
      "id": 21,
      "start": 721.5800094604492,
      "end": 729.6600036621094,
      "text": " of surrender. All of our hearts offered up to the Lord. And then came, verses 19"
    },
    {
      "id": 22,
      "start": 729.6600036621094,
      "end": 735.3800048828125,
      "text": " through 33, it was a second ram, and also bread, grain. It was the meat offering,"
    },
    {
      "id": 23,
      "start": 735.3800048828125,
      "end": 741.7000122070312,
      "text": " which pictured service. They didn't bring all of it,"
    },
    {
      "id": 24,
      "start": 741.7000122070312,
      "end": 747.9400024414062,
      "text": " they brought some of it to the Lord, and some of it they enjoyed themselves. And"
    },
    {
      "id": 25,
      "start": 747.9400024414062,
      "end": 755.3000030517578,
      "text": " also the peace offering, picturing the beautiful peace of God that we can have"
    },
    {
      "id": 26,
      "start": 755.3000030517578,
      "end": 760.9400024414062,
      "text": " with him in fellowship. Where some of it was offered on the altar, and some of it"
    },
    {
      "id": 27,
      "start": 760.9400024414062,
      "end": 768.1000061035156,
      "text": " was eaten by the giver. It's a beautiful picture of having supper. Some of it was"
    },
    {
      "id": 28,
      "start": 768.1000061035156,
      "end": 772.5,
      "text": " given to the Lord, and some of it, the offer that the person giving it got to"
    },
    {
      "id": 29,
      "start": 772.5,
      "end": 776.5,
      "text": " enjoy themselves. It was having supper together. It's a beautiful picture of"
    },
    {
      "id": 30,
      "start": 776.5,
      "end": 781.8200073242188,
      "text": " supplication, having supper, sweet fellowship. That's what it pictured. It"
    },
    {
      "id": 31,
      "start": 781.8200073242188,
      "end": 786.3800048828125,
      "text": " was a joyous time, and if you look at Leviticus, the sin offering was"
    },
    {
      "id": 32,
      "start": 786.3800048828125,
      "end": 791.9400024414062,
      "text": " mandatory. All of us must come to Christ, we must be saved, that comes first. But"
    },
    {
      "id": 33,
      "start": 791.9400024414062,
      "end": 795.9400024414062,
      "text": " the other ones were voluntary. The fellowship, maintaining that fellowship"
    },
    {
      "id": 34,
      "start": 795.9400024414062,
      "end": 801.0200042724609,
      "text": " with the Lord, if you look, these were free will offerings, all right? They were"
    },
    {
      "id": 35,
      "start": 801.0200042724609,
      "end": 810.260009765625,
      "text": " given. Well, I'm reminded of Revelation 3.20, talking about supplication. The"
    },
    {
      "id": 36,
      "start": 810.260009765625,
      "end": 815.3400115966797,
      "text": " Bible says Jesus is speaking to the church, to believers, and he's saying,"
    },
    {
      "id": 37,
      "start": 815.3400115966797,
      "end": 821.260009765625,
      "text": " Behold, I stand at the door and knock. If any man hear my voice and open the door,"
    },
    {
      "id": 38,
      "start": 821.260009765625,
      "end": 826.6600036621094,
      "text": " I will come in to him and will sup with him. I want to have supper with you. I"
    },
    {
      "id": 39,
      "start": 826.6600036621094,
      "end": 831.0200042724609,
      "text": " want to have fellowship, all right? And that's the point here that God"
    },
    {
      "id": 40,
      "start": 831.0200042724609,
      "end": 835.9800109863281,
      "text": " wants us to get to, but there's a problem."
    },
    {
      "id": 41,
      "start": 836.2200012207031,
      "end": 841.8200073242188,
      "text": " Perhaps, I know I've been here, all right? Perhaps you've been here as well, perhaps"
    },
    {
      "id": 42,
      "start": 841.8200073242188,
      "end": 846.3000030517578,
      "text": " you're there right now, you're saying, hey, you know, Jeff, I get it, you know, I'm"
    },
    {
      "id": 43,
      "start": 846.3000030517578,
      "end": 852.7400054931641,
      "text": " doing these things, I'm sacrificing to the Lord, I'm giving tithes and"
    },
    {
      "id": 44,
      "start": 852.7400054931641,
      "end": 855.8600158691406,
      "text": " offerings, I'm, you know, I'm here, it's Wednesday night, I'm here in"
    },
    {
      "id": 45,
      "start": 855.8600158691406,
      "end": 860.8600158691406,
      "text": " church, I'm giving my time, all right? And I'm doing all these things, but it seems"
    },
    {
      "id": 46,
      "start": 860.8600158691406,
      "end": 866.8600158691406,
      "text": " like I'm not enjoying the peace of God, that sweet fellowship and the blessings."
    },
    {
      "id": 47,
      "start": 866.8600158691406,
      "end": 872.5,
      "text": " It just seems like something's missing. What's wrong? What am I missing here?"
    },
    {
      "id": 48,
      "start": 872.5,
      "end": 882.4600219726562,
      "text": " And to answer that, I would like you to notice two details of these sacrifices."
    },
    {
      "id": 49,
      "start": 882.4600219726562,
      "end": 890.4600219726562,
      "text": " The first is the order. The first is the order of them. Salvation comes first, and"
    },
    {
      "id": 50,
      "start": 890.4600219726562,
      "end": 896.6199951171875,
      "text": " then comes the burnt offering, surrender. You know, when the Bible says, present"
    },
    {
      "id": 51,
      "start": 896.6199951171875,
      "end": 903.3399963378906,
      "text": " your bodies a living sacrifice, this is a daily surrender. It's obeying God's"
    },
    {
      "id": 52,
      "start": 903.3399963378906,
      "end": 911.8600158691406,
      "text": " Word, it's a humbling of ourselves. Lord, I surrender my will to you. What did"
    },
    {
      "id": 53,
      "start": 911.8600158691406,
      "end": 919.02001953125,
      "text": " Christ say, not my will but thine be done? It's a surrender. And when we humble"
    },
    {
      "id": 54,
      "start": 919.02001953125,
      "end": 923.3399963378906,
      "text": " ourselves, when we surrender our will to Him, there is some beautiful things that"
    },
    {
      "id": 55,
      "start": 923.3399963378906,
      "end": 929.02001953125,
      "text": " happen. In James, the Bible says, but he giveth more grace, wherefore he saith, God"
    },
    {
      "id": 56,
      "start": 929.02001953125,
      "end": 934.4200134277344,
      "text": " resisteth the proud, but giveth grace unto the humble, the person who has"
    },
    {
      "id": 57,
      "start": 934.4200134277344,
      "end": 938.7799987792969,
      "text": " surrendered themselves to the Lord. Lord, I'm not holding anything back. I want your"
    },
    {
      "id": 58,
      "start": 938.7799987792969,
      "end": 943.8999938964844,
      "text": " will to be done. In James 4.10, humble yourselves in the sight of the Lord, and"
    },
    {
      "id": 59,
      "start": 943.8999938964844,
      "end": 950.5,
      "text": " He shall lift you up. What comes after salvation? There's a surrender. There's a"
    },
    {
      "id": 60,
      "start": 950.5,
      "end": 955.02001953125,
      "text": " surrendering of our will. There's a humbling of ourselves. And then comes"
    },
    {
      "id": 61,
      "start": 955.02001953125,
      "end": 963.3800048828125,
      "text": " service. Then comes the meat offering, all right? Then comes us doing things. You"
    },
    {
      "id": 62,
      "start": 963.3800048828125,
      "end": 968.0599975585938,
      "text": " know, service, while we still have unsurrendered areas or sins in our life,"
    },
    {
      "id": 63,
      "start": 968.0599975585938,
      "end": 972.9400024414062,
      "text": " will certainly lead to frustration at a minimum. And if we're not careful, it can"
    },
    {
      "id": 64,
      "start": 972.9400024414062,
      "end": 980.3000183105469,
      "text": " quickly lead to a bitter, unfruitful life. God, look at what I'm doing for you. Why"
    },
    {
      "id": 65,
      "start": 980.3000183105469,
      "end": 986.8600158691406,
      "text": " aren't you blessing me? Bible warns us about this in Hebrews 12. It says,"
    },
    {
      "id": 66,
      "start": 986.8600158691406,
      "end": 991.6199951171875,
      "text": " looking diligently, lest any man fail of the grace of God, lest any root of"
    },
    {
      "id": 67,
      "start": 991.6199951171875,
      "end": 996.4200134277344,
      "text": " bitterness springing up trouble you. I've kind of summed it up this way. Works"
    },
    {
      "id": 68,
      "start": 996.4200134277344,
      "end": 1003.7000122070312,
      "text": " without a walk leads to weariness. It's having the wrong order of the"
    },
    {
      "id": 69,
      "start": 1003.7000122070312,
      "end": 1007.6600036621094,
      "text": " sacrifices. It's trying to skip the burnt offering and going straight to the meat"
    },
    {
      "id": 70,
      "start": 1007.6600036621094,
      "end": 1011.7000122070312,
      "text": " offering and wondering why we don't have the peace of God in our life. It is"
    },
    {
      "id": 71,
      "start": 1011.7000122070312,
      "end": 1022.4200134277344,
      "text": " the order here. But I want you to notice a second detail of the sacrifices. And I"
    },
    {
      "id": 72,
      "start": 1022.4200134277344,
      "end": 1029.3800048828125,
      "text": " was struggling to find another O word, so I used operation, all right? But when that"
    },
    {
      "id": 73,
      "start": 1029.3800048828125,
      "end": 1033.6600036621094,
      "text": " offering was brought to the Lord, when the sacrifice was put on the altar, how"
    },
    {
      "id": 74,
      "start": 1033.6600036621094,
      "end": 1043.4600219726562,
      "text": " was it offered up to God? Did they wave their hands in the air and voila, it was"
    },
    {
      "id": 75,
      "start": 1043.4600219726562,
      "end": 1057.1799926757812,
      "text": " offered to the Lord? What's that? It was burned. It was burned. In Exodus 29 18,"
    },
    {
      "id": 76,
      "start": 1057.1799926757812,
      "end": 1063.02001953125,
      "text": " now shalt burn the whole ram upon the altar. Okay, it is a burnt offering. The"
    },
    {
      "id": 77,
      "start": 1063.02001953125,
      "end": 1067.7000122070312,
      "text": " part that was offered up to God was burned and it was offered up to him in"
    },
    {
      "id": 78,
      "start": 1067.7000122070312,
      "end": 1077.5400085449219,
      "text": " the smoke. What is that a picture of? Deuteronomy 4 24, the Bible says,"
    },
    {
      "id": 79,
      "start": 1077.5400085449219,
      "end": 1090.6199951171875,
      "text": " for the Lord thy God is a consuming fire, even a jealous God. Hmm. In Song of"
    },
    {
      "id": 80,
      "start": 1090.6199951171875,
      "end": 1098.1000061035156,
      "text": " Solomon 8 6, set me as a seal upon thine heart, as a seal upon thine arm. For"
    },
    {
      "id": 81,
      "start": 1098.1000061035156,
      "end": 1106.2200012207031,
      "text": " love is strong as death. Jealousy is cruel as the grave. The coals thereof are"
    },
    {
      "id": 82,
      "start": 1106.2200012207031,
      "end": 1113.4600219726562,
      "text": " coals of fire, which hath a most vehement flame. Many waters cannot quench"
    },
    {
      "id": 83,
      "start": 1113.4600219726562,
      "end": 1120.5800170898438,
      "text": " love, neither can the floods drown it. What is the Old Testament fire a picture"
    },
    {
      "id": 84,
      "start": 1120.5800170898438,
      "end": 1127.780029296875,
      "text": " of? If we're to offer spiritual sacrifices today, what is spiritual fire?"
    },
    {
      "id": 85,
      "start": 1129.3800048828125,
      "end": 1137.02001953125,
      "text": " It's love. Putting this together physically, Old Testament, if there was no"
    },
    {
      "id": 86,
      "start": 1137.02001953125,
      "end": 1141.2999877929688,
      "text": " fire, there was no offering. They would bring their sacrifice and plunk, they"
    },
    {
      "id": 87,
      "start": 1141.2999877929688,
      "end": 1145.7000122070312,
      "text": " would throw it on the altar. Everyone could look at it like, oh wow, did you see"
    },
    {
      "id": 88,
      "start": 1145.7000122070312,
      "end": 1153.9000244140625,
      "text": " what they brought? But it wasn't offered to the Lord until it was burned. New"
    },
    {
      "id": 89,
      "start": 1153.9000244140625,
      "end": 1161.5800170898438,
      "text": " Testament, 1st Corinthians 13 3, and though I bestow all my goods to feed the"
    },
    {
      "id": 90,
      "start": 1161.5800170898438,
      "end": 1168.3400268554688,
      "text": " poor, that sounds like a sacrifice to me. Plunk, there it is on the altar. And though"
    },
    {
      "id": 91,
      "start": 1168.3400268554688,
      "end": 1173.6199951171875,
      "text": " I give my body to be burned, that sounds like a sacrifice to me. Plunk, there's"
    },
    {
      "id": 92,
      "start": 1173.6199951171875,
      "end": 1184.4600219726562,
      "text": " another one. And have not charity, love, it profit me, it profiteth me nothing."
    },
    {
      "id": 93,
      "start": 1184.4600219726562,
      "end": 1190.780029296875,
      "text": " Here we have a picture, bringing things, doing things, all right? But there's no"
    },
    {
      "id": 94,
      "start": 1190.780029296875,
      "end": 1196.3400268554688,
      "text": " charity. We're not doing it with a love for God or a love for others. And the"
    },
    {
      "id": 95,
      "start": 1196.3400268554688,
      "end": 1199.780029296875,
      "text": " Bible says, you're not offering it to me. There's no fire."
    },
    {
      "id": 0,
      "start": 1199.780029296875,
      "end": 1204.0800294876099,
      "text": " fire, it's not coming up to me. Oh, you can bring it, plunk it, it's there on the altar"
    },
    {
      "id": 1,
      "start": 1204.0800294876099,
      "end": 1211.820029258728,
      "text": " and others can look at it, all right? But it's not being offered to me. So why is it"
    },
    {
      "id": 2,
      "start": 1211.820029258728,
      "end": 1217.2200298309326,
      "text": " that perhaps we ask the question, Lord, I'm doing all these things, why aren't you blessing"
    },
    {
      "id": 3,
      "start": 1217.2200298309326,
      "end": 1223.9800300598145,
      "text": " me? Well, number one, do we have the right order? And number two, how's your fire? You"
    },
    {
      "id": 4,
      "start": 1223.9800300598145,
      "end": 1234.3000297546387,
      "text": " know, we opened with a verse from Abraham and Isaac about Isaac asking his dad the question,"
    },
    {
      "id": 5,
      "start": 1234.3000297546387,
      "end": 1244.5800285339355,
      "text": " behold, the wood and the fire, but where's the sacrifice? I think, perhaps, I know the"
    },
    {
      "id": 6,
      "start": 1244.5800285339355,
      "end": 1250.780029296875,
      "text": " Lord often answers a question with a question as a way to teach. And I think maybe the question"
    },
    {
      "id": 7,
      "start": 1250.780029296875,
      "end": 1259.3000297546387,
      "text": " he would respond to us would be this, behold, the sacrifice and the wood, but where's the"
    },
    {
      "id": 8,
      "start": 1259.3000297546387,
      "end": 1266.8000259399414,
      "text": " fire? And that's the title for the message tonight, Where's the Fire? How is your fire"
    },
    {
      "id": 9,
      "start": 1266.8000259399414,
      "end": 1276.3000259399414,
      "text": " doing tonight? Is your passion for the Lord as hot as it should be? If it's not, would"
    },
    {
      "id": 10,
      "start": 1276.3000259399414,
      "end": 1281.6200256347656,
      "text": " you allow me to share with you three quick helps in closing tonight? What's the solution?"
    },
    {
      "id": 11,
      "start": 1281.6200256347656,
      "end": 1290.3000259399414,
      "text": " Perhaps our fire, our zeal, our love for the Lord has gone cold. What can we do? What are"
    },
    {
      "id": 12,
      "start": 1290.3000259399414,
      "end": 1297.5800323486328,
      "text": " some practical things we can do? Well, I have three quick helps, and I have the mnemonic."
    },
    {
      "id": 13,
      "start": 1297.5800323486328,
      "end": 1304.5400314331055,
      "text": " Hopefully this is cheesy enough for you to remember it, but it's hot, H-O-T, all right?"
    },
    {
      "id": 14,
      "start": 1304.5400314331055,
      "end": 1310.2600326538086,
      "text": " The first one is put on the helmet of salvation. What does it mean to put on the helmet of"
    },
    {
      "id": 15,
      "start": 1310.2600326538086,
      "end": 1315.380027770996,
      "text": " salvation? Well, if you put something on your head, the helmet, all right, that means you're"
    },
    {
      "id": 16,
      "start": 1315.380027770996,
      "end": 1322.1400299072266,
      "text": " thinking about it. What is it that we're to be thinking about every day? What is salvation?"
    },
    {
      "id": 17,
      "start": 1322.1400299072266,
      "end": 1329.8200225830078,
      "text": " It is the gift of God. It's a demonstration of His love for us. In 1 Thessalonians 5,"
    },
    {
      "id": 18,
      "start": 1329.8200225830078,
      "end": 1335.040023803711,
      "text": " 8, but let us who are of the day be sober, putting on the breastplate of faith and love,"
    },
    {
      "id": 19,
      "start": 1335.040023803711,
      "end": 1341.1400299072266,
      "text": " and for a helmet, the hope of salvation. In 1 John 4, 19, hopefully I'm not stealing any"
    },
    {
      "id": 20,
      "start": 1341.1400299072266,
      "end": 1349.9400329589844,
      "text": " of the pastor's verses coming up in 1 John, but he says, but the Bible says, we love Him"
    },
    {
      "id": 21,
      "start": 1349.9400329589844,
      "end": 1357.9000244140625,
      "text": " because He first loved us. My friends, if you're thoroughly convinced that God loves"
    },
    {
      "id": 22,
      "start": 1357.9000244140625,
      "end": 1365.1000366210938,
      "text": " you, it puts a zeal in your heart. It gives you a thirst and a hunger to want to know"
    },
    {
      "id": 23,
      "start": 1365.1000366210938,
      "end": 1373.4200286865234,
      "text": " more about Him. I know many of you may have remembered an old, I don't know, he was a"
    },
    {
      "id": 24,
      "start": 1373.4200286865234,
      "end": 1378.7000274658203,
      "text": " French guy, Victor Hugo, not a Christian, but at least he got it, the picture of love."
    },
    {
      "id": 25,
      "start": 1378.7000274658203,
      "end": 1385.1800231933594,
      "text": " He says, the greatest happiness of life is the conviction that we are loved, loved for"
    },
    {
      "id": 26,
      "start": 1385.1800231933594,
      "end": 1397.780029296875,
      "text": " ourselves, or rather, loved in spite of ourselves. We can quickly get discouraged, distracted,"
    },
    {
      "id": 27,
      "start": 1397.780029296875,
      "end": 1405.1000366210938,
      "text": " and we can lose sight of how much God loves us. And when that happens, boy, it's a downward"
    },
    {
      "id": 28,
      "start": 1405.1000366210938,
      "end": 1411.3800354003906,
      "text": " spiral, isn't it? What's the solution? Take some time. When you put the helmet of salvation"
    },
    {
      "id": 29,
      "start": 1411.3800354003906,
      "end": 1416.260025024414,
      "text": " on, you're reflecting, you're remembering all that God has done for us and what He's"
    },
    {
      "id": 30,
      "start": 1416.260025024414,
      "end": 1425.5800323486328,
      "text": " going to do for us. What did it cost God to come to the cross to die for you and for me?"
    },
    {
      "id": 31,
      "start": 1425.5800323486328,
      "end": 1431.4400329589844,
      "text": " It cost Him everything. He gave up heaven. He came to this earth, and He was forsaken"
    },
    {
      "id": 32,
      "start": 1431.4400329589844,
      "end": 1438.9400329589844,
      "text": " by all. And He hung on the cross, forsaken by all those who called Him friend and master."
    },
    {
      "id": 33,
      "start": 1438.9400329589844,
      "end": 1446.300033569336,
      "text": " They all fled. And if that wasn't enough, His own Father turned His back on Him. And"
    },
    {
      "id": 34,
      "start": 1446.300033569336,
      "end": 1453.9400329589844,
      "text": " there He hung, utterly and completely alone. And He did all of that, not for the angels,"
    },
    {
      "id": 35,
      "start": 1453.9400329589844,
      "end": 1461.5400390625,
      "text": " not for any of the animals, not for any other created being, but you and me. Do you feel"
    },
    {
      "id": 36,
      "start": 1461.5400390625,
      "end": 1471.1400146484375,
      "text": " special tonight? You should. You are loved. All right? How often do we forget that? We"
    },
    {
      "id": 37,
      "start": 1471.1400146484375,
      "end": 1476.9000244140625,
      "text": " need to be daily reminded of it. We need to be getting in God's Word and opening up the"
    },
    {
      "id": 38,
      "start": 1476.9000244140625,
      "end": 1480.7000427246094,
      "text": " love letter that He's given to us and remind ourselves how much He loves us. What's the"
    },
    {
      "id": 39,
      "start": 1480.7000427246094,
      "end": 1485.4600219726562,
      "text": " first thing that you can do to help rekindle that fire? Put the helmet of salvation on,"
    },
    {
      "id": 40,
      "start": 1485.4600219726562,
      "end": 1493.8200378417969,
      "text": " P-H. Number two, Obey. You know, nothing will cool our hearts faster than unrepentant"
    },
    {
      "id": 41,
      "start": 1493.8200378417969,
      "end": 1502.5000305175781,
      "text": " sin. The Bible says in Matthew 24, 12, and because iniquity shall abound, the love of"
    },
    {
      "id": 42,
      "start": 1502.5000305175781,
      "end": 1512.5400390625,
      "text": " many shall wax cold. What happens to the fire? It's cold. All right? Because of iniquity."
    },
    {
      "id": 43,
      "start": 1512.5400390625,
      "end": 1518.3800354003906,
      "text": " And in John 15, 10, if you keep my commandments, you shall abide in my love, even as I have"
    },
    {
      "id": 44,
      "start": 1518.3800354003906,
      "end": 1529.9000244140625,
      "text": " kept my Father's commandments and abide in His love. Obey. And the last one I have for"
    },
    {
      "id": 45,
      "start": 1529.9000244140625,
      "end": 1544.9000244140625,
      "text": " you, number T, it's often been said that love is spelled T-I-M-E, time. You will spend"
    },
    {
      "id": 46,
      "start": 1544.9000244140625,
      "end": 1550.8200378417969,
      "text": " time with those that you love. You'll spend time doing the things that you love. And the"
    },
    {
      "id": 47,
      "start": 1550.8200378417969,
      "end": 1558.4600219726562,
      "text": " more time that we spend with God, number one, the more that we will be like Him. The Bible"
    },
    {
      "id": 48,
      "start": 1558.4600219726562,
      "end": 1565.5400390625,
      "text": " says God is love. The more time that we spend in His Word, more time that we spend in prayer,"
    },
    {
      "id": 49,
      "start": 1565.5400390625,
      "end": 1571.3800354003906,
      "text": " we can't help it, you will start to become like the people you are next to. I see this,"
    },
    {
      "id": 50,
      "start": 1571.3800354003906,
      "end": 1576.4600219726562,
      "text": " you know, even it's kind of humorous, but some of the couples who've been together for"
    },
    {
      "id": 51,
      "start": 1576.4600219726562,
      "end": 1582.7000427246094,
      "text": " a long time, all right, they can't tell, but someone from the outside looking, they start"
    },
    {
      "id": 52,
      "start": 1582.7000427246094,
      "end": 1586.2000427246094,
      "text": " sounding like each other. They even start looking like each other. They have the same"
    },
    {
      "id": 53,
      "start": 1586.2000427246094,
      "end": 1593.1200256347656,
      "text": " facial expressions, same mannerisms. You know, do others see Christ in us? Are we spending"
    },
    {
      "id": 54,
      "start": 1593.1200256347656,
      "end": 1601.1200256347656,
      "text": " time with Him daily? If so, you can't help it. Love is going to come out of you. He says,"
    },
    {
      "id": 55,
      "start": 1601.1200256347656,
      "end": 1606.4400329589844,
      "text": " abide in me and I in you. As a branch cannot bear fruit of itself except it abide in the"
    },
    {
      "id": 56,
      "start": 1606.4400329589844,
      "end": 1615.6400146484375,
      "text": " vine, no more can ye except ye abide in me. It's not a decision. You know what? Jeff,"
    },
    {
      "id": 57,
      "start": 1615.6400146484375,
      "end": 1620.7200317382812,
      "text": " you're right. I need to be more loving. I've made the decision. I'm going to be more loving."
    },
    {
      "id": 58,
      "start": 1620.7200317382812,
      "end": 1625.2000427246094,
      "text": " It's going to last about as long as it takes for you to drive out onto the highway, all"
    },
    {
      "id": 59,
      "start": 1625.2000427246094,
      "end": 1629.2000427246094,
      "text": " right? We'll see how far that goes. Where does love come from? It doesn't come from"
    },
    {
      "id": 60,
      "start": 1629.2000427246094,
      "end": 1633.6000366210938,
      "text": " us. It comes from God. And if we're not spending time with Him every day, you're not going"
    },
    {
      "id": 61,
      "start": 1633.6000366210938,
      "end": 1638.7200317382812,
      "text": " to have the love of God within you. And you know, the more time that we spend with God,"
    },
    {
      "id": 62,
      "start": 1638.7200317382812,
      "end": 1645.1200256347656,
      "text": " not only do we become more like Him, but we become warmed when we're next to the fire."
    },
    {
      "id": 63,
      "start": 1645.1200256347656,
      "end": 1651.4000244140625,
      "text": " I'm reminded of the disciples on the road to Emmaus. You know what they said? And they"
    },
    {
      "id": 64,
      "start": 1651.4000244140625,
      "end": 1655.8800354003906,
      "text": " turned after the Lord had showed Himself to them and He disappeared. And they said one"
    },
    {
      "id": 65,
      "start": 1655.8800354003906,
      "end": 1662.4800415039062,
      "text": " to another, did not our hearts burn within us when He talked with us by the way and while"
    },
    {
      "id": 66,
      "start": 1662.4800415039062,
      "end": 1668.2400207519531,
      "text": " He opened us the Scriptures? My friends, you don't have to stand alone, cold and miserable"
    },
    {
      "id": 67,
      "start": 1668.2400207519531,
      "end": 1672.3200378417969,
      "text": " in this Christian life. God wants you to be near. Draw an eye to God and He will draw"
    },
    {
      "id": 68,
      "start": 1672.3200378417969,
      "end": 1678.2000427246094,
      "text": " an eye to you. He wants you to be warm. He wants you to be on fire. Spending time with"
    },
    {
      "id": 69,
      "start": 1678.2000427246094,
      "end": 1683.4800415039062,
      "text": " God and also spending time with others, you know, love is contagious. Fire is hot, it's"
    },
    {
      "id": 70,
      "start": 1683.4800415039062,
      "end": 1690.2400207519531,
      "text": " bright and it spreads. In Hebrews 10.24, and let us consider one another to provoke unto"
    },
    {
      "id": 71,
      "start": 1690.2400207519531,
      "end": 1695.4400329589844,
      "text": " love and to good works, not forsaking the assembling of ourselves together as the manner"
    },
    {
      "id": 72,
      "start": 1695.4400329589844,
      "end": 1704.1200256347656,
      "text": " of some is, but exhorting one another and so much the more as you see the day approaching."
    },
    {
      "id": 73,
      "start": 1704.1200256347656,
      "end": 1710.2400207519531,
      "text": " Are you encouraging one another? Are you praying for one another? I tell you what, you know,"
    },
    {
      "id": 74,
      "start": 1710.2400207519531,
      "end": 1715.2400512695312,
      "text": " it's such an encouragement, such a blessing just to get around another brother or sister,"
    },
    {
      "id": 75,
      "start": 1715.2400512695312,
      "end": 1719.4800415039062,
      "text": " whether it's even a phone call, whether it's to sit down and have a coffee and you just"
    },
    {
      "id": 76,
      "start": 1719.4800415039062,
      "end": 1728.8400268554688,
      "text": " share what God's doing in your life. It's like, wow, that was good, you know. My friends,"
    },
    {
      "id": 77,
      "start": 1728.8400268554688,
      "end": 1734.6400146484375,
      "text": " if you need that, so does your brother, so does your sister. You know, in conclusion"
    },
    {
      "id": 78,
      "start": 1734.6400146484375,
      "end": 1739.800048828125,
      "text": " tonight, God wants us to have life and to have it more abundantly. He wants our lives"
    },
    {
      "id": 79,
      "start": 1739.800048828125,
      "end": 1747.760009765625,
      "text": " to be overflowing with joy and peace and blessings. We will only experience those if our sacrifices"
    },
    {
      "id": 80,
      "start": 1747.760009765625,
      "end": 1756.4000244140625,
      "text": " are in the right order and are set aflame. How is your fire tonight? Does it need stoking?"
    },
    {
      "id": 81,
      "start": 1756.4000244140625,
      "end": 1764.52001953125,
      "text": " You know, a fire needs daily care. It's a daily walk. Apart from him will quickly grow"
    },
    {
      "id": 82,
      "start": 1764.52001953125,
      "end": 1769.7200317382812,
      "text": " cold. In order, do you have it in the right order? Have you skipped over the burnt offering?"
    },
    {
      "id": 83,
      "start": 1769.7200317382812,
      "end": 1775.5800170898438,
      "text": " Are there areas in your life that you haven't surrendered? You know, God isn't asking for"
    },
    {
      "id": 84,
      "start": 1775.5800170898438,
      "end": 1783.02001953125,
      "text": " all of our money or all of our time or all of our things. That's the meat offering. Those"
    },
    {
      "id": 85,
      "start": 1783.02001953125,
      "end": 1787.4200439453125,
      "text": " are things that we give back apart to him and we get to enjoy the rest. But there's"
    },
    {
      "id": 86,
      "start": 1787.4200439453125,
      "end": 1797.3400268554688,
      "text": " one thing that he will not share. The burnt offering was not shared. Matthew 22, 37, and"
    },
    {
      "id": 87,
      "start": 1797.3400268554688,
      "end": 1799.8200073242188,
      "text": " Jesus said unto him, Thou shalt love the Lord thy God."
    },
    {
      "id": 0,
      "start": 1799.8200073242188,
      "end": 1808.300006866455,
      "text": " with all thy heart, and with all thy soul, and with all thy mind. God wants all of"
    },
    {
      "id": 1,
      "start": 1808.300006866455,
      "end": 1817.9400081634521,
      "text": " our hearts to be consumed in flames of passion for Him. You know there's a song,"
    },
    {
      "id": 2,
      "start": 1817.9400081634521,
      "end": 1825.140007019043,
      "text": " is your all on the altar? The first verse says this, you have longed for sweet"
    },
    {
      "id": 3,
      "start": 1825.140007019043,
      "end": 1832.6600074768066,
      "text": " peace, and for faith to increase, and have earnestly, fervently prayed, but you"
    },
    {
      "id": 4,
      "start": 1832.6600074768066,
      "end": 1842.300006866455,
      "text": " cannot have rest or be perfectly blessed until all on the altar is laid. I pray"
    },
    {
      "id": 5,
      "start": 1842.300006866455,
      "end": 1849.700008392334,
      "text": " that's an encouragement or a blessing to you tonight, and I don't know how this"
    },
    {
      "id": 6,
      "start": 1849.700008392334,
      "end": 1852.6200065612793,
      "text": " normally goes, a little different tonight, but why don't we close in a word of"
    },
    {
      "id": 7,
      "start": 1852.6200065612793,
      "end": 1857.140007019043,
      "text": " prayer, and then I think Brother Dean, are you coming back up? Okay, all right,"
    },
    {
      "id": 8,
      "start": 1857.140007019043,
      "end": 1862.0200080871582,
      "text": " well let's just go ahead and go to Lord in prayer. Dear Lord, again I just want to"
    },
    {
      "id": 9,
      "start": 1862.0200080871582,
      "end": 1866.3000106811523,
      "text": " thank you for tonight. I want to thank you Lord for giving pastor and the"
    },
    {
      "id": 10,
      "start": 1866.3000106811523,
      "end": 1871.3400039672852,
      "text": " family safety as they were driving down lower to North Carolina. I pray that they"
    },
    {
      "id": 11,
      "start": 1871.3400039672852,
      "end": 1876.9400100708008,
      "text": " have a good time with the family down there, and bring them home safe, and Lord"
    },
    {
      "id": 12,
      "start": 1876.9400100708008,
      "end": 1883.3000106811523,
      "text": " I just want to thank you for speaking to my heart tonight, and Lord it is good"
    },
    {
      "id": 13,
      "start": 1883.3000106811523,
      "end": 1889.9800109863281,
      "text": " to be together. Lord, I just want to thank you for all that you do for us. I want to"
    },
    {
      "id": 14,
      "start": 1889.9800109863281,
      "end": 1893.9800109863281,
      "text": " thank you for the rest of this evening, and I pray that you'd be with the prayer"
    },
    {
      "id": 15,
      "start": 1893.9800109863281,
      "end": 1898.2200088500977,
      "text": " time to follow. In Jesus name I pray, amen."
    },
    {
      "id": 16,
      "start": 1898.3000106811523,
      "end": 1899.8200073242188,
      "text": " you"
    },
    {
      "id": 17,
      "start": 1900.2200088500977,
      "end": 1902.260009765625,
      "text": " you"
    },
    {
      "id": 18,
      "start": 1904.740005493164,
      "end": 1907.740005493164,
      "text": " Thank you."
    }
  ],
  "processed_at": "2025-04-17T00:44:26.076854"
}