{
  "video_id": "WhaPo-g3nqA",
  "text": "Number three, back to the book of 1 John, the book that we've been studying. We've been away for a couple of months, actually. And the book that we've been studying here on Sunday morning is our theme. Of course, the banners are back up. We had our missions banners up the last two Sundays, but walking in the light from 1 John 1 and verse number seven this morning will be in chapter number three, looking at verses four through 10. But let me just remind you, since it's been a while since our last lesson or message from this particular book, let me remind you of how we started 1 John chapter number three. And really, John reminds the readers, the recipients, he reminds us of our position in Christ. And you look at the first verse of 1 John chapter number three, and the Bible says, behold, what manner of love the Father hath bestowed upon us. Aren't you thankful for the love of God? And what a blessing to know that God so loved the world that he gave his only begotten son, that whosoever believeth in him should not perish, but have everlasting life. And then we understand not only did he declare his love, but he demonstrated his love. For the Bible says that God commendeth his love toward us, and that while we were yet sinners, Christ died for us in Romans five and verse number eight. So right at the beginning of this third chapter of the book of 1 John, we're immediately confronted with the love of God. Behold, what manner of love the Father hath bestowed upon us. Notice what he says, that we should be called the sons of God. Think about our position as his son, as his child. And we find that, of course, as we've mentioned many times as we've studied this particular book, the book of 1 John, the book is written to those that have trust at Christ as their personal savior, those who have been born again. In fact, we'll see that term used a couple of times in our message this morning. And we find here that when he says that we should be called the sons of God, if you've trusted the Lord Jesus Christ as your personal savior this morning, if you know for sure that heaven is your home, God tells us that we are adopted into his family and we are his sons, his children, and what an absolute blessing to be reminded of our position. He continues and he says, therefore, the world knoweth us not. Why? Because it knew him not. Now, immediately after he reminds the believers of the love that God has for us and our position in Christ, that we are the sons of God, he then begins to deal with this subject matter in verses two and three, really with regard to the expectation of the believer. Because I'm his child, because I'm his son, because I belong to him, we find that he says, now, beloved, now are we the sons of God? And it doth not yet appear what we shall be, but we know that. Remember, throughout this book, we read this word know and how we have the knowledge God does not want us to be ignorant. It says, we know that when he shall appear, we shall be like him. For we shall see him as he is. And every man that hath this hope in him purifies himself even as he is pure. And so he immediately addresses the expectation of the believer that he shall appear. And I'm so thankful, in fact, that in the preceding chapter in chapter two, in verse number 28, he uses that term of when he shall appear as well. And he says that we may have confidence and not be ashamed before him at his coming. And so we find the connection between the end of chapter two, the beginning of chapter number three, where we come to that third verse of 1 John chapter number three. And he says, listen, because we are the sons of God, because we have this expectation, it should have an impact in our lives and our behavior. He says, every man that hath this hope in him purifies himself even as he is pure. As we go further into chapter number three and looking at verses four through 10, our text of scripture this morning, we'll find that John is addressing and really providing for us another litmus test. And we'll get to that as we go through the message this morning. He's providing us with this contrast in the text of scripture between the one that doeth righteousness and the one that committeth sin. Now we understand as we've mentioned, really, as you start the book of 1 John in that first chapter, that we still have the flesh and we still have that old man, that sinful nature. I am thankful that as we have been born again, if you're saved this morning, you've been delivered from the penalty of sin. And according to the word of God, you've been delivered from the power of sin. But the reality is that we've not yet been delivered from the presence of sin. We know one day when we are with him, that we will be delivered from the very presence of sin. But as long as we're here upon this earth, we deal with sin. And we understand that the Bible does not teach, and we'll go through this passage of scripture this morning and deal with this. He's not dealing with this idea that some have given idea to or thought to in the past of reaching some place of sinless perfection. Rather, he's dealing with the behavior of a believer in the change because of who we are and what our expectation is. It's not possible that we're going to be sinless, but the reality is that we should sin less and less the closer we walk with the Lord. And we find that for the believer, that sin is not something that we can take joy in and something that we delight in, rather something that would cause us to regret immediately after so doing. As we look at this passage of scripture and we consider the impact of a believer, of the belief of a believer and how it impacts their life, we see it in our behavior here. Notice what he says at the beginning in verse number four. It says this, whosoever committeth sin transgresseth also the law. For sin is the transgression of the law. And ye know that he was manifested to take away our sins and in him is no sin. Whosoever abideth in him sinneth not. Whosoever sinneth hath not seen him, neither known him. Little children, let no man deceive you. He that doeth righteousness is righteous even as he is righteous. He that committed sin is of the devil, for the devil sinneth from the beginning. For this purpose, the Son of God was manifested that he might destroy the works of the devil. Whosoever is born of God doth not commit sin for his seed remaineth in him and he cannot sin because he is born of God. In this, the children of God are manifest and the children of the devil. Whosoever doeth not righteousness is not of God, neither he that loveth not his brother. You'll notice in the middle of verse number seven, actually the end of verse number seven, the Bible says he that doeth righteousness is righteous. And I've used that for our text this evening, or this morning for our title, for this passage of scripture, our message this morning. He that doeth righteousness is righteous. Several weeks ago on Sunday evening, I preached a message from the book of Romans. And as I preached that message from the book of Romans, I made this statement that they who have been declared righteous are to live righteous lives. And we understand that through salvation, and as he's writing to believers here, these that are called the sons of God, that we have been declared righteous. That's our position and what a joy to know that we have the imputed righteousness of the Lord Jesus Christ upon our account. And as we've been declared righteous, we are to live righteous lives. Now it's interesting, perhaps you saw the warning in verse number seven. It's of great interest to me that in the midst of this passage of scripture, that God gives us a warning. Notice the warning right there in verse number seven. John says, little children, let no man deceive you. Let no man deceive you. Now, unfortunately, as we would consider this thought of deception and we consider the thought of false teaching, we understand that all the way back here in the first century as God is using John to write this short epistle, that there were false teachers that were going about seeking to deceive individuals. And we find that still today there are false teachers that are running around that are seeking to deceive the masses. And we find that specifically with regard to the context of this passage of scripture this morning, that we would find that the deception is with regard to sin. There were many that would say, oh, don't worry about sin. Sin doesn't really matter. I beg to differ. I beg to differ. We find that yes, indeed, as we begin the third chapter of the book of 1 John, God's love is in focus. And I'm so thankful that God is love. This book declares that. But understand this morning that God never, God never sacrifices His holiness on the altar of love. Never. I'm thankful that our God is gracious. Indeed, His grace is amazing. But the reality is that the grace of God does not change the holiness of God. And there are many today that are seeking to deceive in the same manner in which these false teachers were seeking to deceive during the writing of the book of 1 John. And that was to say, oh, God is love, and God is gracious, and it doesn't really matter what you do. Do you remember what Paul said? As Paul was writing to the believers in Rome in Romans chapter four, chapter number 5, he mentions about the grace of God, and he says, but where sin abounded, grace did much more abound. And then he really is going to give an answer to a question that's not yet asked as he is writing under the inspiration of the Holy Spirit of God, and the Bible says in chapter number 6 of the book of Romans, what shall we say then? Shall we continue in sin that grace may abound? And the Bible says, God forbid. In the book of Jude, the Bible tells us that they turned the grace of God into lasciviousness. That's not a word that we use very often, but we understand that word means unbridled lust. They've turned the grace of God into lasciviousness. And that form of false teaching continues to be prevalent to this very day. There are people all around this globe that are giving a false teaching with regard to the truth of this book. I am thankful that God is love, but I've often mentioned, and we will mention as we continue through the book of John and see many references to the love of God, I have often mentioned that God's love can best be described as protective, not as permissive. So many people today want to define the love of God as being permissive. God loves you, do whatever you want to do. God's love is best described as protective. Is there a parent among us this morning that would say that they love their child? Of course. Are you going to let your child do whatever they want to do because you love them? That would be foolish, right? So your love for your children is a protective love, such is the case with God's love. I want you to remember what Peter said in 1 Peter 1, just a few pages over, and then we'll get right into the text of Scripture this morning. See, God is concerned about the behavior of His children. Our behavior matters to God. In 1 Peter 1, in verse 14, the Bible says, As obedient children, not fashioning yourselves according to the former lust and your ignorance, but as He which hath called you is holy, so be ye holy in all manner of conversation, because it is written, Be holy, for I am holy. See, we must understand that there's a balance within the Word of God, and His attributes, His character traits are always in perfect harmony. And we find that it is a popular message still even to this day to preach and to proclaim this God is love and do whatever you want to do, and you can get a great number of people because everything's just wishy-washy, you do whatever you want. But when you begin to preach and teach what the Word of God actually says and the truth of sanctification and the truth of our behavior, all of a sudden, people don't like that message so much. Nevertheless, it's true. And here we find as we look at the passage of Scripture, if you are taking notes, notice with me first of all that John speaks about sin. He speaks about sin. In verse number 4, notice what he says, Whosoever committeth sin transgresseth also the law. Notice what he says, For sin is the transgression of the law. It's a very simple statement that we find here in 1 John 3 and verse number 4 with regard to the definition or the description of sin. I would say this, as we look at verse number 4 and we understand that John speaks about sin, that we'd understand this morning that sin is awful. It is stated as being a transgression of the law, and we find that that literally means lawlessness. Lawlessness. And we find that here, as God is referring back to the truth of the Old Testament, we'd be familiar with the law even as we've studied the Old Testament, and we find that He's giving the clarity with regard to what is sin, and He speaks about sin. We understand this morning that the law, it reveals sin. In fact, Paul says this, If it had not been for the law, I would not have known sin, in Romans chapter number 7. But because the law says, and I look at my behavior, I find out that I'm a transgressor of God's law. And we find here this morning that sin is being spoken of. We know that sin has been dealt with earlier in the chapters of the book of 1 John. Remember, the Bible said this in 1 John chapter number 1 with regard to sin. He says if we say in verse number 8 that we have no sin, we deceive ourselves and the truth is not in us. If we confess our sins, He is faithful and just to forgive us our sins and to cleanse us from all unrighteousness. If we say that we've not sinned, we make Him a liar and His word is not in us. And then remember this truth of 1 John 2 in verse number 1, My little children, these things write I unto you that you sin not. That's the goal. Amen? However, I am so thankful for the entirety of verse number 1 of 1 John 2 because the goal is that we sin not. But have you found it in your life that you sin? The goal is to sin not. But the reality is that we sin. You may have sinned this morning. We probably did. Amen? And it says this, and if any man sin, we have an advocate with the Father, Jesus Christ the righteous. Perfect defense attorney. Amen? Every time the accuser of the brethren brings up charges against us, our advocate, Jesus, says, yes, He's guilty. He doesn't try to defend our innocence for we are guilty. But He says, I paid for it. Isn't that awesome? Yes, He's guilty, but it's under the blood. It's been paid for. We have an advocate with the Father. And we find here in 1 John chapter number 3 that He's speaking about sin. It is the transgression of the law. It is lawlessness. We find that the law reveals sin to us. Notice in the text of Scripture that the Bible teaches us that Satan himself is the author of sin. God is not the author of sin. Satan is the author of sin. Notice in verse number 8, He that committeth sin is of the devil. For the devil sinneth from the beginning. He said, I will be like the Most High. He wanted to be like God. He wanted to be God. We find that here the Scriptures tell us that Satan is the author of sin, and he that committeth sin is of the devil. For the devil sinneth from the beginning. You'll remember that Jesus said this during His earthly ministry as He's ministering there, and He mentions about those that, of course, the religious leaders of the day, and He speaks to them about their father, the devil. And He speaks this in John 8 and verse number 44, the year of your father, the devil, and the lust of your father you will do. He was a murderer from the beginning and a boat not in the truth. Why? Because there is no truth in Him. When He speaketh a lie, He speaketh of His own, for He is a liar and the father of it in John 8 and verse 44. So we see that John, He makes the statement, He speaks of sin, but I want you to notice very quickly that not only He doesn't stay there. He then speaks, number two, of our Savior. We have a wonderful Savior. And we consider this morning as we look at the text of Scripture what was accomplished on that cruel cross, what was accomplished at Calvary because of sin. We understand that it was sin that sent our Savior there, but we notice as we look at this text of Scripture that John quickly moves on and He begins to speak of our Savior, and we find in verse number five He reveals to us as He's speaking of our Savior that He was manifest, that He came for this purpose, notice, to take away our sins. Isn't that wonderful? Notice in verse number five, and ye know. Now I'm thankful for that again as we note that He's writing to believers, He's writing to these that have received the gospel, that have been saved, and He says, ye know, you have this knowledge, you know that He, Jesus, was manifested to take away our sins. And in Him is no sin. We understand that He is perfect. He is sinless. The just for the unjust. We find here that in this text of Scripture that John is saying that we had a perfect substitute. See, the reality is that I'm a sinful man and you are sinful people. I cannot pay for your sins and you cannot pay for my sins. But God in flesh, the Lord Jesus Christ, He was manifest, He came to the sin-cursed world, He left the glory of heaven, He lived in this wicked world, and He walked perfectly. He never sinned. And He went to that cruel cross and He bled and He died. Why? To take away our sins. He was buried in a borrowed tomb and He rose conquering death, sin, and the grave. He lives forevermore. He's coming again. We rejoice because we serve a risen Savior, and we find this morning that John is reminding his readers, he's reminding them that Jesus took away our sins, and we ought to rejoice in that. What can wash away my sin, the songwriter said? Nothing but the blood of Jesus. Amen? What can make me whole again? Nothing but the blood of Jesus. Oh precious is that fount. Aren't you so thankful for the blood of Christ that was shed to pay for the sin of mankind? You know, this morning sin is a universal condition that mankind has. It's universal. There's not a just man upon the face of the earth, for all have sinned and come short of the glory of God. Right? It's what the Word of God says. So sin is a universal condition. Every single human being that you see, that I see, has the same condition that we have. Sin. What makes me different? Mine's been forgiven. I know that He came. I have the knowledge. He came and He took away our sins. Wow, what joy. 2 Corinthians 5 verse 21 says that He, God, hath made Him, Christ, to be sin for us, who knew no sin, that we might be made the righteousness of God in Him. Man, what a transaction that took place. The songwriter said it's not in our songbook. Many of you might be familiar with it. The old account was settled long ago. The old account was settled. The transaction was completed. Jesus said it is finished. It was paid in full. He paid for our sins. I mentioned earlier, but there in 1 Peter chapter 3 and verse number 18, the Bible says, for Christ also hath once suffered for our sins, the just for the unjust, that He might bring us to God, being put to death in the flesh, but quickened by the Spirit. Notice not only as He speaks of our Savior here in 1 John chapter number 3, does He remind the recipients, does He remind us this morning that He took away our sins, that was accomplished at the cross of Calvary, but I want you to notice as well that He destroyed the works of the devil. Notice in verse number 8, the Bible says, He that committeth sin is of the devil, for the devil sinneth from the beginning. For this purpose, the Son of God was manifested, that He might destroy the works of the devil. Satan did everything he could do throughout history to prevent Messiah from coming and from going to that cruel cross. He did everything he could. You read in the Old Testament, you read about the various plots against the nation of Israel, you read against the attacks against the lineage, the line, you find that it's all an attack upon Messiah. You read about Haman's wicked plan in the book of Esther to annihilate the entirety of the Jewish race. Why? So that no Messiah could come. He tried to kill Him multiple times during His earthly ministry. You can read various portions in the Gospels where they tried to kill Him. Satan was behind it, no doubt. But He declares in John 17, the hour has come. It was time. And He goes to that cross. And I can almost see in my mind's eye that Satan begins to triumph, thinking he's won the victory. After he died and he was put in that borrowed tomb, they set a seal. Remember, they kept watch and they made it as sure as they could. But there was nothing that could keep them from rising and conquering sin, death, and the grave. He destroyed the works of the devil. And we understand as we look at this verse of Scripture and this truth that God is giving us with regard to the work that God did there at Calvary, and He's rendered this truth of destroying, it's rendered powerless. Notice what the Bible says, if you will, over in the book of Colossians in chapter number 2 and verse number 15 with regard to this truth of Christ destroying the works of the devil. In Colossians 2 and verse number 15, the Bible, I'll read verse 14 with it. Notice what He says here in verse number 14 of Colossians chapter number 2. He says this, blotting out the handwriting of ordinances that was against us, which was contrary to us, and took it out of the way, nailing it to His cross. And having spoiled principalities and powers, He made a show of them openly, triumphing over them in it. And then the book of Hebrews says this in Hebrews chapter number 2. Notice what the Word of God says there. In Hebrews chapter number 2 and verse number 14, He says this, for as much then as the children are partakers of flesh and blood, He also Himself likewise took part of the same, that through death He might destroy him that had the power of death. In case you don't know who that is, that is the devil, He says at the end of the verse. That way we'd have clarity and understanding. And so we find that Jesus, He came in the form of sinful man. He Himself was not sinful, but He took upon Himself the form of a servant, the form of man, came in the likeness of man, and He went, He humbled Himself, He went to that cruel cross, and we find that He not only took away our sins, but He destroyed the works of the devil. Can I say it this way, back in 1 John chapter 3, as John speaks of our Savior and what was accomplished there at Calvary, we find the truth of redemption. Notice what He says in verse number 9. He says this, whosoever is born of God doth not commit sin, for his seed remaineth in him, and he cannot sin because he is born of God. You see two references in verse number 9 to this thought of born of God. And when you think about this truth of born of God, we have in view here the second birth, the truth is Jesus said to Nicodemus, you must be born again. And we find that when we speak about being born again, we'd understand that we've used this terminology before that we all have a physical birth, but what's most important is whether we have a spiritual birth. To be born once is to die twice, because you'll die a physical death and you die a spiritual death, but to be born twice is to die just once, because you're born of the flesh and you're born of the Spirit, and you'll just die once, a fleshly death. The reality this morning is that as we understand the redemption that was made possible through the work at Christ at Calvary, that which was accomplished for us to be born again, he says here that we're born of God, but then notice this, for his seed remaineth in him, right in the middle of the verse in 1 John 3 and verse number 9, and it reminds us not only when we think about this second birth, the new seed, the new nature. We find that in 1 Peter chapter number 1, just a few pages over, I want you to remember what Peter said with regard to our redemption. In 1 Peter 1, beginning in verse number 18, Peter says this, for as much as you know that you were not redeemed with corruptible things as silver and gold from your vain conversation received by tradition from your fathers. Nope, no silver, no gold could redeem mankind, but, verse 19, with the precious blood of Christ, as of a lamb without blemish and without spot, who verily was foreordained before the foundation of the world, but was manifest in these last times, notice that phrase, for you, for you, who by him do believe in God that raised him up from the dead and gave him glory that your faith and hope might be in God, seeing you have purified your souls and obeying the truth through the spirit unto unfeigned love of the brethren, see that you love one another with a pure heart fervently, notice this in verse 23, being born again not of corruptible seed but of incorruptible, by the word of God which liveth and abideth forever. In 2 Peter 1 and verse number 4, notice what he says here with regard to this truth of redemption and being born again. He says this in 2 Peter 1 and verse number 4, whereby are given unto us exceeding great and precious promises that by these ye might be partakers, notice this, of the divine nature, having escaped the corruption that is in the world through lust. And as we've been born again, we see this seed that is mentioned in verse number 9 of 1 John 3 because we're born of God, his seed remaineth in us. understand here that we have been born again. We have this new seed, this new nature, this second birth. And so John speaks of sin. He speaks of our Savior. When he speaks of our Savior, he says, I want to remind you of what was accomplished at Calvary. I want to remind you why He came. And you know this, but I want to remind you that He came first to take away our sins. He came to destroy the works of the devil. He came to redeem mankind. The Bible says that the Son of Man came to seek and to save that which was lost. He's a seeking Savior. Listen, if you don't know the Lord Jesus Christ is your personal Savior this morning, He wants to save you. He wants to be your Savior. He wants to be your Redeemer. He loves you. He loves you beyond what you could ever imagine. Not only does He love you, but He died for you. He took your place, the perfect substitute. The atonement was made. You say, I'm going to try to figure it out myself. You could never pay the debt that you owe. It's absolutely impossible. We are not redeemed with silver and gold as we read there in 1 Peter chapter 2. We understand in chapter 1, excuse me, in verse 18, we understand that it's not by works of righteousness which we have done. It's according to His mercy that He hath begotten us. For by grace are you saved through faith and that not of yourselves. It is the gift of God, not of works, lest any man should boast. And this morning the plan of redemption that we so hold dear is being reminded to the believers here that John is writing to and to us as well this morning. So He speaks of sin, He speaks of our Savior, He then speaks of our sanctification. Notice in the text of Scripture, we find that John begins to address the subject of sanctification. It's once again necessary for us to point out as we did, we saw this first in 1 John chapter 2 verses 3 through 6, and as we looked at that passage of Scripture, I took some time to explain to you the verb tense in these particular verses, and we see it again in our passage of Scripture before us this morning. Sometimes it's challenging to get the sense of the verb, but we find here that in this passage of Scripture, just as it was in 1 John chapter 2 verses 3 through 6, that the conjugation of the verb indicates an ongoing action. And it's important for us to understand that because He says here, whosoever abideth in Him sinneth not. So some would take and say, okay, well that means you could never commit a sin. But it's talking about this because of the conjugation of the verb, it indicates that ongoing action, that lifestyle, that behavior that is prevalent. And so He says, as He begins to speak about our sanctification, I want you to see first of all that He immediately deals with the subject of abiding in verse number 6. Whosoever abideth in Him. Now think about John writing these words. John the apostle, he heard the Lord Jesus Christ speak in John 15 with regard to the truth of abide in me. And we find here that John immediately addresses the subject of abiding and he says this, that whosoever abideth in Him sinneth not, whosoever sinneth hath not seen Him, neither known Him. Little children, let no man deceive you. He that doeth righteousness is righteous, even as He is righteous. He that committed sin is of the devil, for the devil sinneth from the beginning. Skip down if you will to verse number 9. Whosoever is born of God doth not commit sin, for his seed remaineth in him, and he cannot sin because he is born of God. In this the children of God are manifest, and the children of the devil. Whosoever doeth not righteousness is not of God, neither he that loveth not his brother. And really that's a segue into the next text of scripture that we'll study next week with regard to loving the brethren there at the end of verse number 10. But we find here this morning that both salvation and sanctification are of Christ. It's of Christ. Sometimes what happens is we are saved, for by grace we are saved through faith. We understand that salvation is all of Christ. Right? There's nothing I can do. I can't save myself. But somehow we get to the point that we think sanctification is about me. And I'm trying, trying, trying, this process of sanctification, and I'm really trying in my own flesh. Do you remember what Paul said in Romans chapter number 7? He said, the things that I would, I do not. The things that I would not, that I do. Right? Paul's saying, I got this struggle going on, and I have this difficulty and all of this that's going on. And he says, who shall deliver me? And he says, I thank God through Christ Jesus. Listen, sanctification is about the work of the Holy Spirit of God, the work of Christ in us. It's not me trying, it's me yielding. Right? And as I yield my members, as he says there in Romans 6, 7, and 8, and you read those passages of Scripture and you see how Paul is really giving a great dissortation on the subject of sanctification there in the middle of the book of Romans, here we find that John is just simply talking about stating here quickly the subject of sanctification and the work that Christ does in us. Noah Webster in his 1828 Webster's Dictionary defines sanctification this way, the act of God's grace by which the affections of men are purified or alienated, it says this, from sin and the world and exalted to a supreme love to God. That's a great definition. Let me read it one more time. The act of God's grace by which the affections of men are purified or alienated from sin and the world and exalted to a supreme love to God. That helps us understand the passage of Scripture and what's being dealt with here with the subject of sanctification and the work that Christ is doing in us. Note that he, Noah Webster, in fact, when you look at that dictionary, you'll see so many references to the Word of God. And you find here that he speaks about God's grace by which the affections of men are purified. Remember what he said in verse number 3, and every man that hath this hope in him purifieth himself even as he is pure. He says this, or alienate it from sin and the world. We see the discussion of sin here in this text of Scripture. And we find that as we look here at this passage, and again, note a litmus test, if you will, that John provides to his readers. We've seen this in previous texts of Scripture, and we understand that these tests are really to be self-administered. We like to give the test to other people. As I said to someone, I'd rather evaluate your life and you'd rather evaluate my life because the process of self-evaluation is not very pleasant. But the Scriptures say, but let a man examine himself. Amen? And so we find here that here what is being contrasted is really the children of God versus the children of the devil. Look in verse number 10. It says, in this the children of God are manifest and the children of the devil. So we see on one side the children of God, on the other the children of the devil. He says that they're manifest. That means to be plainly recognized or known. In this, the children of God are manifest and the children of the devil. So here's the litmus test. Again, the verb tense is important for us to understand because it carries with it the idea of a continual or habitual practice. It's not saying that a believer will never sin, but sin is not going to be the pattern in our lives. Why? Because the Holy Spirit of God lives within us. Listen, it's not saying that a sinning person isn't going to, excuse me, let me say it this way. It's not suggesting that a lost person is never going to, by happenstance, fulfill something in the law. Right? How many times I've heard people say, are you a sinner? I've never murdered anybody. Well, I mean, I'm glad you didn't murder somebody. That doesn't mean that you're not a sinner. Right? And we find here that the reality is that, listen, lost men occasionally are going to obey the law. So it's not saying by their occasional obedience, their occasional righteousness, that that makes them a child of God. In like way, or in the same way, it does not mean that the believer, the child of God, that has the occasional sin is not saved. It's the process of sanctification. It's the truth that God has given to us. Really, Jesus said it this way, and we're familiar with this truth in Matthew 7 and verse number 20, when He said, wherefore, by their fruits ye shall know them. Ye shall know them. Listen, if you're a child of God this morning, if you've been born again, the Lord has put a desire in you to please Him. To have seen Him is to love Him. To love Him is to want to please Him. And to please Him, there's no room for sin. Right? Again, I'm not saying, and neither is John, the Word of God is not saying that we're never going to sin because we understand that we're going to sin. And if we do, we have an advocate with the Father, Jesus Christ the righteous. If we confess our sins, He is faithful and just to forgive us and to cleanse us from all unrighteousness. And so He's not suggesting that we're never going to sin. He's simply saying, it's not going to be a pattern in your life. It's not going to be habitual, continual. It's not going to be that you're going to have this enjoying sin for all the days of your life. It's not this idea, as some have said, that, well, I got saved. I got my get out of the fire free kind of card and now I can live however I want to live. That's not real salvation. Because God does a work in us. We spoke about this in 1 John chapter number 2. We talked about this. Notice if you will, go back there just for a moment in verse number 5. But whoso keepeth his word in him verily is the love of God perfected. Hereby know we that we are in him. And we looked at that verse of Scripture and we talked about the work that God is doing in us. Something amazing happens when we get saved. The Holy Spirit of God lives within us. And it begins to work in our hearts and our lives. All of a sudden, those things that we did, we have less of a desire to do them. Why? Because the Holy Spirit of God begins to convict us. The Holy Spirit of God begins to convict us that that behavior is not pleasing to God. And as we yield to the Spirit of God in our lives, as we yield our lives to him as we grow is this process of sanctification. I'm thankful for positional sanctification, but the reality is that we're dealing with progressive sanctification. We're dealing with this walk with Christ all the days of our lives. And this continual growth, and the closer I get to him, the less I want to displease him. I don't want to do that which is displeasing to my God. I don't want to be engaged in sinful behavior. So when he says, whosoever abideth in him sinneth not, I want you to think about this in verse number 6. As you're abiding in him, as you're walking with him, as you're in daily fellowship with him, does that not have an impact on your behavior? Let me illustrate it simply by talking about a child this morning, a child that is in your presence. Parents, your children are there with you. They're in your presence. You're walking with them. How does your presence affect their behavior? Probably positively, right? Normally, listen, I never took a cookie from the cookie jar when my mom was watching me. That'd just be dumb. But when she wasn't watching, cookies are available, right? Why? Because she wasn't present. I use Zachary as an example. I use Zachary as an illustration. He was eating a donut yesterday and he was trying to hide it. It was so cute. He was trying to hide eating his donut, but he had chocolate all over the side of his mouth. Right? Didn't he? I said, well, Zachary, if you're going to hide that donut, you better get rid of that chocolate. He wasn't hiding it from Pierre and Kimberly, just for the record. They knew he was eating it. But the reality is that when we're abiding in him, it's going to impact our behavior. Why? Because we're living in his presence. I believe that's what we find the secret in the life of Joseph. When you go back to the book of Genesis and you read the life of Joseph, he's in a foreign land, in a foreign place, a different culture, a different language. He's been sold. He's been, I mean, it's a mess of what's happened. And day by day, Potiphar's wife comes and says, lie with me. But I believe with all of my heart that Joseph lived in the presence of God. Because when Potiphar's wife said, perfect opportunity, nobody's here. He said, how can I sin and do this great wickedness against God? He lived in the presence of God. From a New Testament perspective, we could say that he was abiding. And when we're abiding in him, when we're walking with Christ, when we're living in his presence, it's going to impact our behavior. Can I remind you this morning that Jesus is always with you? It just needs to be a reminder for us that we're in his presence. We're abiding in him. How many times have we driven down the highway and people are just cruising along? I mean, just flying. I've said to the kids, Joseph just got his permit on Wednesday. I've said to all of them as we've driven over the years, man, I'm going seven miles an hour over the speed limit and these people are just flying past me like I'm sitting still. Right? You guys experienced that, right? But then all of a sudden they see one of those police cars. Have you seen it? What happens? Everyone wants to hit their brake and get over. Now my understanding is that they've already seen that you're speeding before you saw them. Is that right? That's right. Their LIDAR is better than your eyesight. But why do people behave that way? Because the presence of that law enforcement officer is a reminder that they're breaking the law and they need to correct their behavior. Right? We see it in life. But spiritually speaking, we need to abide in him. And as we abide in him, as we think about this truth of sanctification, we're going to, no, not be sinless, but we're going to sin less and less. Why? Because I'm living in his presence. This morning, when you think of sin, that was the first thing that John spoke of. Remember that sin is awful. The second thing, when you think of our Savior, rejoice in what was accomplished. Taking our sins out of the way, destroying the works of the devil, providing redemption. And when you think of sanctification, remember this morning that it requires abiding. So often we're trying to do it ourselves. We can't save ourselves. And we need God's grace in this area of sanctification. Because the more I try, the more frustrated I become. And the more I echo the words of Paul, the things that I would, I do not. And the things that I would not, that I do. Let's pray together. Father, we love you this morning. We thank you for loving us. We thank you for the Word of God. We thank you for the passage of Scripture. And God, I pray that you'd help us, those of us that are saved, that have been born again, declared righteous, that we would live righteous lives. I pray this morning that if there's one that's not sure of heaven, God, I pray that today would be the day of their salvation, that they would understand that you loved them, that you died for them, that you rose again conquering sin, death, and the grave. The only way to heaven is through the Lord Jesus Christ. Neither is there salvation in any other, for there's no other name given among men whereby we must be saved. God, I pray that if there's one not sure of heaven, they'd get that settled this morning. Father, for those of us that are your children, would you help us in this process, this process of sanctification? I'm thankful that salvation is the miracle of a moment, but as someone said, sanctification is the process of a lifetime. God, would you help us to abide in you? Would you help us to yield ourselves to thee? God, would you help us to walk daily in your presence so that we would sin less and less, that we would do righteousness, that we'd live and lead lives that are pleasing in thy sight? Well, thank you for the work that you'll do. For it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.0,
      "text": " Number three, back to the book of 1 John,"
    },
    {
      "id": 1,
      "start": 3.0,
      "end": 4.320000171661377,
      "text": " the book that we've been studying."
    },
    {
      "id": 2,
      "start": 4.320000171661377,
      "end": 6.639999866485596,
      "text": " We've been away for a couple of months, actually."
    },
    {
      "id": 3,
      "start": 6.639999866485596,
      "end": 8.520000457763672,
      "text": " And the book that we've been studying here"
    },
    {
      "id": 4,
      "start": 8.520000457763672,
      "end": 10.380000114440918,
      "text": " on Sunday morning is our theme."
    },
    {
      "id": 5,
      "start": 10.380000114440918,
      "end": 12.539999961853027,
      "text": " Of course, the banners are back up."
    },
    {
      "id": 6,
      "start": 12.539999961853027,
      "end": 14.359999656677246,
      "text": " We had our missions banners up the last two Sundays,"
    },
    {
      "id": 7,
      "start": 14.359999656677246,
      "end": 16.68000030517578,
      "text": " but walking in the light from 1 John 1"
    },
    {
      "id": 8,
      "start": 16.68000030517578,
      "end": 18.239999771118164,
      "text": " and verse number seven this morning"
    },
    {
      "id": 9,
      "start": 18.239999771118164,
      "end": 19.920000076293945,
      "text": " will be in chapter number three,"
    },
    {
      "id": 10,
      "start": 19.920000076293945,
      "end": 21.799999237060547,
      "text": " looking at verses four through 10."
    },
    {
      "id": 11,
      "start": 21.799999237060547,
      "end": 24.6200008392334,
      "text": " But let me just remind you, since it's been a while"
    },
    {
      "id": 12,
      "start": 24.6200008392334,
      "end": 28.1200008392334,
      "text": " since our last lesson or message from this particular book,"
    },
    {
      "id": 13,
      "start": 28.1200008392334,
      "end": 30.15999984741211,
      "text": " let me remind you of how we started"
    },
    {
      "id": 14,
      "start": 30.15999984741211,
      "end": 32.040000915527344,
      "text": " 1 John chapter number three."
    },
    {
      "id": 15,
      "start": 32.040000915527344,
      "end": 35.63999938964844,
      "text": " And really, John reminds the readers, the recipients,"
    },
    {
      "id": 16,
      "start": 35.63999938964844,
      "end": 39.060001373291016,
      "text": " he reminds us of our position in Christ."
    },
    {
      "id": 17,
      "start": 39.060001373291016,
      "end": 40.7599983215332,
      "text": " And you look at the first verse"
    },
    {
      "id": 18,
      "start": 40.7599983215332,
      "end": 42.099998474121094,
      "text": " of 1 John chapter number three,"
    },
    {
      "id": 19,
      "start": 42.099998474121094,
      "end": 42.939998626708984,
      "text": " and the Bible says,"
    },
    {
      "id": 20,
      "start": 42.939998626708984,
      "end": 46.2400016784668,
      "text": " behold, what manner of love the Father"
    },
    {
      "id": 21,
      "start": 46.2400016784668,
      "end": 48.15999984741211,
      "text": " hath bestowed upon us."
    },
    {
      "id": 22,
      "start": 48.15999984741211,
      "end": 50.63999938964844,
      "text": " Aren't you thankful for the love of God?"
    },
    {
      "id": 23,
      "start": 50.63999938964844,
      "end": 54.36000061035156,
      "text": " And what a blessing to know that God so loved the world"
    },
    {
      "id": 24,
      "start": 54.36000061035156,
      "end": 56.0,
      "text": " that he gave his only begotten son,"
    },
    {
      "id": 25,
      "start": 56.0,
      "end": 58.5,
      "text": " that whosoever believeth in him should not perish,"
    },
    {
      "id": 26,
      "start": 58.5,
      "end": 60.0,
      "text": " but have everlasting life."
    },
    {
      "id": 27,
      "start": 60.0,
      "end": 63.0,
      "text": " And then we understand not only did he declare his love,"
    },
    {
      "id": 28,
      "start": 63.0,
      "end": 65.36000061035156,
      "text": " but he demonstrated his love."
    },
    {
      "id": 29,
      "start": 65.36000061035156,
      "end": 68.83999633789062,
      "text": " For the Bible says that God commendeth his love toward us,"
    },
    {
      "id": 30,
      "start": 68.83999633789062,
      "end": 70.68000030517578,
      "text": " and that while we were yet sinners,"
    },
    {
      "id": 31,
      "start": 70.68000030517578,
      "end": 74.16000366210938,
      "text": " Christ died for us in Romans five and verse number eight."
    },
    {
      "id": 32,
      "start": 74.16000366210938,
      "end": 76.12000274658203,
      "text": " So right at the beginning of this third chapter"
    },
    {
      "id": 33,
      "start": 76.12000274658203,
      "end": 77.5199966430664,
      "text": " of the book of 1 John,"
    },
    {
      "id": 34,
      "start": 77.5199966430664,
      "end": 80.5999984741211,
      "text": " we're immediately confronted with the love of God."
    },
    {
      "id": 35,
      "start": 80.5999984741211,
      "end": 83.16000366210938,
      "text": " Behold, what manner of love"
    },
    {
      "id": 36,
      "start": 83.16000366210938,
      "end": 84.80000305175781,
      "text": " the Father hath bestowed upon us."
    },
    {
      "id": 37,
      "start": 84.80000305175781,
      "end": 86.12000274658203,
      "text": " Notice what he says,"
    },
    {
      "id": 38,
      "start": 86.12000274658203,
      "end": 91.12000274658203,
      "text": " that we should be called the sons of God."
    },
    {
      "id": 39,
      "start": 91.36000061035156,
      "end": 94.68000030517578,
      "text": " Think about our position as his son, as his child."
    },
    {
      "id": 40,
      "start": 94.68000030517578,
      "end": 96.19999694824219,
      "text": " And we find that, of course,"
    },
    {
      "id": 41,
      "start": 96.19999694824219,
      "end": 97.72000122070312,
      "text": " as we've mentioned many times"
    },
    {
      "id": 42,
      "start": 97.72000122070312,
      "end": 99.4800033569336,
      "text": " as we've studied this particular book,"
    },
    {
      "id": 43,
      "start": 99.4800033569336,
      "end": 100.80000305175781,
      "text": " the book of 1 John,"
    },
    {
      "id": 44,
      "start": 100.80000305175781,
      "end": 104.08000183105469,
      "text": " the book is written to those that have trust at Christ"
    },
    {
      "id": 45,
      "start": 104.08000183105469,
      "end": 105.68000030517578,
      "text": " as their personal savior,"
    },
    {
      "id": 46,
      "start": 105.68000030517578,
      "end": 107.22000122070312,
      "text": " those who have been born again."
    },
    {
      "id": 47,
      "start": 107.22000122070312,
      "end": 109.5199966430664,
      "text": " In fact, we'll see that term used a couple of times"
    },
    {
      "id": 48,
      "start": 109.5199966430664,
      "end": 111.08000183105469,
      "text": " in our message this morning."
    },
    {
      "id": 49,
      "start": 111.08000183105469,
      "end": 112.5,
      "text": " And we find here that when he says"
    },
    {
      "id": 50,
      "start": 112.5,
      "end": 114.76000213623047,
      "text": " that we should be called the sons of God,"
    },
    {
      "id": 51,
      "start": 115.5999984741211,
      "end": 117.0,
      "text": " if you've trusted the Lord Jesus Christ"
    },
    {
      "id": 52,
      "start": 117.0,
      "end": 119.05999755859375,
      "text": " as your personal savior this morning,"
    },
    {
      "id": 53,
      "start": 119.05999755859375,
      "end": 121.63999938964844,
      "text": " if you know for sure that heaven is your home,"
    },
    {
      "id": 54,
      "start": 121.63999938964844,
      "end": 125.16000366210938,
      "text": " God tells us that we are adopted into his family"
    },
    {
      "id": 55,
      "start": 125.16000366210938,
      "end": 128.32000732421875,
      "text": " and we are his sons, his children,"
    },
    {
      "id": 56,
      "start": 128.32000732421875,
      "end": 131.0,
      "text": " and what an absolute blessing"
    },
    {
      "id": 57,
      "start": 131.0,
      "end": 134.75999450683594,
      "text": " to be reminded of our position."
    },
    {
      "id": 58,
      "start": 134.75999450683594,
      "end": 135.72000122070312,
      "text": " He continues and he says,"
    },
    {
      "id": 59,
      "start": 135.72000122070312,
      "end": 138.1999969482422,
      "text": " therefore, the world knoweth us not."
    },
    {
      "id": 60,
      "start": 138.1999969482422,
      "end": 140.24000549316406,
      "text": " Why? Because it knew him not."
    },
    {
      "id": 61,
      "start": 140.24000549316406,
      "end": 143.24000549316406,
      "text": " Now, immediately after he reminds the believers"
    },
    {
      "id": 62,
      "start": 143.24000549316406,
      "end": 145.1199951171875,
      "text": " of the love that God has for us"
    },
    {
      "id": 63,
      "start": 145.1199951171875,
      "end": 146.9600067138672,
      "text": " and our position in Christ,"
    },
    {
      "id": 64,
      "start": 146.9600067138672,
      "end": 148.55999755859375,
      "text": " that we are the sons of God,"
    },
    {
      "id": 65,
      "start": 148.55999755859375,
      "end": 152.0399932861328,
      "text": " he then begins to deal with this subject matter"
    },
    {
      "id": 66,
      "start": 152.0399932861328,
      "end": 153.47999572753906,
      "text": " in verses two and three,"
    },
    {
      "id": 67,
      "start": 153.47999572753906,
      "end": 157.44000244140625,
      "text": " really with regard to the expectation of the believer."
    },
    {
      "id": 68,
      "start": 157.44000244140625,
      "end": 160.16000366210938,
      "text": " Because I'm his child, because I'm his son,"
    },
    {
      "id": 69,
      "start": 160.16000366210938,
      "end": 162.1999969482422,
      "text": " because I belong to him,"
    },
    {
      "id": 70,
      "start": 162.1999969482422,
      "end": 163.39999389648438,
      "text": " we find that he says,"
    },
    {
      "id": 71,
      "start": 163.39999389648438,
      "end": 168.24000549316406,
      "text": " now, beloved, now are we the sons of God?"
    },
    {
      "id": 72,
      "start": 168.24000549316406,
      "end": 171.10000610351562,
      "text": " And it doth not yet appear what we shall be,"
    },
    {
      "id": 73,
      "start": 171.10000610351562,
      "end": 172.32000732421875,
      "text": " but we know that."
    },
    {
      "id": 74,
      "start": 173.16000366210938,
      "end": 174.39999389648438,
      "text": " Remember, throughout this book,"
    },
    {
      "id": 75,
      "start": 174.39999389648438,
      "end": 176.83999633789062,
      "text": " we read this word know and how we have the knowledge"
    },
    {
      "id": 76,
      "start": 176.83999633789062,
      "end": 178.9600067138672,
      "text": " God does not want us to be ignorant."
    },
    {
      "id": 77,
      "start": 178.9600067138672,
      "end": 182.72000122070312,
      "text": " It says, we know that when he shall appear,"
    },
    {
      "id": 78,
      "start": 183.72000122070312,
      "end": 185.72000122070312,
      "text": " we shall be like him."
    },
    {
      "id": 79,
      "start": 185.72000122070312,
      "end": 189.72000122070312,
      "text": " For we shall see him as he is."
    },
    {
      "id": 80,
      "start": 189.72000122070312,
      "end": 191.60000610351562,
      "text": " And every man that hath this hope in him"
    },
    {
      "id": 81,
      "start": 191.60000610351562,
      "end": 195.0399932861328,
      "text": " purifies himself even as he is pure."
    },
    {
      "id": 82,
      "start": 195.0399932861328,
      "end": 197.52000427246094,
      "text": " And so he immediately addresses the expectation"
    },
    {
      "id": 83,
      "start": 197.52000427246094,
      "end": 200.1999969482422,
      "text": " of the believer that he shall appear."
    },
    {
      "id": 84,
      "start": 200.1999969482422,
      "end": 201.83999633789062,
      "text": " And I'm so thankful, in fact,"
    },
    {
      "id": 85,
      "start": 202.32000732421875,
      "end": 204.0399932861328,
      "text": " that in the preceding chapter in chapter two,"
    },
    {
      "id": 86,
      "start": 204.0399932861328,
      "end": 205.1199951171875,
      "text": " in verse number 28,"
    },
    {
      "id": 87,
      "start": 205.1199951171875,
      "end": 208.52000427246094,
      "text": " he uses that term of when he shall appear as well."
    },
    {
      "id": 88,
      "start": 208.52000427246094,
      "end": 210.39999389648438,
      "text": " And he says that we may have confidence"
    },
    {
      "id": 89,
      "start": 210.39999389648438,
      "end": 214.44000244140625,
      "text": " and not be ashamed before him at his coming."
    },
    {
      "id": 90,
      "start": 214.44000244140625,
      "end": 216.0800018310547,
      "text": " And so we find the connection"
    },
    {
      "id": 91,
      "start": 216.0800018310547,
      "end": 217.44000244140625,
      "text": " between the end of chapter two,"
    },
    {
      "id": 92,
      "start": 217.44000244140625,
      "end": 219.0800018310547,
      "text": " the beginning of chapter number three,"
    },
    {
      "id": 93,
      "start": 219.0800018310547,
      "end": 220.9199981689453,
      "text": " where we come to that third verse"
    },
    {
      "id": 94,
      "start": 220.9199981689453,
      "end": 222.55999755859375,
      "text": " of 1 John chapter number three."
    },
    {
      "id": 95,
      "start": 222.55999755859375,
      "end": 225.44000244140625,
      "text": " And he says, listen, because we are the sons of God,"
    },
    {
      "id": 96,
      "start": 225.44000244140625,
      "end": 228.8800048828125,
      "text": " because we have this expectation,"
    },
    {
      "id": 97,
      "start": 228.8800048828125,
      "end": 233.36000061035156,
      "text": " it should have an impact in our lives and our behavior."
    },
    {
      "id": 98,
      "start": 233.36000061035156,
      "end": 237.55999755859375,
      "text": " He says, every man that hath this hope in him"
    },
    {
      "id": 99,
      "start": 237.55999755859375,
      "end": 242.55999755859375,
      "text": " purifies himself even as he is pure."
    },
    {
      "id": 100,
      "start": 243.0399932861328,
      "end": 246.0399932861328,
      "text": " As we go further into chapter number three"
    },
    {
      "id": 101,
      "start": 246.0399932861328,
      "end": 248.0,
      "text": " and looking at verses four through 10,"
    },
    {
      "id": 102,
      "start": 248.0,
      "end": 250.39999389648438,
      "text": " our text of scripture this morning,"
    },
    {
      "id": 103,
      "start": 250.39999389648438,
      "end": 253.32000732421875,
      "text": " we'll find that John is addressing"
    },
    {
      "id": 104,
      "start": 253.32000732421875,
      "end": 256.1600036621094,
      "text": " and really providing for us another litmus test."
    },
    {
      "id": 105,
      "start": 256.1600036621094,
      "end": 257.2799987792969,
      "text": " And we'll get to that"
    },
    {
      "id": 106,
      "start": 257.2799987792969,
      "end": 259.20001220703125,
      "text": " as we go through the message this morning."
    },
    {
      "id": 107,
      "start": 259.20001220703125,
      "end": 261.44000244140625,
      "text": " He's providing us with this contrast"
    },
    {
      "id": 108,
      "start": 261.44000244140625,
      "end": 262.9599914550781,
      "text": " in the text of scripture"
    },
    {
      "id": 109,
      "start": 262.9599914550781,
      "end": 265.1600036621094,
      "text": " between the one that doeth righteousness"
    },
    {
      "id": 110,
      "start": 265.1600036621094,
      "end": 267.6000061035156,
      "text": " and the one that committeth sin."
    },
    {
      "id": 111,
      "start": 267.6000061035156,
      "end": 269.239990234375,
      "text": " Now we understand as we've mentioned,"
    },
    {
      "id": 112,
      "start": 269.239990234375,
      "end": 271.239990234375,
      "text": " really, as you start the book of 1 John"
    },
    {
      "id": 113,
      "start": 271.239990234375,
      "end": 273.0799865722656,
      "text": " in that first chapter,"
    },
    {
      "id": 114,
      "start": 273.0799865722656,
      "end": 274.8399963378906,
      "text": " that we still have the flesh"
    },
    {
      "id": 115,
      "start": 274.8399963378906,
      "end": 279.32000732421875,
      "text": " and we still have that old man, that sinful nature."
    },
    {
      "id": 116,
      "start": 279.32000732421875,
      "end": 281.8800048828125,
      "text": " I am thankful that as we have been born again,"
    },
    {
      "id": 117,
      "start": 281.8800048828125,
      "end": 283.4599914550781,
      "text": " if you're saved this morning,"
    },
    {
      "id": 118,
      "start": 283.4599914550781,
      "end": 286.0799865722656,
      "text": " you've been delivered from the penalty of sin."
    },
    {
      "id": 119,
      "start": 286.1199951171875,
      "end": 287.2799987792969,
      "text": " And according to the word of God,"
    },
    {
      "id": 120,
      "start": 287.2799987792969,
      "end": 290.0799865722656,
      "text": " you've been delivered from the power of sin."
    },
    {
      "id": 121,
      "start": 290.0799865722656,
      "end": 292.2799987792969,
      "text": " But the reality is that we've not yet been delivered"
    },
    {
      "id": 122,
      "start": 292.2799987792969,
      "end": 293.7200012207031,
      "text": " from the presence of sin."
    },
    {
      "id": 123,
      "start": 293.7200012207031,
      "end": 296.67999267578125,
      "text": " We know one day when we are with him,"
    },
    {
      "id": 124,
      "start": 296.67999267578125,
      "end": 299.5,
      "text": " that we will be delivered from the very presence of sin."
    },
    {
      "id": 125,
      "start": 299.5,
      "end": 301.70001220703125,
      "text": " But as long as we're here upon this earth,"
    },
    {
      "id": 126,
      "start": 301.70001220703125,
      "end": 303.2799987792969,
      "text": " we deal with sin."
    },
    {
      "id": 127,
      "start": 303.2799987792969,
      "end": 306.6400146484375,
      "text": " And we understand that the Bible does not teach,"
    },
    {
      "id": 128,
      "start": 306.6400146484375,
      "end": 309.0,
      "text": " and we'll go through this passage of scripture"
    },
    {
      "id": 129,
      "start": 309.0,
      "end": 310.239990234375,
      "text": " this morning and deal with this."
    },
    {
      "id": 130,
      "start": 310.239990234375,
      "end": 312.5199890136719,
      "text": " He's not dealing with this idea"
    },
    {
      "id": 131,
      "start": 312.5199890136719,
      "end": 315.32000732421875,
      "text": " that some have given idea to"
    },
    {
      "id": 132,
      "start": 315.32000732421875,
      "end": 316.67999267578125,
      "text": " or thought to in the past"
    },
    {
      "id": 133,
      "start": 316.67999267578125,
      "end": 319.8800048828125,
      "text": " of reaching some place of sinless perfection."
    },
    {
      "id": 134,
      "start": 320.8800048828125,
      "end": 323.20001220703125,
      "text": " Rather, he's dealing with the behavior"
    },
    {
      "id": 135,
      "start": 323.20001220703125,
      "end": 325.1199951171875,
      "text": " of a believer in the change"
    },
    {
      "id": 136,
      "start": 325.1199951171875,
      "end": 329.4200134277344,
      "text": " because of who we are and what our expectation is."
    },
    {
      "id": 137,
      "start": 329.4200134277344,
      "end": 332.2799987792969,
      "text": " It's not possible that we're going to be sinless,"
    },
    {
      "id": 138,
      "start": 332.2799987792969,
      "end": 336.2799987792969,
      "text": " but the reality is that we should sin less and less"
    },
    {
      "id": 139,
      "start": 336.2799987792969,
      "end": 339.1199951171875,
      "text": " the closer we walk with the Lord."
    },
    {
      "id": 140,
      "start": 339.1199951171875,
      "end": 341.5400085449219,
      "text": " And we find that for the believer,"
    },
    {
      "id": 141,
      "start": 341.5400085449219,
      "end": 344.7200012207031,
      "text": " that sin is not something that we can take joy in"
    },
    {
      "id": 142,
      "start": 344.7200012207031,
      "end": 346.5400085449219,
      "text": " and something that we delight in,"
    },
    {
      "id": 143,
      "start": 346.5400085449219,
      "end": 348.3800048828125,
      "text": " rather something that would cause us"
    },
    {
      "id": 144,
      "start": 348.3800048828125,
      "end": 352.0,
      "text": " to regret immediately after so doing."
    },
    {
      "id": 145,
      "start": 352.0,
      "end": 354.1600036621094,
      "text": " As we look at this passage of scripture"
    },
    {
      "id": 146,
      "start": 354.1600036621094,
      "end": 358.4800109863281,
      "text": " and we consider the impact of a believer,"
    },
    {
      "id": 147,
      "start": 358.4800109863281,
      "end": 363.20001220703125,
      "text": " of the belief of a believer and how it impacts their life,"
    },
    {
      "id": 148,
      "start": 363.20001220703125,
      "end": 364.9800109863281,
      "text": " we see it in our behavior here."
    },
    {
      "id": 149,
      "start": 364.9800109863281,
      "end": 367.3399963378906,
      "text": " Notice what he says at the beginning in verse number four."
    },
    {
      "id": 150,
      "start": 367.3399963378906,
      "end": 368.17999267578125,
      "text": " It says this,"
    },
    {
      "id": 151,
      "start": 368.17999267578125,
      "end": 372.8800048828125,
      "text": " whosoever committeth sin transgresseth also the law."
    },
    {
      "id": 152,
      "start": 372.8800048828125,
      "end": 375.8800048828125,
      "text": " For sin is the transgression of the law."
    },
    {
      "id": 153,
      "start": 375.8800048828125,
      "end": 378.79998779296875,
      "text": " And ye know that he was manifested to take away our sins"
    },
    {
      "id": 154,
      "start": 378.79998779296875,
      "end": 380.4800109863281,
      "text": " and in him is no sin."
    },
    {
      "id": 155,
      "start": 380.4800109863281,
      "end": 383.20001220703125,
      "text": " Whosoever abideth in him sinneth not."
    },
    {
      "id": 156,
      "start": 383.20001220703125,
      "end": 387.239990234375,
      "text": " Whosoever sinneth hath not seen him, neither known him."
    },
    {
      "id": 157,
      "start": 387.239990234375,
      "end": 390.239990234375,
      "text": " Little children, let no man deceive you."
    },
    {
      "id": 158,
      "start": 390.239990234375,
      "end": 393.1600036621094,
      "text": " He that doeth righteousness is righteous"
    },
    {
      "id": 159,
      "start": 393.1600036621094,
      "end": 395.6000061035156,
      "text": " even as he is righteous."
    },
    {
      "id": 160,
      "start": 395.6000061035156,
      "end": 397.55999755859375,
      "text": " He that committed sin is of the devil,"
    },
    {
      "id": 161,
      "start": 397.55999755859375,
      "end": 399.6400146484375,
      "text": " for the devil sinneth from the beginning."
    },
    {
      "id": 162,
      "start": 399.6400146484375,
      "end": 402.1199951171875,
      "text": " For this purpose, the Son of God was manifested"
    },
    {
      "id": 163,
      "start": 402.1199951171875,
      "end": 404.7200012207031,
      "text": " that he might destroy the works of the devil."
    },
    {
      "id": 164,
      "start": 404.7200012207031,
      "end": 407.239990234375,
      "text": " Whosoever is born of God doth not commit sin"
    },
    {
      "id": 165,
      "start": 407.239990234375,
      "end": 409.239990234375,
      "text": " for his seed remaineth in him"
    },
    {
      "id": 166,
      "start": 409.239990234375,
      "end": 412.239990234375,
      "text": " and he cannot sin because he is born of God."
    },
    {
      "id": 167,
      "start": 412.239990234375,
      "end": 415.4800109863281,
      "text": " In this, the children of God are manifest"
    },
    {
      "id": 168,
      "start": 415.4800109863281,
      "end": 417.44000244140625,
      "text": " and the children of the devil."
    },
    {
      "id": 169,
      "start": 417.44000244140625,
      "end": 420.3999938964844,
      "text": " Whosoever doeth not righteousness is not of God,"
    },
    {
      "id": 170,
      "start": 420.3999938964844,
      "end": 424.0,
      "text": " neither he that loveth not his brother."
    },
    {
      "id": 171,
      "start": 424.0,
      "end": 426.0799865722656,
      "text": " You'll notice in the middle of verse number seven,"
    },
    {
      "id": 172,
      "start": 426.0799865722656,
      "end": 427.760009765625,
      "text": " actually the end of verse number seven,"
    },
    {
      "id": 173,
      "start": 427.760009765625,
      "end": 431.55999755859375,
      "text": " the Bible says he that doeth righteousness is righteous."
    },
    {
      "id": 174,
      "start": 431.6000061035156,
      "end": 433.5199890136719,
      "text": " And I've used that for our text this evening,"
    },
    {
      "id": 175,
      "start": 433.5199890136719,
      "end": 435.79998779296875,
      "text": " or this morning for our title,"
    },
    {
      "id": 176,
      "start": 435.79998779296875,
      "end": 438.20001220703125,
      "text": " for this passage of scripture, our message this morning."
    },
    {
      "id": 177,
      "start": 438.20001220703125,
      "end": 442.67999267578125,
      "text": " He that doeth righteousness is righteous."
    },
    {
      "id": 178,
      "start": 442.67999267578125,
      "end": 444.8800048828125,
      "text": " Several weeks ago on Sunday evening,"
    },
    {
      "id": 179,
      "start": 444.8800048828125,
      "end": 447.32000732421875,
      "text": " I preached a message from the book of Romans."
    },
    {
      "id": 180,
      "start": 447.32000732421875,
      "end": 449.20001220703125,
      "text": " And as I preached that message from the book of Romans,"
    },
    {
      "id": 181,
      "start": 449.20001220703125,
      "end": 452.760009765625,
      "text": " I made this statement that they who have been declared"
    },
    {
      "id": 182,
      "start": 452.760009765625,
      "end": 456.0400085449219,
      "text": " righteous are to live righteous lives."
    },
    {
      "id": 183,
      "start": 456.0400085449219,
      "end": 458.0799865722656,
      "text": " And we understand that through salvation,"
    },
    {
      "id": 184,
      "start": 458.0799865722656,
      "end": 459.6400146484375,
      "text": " and as he's writing to believers here,"
    },
    {
      "id": 185,
      "start": 459.6400146484375,
      "end": 461.67999267578125,
      "text": " these that are called the sons of God,"
    },
    {
      "id": 186,
      "start": 461.67999267578125,
      "end": 464.5,
      "text": " that we have been declared righteous."
    },
    {
      "id": 187,
      "start": 464.5,
      "end": 467.1600036621094,
      "text": " That's our position and what a joy to know"
    },
    {
      "id": 188,
      "start": 467.1600036621094,
      "end": 469.2799987792969,
      "text": " that we have the imputed righteousness"
    },
    {
      "id": 189,
      "start": 469.2799987792969,
      "end": 472.239990234375,
      "text": " of the Lord Jesus Christ upon our account."
    },
    {
      "id": 190,
      "start": 472.239990234375,
      "end": 474.2200012207031,
      "text": " And as we've been declared righteous,"
    },
    {
      "id": 191,
      "start": 474.2200012207031,
      "end": 476.4800109863281,
      "text": " we are to live righteous lives."
    },
    {
      "id": 192,
      "start": 476.4800109863281,
      "end": 479.9599914550781,
      "text": " Now it's interesting, perhaps you saw the warning"
    },
    {
      "id": 193,
      "start": 479.9599914550781,
      "end": 481.0400085449219,
      "text": " in verse number seven."
    },
    {
      "id": 194,
      "start": 481.0400085449219,
      "end": 482.9599914550781,
      "text": " It's of great interest to me that in the midst"
    },
    {
      "id": 195,
      "start": 482.9599914550781,
      "end": 486.3599853515625,
      "text": " of this passage of scripture, that God gives us a warning."
    },
    {
      "id": 196,
      "start": 486.3599853515625,
      "end": 488.79998779296875,
      "text": " Notice the warning right there in verse number seven."
    },
    {
      "id": 197,
      "start": 488.79998779296875,
      "end": 493.79998779296875,
      "text": " John says, little children, let no man deceive you."
    },
    {
      "id": 198,
      "start": 494.7200012207031,
      "end": 496.55999755859375,
      "text": " Let no man deceive you."
    },
    {
      "id": 199,
      "start": 496.55999755859375,
      "end": 499.760009765625,
      "text": " Now, unfortunately, as we would consider this thought"
    },
    {
      "id": 200,
      "start": 499.760009765625,
      "end": 502.760009765625,
      "text": " of deception and we consider the thought of false teaching,"
    },
    {
      "id": 201,
      "start": 502.760009765625,
      "end": 505.8800048828125,
      "text": " we understand that all the way back here in the first century"
    },
    {
      "id": 202,
      "start": 505.8800048828125,
      "end": 510.1199951171875,
      "text": " as God is using John to write this short epistle,"
    },
    {
      "id": 203,
      "start": 510.1199951171875,
      "end": 512.760009765625,
      "text": " that there were false teachers that were going about"
    },
    {
      "id": 204,
      "start": 512.760009765625,
      "end": 515.0399780273438,
      "text": " seeking to deceive individuals."
    },
    {
      "id": 205,
      "start": 515.0399780273438,
      "end": 517.9199829101562,
      "text": " And we find that still today there are false teachers"
    },
    {
      "id": 206,
      "start": 517.9199829101562,
      "end": 519.9600219726562,
      "text": " that are running around that are seeking"
    },
    {
      "id": 207,
      "start": 519.9600219726562,
      "end": 521.8800048828125,
      "text": " to deceive the masses."
    },
    {
      "id": 208,
      "start": 521.8800048828125,
      "end": 525.1199951171875,
      "text": " And we find that specifically with regard to the context"
    },
    {
      "id": 209,
      "start": 525.1199951171875,
      "end": 527.280029296875,
      "text": " of this passage of scripture this morning,"
    },
    {
      "id": 210,
      "start": 527.280029296875,
      "end": 532.280029296875,
      "text": " that we would find that the deception is with regard to sin."
    },
    {
      "id": 211,
      "start": 532.5599975585938,
      "end": 535.5599975585938,
      "text": " There were many that would say, oh, don't worry about sin."
    },
    {
      "id": 212,
      "start": 535.5599975585938,
      "end": 537.239990234375,
      "text": " Sin doesn't really matter."
    },
    {
      "id": 213,
      "start": 538.5599975585938,
      "end": 539.719970703125,
      "text": " I beg to differ."
    },
    {
      "id": 214,
      "start": 540.6199951171875,
      "end": 541.7000122070312,
      "text": " I beg to differ."
    },
    {
      "id": 215,
      "start": 542.7999877929688,
      "end": 547.239990234375,
      "text": " We find that yes, indeed, as we begin the third chapter"
    },
    {
      "id": 216,
      "start": 547.239990234375,
      "end": 550.760009765625,
      "text": " of the book of 1 John, God's love is in focus."
    },
    {
      "id": 217,
      "start": 550.760009765625,
      "end": 552.9199829101562,
      "text": " And I'm so thankful that God is love."
    },
    {
      "id": 218,
      "start": 552.9199829101562,
      "end": 554.4400024414062,
      "text": " This book declares that."
    },
    {
      "id": 219,
      "start": 555.52001953125,
      "end": 558.3599853515625,
      "text": " But understand this morning that God never,"
    },
    {
      "id": 220,
      "start": 558.3599853515625,
      "end": 563.280029296875,
      "text": " God never sacrifices His holiness on the altar of love."
    },
    {
      "id": 221,
      "start": 564.1599731445312,
      "end": 565.5599975585938,
      "text": " Never."
    },
    {
      "id": 222,
      "start": 565.5599975585938,
      "end": 567.47998046875,
      "text": " I'm thankful that our God is gracious."
    },
    {
      "id": 223,
      "start": 567.47998046875,
      "end": 570.8800048828125,
      "text": " Indeed, His grace is amazing."
    },
    {
      "id": 224,
      "start": 572.3599853515625,
      "end": 575.8400268554688,
      "text": " But the reality is that the grace of God"
    },
    {
      "id": 225,
      "start": 575.8400268554688,
      "end": 578.239990234375,
      "text": " does not change the holiness of God."
    },
    {
      "id": 226,
      "start": 579.280029296875,
      "end": 582.280029296875,
      "text": " And there are many today that are seeking to deceive"
    },
    {
      "id": 227,
      "start": 582.280029296875,
      "end": 584.280029296875,
      "text": " in the same manner in which these false teachers"
    },
    {
      "id": 228,
      "start": 584.280029296875,
      "end": 586.52001953125,
      "text": " were seeking to deceive during the writing"
    },
    {
      "id": 229,
      "start": 586.52001953125,
      "end": 587.8800048828125,
      "text": " of the book of 1 John."
    },
    {
      "id": 230,
      "start": 587.8800048828125,
      "end": 591.4400024414062,
      "text": " And that was to say, oh, God is love, and God is gracious,"
    },
    {
      "id": 231,
      "start": 591.4400024414062,
      "end": 593.8800048828125,
      "text": " and it doesn't really matter what you do."
    },
    {
      "id": 232,
      "start": 593.8800048828125,
      "end": 595.4400024414062,
      "text": " Do you remember what Paul said?"
    },
    {
      "id": 233,
      "start": 596.8400268554688,
      "end": 599.0,
      "text": " As Paul was writing to the believers in Rome"
    },
    {
      "id": 234,
      "start": 599.0,
      "end": 600.47998046875,
      "text": " in Romans chapter four,"
    },
    {
      "id": 0,
      "start": 600.47998046875,
      "end": 604.7599806785583,
      "text": " chapter number 5, he mentions about the grace of God, and he says, but where sin"
    },
    {
      "id": 1,
      "start": 604.7599806785583,
      "end": 610.9199800491333,
      "text": " abounded, grace did much more abound. And then he really is going to give an"
    },
    {
      "id": 2,
      "start": 610.9199800491333,
      "end": 614.6599807739258,
      "text": " answer to a question that's not yet asked as he is writing under the"
    },
    {
      "id": 3,
      "start": 614.6599807739258,
      "end": 617.6399803161621,
      "text": " inspiration of the Holy Spirit of God, and the Bible says in chapter number 6"
    },
    {
      "id": 4,
      "start": 617.6399803161621,
      "end": 621.3599796295166,
      "text": " of the book of Romans, what shall we say then? Shall we continue in sin that grace"
    },
    {
      "id": 5,
      "start": 621.3599796295166,
      "end": 628.7999801635742,
      "text": " may abound? And the Bible says, God forbid. In the book of Jude, the Bible tells us"
    },
    {
      "id": 6,
      "start": 628.7999801635742,
      "end": 634.6399803161621,
      "text": " that they turned the grace of God into lasciviousness. That's not a word that"
    },
    {
      "id": 7,
      "start": 634.6399803161621,
      "end": 641.2799797058105,
      "text": " we use very often, but we understand that word means unbridled lust. They've turned"
    },
    {
      "id": 8,
      "start": 641.2799797058105,
      "end": 648.0799789428711,
      "text": " the grace of God into lasciviousness. And that form of false teaching continues to"
    },
    {
      "id": 9,
      "start": 648.0799789428711,
      "end": 654.039981842041,
      "text": " be prevalent to this very day. There are people all around this globe that are"
    },
    {
      "id": 10,
      "start": 654.039981842041,
      "end": 658.9999809265137,
      "text": " giving a false teaching with regard to the truth of this book. I am thankful"
    },
    {
      "id": 11,
      "start": 658.9999809265137,
      "end": 662.7999801635742,
      "text": " that God is love, but I've often mentioned, and we will mention as we"
    },
    {
      "id": 12,
      "start": 662.7999801635742,
      "end": 666.47998046875,
      "text": " continue through the book of John and see many references to the love of God,"
    },
    {
      "id": 13,
      "start": 666.47998046875,
      "end": 674.3199768066406,
      "text": " I have often mentioned that God's love can best be described as protective, not"
    },
    {
      "id": 14,
      "start": 674.3199768066406,
      "end": 681.9599838256836,
      "text": " as permissive. So many people today want to define the love of God as being"
    },
    {
      "id": 15,
      "start": 681.9599838256836,
      "end": 688.2399826049805,
      "text": " permissive. God loves you, do whatever you want to do. God's love is best described"
    },
    {
      "id": 16,
      "start": 688.2399826049805,
      "end": 693.599983215332,
      "text": " as protective. Is there a parent among us this morning that would say that they love"
    },
    {
      "id": 17,
      "start": 693.599983215332,
      "end": 700.47998046875,
      "text": " their child? Of course. Are you going to let your child do whatever they want to do because"
    },
    {
      "id": 18,
      "start": 700.47998046875,
      "end": 707.9199829101562,
      "text": " you love them? That would be foolish, right? So your love for your children is a protective"
    },
    {
      "id": 19,
      "start": 707.9199829101562,
      "end": 714.9599838256836,
      "text": " love, such is the case with God's love. I want you to remember what Peter said in"
    },
    {
      "id": 20,
      "start": 714.9599838256836,
      "end": 720.9999771118164,
      "text": " 1 Peter 1, just a few pages over, and then we'll get right into the text of Scripture"
    },
    {
      "id": 21,
      "start": 720.9999771118164,
      "end": 727.9599838256836,
      "text": " this morning. See, God is concerned about the behavior of His children. Our behavior"
    },
    {
      "id": 22,
      "start": 727.9599838256836,
      "end": 734.1999816894531,
      "text": " matters to God. In 1 Peter 1, in verse 14, the Bible says,"
    },
    {
      "id": 23,
      "start": 734.1999816894531,
      "end": 740.4399871826172,
      "text": " As obedient children, not fashioning yourselves according to the former lust and your ignorance,"
    },
    {
      "id": 24,
      "start": 740.4399871826172,
      "end": 749.6399841308594,
      "text": " but as He which hath called you is holy, so be ye holy in all manner of conversation,"
    },
    {
      "id": 25,
      "start": 749.6399841308594,
      "end": 756.4399871826172,
      "text": " because it is written, Be holy, for I am holy. See, we must understand that there's a balance"
    },
    {
      "id": 26,
      "start": 756.4399871826172,
      "end": 762.0399780273438,
      "text": " within the Word of God, and His attributes, His character traits are always in perfect"
    },
    {
      "id": 27,
      "start": 762.0399780273438,
      "end": 769.3999786376953,
      "text": " harmony. And we find that it is a popular message still even to this day to preach and"
    },
    {
      "id": 28,
      "start": 769.3999786376953,
      "end": 774.0799865722656,
      "text": " to proclaim this God is love and do whatever you want to do, and you can get a great number"
    },
    {
      "id": 29,
      "start": 774.0799865722656,
      "end": 779.6799774169922,
      "text": " of people because everything's just wishy-washy, you do whatever you want. But when you begin"
    },
    {
      "id": 30,
      "start": 779.6799774169922,
      "end": 785.1599731445312,
      "text": " to preach and teach what the Word of God actually says and the truth of sanctification and the"
    },
    {
      "id": 31,
      "start": 785.1599731445312,
      "end": 792.1599731445312,
      "text": " truth of our behavior, all of a sudden, people don't like that message so much. Nevertheless,"
    },
    {
      "id": 32,
      "start": 792.1599731445312,
      "end": 797.3599853515625,
      "text": " it's true. And here we find as we look at the passage of Scripture, if you are taking"
    },
    {
      "id": 33,
      "start": 797.3599853515625,
      "end": 803.0799865722656,
      "text": " notes, notice with me first of all that John speaks about sin. He speaks about sin. In"
    },
    {
      "id": 34,
      "start": 803.0799865722656,
      "end": 812.3999786376953,
      "text": " verse number 4, notice what he says, Whosoever committeth sin transgresseth also the law."
    },
    {
      "id": 35,
      "start": 812.3999786376953,
      "end": 819.6399841308594,
      "text": " Notice what he says, For sin is the transgression of the law. It's a very simple statement that"
    },
    {
      "id": 36,
      "start": 819.6399841308594,
      "end": 824.7199859619141,
      "text": " we find here in 1 John 3 and verse number 4 with regard to the definition or the description"
    },
    {
      "id": 37,
      "start": 824.7199859619141,
      "end": 829.3999786376953,
      "text": " of sin. I would say this, as we look at verse number 4 and we understand that John speaks"
    },
    {
      "id": 38,
      "start": 829.3999786376953,
      "end": 834.7599792480469,
      "text": " about sin, that we'd understand this morning that sin is awful. It is stated as being a"
    },
    {
      "id": 39,
      "start": 834.7599792480469,
      "end": 843.7599792480469,
      "text": " transgression of the law, and we find that that literally means lawlessness. Lawlessness."
    },
    {
      "id": 40,
      "start": 843.7599792480469,
      "end": 849.6799774169922,
      "text": " And we find that here, as God is referring back to the truth of the Old Testament, we'd"
    },
    {
      "id": 41,
      "start": 849.6799774169922,
      "end": 854.2599792480469,
      "text": " be familiar with the law even as we've studied the Old Testament, and we find that He's giving"
    },
    {
      "id": 42,
      "start": 854.2599792480469,
      "end": 860.719970703125,
      "text": " the clarity with regard to what is sin, and He speaks about sin. We understand this morning"
    },
    {
      "id": 43,
      "start": 860.719970703125,
      "end": 867.239990234375,
      "text": " that the law, it reveals sin. In fact, Paul says this, If it had not been for the law,"
    },
    {
      "id": 44,
      "start": 867.239990234375,
      "end": 873.4399719238281,
      "text": " I would not have known sin, in Romans chapter number 7. But because the law says, and I"
    },
    {
      "id": 45,
      "start": 873.4399719238281,
      "end": 879.6399841308594,
      "text": " look at my behavior, I find out that I'm a transgressor of God's law. And we find here"
    },
    {
      "id": 46,
      "start": 879.6399841308594,
      "end": 885.1399841308594,
      "text": " this morning that sin is being spoken of. We know that sin has been dealt with earlier"
    },
    {
      "id": 47,
      "start": 885.1399841308594,
      "end": 890.5599670410156,
      "text": " in the chapters of the book of 1 John. Remember, the Bible said this in 1 John chapter number"
    },
    {
      "id": 48,
      "start": 890.5599670410156,
      "end": 896.8799743652344,
      "text": " 1 with regard to sin. He says if we say in verse number 8 that we have no sin, we deceive"
    },
    {
      "id": 49,
      "start": 896.8799743652344,
      "end": 905.3599853515625,
      "text": " ourselves and the truth is not in us. If we confess our sins, He is faithful and just"
    },
    {
      "id": 50,
      "start": 905.3599853515625,
      "end": 910.5399780273438,
      "text": " to forgive us our sins and to cleanse us from all unrighteousness. If we say that we've"
    },
    {
      "id": 51,
      "start": 910.5399780273438,
      "end": 915.1999816894531,
      "text": " not sinned, we make Him a liar and His word is not in us. And then remember this truth"
    },
    {
      "id": 52,
      "start": 915.1999816894531,
      "end": 920.8599853515625,
      "text": " of 1 John 2 in verse number 1, My little children, these things write I unto you that"
    },
    {
      "id": 53,
      "start": 920.8599853515625,
      "end": 929.6599731445312,
      "text": " you sin not. That's the goal. Amen? However, I am so thankful for the entirety of verse"
    },
    {
      "id": 54,
      "start": 929.6599731445312,
      "end": 934.1599731445312,
      "text": " number 1 of 1 John 2 because the goal is that we sin not. But have you found it in your"
    },
    {
      "id": 55,
      "start": 934.1599731445312,
      "end": 943.4399719238281,
      "text": " life that you sin? The goal is to sin not. But the reality is that we sin. You may have"
    },
    {
      "id": 56,
      "start": 943.4399719238281,
      "end": 957.1999816894531,
      "text": " sinned this morning. We probably did. Amen? And it says this, and if any man sin, we have"
    },
    {
      "id": 57,
      "start": 957.1999816894531,
      "end": 968.3199768066406,
      "text": " an advocate with the Father, Jesus Christ the righteous. Perfect defense attorney. Amen?"
    },
    {
      "id": 58,
      "start": 968.5999755859375,
      "end": 975.6799926757812,
      "text": " Every time the accuser of the brethren brings up charges against us, our advocate, Jesus,"
    },
    {
      "id": 59,
      "start": 975.6799926757812,
      "end": 984.8399658203125,
      "text": " says, yes, He's guilty. He doesn't try to defend our innocence for we are guilty. But"
    },
    {
      "id": 60,
      "start": 984.8399658203125,
      "end": 994.1999816894531,
      "text": " He says, I paid for it. Isn't that awesome? Yes, He's guilty, but it's under the blood."
    },
    {
      "id": 61,
      "start": 994.1999816894531,
      "end": 999.7599792480469,
      "text": " It's been paid for. We have an advocate with the Father. And we find here in 1 John chapter"
    },
    {
      "id": 62,
      "start": 999.7599792480469,
      "end": 1006.4399719238281,
      "text": " number 3 that He's speaking about sin. It is the transgression of the law. It is lawlessness."
    },
    {
      "id": 63,
      "start": 1006.4399719238281,
      "end": 1010.9599914550781,
      "text": " We find that the law reveals sin to us. Notice in the text of Scripture that the Bible teaches"
    },
    {
      "id": 64,
      "start": 1010.9599914550781,
      "end": 1017.6399841308594,
      "text": " us that Satan himself is the author of sin. God is not the author of sin. Satan is the"
    },
    {
      "id": 65,
      "start": 1017.6399841308594,
      "end": 1023.9999694824219,
      "text": " author of sin. Notice in verse number 8, He that committeth sin is of the devil. For the"
    },
    {
      "id": 66,
      "start": 1023.9999694824219,
      "end": 1032.5999755859375,
      "text": " devil sinneth from the beginning. He said, I will be like the Most High. He wanted to"
    },
    {
      "id": 67,
      "start": 1032.5999755859375,
      "end": 1038.8799743652344,
      "text": " be like God. He wanted to be God. We find that here the Scriptures tell us that Satan"
    },
    {
      "id": 68,
      "start": 1038.8799743652344,
      "end": 1043.7599792480469,
      "text": " is the author of sin, and he that committeth sin is of the devil. For the devil sinneth"
    },
    {
      "id": 69,
      "start": 1043.7599792480469,
      "end": 1048.8799743652344,
      "text": " from the beginning. You'll remember that Jesus said this during His earthly ministry as He's"
    },
    {
      "id": 70,
      "start": 1048.8799743652344,
      "end": 1054.1999816894531,
      "text": " ministering there, and He mentions about those that, of course, the religious leaders"
    },
    {
      "id": 71,
      "start": 1054.1999816894531,
      "end": 1059.239990234375,
      "text": " of the day, and He speaks to them about their father, the devil. And He speaks this in John"
    },
    {
      "id": 72,
      "start": 1059.239990234375,
      "end": 1063.5999755859375,
      "text": " 8 and verse number 44, the year of your father, the devil, and the lust of your father you"
    },
    {
      "id": 73,
      "start": 1063.5999755859375,
      "end": 1068.8399658203125,
      "text": " will do. He was a murderer from the beginning and a boat not in the truth. Why? Because"
    },
    {
      "id": 74,
      "start": 1068.8399658203125,
      "end": 1076.5599670410156,
      "text": " there is no truth in Him. When He speaketh a lie, He speaketh of His own, for He is a"
    },
    {
      "id": 75,
      "start": 1076.5599670410156,
      "end": 1084.3999938964844,
      "text": " liar and the father of it in John 8 and verse 44. So we see that John, He makes the statement,"
    },
    {
      "id": 76,
      "start": 1084.3999938964844,
      "end": 1089.0399780273438,
      "text": " He speaks of sin, but I want you to notice very quickly that not only He doesn't stay"
    },
    {
      "id": 77,
      "start": 1089.0399780273438,
      "end": 1095.7999877929688,
      "text": " there. He then speaks, number two, of our Savior. We have a wonderful Savior. And we"
    },
    {
      "id": 78,
      "start": 1095.7999877929688,
      "end": 1099.8399658203125,
      "text": " consider this morning as we look at the text of Scripture what was accomplished on that"
    },
    {
      "id": 79,
      "start": 1099.8399658203125,
      "end": 1105.3999938964844,
      "text": " cruel cross, what was accomplished at Calvary because of sin. We understand that it was"
    },
    {
      "id": 80,
      "start": 1105.3999938964844,
      "end": 1109.7999877929688,
      "text": " sin that sent our Savior there, but we notice as we look at this text of Scripture that"
    },
    {
      "id": 81,
      "start": 1109.7999877929688,
      "end": 1114.9199829101562,
      "text": " John quickly moves on and He begins to speak of our Savior, and we find in verse number"
    },
    {
      "id": 82,
      "start": 1114.9199829101562,
      "end": 1119.8800048828125,
      "text": " five He reveals to us as He's speaking of our Savior that He was manifest, that He came"
    },
    {
      "id": 83,
      "start": 1119.8800048828125,
      "end": 1126.9599609375,
      "text": " for this purpose, notice, to take away our sins. Isn't that wonderful? Notice in verse"
    },
    {
      "id": 84,
      "start": 1126.9599609375,
      "end": 1131.6799926757812,
      "text": " number five, and ye know. Now I'm thankful for that again as we note that He's writing"
    },
    {
      "id": 85,
      "start": 1131.6799926757812,
      "end": 1136.9199829101562,
      "text": " to believers, He's writing to these that have received the gospel, that have been saved,"
    },
    {
      "id": 86,
      "start": 1136.9199829101562,
      "end": 1143.9599609375,
      "text": " and He says, ye know, you have this knowledge, you know that He, Jesus, was manifested to"
    },
    {
      "id": 87,
      "start": 1143.9599609375,
      "end": 1158.5599975585938,
      "text": " take away our sins. And in Him is no sin. We understand that He is perfect. He is sinless."
    },
    {
      "id": 88,
      "start": 1158.5599975585938,
      "end": 1164.9199829101562,
      "text": " The just for the unjust. We find here that in this text of Scripture that John is saying"
    },
    {
      "id": 89,
      "start": 1164.9199829101562,
      "end": 1170.3200073242188,
      "text": " that we had a perfect substitute. See, the reality is that I'm a sinful man and you are"
    },
    {
      "id": 90,
      "start": 1170.3200073242188,
      "end": 1176.2799682617188,
      "text": " sinful people. I cannot pay for your sins and you cannot pay for my sins. But God in"
    },
    {
      "id": 91,
      "start": 1176.2799682617188,
      "end": 1182.760009765625,
      "text": " flesh, the Lord Jesus Christ, He was manifest, He came to the sin-cursed world, He left the"
    },
    {
      "id": 92,
      "start": 1182.760009765625,
      "end": 1189.7999877929688,
      "text": " glory of heaven, He lived in this wicked world, and He walked perfectly. He never sinned."
    },
    {
      "id": 93,
      "start": 1189.7999877929688,
      "end": 1196.6799926757812,
      "text": " And He went to that cruel cross and He bled and He died. Why? To take away our sins. He"
    },
    {
      "id": 94,
      "start": 1196.6799926757812,
      "end": 1200.47998046875,
      "text": " was buried in a borrowed tomb and He rose conquering"
    },
    {
      "id": 0,
      "start": 1200.47998046875,
      "end": 1206.559980392456,
      "text": " death, sin, and the grave. He lives forevermore. He's coming again. We rejoice"
    },
    {
      "id": 1,
      "start": 1206.559980392456,
      "end": 1212.1999807357788,
      "text": " because we serve a risen Savior, and we find this morning that John is reminding"
    },
    {
      "id": 2,
      "start": 1212.1999807357788,
      "end": 1218.6799812316895,
      "text": " his readers, he's reminding them that Jesus took away our sins, and we ought to"
    },
    {
      "id": 3,
      "start": 1218.6799812316895,
      "end": 1225.4399795532227,
      "text": " rejoice in that. What can wash away my sin, the songwriter said?"
    },
    {
      "id": 4,
      "start": 1225.4399795532227,
      "end": 1234.1199798583984,
      "text": " Nothing but the blood of Jesus. Amen? What can make me whole again? Nothing but"
    },
    {
      "id": 5,
      "start": 1234.1199798583984,
      "end": 1240.1199798583984,
      "text": " the blood of Jesus. Oh precious is that fount. Aren't you so thankful for the"
    },
    {
      "id": 6,
      "start": 1240.1199798583984,
      "end": 1247.6799812316895,
      "text": " blood of Christ that was shed to pay for the sin of mankind? You know, this morning"
    },
    {
      "id": 7,
      "start": 1247.6799812316895,
      "end": 1255.3599815368652,
      "text": " sin is a universal condition that mankind has. It's universal. There's not"
    },
    {
      "id": 8,
      "start": 1255.3599815368652,
      "end": 1259.5999794006348,
      "text": " a just man upon the face of the earth, for all have sinned and come short of"
    },
    {
      "id": 9,
      "start": 1259.5999794006348,
      "end": 1265.4399795532227,
      "text": " the glory of God. Right? It's what the Word of God says. So sin is a universal"
    },
    {
      "id": 10,
      "start": 1265.4399795532227,
      "end": 1270.9199829101562,
      "text": " condition. Every single human being that you see, that I see, has the same"
    },
    {
      "id": 11,
      "start": 1270.9199829101562,
      "end": 1280.7599792480469,
      "text": " condition that we have. Sin. What makes me different? Mine's been forgiven. I know"
    },
    {
      "id": 12,
      "start": 1280.7599792480469,
      "end": 1291.0399780273438,
      "text": " that He came. I have the knowledge. He came and He took away our sins. Wow, what"
    },
    {
      "id": 13,
      "start": 1291.0399780273438,
      "end": 1297.2799835205078,
      "text": " joy. 2 Corinthians 5 verse 21 says that He, God, hath made Him, Christ, to be sin"
    },
    {
      "id": 14,
      "start": 1297.2799835205078,
      "end": 1305.7599792480469,
      "text": " for us, who knew no sin, that we might be made the righteousness of God in Him."
    },
    {
      "id": 15,
      "start": 1305.7599792480469,
      "end": 1311.3199768066406,
      "text": " Man, what a transaction that took place. The songwriter said it's not in our"
    },
    {
      "id": 16,
      "start": 1311.3199768066406,
      "end": 1315.9999771118164,
      "text": " songbook. Many of you might be familiar with it. The old account was settled long"
    },
    {
      "id": 17,
      "start": 1315.9999771118164,
      "end": 1324.079978942871,
      "text": " ago. The old account was settled. The transaction was completed. Jesus said it"
    },
    {
      "id": 18,
      "start": 1324.079978942871,
      "end": 1329.1199798583984,
      "text": " is finished. It was paid in full. He paid for our sins. I mentioned earlier, but"
    },
    {
      "id": 19,
      "start": 1329.1199798583984,
      "end": 1332.7999877929688,
      "text": " there in 1 Peter chapter 3 and verse number 18, the Bible says, for Christ also"
    },
    {
      "id": 20,
      "start": 1332.7999877929688,
      "end": 1339.3599853515625,
      "text": " hath once suffered for our sins, the just for the unjust, that He might bring us to"
    },
    {
      "id": 21,
      "start": 1339.3599853515625,
      "end": 1347.3999786376953,
      "text": " God, being put to death in the flesh, but quickened by the Spirit. Notice not only"
    },
    {
      "id": 22,
      "start": 1347.3999786376953,
      "end": 1351.1199798583984,
      "text": " as He speaks of our Savior here in 1 John chapter number 3, does He remind"
    },
    {
      "id": 23,
      "start": 1351.719985961914,
      "end": 1355.4399871826172,
      "text": " the recipients, does He remind us this morning that He took away our sins, that"
    },
    {
      "id": 24,
      "start": 1355.4399871826172,
      "end": 1359.239974975586,
      "text": " was accomplished at the cross of Calvary, but I want you to notice as well that He"
    },
    {
      "id": 25,
      "start": 1359.239974975586,
      "end": 1363.719985961914,
      "text": " destroyed the works of the devil. Notice in verse number 8, the Bible says, He that"
    },
    {
      "id": 26,
      "start": 1363.719985961914,
      "end": 1367.7599792480469,
      "text": " committeth sin is of the devil, for the devil sinneth from the beginning. For this"
    },
    {
      "id": 27,
      "start": 1367.7599792480469,
      "end": 1375.3599853515625,
      "text": " purpose, the Son of God was manifested, that He might destroy the works of the"
    },
    {
      "id": 28,
      "start": 1375.3599853515625,
      "end": 1382.239974975586,
      "text": " devil. Satan did everything he could do throughout history to prevent Messiah"
    },
    {
      "id": 29,
      "start": 1382.239974975586,
      "end": 1389.47998046875,
      "text": " from coming and from going to that cruel cross. He did everything he could. You"
    },
    {
      "id": 30,
      "start": 1389.47998046875,
      "end": 1392.999984741211,
      "text": " read in the Old Testament, you read about the various plots against the nation of"
    },
    {
      "id": 31,
      "start": 1392.999984741211,
      "end": 1398.3999786376953,
      "text": " Israel, you read against the attacks against the lineage, the line, you find"
    },
    {
      "id": 32,
      "start": 1398.3999786376953,
      "end": 1404.47998046875,
      "text": " that it's all an attack upon Messiah. You read about Haman's wicked plan in the"
    },
    {
      "id": 33,
      "start": 1404.47998046875,
      "end": 1411.1199798583984,
      "text": " book of Esther to annihilate the entirety of the Jewish race. Why? So that no Messiah"
    },
    {
      "id": 34,
      "start": 1411.1199798583984,
      "end": 1420.47998046875,
      "text": " could come. He tried to kill Him multiple times during His earthly ministry. You can"
    },
    {
      "id": 35,
      "start": 1420.47998046875,
      "end": 1427.1199798583984,
      "text": " read various portions in the Gospels where they tried to kill Him. Satan was behind it,"
    },
    {
      "id": 36,
      "start": 1427.1199798583984,
      "end": 1436.1999816894531,
      "text": " no doubt. But He declares in John 17, the hour has come. It was time. And He goes to"
    },
    {
      "id": 37,
      "start": 1436.1999816894531,
      "end": 1441.3999786376953,
      "text": " that cross. And I can almost see in my mind's eye that Satan begins to triumph, thinking"
    },
    {
      "id": 38,
      "start": 1441.3999786376953,
      "end": 1448.239974975586,
      "text": " he's won the victory. After he died and he was put in that borrowed tomb, they set"
    },
    {
      "id": 39,
      "start": 1448.239974975586,
      "end": 1453.5999755859375,
      "text": " a seal. Remember, they kept watch and they made it as sure as they could. But there was"
    },
    {
      "id": 40,
      "start": 1453.5999755859375,
      "end": 1461.239990234375,
      "text": " nothing that could keep them from rising and conquering sin, death, and the grave."
    },
    {
      "id": 41,
      "start": 1461.239990234375,
      "end": 1467.1199951171875,
      "text": " He destroyed the works of the devil. And we understand as we look at this verse of"
    },
    {
      "id": 42,
      "start": 1467.1199951171875,
      "end": 1472.8399658203125,
      "text": " Scripture and this truth that God is giving us with regard to the work that God did there"
    },
    {
      "id": 43,
      "start": 1472.8399658203125,
      "end": 1482.9999694824219,
      "text": " at Calvary, and He's rendered this truth of destroying, it's rendered powerless."
    },
    {
      "id": 44,
      "start": 1482.9999694824219,
      "end": 1485.7999877929688,
      "text": " Notice what the Bible says, if you will, over in the book of Colossians in chapter"
    },
    {
      "id": 45,
      "start": 1485.7999877929688,
      "end": 1492.3599853515625,
      "text": " number 2 and verse number 15 with regard to this truth of Christ destroying the works"
    },
    {
      "id": 46,
      "start": 1492.3599853515625,
      "end": 1498.7599792480469,
      "text": " of the devil. In Colossians 2 and verse number 15, the Bible, I'll read verse 14 with it."
    },
    {
      "id": 47,
      "start": 1498.7599792480469,
      "end": 1506.239990234375,
      "text": " Notice what He says here in verse number 14 of Colossians chapter number 2. He says this,"
    },
    {
      "id": 48,
      "start": 1506.239990234375,
      "end": 1511.2599792480469,
      "text": " blotting out the handwriting of ordinances that was against us, which was contrary to"
    },
    {
      "id": 49,
      "start": 1511.2599792480469,
      "end": 1517.97998046875,
      "text": " us, and took it out of the way, nailing it to His cross. And having spoiled principalities"
    },
    {
      "id": 50,
      "start": 1517.97998046875,
      "end": 1526.0799865722656,
      "text": " and powers, He made a show of them openly, triumphing over them in it. And then the book"
    },
    {
      "id": 51,
      "start": 1526.0799865722656,
      "end": 1532.9199829101562,
      "text": " of Hebrews says this in Hebrews chapter number 2. Notice what the Word of God says there."
    },
    {
      "id": 52,
      "start": 1532.9199829101562,
      "end": 1543.5199890136719,
      "text": " In Hebrews chapter number 2 and verse number 14, He says this, for as much then as the"
    },
    {
      "id": 53,
      "start": 1543.5199890136719,
      "end": 1548.5599670410156,
      "text": " children are partakers of flesh and blood, He also Himself likewise took part of the"
    },
    {
      "id": 54,
      "start": 1548.5599670410156,
      "end": 1556.9999694824219,
      "text": " same, that through death He might destroy him that had the power of death. In case you"
    },
    {
      "id": 55,
      "start": 1556.9999694824219,
      "end": 1561.3999938964844,
      "text": " don't know who that is, that is the devil, He says at the end of the verse. That way"
    },
    {
      "id": 56,
      "start": 1561.3999938964844,
      "end": 1568.1199951171875,
      "text": " we'd have clarity and understanding. And so we find that Jesus, He came in the form"
    },
    {
      "id": 57,
      "start": 1568.1199951171875,
      "end": 1573.9599914550781,
      "text": " of sinful man. He Himself was not sinful, but He took upon Himself the form of a servant,"
    },
    {
      "id": 58,
      "start": 1573.9599914550781,
      "end": 1578.3599853515625,
      "text": " the form of man, came in the likeness of man, and He went, He humbled Himself, He went to"
    },
    {
      "id": 59,
      "start": 1578.3599853515625,
      "end": 1583.239990234375,
      "text": " that cruel cross, and we find that He not only took away our sins, but He destroyed"
    },
    {
      "id": 60,
      "start": 1583.239990234375,
      "end": 1592.1999816894531,
      "text": " the works of the devil. Can I say it this way, back in 1 John chapter 3, as John speaks"
    },
    {
      "id": 61,
      "start": 1592.1999816894531,
      "end": 1599.9199829101562,
      "text": " of our Savior and what was accomplished there at Calvary, we find the truth of redemption."
    },
    {
      "id": 62,
      "start": 1599.9199829101562,
      "end": 1608.8799743652344,
      "text": " Notice what He says in verse number 9. He says this, whosoever is born of God doth not"
    },
    {
      "id": 63,
      "start": 1608.9999694824219,
      "end": 1616.4399719238281,
      "text": " commit sin, for his seed remaineth in him, and he cannot sin because he is born of God."
    },
    {
      "id": 64,
      "start": 1616.4399719238281,
      "end": 1621.0399780273438,
      "text": " You see two references in verse number 9 to this thought of born of God. And when you"
    },
    {
      "id": 65,
      "start": 1621.0399780273438,
      "end": 1626.719970703125,
      "text": " think about this truth of born of God, we have in view here the second birth, the truth"
    },
    {
      "id": 66,
      "start": 1626.719970703125,
      "end": 1632.3199768066406,
      "text": " is Jesus said to Nicodemus, you must be born again. And we find that when we speak about"
    },
    {
      "id": 67,
      "start": 1632.3199768066406,
      "end": 1637.5999755859375,
      "text": " being born again, we'd understand that we've used this terminology before that we all have"
    },
    {
      "id": 68,
      "start": 1637.5999755859375,
      "end": 1642.5199890136719,
      "text": " a physical birth, but what's most important is whether we have a spiritual birth. To be"
    },
    {
      "id": 69,
      "start": 1642.5199890136719,
      "end": 1648.1999816894531,
      "text": " born once is to die twice, because you'll die a physical death and you die a spiritual"
    },
    {
      "id": 70,
      "start": 1648.1999816894531,
      "end": 1652.9999694824219,
      "text": " death, but to be born twice is to die just once, because you're born of the flesh and"
    },
    {
      "id": 71,
      "start": 1652.9999694824219,
      "end": 1658.7599792480469,
      "text": " you're born of the Spirit, and you'll just die once, a fleshly death."
    },
    {
      "id": 72,
      "start": 1658.7599792480469,
      "end": 1664.47998046875,
      "text": " The reality this morning is that as we understand the redemption that was made possible through"
    },
    {
      "id": 73,
      "start": 1664.47998046875,
      "end": 1670.1599731445312,
      "text": " the work at Christ at Calvary, that which was accomplished for us to be born again,"
    },
    {
      "id": 74,
      "start": 1670.1599731445312,
      "end": 1675.239990234375,
      "text": " he says here that we're born of God, but then notice this, for his seed remaineth in him,"
    },
    {
      "id": 75,
      "start": 1675.239990234375,
      "end": 1680.3199768066406,
      "text": " right in the middle of the verse in 1 John 3 and verse number 9, and it reminds us not"
    },
    {
      "id": 76,
      "start": 1680.3199768066406,
      "end": 1686.9999694824219,
      "text": " only when we think about this second birth, the new seed, the new nature. We find that"
    },
    {
      "id": 77,
      "start": 1686.9999694824219,
      "end": 1692.1999816894531,
      "text": " in 1 Peter chapter number 1, just a few pages over, I want you to remember what Peter said"
    },
    {
      "id": 78,
      "start": 1692.1999816894531,
      "end": 1700.1599731445312,
      "text": " with regard to our redemption. In 1 Peter 1, beginning in verse number 18, Peter says"
    },
    {
      "id": 79,
      "start": 1700.1599731445312,
      "end": 1705.3199768066406,
      "text": " this, for as much as you know that you were not redeemed with corruptible things as silver"
    },
    {
      "id": 80,
      "start": 1705.3199768066406,
      "end": 1712.8399658203125,
      "text": " and gold from your vain conversation received by tradition from your fathers. Nope, no silver,"
    },
    {
      "id": 81,
      "start": 1712.8399658203125,
      "end": 1720.7999877929688,
      "text": " no gold could redeem mankind, but, verse 19, with the precious blood of Christ, as of a"
    },
    {
      "id": 82,
      "start": 1720.7999877929688,
      "end": 1725.5999755859375,
      "text": " lamb without blemish and without spot, who verily was foreordained before the foundation"
    },
    {
      "id": 83,
      "start": 1725.5999755859375,
      "end": 1735.1599731445312,
      "text": " of the world, but was manifest in these last times, notice that phrase, for you, for you,"
    },
    {
      "id": 84,
      "start": 1735.1599731445312,
      "end": 1741.760009765625,
      "text": " who by him do believe in God that raised him up from the dead and gave him glory that your"
    },
    {
      "id": 85,
      "start": 1741.760009765625,
      "end": 1746.3999633789062,
      "text": " faith and hope might be in God, seeing you have purified your souls and obeying the truth"
    },
    {
      "id": 86,
      "start": 1746.3999633789062,
      "end": 1750.0799560546875,
      "text": " through the spirit unto unfeigned love of the brethren, see that you love one another"
    },
    {
      "id": 87,
      "start": 1750.0799560546875,
      "end": 1755.5199584960938,
      "text": " with a pure heart fervently, notice this in verse 23, being born again not of corruptible"
    },
    {
      "id": 88,
      "start": 1755.5199584960938,
      "end": 1764.6399536132812,
      "text": " seed but of incorruptible, by the word of God which liveth and abideth forever. In 2"
    },
    {
      "id": 89,
      "start": 1764.6399536132812,
      "end": 1770.0799560546875,
      "text": " Peter 1 and verse number 4, notice what he says here with regard to this truth of redemption"
    },
    {
      "id": 90,
      "start": 1770.0799560546875,
      "end": 1775.7799682617188,
      "text": " and being born again. He says this in 2 Peter 1 and verse number 4, whereby are given unto"
    },
    {
      "id": 91,
      "start": 1775.8200073242188,
      "end": 1781.2999877929688,
      "text": " us exceeding great and precious promises that by these ye might be partakers, notice this,"
    },
    {
      "id": 92,
      "start": 1781.2999877929688,
      "end": 1790.2999877929688,
      "text": " of the divine nature, having escaped the corruption that is in the world through lust. And as"
    },
    {
      "id": 93,
      "start": 1790.2999877929688,
      "end": 1796.0199584960938,
      "text": " we've been born again, we see this seed that is mentioned in verse number 9 of 1 John 3"
    },
    {
      "id": 94,
      "start": 1796.0199584960938,
      "end": 1800.4599609375,
      "text": " because we're born of God, his seed remaineth in us."
    },
    {
      "id": 0,
      "start": 1800.4599609375,
      "end": 1806.579960823059,
      "text": " understand here that we have been born again. We have this new seed, this new nature, this"
    },
    {
      "id": 1,
      "start": 1806.579960823059,
      "end": 1814.8199605941772,
      "text": " second birth. And so John speaks of sin. He speaks of our Savior. When he speaks of our"
    },
    {
      "id": 2,
      "start": 1814.8199605941772,
      "end": 1819.299961090088,
      "text": " Savior, he says, I want to remind you of what was accomplished at Calvary. I want to remind"
    },
    {
      "id": 3,
      "start": 1819.299961090088,
      "end": 1824.6999607086182,
      "text": " you why He came. And you know this, but I want to remind you that He came first to take"
    },
    {
      "id": 4,
      "start": 1824.6999607086182,
      "end": 1831.619960784912,
      "text": " away our sins. He came to destroy the works of the devil. He came to redeem mankind. The"
    },
    {
      "id": 5,
      "start": 1831.619960784912,
      "end": 1838.1799621582031,
      "text": " Bible says that the Son of Man came to seek and to save that which was lost. He's a seeking"
    },
    {
      "id": 6,
      "start": 1838.1799621582031,
      "end": 1842.899959564209,
      "text": " Savior. Listen, if you don't know the Lord Jesus Christ is your personal Savior this"
    },
    {
      "id": 7,
      "start": 1842.899959564209,
      "end": 1848.5399627685547,
      "text": " morning, He wants to save you. He wants to be your Savior. He wants to be your Redeemer."
    },
    {
      "id": 8,
      "start": 1848.5399627685547,
      "end": 1855.3399620056152,
      "text": " He loves you. He loves you beyond what you could ever imagine. Not only does He love"
    },
    {
      "id": 9,
      "start": 1855.3399620056152,
      "end": 1862.3399620056152,
      "text": " you, but He died for you. He took your place, the perfect substitute. The atonement was"
    },
    {
      "id": 10,
      "start": 1862.3399620056152,
      "end": 1868.9399642944336,
      "text": " made. You say, I'm going to try to figure it out myself. You could never pay the debt"
    },
    {
      "id": 11,
      "start": 1868.9399642944336,
      "end": 1877.2999572753906,
      "text": " that you owe. It's absolutely impossible. We are not redeemed with silver and gold as"
    },
    {
      "id": 12,
      "start": 1877.339958190918,
      "end": 1884.339958190918,
      "text": " we read there in 1 Peter chapter 2. We understand in chapter 1, excuse me, in verse 18, we understand"
    },
    {
      "id": 13,
      "start": 1884.9399642944336,
      "end": 1890.5399627685547,
      "text": " that it's not by works of righteousness which we have done. It's according to His mercy"
    },
    {
      "id": 14,
      "start": 1890.5399627685547,
      "end": 1895.859962463379,
      "text": " that He hath begotten us. For by grace are you saved through faith and that not of yourselves."
    },
    {
      "id": 15,
      "start": 1895.859962463379,
      "end": 1901.2599639892578,
      "text": " It is the gift of God, not of works, lest any man should boast. And this morning the"
    },
    {
      "id": 16,
      "start": 1901.2599639892578,
      "end": 1908.0199584960938,
      "text": " plan of redemption that we so hold dear is being reminded to the believers here that"
    },
    {
      "id": 17,
      "start": 1908.0199584960938,
      "end": 1912.6999588012695,
      "text": " John is writing to and to us as well this morning. So He speaks of sin, He speaks of"
    },
    {
      "id": 18,
      "start": 1912.6999588012695,
      "end": 1919.6999588012695,
      "text": " our Savior, He then speaks of our sanctification. Notice in the text of Scripture, we find that"
    },
    {
      "id": 19,
      "start": 1920.6999588012695,
      "end": 1926.2999572753906,
      "text": " John begins to address the subject of sanctification. It's once again necessary for us to point"
    },
    {
      "id": 20,
      "start": 1926.2999572753906,
      "end": 1932.1799621582031,
      "text": " out as we did, we saw this first in 1 John chapter 2 verses 3 through 6, and as we looked"
    },
    {
      "id": 21,
      "start": 1932.1799621582031,
      "end": 1936.8199615478516,
      "text": " at that passage of Scripture, I took some time to explain to you the verb tense in these"
    },
    {
      "id": 22,
      "start": 1936.8199615478516,
      "end": 1942.219955444336,
      "text": " particular verses, and we see it again in our passage of Scripture before us this morning."
    },
    {
      "id": 23,
      "start": 1942.219955444336,
      "end": 1946.5399627685547,
      "text": " Sometimes it's challenging to get the sense of the verb, but we find here that in this"
    },
    {
      "id": 24,
      "start": 1946.5399627685547,
      "end": 1952.0999603271484,
      "text": " passage of Scripture, just as it was in 1 John chapter 2 verses 3 through 6, that the"
    },
    {
      "id": 25,
      "start": 1952.0999603271484,
      "end": 1958.6199645996094,
      "text": " conjugation of the verb indicates an ongoing action. And it's important for us to understand"
    },
    {
      "id": 26,
      "start": 1958.6199645996094,
      "end": 1964.6599578857422,
      "text": " that because He says here, whosoever abideth in Him sinneth not. So some would take and"
    },
    {
      "id": 27,
      "start": 1964.6599578857422,
      "end": 1970.2599639892578,
      "text": " say, okay, well that means you could never commit a sin. But it's talking about this"
    },
    {
      "id": 28,
      "start": 1970.2599639892578,
      "end": 1977.2599639892578,
      "text": " because of the conjugation of the verb, it indicates that ongoing action, that lifestyle,"
    },
    {
      "id": 29,
      "start": 1977.4199676513672,
      "end": 1984.2999572753906,
      "text": " that behavior that is prevalent. And so He says, as He begins to speak about our sanctification,"
    },
    {
      "id": 30,
      "start": 1984.2999572753906,
      "end": 1989.979965209961,
      "text": " I want you to see first of all that He immediately deals with the subject of abiding in verse"
    },
    {
      "id": 31,
      "start": 1989.979965209961,
      "end": 1996.979965209961,
      "text": " number 6. Whosoever abideth in Him. Now think about John writing these words. John the apostle,"
    },
    {
      "id": 32,
      "start": 1999.2599639892578,
      "end": 2005.699966430664,
      "text": " he heard the Lord Jesus Christ speak in John 15 with regard to the truth of abide in me."
    },
    {
      "id": 33,
      "start": 2006.4999542236328,
      "end": 2013.4999542236328,
      "text": " And we find here that John immediately addresses the subject of abiding and he says this, that"
    },
    {
      "id": 34,
      "start": 2013.5399627685547,
      "end": 2019.6199645996094,
      "text": " whosoever abideth in Him sinneth not, whosoever sinneth hath not seen Him, neither known Him."
    },
    {
      "id": 35,
      "start": 2019.6199645996094,
      "end": 2023.979965209961,
      "text": " Little children, let no man deceive you. He that doeth righteousness is righteous, even"
    },
    {
      "id": 36,
      "start": 2023.979965209961,
      "end": 2028.4199676513672,
      "text": " as He is righteous. He that committed sin is of the devil, for the devil sinneth from"
    },
    {
      "id": 37,
      "start": 2028.4199676513672,
      "end": 2032.4599609375,
      "text": " the beginning. Skip down if you will to verse number 9. Whosoever is born of God doth not"
    },
    {
      "id": 38,
      "start": 2032.4599609375,
      "end": 2038.1399536132812,
      "text": " commit sin, for his seed remaineth in him, and he cannot sin because he is born of God."
    },
    {
      "id": 39,
      "start": 2038.1399536132812,
      "end": 2042.2999572753906,
      "text": " In this the children of God are manifest, and the children of the devil. Whosoever doeth"
    },
    {
      "id": 40,
      "start": 2042.2999572753906,
      "end": 2047.1799621582031,
      "text": " not righteousness is not of God, neither he that loveth not his brother. And really that's"
    },
    {
      "id": 41,
      "start": 2047.1799621582031,
      "end": 2052.259963989258,
      "text": " a segue into the next text of scripture that we'll study next week with regard to loving"
    },
    {
      "id": 42,
      "start": 2052.259963989258,
      "end": 2057.739959716797,
      "text": " the brethren there at the end of verse number 10. But we find here this morning that both"
    },
    {
      "id": 43,
      "start": 2057.739959716797,
      "end": 2065.979949951172,
      "text": " salvation and sanctification are of Christ. It's of Christ. Sometimes what happens is"
    },
    {
      "id": 44,
      "start": 2065.979949951172,
      "end": 2072.419952392578,
      "text": " we are saved, for by grace we are saved through faith. We understand that salvation is all"
    },
    {
      "id": 45,
      "start": 2072.419952392578,
      "end": 2078.179962158203,
      "text": " of Christ. Right? There's nothing I can do. I can't save myself. But somehow we get to"
    },
    {
      "id": 46,
      "start": 2078.179962158203,
      "end": 2085.419952392578,
      "text": " the point that we think sanctification is about me. And I'm trying, trying, trying,"
    },
    {
      "id": 47,
      "start": 2085.8199462890625,
      "end": 2092.0199584960938,
      "text": " this process of sanctification, and I'm really trying in my own flesh. Do you remember what"
    },
    {
      "id": 48,
      "start": 2092.0199584960938,
      "end": 2098.2599487304688,
      "text": " Paul said in Romans chapter number 7? He said, the things that I would, I do not. The things"
    },
    {
      "id": 49,
      "start": 2098.2599487304688,
      "end": 2105.419952392578,
      "text": " that I would not, that I do. Right? Paul's saying, I got this struggle going on, and"
    },
    {
      "id": 50,
      "start": 2105.419952392578,
      "end": 2109.979949951172,
      "text": " I have this difficulty and all of this that's going on. And he says, who shall deliver me?"
    },
    {
      "id": 51,
      "start": 2109.979949951172,
      "end": 2115.3799743652344,
      "text": " And he says, I thank God through Christ Jesus. Listen, sanctification is about the work of"
    },
    {
      "id": 52,
      "start": 2115.3799743652344,
      "end": 2124.0999755859375,
      "text": " the Holy Spirit of God, the work of Christ in us. It's not me trying, it's me yielding."
    },
    {
      "id": 53,
      "start": 2124.0999755859375,
      "end": 2131.0599670410156,
      "text": " Right? And as I yield my members, as he says there in Romans 6, 7, and 8, and you read"
    },
    {
      "id": 54,
      "start": 2131.0599670410156,
      "end": 2136.3599548339844,
      "text": " those passages of Scripture and you see how Paul is really giving a great dissortation"
    },
    {
      "id": 55,
      "start": 2136.3599548339844,
      "end": 2140.479949951172,
      "text": " on the subject of sanctification there in the middle of the book of Romans, here we"
    },
    {
      "id": 56,
      "start": 2140.479949951172,
      "end": 2147.199951171875,
      "text": " find that John is just simply talking about stating here quickly the subject of sanctification"
    },
    {
      "id": 57,
      "start": 2147.199951171875,
      "end": 2153.3999633789062,
      "text": " and the work that Christ does in us. Noah Webster in his 1828 Webster's Dictionary defines"
    },
    {
      "id": 58,
      "start": 2153.3999633789062,
      "end": 2162.719970703125,
      "text": " sanctification this way, the act of God's grace by which the affections of men are purified"
    },
    {
      "id": 59,
      "start": 2162.719970703125,
      "end": 2172.2799682617188,
      "text": " or alienated, it says this, from sin and the world and exalted to a supreme love to"
    },
    {
      "id": 60,
      "start": 2172.2799682617188,
      "end": 2179.8199462890625,
      "text": " God. That's a great definition. Let me read it one more time. The act of God's grace by"
    },
    {
      "id": 61,
      "start": 2179.8199462890625,
      "end": 2188.3599548339844,
      "text": " which the affections of men are purified or alienated from sin and the world and exalted"
    },
    {
      "id": 62,
      "start": 2188.3599548339844,
      "end": 2196.2799682617188,
      "text": " to a supreme love to God. That helps us understand the passage of Scripture and what's being"
    },
    {
      "id": 63,
      "start": 2196.2799682617188,
      "end": 2202.8399658203125,
      "text": " dealt with here with the subject of sanctification and the work that Christ is doing in us. Note"
    },
    {
      "id": 64,
      "start": 2202.8399658203125,
      "end": 2208.5199584960938,
      "text": " that he, Noah Webster, in fact, when you look at that dictionary, you'll see so many references"
    },
    {
      "id": 65,
      "start": 2208.5199584960938,
      "end": 2215.5799560546875,
      "text": " to the Word of God. And you find here that he speaks about God's grace by which the affections"
    },
    {
      "id": 66,
      "start": 2215.5799560546875,
      "end": 2219.699951171875,
      "text": " of men are purified. Remember what he said in verse number 3, and every man that hath"
    },
    {
      "id": 67,
      "start": 2219.699951171875,
      "end": 2226.2599487304688,
      "text": " this hope in him purifieth himself even as he is pure. He says this, or alienate it from"
    },
    {
      "id": 68,
      "start": 2226.2599487304688,
      "end": 2231.2599487304688,
      "text": " sin and the world. We see the discussion of sin here in this text of Scripture. And we"
    },
    {
      "id": 69,
      "start": 2231.2599487304688,
      "end": 2237.8199462890625,
      "text": " find that as we look here at this passage, and again, note a litmus test, if you will,"
    },
    {
      "id": 70,
      "start": 2237.8199462890625,
      "end": 2242.5399475097656,
      "text": " that John provides to his readers. We've seen this in previous texts of Scripture, and we"
    },
    {
      "id": 71,
      "start": 2242.5399475097656,
      "end": 2247.219970703125,
      "text": " understand that these tests are really to be self-administered. We like to give the"
    },
    {
      "id": 72,
      "start": 2247.219970703125,
      "end": 2254.0599670410156,
      "text": " test to other people. As I said to someone, I'd rather evaluate your life and you'd rather"
    },
    {
      "id": 73,
      "start": 2254.0599670410156,
      "end": 2261.0999755859375,
      "text": " evaluate my life because the process of self-evaluation is not very pleasant. But the Scriptures say,"
    },
    {
      "id": 74,
      "start": 2261.0999755859375,
      "end": 2269.3399658203125,
      "text": " but let a man examine himself. Amen? And so we find here that here what is being contrasted"
    },
    {
      "id": 75,
      "start": 2269.499969482422,
      "end": 2275.0199584960938,
      "text": " is really the children of God versus the children of the devil. Look in verse number 10. It says,"
    },
    {
      "id": 76,
      "start": 2275.0199584960938,
      "end": 2284.739959716797,
      "text": " in this the children of God are manifest and the children of the devil. So we see on one"
    },
    {
      "id": 77,
      "start": 2284.739959716797,
      "end": 2287.8999633789062,
      "text": " side the children of God, on the other the children of the devil. He says that they're"
    },
    {
      "id": 78,
      "start": 2287.8999633789062,
      "end": 2295.0599670410156,
      "text": " manifest. That means to be plainly recognized or known. In this, the children of God are manifest"
    },
    {
      "id": 79,
      "start": 2295.179962158203,
      "end": 2300.6599731445312,
      "text": " and the children of the devil. So here's the litmus test. Again, the verb tense is important"
    },
    {
      "id": 80,
      "start": 2300.6599731445312,
      "end": 2306.4599609375,
      "text": " for us to understand because it carries with it the idea of a continual or habitual practice. It's"
    },
    {
      "id": 81,
      "start": 2306.4599609375,
      "end": 2313.4999389648438,
      "text": " not saying that a believer will never sin, but sin is not going to be the pattern in our lives. Why?"
    },
    {
      "id": 82,
      "start": 2313.4999389648438,
      "end": 2319.8599853515625,
      "text": " Because the Holy Spirit of God lives within us. Listen, it's not saying that a sinning person"
    },
    {
      "id": 83,
      "start": 2319.8999633789062,
      "end": 2326.179931640625,
      "text": " isn't going to, excuse me, let me say it this way. It's not suggesting that a lost person is"
    },
    {
      "id": 84,
      "start": 2326.179931640625,
      "end": 2335.0999755859375,
      "text": " never going to, by happenstance, fulfill something in the law. Right? How many times I've heard people"
    },
    {
      "id": 85,
      "start": 2335.0999755859375,
      "end": 2339.5799560546875,
      "text": " say, are you a sinner? I've never murdered anybody. Well, I mean, I'm glad you didn't"
    },
    {
      "id": 86,
      "start": 2339.5799560546875,
      "end": 2346.219970703125,
      "text": " murder somebody. That doesn't mean that you're not a sinner. Right? And we find here that the"
    },
    {
      "id": 87,
      "start": 2346.219970703125,
      "end": 2354.4199829101562,
      "text": " reality is that, listen, lost men occasionally are going to obey the law. So it's not saying by"
    },
    {
      "id": 88,
      "start": 2354.4199829101562,
      "end": 2360.2599487304688,
      "text": " their occasional obedience, their occasional righteousness, that that makes them a child of"
    },
    {
      "id": 89,
      "start": 2360.2599487304688,
      "end": 2367.3799438476562,
      "text": " God. In like way, or in the same way, it does not mean that the believer, the child of God,"
    },
    {
      "id": 90,
      "start": 2367.3799438476562,
      "end": 2377.3799438476562,
      "text": " that has the occasional sin is not saved. It's the process of sanctification. It's the truth that"
    },
    {
      "id": 91,
      "start": 2377.3799438476562,
      "end": 2383.5799560546875,
      "text": " God has given to us. Really, Jesus said it this way, and we're familiar with this truth in Matthew"
    },
    {
      "id": 92,
      "start": 2383.5799560546875,
      "end": 2390.2999877929688,
      "text": " 7 and verse number 20, when He said, wherefore, by their fruits ye shall know them. Ye shall know"
    },
    {
      "id": 93,
      "start": 2390.2999877929688,
      "end": 2400.3399658203125,
      "text": " them. Listen, if you're a child of God this morning, if you've been born again, the Lord"
    },
    {
      "id": 0,
      "start": 2400.3399658203125,
      "end": 2416.699966430664,
      "text": " has put a desire in you to please Him. To have seen Him is to love Him. To love Him"
    },
    {
      "id": 1,
      "start": 2416.699966430664,
      "end": 2426.459966659546,
      "text": " is to want to please Him. And to please Him, there's no room for sin. Right? Again, I'm"
    },
    {
      "id": 2,
      "start": 2426.459966659546,
      "end": 2429.6799659729004,
      "text": " not saying, and neither is John, the Word of God is not saying that we're never going"
    },
    {
      "id": 3,
      "start": 2429.6799659729004,
      "end": 2433.759963989258,
      "text": " to sin because we understand that we're going to sin. And if we do, we have an advocate"
    },
    {
      "id": 4,
      "start": 2433.759963989258,
      "end": 2439.1199645996094,
      "text": " with the Father, Jesus Christ the righteous. If we confess our sins, He is faithful and"
    },
    {
      "id": 5,
      "start": 2439.1199645996094,
      "end": 2443.319965362549,
      "text": " just to forgive us and to cleanse us from all unrighteousness. And so He's not suggesting"
    },
    {
      "id": 6,
      "start": 2443.319965362549,
      "end": 2447.479965209961,
      "text": " that we're never going to sin. He's simply saying, it's not going to be a pattern in"
    },
    {
      "id": 7,
      "start": 2447.479965209961,
      "end": 2453.9399642944336,
      "text": " your life. It's not going to be habitual, continual. It's not going to be that you're"
    },
    {
      "id": 8,
      "start": 2453.9399642944336,
      "end": 2459.8999671936035,
      "text": " going to have this enjoying sin for all the days of your life. It's not this idea, as"
    },
    {
      "id": 9,
      "start": 2459.8999671936035,
      "end": 2466.259963989258,
      "text": " some have said, that, well, I got saved. I got my get out of the fire free kind of card"
    },
    {
      "id": 10,
      "start": 2466.259963989258,
      "end": 2475.6199645996094,
      "text": " and now I can live however I want to live. That's not real salvation. Because God does"
    },
    {
      "id": 11,
      "start": 2475.6199645996094,
      "end": 2482.859962463379,
      "text": " a work in us. We spoke about this in 1 John chapter number 2. We talked about this. Notice"
    },
    {
      "id": 12,
      "start": 2482.8999633789062,
      "end": 2487.419967651367,
      "text": " if you will, go back there just for a moment in verse number 5. But whoso keepeth his word"
    },
    {
      "id": 13,
      "start": 2487.419967651367,
      "end": 2494.099967956543,
      "text": " in him verily is the love of God perfected. Hereby know we that we are in him. And we"
    },
    {
      "id": 14,
      "start": 2494.099967956543,
      "end": 2499.5399627685547,
      "text": " looked at that verse of Scripture and we talked about the work that God is doing in us. Something"
    },
    {
      "id": 15,
      "start": 2499.5399627685547,
      "end": 2504.859962463379,
      "text": " amazing happens when we get saved. The Holy Spirit of God lives within us. And it begins"
    },
    {
      "id": 16,
      "start": 2504.859962463379,
      "end": 2512.0599670410156,
      "text": " to work in our hearts and our lives. All of a sudden, those things that we did, we have"
    },
    {
      "id": 17,
      "start": 2512.0599670410156,
      "end": 2518.0199661254883,
      "text": " less of a desire to do them. Why? Because the Holy Spirit of God begins to convict us."
    },
    {
      "id": 18,
      "start": 2518.0199661254883,
      "end": 2524.799964904785,
      "text": " The Holy Spirit of God begins to convict us that that behavior is not pleasing to God."
    },
    {
      "id": 19,
      "start": 2524.799964904785,
      "end": 2529.8599700927734,
      "text": " And as we yield to the Spirit of God in our lives, as we yield our lives to him as we"
    },
    {
      "id": 20,
      "start": 2529.8599700927734,
      "end": 2535.179962158203,
      "text": " grow is this process of sanctification. I'm thankful for positional sanctification, but"
    },
    {
      "id": 21,
      "start": 2535.179962158203,
      "end": 2540.3799591064453,
      "text": " the reality is that we're dealing with progressive sanctification. We're dealing with this walk"
    },
    {
      "id": 22,
      "start": 2540.419967651367,
      "end": 2546.1399688720703,
      "text": " with Christ all the days of our lives. And this continual growth, and the closer I get"
    },
    {
      "id": 23,
      "start": 2546.1399688720703,
      "end": 2553.1399688720703,
      "text": " to him, the less I want to displease him. I don't want to do that which is displeasing"
    },
    {
      "id": 24,
      "start": 2553.5799713134766,
      "end": 2560.5799713134766,
      "text": " to my God. I don't want to be engaged in sinful behavior. So when he says, whosoever abideth"
    },
    {
      "id": 25,
      "start": 2560.8599700927734,
      "end": 2565.8199615478516,
      "text": " in him sinneth not, I want you to think about this in verse number 6. As you're abiding"
    },
    {
      "id": 26,
      "start": 2565.8199615478516,
      "end": 2570.939971923828,
      "text": " in him, as you're walking with him, as you're in daily fellowship with him, does that not"
    },
    {
      "id": 27,
      "start": 2570.939971923828,
      "end": 2577.939971923828,
      "text": " have an impact on your behavior? Let me illustrate it simply by talking about a child this morning,"
    },
    {
      "id": 28,
      "start": 2578.4599609375,
      "end": 2583.4599609375,
      "text": " a child that is in your presence. Parents, your children are there with you. They're"
    },
    {
      "id": 29,
      "start": 2583.4599609375,
      "end": 2589.419967651367,
      "text": " in your presence. You're walking with them. How does your presence affect their behavior?"
    },
    {
      "id": 30,
      "start": 2589.419967651367,
      "end": 2596.419967651367,
      "text": " Probably positively, right? Normally, listen, I never took a cookie from the cookie jar"
    },
    {
      "id": 31,
      "start": 2596.6599731445312,
      "end": 2603.6599731445312,
      "text": " when my mom was watching me. That'd just be dumb. But when she wasn't watching, cookies"
    },
    {
      "id": 32,
      "start": 2610.0599670410156,
      "end": 2617.0599670410156,
      "text": " are available, right? Why? Because she wasn't present. I use Zachary as an example. I use"
    },
    {
      "id": 33,
      "start": 2619.5399627685547,
      "end": 2622.939971923828,
      "text": " Zachary as an illustration. He was eating a donut yesterday and he was trying to hide"
    },
    {
      "id": 34,
      "start": 2622.939971923828,
      "end": 2627.739959716797,
      "text": " it. It was so cute. He was trying to hide eating his donut, but he had chocolate all"
    },
    {
      "id": 35,
      "start": 2627.739959716797,
      "end": 2633.259963989258,
      "text": " over the side of his mouth. Right? Didn't he? I said, well, Zachary, if you're going"
    },
    {
      "id": 36,
      "start": 2633.259963989258,
      "end": 2638.3399658203125,
      "text": " to hide that donut, you better get rid of that chocolate. He wasn't hiding it from"
    },
    {
      "id": 37,
      "start": 2638.3399658203125,
      "end": 2645.0599670410156,
      "text": " Pierre and Kimberly, just for the record. They knew he was eating it. But the reality"
    },
    {
      "id": 38,
      "start": 2645.0599670410156,
      "end": 2651.259963989258,
      "text": " is that when we're abiding in him, it's going to impact our behavior. Why? Because we're"
    },
    {
      "id": 39,
      "start": 2651.259963989258,
      "end": 2657.939971923828,
      "text": " living in his presence. I believe that's what we find the secret in the life of Joseph."
    },
    {
      "id": 40,
      "start": 2657.939971923828,
      "end": 2662.219970703125,
      "text": " When you go back to the book of Genesis and you read the life of Joseph, he's in a foreign"
    },
    {
      "id": 41,
      "start": 2662.219970703125,
      "end": 2668.699951171875,
      "text": " land, in a foreign place, a different culture, a different language. He's been sold. He's"
    },
    {
      "id": 42,
      "start": 2668.699951171875,
      "end": 2675.6199645996094,
      "text": " been, I mean, it's a mess of what's happened. And day by day, Potiphar's wife comes and"
    },
    {
      "id": 43,
      "start": 2675.6199645996094,
      "end": 2681.97998046875,
      "text": " says, lie with me. But I believe with all of my heart that Joseph lived in the presence"
    },
    {
      "id": 44,
      "start": 2681.97998046875,
      "end": 2689.3599548339844,
      "text": " of God. Because when Potiphar's wife said, perfect opportunity, nobody's here. He said,"
    },
    {
      "id": 45,
      "start": 2689.3599548339844,
      "end": 2697.6399536132812,
      "text": " how can I sin and do this great wickedness against God? He lived in the presence of God."
    },
    {
      "id": 46,
      "start": 2697.6399536132812,
      "end": 2703.2999572753906,
      "text": " From a New Testament perspective, we could say that he was abiding. And when we're abiding"
    },
    {
      "id": 47,
      "start": 2703.2999572753906,
      "end": 2708.97998046875,
      "text": " in him, when we're walking with Christ, when we're living in his presence, it's going to"
    },
    {
      "id": 48,
      "start": 2708.97998046875,
      "end": 2719.6199645996094,
      "text": " impact our behavior. Can I remind you this morning that Jesus is always with you? It"
    },
    {
      "id": 49,
      "start": 2719.6199645996094,
      "end": 2725.919952392578,
      "text": " just needs to be a reminder for us that we're in his presence. We're abiding in him. How"
    },
    {
      "id": 50,
      "start": 2725.919952392578,
      "end": 2732.5399780273438,
      "text": " many times have we driven down the highway and people are just cruising along? I mean,"
    },
    {
      "id": 51,
      "start": 2732.5399780273438,
      "end": 2738.5599670410156,
      "text": " just flying. I've said to the kids, Joseph just got his permit on Wednesday. I've said"
    },
    {
      "id": 52,
      "start": 2738.5599670410156,
      "end": 2742.8999633789062,
      "text": " to all of them as we've driven over the years, man, I'm going seven miles an hour over the"
    },
    {
      "id": 53,
      "start": 2742.8999633789062,
      "end": 2747.6199645996094,
      "text": " speed limit and these people are just flying past me like I'm sitting still. Right? You"
    },
    {
      "id": 54,
      "start": 2747.6199645996094,
      "end": 2755.3799743652344,
      "text": " guys experienced that, right? But then all of a sudden they see one of those police cars."
    },
    {
      "id": 55,
      "start": 2755.3799743652344,
      "end": 2762.1399536132812,
      "text": " Have you seen it? What happens? Everyone wants to hit their brake and get over. Now"
    },
    {
      "id": 56,
      "start": 2762.1399536132812,
      "end": 2767.919952392578,
      "text": " my understanding is that they've already seen that you're speeding before you saw them."
    },
    {
      "id": 57,
      "start": 2767.919952392578,
      "end": 2778.2999572753906,
      "text": " Is that right? That's right. Their LIDAR is better than your eyesight. But why do people"
    },
    {
      "id": 58,
      "start": 2778.2999572753906,
      "end": 2786.2799682617188,
      "text": " behave that way? Because the presence of that law enforcement officer is a reminder"
    },
    {
      "id": 59,
      "start": 2786.2799682617188,
      "end": 2793.8399658203125,
      "text": " that they're breaking the law and they need to correct their behavior. Right? We see it"
    },
    {
      "id": 60,
      "start": 2793.8399658203125,
      "end": 2802.5999755859375,
      "text": " in life. But spiritually speaking, we need to abide in him. And as we abide in him, as"
    },
    {
      "id": 61,
      "start": 2802.5999755859375,
      "end": 2808.5199584960938,
      "text": " we think about this truth of sanctification, we're going to, no, not be sinless, but we're"
    },
    {
      "id": 62,
      "start": 2808.5199584960938,
      "end": 2817.5399780273438,
      "text": " going to sin less and less. Why? Because I'm living in his presence. This morning, when"
    },
    {
      "id": 63,
      "start": 2817.5399780273438,
      "end": 2824.179962158203,
      "text": " you think of sin, that was the first thing that John spoke of. Remember that sin is awful."
    },
    {
      "id": 64,
      "start": 2824.179962158203,
      "end": 2831.8999633789062,
      "text": " The second thing, when you think of our Savior, rejoice in what was accomplished. Taking our"
    },
    {
      "id": 65,
      "start": 2831.8999633789062,
      "end": 2837.999969482422,
      "text": " sins out of the way, destroying the works of the devil, providing redemption. And when"
    },
    {
      "id": 66,
      "start": 2837.999969482422,
      "end": 2846.679962158203,
      "text": " you think of sanctification, remember this morning that it requires abiding. So often"
    },
    {
      "id": 67,
      "start": 2846.679962158203,
      "end": 2853.5999755859375,
      "text": " we're trying to do it ourselves. We can't save ourselves. And we need God's grace in"
    },
    {
      "id": 68,
      "start": 2853.5999755859375,
      "end": 2860.3599548339844,
      "text": " this area of sanctification. Because the more I try, the more frustrated I become. And the"
    },
    {
      "id": 69,
      "start": 2860.3599548339844,
      "end": 2865.6399536132812,
      "text": " more I echo the words of Paul, the things that I would, I do not. And the things that"
    },
    {
      "id": 70,
      "start": 2865.6399536132812,
      "end": 2870.5599670410156,
      "text": " I would not, that I do. Let's pray together. Father, we love you this morning. We thank"
    },
    {
      "id": 71,
      "start": 2870.5599670410156,
      "end": 2876.3199768066406,
      "text": " you for loving us. We thank you for the Word of God. We thank you for the passage of Scripture."
    },
    {
      "id": 72,
      "start": 2876.3199768066406,
      "end": 2881.3999633789062,
      "text": " And God, I pray that you'd help us, those of us that are saved, that have been born"
    },
    {
      "id": 73,
      "start": 2881.3999633789062,
      "end": 2889.1599731445312,
      "text": " again, declared righteous, that we would live righteous lives. I pray this morning that"
    },
    {
      "id": 74,
      "start": 2889.1599731445312,
      "end": 2892.9599609375,
      "text": " if there's one that's not sure of heaven, God, I pray that today would be the day of"
    },
    {
      "id": 75,
      "start": 2892.9599609375,
      "end": 2902.739959716797,
      "text": " their salvation, that they would understand that you loved them, that you died for them,"
    },
    {
      "id": 76,
      "start": 2902.739959716797,
      "end": 2912.9199829101562,
      "text": " that you rose again conquering sin, death, and the grave. The only way to heaven is through"
    },
    {
      "id": 77,
      "start": 2912.9199829101562,
      "end": 2919.0799560546875,
      "text": " the Lord Jesus Christ. Neither is there salvation in any other, for there's no other name given"
    },
    {
      "id": 78,
      "start": 2919.0799560546875,
      "end": 2925.3199462890625,
      "text": " among men whereby we must be saved. God, I pray that if there's one not sure of heaven,"
    },
    {
      "id": 79,
      "start": 2925.3199462890625,
      "end": 2932.3599853515625,
      "text": " they'd get that settled this morning. Father, for those of us that are your children, would"
    },
    {
      "id": 80,
      "start": 2932.3599853515625,
      "end": 2939.3999633789062,
      "text": " you help us in this process, this process of sanctification? I'm thankful that salvation"
    },
    {
      "id": 81,
      "start": 2939.3999633789062,
      "end": 2945.719970703125,
      "text": " is the miracle of a moment, but as someone said, sanctification is the process of a lifetime."
    },
    {
      "id": 82,
      "start": 2946.6799926757812,
      "end": 2952.9599609375,
      "text": " God, would you help us to abide in you? Would you help us to yield ourselves to thee? God,"
    },
    {
      "id": 83,
      "start": 2952.9599609375,
      "end": 2959.2799682617188,
      "text": " would you help us to walk daily in your presence so that we would sin less and less, that we"
    },
    {
      "id": 84,
      "start": 2959.2799682617188,
      "end": 2965.5999755859375,
      "text": " would do righteousness, that we'd live and lead lives that are pleasing in thy sight?"
    },
    {
      "id": 85,
      "start": 2965.5999755859375,
      "end": 2969.1599731445312,
      "text": " Well, thank you for the work that you'll do. For it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T14:34:29.943552"
}