{
  "video_id": "Wiu68PR_4NQ",
  "text": "36 this evening, the book of Genesis. We're back to this study through the book of Genesis and Genesis chapter 36. We'll look at the entire chapter and this is lesson number 77. If you keep track of what lesson number they are in the book of Genesis, this is lesson number 77 and it's been a long study. Next time we will begin the life of Joseph in Genesis chapter 37. I am so thrilled about that and of course chapter 38, if you're familiar with the book of Genesis, does not deal with the life of Joseph, Judah and Tamar, and then in chapter 39 we get back to the life of Joseph. I mentioned to my children, actually all of them this week, I think to Holly as well and to even a couple other folks, that Genesis chapter 36 I think might be the hardest chapter in the book of Genesis to preach through. And if you came here this evening to hear me say all the names in Genesis chapter 36, you are going to be disappointed because I am not going to read all of Genesis chapter 36. If you want to record yourself reading all of those names and listen to it, that would be perfectly fine, but I'm not going to take the time this evening nor am I going to struggle through saying all of these names. I have read it. I've read it to myself many times and I've tried to pronounce the names as best as possible, but I will tell you there's some tongue twisters in there and not only that, but you start saying all these names that are just different and you're saying one after the other, after the other, after the other. It's challenging. So we'll just look at the first nine verses, but we'll deal with the entirety of the chapter. I hope that it will be a blessing to you this evening. I believe that this chapter provides us, obviously, we know that the chapter provides us with a record of Esau's family tree. When I think about Esau's family tree, I believe that God gave us this record. You understand that all scripture is given by inspiration of God. There's a purpose in every portion of scripture that God has given us. I know that there are times in which people will jokingly say, and I believe that they're primarily joking, unfortunately at times I think there's some measure of seriousness to it, where people say, well, you know, I really kind of skipped through the book of Leviticus. Don't. There's good stuff in the book of Leviticus for us today. I understand that we're New Testament believers and I'm so thankful to be a New Testament believer, not under the law, but man, when you understand what was going on in the book of Leviticus, it's helpful for us to understand that God preserved it for us for a purpose. Sometimes people get to the first book of Chronicles and they start looking at those first several chapters and say, man, I can't even get through that. I just, I've heard people say this to me many times. I just skip over the first several chapters of the book of First Chronicles. Don't. God gave it to us for a purpose, for a reason. I understand that genealogies can be challenging. I understand that they're difficult. We can get into a rut. We're just reading names, but really ask the spirit of God to teach you and to help you understand. You can read in some of the other chapters of God's word. Ezra and Nehemiah provide long list of names of people. Listen, I'm thankful when you read through Ezra and Nehemiah. Listen, God made it a point to write down the names of the people that left Babylon and went back. Praise God. And we get to read about them and get to understand some of what took place. When we look at Genesis 36 and we say, why did God give us this record? I believe that as we study Genesis chapter 36, it really enables us to connect some dots. That's the phraseology that I'll use this evening. We think about the life of Esau and think about all that God gives us throughout his word. This chapter helps us to be able to connect some dots biblically. In verse number one of Genesis 36, the Bible says, now these are the generations of Esau who is Edom. Esau took his wives and the daughters of Canaan, Ada, the daughter of Elon, the Hittite, and Aholobama, the daughter of Anna, the daughter of Zibion, the Hittite, and Bashamath, Ishmael's daughter, the sister of Nebojah, and Ada bared to Esau Eliphaz and Bashamath bared Rehul and Aholobama bared Jeush and Jalem and Korah. These are the sons of Esau, which were born unto him in the land of Canaan. And Esau took his wives and his sons and his daughters and all the persons of his house and his cattle and all his beast and all his substance, which he had got in the land of Canaan and went into the country from the face of his brother Jacob. Verse number seven, for their riches were more than that they might dwell together in the land wherein they were strangers could not bear them because of their cattle. Thus dwelt Esau in Mount Seir. Esau is Edom. These are the generations of Esau, the father of the Edomites in Mount Seir. And so we see in verse number one again in verse number eight, where the Bible says Esau is Edom, Esau who is Edom. And we find they dwell in Mount Seir and that he is the father of the Edomites. I believe this evening, even as we get into the passage of Scripture, that it's important that we remember some important things that took place previous in the life of Esau and the first one that I want to remind you of. And really, just by way of introduction, some reminders before we dive into this passage of Scripture. I want you to be reminded of the struggle within the womb, the struggle within the womb. If you go back to Genesis chapter number twenty five and we'll just look at a couple of verses, we'll quickly go over these. But the reality is that some of these messages from Genesis twenty five, for instance, I preach that message about 18 months ago. This was a long time ago. And so when we look at Genesis chapter twenty five, some of you weren't here 18 months ago. Some of us have a hard time remembering what happened 18 minutes ago. And so we look here and we find that the Bible tells us in Genesis chapter twenty five and verse number twenty one, it says, And Isaac entreated the Lord for his wife because she was barren. And the Lord was entreated of him. And Rebecca, his wife, conceived and the children struggled together within her. And she said, if it be so, why am I thus? And she went to inquire the Lord. There was a struggle within the womb and she didn't understand what was going on. And so she inquired of the Lord. Notice in verse twenty three, the Bible tells us that the the Lord said unto her, two nations are in thy womb and two matter of people shall be separated from thy vows. And the one people shall be stronger than the other people and the elder shall serve the younger. So we are reminded about the struggle in the womb and we understand that God gave us this truth in Genesis chapter twenty five with regard to the struggle that's in the womb. Contextually, it's two nations. We find that it says that in verse number twenty three, two nations are in thy womb. We understand those two nations, the two children are Esau and Jacob. And we understand that Esau becomes the father. He's he's Edom. He's the father of the Edomites. And then, of course, Jacob, the Israelites. And so we see here in Genesis chapter twenty five when we're reminded of the struggle in the womb, the two nations. Contextually, you have the Edomites and the Israelites. But by application or with symbolism, if you will, you see not only two nations, but you see two natures. And I dealt with this when we preached to this chapter in Genesis twenty five again about 18 months ago. But when you think about the symbolism or the application of the two natures, we see the the contextual truth is that there are two nations we think about the two natures. You think about the old man and the new man. And the reality is that if you've been born again, you have an old man and you have a new man. You have the old nature and you have the new nature. And I'm so thankful to be born again. I'm thankful to have the truth that I've been quickened. I've been made alive. But the reality is that we still have that old nature. The old man still is around the flesh. And we think about the two natures that are represented here throughout the struggle in the womb, and we find this old man versus new man, the flesh versus the spirit. We find that the Bible says, and it's true even of the nations contextually, but it's true of the natures by way of application that the elder shall serve the younger after we are saved. Listen, our new man is younger than our old man. You got your old man the day that you were born physically. The new man is younger than the old man, but the old man is to serve the younger. The old man is to be mortified. The old man is to be crucified. And so we find that there's the symbolism that's here in Genesis chapter twenty five and keeping that with our within our minds as our first reminder, as we get into Genesis chapter thirty six, we must remember the struggle within the womb. I would say this. We must remember that Esau sold his birthright. And the same chapter in Genesis twenty five, the end of the chapter records for us how that Esau sold his birthright. The Bible says in verse number thirty, picking it up there and Esau in Genesis twenty five. And Esau said to Jacob, feed me, I pray thee with that same red pottage for I am faint. Therefore was his name called Edom. And Jacob said, sell me this day thy birthright. And Esau said, behold, I'm at the point to die. And what profit shall this birthright do to me? And Jacob said, swear to me this day. And he swore to him and he sold his birthright unto Jacob. Then Jacob gave Esau bread and pottage of lentils. And he did eat and drink and rose up and went his way. Notice the Bible says thus Esau despised his birthright. The word despised means to hold in low regard. And you think about this truth where he sold his birthright. Again, it's something that we need to be mindful of as we enter into Genesis chapter thirty six. And then I would say the third thing that we're reminded of, we see the struggle within the room. We see the the selling of the birthright. But we also see the subtlety of Jacob. And we dealt with this in Genesis chapter twenty seven. As you look at Genesis chapter twenty seven, we read about the subtlety of Jacob. This is with regard to the blessing. Remember that the process has come and Isaac is going to give a blessing. And we see what's taking place. And the instruction is given to Esau. Isaac was old. He was dim in his eyes. He could not see well. He calls for Esau. But when he Esau heard or received the instruction, we understand that Rebecca overheard what was going on. And Rebecca gave instruction to Jacob. to go and to prepare and so on and so forth and she was gonna help. I'm gonna drop down just for sake of time to verse number 35. Notice what the Bible says and he said, this is Isaac speaking to Esau, and he said, thy brother, that would be Jacob, came with subtlety and hath taken away thy blessing. And he said, is not he rightly named Jacob, this is Esau speaking, for he hath supplanted me these two times, he took away my birthright, and behold now he hath taken away my blessing. And he said, hast thou not reserved a blessing for me? And Isaac answered and said unto Esau, behold I have made him thy Lord, and all his brethren have I given to him for servants, and with corn and wine have I sustained him, and what shall I do now unto thee my son? And we find that Esau responds in verse 38, he says unto his father, hast thou but one blessing, my father. Bless me, even me also, my father. And Esau lifted up his voice and wept. Esau was never concerned about spiritual things. He was only ever concerned about temporal things. And we see that here in Genesis chapter number 27. What is he pleading for? What is he desiring? He's really desiring a temporal blessing. He wants to be increased with goods, he wants to benefit with these things, and he's calling out, he's desiring this blessing, and we find that it's not going to be given because of the fact that the subtlety of Jacob and the blessing had been given to Jacob. And we find that the response of Esau is one of just anger and hatred, and he makes the decision, I'm gonna kill my brother. Of course that leads to Jacob fleeing to Laban and all that we've studied over the past several chapters of the book of Genesis. And so we see that as we look at these passages of Scripture, we're reminded of these three important events in the life of Esau. And then we come to Genesis chapter number 36. And in Genesis chapter number 36, God is really providing for us the record, as I said by way of introduction a moment ago, of Esau's family tree. And he's providing us with this record, and it helps us to understand not only some of what we just dealt with by way of review from those events in Genesis chapter number 25 and chapter number 27, but we also see that it will help us again connect some dots with regard to future events that will take place as we read through the Old Testament, and we begin to connect all these dots and see these interactions between these groups of people. So as we get into Genesis chapter 36, I want you to, if you're taking notes, number one this evening, I want you to consider with me the decisions of Esau. The decisions of Esau. We find, first of all, the decision with regard to his wives, and we find in verses 2 and 3 of Genesis chapter number 36 that the Bible tells us about his wives that he took. Now, it's very possible, in fact, there's a lot of debate that goes on with regard to the wives of Esau. There's some discrepancy with regard to names in a previous chapter with regard to the names of Esau's wife, and there are a number of theories that exist out there with regard to whether or not some of the names were adapted in order to not be offensive to Isaac and what have you. There's also the fact that in this chapter, in Genesis chapter number 36, it's giving us a picture of the family tree, not necessarily all the names of his wives. It is very possible they had more than three wives, but it might be that it's only these three wives that are listed here that gave him male children, sons, and thus the family tree that is provided. Listen, don't get mixed up, don't get sideways when someone tries to take something that seems to be an apparent contradiction and comes to you and says, look, there's a contradiction here. Listen, God is wiser than us. All Scripture is given by inspiration of God. A preacher of yesteryear said, and I've had it, I want to say, just ingrained in my brain, and I try to always be reminded myself of this when people come to me with apparent contradictions, that listen, if you think there's a mistake, you are mistaken. What do you do? You dig in, you dig deeper, you try to get along with God. Who gave us the Bible? God. The Holy Spirit is the author of Scripture, and He lives within you, He lives within me, He is the divine teacher, and so we seek the face of God. I do not believe there's an apparent contradiction, or I do not believe there's a contradiction here at all, even though at surface level somebody could say, look, the names are different and what's going on, that here God is providing us with the record of the family tree. But I want you to think about the decisions. We think about his wives that are listed here in verses 2 and 3 of Genesis chapter number 36, and those names are given to us. I ask this question when I consider the decisions of Esau. I say this, why did Esau choose the wives that he did? What was the process in which Esau went through in order to determine who he would marry? By the way, we of course are not in favor of polygamy, as we'd see here with multiple wives, but we understand that marriage is of God, that God saw Adam. He said he's not good that man is left alone. For whoso findeth a wife, findeth a good thing, and obtain the favor of the Lord. And we find that God is the one that instituted and designed marriage. Marriage is not man's idea, it's God's idea. But listen, aside from salvation, who you marry is the most important decision you're ever going to make in your life. It really is. I married the wrong person. No, sorry, you got married. It's a tough deal. So how did he make the decision? Go back with me, Genesis chapter 26. By the way, thanks for asking the question. Genesis 26, look at verses 34 and 35. We did not touch on Genesis 26 by way of introduction. We looked at chapter 25 and 27, but I want you to notice the Bible says in verse 34, Esau was 40 years old when he took to wife Judith, the daughter of Barai, the Hittite, and Beshemoth, the daughter of Elam, the Hittite. Notice what the Bible says in verse 35, which were a grief of mind unto Isaac and to Rebekah. Huh. Verse 35 is interesting to me when I think about the decisions of Esau, the decision with regard to who he would marry. He did not seek the counsel of his parents. You know, the counsel, the Bible tells us that there's safety in a multitude of counselors, the Bible tells us. And I believe this evening that we think about the subject of marriage. There's great wisdom in an individual seeking the counsel of their parents. I've said to our children many times, listen, I might not be the best dad, but I'm the dad that God gave you. And I want my kids to understand, I've tried to teach them this over the years, that I'm not perfect. I'm not going to give perfect counsel, but I'm going to seek God's face and I'm going to pray. And listen, sometimes as a parent, God sometimes just gives you an uneasiness about something that you might not even be able to verbalize. God just doesn't give you a piece about it. And we find here that there's no, as we look at the passage of Scripture, it seems like there's no interest whatsoever on the part of Esau. Again, remember, he was never concerned about spiritual things, only concerned about temporal things, that which would please him temporarily. And the Bible tells us that this was a grief of mind unto Isaac and Rebekah. But there's further insight that is given to us in chapter 28. Notice, if you will, over in chapter 28, this is after the blessing is given in Genesis 27. And now, because Esau's ready to kill Jacob because of the subtlety of Jacob and all that's taken place, now Isaac is going to send Jacob away, his flight to Paddan Aram, as we mentioned earlier, when he go to Laban. And we find that Jacob is called into the presence of Isaac. And the Bible tells us in verse number one that Isaac is going to bless and charge Jacob. And notice what he says in verse number one. At the end of the verse, thou shalt not take a wife of the daughters of Canaan. Now, is that hard to understand? Very clear. Elementary education level of comprehension, basic truth. But I want you to see what the Bible says in verse number eight. And Esau, seeing that the daughters of Canaan pleased not Isaac, his father. How did he see that? Well, really, he heard the charge that was given from Isaac to Jacob. Thou shalt not take a wife of the daughters of Canaan. So we see that Jacob is receiving this instruction from his father, Isaac. And Esau, because he has no care, no concern about what his mom or dad would think. The Bible says that he sees that the daughters of Canaan pleased not Isaac, his father. Then went Esau unto Ishmael and took unto him a wife, which he had, Mahalath, the daughter of Ishmael, Abraham's son, the sister of Nebojah, to be his wife. And we see that he has made these decisions. If you look in chapter number 26, it speaks about the daughters of Canaan. Specifically, it says that he was 40 years old and he took the daughter of Bere the Hittite and the Beshemoth, the daughter of Elon the Hittite. And he takes these wives. We see here that Esau, again, he's making these decisions that are decisions that are really based on fleshly motives. Not concerned about the spiritual, not concerned about the eternal, but concerned for the temporal. We find that not only when we consider with us this evening the decision with regard to his wives, but then we think about the decision with regard to his dwelling place. And back in Genesis chapter 36, the Bible tells us... us in verse 6 and 7. By the way, it's quite interesting as you read verse 6 and 7 with regard to the expression of Esau in Genesis chapter 27 when he's pleading for a blessing. You know, God did bless Esau. God blessed Esau. And we find that we were reminded of that truth when we saw the reunion between Jacob and Esau. Remember, he said, I have enough. But in verse number 6, the Bible says, And Esau took his wives, and his sons, and his daughters, and all the persons of his house, and his cattle, and all the beasts, and all the substance which he had got in the land of Canaan, and went into the country from the face of his brother Jacob. For their riches were more than that they might dwell together in the land wherein they were strangers could not bear them because of their cattle. Do you remember another time in Scripture in the book of Genesis when this situation happened? Yeah. Abraham and Lot, right? And what happened? What was Lot's process for picking the place where he'd go? It's all his sight. He saw that it was a land that was pleasing. It was a place that was well watered. A place that would be appropriate and good for him. And the Bible tells us if you trace the steps of Lot, that initially he simply pitched his tent towards Sodom. He didn't move into Sodom on day one. He just pitched his tent towards Sodom. But before long, we see that he's in a place of leadership within the wicked city of Sodom. You see that progression, right? And Abraham, listen, Abraham gave him the choice. You pick. And he picked. And then we see Esau, he goes and he leaves and we see this decision that he makes with regard to his wives, the daughters of Canaan, as it's mentioned in verse number two of Genesis 36. And then we see the place where he goes. The place is Mount Seir. And we see that here. It's the south part of the Dead Sea area there. A place that was well fortified. A place that was extremely complicated for someone to come in and conquer because of just the land. The way that the land was set up and all of the caves and all of the structure and what have you. And we find that with the mountainous region there and that part of the landscape of Israel down there in Mount Seir, the southern part of the Dead Sea, it was a place that was just natural protection. And that's where he chooses to go. When we begin to think about these decisions of Esau, I ask myself this evening and I ask you tonight to consider how is it that we make decisions? See the reality is that we all make decisions. We make decisions every single day of our lives. Some decisions that we make are decisions that we don't even really think about. We just make the decision. We just go through the process and we just made decisions and we didn't even realize we were making decisions because we're just going through life and we're doing the things that we're doing. How many of you have ever had a situation where you said to your spouse, where would you like to go out to eat? And then there's like this process of time. So I told my family, I'm going to name a restaurant, I'm going to open a restaurant and I'm going to name it, I don't care. And if everyone truly goes to the restaurant that they say I don't care to their spouse, I will have a lot of business. Right? How many times is it a holly? Hey, let's go out to dinner. Where do you want to go? I don't care. And if I open a second restaurant, it's going to be called this. It doesn't matter. How many of you get that response? Come on. I know that somebody more than me gets that response. Right? And here's what I say to my family. Listen, I make decisions all day long. I don't care where we eat. Can somebody just make the decision? I say that all the time. I make decisions that are much more complicated than what I'm going to eat for dinner. It is important. I'm not going to salad works. Amen. And I don't even think that place exists anymore. But the reality is that we look at this and we say how is it that we make decisions? What's the process that we go through? Do we seek the face of God? Do we prayerfully consider that which is before us? Let me ask this. What are the consequences of your decisions? You know, in a real way, there are decisions that you make and that I make that we do not know what the consequences of that decision are going to be. We don't know. We make the decision. How many people make decisions without even considering the consequences? Maybe we say to somebody when they make a poor decision, we say what were you thinking? You ever had that thought? You ever had somebody maybe ask you that? Maybe you've asked yourself that. You made a decision and said that was not very smart. Self, what were you thinking when you made that decision? Right? We don't know the consequences. But can I tell you, can I say this this evening that you can rest assured there will be consequences to your decisions? There will be consequences to your decisions. Let me ask this. Who is impacted by your decisions? You know, we live in a midst of a people that are so self-focused that they think they make their decisions in a vacuum and their decisions only affect them. But those of us that have lived long enough and have been exposed to enough truth, we know that's just not true. Many people are affected by the decisions that we make. We make decisions every day. People say this is my life, I can do what I want to do. No, you're going to make decisions that are going to affect other people. Sometimes innocent people that don't even know who you are. But you've affected them. And I would submit to you this evening that the decisions that are made by Esau, specifically with regard to the wives, when we think about the process there and how he chose his wives and what he'd seen and what he'd understood, and we think about what's going on and we say, how are we making the decisions that we're making? Are we seeking godly counsel? Are we seeking the face of God? I referenced already the proverb that says there's safety in a multitude of counselors. I heard a preacher say recently, never make a major ministry decision on Monday, because Sunday might have been a rough day. And it was kind of comical to hear them say that, but they were being serious. They were trying to give some advice. And the reality is that when we make the decisions that we make, listen, sometimes we have some major, major decisions to make in life. And how do we make them? What are the consequences going to be? Sometimes we can't know all that those consequences are going to be, but we can rest assured those decisions are going to have consequences. And we can know this evening that there are people that are going to be impacted by the decisions that we make. I would say this, as we're reminded of that struggle within the womb, in Genesis chapter 25, the two natures, the flesh minds fleshly things. And if we're making decisions, we better make sure that we're not making them based on fleshly things. It's important that we understand that Esau, Edom, the Edomites, he was never concerned about spiritual things, temporal, fleshly things. So we notice the decisions of Esau. I want you to notice with me number two, the descendants of Esau. In verses four and five, we've read the verses already. In verses four and five, the Bible gives the record of his sons. It notes here that there are five sons that were born to Esau, Eliphaz, Reho, Jeus, Jalem, and Korah. His first two wives, according to the text of scripture, each had one son. The third had three sons, according to verse number five. We're going to think about these descendants of Esau. We find that in verses 11 through 43, it records for us, again, the portion of scripture that I'm not going to read publicly this evening for sake of time and all the names that are there, but it records for us future generations, grandchildren, et cetera. It is of note that we make mention this evening that verse number 12, notice there in that text of scripture, the Bible says, and Timnah was concubine to Eliphaz, Esau's son, and she bared to Eliphaz Amalek. Does that name ring a bell to you? Does that name connect some dots for you? These were the sons of Adah, Esau's wife. So, Amalek is the grandson of Esau. As we look here in the text of scripture, again, begin to trace some of these steps and connect some of the dots that are going on. We read of the descendants, a number of the names within the text of scripture. We really don't know anything much about them. We don't know of their descendants and all of those sorts of things. I made mention of this as we've studied through the book of Genesis, that you find that God takes the lens of scripture and he's taking the lens of human history. And we start with Adam and Eve there in Genesis and looking at the creation and what have you. And then we begin to look at all the children that are born and the generations and so on and so forth. And then the lens gets smaller and smaller as eventually it focuses down onto Abraham. And then we see that it focuses onto Isaac. And then we see that it focuses onto Jacob and to his descendants. And so, though the record is provided for us and it helps us with identifying some of the peoples that are mentioned and some of their descendants and what have you, you know that the specifics with regard to all of these descendants and all that they did are not provided to us within scripture. because the lens of Scripture is focusing on the Hebrew race, the Hebrew people, with regard to the, of course, Messianic line, and that's where Scripture goes. And so we find, however, that as we look at this passage of Scripture, we see the decisions, we see the descendants, but then I want you to think of this as we try to connect some dots this evening, number three. I want you to note with me the disputes with Edom, the disputes with Edom. So begin to think about what's taking place and try to connect dots with Scripture and understand here what God is giving us. I want you to turn to the book of Numbers, if you will, and I'm gonna provide with you, it's not an exhaustive list, it's just a number of examples of disputes that they have between the children of Israel and the children of Esau, the Edomites and the Israelites. Now remember, that struggle within the womb, there are two nations, right? It's what the Bible says. The Bible says the elder shall serve the younger. We find that God is connecting these dots for us and helping us to see what's taking place and we find, yes, the selling of the birthright, we see the subtlety of Jacob with the blessing. By the way, I mentioned this when I taught through that passage of Scripture in Genesis 27, there was no reason for Jacob to have to scheme. God had already promised in Genesis chapter number 25 that the elder shall serve the younger. There's no reason for you in your life or in my life to scheme, we just trust God. But here in Numbers chapter number 20, we find this dispute that is listed here with the Edomites or the people of Edom, the descendants of Esau. Notice, first of all, in Numbers chapter 20, in the wilderness. Notice, as the children of Israel had left Egypt, they've crossed the Red Sea, they're now in the wilderness. They've already disobeyed God, according to the evil report that was brought in Numbers chapter 14 and they said they weren't able, but we find in verse number 14, here in Numbers 20, the Bible says that Moses sent messengers from Cadiz unto the king of Edom. Thus saith thy brother Israel, thou knowest all the travail that hath befallen us, how our fathers went down into Egypt and we have dwelt in Egypt a long time, and the Egyptians vexed us and our fathers. And when we cried unto the Lord, he heard our voice and sent an angel and hath brought us forth out of Egypt. And behold, we are in Cadiz, a city in the outermost of thy border. Let us pass, I pray thee, through thy country. We will not pass through the fields or through the vineyards neither will we drink of the water of the wells. We will only go by the king's highway. We will not turn to the right hand nor to the left until we have passed thy borders. Now does the request of verse number 17 sound like a difficult thing? Were they really causing any trouble to Edom or the Edomites? And they just said, can we pass through? We're not gonna go through your fields, we're not gonna go through your vineyards, we're not gonna drink of your water or of your wells. We're gonna go the king's highway, we're not gonna turn to the right or to the left. I mean, we're just gonna pass through your borders. The Bible says that Edom said unto him, thou shalt not pass by me lest I come out against thee with the sword. It's an interesting response to a simple request, right? It seems like, damn it, if you guys wanna pass through, go ahead. The neighbor back here called and said, I got some tree work that I have to have done. It'd be really easy if the tree guys could come through your property to access my property because there's really no way for them to get to where they need to get to through my front yard. Is it okay? Sure, they can go through there, not a problem. I don't think, it's just easy, right? I don't know if it's a different situation, but what I'm saying is the response seems odd to the request but again, when you understand and start connecting the dots and see what's going on, the Bible says in verse 19, and the children of Israel said unto him, we'll go by the highway, and if I and my cattle drink of thy water, then I will pay for it. I will only, without doing anything else, go through on my feet. He said, thou shalt not go through. And Edom came out against him with much people and with a strong hand. Thus, Edom refused to give Israel passage through his border wherefore Israel turned away from him. The children of Israel, even the whole congregation, journeyed from Kadesh and came unto Mount Hor. We see this as a first dispute that we really see of what's going on. We see that the Bible records for us, I'm not gonna be able to take the time to go through all of them, but the Bible records for us in the times, the days of King Saul. There's battle that takes place with not only the Amalekites, we saw the grandson, Amalek, of Esau, but also with the Edomites. You can read that in 1 Samuel 14. You can read that in the days of David. Now, remember with me the history of Israel. In fact, it tells us, it's a very interesting statement that is given to us, you don't need to turn back there, but in Genesis 36 and verse number 31, it says, and these are the kings that reigned in the land of Edom before there reigned any king over the children of Israel. And you read about all those dukes and those chiefs and what have you there with the Edomites, and even before the kings of Israel, they had what was going on there in that land in Seir with the Edomites, but then as you begin to think about Israel's history and Saul being the first king, well, in the time of Saul, there's a battle with the Edomites. There are disputes that takes place and battles that are recorded. In the days of David, he's the next king of Israel. And we find that during his reign in the times of David, there's disputes that take place. In fact, the Bible tells us in 2 Samuel 8 and verse number 14, that during his reign, because David was mighty, the Lord was with him and the Lord gave him favor, the Lord preserved him withersoever he went, the Bible tells us, but it tells us in 2 Kings 8 and verse 14, that Edom, that David put garrisons in Edom and all they of Edom became David's servants. And again, we see these interactions that are taking place and all of a sudden we begin to connect these dots of what's going on in the days of Solomon. It's a sad thing, but the Bible tells us of Solomon, we know that he had many wives. You know, he had some wives that were the descendants of Edom, Edomites, Moabites, I mean, others, but Edomites were one of them that are specifically listed in 1 Kings 11 and verse number one. We find that in that text of scripture, it says, but King Solomon loved many strange women together with the daughter of Pharaoh, women of the Moabites, Ammonites, Edomites, Zidaneans and Hittites. Again, we see the Edomites referenced. It's interesting that God tells us in this same chapter in 1 Kings 11, it tells us how that God was angry with Solomon, why? Because of his evil, where he built these places of worship for these false gods of these wives that he married and all that was taking place. And we find that he also was burning incense and sacrificed one of their gods. And the Bible then tells us in verse 14 of 1 Kings 11, and the Lord stirred up an adversary unto Solomon, hey, dad, the Edomite. Hey, dad, the Edomite. He was the king's seed in Edom. The days of Amaziah, king of Judah, there's conflict, there are disputes with the Edomites. But I want you to think about the judgment upon the Edomites. I won't take time to look at any of the references. We're near the end this evening. But turn to the book of Jeremiah, if you will. Read two verses from the book of Jeremiah and Ezekiel and I encourage you to read the small book of Obadiah. And the book of Obadiah completely deals with Edom, the sons of Esau. Specifically goes back to Numbers 20. To the event that we read of in Numbers 20 where they said we're gonna pass through. He said, no, you're not. If you read the book of Obadiah, just a short book, you'll see that indictment against the Edomites that God gives through that prophet Obadiah. But notice in Jeremiah 49, and then we'll also notice over in the book of Ezekiel very quickly, but notice in Jeremiah 49, really beginning in verse number seven, it says concerning Edom, thus saith the Lord of hosts. I'm not gonna read all of it for sake of time. But we find that these are prophecies that are given against Edom. And we see specifically throughout this portion of the book of Jeremiah, the number of different places that are receiving these prophecies concerning against these particular people groups. And so concerning Edom, thus saith the Lord of hosts. And then skip down, if you will, in verse number 17, the Bible says also Edom shall be a desolation. Everyone that goeth by it shall be astonished and shall hiss at all the plagues thereof. The Bible says very similarly in the book of Ezekiel, look over, if you will, Ezekiel 25. In Ezekiel 25, in verses 12 through 14, we read this judgment that is given again in this portion of the book of Ezekiel, a number of different nations are being prophesied against. And in this particular text, it's against Edom. Beginning in verse number 12, the Bible says, thus saith the Lord God, because that Edom hath dealt against the house of Judah by taking vengeance and hath greatly offended and revenged himself upon them. Therefore, thus saith the Lord God, I will also stretch out mine hand upon Edom, will cut off man and beast from it, and I will make it desolate from Timan, and they of Dedan shall fall by the sword. And I will lay my vengeance upon Edom by the hand of my people Israel, and they shall do in Edom according to mine anger and according to my fury, and they shall know my vengeance, saith the Lord God. Those are pretty powerful judgments that are given by Jeremiah and Ezekiel. Again, you can read the book of Obadiah. What I wanna think about the application for us this evening in closing, as we think about this portion of Scripture and we read about some decisions and we read about the descendants, we read about the disputes. As we think about that, again, that symbolism, we talked about that struggle within the... womb, two nations. The elder shall serve the younger. We see that in scripture. We've just looked at a number of passages of disputes and all that's going on. You find that the Bible tells us, as I've made application, that not only is it two nations, but by application we'd see the two natures, the old man and the new man. And we need to think about the disputes that are recorded for us as we connect the dots historically and look at what's going on and begin to think about the dispute that we have between the old man and the new man. We think about trying to walk in the spirit. Turn to the book of Galatians, if you will. I want you to think about the struggle that we can face as we consider with this evening in this portion of scripture and think about the struggle that's there even within the womb in Genesis 25 and then as God provides us with this record. And we come to Galatians chapter number six and we seek to make this application and we find that the Bible tells us as we understand being saved, being born again, having the new man, the new nature, that the old man, the old man is not eradicated. In fact, in the book of Ephesians and the book of Colossians as well, both of those books go through a portion and Ephesians four specifically lays out at the whole end of that chapter, put off, put on. The book of Colossians deals with it the same way. We're to put off the old man and put on the new and here's what we're to do as we're to walk in this newness of life. But notice in Galatians five and verse 16, this I say then. It's a wonderful promise of God's word. Walk in the spirit and you shall not fulfill the lust of the flesh. How many of you know that your flesh still has lusts? Your flesh still has lusts. But the Bible says that if I walk in the spirit, I shall not fulfill the lust of the flesh. It doesn't say that I'm not going to have a lust of the flesh, so I'm going to be able to have victory. I'm not going to fulfill the lust of the flesh. Notice in verse 17, for the flesh lusteth against the spirit and the spirit against the flesh. Notice this, and these are contrary, the one to the other, so that you cannot do the things that you would. In verses 19 through 21, the Bible gives us the works of the flesh. In verse 22 and verse 23, the Bible gives us the fruit of the spirit. If you do a comparison between those two portions of scripture, the fruit of the spirit is far superior than the works of the flesh. And we ought to have a spiritually, or we ought to be spiritually minded people, not like Esau having that fleshly, that carnal, that temporary perspective of life, but that we'd have that perspective that is seeking to please God. I shared with those that came for the workers meeting tonight for vacation Bible school a verse of scripture that we're familiar with, but I was reading it just this past week and God just impressed upon my heart again, this wonderful truth where Jesus says, for I do always those things that please him in John 8 and verse 29. Esau wasn't concerned about doing things that please God. He wasn't concerned about doing things that would please his own father. And this evening, when we understand this struggle that we face, this two natures that's by way of application, the symbolism of those two nations that we read of with Jacob and Esau, we find this evening that the struggle, that they're at enmity one with the other. They're contrary one to the other. So this evening, what do we do? Well, notice what the Bible says over the book of Colossians. In Colossians chapter number three, familiar verses of scripture. I hope it will help us this evening to understand the importance of walking in the spirit and seeking to please God. The Bible says this, if ye then be risen with Christ. Are we risen with Christ? Spiritually speaking, if you've been saved, if you've been born again, you're risen with Christ. Notice what it says, seek those things which are above. Where Christ sitteth on the right hand of God. Notice what it says, set your affection on things above, not on things of the earth. Why? For you're dead, and your life is hid with Christ in God. When Christ, who is our life, praise the Lord for that little statement, who is our life, shall appear, then shall ye also appear with him in glory. Mortify therefore your members which are upon the earth. And he goes through, and this is the section of the book of Colossians that deals with that put off and put on portion of scripture. We make decisions in life, and it's the first point that we dealt with this evening. How do we make the decisions? Just go along with something because it's what somebody else is doing, it's something that's popular, it's something that's accepted. Or we sit back and say, you know, is this going to please God? What's the impact of this decision? What are the consequences of this decision? Is this decision that is before me really a decision that's going to be able to be made in a vacuum that's only going to affect me, that's only going to impact me? So as we look at the genealogy, really the descendants, the generations of Esau, in Genesis chapter 36, God helps us to connect some dots in scripture. God helps us to be able to see some of the historical content of preceding events in the life of Esau and then future interactions between the Edomites and the Israelites, the Amalekites. But this evening as we think about our own lives and try to make spiritual application, I'm going to focus on those few first thoughts with regard to our decisions. I hope this evening that we seek counsel, godly counsel. I hope this evening that we seek the face of God in the decisions that we're making. You say, well, listen, I'm older, it's not really that big of a deal. No, it is. It is. There are people watching you, your children, your grandchildren, if God has given them to you. If not, children in our church, those that were to be an example to you. Think about the admonition that's given in God's Word to those that are referred to as being the aged women and the aged men in church. Listen, there is a real biblical role that God gives in the epistles for aged women and aged men in a church to be able to influence and impact a future generation. And by the way, it's a role that is very rarely spoken about today, but it's so vital and it's so important. This evening, you have decisions, I have decisions. Are we trying to please ourselves like Esau did? What works best for me? We're going to take a piece of paper, we're going to lay it out and say, well, here's all the pros and here's all the cons. How many of you have heard somebody say that about making a decision? You know, that's not how we as Bible believers make decisions. Why? Because if God said to do something, it doesn't matter how many pros or cons there are. We do what God says. It doesn't matter how many people understand it. It doesn't matter how popular it might be. It doesn't matter what anyone else is doing. We say God has led and God has made it clear and this is the decision I have to make. Decisions have consequences. You can, in a certain sense, control your decisions, but not your consequences. How many times we face the consequences and we don't like them? We say, man, I wish I could have. The consequences are already in motion. It's already taken place. This evening, we see the generations of Esau. We can see the biblical, historical understanding of God giving us all of that information. Tonight, I hope that we can make a spiritual application. Say, God, help me to not be concerned about the temporal things, the fleshly things. Help me to be spiritually minded. Help me to please you with my life. Let's pray. Father, we love you. We thank you for loving us. We thank you for your word, the truth that's contained therein. God, I pray that as we've looked at this portion of Scripture and a number of other verses this evening, you help us to make application in our lives. Help us, Lord, to please you. Understand that we have decisions in our lives. Some decisions that are much more significant than other decisions, decisions that will have consequences that will impact others. Lord, I pray that you would help us to seek your face, would seek godly counsel, that we would walk in the Spirit, that our aim and desire would be most important to please you. I pray that as we have opportunity to respond this evening, have a moment of invitation, I pray that you'd move and work, guide us, and direct us, Lord. Help us to move and work. to be doers of the Word and not hearers only. Maybe somebody has some major decisions in front of them. God, would you give them wisdom? Would you give them leadership? Would you help them to seek your face? Would you help them to please you? I pray that you have your will and way, for it's in Christ's name we pray.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 3.9200000762939453,
      "text": " 36 this evening, the book of Genesis. We're back to this"
    },
    {
      "id": 1,
      "start": 3.9200000762939453,
      "end": 8.359999656677246,
      "text": " study through the book of Genesis and Genesis chapter 36. We'll look at the"
    },
    {
      "id": 2,
      "start": 8.359999656677246,
      "end": 9.5600004196167,
      "text": " entire chapter"
    },
    {
      "id": 3,
      "start": 9.5600004196167,
      "end": 14.079999923706055,
      "text": " and this is lesson number 77. If you keep track of what lesson number they"
    },
    {
      "id": 4,
      "start": 14.079999923706055,
      "end": 17.399999618530273,
      "text": " are in the book of Genesis, this is lesson number 77"
    },
    {
      "id": 5,
      "start": 17.399999618530273,
      "end": 23.15999984741211,
      "text": " and it's been a long study. Next time we will begin the life of"
    },
    {
      "id": 6,
      "start": 23.15999984741211,
      "end": 24.079999923706055,
      "text": " Joseph"
    },
    {
      "id": 7,
      "start": 24.079999923706055,
      "end": 28.200000762939453,
      "text": " in Genesis chapter 37. I am so thrilled about that"
    },
    {
      "id": 8,
      "start": 28.200000762939453,
      "end": 31.760000228881836,
      "text": " and of course chapter 38, if you're familiar with the book of"
    },
    {
      "id": 9,
      "start": 31.760000228881836,
      "end": 35.52000045776367,
      "text": " Genesis, does not deal with the life of Joseph, Judah and Tamar,"
    },
    {
      "id": 10,
      "start": 35.52000045776367,
      "end": 38.599998474121094,
      "text": " and then in chapter 39 we get back to the life of Joseph."
    },
    {
      "id": 11,
      "start": 38.599998474121094,
      "end": 42.47999954223633,
      "text": " I mentioned to my children, actually all of them this week, I think to Holly as"
    },
    {
      "id": 12,
      "start": 42.47999954223633,
      "end": 44.2400016784668,
      "text": " well and to even a couple other folks,"
    },
    {
      "id": 13,
      "start": 44.2400016784668,
      "end": 48.15999984741211,
      "text": " that Genesis chapter 36 I think might be the hardest chapter in the book of"
    },
    {
      "id": 14,
      "start": 48.15999984741211,
      "end": 49.52000045776367,
      "text": " Genesis to preach through."
    },
    {
      "id": 15,
      "start": 49.52000045776367,
      "end": 52.84000015258789,
      "text": " And if you came here this evening to hear me say all the names in Genesis"
    },
    {
      "id": 16,
      "start": 52.84000015258789,
      "end": 55.599998474121094,
      "text": " chapter 36, you are going to be disappointed"
    },
    {
      "id": 17,
      "start": 55.720001220703125,
      "end": 59.0,
      "text": " because I am not going to read all of Genesis chapter 36."
    },
    {
      "id": 18,
      "start": 59.0,
      "end": 62.400001525878906,
      "text": " If you want to record yourself reading all of those names"
    },
    {
      "id": 19,
      "start": 62.400001525878906,
      "end": 66.31999969482422,
      "text": " and listen to it, that would be perfectly fine, but I'm not going to take the time"
    },
    {
      "id": 20,
      "start": 66.31999969482422,
      "end": 67.08000183105469,
      "text": " this evening"
    },
    {
      "id": 21,
      "start": 67.08000183105469,
      "end": 71.4000015258789,
      "text": " nor am I going to struggle through saying all of these names. I have read"
    },
    {
      "id": 22,
      "start": 71.4000015258789,
      "end": 71.72000122070312,
      "text": " it."
    },
    {
      "id": 23,
      "start": 71.72000122070312,
      "end": 75.72000122070312,
      "text": " I've read it to myself many times and I've tried to pronounce the names as"
    },
    {
      "id": 24,
      "start": 75.72000122070312,
      "end": 76.83999633789062,
      "text": " best as possible,"
    },
    {
      "id": 25,
      "start": 76.83999633789062,
      "end": 79.95999908447266,
      "text": " but I will tell you there's some tongue twisters in there"
    },
    {
      "id": 26,
      "start": 79.95999908447266,
      "end": 83.55999755859375,
      "text": " and not only that, but you start saying all these names that are"
    },
    {
      "id": 27,
      "start": 83.55999755859375,
      "end": 86.5199966430664,
      "text": " just different and you're saying one after the other, after the other, after the"
    },
    {
      "id": 28,
      "start": 86.5199966430664,
      "end": 87.5999984741211,
      "text": " other. It's challenging."
    },
    {
      "id": 29,
      "start": 87.5999984741211,
      "end": 91.08000183105469,
      "text": " So we'll just look at the first nine verses, but we'll deal with the entirety of the"
    },
    {
      "id": 30,
      "start": 91.08000183105469,
      "end": 93.36000061035156,
      "text": " chapter. I hope that it will be a blessing to you this evening."
    },
    {
      "id": 31,
      "start": 93.36000061035156,
      "end": 96.5199966430664,
      "text": " I believe that this chapter provides us, obviously,"
    },
    {
      "id": 32,
      "start": 96.5199966430664,
      "end": 100.55999755859375,
      "text": " we know that the chapter provides us with a record of Esau's family tree."
    },
    {
      "id": 33,
      "start": 100.55999755859375,
      "end": 104.08000183105469,
      "text": " When I think about Esau's family tree, I believe that God gave us this record. You"
    },
    {
      "id": 34,
      "start": 104.08000183105469,
      "end": 107.16000366210938,
      "text": " understand that all scripture is given by inspiration of God."
    },
    {
      "id": 35,
      "start": 107.16000366210938,
      "end": 111.16000366210938,
      "text": " There's a purpose in every portion of scripture that God has given us."
    },
    {
      "id": 36,
      "start": 111.31999969482422,
      "end": 114.72000122070312,
      "text": " I know that there are times in which people will jokingly say,"
    },
    {
      "id": 37,
      "start": 114.72000122070312,
      "end": 118.27999877929688,
      "text": " and I believe that they're primarily joking, unfortunately at times I think"
    },
    {
      "id": 38,
      "start": 118.27999877929688,
      "end": 120.31999969482422,
      "text": " there's some measure of seriousness to it,"
    },
    {
      "id": 39,
      "start": 120.31999969482422,
      "end": 122.95999908447266,
      "text": " where people say, well, you know, I really kind of skipped through the book of"
    },
    {
      "id": 40,
      "start": 122.95999908447266,
      "end": 124.23999786376953,
      "text": " Leviticus. Don't."
    },
    {
      "id": 41,
      "start": 124.23999786376953,
      "end": 127.55999755859375,
      "text": " There's good stuff in the book of Leviticus for us today."
    },
    {
      "id": 42,
      "start": 127.55999755859375,
      "end": 130.8800048828125,
      "text": " I understand that we're New Testament believers and I'm so thankful"
    },
    {
      "id": 43,
      "start": 130.8800048828125,
      "end": 134.32000732421875,
      "text": " to be a New Testament believer, not under the law, but man, when you understand"
    },
    {
      "id": 44,
      "start": 134.32000732421875,
      "end": 135.72000122070312,
      "text": " what was going on in the book of Leviticus,"
    },
    {
      "id": 45,
      "start": 135.72000122070312,
      "end": 140.75999450683594,
      "text": " it's helpful for us to understand that God preserved it for us for a purpose."
    },
    {
      "id": 46,
      "start": 140.9199981689453,
      "end": 144.16000366210938,
      "text": " Sometimes people get to the first book of Chronicles and they start looking at"
    },
    {
      "id": 47,
      "start": 144.16000366210938,
      "end": 147.1199951171875,
      "text": " those first several chapters and say, man, I can't even get through that."
    },
    {
      "id": 48,
      "start": 147.1199951171875,
      "end": 149.39999389648438,
      "text": " I just, I've heard people say this to me many times."
    },
    {
      "id": 49,
      "start": 149.63999938964844,
      "end": 152.44000244140625,
      "text": " I just skip over the first several chapters of the book of First Chronicles."
    },
    {
      "id": 50,
      "start": 152.44000244140625,
      "end": 156.16000366210938,
      "text": " Don't. God gave it to us for a purpose, for a reason."
    },
    {
      "id": 51,
      "start": 156.39999389648438,
      "end": 158.52000427246094,
      "text": " I understand that genealogies can be challenging."
    },
    {
      "id": 52,
      "start": 158.52000427246094,
      "end": 160.63999938964844,
      "text": " I understand that they're difficult. We can get into a rut."
    },
    {
      "id": 53,
      "start": 160.63999938964844,
      "end": 161.67999267578125,
      "text": " We're just reading names,"
    },
    {
      "id": 54,
      "start": 161.8800048828125,
      "end": 165.0800018310547,
      "text": " but really ask the spirit of God to teach you and to help you understand."
    },
    {
      "id": 55,
      "start": 165.27999877929688,
      "end": 167.72000122070312,
      "text": " You can read in some of the other chapters of God's word."
    },
    {
      "id": 56,
      "start": 167.83999633789062,
      "end": 171.1999969482422,
      "text": " Ezra and Nehemiah provide long list of names of people."
    },
    {
      "id": 57,
      "start": 171.32000732421875,
      "end": 173.72000122070312,
      "text": " Listen, I'm thankful when you read through Ezra and Nehemiah."
    },
    {
      "id": 58,
      "start": 173.72000122070312,
      "end": 175.36000061035156,
      "text": " Listen, God made it a point to write down"
    },
    {
      "id": 59,
      "start": 175.55999755859375,
      "end": 177.75999450683594,
      "text": " the names of the people that left Babylon and went back."
    },
    {
      "id": 60,
      "start": 177.9600067138672,
      "end": 179.32000732421875,
      "text": " Praise God."
    },
    {
      "id": 61,
      "start": 179.52000427246094,
      "end": 182.63999938964844,
      "text": " And we get to read about them and get to understand some of what took place."
    },
    {
      "id": 62,
      "start": 182.63999938964844,
      "end": 185.63999938964844,
      "text": " When we look at Genesis 36 and we say, why did God give us this record?"
    },
    {
      "id": 63,
      "start": 185.83999633789062,
      "end": 189.24000549316406,
      "text": " I believe that as we study Genesis chapter 36,"
    },
    {
      "id": 64,
      "start": 189.44000244140625,
      "end": 193.0399932861328,
      "text": " it really enables us to connect some dots."
    },
    {
      "id": 65,
      "start": 193.0399932861328,
      "end": 195.47999572753906,
      "text": " That's the phraseology that I'll use this evening."
    },
    {
      "id": 66,
      "start": 195.67999267578125,
      "end": 197.24000549316406,
      "text": " We think about the life of Esau and think"
    },
    {
      "id": 67,
      "start": 197.44000244140625,
      "end": 199.8000030517578,
      "text": " about all that God gives us throughout his word."
    },
    {
      "id": 68,
      "start": 200.0,
      "end": 204.32000732421875,
      "text": " This chapter helps us to be able to connect some dots biblically."
    },
    {
      "id": 69,
      "start": 204.52000427246094,
      "end": 206.39999389648438,
      "text": " In verse number one of Genesis 36,"
    },
    {
      "id": 70,
      "start": 206.60000610351562,
      "end": 210.39999389648438,
      "text": " the Bible says, now these are the generations of Esau who is Edom."
    },
    {
      "id": 71,
      "start": 210.60000610351562,
      "end": 213.44000244140625,
      "text": " Esau took his wives and the daughters of Canaan, Ada,"
    },
    {
      "id": 72,
      "start": 213.63999938964844,
      "end": 217.60000610351562,
      "text": " the daughter of Elon, the Hittite, and Aholobama, the daughter of Anna,"
    },
    {
      "id": 73,
      "start": 217.8000030517578,
      "end": 221.0800018310547,
      "text": " the daughter of Zibion, the Hittite, and Bashamath, Ishmael's daughter,"
    },
    {
      "id": 74,
      "start": 221.0800018310547,
      "end": 225.67999267578125,
      "text": " the sister of Nebojah, and Ada bared to Esau Eliphaz and Bashamath"
    },
    {
      "id": 75,
      "start": 225.8800048828125,
      "end": 230.0800018310547,
      "text": " bared Rehul and Aholobama bared Jeush and Jalem and Korah."
    },
    {
      "id": 76,
      "start": 230.27999877929688,
      "end": 231.8800048828125,
      "text": " These are the sons of Esau,"
    },
    {
      "id": 77,
      "start": 232.0800018310547,
      "end": 234.44000244140625,
      "text": " which were born unto him in the land of Canaan."
    },
    {
      "id": 78,
      "start": 234.63999938964844,
      "end": 238.16000366210938,
      "text": " And Esau took his wives and his sons and his daughters and all the persons"
    },
    {
      "id": 79,
      "start": 238.16000366210938,
      "end": 241.16000366210938,
      "text": " of his house and his cattle and all his beast and all his substance,"
    },
    {
      "id": 80,
      "start": 241.36000061035156,
      "end": 244.1199951171875,
      "text": " which he had got in the land of Canaan and went into the country"
    },
    {
      "id": 81,
      "start": 244.1199951171875,
      "end": 245.67999267578125,
      "text": " from the face of his brother Jacob."
    },
    {
      "id": 82,
      "start": 245.8800048828125,
      "end": 246.67999267578125,
      "text": " Verse number seven,"
    },
    {
      "id": 83,
      "start": 246.8800048828125,
      "end": 250.83999633789062,
      "text": " for their riches were more than that they might dwell together in the land"
    },
    {
      "id": 84,
      "start": 250.83999633789062,
      "end": 255.39999389648438,
      "text": " wherein they were strangers could not bear them because of their cattle."
    },
    {
      "id": 85,
      "start": 255.60000610351562,
      "end": 258.2799987792969,
      "text": " Thus dwelt Esau in Mount Seir."
    },
    {
      "id": 86,
      "start": 258.4800109863281,
      "end": 261.0799865722656,
      "text": " Esau is Edom."
    },
    {
      "id": 87,
      "start": 261.2799987792969,
      "end": 265.79998779296875,
      "text": " These are the generations of Esau, the father of the Edomites in Mount Seir."
    },
    {
      "id": 88,
      "start": 265.79998779296875,
      "end": 268.0400085449219,
      "text": " And so we see in verse number one again in verse number eight,"
    },
    {
      "id": 89,
      "start": 268.239990234375,
      "end": 272.0799865722656,
      "text": " where the Bible says Esau is Edom, Esau who is Edom."
    },
    {
      "id": 90,
      "start": 272.2799987792969,
      "end": 274.5199890136719,
      "text": " And we find they dwell in Mount Seir"
    },
    {
      "id": 91,
      "start": 274.7200012207031,
      "end": 277.9200134277344,
      "text": " and that he is the father of the Edomites."
    },
    {
      "id": 92,
      "start": 278.1600036621094,
      "end": 279.3599853515625,
      "text": " I believe this evening,"
    },
    {
      "id": 93,
      "start": 279.55999755859375,
      "end": 282.67999267578125,
      "text": " even as we get into the passage of Scripture, that it's important"
    },
    {
      "id": 94,
      "start": 282.8800048828125,
      "end": 286.55999755859375,
      "text": " that we remember some important things that took place"
    },
    {
      "id": 95,
      "start": 286.760009765625,
      "end": 291.20001220703125,
      "text": " previous in the life of Esau and the first one that I want to remind you of."
    },
    {
      "id": 96,
      "start": 291.20001220703125,
      "end": 292.7200012207031,
      "text": " And really, just by way of introduction,"
    },
    {
      "id": 97,
      "start": 292.9200134277344,
      "end": 296.1600036621094,
      "text": " some reminders before we dive into this passage of Scripture."
    },
    {
      "id": 98,
      "start": 296.3599853515625,
      "end": 299.6000061035156,
      "text": " I want you to be reminded of the struggle within the womb,"
    },
    {
      "id": 99,
      "start": 299.79998779296875,
      "end": 301.1199951171875,
      "text": " the struggle within the womb."
    },
    {
      "id": 100,
      "start": 301.1199951171875,
      "end": 303.32000732421875,
      "text": " If you go back to Genesis chapter number twenty five"
    },
    {
      "id": 101,
      "start": 303.5199890136719,
      "end": 306.32000732421875,
      "text": " and we'll just look at a couple of verses, we'll quickly go over these."
    },
    {
      "id": 102,
      "start": 306.32000732421875,
      "end": 311.1600036621094,
      "text": " But the reality is that some of these messages from Genesis twenty five,"
    },
    {
      "id": 103,
      "start": 311.1600036621094,
      "end": 313.8399963378906,
      "text": " for instance, I preach that message about 18 months ago."
    },
    {
      "id": 104,
      "start": 314.0400085449219,
      "end": 315.20001220703125,
      "text": " This was a long time ago."
    },
    {
      "id": 105,
      "start": 315.3999938964844,
      "end": 317.44000244140625,
      "text": " And so when we look at Genesis chapter twenty five,"
    },
    {
      "id": 106,
      "start": 317.44000244140625,
      "end": 319.3599853515625,
      "text": " some of you weren't here 18 months ago."
    },
    {
      "id": 107,
      "start": 319.4800109863281,
      "end": 322.1600036621094,
      "text": " Some of us have a hard time remembering what happened 18 minutes ago."
    },
    {
      "id": 108,
      "start": 322.3599853515625,
      "end": 326.5199890136719,
      "text": " And so we look here and we find that the Bible tells us in Genesis chapter twenty"
    },
    {
      "id": 109,
      "start": 326.7200012207031,
      "end": 330.0,
      "text": " five and verse number twenty one, it says,"
    },
    {
      "id": 110,
      "start": 330.0,
      "end": 332.8800048828125,
      "text": " And Isaac entreated the Lord for his wife because she was barren."
    },
    {
      "id": 111,
      "start": 333.0799865722656,
      "end": 334.2799987792969,
      "text": " And the Lord was entreated of him."
    },
    {
      "id": 112,
      "start": 334.2799987792969,
      "end": 337.79998779296875,
      "text": " And Rebecca, his wife, conceived and the children struggled together within her."
    },
    {
      "id": 113,
      "start": 338.0,
      "end": 340.2799987792969,
      "text": " And she said, if it be so, why am I thus?"
    },
    {
      "id": 114,
      "start": 340.2799987792969,
      "end": 342.0799865722656,
      "text": " And she went to inquire the Lord."
    },
    {
      "id": 115,
      "start": 342.0799865722656,
      "end": 344.79998779296875,
      "text": " There was a struggle within the womb and she didn't understand what was going on."
    },
    {
      "id": 116,
      "start": 344.79998779296875,
      "end": 346.0799865722656,
      "text": " And so she inquired of the Lord."
    },
    {
      "id": 117,
      "start": 346.2799987792969,
      "end": 349.0,
      "text": " Notice in verse twenty three, the Bible tells us that the"
    },
    {
      "id": 118,
      "start": 349.20001220703125,
      "end": 352.8800048828125,
      "text": " the Lord said unto her, two nations are in thy womb"
    },
    {
      "id": 119,
      "start": 353.0799865722656,
      "end": 355.8800048828125,
      "text": " and two matter of people shall be separated from thy vows."
    },
    {
      "id": 120,
      "start": 356.0799865722656,
      "end": 357.4800109863281,
      "text": " And the one people shall be stronger"
    },
    {
      "id": 121,
      "start": 357.67999267578125,
      "end": 361.239990234375,
      "text": " than the other people and the elder shall serve the younger."
    },
    {
      "id": 122,
      "start": 361.44000244140625,
      "end": 363.20001220703125,
      "text": " So we are reminded about the struggle"
    },
    {
      "id": 123,
      "start": 363.20001220703125,
      "end": 366.79998779296875,
      "text": " in the womb and we understand that God gave us this truth in Genesis chapter"
    },
    {
      "id": 124,
      "start": 367.0,
      "end": 369.6000061035156,
      "text": " twenty five with regard to the struggle that's in the womb."
    },
    {
      "id": 125,
      "start": 369.79998779296875,
      "end": 372.2799987792969,
      "text": " Contextually, it's two nations."
    },
    {
      "id": 126,
      "start": 372.4800109863281,
      "end": 376.239990234375,
      "text": " We find that it says that in verse number twenty three, two nations are in thy womb."
    },
    {
      "id": 127,
      "start": 376.44000244140625,
      "end": 381.55999755859375,
      "text": " We understand those two nations, the two children are Esau and Jacob."
    },
    {
      "id": 128,
      "start": 381.760009765625,
      "end": 384.239990234375,
      "text": " And we understand that Esau becomes the father."
    },
    {
      "id": 129,
      "start": 384.44000244140625,
      "end": 385.2799987792969,
      "text": " He's he's Edom."
    },
    {
      "id": 130,
      "start": 385.4800109863281,
      "end": 386.8800048828125,
      "text": " He's the father of the Edomites."
    },
    {
      "id": 131,
      "start": 387.0799865722656,
      "end": 389.8399963378906,
      "text": " And then, of course, Jacob, the Israelites."
    },
    {
      "id": 132,
      "start": 390.0799865722656,
      "end": 391.9200134277344,
      "text": " And so we see here in Genesis chapter"
    },
    {
      "id": 133,
      "start": 392.1199951171875,
      "end": 395.6000061035156,
      "text": " twenty five when we're reminded of the struggle in the womb, the two nations."
    },
    {
      "id": 134,
      "start": 395.79998779296875,
      "end": 399.239990234375,
      "text": " Contextually, you have the Edomites and the Israelites."
    },
    {
      "id": 135,
      "start": 399.44000244140625,
      "end": 402.9599914550781,
      "text": " But by application or with symbolism, if you will,"
    },
    {
      "id": 136,
      "start": 403.1600036621094,
      "end": 407.6400146484375,
      "text": " you see not only two nations, but you see two natures."
    },
    {
      "id": 137,
      "start": 408.32000732421875,
      "end": 409.9599914550781,
      "text": " And I dealt with this when we preached"
    },
    {
      "id": 138,
      "start": 410.1600036621094,
      "end": 413.5199890136719,
      "text": " to this chapter in Genesis twenty five again about 18 months ago."
    },
    {
      "id": 139,
      "start": 413.7200012207031,
      "end": 415.0799865722656,
      "text": " But when you think about the symbolism"
    },
    {
      "id": 140,
      "start": 415.2799987792969,
      "end": 419.3599853515625,
      "text": " or the application of the two natures, we see the the contextual truth is"
    },
    {
      "id": 141,
      "start": 419.3599853515625,
      "end": 422.1199951171875,
      "text": " that there are two nations we think about the two natures."
    },
    {
      "id": 142,
      "start": 422.32000732421875,
      "end": 424.3599853515625,
      "text": " You think about the old man and the new man."
    },
    {
      "id": 143,
      "start": 424.55999755859375,
      "end": 426.32000732421875,
      "text": " And the reality is that if you've been"
    },
    {
      "id": 144,
      "start": 426.32000732421875,
      "end": 428.4800109863281,
      "text": " born again, you have an old man and you have a new man."
    },
    {
      "id": 145,
      "start": 428.4800109863281,
      "end": 430.79998779296875,
      "text": " You have the old nature and you have the new nature."
    },
    {
      "id": 146,
      "start": 430.9599914550781,
      "end": 432.760009765625,
      "text": " And I'm so thankful to be born again."
    },
    {
      "id": 147,
      "start": 432.9599914550781,
      "end": 436.239990234375,
      "text": " I'm thankful to have the truth that I've been quickened."
    },
    {
      "id": 148,
      "start": 436.239990234375,
      "end": 437.3599853515625,
      "text": " I've been made alive."
    },
    {
      "id": 149,
      "start": 437.55999755859375,
      "end": 440.0400085449219,
      "text": " But the reality is that we still have that old nature."
    },
    {
      "id": 150,
      "start": 440.239990234375,
      "end": 443.1600036621094,
      "text": " The old man still is around the flesh."
    },
    {
      "id": 151,
      "start": 443.3599853515625,
      "end": 448.0400085449219,
      "text": " And we think about the two natures that are represented here throughout the"
    },
    {
      "id": 152,
      "start": 448.0400085449219,
      "end": 451.9200134277344,
      "text": " struggle in the womb, and we find this old man versus new man,"
    },
    {
      "id": 153,
      "start": 452.1199951171875,
      "end": 453.79998779296875,
      "text": " the flesh versus the spirit."
    },
    {
      "id": 154,
      "start": 454.0,
      "end": 458.239990234375,
      "text": " We find that the Bible says, and it's true even of the nations"
    },
    {
      "id": 155,
      "start": 458.44000244140625,
      "end": 461.6000061035156,
      "text": " contextually, but it's true of the natures by way of application"
    },
    {
      "id": 156,
      "start": 461.79998779296875,
      "end": 465.32000732421875,
      "text": " that the elder shall serve the younger after we are saved."
    },
    {
      "id": 157,
      "start": 465.5199890136719,
      "end": 468.67999267578125,
      "text": " Listen, our new man is younger than our old man."
    },
    {
      "id": 158,
      "start": 468.8800048828125,
      "end": 473.239990234375,
      "text": " You got your old man the day that you were born physically."
    },
    {
      "id": 159,
      "start": 473.44000244140625,
      "end": 475.79998779296875,
      "text": " The new man is younger than the old man,"
    },
    {
      "id": 160,
      "start": 475.9200134277344,
      "end": 479.6000061035156,
      "text": " but the old man is to serve the younger."
    },
    {
      "id": 161,
      "start": 479.79998779296875,
      "end": 481.760009765625,
      "text": " The old man is to be mortified."
    },
    {
      "id": 162,
      "start": 481.9599914550781,
      "end": 485.20001220703125,
      "text": " The old man is to be crucified."
    },
    {
      "id": 163,
      "start": 485.3999938964844,
      "end": 487.7200012207031,
      "text": " And so we find that there's the symbolism"
    },
    {
      "id": 164,
      "start": 487.9200134277344,
      "end": 491.6000061035156,
      "text": " that's here in Genesis chapter twenty five and keeping that with our within our"
    },
    {
      "id": 165,
      "start": 491.79998779296875,
      "end": 496.0,
      "text": " minds as our first reminder, as we get into Genesis chapter thirty six,"
    },
    {
      "id": 166,
      "start": 496.1600036621094,
      "end": 498.2799987792969,
      "text": " we must remember the struggle within the womb."
    },
    {
      "id": 167,
      "start": 498.3999938964844,
      "end": 499.20001220703125,
      "text": " I would say this."
    },
    {
      "id": 168,
      "start": 499.3999938964844,
      "end": 502.7200012207031,
      "text": " We must remember that Esau sold his birthright."
    },
    {
      "id": 169,
      "start": 502.9200134277344,
      "end": 504.7200012207031,
      "text": " And the same chapter in Genesis twenty five,"
    },
    {
      "id": 170,
      "start": 504.9200134277344,
      "end": 509.1199951171875,
      "text": " the end of the chapter records for us how that Esau sold his birthright."
    },
    {
      "id": 171,
      "start": 509.1199951171875,
      "end": 510.3599853515625,
      "text": " The Bible says in verse number thirty,"
    },
    {
      "id": 172,
      "start": 510.55999755859375,
      "end": 513.4000244140625,
      "text": " picking it up there and Esau in Genesis twenty five."
    },
    {
      "id": 173,
      "start": 513.5999755859375,
      "end": 516.0,
      "text": " And Esau said to Jacob, feed me,"
    },
    {
      "id": 174,
      "start": 516.2000122070312,
      "end": 519.760009765625,
      "text": " I pray thee with that same red pottage for I am faint."
    },
    {
      "id": 175,
      "start": 519.9600219726562,
      "end": 521.6799926757812,
      "text": " Therefore was his name called Edom."
    },
    {
      "id": 176,
      "start": 521.8800048828125,
      "end": 525.0800170898438,
      "text": " And Jacob said, sell me this day thy birthright."
    },
    {
      "id": 177,
      "start": 525.280029296875,
      "end": 527.6799926757812,
      "text": " And Esau said, behold, I'm at the point to die."
    },
    {
      "id": 178,
      "start": 527.8800048828125,
      "end": 530.0399780273438,
      "text": " And what profit shall this birthright do to me?"
    },
    {
      "id": 179,
      "start": 530.0399780273438,
      "end": 531.9199829101562,
      "text": " And Jacob said, swear to me this day."
    },
    {
      "id": 180,
      "start": 532.0800170898438,
      "end": 535.2000122070312,
      "text": " And he swore to him and he sold his birthright unto Jacob."
    },
    {
      "id": 181,
      "start": 535.4000244140625,
      "end": 538.280029296875,
      "text": " Then Jacob gave Esau bread and pottage of lentils."
    },
    {
      "id": 182,
      "start": 538.47998046875,
      "end": 541.0,
      "text": " And he did eat and drink and rose up and went his way."
    },
    {
      "id": 183,
      "start": 541.2000122070312,
      "end": 545.3599853515625,
      "text": " Notice the Bible says thus Esau despised his birthright."
    },
    {
      "id": 184,
      "start": 545.5599975585938,
      "end": 548.9600219726562,
      "text": " The word despised means to hold in low regard."
    },
    {
      "id": 185,
      "start": 549.1599731445312,
      "end": 553.0800170898438,
      "text": " And you think about this truth where he sold his birthright."
    },
    {
      "id": 186,
      "start": 553.280029296875,
      "end": 555.0399780273438,
      "text": " Again, it's something that we need to be"
    },
    {
      "id": 187,
      "start": 555.0399780273438,
      "end": 558.0399780273438,
      "text": " mindful of as we enter into Genesis chapter thirty six."
    },
    {
      "id": 188,
      "start": 558.2000122070312,
      "end": 559.3599853515625,
      "text": " And then I would say the third thing"
    },
    {
      "id": 189,
      "start": 559.3599853515625,
      "end": 561.52001953125,
      "text": " that we're reminded of, we see the struggle within the room."
    },
    {
      "id": 190,
      "start": 561.52001953125,
      "end": 563.7999877929688,
      "text": " We see the the selling of the birthright."
    },
    {
      "id": 191,
      "start": 564.0,
      "end": 566.3200073242188,
      "text": " But we also see the subtlety of Jacob."
    },
    {
      "id": 192,
      "start": 566.52001953125,
      "end": 569.9600219726562,
      "text": " And we dealt with this in Genesis chapter twenty seven."
    },
    {
      "id": 193,
      "start": 570.1599731445312,
      "end": 572.0800170898438,
      "text": " As you look at Genesis chapter twenty seven,"
    },
    {
      "id": 194,
      "start": 572.280029296875,
      "end": 574.47998046875,
      "text": " we read about the subtlety of Jacob."
    },
    {
      "id": 195,
      "start": 574.6799926757812,
      "end": 576.52001953125,
      "text": " This is with regard to the blessing."
    },
    {
      "id": 196,
      "start": 576.719970703125,
      "end": 578.1199951171875,
      "text": " Remember that"
    },
    {
      "id": 197,
      "start": 578.3200073242188,
      "end": 581.7999877929688,
      "text": " the process has come and Isaac is going to give a blessing."
    },
    {
      "id": 198,
      "start": 582.0,
      "end": 584.0,
      "text": " And we see what's taking place."
    },
    {
      "id": 199,
      "start": 584.2000122070312,
      "end": 586.52001953125,
      "text": " And the instruction is given to Esau."
    },
    {
      "id": 200,
      "start": 586.719970703125,
      "end": 588.6799926757812,
      "text": " Isaac was old. He was dim in his eyes."
    },
    {
      "id": 201,
      "start": 588.6799926757812,
      "end": 589.6400146484375,
      "text": " He could not see well."
    },
    {
      "id": 202,
      "start": 589.7999877929688,
      "end": 590.9600219726562,
      "text": " He calls for Esau."
    },
    {
      "id": 203,
      "start": 591.1599731445312,
      "end": 594.6799926757812,
      "text": " But when he Esau heard or received the instruction,"
    },
    {
      "id": 204,
      "start": 594.6799926757812,
      "end": 597.0399780273438,
      "text": " we understand that Rebecca overheard what was going on."
    },
    {
      "id": 205,
      "start": 597.239990234375,
      "end": 600.0800170898438,
      "text": " And Rebecca gave instruction to Jacob."
    },
    {
      "id": 0,
      "start": 600.0800170898438,
      "end": 603.9800171852112,
      "text": " to go and to prepare and so on and so forth and she was gonna help. I'm gonna"
    },
    {
      "id": 1,
      "start": 603.9800171852112,
      "end": 610.5800170898438,
      "text": " drop down just for sake of time to verse number 35. Notice what the Bible says and"
    },
    {
      "id": 2,
      "start": 610.5800170898438,
      "end": 615.940016746521,
      "text": " he said, this is Isaac speaking to Esau, and he said, thy brother, that would be"
    },
    {
      "id": 3,
      "start": 615.940016746521,
      "end": 626.9400177001953,
      "text": " Jacob, came with subtlety and hath taken away thy blessing. And he said, is not he"
    },
    {
      "id": 4,
      "start": 626.9400177001953,
      "end": 630.2200164794922,
      "text": " rightly named Jacob, this is Esau speaking, for he hath supplanted me these"
    },
    {
      "id": 5,
      "start": 630.2200164794922,
      "end": 634.0200157165527,
      "text": " two times, he took away my birthright, and behold now he hath taken away my"
    },
    {
      "id": 6,
      "start": 634.0200157165527,
      "end": 640.6200180053711,
      "text": " blessing. And he said, hast thou not reserved a blessing for me? And Isaac"
    },
    {
      "id": 7,
      "start": 640.6200180053711,
      "end": 644.0200157165527,
      "text": " answered and said unto Esau, behold I have made him thy Lord, and all his"
    },
    {
      "id": 8,
      "start": 644.0200157165527,
      "end": 647.7800178527832,
      "text": " brethren have I given to him for servants, and with corn and wine have I"
    },
    {
      "id": 9,
      "start": 647.7800178527832,
      "end": 652.7800178527832,
      "text": " sustained him, and what shall I do now unto thee my son? And we find that Esau"
    },
    {
      "id": 10,
      "start": 652.7800178527832,
      "end": 658.1800155639648,
      "text": " responds in verse 38, he says unto his father, hast thou but one blessing, my"
    },
    {
      "id": 11,
      "start": 658.1800155639648,
      "end": 665.7000198364258,
      "text": " father. Bless me, even me also, my father. And Esau lifted up his voice and wept."
    },
    {
      "id": 12,
      "start": 665.7000198364258,
      "end": 671.02001953125,
      "text": " Esau was never concerned about spiritual things. He was only ever concerned about"
    },
    {
      "id": 13,
      "start": 671.02001953125,
      "end": 675.8600158691406,
      "text": " temporal things. And we see that here in Genesis chapter number 27. What is he"
    },
    {
      "id": 14,
      "start": 675.8600158691406,
      "end": 681.2600173950195,
      "text": " pleading for? What is he desiring? He's really desiring a temporal blessing. He"
    },
    {
      "id": 15,
      "start": 681.3000183105469,
      "end": 684.900016784668,
      "text": " wants to be increased with goods, he wants to benefit with these things, and"
    },
    {
      "id": 16,
      "start": 684.900016784668,
      "end": 689.9800186157227,
      "text": " he's calling out, he's desiring this blessing, and we find that it's not"
    },
    {
      "id": 17,
      "start": 689.9800186157227,
      "end": 694.1800155639648,
      "text": " going to be given because of the fact that the subtlety of Jacob and the"
    },
    {
      "id": 18,
      "start": 694.1800155639648,
      "end": 698.8200149536133,
      "text": " blessing had been given to Jacob. And we find that the response of Esau is one"
    },
    {
      "id": 19,
      "start": 698.8200149536133,
      "end": 702.5000152587891,
      "text": " of just anger and hatred, and he makes the decision, I'm gonna kill my brother."
    },
    {
      "id": 20,
      "start": 702.5000152587891,
      "end": 706.900016784668,
      "text": " Of course that leads to Jacob fleeing to Laban and all that we've"
    },
    {
      "id": 21,
      "start": 706.900016784668,
      "end": 710.8200149536133,
      "text": " studied over the past several chapters of the book of Genesis. And so we see"
    },
    {
      "id": 22,
      "start": 710.8600158691406,
      "end": 715.1000137329102,
      "text": " that as we look at these passages of Scripture, we're reminded of these three"
    },
    {
      "id": 23,
      "start": 715.1000137329102,
      "end": 720.1000137329102,
      "text": " important events in the life of Esau. And then we come to Genesis chapter number"
    },
    {
      "id": 24,
      "start": 720.1000137329102,
      "end": 728.260009765625,
      "text": " 36. And in Genesis chapter number 36, God is really providing for us the record, as"
    },
    {
      "id": 25,
      "start": 728.260009765625,
      "end": 732.8600158691406,
      "text": " I said by way of introduction a moment ago, of Esau's family tree. And he's"
    },
    {
      "id": 26,
      "start": 732.8600158691406,
      "end": 737.7800140380859,
      "text": " providing us with this record, and it helps us to understand not only some of"
    },
    {
      "id": 27,
      "start": 737.7800140380859,
      "end": 742.1000213623047,
      "text": " what we just dealt with by way of review from those events in Genesis"
    },
    {
      "id": 28,
      "start": 742.1000213623047,
      "end": 747.7800140380859,
      "text": " chapter number 25 and chapter number 27, but we also see that it will help us"
    },
    {
      "id": 29,
      "start": 747.7800140380859,
      "end": 753.3800201416016,
      "text": " again connect some dots with regard to future events that will take place as we"
    },
    {
      "id": 30,
      "start": 753.3800201416016,
      "end": 758.260009765625,
      "text": " read through the Old Testament, and we begin to connect all these dots and see"
    },
    {
      "id": 31,
      "start": 758.260009765625,
      "end": 762.6200103759766,
      "text": " these interactions between these groups of people. So as we get into Genesis"
    },
    {
      "id": 32,
      "start": 762.6200103759766,
      "end": 766.3400115966797,
      "text": " chapter 36, I want you to, if you're taking notes, number one this evening, I"
    },
    {
      "id": 33,
      "start": 766.5800170898438,
      "end": 770.9800109863281,
      "text": " want you to consider with me the decisions of Esau. The decisions of Esau."
    },
    {
      "id": 34,
      "start": 770.9800109863281,
      "end": 774.9000244140625,
      "text": " We find, first of all, the decision with regard to his wives, and we find in"
    },
    {
      "id": 35,
      "start": 774.9000244140625,
      "end": 778.9400177001953,
      "text": " verses 2 and 3 of Genesis chapter number 36 that the Bible tells us about his"
    },
    {
      "id": 36,
      "start": 778.9400177001953,
      "end": 783.1400146484375,
      "text": " wives that he took. Now, it's very possible, in fact, there's a lot of debate"
    },
    {
      "id": 37,
      "start": 783.1400146484375,
      "end": 788.3000183105469,
      "text": " that goes on with regard to the wives of Esau. There's some discrepancy with"
    },
    {
      "id": 38,
      "start": 788.3000183105469,
      "end": 792.8200225830078,
      "text": " regard to names in a previous chapter with regard to the names of Esau's wife,"
    },
    {
      "id": 39,
      "start": 792.8200225830078,
      "end": 796.7800140380859,
      "text": " and there are a number of theories that exist out there with regard to whether"
    },
    {
      "id": 40,
      "start": 796.7800140380859,
      "end": 802.3400115966797,
      "text": " or not some of the names were adapted in order to not be offensive to Isaac and"
    },
    {
      "id": 41,
      "start": 802.3400115966797,
      "end": 806.3800201416016,
      "text": " what have you. There's also the fact that in this chapter, in Genesis chapter"
    },
    {
      "id": 42,
      "start": 806.3800201416016,
      "end": 810.7400207519531,
      "text": " number 36, it's giving us a picture of the family tree, not necessarily all the"
    },
    {
      "id": 43,
      "start": 810.7400207519531,
      "end": 816.3000183105469,
      "text": " names of his wives. It is very possible they had more than three wives, but it"
    },
    {
      "id": 44,
      "start": 816.3000183105469,
      "end": 820.02001953125,
      "text": " might be that it's only these three wives that are listed here that gave him"
    },
    {
      "id": 45,
      "start": 820.02001953125,
      "end": 826.5800170898438,
      "text": " male children, sons, and thus the family tree that is provided. Listen, don't get"
    },
    {
      "id": 46,
      "start": 826.5800170898438,
      "end": 832.4600219726562,
      "text": " mixed up, don't get sideways when someone tries to take something that seems to be"
    },
    {
      "id": 47,
      "start": 832.4600219726562,
      "end": 836.0600128173828,
      "text": " an apparent contradiction and comes to you and says, look, there's a"
    },
    {
      "id": 48,
      "start": 836.0600128173828,
      "end": 842.1400146484375,
      "text": " contradiction here. Listen, God is wiser than us. All Scripture is given by"
    },
    {
      "id": 49,
      "start": 842.1400146484375,
      "end": 846.7200164794922,
      "text": " inspiration of God. A preacher of yesteryear said, and I've had it, I want"
    },
    {
      "id": 50,
      "start": 846.7200164794922,
      "end": 852.6400146484375,
      "text": " to say, just ingrained in my brain, and I try to always be reminded myself of this"
    },
    {
      "id": 51,
      "start": 852.6400146484375,
      "end": 857.6400146484375,
      "text": " when people come to me with apparent contradictions, that listen, if you think"
    },
    {
      "id": 52,
      "start": 857.6400146484375,
      "end": 865.2000122070312,
      "text": " there's a mistake, you are mistaken. What do you do? You dig in, you dig deeper, you"
    },
    {
      "id": 53,
      "start": 865.2000122070312,
      "end": 872.0000305175781,
      "text": " try to get along with God. Who gave us the Bible? God. The Holy Spirit is the"
    },
    {
      "id": 54,
      "start": 872.0000305175781,
      "end": 875.6600036621094,
      "text": " author of Scripture, and He lives within you, He lives within me, He is the divine"
    },
    {
      "id": 55,
      "start": 875.780029296875,
      "end": 880.0600280761719,
      "text": " teacher, and so we seek the face of God. I do not believe there's an apparent"
    },
    {
      "id": 56,
      "start": 880.0600280761719,
      "end": 883.2200317382812,
      "text": " contradiction, or I do not believe there's a contradiction here at all, even though"
    },
    {
      "id": 57,
      "start": 883.2200317382812,
      "end": 886.5400085449219,
      "text": " at surface level somebody could say, look, the names are different and what's going"
    },
    {
      "id": 58,
      "start": 886.5400085449219,
      "end": 891.8200073242188,
      "text": " on, that here God is providing us with the record of the family tree. But I want"
    },
    {
      "id": 59,
      "start": 891.8200073242188,
      "end": 894.9800109863281,
      "text": " you to think about the decisions. We think about his wives that are listed here in"
    },
    {
      "id": 60,
      "start": 894.9800109863281,
      "end": 900.3400268554688,
      "text": " verses 2 and 3 of Genesis chapter number 36, and those names are given to us. I ask"
    },
    {
      "id": 61,
      "start": 900.3400268554688,
      "end": 904.8200073242188,
      "text": " this question when I consider the decisions of Esau. I say this, why did Esau"
    },
    {
      "id": 62,
      "start": 904.8600158691406,
      "end": 910.4600219726562,
      "text": " choose the wives that he did? What was the process in which Esau went through in"
    },
    {
      "id": 63,
      "start": 910.4600219726562,
      "end": 915.8200073242188,
      "text": " order to determine who he would marry? By the way, we of course are not in favor of"
    },
    {
      "id": 64,
      "start": 915.8200073242188,
      "end": 920.3000183105469,
      "text": " polygamy, as we'd see here with multiple wives, but we understand that marriage is"
    },
    {
      "id": 65,
      "start": 920.3000183105469,
      "end": 924.8200073242188,
      "text": " of God, that God saw Adam. He said he's not good that man is left alone. For whoso"
    },
    {
      "id": 66,
      "start": 924.8200073242188,
      "end": 928.1800231933594,
      "text": " findeth a wife, findeth a good thing, and obtain the favor of the Lord. And we find"
    },
    {
      "id": 67,
      "start": 928.1800231933594,
      "end": 932.02001953125,
      "text": " that God is the one that instituted and designed marriage. Marriage is not man's"
    },
    {
      "id": 68,
      "start": 932.02001953125,
      "end": 939.1800231933594,
      "text": " idea, it's God's idea. But listen, aside from salvation, who you marry is the most"
    },
    {
      "id": 69,
      "start": 939.1800231933594,
      "end": 945.3000183105469,
      "text": " important decision you're ever going to make in your life. It really is. I married"
    },
    {
      "id": 70,
      "start": 945.3000183105469,
      "end": 952.260009765625,
      "text": " the wrong person. No, sorry, you got married. It's a tough deal. So how did he"
    },
    {
      "id": 71,
      "start": 952.260009765625,
      "end": 956.9400024414062,
      "text": " make the decision? Go back with me, Genesis chapter 26. By the way, thanks for asking"
    },
    {
      "id": 72,
      "start": 956.9400024414062,
      "end": 966.4600219726562,
      "text": " the question. Genesis 26, look at verses 34 and 35. We did not touch on Genesis 26"
    },
    {
      "id": 73,
      "start": 966.4600219726562,
      "end": 971.6200256347656,
      "text": " by way of introduction. We looked at chapter 25 and 27, but I want you to notice the Bible"
    },
    {
      "id": 74,
      "start": 971.6200256347656,
      "end": 976.1000061035156,
      "text": " says in verse 34, Esau was 40 years old when he took to wife Judith, the daughter of Barai,"
    },
    {
      "id": 75,
      "start": 976.1000061035156,
      "end": 979.780029296875,
      "text": " the Hittite, and Beshemoth, the daughter of Elam, the Hittite. Notice what the Bible says"
    },
    {
      "id": 76,
      "start": 979.780029296875,
      "end": 990.1000061035156,
      "text": " in verse 35, which were a grief of mind unto Isaac and to Rebekah. Huh. Verse 35 is interesting"
    },
    {
      "id": 77,
      "start": 990.1000061035156,
      "end": 994.3000183105469,
      "text": " to me when I think about the decisions of Esau, the decision with regard to who he would"
    },
    {
      "id": 78,
      "start": 994.3000183105469,
      "end": 1000.1800231933594,
      "text": " marry. He did not seek the counsel of his parents. You know, the counsel, the Bible"
    },
    {
      "id": 79,
      "start": 1000.1800231933594,
      "end": 1004.9800109863281,
      "text": " tells us that there's safety in a multitude of counselors, the Bible tells us. And I believe"
    },
    {
      "id": 80,
      "start": 1004.9800109863281,
      "end": 1010.7400207519531,
      "text": " this evening that we think about the subject of marriage. There's great wisdom in an individual"
    },
    {
      "id": 81,
      "start": 1010.7400207519531,
      "end": 1016.4600219726562,
      "text": " seeking the counsel of their parents. I've said to our children many times, listen, I"
    },
    {
      "id": 82,
      "start": 1016.4600219726562,
      "end": 1025.8600158691406,
      "text": " might not be the best dad, but I'm the dad that God gave you. And I want my kids to understand,"
    },
    {
      "id": 83,
      "start": 1025.8600158691406,
      "end": 1029.0600280761719,
      "text": " I've tried to teach them this over the years, that I'm not perfect. I'm not going to give"
    },
    {
      "id": 84,
      "start": 1029.0600280761719,
      "end": 1034.1000061035156,
      "text": " perfect counsel, but I'm going to seek God's face and I'm going to pray. And listen, sometimes"
    },
    {
      "id": 85,
      "start": 1034.2200317382812,
      "end": 1038.1000061035156,
      "text": " as a parent, God sometimes just gives you an uneasiness about something that you might"
    },
    {
      "id": 86,
      "start": 1038.1000061035156,
      "end": 1044.4200134277344,
      "text": " not even be able to verbalize. God just doesn't give you a piece about it. And we find here"
    },
    {
      "id": 87,
      "start": 1044.4200134277344,
      "end": 1048.9400024414062,
      "text": " that there's no, as we look at the passage of Scripture, it seems like there's no interest"
    },
    {
      "id": 88,
      "start": 1048.9400024414062,
      "end": 1053.4600219726562,
      "text": " whatsoever on the part of Esau. Again, remember, he was never concerned about spiritual things,"
    },
    {
      "id": 89,
      "start": 1053.4600219726562,
      "end": 1057.3000183105469,
      "text": " only concerned about temporal things, that which would please him temporarily. And the"
    },
    {
      "id": 90,
      "start": 1057.3000183105469,
      "end": 1061.2200317382812,
      "text": " Bible tells us that this was a grief of mind unto Isaac and Rebekah. But there's further"
    },
    {
      "id": 91,
      "start": 1061.260009765625,
      "end": 1066.5000305175781,
      "text": " insight that is given to us in chapter 28. Notice, if you will, over in chapter 28, this"
    },
    {
      "id": 92,
      "start": 1066.5000305175781,
      "end": 1072.3800048828125,
      "text": " is after the blessing is given in Genesis 27. And now, because Esau's ready to kill"
    },
    {
      "id": 93,
      "start": 1072.3800048828125,
      "end": 1077.1400146484375,
      "text": " Jacob because of the subtlety of Jacob and all that's taken place, now Isaac is going"
    },
    {
      "id": 94,
      "start": 1077.1400146484375,
      "end": 1082.4800109863281,
      "text": " to send Jacob away, his flight to Paddan Aram, as we mentioned earlier, when he go to Laban."
    },
    {
      "id": 95,
      "start": 1082.4800109863281,
      "end": 1086.9800109863281,
      "text": " And we find that Jacob is called into the presence of Isaac. And the Bible tells us"
    },
    {
      "id": 96,
      "start": 1086.9800109863281,
      "end": 1092.02001953125,
      "text": " in verse number one that Isaac is going to bless and charge Jacob. And notice what he"
    },
    {
      "id": 97,
      "start": 1092.02001953125,
      "end": 1099.3800048828125,
      "text": " says in verse number one. At the end of the verse, thou shalt not take a wife of the daughters"
    },
    {
      "id": 98,
      "start": 1099.3800048828125,
      "end": 1107.5800170898438,
      "text": " of Canaan. Now, is that hard to understand? Very clear. Elementary education level of"
    },
    {
      "id": 99,
      "start": 1107.5800170898438,
      "end": 1112.1799926757812,
      "text": " comprehension, basic truth. But I want you to see what the Bible says in verse number"
    },
    {
      "id": 100,
      "start": 1112.1799926757812,
      "end": 1119.5400390625,
      "text": " eight. And Esau, seeing that the daughters of Canaan pleased not Isaac, his father. How"
    },
    {
      "id": 101,
      "start": 1119.5400390625,
      "end": 1126.4200439453125,
      "text": " did he see that? Well, really, he heard the charge that was given from Isaac to Jacob."
    },
    {
      "id": 102,
      "start": 1126.4200439453125,
      "end": 1132.4200439453125,
      "text": " Thou shalt not take a wife of the daughters of Canaan. So we see that Jacob is receiving"
    },
    {
      "id": 103,
      "start": 1132.4200439453125,
      "end": 1138.3800048828125,
      "text": " this instruction from his father, Isaac. And Esau, because he has no care, no concern about"
    },
    {
      "id": 104,
      "start": 1138.3800048828125,
      "end": 1142.780029296875,
      "text": " what his mom or dad would think. The Bible says that he sees that the daughters of Canaan"
    },
    {
      "id": 105,
      "start": 1142.780029296875,
      "end": 1148.8800048828125,
      "text": " pleased not Isaac, his father. Then went Esau unto Ishmael and took unto him a wife, which"
    },
    {
      "id": 106,
      "start": 1148.8800048828125,
      "end": 1154.780029296875,
      "text": " he had, Mahalath, the daughter of Ishmael, Abraham's son, the sister of Nebojah, to be"
    },
    {
      "id": 107,
      "start": 1154.780029296875,
      "end": 1160.5400390625,
      "text": " his wife. And we see that he has made these decisions. If you look in chapter number 26,"
    },
    {
      "id": 108,
      "start": 1160.5400390625,
      "end": 1167.3400268554688,
      "text": " it speaks about the daughters of Canaan. Specifically, it says that he was 40 years old and he took"
    },
    {
      "id": 109,
      "start": 1167.3400268554688,
      "end": 1171.260009765625,
      "text": " the daughter of Bere the Hittite and the Beshemoth, the daughter of Elon the Hittite."
    },
    {
      "id": 110,
      "start": 1171.260009765625,
      "end": 1177.9800415039062,
      "text": " And he takes these wives. We see here that Esau, again, he's making these decisions that"
    },
    {
      "id": 111,
      "start": 1177.9800415039062,
      "end": 1185.0599975585938,
      "text": " are decisions that are really based on fleshly motives. Not concerned about the spiritual,"
    },
    {
      "id": 112,
      "start": 1185.0599975585938,
      "end": 1190.1400146484375,
      "text": " not concerned about the eternal, but concerned for the temporal. We find that not only when"
    },
    {
      "id": 113,
      "start": 1190.1400146484375,
      "end": 1194.5400390625,
      "text": " we consider with us this evening the decision with regard to his wives, but then we think"
    },
    {
      "id": 114,
      "start": 1194.5400390625,
      "end": 1199.4200439453125,
      "text": " about the decision with regard to his dwelling place. And back in Genesis chapter 36, the"
    },
    {
      "id": 115,
      "start": 1199.4200439453125,
      "end": 1200.1400146484375,
      "text": " Bible tells us..."
    },
    {
      "id": 0,
      "start": 1200.1400146484375,
      "end": 1205.4600148200989,
      "text": " us in verse 6 and 7. By the way, it's quite interesting as you read verse 6 and 7 with"
    },
    {
      "id": 1,
      "start": 1205.4600148200989,
      "end": 1214.8600149154663,
      "text": " regard to the expression of Esau in Genesis chapter 27 when he's pleading for a blessing."
    },
    {
      "id": 2,
      "start": 1214.8600149154663,
      "end": 1221.8200149536133,
      "text": " You know, God did bless Esau. God blessed Esau. And we find that we were reminded of"
    },
    {
      "id": 3,
      "start": 1221.8200149536133,
      "end": 1227.9000148773193,
      "text": " that truth when we saw the reunion between Jacob and Esau. Remember, he said, I have"
    },
    {
      "id": 4,
      "start": 1227.9000148773193,
      "end": 1233.2200164794922,
      "text": " enough. But in verse number 6, the Bible says, And Esau took his wives, and his sons, and"
    },
    {
      "id": 5,
      "start": 1233.2200164794922,
      "end": 1236.0200157165527,
      "text": " his daughters, and all the persons of his house, and his cattle, and all the beasts,"
    },
    {
      "id": 6,
      "start": 1236.0200157165527,
      "end": 1239.7000160217285,
      "text": " and all the substance which he had got in the land of Canaan, and went into the country"
    },
    {
      "id": 7,
      "start": 1239.7000160217285,
      "end": 1243.6200141906738,
      "text": " from the face of his brother Jacob. For their riches were more than that they might dwell"
    },
    {
      "id": 8,
      "start": 1243.6200141906738,
      "end": 1248.340015411377,
      "text": " together in the land wherein they were strangers could not bear them because of their cattle."
    },
    {
      "id": 9,
      "start": 1248.340015411377,
      "end": 1253.2200164794922,
      "text": " Do you remember another time in Scripture in the book of Genesis when this situation"
    },
    {
      "id": 10,
      "start": 1253.2200164794922,
      "end": 1259.5800132751465,
      "text": " happened? Yeah. Abraham and Lot, right? And what happened? What was Lot's process for"
    },
    {
      "id": 11,
      "start": 1259.5800132751465,
      "end": 1264.9400177001953,
      "text": " picking the place where he'd go? It's all his sight. He saw that it was a land that"
    },
    {
      "id": 12,
      "start": 1264.9400177001953,
      "end": 1268.500015258789,
      "text": " was pleasing. It was a place that was well watered. A place that would be appropriate"
    },
    {
      "id": 13,
      "start": 1268.500015258789,
      "end": 1273.4200134277344,
      "text": " and good for him. And the Bible tells us if you trace the steps of Lot, that initially"
    },
    {
      "id": 14,
      "start": 1273.4200134277344,
      "end": 1281.1800155639648,
      "text": " he simply pitched his tent towards Sodom. He didn't move into Sodom on day one. He"
    },
    {
      "id": 15,
      "start": 1281.1800155639648,
      "end": 1287.0600128173828,
      "text": " just pitched his tent towards Sodom. But before long, we see that he's in a place"
    },
    {
      "id": 16,
      "start": 1287.0600128173828,
      "end": 1295.620018005371,
      "text": " of leadership within the wicked city of Sodom. You see that progression, right? And Abraham,"
    },
    {
      "id": 17,
      "start": 1295.620018005371,
      "end": 1302.500015258789,
      "text": " listen, Abraham gave him the choice. You pick. And he picked. And then we see Esau, he goes"
    },
    {
      "id": 18,
      "start": 1302.500015258789,
      "end": 1307.2400131225586,
      "text": " and he leaves and we see this decision that he makes with regard to his wives, the daughters"
    },
    {
      "id": 19,
      "start": 1307.2400131225586,
      "end": 1312.0400161743164,
      "text": " of Canaan, as it's mentioned in verse number two of Genesis 36. And then we see the place"
    },
    {
      "id": 20,
      "start": 1312.0400161743164,
      "end": 1318.0800170898438,
      "text": " where he goes. The place is Mount Seir. And we see that here. It's the south part of the"
    },
    {
      "id": 21,
      "start": 1318.0800170898438,
      "end": 1325.160011291504,
      "text": " Dead Sea area there. A place that was well fortified. A place that was extremely complicated"
    },
    {
      "id": 22,
      "start": 1325.160011291504,
      "end": 1329.7400207519531,
      "text": " for someone to come in and conquer because of just the land. The way that the land was"
    },
    {
      "id": 23,
      "start": 1329.7400207519531,
      "end": 1336.3600158691406,
      "text": " set up and all of the caves and all of the structure and what have you. And we find that"
    },
    {
      "id": 24,
      "start": 1336.4800109863281,
      "end": 1342.760009765625,
      "text": " with the mountainous region there and that part of the landscape of Israel down there"
    },
    {
      "id": 25,
      "start": 1342.760009765625,
      "end": 1348.8800201416016,
      "text": " in Mount Seir, the southern part of the Dead Sea, it was a place that was just natural"
    },
    {
      "id": 26,
      "start": 1348.8800201416016,
      "end": 1354.6800079345703,
      "text": " protection. And that's where he chooses to go. When we begin to think about these decisions"
    },
    {
      "id": 27,
      "start": 1354.6800079345703,
      "end": 1360.5600128173828,
      "text": " of Esau, I ask myself this evening and I ask you tonight to consider how is it that we"
    },
    {
      "id": 28,
      "start": 1360.6800079345703,
      "end": 1367.6800079345703,
      "text": " make decisions? See the reality is that we all make decisions. We make decisions every"
    },
    {
      "id": 29,
      "start": 1368.280014038086,
      "end": 1373.2000122070312,
      "text": " single day of our lives. Some decisions that we make are decisions that we don't even really"
    },
    {
      "id": 30,
      "start": 1373.2000122070312,
      "end": 1378.52001953125,
      "text": " think about. We just make the decision. We just go through the process and we just made"
    },
    {
      "id": 31,
      "start": 1378.52001953125,
      "end": 1381.4200134277344,
      "text": " decisions and we didn't even realize we were making decisions because we're just going"
    },
    {
      "id": 32,
      "start": 1381.4200134277344,
      "end": 1385.280014038086,
      "text": " through life and we're doing the things that we're doing. How many of you have ever had"
    },
    {
      "id": 33,
      "start": 1385.280014038086,
      "end": 1391.1200103759766,
      "text": " a situation where you said to your spouse, where would you like to go out to eat? And"
    },
    {
      "id": 34,
      "start": 1391.1200103759766,
      "end": 1396.3600158691406,
      "text": " then there's like this process of time. So I told my family, I'm going to name a restaurant,"
    },
    {
      "id": 35,
      "start": 1396.3600158691406,
      "end": 1400.8600158691406,
      "text": " I'm going to open a restaurant and I'm going to name it, I don't care. And if everyone"
    },
    {
      "id": 36,
      "start": 1400.8600158691406,
      "end": 1405.4800109863281,
      "text": " truly goes to the restaurant that they say I don't care to their spouse, I will have"
    },
    {
      "id": 37,
      "start": 1405.4800109863281,
      "end": 1411.1200103759766,
      "text": " a lot of business. Right? How many times is it a holly? Hey, let's go out to dinner. Where"
    },
    {
      "id": 38,
      "start": 1411.1200103759766,
      "end": 1414.760009765625,
      "text": " do you want to go? I don't care. And if I open a second restaurant, it's going to be"
    },
    {
      "id": 39,
      "start": 1414.760009765625,
      "end": 1420.6800079345703,
      "text": " called this. It doesn't matter. How many of you get that response? Come on. I know"
    },
    {
      "id": 40,
      "start": 1420.6800079345703,
      "end": 1425.2400207519531,
      "text": " that somebody more than me gets that response. Right? And here's what I say to my family."
    },
    {
      "id": 41,
      "start": 1425.2400207519531,
      "end": 1431.4400177001953,
      "text": " Listen, I make decisions all day long. I don't care where we eat. Can somebody just make"
    },
    {
      "id": 42,
      "start": 1431.4400177001953,
      "end": 1436.3600158691406,
      "text": " the decision? I say that all the time. I make decisions that are much more complicated than"
    },
    {
      "id": 43,
      "start": 1436.3600158691406,
      "end": 1442.7200164794922,
      "text": " what I'm going to eat for dinner. It is important. I'm not going to salad works. Amen. And I"
    },
    {
      "id": 44,
      "start": 1442.7200164794922,
      "end": 1446.4400177001953,
      "text": " don't even think that place exists anymore. But the reality is that we look at this and"
    },
    {
      "id": 45,
      "start": 1446.4400177001953,
      "end": 1451.9600219726562,
      "text": " we say how is it that we make decisions? What's the process that we go through? Do we seek"
    },
    {
      "id": 46,
      "start": 1451.9600219726562,
      "end": 1458.9600219726562,
      "text": " the face of God? Do we prayerfully consider that which is before us? Let me ask this."
    },
    {
      "id": 47,
      "start": 1458.9600219726562,
      "end": 1465.3200073242188,
      "text": " What are the consequences of your decisions? You know, in a real way, there are decisions"
    },
    {
      "id": 48,
      "start": 1465.3200073242188,
      "end": 1470.1600036621094,
      "text": " that you make and that I make that we do not know what the consequences of that decision"
    },
    {
      "id": 49,
      "start": 1470.1600036621094,
      "end": 1479.4000244140625,
      "text": " are going to be. We don't know. We make the decision. How many people make decisions without"
    },
    {
      "id": 50,
      "start": 1479.4000244140625,
      "end": 1485.280029296875,
      "text": " even considering the consequences? Maybe we say to somebody when they make a poor decision,"
    },
    {
      "id": 51,
      "start": 1485.280029296875,
      "end": 1488.6000061035156,
      "text": " we say what were you thinking? You ever had that thought? You ever had somebody maybe"
    },
    {
      "id": 52,
      "start": 1488.6000061035156,
      "end": 1492.760009765625,
      "text": " ask you that? Maybe you've asked yourself that. You made a decision and said that was"
    },
    {
      "id": 53,
      "start": 1492.760009765625,
      "end": 1501.4000244140625,
      "text": " not very smart. Self, what were you thinking when you made that decision? Right? We don't"
    },
    {
      "id": 54,
      "start": 1501.4000244140625,
      "end": 1505.8600158691406,
      "text": " know the consequences. But can I tell you, can I say this this evening that you can rest"
    },
    {
      "id": 55,
      "start": 1505.8600158691406,
      "end": 1511.4800109863281,
      "text": " assured there will be consequences to your decisions? There will be consequences to your"
    },
    {
      "id": 56,
      "start": 1511.4800109863281,
      "end": 1520.7200012207031,
      "text": " decisions. Let me ask this. Who is impacted by your decisions? You know, we live in a"
    },
    {
      "id": 57,
      "start": 1520.7200012207031,
      "end": 1526.6000061035156,
      "text": " midst of a people that are so self-focused that they think they make their decisions"
    },
    {
      "id": 58,
      "start": 1526.6000061035156,
      "end": 1532.760009765625,
      "text": " in a vacuum and their decisions only affect them. But those of us that have lived long"
    },
    {
      "id": 59,
      "start": 1532.760009765625,
      "end": 1539.4000244140625,
      "text": " enough and have been exposed to enough truth, we know that's just not true. Many people"
    },
    {
      "id": 60,
      "start": 1539.4000244140625,
      "end": 1544.3200073242188,
      "text": " are affected by the decisions that we make. We make decisions every day. People say this"
    },
    {
      "id": 61,
      "start": 1544.3200073242188,
      "end": 1546.8000183105469,
      "text": " is my life, I can do what I want to do. No, you're going to make decisions that are going"
    },
    {
      "id": 62,
      "start": 1546.8000183105469,
      "end": 1553.2400207519531,
      "text": " to affect other people. Sometimes innocent people that don't even know who you are."
    },
    {
      "id": 63,
      "start": 1553.2400207519531,
      "end": 1558.6800231933594,
      "text": " But you've affected them. And I would submit to you this evening that the decisions that"
    },
    {
      "id": 64,
      "start": 1558.6800231933594,
      "end": 1563.760009765625,
      "text": " are made by Esau, specifically with regard to the wives, when we think about the process"
    },
    {
      "id": 65,
      "start": 1563.760009765625,
      "end": 1567.9600219726562,
      "text": " there and how he chose his wives and what he'd seen and what he'd understood, and we"
    },
    {
      "id": 66,
      "start": 1567.9600219726562,
      "end": 1571.780029296875,
      "text": " think about what's going on and we say, how are we making the decisions that we're making?"
    },
    {
      "id": 67,
      "start": 1571.780029296875,
      "end": 1576.8600158691406,
      "text": " Are we seeking godly counsel? Are we seeking the face of God? I referenced already the"
    },
    {
      "id": 68,
      "start": 1576.8600158691406,
      "end": 1585.9800109863281,
      "text": " proverb that says there's safety in a multitude of counselors. I heard a preacher say recently,"
    },
    {
      "id": 69,
      "start": 1585.9800109863281,
      "end": 1591.8600158691406,
      "text": " never make a major ministry decision on Monday, because Sunday might have been a rough day."
    },
    {
      "id": 70,
      "start": 1591.8600158691406,
      "end": 1595.9400024414062,
      "text": " And it was kind of comical to hear them say that, but they were being serious. They were"
    },
    {
      "id": 71,
      "start": 1595.9400024414062,
      "end": 1601.4200134277344,
      "text": " trying to give some advice. And the reality is that when we make the decisions that we"
    },
    {
      "id": 72,
      "start": 1601.5800170898438,
      "end": 1605.8200073242188,
      "text": " make, listen, sometimes we have some major, major decisions to make in life. And how do"
    },
    {
      "id": 73,
      "start": 1605.8200073242188,
      "end": 1611.4200134277344,
      "text": " we make them? What are the consequences going to be? Sometimes we can't know all that those"
    },
    {
      "id": 74,
      "start": 1611.4200134277344,
      "end": 1615.7400207519531,
      "text": " consequences are going to be, but we can rest assured those decisions are going to have"
    },
    {
      "id": 75,
      "start": 1615.7400207519531,
      "end": 1620.3800048828125,
      "text": " consequences. And we can know this evening that there are people that are going to be"
    },
    {
      "id": 76,
      "start": 1620.3800048828125,
      "end": 1627.4600219726562,
      "text": " impacted by the decisions that we make. I would say this, as we're reminded of that"
    },
    {
      "id": 77,
      "start": 1627.4600219726562,
      "end": 1637.6200256347656,
      "text": " struggle within the womb, in Genesis chapter 25, the two natures, the flesh minds fleshly"
    },
    {
      "id": 78,
      "start": 1637.6200256347656,
      "end": 1643.8200073242188,
      "text": " things. And if we're making decisions, we better make sure that we're not making them"
    },
    {
      "id": 79,
      "start": 1643.8200073242188,
      "end": 1655.6600036621094,
      "text": " based on fleshly things. It's important that we understand that Esau, Edom, the Edomites,"
    },
    {
      "id": 80,
      "start": 1655.6600036621094,
      "end": 1660.9400024414062,
      "text": " he was never concerned about spiritual things, temporal, fleshly things. So we notice the"
    },
    {
      "id": 81,
      "start": 1660.9400024414062,
      "end": 1666.4600219726562,
      "text": " decisions of Esau. I want you to notice with me number two, the descendants of Esau. In"
    },
    {
      "id": 82,
      "start": 1666.4600219726562,
      "end": 1670.7000122070312,
      "text": " verses four and five, we've read the verses already. In verses four and five, the Bible"
    },
    {
      "id": 83,
      "start": 1670.7000122070312,
      "end": 1675.4600219726562,
      "text": " gives the record of his sons. It notes here that there are five sons that were born to"
    },
    {
      "id": 84,
      "start": 1675.4600219726562,
      "end": 1683.5400085449219,
      "text": " Esau, Eliphaz, Reho, Jeus, Jalem, and Korah. His first two wives, according to the text"
    },
    {
      "id": 85,
      "start": 1683.5400085449219,
      "end": 1687.02001953125,
      "text": " of scripture, each had one son. The third had three sons, according to verse number"
    },
    {
      "id": 86,
      "start": 1687.02001953125,
      "end": 1692.2200012207031,
      "text": " five. We're going to think about these descendants of Esau. We find that in verses 11 through"
    },
    {
      "id": 87,
      "start": 1692.2200012207031,
      "end": 1696.2200012207031,
      "text": " 43, it records for us, again, the portion of scripture that I'm not going to read publicly"
    },
    {
      "id": 88,
      "start": 1696.2200012207031,
      "end": 1700.7400207519531,
      "text": " this evening for sake of time and all the names that are there, but it records for us"
    },
    {
      "id": 89,
      "start": 1700.7400207519531,
      "end": 1707.2200012207031,
      "text": " future generations, grandchildren, et cetera. It is of note that we make mention this evening"
    },
    {
      "id": 90,
      "start": 1707.2200012207031,
      "end": 1712.1400146484375,
      "text": " that verse number 12, notice there in that text of scripture, the Bible says, and Timnah"
    },
    {
      "id": 91,
      "start": 1712.260009765625,
      "end": 1720.1400146484375,
      "text": " was concubine to Eliphaz, Esau's son, and she bared to Eliphaz Amalek. Does that name"
    },
    {
      "id": 92,
      "start": 1720.1400146484375,
      "end": 1726.3400268554688,
      "text": " ring a bell to you? Does that name connect some dots for you? These were the sons of"
    },
    {
      "id": 93,
      "start": 1726.3400268554688,
      "end": 1735.6600341796875,
      "text": " Adah, Esau's wife. So, Amalek is the grandson of Esau. As we look here in the text of scripture,"
    },
    {
      "id": 94,
      "start": 1735.6600341796875,
      "end": 1739.5400390625,
      "text": " again, begin to trace some of these steps and connect some of the dots that are going"
    },
    {
      "id": 95,
      "start": 1739.5400390625,
      "end": 1743.8599853515625,
      "text": " on. We read of the descendants, a number of the names within the text of scripture."
    },
    {
      "id": 96,
      "start": 1743.8599853515625,
      "end": 1749.1000366210938,
      "text": " We really don't know anything much about them. We don't know of their descendants and all"
    },
    {
      "id": 97,
      "start": 1749.1000366210938,
      "end": 1752.3599853515625,
      "text": " of those sorts of things. I made mention of this as we've studied through the book of"
    },
    {
      "id": 98,
      "start": 1752.3599853515625,
      "end": 1759.0599975585938,
      "text": " Genesis, that you find that God takes the lens of scripture and he's taking the lens"
    },
    {
      "id": 99,
      "start": 1759.0599975585938,
      "end": 1764.4600219726562,
      "text": " of human history. And we start with Adam and Eve there in Genesis and looking at the creation"
    },
    {
      "id": 100,
      "start": 1764.4600219726562,
      "end": 1768.4200439453125,
      "text": " and what have you. And then we begin to look at all the children that are born and the"
    },
    {
      "id": 101,
      "start": 1768.4200439453125,
      "end": 1773.9800415039062,
      "text": " generations and so on and so forth. And then the lens gets smaller and smaller as eventually"
    },
    {
      "id": 102,
      "start": 1773.9800415039062,
      "end": 1779.3800048828125,
      "text": " it focuses down onto Abraham. And then we see that it focuses onto Isaac. And then we"
    },
    {
      "id": 103,
      "start": 1779.3800048828125,
      "end": 1785.5,
      "text": " see that it focuses onto Jacob and to his descendants. And so, though the record is"
    },
    {
      "id": 104,
      "start": 1785.5,
      "end": 1789.9000244140625,
      "text": " provided for us and it helps us with identifying some of the peoples that are mentioned and"
    },
    {
      "id": 105,
      "start": 1789.9000244140625,
      "end": 1795.9800415039062,
      "text": " some of their descendants and what have you, you know that the specifics with regard to"
    },
    {
      "id": 106,
      "start": 1795.9800415039062,
      "end": 1800.1400146484375,
      "text": " all of these descendants and all that they did are not provided to us within scripture."
    },
    {
      "id": 0,
      "start": 1800.1400146484375,
      "end": 1802.9600145816803,
      "text": " because the lens of Scripture is focusing on"
    },
    {
      "id": 1,
      "start": 1802.9600145816803,
      "end": 1805.660014629364,
      "text": " the Hebrew race, the Hebrew people,"
    },
    {
      "id": 2,
      "start": 1805.660014629364,
      "end": 1809.7800149917603,
      "text": " with regard to the, of course, Messianic line,"
    },
    {
      "id": 3,
      "start": 1809.7800149917603,
      "end": 1811.8400144577026,
      "text": " and that's where Scripture goes."
    },
    {
      "id": 4,
      "start": 1811.8400144577026,
      "end": 1813.7200145721436,
      "text": " And so we find, however, that as we look"
    },
    {
      "id": 5,
      "start": 1813.7200145721436,
      "end": 1814.9600143432617,
      "text": " at this passage of Scripture,"
    },
    {
      "id": 6,
      "start": 1814.9600143432617,
      "end": 1817.3200149536133,
      "text": " we see the decisions, we see the descendants,"
    },
    {
      "id": 7,
      "start": 1817.3200149536133,
      "end": 1818.440013885498,
      "text": " but then I want you to think of this"
    },
    {
      "id": 8,
      "start": 1818.440013885498,
      "end": 1821.280014038086,
      "text": " as we try to connect some dots this evening, number three."
    },
    {
      "id": 9,
      "start": 1821.280014038086,
      "end": 1824.5600147247314,
      "text": " I want you to note with me the disputes with Edom,"
    },
    {
      "id": 10,
      "start": 1824.5600147247314,
      "end": 1827.0400142669678,
      "text": " the disputes with Edom."
    },
    {
      "id": 11,
      "start": 1827.0400142669678,
      "end": 1828.6800155639648,
      "text": " So begin to think about what's taking place"
    },
    {
      "id": 12,
      "start": 1828.6800155639648,
      "end": 1830.2400150299072,
      "text": " and try to connect dots with Scripture"
    },
    {
      "id": 13,
      "start": 1830.2400150299072,
      "end": 1832.5200157165527,
      "text": " and understand here what God is giving us."
    },
    {
      "id": 14,
      "start": 1832.5200157165527,
      "end": 1834.6800155639648,
      "text": " I want you to turn to the book of Numbers, if you will,"
    },
    {
      "id": 15,
      "start": 1834.6800155639648,
      "end": 1835.7200164794922,
      "text": " and I'm gonna provide with you,"
    },
    {
      "id": 16,
      "start": 1835.7200164794922,
      "end": 1837.0800132751465,
      "text": " it's not an exhaustive list,"
    },
    {
      "id": 17,
      "start": 1837.0800132751465,
      "end": 1839.440013885498,
      "text": " it's just a number of examples of disputes"
    },
    {
      "id": 18,
      "start": 1839.440013885498,
      "end": 1842.3200149536133,
      "text": " that they have between the children of Israel"
    },
    {
      "id": 19,
      "start": 1842.3200149536133,
      "end": 1846.2400131225586,
      "text": " and the children of Esau, the Edomites and the Israelites."
    },
    {
      "id": 20,
      "start": 1846.2400131225586,
      "end": 1849.3200149536133,
      "text": " Now remember, that struggle within the womb,"
    },
    {
      "id": 21,
      "start": 1849.3200149536133,
      "end": 1851.9200134277344,
      "text": " there are two nations, right?"
    },
    {
      "id": 22,
      "start": 1851.9200134277344,
      "end": 1852.840015411377,
      "text": " It's what the Bible says."
    },
    {
      "id": 23,
      "start": 1852.840015411377,
      "end": 1855.8000144958496,
      "text": " The Bible says the elder shall serve the younger."
    },
    {
      "id": 24,
      "start": 1856.7200164794922,
      "end": 1859.840015411377,
      "text": " We find that God is connecting these dots for us"
    },
    {
      "id": 25,
      "start": 1859.840015411377,
      "end": 1861.3600158691406,
      "text": " and helping us to see what's taking place"
    },
    {
      "id": 26,
      "start": 1861.3600158691406,
      "end": 1864.5200119018555,
      "text": " and we find, yes, the selling of the birthright,"
    },
    {
      "id": 27,
      "start": 1864.5200119018555,
      "end": 1869.280014038086,
      "text": " we see the subtlety of Jacob with the blessing."
    },
    {
      "id": 28,
      "start": 1869.280014038086,
      "end": 1871.0400161743164,
      "text": " By the way, I mentioned this when I taught"
    },
    {
      "id": 29,
      "start": 1871.0400161743164,
      "end": 1873.400016784668,
      "text": " through that passage of Scripture in Genesis 27,"
    },
    {
      "id": 30,
      "start": 1873.400016784668,
      "end": 1876.7200164794922,
      "text": " there was no reason for Jacob to have to scheme."
    },
    {
      "id": 31,
      "start": 1876.7200164794922,
      "end": 1880.8400115966797,
      "text": " God had already promised in Genesis chapter number 25"
    },
    {
      "id": 32,
      "start": 1880.8400115966797,
      "end": 1882.8000183105469,
      "text": " that the elder shall serve the younger."
    },
    {
      "id": 33,
      "start": 1883.8000183105469,
      "end": 1885.6000137329102,
      "text": " There's no reason for you in your life"
    },
    {
      "id": 34,
      "start": 1885.6000137329102,
      "end": 1887.9400177001953,
      "text": " or in my life to scheme, we just trust God."
    },
    {
      "id": 35,
      "start": 1888.9600143432617,
      "end": 1891.3000183105469,
      "text": " But here in Numbers chapter number 20,"
    },
    {
      "id": 36,
      "start": 1891.3000183105469,
      "end": 1893.400016784668,
      "text": " we find this dispute that is listed here"
    },
    {
      "id": 37,
      "start": 1893.400016784668,
      "end": 1895.6400146484375,
      "text": " with the Edomites or the people of Edom,"
    },
    {
      "id": 38,
      "start": 1895.6400146484375,
      "end": 1897.8400115966797,
      "text": " the descendants of Esau."
    },
    {
      "id": 39,
      "start": 1897.8400115966797,
      "end": 1900.120018005371,
      "text": " Notice, first of all, in Numbers chapter 20,"
    },
    {
      "id": 40,
      "start": 1900.120018005371,
      "end": 1901.5200119018555,
      "text": " in the wilderness."
    },
    {
      "id": 41,
      "start": 1901.5200119018555,
      "end": 1903.9800109863281,
      "text": " Notice, as the children of Israel had left Egypt,"
    },
    {
      "id": 42,
      "start": 1903.9800109863281,
      "end": 1906.2000122070312,
      "text": " they've crossed the Red Sea, they're now in the wilderness."
    },
    {
      "id": 43,
      "start": 1906.2000122070312,
      "end": 1907.5200119018555,
      "text": " They've already disobeyed God,"
    },
    {
      "id": 44,
      "start": 1907.5200119018555,
      "end": 1910.400016784668,
      "text": " according to the evil report"
    },
    {
      "id": 45,
      "start": 1910.400016784668,
      "end": 1912.4800109863281,
      "text": " that was brought in Numbers chapter 14"
    },
    {
      "id": 46,
      "start": 1913.120018005371,
      "end": 1914.3600158691406,
      "text": " and they said they weren't able,"
    },
    {
      "id": 47,
      "start": 1914.3600158691406,
      "end": 1918.3600158691406,
      "text": " but we find in verse number 14, here in Numbers 20,"
    },
    {
      "id": 48,
      "start": 1918.3600158691406,
      "end": 1920.6000137329102,
      "text": " the Bible says that Moses sent messengers from Cadiz"
    },
    {
      "id": 49,
      "start": 1920.6000137329102,
      "end": 1922.6000137329102,
      "text": " unto the king of Edom."
    },
    {
      "id": 50,
      "start": 1922.6000137329102,
      "end": 1924.160011291504,
      "text": " Thus saith thy brother Israel,"
    },
    {
      "id": 51,
      "start": 1924.160011291504,
      "end": 1927.3600158691406,
      "text": " thou knowest all the travail that hath befallen us,"
    },
    {
      "id": 52,
      "start": 1927.3600158691406,
      "end": 1929.1600189208984,
      "text": " how our fathers went down into Egypt"
    },
    {
      "id": 53,
      "start": 1929.1600189208984,
      "end": 1930.8400115966797,
      "text": " and we have dwelt in Egypt a long time,"
    },
    {
      "id": 54,
      "start": 1930.8400115966797,
      "end": 1932.9200134277344,
      "text": " and the Egyptians vexed us and our fathers."
    },
    {
      "id": 55,
      "start": 1932.9200134277344,
      "end": 1934.2400207519531,
      "text": " And when we cried unto the Lord,"
    },
    {
      "id": 56,
      "start": 1934.2400207519531,
      "end": 1935.9600219726562,
      "text": " he heard our voice and sent an angel"
    },
    {
      "id": 57,
      "start": 1935.9600219726562,
      "end": 1937.6000213623047,
      "text": " and hath brought us forth out of Egypt."
    },
    {
      "id": 58,
      "start": 1937.6000213623047,
      "end": 1939.0800170898438,
      "text": " And behold, we are in Cadiz,"
    },
    {
      "id": 59,
      "start": 1939.0800170898438,
      "end": 1941.8600158691406,
      "text": " a city in the outermost of thy border."
    },
    {
      "id": 60,
      "start": 1941.8600158691406,
      "end": 1944.260009765625,
      "text": " Let us pass, I pray thee, through thy country."
    },
    {
      "id": 61,
      "start": 1944.260009765625,
      "end": 1947.260009765625,
      "text": " We will not pass through the fields or through the vineyards"
    },
    {
      "id": 62,
      "start": 1947.260009765625,
      "end": 1949.6200103759766,
      "text": " neither will we drink of the water of the wells."
    },
    {
      "id": 63,
      "start": 1949.6200103759766,
      "end": 1952.7200164794922,
      "text": " We will only go by the king's highway."
    },
    {
      "id": 64,
      "start": 1952.7200164794922,
      "end": 1955.1000213623047,
      "text": " We will not turn to the right hand nor to the left"
    },
    {
      "id": 65,
      "start": 1955.1000213623047,
      "end": 1957.3600158691406,
      "text": " until we have passed thy borders."
    },
    {
      "id": 66,
      "start": 1957.3600158691406,
      "end": 1959.02001953125,
      "text": " Now does the request of verse number 17"
    },
    {
      "id": 67,
      "start": 1959.02001953125,
      "end": 1960.52001953125,
      "text": " sound like a difficult thing?"
    },
    {
      "id": 68,
      "start": 1961.6200103759766,
      "end": 1963.500015258789,
      "text": " Were they really causing any trouble"
    },
    {
      "id": 69,
      "start": 1963.500015258789,
      "end": 1965.7000122070312,
      "text": " to Edom or the Edomites?"
    },
    {
      "id": 70,
      "start": 1965.7000122070312,
      "end": 1967.780014038086,
      "text": " And they just said, can we pass through?"
    },
    {
      "id": 71,
      "start": 1967.780014038086,
      "end": 1969.4200134277344,
      "text": " We're not gonna go through your fields,"
    },
    {
      "id": 72,
      "start": 1969.4200134277344,
      "end": 1970.7000122070312,
      "text": " we're not gonna go through your vineyards,"
    },
    {
      "id": 73,
      "start": 1970.7000122070312,
      "end": 1974.0600128173828,
      "text": " we're not gonna drink of your water or of your wells."
    },
    {
      "id": 74,
      "start": 1974.0600128173828,
      "end": 1975.1000213623047,
      "text": " We're gonna go the king's highway,"
    },
    {
      "id": 75,
      "start": 1975.1000213623047,
      "end": 1976.500015258789,
      "text": " we're not gonna turn to the right or to the left."
    },
    {
      "id": 76,
      "start": 1976.500015258789,
      "end": 1979.6200103759766,
      "text": " I mean, we're just gonna pass through your borders."
    },
    {
      "id": 77,
      "start": 1979.6200103759766,
      "end": 1981.2200164794922,
      "text": " The Bible says that Edom said unto him,"
    },
    {
      "id": 78,
      "start": 1981.2200164794922,
      "end": 1983.3400115966797,
      "text": " thou shalt not pass by me"
    },
    {
      "id": 79,
      "start": 1983.3400115966797,
      "end": 1985.8000183105469,
      "text": " lest I come out against thee with the sword."
    },
    {
      "id": 80,
      "start": 1988.1800079345703,
      "end": 1992.4200134277344,
      "text": " It's an interesting response to a simple request, right?"
    },
    {
      "id": 81,
      "start": 1992.4200134277344,
      "end": 1994.2200164794922,
      "text": " It seems like, damn it,"
    },
    {
      "id": 82,
      "start": 1994.2200164794922,
      "end": 1996.8600158691406,
      "text": " if you guys wanna pass through, go ahead."
    },
    {
      "id": 83,
      "start": 1996.8600158691406,
      "end": 1998.3800201416016,
      "text": " The neighbor back here called and said,"
    },
    {
      "id": 84,
      "start": 1998.3800201416016,
      "end": 2000.3800201416016,
      "text": " I got some tree work that I have to have done."
    },
    {
      "id": 85,
      "start": 2001.0600128173828,
      "end": 2002.3800201416016,
      "text": " It'd be really easy if the tree guys"
    },
    {
      "id": 86,
      "start": 2002.3800201416016,
      "end": 2004.5400085449219,
      "text": " could come through your property to access my property"
    },
    {
      "id": 87,
      "start": 2004.5400085449219,
      "end": 2005.6600189208984,
      "text": " because there's really no way for them"
    },
    {
      "id": 88,
      "start": 2005.6600189208984,
      "end": 2008.2400207519531,
      "text": " to get to where they need to get to through my front yard."
    },
    {
      "id": 89,
      "start": 2008.2400207519531,
      "end": 2009.0800170898438,
      "text": " Is it okay?"
    },
    {
      "id": 90,
      "start": 2009.0800170898438,
      "end": 2011.3000183105469,
      "text": " Sure, they can go through there, not a problem."
    },
    {
      "id": 91,
      "start": 2011.3000183105469,
      "end": 2014.3400115966797,
      "text": " I don't think, it's just easy, right?"
    },
    {
      "id": 92,
      "start": 2014.3400115966797,
      "end": 2015.6000213623047,
      "text": " I don't know if it's a different situation,"
    },
    {
      "id": 93,
      "start": 2015.6000213623047,
      "end": 2018.9000091552734,
      "text": " but what I'm saying is the response seems odd to the request"
    },
    {
      "id": 94,
      "start": 2018.9000091552734,
      "end": 2020.8200073242188,
      "text": " but again, when you understand and start connecting"
    },
    {
      "id": 95,
      "start": 2020.8200073242188,
      "end": 2022.2000122070312,
      "text": " the dots and see what's going on,"
    },
    {
      "id": 96,
      "start": 2022.2000122070312,
      "end": 2023.0400085449219,
      "text": " the Bible says in verse 19,"
    },
    {
      "id": 97,
      "start": 2023.0400085449219,
      "end": 2025.3800201416016,
      "text": " and the children of Israel said unto him,"
    },
    {
      "id": 98,
      "start": 2025.3800201416016,
      "end": 2026.9400177001953,
      "text": " we'll go by the highway,"
    },
    {
      "id": 99,
      "start": 2026.9400177001953,
      "end": 2029.2200164794922,
      "text": " and if I and my cattle drink of thy water,"
    },
    {
      "id": 100,
      "start": 2029.2200164794922,
      "end": 2031.02001953125,
      "text": " then I will pay for it."
    },
    {
      "id": 101,
      "start": 2031.02001953125,
      "end": 2033.1600189208984,
      "text": " I will only, without doing anything else,"
    },
    {
      "id": 102,
      "start": 2033.1600189208984,
      "end": 2034.780014038086,
      "text": " go through on my feet."
    },
    {
      "id": 103,
      "start": 2034.780014038086,
      "end": 2037.9000091552734,
      "text": " He said, thou shalt not go through."
    },
    {
      "id": 104,
      "start": 2037.9000091552734,
      "end": 2040.2400207519531,
      "text": " And Edom came out against him with much people"
    },
    {
      "id": 105,
      "start": 2040.2400207519531,
      "end": 2041.9800109863281,
      "text": " and with a strong hand."
    },
    {
      "id": 106,
      "start": 2041.9800109863281,
      "end": 2045.4200134277344,
      "text": " Thus, Edom refused to give Israel passage through his border"
    },
    {
      "id": 107,
      "start": 2045.4200134277344,
      "end": 2047.8600158691406,
      "text": " wherefore Israel turned away from him."
    },
    {
      "id": 108,
      "start": 2047.8600158691406,
      "end": 2049.5800170898438,
      "text": " The children of Israel, even the whole congregation,"
    },
    {
      "id": 109,
      "start": 2049.5800170898438,
      "end": 2051.9600219726562,
      "text": " journeyed from Kadesh and came unto Mount Hor."
    },
    {
      "id": 110,
      "start": 2053.000015258789,
      "end": 2055.4600219726562,
      "text": " We see this as a first dispute that we really see"
    },
    {
      "id": 111,
      "start": 2055.4600219726562,
      "end": 2056.4200134277344,
      "text": " of what's going on."
    },
    {
      "id": 112,
      "start": 2056.4200134277344,
      "end": 2058.02001953125,
      "text": " We see that the Bible records for us,"
    },
    {
      "id": 113,
      "start": 2058.02001953125,
      "end": 2059.260009765625,
      "text": " I'm not gonna be able to take the time"
    },
    {
      "id": 114,
      "start": 2059.260009765625,
      "end": 2060.6400146484375,
      "text": " to go through all of them,"
    },
    {
      "id": 115,
      "start": 2060.6400146484375,
      "end": 2062.760009765625,
      "text": " but the Bible records for us in the times,"
    },
    {
      "id": 116,
      "start": 2062.760009765625,
      "end": 2064.6200256347656,
      "text": " the days of King Saul."
    },
    {
      "id": 117,
      "start": 2065.780029296875,
      "end": 2067.280029296875,
      "text": " There's battle that takes place"
    },
    {
      "id": 118,
      "start": 2067.280029296875,
      "end": 2070.5,
      "text": " with not only the Amalekites,"
    },
    {
      "id": 119,
      "start": 2070.5,
      "end": 2072.9000244140625,
      "text": " we saw the grandson, Amalek, of Esau,"
    },
    {
      "id": 120,
      "start": 2072.9000244140625,
      "end": 2075.760009765625,
      "text": " but also with the Edomites."
    },
    {
      "id": 121,
      "start": 2075.760009765625,
      "end": 2077.560028076172,
      "text": " You can read that in 1 Samuel 14."
    },
    {
      "id": 122,
      "start": 2077.560028076172,
      "end": 2079.4200134277344,
      "text": " You can read that in the days of David."
    },
    {
      "id": 123,
      "start": 2079.4200134277344,
      "end": 2081.540008544922,
      "text": " Now, remember with me the history of Israel."
    },
    {
      "id": 124,
      "start": 2081.540008544922,
      "end": 2082.9400024414062,
      "text": " In fact, it tells us,"
    },
    {
      "id": 125,
      "start": 2082.9400024414062,
      "end": 2084.9600219726562,
      "text": " it's a very interesting statement that is given to us,"
    },
    {
      "id": 126,
      "start": 2084.9600219726562,
      "end": 2085.8600158691406,
      "text": " you don't need to turn back there,"
    },
    {
      "id": 127,
      "start": 2085.8600158691406,
      "end": 2088.9000244140625,
      "text": " but in Genesis 36 and verse number 31,"
    },
    {
      "id": 128,
      "start": 2088.9000244140625,
      "end": 2090.02001953125,
      "text": " it says, and these are the kings"
    },
    {
      "id": 129,
      "start": 2090.02001953125,
      "end": 2091.220001220703,
      "text": " that reigned in the land of Edom"
    },
    {
      "id": 130,
      "start": 2091.220001220703,
      "end": 2094.4600219726562,
      "text": " before there reigned any king over the children of Israel."
    },
    {
      "id": 131,
      "start": 2094.4600219726562,
      "end": 2096.5,
      "text": " And you read about all those dukes and those chiefs"
    },
    {
      "id": 132,
      "start": 2096.5,
      "end": 2099.1800231933594,
      "text": " and what have you there with the Edomites,"
    },
    {
      "id": 133,
      "start": 2099.1800231933594,
      "end": 2100.8600158691406,
      "text": " and even before the kings of Israel,"
    },
    {
      "id": 134,
      "start": 2100.8600158691406,
      "end": 2104.280029296875,
      "text": " they had what was going on there in that land in Seir"
    },
    {
      "id": 135,
      "start": 2104.280029296875,
      "end": 2105.1200256347656,
      "text": " with the Edomites,"
    },
    {
      "id": 136,
      "start": 2105.1200256347656,
      "end": 2107.060028076172,
      "text": " but then as you begin to think about Israel's history"
    },
    {
      "id": 137,
      "start": 2107.060028076172,
      "end": 2108.7000122070312,
      "text": " and Saul being the first king,"
    },
    {
      "id": 138,
      "start": 2108.7000122070312,
      "end": 2111.1400146484375,
      "text": " well, in the time of Saul,"
    },
    {
      "id": 139,
      "start": 2111.1400146484375,
      "end": 2112.6200256347656,
      "text": " there's a battle with the Edomites."
    },
    {
      "id": 140,
      "start": 2112.6200256347656,
      "end": 2114.1400146484375,
      "text": " There are disputes that takes place"
    },
    {
      "id": 141,
      "start": 2114.1400146484375,
      "end": 2115.740020751953,
      "text": " and battles that are recorded."
    },
    {
      "id": 142,
      "start": 2116.5800170898438,
      "end": 2119.060028076172,
      "text": " In the days of David, he's the next king of Israel."
    },
    {
      "id": 143,
      "start": 2119.060028076172,
      "end": 2122.1800231933594,
      "text": " And we find that during his reign in the times of David,"
    },
    {
      "id": 144,
      "start": 2122.1800231933594,
      "end": 2124.220001220703,
      "text": " there's disputes that take place."
    },
    {
      "id": 145,
      "start": 2124.220001220703,
      "end": 2126.300018310547,
      "text": " In fact, the Bible tells us in 2 Samuel 8"
    },
    {
      "id": 146,
      "start": 2126.300018310547,
      "end": 2128.6600036621094,
      "text": " and verse number 14, that during his reign,"
    },
    {
      "id": 147,
      "start": 2128.6600036621094,
      "end": 2132.220001220703,
      "text": " because David was mighty, the Lord was with him"
    },
    {
      "id": 148,
      "start": 2132.220001220703,
      "end": 2133.3400268554688,
      "text": " and the Lord gave him favor,"
    },
    {
      "id": 149,
      "start": 2133.3400268554688,
      "end": 2136.280029296875,
      "text": " the Lord preserved him withersoever he went,"
    },
    {
      "id": 150,
      "start": 2136.280029296875,
      "end": 2137.1200256347656,
      "text": " the Bible tells us,"
    },
    {
      "id": 151,
      "start": 2137.1200256347656,
      "end": 2139.8200073242188,
      "text": " but it tells us in 2 Kings 8 and verse 14,"
    },
    {
      "id": 152,
      "start": 2139.8200073242188,
      "end": 2143.300018310547,
      "text": " that Edom, that David put garrisons in Edom"
    },
    {
      "id": 153,
      "start": 2143.300018310547,
      "end": 2146.740020751953,
      "text": " and all they of Edom became David's servants."
    },
    {
      "id": 154,
      "start": 2146.740020751953,
      "end": 2148.8200073242188,
      "text": " And again, we see these interactions that are taking place"
    },
    {
      "id": 155,
      "start": 2148.8200073242188,
      "end": 2151.4600219726562,
      "text": " and all of a sudden we begin to connect these dots"
    },
    {
      "id": 156,
      "start": 2151.4600219726562,
      "end": 2153.9000244140625,
      "text": " of what's going on in the days of Solomon."
    },
    {
      "id": 157,
      "start": 2153.9000244140625,
      "end": 2156.02001953125,
      "text": " It's a sad thing, but the Bible tells us of Solomon,"
    },
    {
      "id": 158,
      "start": 2156.02001953125,
      "end": 2158.540008544922,
      "text": " we know that he had many wives."
    },
    {
      "id": 159,
      "start": 2158.540008544922,
      "end": 2160.0800170898438,
      "text": " You know, he had some wives that were"
    },
    {
      "id": 160,
      "start": 2160.0800170898438,
      "end": 2163.3400268554688,
      "text": " the descendants of Edom, Edomites, Moabites,"
    },
    {
      "id": 161,
      "start": 2163.3400268554688,
      "end": 2165.5,
      "text": " I mean, others, but Edomites were one of them"
    },
    {
      "id": 162,
      "start": 2165.5,
      "end": 2167.300018310547,
      "text": " that are specifically listed"
    },
    {
      "id": 163,
      "start": 2167.300018310547,
      "end": 2169.9000244140625,
      "text": " in 1 Kings 11 and verse number one."
    },
    {
      "id": 164,
      "start": 2169.9000244140625,
      "end": 2171.5,
      "text": " We find that in that text of scripture,"
    },
    {
      "id": 165,
      "start": 2171.5,
      "end": 2173.480010986328,
      "text": " it says, but King Solomon loved many strange women"
    },
    {
      "id": 166,
      "start": 2173.480010986328,
      "end": 2174.9000244140625,
      "text": " together with the daughter of Pharaoh,"
    },
    {
      "id": 167,
      "start": 2174.9000244140625,
      "end": 2177.540008544922,
      "text": " women of the Moabites, Ammonites, Edomites,"
    },
    {
      "id": 168,
      "start": 2177.540008544922,
      "end": 2179.8600158691406,
      "text": " Zidaneans and Hittites."
    },
    {
      "id": 169,
      "start": 2179.8600158691406,
      "end": 2183.740020751953,
      "text": " Again, we see the Edomites referenced."
    },
    {
      "id": 170,
      "start": 2184.740020751953,
      "end": 2186.6600036621094,
      "text": " It's interesting that God tells us"
    },
    {
      "id": 171,
      "start": 2186.6600036621094,
      "end": 2189.060028076172,
      "text": " in this same chapter in 1 Kings 11,"
    },
    {
      "id": 172,
      "start": 2189.060028076172,
      "end": 2191.3800048828125,
      "text": " it tells us how that God was angry with Solomon, why?"
    },
    {
      "id": 173,
      "start": 2191.3800048828125,
      "end": 2196.3800048828125,
      "text": " Because of his evil, where he built these places of worship"
    },
    {
      "id": 174,
      "start": 2197.5,
      "end": 2200.260009765625,
      "text": " for these false gods of these wives that he married"
    },
    {
      "id": 175,
      "start": 2200.260009765625,
      "end": 2201.9400024414062,
      "text": " and all that was taking place."
    },
    {
      "id": 176,
      "start": 2201.9400024414062,
      "end": 2206.060028076172,
      "text": " And we find that he also was burning incense"
    },
    {
      "id": 177,
      "start": 2206.060028076172,
      "end": 2207.6600036621094,
      "text": " and sacrificed one of their gods."
    },
    {
      "id": 178,
      "start": 2207.6600036621094,
      "end": 2211.4600219726562,
      "text": " And the Bible then tells us in verse 14 of 1 Kings 11,"
    },
    {
      "id": 179,
      "start": 2211.4600219726562,
      "end": 2213.980010986328,
      "text": " and the Lord stirred up an adversary unto Solomon,"
    },
    {
      "id": 180,
      "start": 2213.980010986328,
      "end": 2217.3800048828125,
      "text": " hey, dad, the Edomite."
    },
    {
      "id": 181,
      "start": 2217.3800048828125,
      "end": 2219.3400268554688,
      "text": " Hey, dad, the Edomite."
    },
    {
      "id": 182,
      "start": 2219.3400268554688,
      "end": 2222.52001953125,
      "text": " He was the king's seed in Edom."
    },
    {
      "id": 183,
      "start": 2222.52001953125,
      "end": 2225.300018310547,
      "text": " The days of Amaziah, king of Judah,"
    },
    {
      "id": 184,
      "start": 2225.300018310547,
      "end": 2228.8200073242188,
      "text": " there's conflict, there are disputes with the Edomites."
    },
    {
      "id": 185,
      "start": 2228.8200073242188,
      "end": 2229.9400024414062,
      "text": " But I want you to think about"
    },
    {
      "id": 186,
      "start": 2229.9400024414062,
      "end": 2232.1800231933594,
      "text": " the judgment upon the Edomites."
    },
    {
      "id": 187,
      "start": 2232.1800231933594,
      "end": 2234.220001220703,
      "text": " I won't take time to look at any of the references."
    },
    {
      "id": 188,
      "start": 2234.220001220703,
      "end": 2235.7000122070312,
      "text": " We're near the end this evening."
    },
    {
      "id": 189,
      "start": 2235.7000122070312,
      "end": 2237.9000244140625,
      "text": " But turn to the book of Jeremiah, if you will."
    },
    {
      "id": 190,
      "start": 2237.9000244140625,
      "end": 2240.1000061035156,
      "text": " Read two verses from the book of Jeremiah and Ezekiel"
    },
    {
      "id": 191,
      "start": 2240.1000061035156,
      "end": 2243.980010986328,
      "text": " and I encourage you to read the small book of Obadiah."
    },
    {
      "id": 192,
      "start": 2243.980010986328,
      "end": 2247.6800231933594,
      "text": " And the book of Obadiah completely deals with Edom,"
    },
    {
      "id": 193,
      "start": 2248.540008544922,
      "end": 2250.060028076172,
      "text": " the sons of Esau."
    },
    {
      "id": 194,
      "start": 2250.060028076172,
      "end": 2253.220001220703,
      "text": " Specifically goes back to Numbers 20."
    },
    {
      "id": 195,
      "start": 2254.3800048828125,
      "end": 2255.9000244140625,
      "text": " To the event that we read of in Numbers 20"
    },
    {
      "id": 196,
      "start": 2255.9000244140625,
      "end": 2257.8200073242188,
      "text": " where they said we're gonna pass through."
    },
    {
      "id": 197,
      "start": 2257.8200073242188,
      "end": 2259.5,
      "text": " He said, no, you're not."
    },
    {
      "id": 198,
      "start": 2259.5,
      "end": 2262.260009765625,
      "text": " If you read the book of Obadiah, just a short book,"
    },
    {
      "id": 199,
      "start": 2262.260009765625,
      "end": 2265.3800048828125,
      "text": " you'll see that indictment against the Edomites"
    },
    {
      "id": 200,
      "start": 2265.3800048828125,
      "end": 2267.6200256347656,
      "text": " that God gives through that prophet Obadiah."
    },
    {
      "id": 201,
      "start": 2267.6200256347656,
      "end": 2269.3200073242188,
      "text": " But notice in Jeremiah 49,"
    },
    {
      "id": 202,
      "start": 2270.7000122070312,
      "end": 2272.260009765625,
      "text": " and then we'll also notice over"
    },
    {
      "id": 203,
      "start": 2272.260009765625,
      "end": 2274.040008544922,
      "text": " in the book of Ezekiel very quickly,"
    },
    {
      "id": 204,
      "start": 2274.040008544922,
      "end": 2275.9200134277344,
      "text": " but notice in Jeremiah 49,"
    },
    {
      "id": 205,
      "start": 2282.02001953125,
      "end": 2283.740020751953,
      "text": " really beginning in verse number seven,"
    },
    {
      "id": 206,
      "start": 2283.740020751953,
      "end": 2288.1800231933594,
      "text": " it says concerning Edom, thus saith the Lord of hosts."
    },
    {
      "id": 207,
      "start": 2288.1800231933594,
      "end": 2291.3800048828125,
      "text": " I'm not gonna read all of it for sake of time."
    },
    {
      "id": 208,
      "start": 2291.3800048828125,
      "end": 2293.1800231933594,
      "text": " But we find that these are prophecies"
    },
    {
      "id": 209,
      "start": 2293.1800231933594,
      "end": 2294.5800170898438,
      "text": " that are given against Edom."
    },
    {
      "id": 210,
      "start": 2294.5800170898438,
      "end": 2296.9400024414062,
      "text": " And we see specifically throughout this portion"
    },
    {
      "id": 211,
      "start": 2296.9400024414062,
      "end": 2297.780029296875,
      "text": " of the book of Jeremiah,"
    },
    {
      "id": 212,
      "start": 2297.780029296875,
      "end": 2298.800018310547,
      "text": " the number of different places"
    },
    {
      "id": 213,
      "start": 2298.800018310547,
      "end": 2300.300018310547,
      "text": " that are receiving these prophecies"
    },
    {
      "id": 214,
      "start": 2300.300018310547,
      "end": 2303.9000244140625,
      "text": " concerning against these particular people groups."
    },
    {
      "id": 215,
      "start": 2303.9000244140625,
      "end": 2306.260009765625,
      "text": " And so concerning Edom, thus saith the Lord of hosts."
    },
    {
      "id": 216,
      "start": 2306.260009765625,
      "end": 2308.8200073242188,
      "text": " And then skip down, if you will, in verse number 17,"
    },
    {
      "id": 217,
      "start": 2308.8200073242188,
      "end": 2311.9400024414062,
      "text": " the Bible says also Edom shall be a desolation."
    },
    {
      "id": 218,
      "start": 2311.9400024414062,
      "end": 2314.1400146484375,
      "text": " Everyone that goeth by it shall be astonished"
    },
    {
      "id": 219,
      "start": 2314.1400146484375,
      "end": 2317.739990234375,
      "text": " and shall hiss at all the plagues thereof."
    },
    {
      "id": 220,
      "start": 2318.7000122070312,
      "end": 2321.4200439453125,
      "text": " The Bible says very similarly in the book of Ezekiel,"
    },
    {
      "id": 221,
      "start": 2321.4200439453125,
      "end": 2323.7000122070312,
      "text": " look over, if you will, Ezekiel 25."
    },
    {
      "id": 222,
      "start": 2324.780029296875,
      "end": 2327.260009765625,
      "text": " In Ezekiel 25, in verses 12 through 14,"
    },
    {
      "id": 223,
      "start": 2327.260009765625,
      "end": 2330.739990234375,
      "text": " we read this judgment that is given again"
    },
    {
      "id": 224,
      "start": 2330.739990234375,
      "end": 2332.8599853515625,
      "text": " in this portion of the book of Ezekiel,"
    },
    {
      "id": 225,
      "start": 2332.8599853515625,
      "end": 2335.9800415039062,
      "text": " a number of different nations are being prophesied against."
    },
    {
      "id": 226,
      "start": 2335.9800415039062,
      "end": 2338.5800170898438,
      "text": " And in this particular text, it's against Edom."
    },
    {
      "id": 227,
      "start": 2338.5800170898438,
      "end": 2340.2200317382812,
      "text": " Beginning in verse number 12,"
    },
    {
      "id": 228,
      "start": 2341.6600341796875,
      "end": 2343.3400268554688,
      "text": " the Bible says, thus saith the Lord God,"
    },
    {
      "id": 229,
      "start": 2343.3400268554688,
      "end": 2345.760009765625,
      "text": " because that Edom hath dealt against the house of Judah"
    },
    {
      "id": 230,
      "start": 2345.760009765625,
      "end": 2348.5,
      "text": " by taking vengeance and hath greatly offended"
    },
    {
      "id": 231,
      "start": 2348.5,
      "end": 2350.3800048828125,
      "text": " and revenged himself upon them."
    },
    {
      "id": 232,
      "start": 2350.3800048828125,
      "end": 2351.9000244140625,
      "text": " Therefore, thus saith the Lord God,"
    },
    {
      "id": 233,
      "start": 2351.9000244140625,
      "end": 2354.6600341796875,
      "text": " I will also stretch out mine hand upon Edom,"
    },
    {
      "id": 234,
      "start": 2354.6600341796875,
      "end": 2356.5400390625,
      "text": " will cut off man and beast from it,"
    },
    {
      "id": 235,
      "start": 2356.5400390625,
      "end": 2358.780029296875,
      "text": " and I will make it desolate from Timan,"
    },
    {
      "id": 236,
      "start": 2358.780029296875,
      "end": 2361.1799926757812,
      "text": " and they of Dedan shall fall by the sword."
    },
    {
      "id": 237,
      "start": 2361.1799926757812,
      "end": 2363.2200317382812,
      "text": " And I will lay my vengeance upon Edom"
    },
    {
      "id": 238,
      "start": 2363.2200317382812,
      "end": 2364.8200073242188,
      "text": " by the hand of my people Israel,"
    },
    {
      "id": 239,
      "start": 2364.8200073242188,
      "end": 2367.5800170898438,
      "text": " and they shall do in Edom according to mine anger"
    },
    {
      "id": 240,
      "start": 2367.5800170898438,
      "end": 2368.9000244140625,
      "text": " and according to my fury,"
    },
    {
      "id": 241,
      "start": 2368.9000244140625,
      "end": 2371.9800415039062,
      "text": " and they shall know my vengeance, saith the Lord God."
    },
    {
      "id": 242,
      "start": 2373.2200317382812,
      "end": 2376.0599975585938,
      "text": " Those are pretty powerful judgments"
    },
    {
      "id": 243,
      "start": 2376.0599975585938,
      "end": 2377.8599853515625,
      "text": " that are given by Jeremiah and Ezekiel."
    },
    {
      "id": 244,
      "start": 2377.8599853515625,
      "end": 2380.3400268554688,
      "text": " Again, you can read the book of Obadiah."
    },
    {
      "id": 245,
      "start": 2380.3400268554688,
      "end": 2383.2200317382812,
      "text": " What I wanna think about the application for us this evening"
    },
    {
      "id": 246,
      "start": 2383.2200317382812,
      "end": 2386.260009765625,
      "text": " in closing, as we think about this portion of Scripture"
    },
    {
      "id": 247,
      "start": 2386.260009765625,
      "end": 2387.9800415039062,
      "text": " and we read about some decisions"
    },
    {
      "id": 248,
      "start": 2387.9800415039062,
      "end": 2390.3800048828125,
      "text": " and we read about the descendants,"
    },
    {
      "id": 249,
      "start": 2391.4000244140625,
      "end": 2394.1000366210938,
      "text": " we read about the disputes."
    },
    {
      "id": 250,
      "start": 2394.1000366210938,
      "end": 2397.3400268554688,
      "text": " As we think about that, again, that symbolism,"
    },
    {
      "id": 251,
      "start": 2398.4600219726562,
      "end": 2400.6600341796875,
      "text": " we talked about that struggle within the..."
    },
    {
      "id": 0,
      "start": 2400.6600341796875,
      "end": 2410.6200342178345,
      "text": " womb, two nations. The elder shall serve the younger. We see that in scripture. We've just"
    },
    {
      "id": 1,
      "start": 2410.6200342178345,
      "end": 2416.220034599304,
      "text": " looked at a number of passages of disputes and all that's going on. You find that the"
    },
    {
      "id": 2,
      "start": 2416.220034599304,
      "end": 2423.060033798218,
      "text": " Bible tells us, as I've made application, that not only is it two nations, but by application"
    },
    {
      "id": 3,
      "start": 2423.060033798218,
      "end": 2429.12003326416,
      "text": " we'd see the two natures, the old man and the new man. And we need to think about the"
    },
    {
      "id": 4,
      "start": 2429.12003326416,
      "end": 2433.080032348633,
      "text": " disputes that are recorded for us as we connect the dots historically and look at what's going"
    },
    {
      "id": 5,
      "start": 2433.080032348633,
      "end": 2442.1600341796875,
      "text": " on and begin to think about the dispute that we have between the old man and the new man."
    },
    {
      "id": 6,
      "start": 2442.1600341796875,
      "end": 2445.0000343322754,
      "text": " We think about trying to walk in the spirit. Turn to the book of Galatians, if you will."
    },
    {
      "id": 7,
      "start": 2445.0000343322754,
      "end": 2453.5400352478027,
      "text": " I want you to think about the struggle that we can face as we consider with this evening"
    },
    {
      "id": 8,
      "start": 2453.5400352478027,
      "end": 2458.200035095215,
      "text": " in this portion of scripture and think about the struggle that's there even within the"
    },
    {
      "id": 9,
      "start": 2458.200035095215,
      "end": 2462.62003326416,
      "text": " womb in Genesis 25 and then as God provides us with this record. And we come to Galatians"
    },
    {
      "id": 10,
      "start": 2462.62003326416,
      "end": 2467.140037536621,
      "text": " chapter number six and we seek to make this application and we find that the Bible tells"
    },
    {
      "id": 11,
      "start": 2467.140037536621,
      "end": 2472.500030517578,
      "text": " us as we understand being saved, being born again, having the new man, the new nature,"
    },
    {
      "id": 12,
      "start": 2472.500030517578,
      "end": 2477.6600341796875,
      "text": " that the old man, the old man is not eradicated. In fact, in the book of Ephesians and the"
    },
    {
      "id": 13,
      "start": 2477.6600341796875,
      "end": 2483.300033569336,
      "text": " book of Colossians as well, both of those books go through a portion and Ephesians four"
    },
    {
      "id": 14,
      "start": 2483.300033569336,
      "end": 2490.080032348633,
      "text": " specifically lays out at the whole end of that chapter, put off, put on. The book of"
    },
    {
      "id": 15,
      "start": 2490.080032348633,
      "end": 2493.4800338745117,
      "text": " Colossians deals with it the same way. We're to put off the old man and put on the new"
    },
    {
      "id": 16,
      "start": 2493.4800338745117,
      "end": 2498.8800354003906,
      "text": " and here's what we're to do as we're to walk in this newness of life. But notice in Galatians"
    },
    {
      "id": 17,
      "start": 2498.8800354003906,
      "end": 2505.7600326538086,
      "text": " five and verse 16, this I say then. It's a wonderful promise of God's word. Walk in the"
    },
    {
      "id": 18,
      "start": 2505.7600326538086,
      "end": 2513.7800369262695,
      "text": " spirit and you shall not fulfill the lust of the flesh. How many of you know that your"
    },
    {
      "id": 19,
      "start": 2513.7800369262695,
      "end": 2523.580032348633,
      "text": " flesh still has lusts? Your flesh still has lusts. But the Bible says that if I walk in"
    },
    {
      "id": 20,
      "start": 2523.580032348633,
      "end": 2527.4800338745117,
      "text": " the spirit, I shall not fulfill the lust of the flesh. It doesn't say that I'm not going"
    },
    {
      "id": 21,
      "start": 2527.4800338745117,
      "end": 2531.8600311279297,
      "text": " to have a lust of the flesh, so I'm going to be able to have victory. I'm not going"
    },
    {
      "id": 22,
      "start": 2531.8600311279297,
      "end": 2537.6000366210938,
      "text": " to fulfill the lust of the flesh. Notice in verse 17, for the flesh lusteth against"
    },
    {
      "id": 23,
      "start": 2537.6000366210938,
      "end": 2546.800033569336,
      "text": " the spirit and the spirit against the flesh. Notice this, and these are contrary, the one"
    },
    {
      "id": 24,
      "start": 2546.800033569336,
      "end": 2553.4800415039062,
      "text": " to the other, so that you cannot do the things that you would. In verses 19 through 21, the"
    },
    {
      "id": 25,
      "start": 2553.4800415039062,
      "end": 2557.560028076172,
      "text": " Bible gives us the works of the flesh. In verse 22 and verse 23, the Bible gives us"
    },
    {
      "id": 26,
      "start": 2557.560028076172,
      "end": 2561.800033569336,
      "text": " the fruit of the spirit. If you do a comparison between those two portions of scripture, the"
    },
    {
      "id": 27,
      "start": 2561.800033569336,
      "end": 2566.7000274658203,
      "text": " fruit of the spirit is far superior than the works of the flesh. And we ought to have"
    },
    {
      "id": 28,
      "start": 2566.7000274658203,
      "end": 2572.780029296875,
      "text": " a spiritually, or we ought to be spiritually minded people, not like Esau having that fleshly,"
    },
    {
      "id": 29,
      "start": 2572.780029296875,
      "end": 2577.6600341796875,
      "text": " that carnal, that temporary perspective of life, but that we'd have that perspective"
    },
    {
      "id": 30,
      "start": 2577.6600341796875,
      "end": 2582.580032348633,
      "text": " that is seeking to please God. I shared with those that came for the workers meeting tonight"
    },
    {
      "id": 31,
      "start": 2582.580032348633,
      "end": 2588.0400390625,
      "text": " for vacation Bible school a verse of scripture that we're familiar with, but I was reading"
    },
    {
      "id": 32,
      "start": 2588.0400390625,
      "end": 2592.760040283203,
      "text": " it just this past week and God just impressed upon my heart again, this wonderful truth"
    },
    {
      "id": 33,
      "start": 2592.760040283203,
      "end": 2602.6400299072266,
      "text": " where Jesus says, for I do always those things that please him in John 8 and verse 29. Esau"
    },
    {
      "id": 34,
      "start": 2602.6400299072266,
      "end": 2606.1200408935547,
      "text": " wasn't concerned about doing things that please God. He wasn't concerned about doing things"
    },
    {
      "id": 35,
      "start": 2606.1200408935547,
      "end": 2613.2000274658203,
      "text": " that would please his own father. And this evening, when we understand this struggle"
    },
    {
      "id": 36,
      "start": 2613.2000274658203,
      "end": 2618.9800415039062,
      "text": " that we face, this two natures that's by way of application, the symbolism of those"
    },
    {
      "id": 37,
      "start": 2618.9800415039062,
      "end": 2624.240036010742,
      "text": " two nations that we read of with Jacob and Esau, we find this evening that the struggle,"
    },
    {
      "id": 38,
      "start": 2624.240036010742,
      "end": 2631.240036010742,
      "text": " that they're at enmity one with the other. They're contrary one to the other. So this"
    },
    {
      "id": 39,
      "start": 2631.240036010742,
      "end": 2638.080032348633,
      "text": " evening, what do we do? Well, notice what the Bible says over the book of Colossians."
    },
    {
      "id": 40,
      "start": 2638.080032348633,
      "end": 2646.240036010742,
      "text": " In Colossians chapter number three, familiar verses of scripture. I hope it will help"
    },
    {
      "id": 41,
      "start": 2646.240036010742,
      "end": 2655.760040283203,
      "text": " us this evening to understand the importance of walking in the spirit and seeking to please"
    },
    {
      "id": 42,
      "start": 2655.760040283203,
      "end": 2665.8400268554688,
      "text": " God. The Bible says this, if ye then be risen with Christ. Are we risen with Christ? Spiritually"
    },
    {
      "id": 43,
      "start": 2665.8400268554688,
      "end": 2670.7200317382812,
      "text": " speaking, if you've been saved, if you've been born again, you're risen with Christ."
    },
    {
      "id": 44,
      "start": 2670.7200317382812,
      "end": 2679.1200256347656,
      "text": " Notice what it says, seek those things which are above. Where Christ sitteth on the right"
    },
    {
      "id": 45,
      "start": 2679.1200256347656,
      "end": 2689.280029296875,
      "text": " hand of God. Notice what it says, set your affection on things above, not on things of"
    },
    {
      "id": 46,
      "start": 2689.280029296875,
      "end": 2698.080047607422,
      "text": " the earth. Why? For you're dead, and your life is hid with Christ in God. When Christ,"
    },
    {
      "id": 47,
      "start": 2698.080047607422,
      "end": 2704.4000244140625,
      "text": " who is our life, praise the Lord for that little statement, who is our life, shall appear,"
    },
    {
      "id": 48,
      "start": 2704.4000244140625,
      "end": 2709.4800415039062,
      "text": " then shall ye also appear with him in glory. Mortify therefore your members which are upon"
    },
    {
      "id": 49,
      "start": 2709.4800415039062,
      "end": 2713.2000427246094,
      "text": " the earth. And he goes through, and this is the section of the book of Colossians that"
    },
    {
      "id": 50,
      "start": 2713.2000427246094,
      "end": 2719.6400451660156,
      "text": " deals with that put off and put on portion of scripture. We make decisions in life, and"
    },
    {
      "id": 51,
      "start": 2719.6400451660156,
      "end": 2724.760040283203,
      "text": " it's the first point that we dealt with this evening. How do we make the decisions? Just"
    },
    {
      "id": 52,
      "start": 2724.760040283203,
      "end": 2727.7200317382812,
      "text": " go along with something because it's what somebody else is doing, it's something that's"
    },
    {
      "id": 53,
      "start": 2727.7200317382812,
      "end": 2732.6800231933594,
      "text": " popular, it's something that's accepted. Or we sit back and say, you know, is this going"
    },
    {
      "id": 54,
      "start": 2732.6800231933594,
      "end": 2740.760040283203,
      "text": " to please God? What's the impact of this decision? What are the consequences of this decision?"
    },
    {
      "id": 55,
      "start": 2740.760040283203,
      "end": 2744.080047607422,
      "text": " Is this decision that is before me really a decision that's going to be able to be made"
    },
    {
      "id": 56,
      "start": 2744.080047607422,
      "end": 2751.1200256347656,
      "text": " in a vacuum that's only going to affect me, that's only going to impact me? So as we look"
    },
    {
      "id": 57,
      "start": 2751.1200256347656,
      "end": 2759.6000366210938,
      "text": " at the genealogy, really the descendants, the generations of Esau, in Genesis chapter"
    },
    {
      "id": 58,
      "start": 2759.6000366210938,
      "end": 2766.0400390625,
      "text": " 36, God helps us to connect some dots in scripture. God helps us to be able to see some of the"
    },
    {
      "id": 59,
      "start": 2766.0400390625,
      "end": 2771.580047607422,
      "text": " historical content of preceding events in the life of Esau and then future interactions"
    },
    {
      "id": 60,
      "start": 2771.580047607422,
      "end": 2779.000030517578,
      "text": " between the Edomites and the Israelites, the Amalekites. But this evening as we think about"
    },
    {
      "id": 61,
      "start": 2779.000030517578,
      "end": 2783.9200439453125,
      "text": " our own lives and try to make spiritual application, I'm going to focus on those few first thoughts"
    },
    {
      "id": 62,
      "start": 2783.9200439453125,
      "end": 2789.760040283203,
      "text": " with regard to our decisions. I hope this evening that we seek counsel, godly counsel."
    },
    {
      "id": 63,
      "start": 2790.320037841797,
      "end": 2796.0400390625,
      "text": " I hope this evening that we seek the face of God in the decisions that we're making."
    },
    {
      "id": 64,
      "start": 2796.0400390625,
      "end": 2803.1200256347656,
      "text": " You say, well, listen, I'm older, it's not really that big of a deal. No, it is. It is."
    },
    {
      "id": 65,
      "start": 2803.1200256347656,
      "end": 2808.3600463867188,
      "text": " There are people watching you, your children, your grandchildren, if God has given them"
    },
    {
      "id": 66,
      "start": 2808.3600463867188,
      "end": 2812.9600219726562,
      "text": " to you. If not, children in our church, those that were to be an example to you. Think about"
    },
    {
      "id": 67,
      "start": 2812.9600219726562,
      "end": 2817.280029296875,
      "text": " the admonition that's given in God's Word to those that are referred to as being the"
    },
    {
      "id": 68,
      "start": 2817.280029296875,
      "end": 2824.4800415039062,
      "text": " aged women and the aged men in church. Listen, there is a real biblical role that God gives"
    },
    {
      "id": 69,
      "start": 2824.4800415039062,
      "end": 2830.1600341796875,
      "text": " in the epistles for aged women and aged men in a church to be able to influence and impact"
    },
    {
      "id": 70,
      "start": 2830.1600341796875,
      "end": 2836.4400329589844,
      "text": " a future generation. And by the way, it's a role that is very rarely spoken about today,"
    },
    {
      "id": 71,
      "start": 2836.4400329589844,
      "end": 2843.4000244140625,
      "text": " but it's so vital and it's so important. This evening, you have decisions, I have decisions."
    },
    {
      "id": 72,
      "start": 2843.4000244140625,
      "end": 2850.8800354003906,
      "text": " Are we trying to please ourselves like Esau did? What works best for me? We're going to"
    },
    {
      "id": 73,
      "start": 2850.8800354003906,
      "end": 2853.6000366210938,
      "text": " take a piece of paper, we're going to lay it out and say, well, here's all the pros"
    },
    {
      "id": 74,
      "start": 2853.6000366210938,
      "end": 2860.240020751953,
      "text": " and here's all the cons. How many of you have heard somebody say that about making a decision?"
    },
    {
      "id": 75,
      "start": 2860.240020751953,
      "end": 2867.800048828125,
      "text": " You know, that's not how we as Bible believers make decisions. Why? Because if God said to"
    },
    {
      "id": 76,
      "start": 2867.8400268554688,
      "end": 2873.1200256347656,
      "text": " do something, it doesn't matter how many pros or cons there are. We do what God says. It"
    },
    {
      "id": 77,
      "start": 2873.1200256347656,
      "end": 2876.760040283203,
      "text": " doesn't matter how many people understand it. It doesn't matter how popular it might"
    },
    {
      "id": 78,
      "start": 2876.760040283203,
      "end": 2881.1600341796875,
      "text": " be. It doesn't matter what anyone else is doing. We say God has led and God has made"
    },
    {
      "id": 79,
      "start": 2881.1600341796875,
      "end": 2888.1600341796875,
      "text": " it clear and this is the decision I have to make. Decisions have consequences. You can,"
    },
    {
      "id": 80,
      "start": 2888.3600463867188,
      "end": 2895.3600463867188,
      "text": " in a certain sense, control your decisions, but not your consequences. How many times"
    },
    {
      "id": 81,
      "start": 2899.240020751953,
      "end": 2906.240020751953,
      "text": " we face the consequences and we don't like them? We say, man, I wish I could have. The"
    },
    {
      "id": 82,
      "start": 2906.240020751953,
      "end": 2912.6400451660156,
      "text": " consequences are already in motion. It's already taken place. This evening, we see the generations"
    },
    {
      "id": 83,
      "start": 2912.6400451660156,
      "end": 2919.6400146484375,
      "text": " of Esau. We can see the biblical, historical understanding of God giving us all of that"
    },
    {
      "id": 84,
      "start": 2919.6400146484375,
      "end": 2924.6400146484375,
      "text": " information. Tonight, I hope that we can make a spiritual application. Say, God, help me"
    },
    {
      "id": 85,
      "start": 2924.6400146484375,
      "end": 2930.9200439453125,
      "text": " to not be concerned about the temporal things, the fleshly things. Help me to be spiritually"
    },
    {
      "id": 86,
      "start": 2930.9200439453125,
      "end": 2937.3200073242188,
      "text": " minded. Help me to please you with my life. Let's pray. Father, we love you. We thank"
    },
    {
      "id": 87,
      "start": 2937.3600463867188,
      "end": 2944.0800170898438,
      "text": " you for loving us. We thank you for your word, the truth that's contained therein. God, I"
    },
    {
      "id": 88,
      "start": 2944.0800170898438,
      "end": 2947.760009765625,
      "text": " pray that as we've looked at this portion of Scripture and a number of other verses"
    },
    {
      "id": 89,
      "start": 2947.760009765625,
      "end": 2954.9600219726562,
      "text": " this evening, you help us to make application in our lives. Help us, Lord, to please you."
    },
    {
      "id": 90,
      "start": 2954.9600219726562,
      "end": 2961.9600219726562,
      "text": " Understand that we have decisions in our lives. Some decisions that are much more significant"
    },
    {
      "id": 91,
      "start": 2962.9600219726562,
      "end": 2969.9600219726562,
      "text": " than other decisions, decisions that will have consequences that will impact others."
    },
    {
      "id": 92,
      "start": 2970.6400146484375,
      "end": 2977.6400146484375,
      "text": " Lord, I pray that you would help us to seek your face, would seek godly counsel, that"
    },
    {
      "id": 93,
      "start": 2981.0400390625,
      "end": 2988.0400390625,
      "text": " we would walk in the Spirit, that our aim and desire would be most important to please"
    },
    {
      "id": 94,
      "start": 2989.0400390625,
      "end": 2995.0400390625,
      "text": " you. I pray that as we have opportunity to respond this evening, have a moment of invitation,"
    },
    {
      "id": 95,
      "start": 2995.0400390625,
      "end": 3002.0400390625,
      "text": " I pray that you'd move and work, guide us, and direct us, Lord. Help us to move and work."
    },
    {
      "id": 0,
      "start": 3002.0400390625,
      "end": 3006.4800391197205,
      "text": " to be doers of the Word and not hearers only. Maybe somebody has some major decisions in"
    },
    {
      "id": 1,
      "start": 3006.4800391197205,
      "end": 3013.200038909912,
      "text": " front of them. God, would you give them wisdom? Would you give them leadership? Would you"
    },
    {
      "id": 2,
      "start": 3013.200038909912,
      "end": 3018.6400394439697,
      "text": " help them to seek your face? Would you help them to please you? I pray that you have your"
    },
    {
      "id": 3,
      "start": 3018.6400394439697,
      "end": 3020.5200386047363,
      "text": " will and way, for it's in Christ's name we pray."
    }
  ],
  "processed_at": "2025-04-16T08:47:05.067027"
}