{
  "video_id": "wmBpYb5deRo",
  "text": "Ezra chapter number seven, and as we get into the message this evening, of course, we're not doing a series through the book of Ezra or even a character study on the life of Ezra. But Ezra chapter number seven, we'll look at these 10 verses. I enjoy the opportunity to study lives of those that have gone before us. It's exciting to study Bible characters, to go through the word of God and to see men and women that were used of the Lord to accomplish great things. It's a joy and privilege to have the opportunity to read and study about those that have gone before us that aren't necessarily Bible characters, but people that God used throughout the centuries. Often I reference several of those individuals and how God used them and what a blessing that is. Oftentimes as we study the lives of those that have gone before us, whether they're Bible character or not, we readily understand that they were people just like we're people. That they live life day by day, just like we live life day by day. That they encountered difficulties and opposition and challenges, that they experienced victory, they experienced just mighty things that God would do in and through their lives. We find that often as we study the lives of those that have gone before us, that there are times in which we see the victory that they experienced. We see some great work that they were able to be involved in, something that God did in and through their lives, and maybe we don't have the knowledge of maybe some preparation, of maybe some of the early days. I often think of David, and of course 1 Samuel chapter 17, many times if you ask somebody about David, King David, you ask him about one of the greatest events, no doubt within just a small group of people, someone will speak about David and Goliath. It's a very well known Bible account and what a great victory that was wrought on that day as it's recorded in 1 Samuel 17, but we understand that there was some preparation that took place in the life of David prior to him ever encountering Goliath in that valley. It's exciting to study about the preparation. It's exciting, I preached a message once many years ago on training to slay giants, and just the training that David, the experiences and all that God did in and through him, and what a joy that is. When you think about Ezra, oftentimes some may think about Ezra and you think about him standing upon that pulpit of wood and teaching the people of God the Word of God, and what a wonderful account, Nehemiah chapter 8 records that for us, and I mean just an exciting passage of Scripture, but well before he experienced that opportunity, we find that the Bible gives us some insight into this man, Ezra. If you're taking notes, I've titled the message simply this, Ezra, a ready scribe. Ezra, a ready scribe. The Bible says in Ezra 7, in verse number 1, now after these things, in the reign of Artaxerxes, king of Persia, Ezra, the son of Sariah, the son of Azariah, the son of Hilkiah, the son of Shalom, the son of Zadok, the son of Ahitab, the son of Amoriah, the son of Azariah, the son of Merioth, the son of Zerahiah, the son of Uzziah, the son of Bukkiah, the son of Abishua, the son of Phinehas, the son of Eleazar, the son of Aaron, the chief priest. This Ezra, notice in verse number 6, went up from Babylon and he was a ready scribe in the law of Moses, which the Lord God of Israel had given, and the king granted him all his requests according to the hand of the Lord his God upon him. Verse number 7, and there went up some of the children of Israel, and of the priests and the Levites and the singers and the porters and the Nethanims unto Jerusalem in the seventh year of Artaxerxes the king. And he came to Jerusalem in the fifth month, which was in the seventh year of the king. For upon the first day of the first month began he to go up from Babylon, and on the first day of the fifth month came he to Jerusalem according to the good hand of his God upon him. Now notice verse number 10. The Bible says this, for Ezra had prepared his heart to seek the law of the Lord and to do it and to teach in Israel statutes and judgments. Notice the Bible gives us some insight here to the man Ezra. His genealogy is described in verses 1 through 5, and we find that it's traced back to Aaron the chief priest, and we find that he is giving us here in this passage of Scripture his genealogy, and certainly that's important for us to understand. And we begin to get into verses 6 through 9, and we begin to understand kind of some of the circumstances in which Ezra was serving the Lord, and we understand that the book of Ezra is capturing for us the promised return of the remnant. You'll remember that Jeremiah had been prophesying prior to the Babylonian captivity, and during his time of prophecy we find that often throughout the prophecy you would find this truth of the remnant returning after 70 years. And we find that in the book of Ezra that God is providing us with that decree of Cyrus that would allow for those people of God, the children of Israel that had been in Babylonian captivity to return back to Jerusalem. And so we find that there was a number of years that passed between the events in chapters 1 through 6, and here where we find in chapter number 7 when Ezra is now returning, it says in verse 8 that he came to Jerusalem in the fifth month, and you find that God's hand was upon him, the good hand of his God upon him. We see that in verse number 6, and again in verse number 9, and so we find that the Bible gives us some understanding of his genealogy, of the circumstances, his arrival there into Jerusalem, but I want you to focus upon verse number 10, and I'm simply going to break the verse down and deal with it in individual statements, and trust that it would be a blessing to you this evening. It says, first of all, that he had prepared his heart to seek the law of the Lord. That's a good thing, amen? He had prepared his heart to seek the law of the Lord. I believe that Ezra had an understanding of the preciousness of God's Word. We often speak about how precious this book is. We often hear you hear me say that this book is powerful and that it's precious, it's preserved, it's perfect, and it's profitable, and we could speak about how wonderful the Word of God is, and on a daily basis, I thank God for His Word. I thank God for the opportunity as a believer to have the Word of God in my language, that I can go to it and I can read it, that I can seek the law of the Lord. We find that Ezra must have had an understanding of the preciousness of the Word of God, for God tells us in giving us the description of this man's preparation, that he was a ready scribe. The Bible tells us that he had prepared his heart to seek the law of the Lord. I wonder, perhaps Ezra had some level of knowledge. Maybe he was familiar with Psalm 19. Maybe he was familiar with Psalm 119. We studied Psalm 119 in our adult Sunday school class last year, and we went stanza by stanza through that entire Psalm, and how the Psalm reminds us of the preciousness and the importance of the Word of God. We find that David, of course, in Psalm 19, the law of the Lord is perfect, and we can go through those verses and we can see the importance that God has placed, the priority upon His Word. And I believe that Ezra had some knowledge, some level of knowledge with regard to the truth of these principles in these verses. Perhaps Ezra was aware of the principle that we find in Proverbs 30, in verse number 5, where the Bible says, Every word of God is pure, He is a shield unto them that put their trust in Him. Maybe Ezra had some level of knowledge with regard to Job, and we often think about Job and of course the many trials in which he endured, and certainly he endured many trials. But you understand that Job's testimony, the Bible tells us in verse number 12 of Job 23, that he says, I have esteemed the words of His mouth more than my necessary food. You see, Ezra, the Bible tells us that he had prepared his heart to seek the law of the Lord. Let me tell you, it's important for us to purpose in our heart and to prepare to seek the law of the Lord. I often have said during the Joshua lessons and going through this series of how grateful I am that God's giving the instruction that He's giving. to Joshua and we've spoken about the strategy at Jericho and then the strategy at Ai and how God was faithful to give the direction and the instruction and oh how we can rejoice in that but the reality is that we need to then do it. Notice as we continue through this verse Ezra 7 and verse number 10 the Bible says he prepared for Ezra had prepared his heart to seek the law of the Lord notice these next words and to do it and to do it see the reality is that we have James he didn't have James 1 we have James 1 that tells us that were to be doers of the word and not hearers only and we understand that as Ezra the Bible is giving to us this perspective in this preparation of this man that was referred to as being a ready scribe by the wall by the way in the law of Moses it says here in verse number six and we find that he was a ready scribe he had prepared his heart to seek the law of the Lord and to do it he didn't just desire to have a level of head knowledge he wanted to obey it he understood that there was a level of profitability in the law of the Lord and that it was given so that it would be followed see it's not about how many Bible quizzes we can win it's not about how many you know we can play Bible trivia games and then we can have all of the answers and we can list out all of the whatever it's good to have that knowledge but we need to be doers of the word and not hearers only see Ezra desired to know the law of the Lord he had sought the law of the Lord but it says specifically and to do it remember Joshua 1 I spent really an entire lesson on this truth in verse number 8 and when the Bible says where the Lord is speaking to Joshua this book of the law shall not depart out of thy mouth but thou shalt meditate therein how often day and night it says this that thou mayest observe to do according to all that is written therein by the way we'll read the rest of the verse here in just a moment but the book that God was speaking of when he spoke to Joshua this wonderful principle was the law of Moses the Pentateuch as we often refer to it as Genesis Exodus Leviticus Numbers and Deuteronomy that book as it would be referred to he says this book of the law the law of Moses he says that not only are to meditate there in day and night but that thou mayest observe to do according to all that is written therein notice for then thou shalt make thy way prosperous and then thou shalt have good success can I tell you that we want the then we want the result right we want to have our way prosperous we want to have good success but we find that we must be doers of the word and not hearers only perhaps Ezra had some knowledge of Joshua 1 in verse number 8 perhaps he had read as he had portions of scripture available to him perhaps he understood this principle that God had given to Joshua perhaps Psalm 19 in verse number 11 I referenced already the 19th Psalm in our first point where the Bible speaks about the law of the Lord is perfect converting the soul and so on and so forth and we sometimes sing this particular scripture song and Psalm 19 verses 7 through 11 but we find that it's in verse number 11 that as the psalmist has given the truth with regard to the the the Word of God and the statutes of the Lord and so on and so forth he says this moreover verse 11 of Psalm 19 by them is thy servant warned and in keeping of them there is great reward you know if you were to read Psalm 119 and you to read through all of those verses and study the entirety of that passage of Scripture you will find that there are many references within these verses of Scripture of keeping the law obeying doing walking in and we find that all of those things point to that simple phrase that it says of Ezra to do it see when we approach God's Word on a daily basis when we are have prepared our heart to seek the law of the Lord the the truth of the matter is that we ought to be in that place where we say Lord help me to be a doer of the Word and not a hearer only in fact it would be advantageous for us as we go to the Scriptures on a daily basis and whether you read one chapter or a hundred chapters as you go to the Word of God on a daily basis that you would ask God to show you what is it that you're teaching me what is it that I need to do what is there in this passage of Scripture that I'm reading today as I'm seeking the truth that you've given me Lord in your Word what is it that I need to do see the Bible says that Ezra had prepared his heart to seek the law of the Lord and to do it notice the end of Ezra 7 in verse number 10 the Bible says this and to teach in Israel statutes and judgments I like that see the reality is that as we look at the life of Ezra here and we look at what God is telling us about this ready scribe about this one that had prepared his heart to seek the law of the Lord and to do it but he also had this desire and to teach in Israel statutes and judgments I believe that Ezra had an understanding that the truth that was contained within the pages of Scripture was not only profitable for himself but it was profitable for others this was something that that Ezra had a desire I want to be able to teach these statutes in these judgments to others it's interesting to know that before the opportunity was ever presented that Ezra had already prepared I think that's important see it was not that Ezra was given the job go teach and then all of a sudden he decided that he better go prepare he'd already prepared his heart he'd already prepared to be able to get into the law the Lord himself and to do it himself and then to teach in Israel statutes and judgments as we think about that desire of Ezra as it's revealed to us here in verse number 10 of this chapter we find that the Bible would tell us in verse number 25 of Ezra 7 if you skip down there the Bible says and thou Ezra after the wisdom of thy God that is in thine hand set magistrates and judges which may judge all the people that are beyond the river all such as know the laws of thy God notice this last phrase and teach ye them that know them not I'm glad that Ezra prepared I'm glad that he sought the Lord and sought the law of the Lord and that he was a doer of the word and not a hearer only and that he desired to be able to teach in Israel these statutes and judgments and we find that the opportunity had been granted to him and he's told and to teach ye them that know them not teaching is exciting I know that not everyone has the gift of teaching and I understand that we've all been gifted by the Lord in a different manner but the reality is that we have opportunities even as I spoke of this morning to share the truth of the Word of God with those that we've come into contact with and that we'd be prepared that we'd be ready we're gonna look at a truth in Nehemiah chapter number 8 and before I get there you can turn over to Nehemiah chapter number 8 and we'll look at that passage of Scripture here in just a moment but the reality is that God teaches us in his Word that were to listen to this in first Peter 3 in verse 15 but sanctify the Lord God in your hearts and be ready always to give an answer to every man that asketh you a reason of the hope that is in you with meekness and fear be ready to give an answer Ezra he saw the Lord he saw the law of the Lord he prepared his heart to seek the law of the Lord and to do it and to teach in Israel statutes and judgments turn to Nehemiah 8 you might be there already as I mentioned a moment ago but notice in verse number 1 the Bible says this and all the people gathered themselves together as one man into the street that was before the water gate and they spake unto Ezra the scribe to bring the book of the law of Moses which the Lord had commanded to Israel now remember the Bible told us back in Ezra chapter 7 in verse number 6 that he was a ready scribe in the law of Moses the Bible told us in verse number 10 that Ezra had prepared his heart to seek the law of the Lord and to do it and to teach in Israel statutes and judgments and so the Bible tells us that the people gathered themselves together I hope in your mind's eye you can see this gathering in Nehemiah chapter number 8 and the Bible tells us that they spake unto Ezra and they said to Ezra who was the scribe they said bring the book of the law of Moses and which the Lord had commanded to Israel notice in verse 2 and Ezra the priest brought the law before the congregation both of men and women and all that could hear with understanding upon the first day of the seventh month. And he read therein before the street that was before the water gate from the morning until midday. He thought I preached long. Come on. It says before the men and the women and those that could understand and the ears of all the people were attentive under the book of the law. They had an approach to hearing the law of the Lord, to hearing the Word of God. The Bible tells us that they were attentive. The Bible says in verse number four, and Ezra the scribe stood upon a pulpit of wood which they had made for the purpose. And beside him stood Mattathiah and Shema and Ananiah and Uriah and Hilkiah, Massiah on his right hand. On his left hand, Paddai and Mishael and Malkiah and Hashem and Hashabadana, Zechariah and Meshulam. I'm glad we don't have names like that today. Amen. And Ezra, notice verse 5, opened the book in the sight of all the people. For he was above all the people. When he opened it, all the people stood up. You think about the significance of what's happening and you think about the preparation of Ezra that we looked at in Ezra 7. And we find that the people stand up in reverence for the Word of God for that which they're going to hear. The Bible says that Ezra blessed the Lord, the great God, and all the people answered, amen, amen. With lifting up their hands, they bowed their heads and worshiped the Lord with their faces to the ground. The Bible says also Joshua and Bani and Sherabiah, Jamin, Aqab, Shabbathiah, Horaijah, Messiah, Kelita, Azariah, Josabath, Hanan, Peliah, and the Levites, notice this, caused the people to understand the law and the people stood in their place. In verse number 8, the Bible says, so they read in the book in the law of God distinctly and gave the sense and caused them to understand the reading. I believe that verse number 8 of Nehemiah, chapter number 8, is a great model for preaching. Preaching is only preaching if we're using the book, the Word of God. You don't need my opinions or anyone else's opinions, we need the Word of God. The Bible says that they read in the book in the law of God distinctly. The Bible is the the resource that we go to and we know that it's what we need and God's given it to us, but then notice this, and gave the sense, an explanation, an exposition, then it says this, and caused them to understand the reading. And what a joy these people as they gathered together and we see all that is happening and we understand this great opportunity and perhaps there are times in which we see Ezra the scribe that he's at this place and he's doing the work that we find here in Nehemiah chapter number 8 and we think about how wonderful this is and indeed it's wonderful. There was some preparation. There were some insights that God gave us to the character of this man Ezra back in Ezra chapter number 7. Notice in verse number 12, and all the people went their way to eat and to drink and to send portions and to make great mirth because they had understood the words that were declared unto them. Isn't it a wonderful thing when you understand the Word of God? There are times in which you might wrestle over a portion of Scripture in your own personal walk with the Lord. You're studying the Word of God and you're reading it and you're, Lord I don't understand this and Lord teach me and we can rejoice in the fact that we have the Holy Spirit who's our teacher. And we see that these people left and they understood the words that were declared unto them and on the second day verse 13, were gathered together the chief of the fathers of all the people, the priests and the Levites. Notice this, unto Ezra the scribe, even to understand the words of the law. Notice who was gathered to him according to verse number 13 on the second day. It says that they were gathered to him, the chief of the fathers of all the people, the priests and the Levites. And so now Ezra has this opportunity to give truth, to give instruction to this group of people that would gather here on this particular day. I love reading about the ministry and the opportunity that Ezra had and I just wonder today in our lives as we think about this Old Testament Bible character Ezra and we say man that's wonderful that Ezra, a ready scribe, Ezra a man that had prepared his heart to seek the law of the Lord and to do it and to teach in Israel statutes and judgments. Can I tell you that the opportunity came and Ezra was ready. Can you imagine the the way that the text of Scripture would read in Nehemiah 8 in verse number 1 when they spake unto Ezra and said bring the book of the law of Moses and come teach us and he's like ah give me some time. It just doesn't work right he had already prepared he was ready. Notice what the Bible tells us in Romans chapter number 1. I want to look at the example here briefly in conclusion this evening of the testimony of the Apostle Paul. There are three statements that he makes in Romans chapter number 1 verse 14, 15 and 16. I won't cover all of that and deal with it's really a message in of itself but I just want to look at what he says in verse number 15 and I want to think about the way in which the Bible tells us of Ezra that he was a ready scribe and how he did prepared his heart but we find here in Romans 1 in verse number 15 the Bible says this that Paul is speaking to these believers that he's writing to and he says this so as much as in me is I am ready to preach the gospel to you that are at Rome also. And I think about that Paul making that declaration he was ready to go and to preach in Rome the gospel and I am mindful of the way in which the Apostle Paul entered into his first missionary journey when he went into the region of Galatia and the Bible tells us that they came to Antioch and Pisidia it's recorded in Acts 13 and as they would go to the synagogue in that city the Bible says that those that were gathered said to Paul they said do you have any word of exhortation you know what Paul did he stood up and he preached you can read the message in Acts 13 we don't have anywhere near the amount of time to go through all of the message but we find that what Paul did is he began all the way back in the Old Testament he began preaching and teaching how that these Old Testament prophecies were pointing to Messiah that this Jesus is the Christ he is the Messiah and we find that the opportunity presented himself to him and he was ready he stood up and he preached what a great message he preached a powerful message we find that there were some of course that returned and that responded excuse me and received the Lord Jesus Christ as our personal Savior and for that we can certainly rejoice this evening we think of Ezra I wonder from this Old Testament character many many many years ago we see that after the remnant returned to Jerusalem that Ezra had the opportunity to go as well and the Bible tells us that Ezra was a ready scribe and he had prepared his heart to seek the law the Lord and to do it and to teach in Israel statutes and judgments I wonder are we seeking or have we prepared our heart to seek the law of the Lord really getting into the Bible allowing the Bible to get into us we're understanding the importance of this book and not just to have some level of knowledge to speak about it but to do it he was seeking the law the Lord and to do it and then to teach in Israel statutes and judgments you know there's somebody that you that God might have in your life that you would have the opportunity to teach some of the things of the Word of God might not be in a public setting it might not be in a as a profession quote-unquote but there might be some opportunities that we have to to give an answer to a man of the hope that lieth within us to teach them to give them the gospel what a great opportunity that is and how we need to be ready ready servants ready to do the work of the Lord when when the opportunity would come that we would not miss the opportunity because of we because of the fact that we failed to prepare but that we would prepare even now so that when the opportunity would present itself we'd be ready father we love you and we thank you for loving us we thank you for thy word we thank you for the truth of thy word and we thank you for the life and ministry of Ezra we thank you for the opportunity to read of that which you allowed him to do in the book of Nehemiah and the teaching of the law of the Lord and what a great testimony we thank you that this was a man that was not only a student of the word but a doer of the word Lord we thank you for the example and we pray that you would help us as your servants today to seek the law of the Lord to seek to understand thy word to daily dig into the word of God and to allow Your Word to impact us and affect us and change us. I pray, God, that we'd be doers of the Word and not hearers only. We do pray that You would give us opportunities to teach, not necessarily in a public setting, but Lord, to be able to give some truth to those that we come into contact with from Your Word. What a great blessing and privilege that is. We pray, God, that You'd work in our hearts and lives, even as we look at the example of Ezra, and seek to follow that wonderful pattern that was set forth, that we too would be ready. For it's in Christ's name we pray, Amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 5.920000076293945,
      "text": " Ezra chapter number seven, and as we get into the message this evening, of course, we're"
    },
    {
      "id": 1,
      "start": 5.920000076293945,
      "end": 12.5,
      "text": " not doing a series through the book of Ezra or even a character study on the life of Ezra."
    },
    {
      "id": 2,
      "start": 12.5,
      "end": 16.719999313354492,
      "text": " But Ezra chapter number seven, we'll look at these 10 verses."
    },
    {
      "id": 3,
      "start": 16.719999313354492,
      "end": 23.0,
      "text": " I enjoy the opportunity to study lives of those that have gone before us."
    },
    {
      "id": 4,
      "start": 23.0,
      "end": 27.639999389648438,
      "text": " It's exciting to study Bible characters, to go through the word of God and to see men"
    },
    {
      "id": 5,
      "start": 27.639999389648438,
      "end": 31.959999084472656,
      "text": " and women that were used of the Lord to accomplish great things."
    },
    {
      "id": 6,
      "start": 31.959999084472656,
      "end": 37.119998931884766,
      "text": " It's a joy and privilege to have the opportunity to read and study about those that have gone"
    },
    {
      "id": 7,
      "start": 37.119998931884766,
      "end": 45.41999816894531,
      "text": " before us that aren't necessarily Bible characters, but people that God used throughout the centuries."
    },
    {
      "id": 8,
      "start": 45.41999816894531,
      "end": 50.36000061035156,
      "text": " Often I reference several of those individuals and how God used them and what a blessing"
    },
    {
      "id": 9,
      "start": 50.36000061035156,
      "end": 52.31999969482422,
      "text": " that is."
    },
    {
      "id": 10,
      "start": 52.31999969482422,
      "end": 55.400001525878906,
      "text": " Oftentimes as we study the lives of those that have gone before us, whether they're"
    },
    {
      "id": 11,
      "start": 55.400001525878906,
      "end": 62.68000030517578,
      "text": " Bible character or not, we readily understand that they were people just like we're people."
    },
    {
      "id": 12,
      "start": 62.68000030517578,
      "end": 66.87999725341797,
      "text": " That they live life day by day, just like we live life day by day."
    },
    {
      "id": 13,
      "start": 66.87999725341797,
      "end": 73.87999725341797,
      "text": " That they encountered difficulties and opposition and challenges, that they experienced victory,"
    },
    {
      "id": 14,
      "start": 73.87999725341797,
      "end": 80.5199966430664,
      "text": " they experienced just mighty things that God would do in and through their lives."
    },
    {
      "id": 15,
      "start": 80.5199966430664,
      "end": 86.36000061035156,
      "text": " We find that often as we study the lives of those that have gone before us, that there"
    },
    {
      "id": 16,
      "start": 86.36000061035156,
      "end": 90.95999908447266,
      "text": " are times in which we see the victory that they experienced."
    },
    {
      "id": 17,
      "start": 90.95999908447266,
      "end": 96.76000213623047,
      "text": " We see some great work that they were able to be involved in, something that God did"
    },
    {
      "id": 18,
      "start": 96.76000213623047,
      "end": 103.76000213623047,
      "text": " in and through their lives, and maybe we don't have the knowledge of maybe some preparation,"
    },
    {
      "id": 19,
      "start": 103.76000213623047,
      "end": 105.68000030517578,
      "text": " of maybe some of the early days."
    },
    {
      "id": 20,
      "start": 105.83999633789062,
      "end": 111.80000305175781,
      "text": " I often think of David, and of course 1 Samuel chapter 17, many times if you ask somebody"
    },
    {
      "id": 21,
      "start": 111.80000305175781,
      "end": 117.55999755859375,
      "text": " about David, King David, you ask him about one of the greatest events, no doubt within"
    },
    {
      "id": 22,
      "start": 117.55999755859375,
      "end": 122.83999633789062,
      "text": " just a small group of people, someone will speak about David and Goliath."
    },
    {
      "id": 23,
      "start": 122.83999633789062,
      "end": 129.0,
      "text": " It's a very well known Bible account and what a great victory that was wrought on that day"
    },
    {
      "id": 24,
      "start": 129.0,
      "end": 134.8000030517578,
      "text": " as it's recorded in 1 Samuel 17, but we understand that there was some preparation that took"
    },
    {
      "id": 25,
      "start": 134.8000030517578,
      "end": 142.83999633789062,
      "text": " place in the life of David prior to him ever encountering Goliath in that valley."
    },
    {
      "id": 26,
      "start": 142.83999633789062,
      "end": 146.16000366210938,
      "text": " It's exciting to study about the preparation."
    },
    {
      "id": 27,
      "start": 146.16000366210938,
      "end": 154.0399932861328,
      "text": " It's exciting, I preached a message once many years ago on training to slay giants, and"
    },
    {
      "id": 28,
      "start": 154.0399932861328,
      "end": 160.0800018310547,
      "text": " just the training that David, the experiences and all that God did in and through him, and"
    },
    {
      "id": 29,
      "start": 160.0800018310547,
      "end": 161.0800018310547,
      "text": " what a joy that is."
    },
    {
      "id": 30,
      "start": 161.24000549316406,
      "end": 167.55999755859375,
      "text": " When you think about Ezra, oftentimes some may think about Ezra and you think about him"
    },
    {
      "id": 31,
      "start": 167.55999755859375,
      "end": 174.52000427246094,
      "text": " standing upon that pulpit of wood and teaching the people of God the Word of God, and what"
    },
    {
      "id": 32,
      "start": 174.52000427246094,
      "end": 181.1199951171875,
      "text": " a wonderful account, Nehemiah chapter 8 records that for us, and I mean just an exciting passage"
    },
    {
      "id": 33,
      "start": 181.1199951171875,
      "end": 190.0399932861328,
      "text": " of Scripture, but well before he experienced that opportunity, we find that the Bible gives"
    },
    {
      "id": 34,
      "start": 190.0399932861328,
      "end": 193.47999572753906,
      "text": " us some insight into this man, Ezra."
    },
    {
      "id": 35,
      "start": 193.47999572753906,
      "end": 199.67999267578125,
      "text": " If you're taking notes, I've titled the message simply this, Ezra, a ready scribe."
    },
    {
      "id": 36,
      "start": 199.67999267578125,
      "end": 202.36000061035156,
      "text": " Ezra, a ready scribe."
    },
    {
      "id": 37,
      "start": 202.36000061035156,
      "end": 206.24000549316406,
      "text": " The Bible says in Ezra 7, in verse number 1, now after these things, in the reign of"
    },
    {
      "id": 38,
      "start": 206.24000549316406,
      "end": 210.9600067138672,
      "text": " Artaxerxes, king of Persia, Ezra, the son of Sariah, the son of Azariah, the son of"
    },
    {
      "id": 39,
      "start": 210.9600067138672,
      "end": 215.8000030517578,
      "text": " Hilkiah, the son of Shalom, the son of Zadok, the son of Ahitab, the son of Amoriah, the"
    },
    {
      "id": 40,
      "start": 215.8000030517578,
      "end": 221.0,
      "text": " son of Azariah, the son of Merioth, the son of Zerahiah, the son of Uzziah, the son of"
    },
    {
      "id": 41,
      "start": 221.0,
      "end": 226.16000366210938,
      "text": " Bukkiah, the son of Abishua, the son of Phinehas, the son of Eleazar, the son of Aaron, the"
    },
    {
      "id": 42,
      "start": 226.16000366210938,
      "end": 227.66000366210938,
      "text": " chief priest."
    },
    {
      "id": 43,
      "start": 227.66000366210938,
      "end": 235.52000427246094,
      "text": " This Ezra, notice in verse number 6, went up from Babylon and he was a ready scribe"
    },
    {
      "id": 44,
      "start": 235.52000427246094,
      "end": 241.8800048828125,
      "text": " in the law of Moses, which the Lord God of Israel had given, and the king granted him"
    },
    {
      "id": 45,
      "start": 241.8800048828125,
      "end": 248.75999450683594,
      "text": " all his requests according to the hand of the Lord his God upon him."
    },
    {
      "id": 46,
      "start": 248.75999450683594,
      "end": 252.72000122070312,
      "text": " Verse number 7, and there went up some of the children of Israel, and of the priests"
    },
    {
      "id": 47,
      "start": 252.72000122070312,
      "end": 257.760009765625,
      "text": " and the Levites and the singers and the porters and the Nethanims unto Jerusalem in the seventh"
    },
    {
      "id": 48,
      "start": 257.760009765625,
      "end": 260.1199951171875,
      "text": " year of Artaxerxes the king."
    },
    {
      "id": 49,
      "start": 260.1199951171875,
      "end": 265.6000061035156,
      "text": " And he came to Jerusalem in the fifth month, which was in the seventh year of the king."
    },
    {
      "id": 50,
      "start": 265.6000061035156,
      "end": 270.8399963378906,
      "text": " For upon the first day of the first month began he to go up from Babylon, and on the"
    },
    {
      "id": 51,
      "start": 270.8399963378906,
      "end": 277.6400146484375,
      "text": " first day of the fifth month came he to Jerusalem according to the good hand of his God upon"
    },
    {
      "id": 52,
      "start": 277.6400146484375,
      "end": 278.6400146484375,
      "text": " him."
    },
    {
      "id": 53,
      "start": 278.6400146484375,
      "end": 280.6400146484375,
      "text": " Now notice verse number 10."
    },
    {
      "id": 54,
      "start": 280.6400146484375,
      "end": 287.9599914550781,
      "text": " The Bible says this, for Ezra had prepared his heart to seek the law of the Lord and"
    },
    {
      "id": 55,
      "start": 287.9599914550781,
      "end": 294.79998779296875,
      "text": " to do it and to teach in Israel statutes and judgments."
    },
    {
      "id": 56,
      "start": 294.79998779296875,
      "end": 299.32000732421875,
      "text": " Notice the Bible gives us some insight here to the man Ezra."
    },
    {
      "id": 57,
      "start": 299.32000732421875,
      "end": 305.67999267578125,
      "text": " His genealogy is described in verses 1 through 5, and we find that it's traced back to Aaron"
    },
    {
      "id": 58,
      "start": 305.67999267578125,
      "end": 313.1600036621094,
      "text": " the chief priest, and we find that he is giving us here in this passage of Scripture his genealogy,"
    },
    {
      "id": 59,
      "start": 313.1600036621094,
      "end": 316.3999938964844,
      "text": " and certainly that's important for us to understand."
    },
    {
      "id": 60,
      "start": 316.3999938964844,
      "end": 321.3999938964844,
      "text": " And we begin to get into verses 6 through 9, and we begin to understand kind of some"
    },
    {
      "id": 61,
      "start": 321.3999938964844,
      "end": 326.7200012207031,
      "text": " of the circumstances in which Ezra was serving the Lord, and we understand that the book"
    },
    {
      "id": 62,
      "start": 326.7200012207031,
      "end": 331.8399963378906,
      "text": " of Ezra is capturing for us the promised return of the remnant."
    },
    {
      "id": 63,
      "start": 331.8399963378906,
      "end": 338.79998779296875,
      "text": " You'll remember that Jeremiah had been prophesying prior to the Babylonian captivity, and during"
    },
    {
      "id": 64,
      "start": 338.79998779296875,
      "end": 345.67999267578125,
      "text": " his time of prophecy we find that often throughout the prophecy you would find this truth of"
    },
    {
      "id": 65,
      "start": 345.67999267578125,
      "end": 348.82000732421875,
      "text": " the remnant returning after 70 years."
    },
    {
      "id": 66,
      "start": 348.82000732421875,
      "end": 355.9599914550781,
      "text": " And we find that in the book of Ezra that God is providing us with that decree of Cyrus"
    },
    {
      "id": 67,
      "start": 355.9599914550781,
      "end": 360.55999755859375,
      "text": " that would allow for those people of God, the children of Israel that had been in Babylonian"
    },
    {
      "id": 68,
      "start": 360.55999755859375,
      "end": 364.3999938964844,
      "text": " captivity to return back to Jerusalem."
    },
    {
      "id": 69,
      "start": 364.3999938964844,
      "end": 369.0400085449219,
      "text": " And so we find that there was a number of years that passed between the events in chapters"
    },
    {
      "id": 70,
      "start": 369.0400085449219,
      "end": 375.2799987792969,
      "text": " 1 through 6, and here where we find in chapter number 7 when Ezra is now returning, it says"
    },
    {
      "id": 71,
      "start": 375.2799987792969,
      "end": 381.239990234375,
      "text": " in verse 8 that he came to Jerusalem in the fifth month, and you find that God's hand"
    },
    {
      "id": 72,
      "start": 381.239990234375,
      "end": 385.4599914550781,
      "text": " was upon him, the good hand of his God upon him."
    },
    {
      "id": 73,
      "start": 385.4599914550781,
      "end": 390.3399963378906,
      "text": " We see that in verse number 6, and again in verse number 9, and so we find that the"
    },
    {
      "id": 74,
      "start": 390.3399963378906,
      "end": 397.3800048828125,
      "text": " Bible gives us some understanding of his genealogy, of the circumstances, his arrival there into"
    },
    {
      "id": 75,
      "start": 397.3800048828125,
      "end": 403.94000244140625,
      "text": " Jerusalem, but I want you to focus upon verse number 10, and I'm simply going to break the"
    },
    {
      "id": 76,
      "start": 403.94000244140625,
      "end": 409.5799865722656,
      "text": " verse down and deal with it in individual statements, and trust that it would be a blessing"
    },
    {
      "id": 77,
      "start": 409.5799865722656,
      "end": 410.94000244140625,
      "text": " to you this evening."
    },
    {
      "id": 78,
      "start": 410.94000244140625,
      "end": 417.2200012207031,
      "text": " It says, first of all, that he had prepared his heart to seek the law of the Lord."
    },
    {
      "id": 79,
      "start": 417.2200012207031,
      "end": 418.9800109863281,
      "text": " That's a good thing, amen?"
    },
    {
      "id": 80,
      "start": 418.9800109863281,
      "end": 423.4200134277344,
      "text": " He had prepared his heart to seek the law of the Lord."
    },
    {
      "id": 81,
      "start": 423.4200134277344,
      "end": 429.17999267578125,
      "text": " I believe that Ezra had an understanding of the preciousness of God's Word."
    },
    {
      "id": 82,
      "start": 429.17999267578125,
      "end": 431.9800109863281,
      "text": " We often speak about how precious this book is."
    },
    {
      "id": 83,
      "start": 431.9800109863281,
      "end": 439.6600036621094,
      "text": " We often hear you hear me say that this book is powerful and that it's precious, it's preserved,"
    },
    {
      "id": 84,
      "start": 439.6600036621094,
      "end": 444.7799987792969,
      "text": " it's perfect, and it's profitable, and we could speak about how wonderful the Word of"
    },
    {
      "id": 85,
      "start": 444.7799987792969,
      "end": 448.8599853515625,
      "text": " God is, and on a daily basis, I thank God for His Word."
    },
    {
      "id": 86,
      "start": 448.8599853515625,
      "end": 456.0199890136719,
      "text": " I thank God for the opportunity as a believer to have the Word of God in my language, that"
    },
    {
      "id": 87,
      "start": 456.0199890136719,
      "end": 461.5799865722656,
      "text": " I can go to it and I can read it, that I can seek the law of the Lord."
    },
    {
      "id": 88,
      "start": 461.5799865722656,
      "end": 468.1000061035156,
      "text": " We find that Ezra must have had an understanding of the preciousness of the Word of God, for"
    },
    {
      "id": 89,
      "start": 468.5799865722656,
      "end": 476.0199890136719,
      "text": " God tells us in giving us the description of this man's preparation, that he was a ready"
    },
    {
      "id": 90,
      "start": 476.0199890136719,
      "end": 477.0199890136719,
      "text": " scribe."
    },
    {
      "id": 91,
      "start": 477.0199890136719,
      "end": 482.8999938964844,
      "text": " The Bible tells us that he had prepared his heart to seek the law of the Lord."
    },
    {
      "id": 92,
      "start": 482.8999938964844,
      "end": 488.5,
      "text": " I wonder, perhaps Ezra had some level of knowledge."
    },
    {
      "id": 93,
      "start": 488.5,
      "end": 492.260009765625,
      "text": " Maybe he was familiar with Psalm 19."
    },
    {
      "id": 94,
      "start": 492.260009765625,
      "end": 495.6400146484375,
      "text": " Maybe he was familiar with Psalm 119."
    },
    {
      "id": 95,
      "start": 495.67999267578125,
      "end": 500.760009765625,
      "text": " We studied Psalm 119 in our adult Sunday school class last year, and we went stanza by stanza"
    },
    {
      "id": 96,
      "start": 500.760009765625,
      "end": 507.7200012207031,
      "text": " through that entire Psalm, and how the Psalm reminds us of the preciousness and the importance"
    },
    {
      "id": 97,
      "start": 507.7200012207031,
      "end": 509.32000732421875,
      "text": " of the Word of God."
    },
    {
      "id": 98,
      "start": 509.32000732421875,
      "end": 514.5599975585938,
      "text": " We find that David, of course, in Psalm 19, the law of the Lord is perfect, and we can"
    },
    {
      "id": 99,
      "start": 514.5599975585938,
      "end": 521.4000244140625,
      "text": " go through those verses and we can see the importance that God has placed, the priority"
    },
    {
      "id": 100,
      "start": 521.4000244140625,
      "end": 522.4000244140625,
      "text": " upon His Word."
    },
    {
      "id": 101,
      "start": 522.4000244140625,
      "end": 529.6400146484375,
      "text": " And I believe that Ezra had some knowledge, some level of knowledge with regard to the"
    },
    {
      "id": 102,
      "start": 529.6400146484375,
      "end": 534.0399780273438,
      "text": " truth of these principles in these verses."
    },
    {
      "id": 103,
      "start": 534.0399780273438,
      "end": 539.760009765625,
      "text": " Perhaps Ezra was aware of the principle that we find in Proverbs 30, in verse number 5,"
    },
    {
      "id": 104,
      "start": 539.760009765625,
      "end": 540.760009765625,
      "text": " where the Bible says,"
    },
    {
      "id": 105,
      "start": 540.760009765625,
      "end": 547.3200073242188,
      "text": " Every word of God is pure, He is a shield unto them that put their trust in Him."
    },
    {
      "id": 106,
      "start": 547.3200073242188,
      "end": 554.7999877929688,
      "text": " Maybe Ezra had some level of knowledge with regard to Job, and we often think about Job"
    },
    {
      "id": 107,
      "start": 554.7999877929688,
      "end": 560.4000244140625,
      "text": " and of course the many trials in which he endured, and certainly he endured many trials."
    },
    {
      "id": 108,
      "start": 560.4000244140625,
      "end": 566.760009765625,
      "text": " But you understand that Job's testimony, the Bible tells us in verse number 12 of Job 23,"
    },
    {
      "id": 109,
      "start": 566.760009765625,
      "end": 567.760009765625,
      "text": " that he says,"
    },
    {
      "id": 110,
      "start": 567.760009765625,
      "end": 573.1599731445312,
      "text": " I have esteemed the words of His mouth more than my necessary food."
    },
    {
      "id": 111,
      "start": 573.2000122070312,
      "end": 579.8800048828125,
      "text": " You see, Ezra, the Bible tells us that he had prepared his heart to seek the law of"
    },
    {
      "id": 112,
      "start": 579.8800048828125,
      "end": 580.8800048828125,
      "text": " the Lord."
    },
    {
      "id": 113,
      "start": 580.8800048828125,
      "end": 587.239990234375,
      "text": " Let me tell you, it's important for us to purpose in our heart and to prepare to seek"
    },
    {
      "id": 114,
      "start": 587.239990234375,
      "end": 589.2000122070312,
      "text": " the law of the Lord."
    },
    {
      "id": 115,
      "start": 589.2000122070312,
      "end": 596.1599731445312,
      "text": " I often have said during the Joshua lessons and going through this series of how grateful"
    },
    {
      "id": 116,
      "start": 596.1599731445312,
      "end": 599.6400146484375,
      "text": " I am that God's giving the instruction that He's giving."
    },
    {
      "id": 0,
      "start": 599.6400146484375,
      "end": 603.8800144195557,
      "text": " to Joshua and we've spoken about the strategy at Jericho and then the"
    },
    {
      "id": 1,
      "start": 603.8800144195557,
      "end": 608.7200145721436,
      "text": " strategy at Ai and how God was faithful to give the direction and the"
    },
    {
      "id": 2,
      "start": 608.7200145721436,
      "end": 614.2200145721436,
      "text": " instruction and oh how we can rejoice in that but the reality is that we need to"
    },
    {
      "id": 3,
      "start": 614.2200145721436,
      "end": 620.920015335083,
      "text": " then do it. Notice as we continue through this verse Ezra 7 and verse number 10"
    },
    {
      "id": 4,
      "start": 620.920015335083,
      "end": 625.6400146484375,
      "text": " the Bible says he prepared for Ezra had prepared his heart to seek the law of"
    },
    {
      "id": 5,
      "start": 625.6400146484375,
      "end": 634.2400131225586,
      "text": " the Lord notice these next words and to do it and to do it see the reality is"
    },
    {
      "id": 6,
      "start": 634.2400131225586,
      "end": 639.2800140380859,
      "text": " that we have James he didn't have James 1 we have James 1 that tells us that"
    },
    {
      "id": 7,
      "start": 639.2800140380859,
      "end": 644.2000160217285,
      "text": " were to be doers of the word and not hearers only and we understand that as"
    },
    {
      "id": 8,
      "start": 644.2000160217285,
      "end": 648.8800163269043,
      "text": " Ezra the Bible is giving to us this perspective in this preparation of this"
    },
    {
      "id": 9,
      "start": 648.8800163269043,
      "end": 655.0800132751465,
      "text": " man that was referred to as being a ready scribe by the wall by the way in"
    },
    {
      "id": 10,
      "start": 655.0800132751465,
      "end": 659.0800132751465,
      "text": " the law of Moses it says here in verse number six and we find that he was a"
    },
    {
      "id": 11,
      "start": 659.0800132751465,
      "end": 663.3200149536133,
      "text": " ready scribe he had prepared his heart to seek the law of the Lord and to do it"
    },
    {
      "id": 12,
      "start": 663.3200149536133,
      "end": 670.1200180053711,
      "text": " he didn't just desire to have a level of head knowledge he wanted to obey it he"
    },
    {
      "id": 13,
      "start": 670.1200180053711,
      "end": 675.1200180053711,
      "text": " understood that there was a level of profitability in the law of the Lord and"
    },
    {
      "id": 14,
      "start": 675.1200180053711,
      "end": 680.6000137329102,
      "text": " that it was given so that it would be followed see it's not about how many"
    },
    {
      "id": 15,
      "start": 680.7600173950195,
      "end": 686.8400115966797,
      "text": " Bible quizzes we can win it's not about how many you know we can play Bible"
    },
    {
      "id": 16,
      "start": 686.8400115966797,
      "end": 691.7600173950195,
      "text": " trivia games and then we can have all of the answers and we can list out all of"
    },
    {
      "id": 17,
      "start": 691.7600173950195,
      "end": 697.2000122070312,
      "text": " the whatever it's good to have that knowledge but we need to be doers of the"
    },
    {
      "id": 18,
      "start": 697.2000122070312,
      "end": 703.2800140380859,
      "text": " word and not hearers only see Ezra desired to know the law of the Lord he"
    },
    {
      "id": 19,
      "start": 703.2800140380859,
      "end": 708.6000137329102,
      "text": " had sought the law of the Lord but it says specifically and to do it remember"
    },
    {
      "id": 20,
      "start": 708.6000137329102,
      "end": 715.3600158691406,
      "text": " Joshua 1 I spent really an entire lesson on this truth in verse number 8"
    },
    {
      "id": 21,
      "start": 715.3600158691406,
      "end": 720.4800109863281,
      "text": " and when the Bible says where the Lord is speaking to Joshua this book of the"
    },
    {
      "id": 22,
      "start": 720.4800109863281,
      "end": 725.9200134277344,
      "text": " law shall not depart out of thy mouth but thou shalt meditate therein how"
    },
    {
      "id": 23,
      "start": 725.9200134277344,
      "end": 733.7200164794922,
      "text": " often day and night it says this that thou mayest observe to do according to"
    },
    {
      "id": 24,
      "start": 733.8000183105469,
      "end": 739.8000183105469,
      "text": " all that is written therein by the way we'll read the rest of the verse here in"
    },
    {
      "id": 25,
      "start": 739.8000183105469,
      "end": 745.0400085449219,
      "text": " just a moment but the book that God was speaking of when he spoke to Joshua this"
    },
    {
      "id": 26,
      "start": 745.0400085449219,
      "end": 750.1200103759766,
      "text": " wonderful principle was the law of Moses the Pentateuch as we often refer to it"
    },
    {
      "id": 27,
      "start": 750.1200103759766,
      "end": 756.1200103759766,
      "text": " as Genesis Exodus Leviticus Numbers and Deuteronomy that book as it would be"
    },
    {
      "id": 28,
      "start": 756.1200103759766,
      "end": 762.1600189208984,
      "text": " referred to he says this book of the law the law of Moses he says that not only"
    },
    {
      "id": 29,
      "start": 762.1600189208984,
      "end": 767.0800170898438,
      "text": " are to meditate there in day and night but that thou mayest observe to do"
    },
    {
      "id": 30,
      "start": 767.0800170898438,
      "end": 774.52001953125,
      "text": " according to all that is written therein notice for then thou shalt make thy way"
    },
    {
      "id": 31,
      "start": 774.52001953125,
      "end": 782.3200073242188,
      "text": " prosperous and then thou shalt have good success can I tell you that we want the"
    },
    {
      "id": 32,
      "start": 782.3200073242188,
      "end": 787.6400146484375,
      "text": " then we want the result right we want to have our way prosperous we want to have"
    },
    {
      "id": 33,
      "start": 787.6400146484375,
      "end": 793.8000183105469,
      "text": " good success but we find that we must be doers of the word and not hearers only"
    },
    {
      "id": 34,
      "start": 793.8000183105469,
      "end": 799.3200073242188,
      "text": " perhaps Ezra had some knowledge of Joshua 1 in verse number 8 perhaps he"
    },
    {
      "id": 35,
      "start": 799.3200073242188,
      "end": 805.1200103759766,
      "text": " had read as he had portions of scripture available to him perhaps he understood"
    },
    {
      "id": 36,
      "start": 805.1200103759766,
      "end": 810.9600219726562,
      "text": " this principle that God had given to Joshua perhaps Psalm 19 in verse number"
    },
    {
      "id": 37,
      "start": 810.9600219726562,
      "end": 815.8400115966797,
      "text": " 11 I referenced already the 19th Psalm in our first point where the Bible"
    },
    {
      "id": 38,
      "start": 815.8400115966797,
      "end": 819.6000213623047,
      "text": " speaks about the law of the Lord is perfect converting the soul and so on"
    },
    {
      "id": 39,
      "start": 819.6000213623047,
      "end": 826.1600189208984,
      "text": " and so forth and we sometimes sing this particular scripture song and Psalm 19"
    },
    {
      "id": 40,
      "start": 826.1600189208984,
      "end": 830.8800201416016,
      "text": " verses 7 through 11 but we find that it's in verse number 11 that as the"
    },
    {
      "id": 41,
      "start": 830.8800201416016,
      "end": 836.6000213623047,
      "text": " psalmist has given the truth with regard to the the the Word of God and the"
    },
    {
      "id": 42,
      "start": 836.6000213623047,
      "end": 841.6400146484375,
      "text": " statutes of the Lord and so on and so forth he says this moreover verse 11 of"
    },
    {
      "id": 43,
      "start": 841.6400146484375,
      "end": 849.5600128173828,
      "text": " Psalm 19 by them is thy servant warned and in keeping of them there is great"
    },
    {
      "id": 44,
      "start": 849.5600128173828,
      "end": 855.2800140380859,
      "text": " reward you know if you were to read Psalm 119 and you to read through all of"
    },
    {
      "id": 45,
      "start": 855.2800140380859,
      "end": 861.1200256347656,
      "text": " those verses and study the entirety of that passage of Scripture you will find"
    },
    {
      "id": 46,
      "start": 861.1200256347656,
      "end": 866.5600280761719,
      "text": " that there are many references within these verses of Scripture of keeping the"
    },
    {
      "id": 47,
      "start": 866.5600280761719,
      "end": 872.9600219726562,
      "text": " law obeying doing walking in and we find that all of those things point to"
    },
    {
      "id": 48,
      "start": 872.9600219726562,
      "end": 880.52001953125,
      "text": " that simple phrase that it says of Ezra to do it see when we approach God's Word"
    },
    {
      "id": 49,
      "start": 880.52001953125,
      "end": 884.760009765625,
      "text": " on a daily basis when we are have prepared our heart to seek the law of"
    },
    {
      "id": 50,
      "start": 884.760009765625,
      "end": 889.0400085449219,
      "text": " the Lord the the truth of the matter is that we ought to be in that place where"
    },
    {
      "id": 51,
      "start": 889.0400085449219,
      "end": 894.5600280761719,
      "text": " we say Lord help me to be a doer of the Word and not a hearer only in fact it"
    },
    {
      "id": 52,
      "start": 894.5600280761719,
      "end": 899.1200256347656,
      "text": " would be advantageous for us as we go to the Scriptures on a daily basis and"
    },
    {
      "id": 53,
      "start": 899.1200256347656,
      "end": 903.1600036621094,
      "text": " whether you read one chapter or a hundred chapters as you go to the Word"
    },
    {
      "id": 54,
      "start": 903.1600036621094,
      "end": 908.280029296875,
      "text": " of God on a daily basis that you would ask God to show you what is it that"
    },
    {
      "id": 55,
      "start": 908.280029296875,
      "end": 914.3200073242188,
      "text": " you're teaching me what is it that I need to do what is there in this passage"
    },
    {
      "id": 56,
      "start": 914.3200073242188,
      "end": 918.7200012207031,
      "text": " of Scripture that I'm reading today as I'm seeking the truth that you've given"
    },
    {
      "id": 57,
      "start": 918.7200012207031,
      "end": 924.6400146484375,
      "text": " me Lord in your Word what is it that I need to do see the Bible says that Ezra"
    },
    {
      "id": 58,
      "start": 924.6400146484375,
      "end": 930.1200256347656,
      "text": " had prepared his heart to seek the law of the Lord and to do it notice the end"
    },
    {
      "id": 59,
      "start": 930.1200256347656,
      "end": 936.760009765625,
      "text": " of Ezra 7 in verse number 10 the Bible says this and to teach in Israel"
    },
    {
      "id": 60,
      "start": 936.760009765625,
      "end": 944.52001953125,
      "text": " statutes and judgments I like that see the reality is that as we look at the"
    },
    {
      "id": 61,
      "start": 944.52001953125,
      "end": 949.3200073242188,
      "text": " life of Ezra here and we look at what God is telling us about this ready"
    },
    {
      "id": 62,
      "start": 949.3200073242188,
      "end": 953.6400146484375,
      "text": " scribe about this one that had prepared his heart to seek the law of the Lord"
    },
    {
      "id": 63,
      "start": 953.6400146484375,
      "end": 958.6000061035156,
      "text": " and to do it but he also had this desire and to teach in Israel statutes and"
    },
    {
      "id": 64,
      "start": 958.6000061035156,
      "end": 963.4800109863281,
      "text": " judgments I believe that Ezra had an understanding that the truth that was"
    },
    {
      "id": 65,
      "start": 963.4800109863281,
      "end": 968.0800170898438,
      "text": " contained within the pages of Scripture was not only profitable for himself but"
    },
    {
      "id": 66,
      "start": 968.0800170898438,
      "end": 973.52001953125,
      "text": " it was profitable for others this was something that that Ezra had a desire I"
    },
    {
      "id": 67,
      "start": 973.52001953125,
      "end": 979.5600280761719,
      "text": " want to be able to teach these statutes in these judgments to others it's"
    },
    {
      "id": 68,
      "start": 979.5600280761719,
      "end": 986.52001953125,
      "text": " interesting to know that before the opportunity was ever presented that"
    },
    {
      "id": 69,
      "start": 986.52001953125,
      "end": 993.0800170898438,
      "text": " Ezra had already prepared I think that's important see it was not that Ezra was"
    },
    {
      "id": 70,
      "start": 993.0800170898438,
      "end": 996.52001953125,
      "text": " given the job go teach and then all of a sudden he decided that he better go"
    },
    {
      "id": 71,
      "start": 996.52001953125,
      "end": 1002.4000244140625,
      "text": " prepare he'd already prepared his heart he'd already prepared to be able to get"
    },
    {
      "id": 72,
      "start": 1002.4000244140625,
      "end": 1008.6400146484375,
      "text": " into the law the Lord himself and to do it himself and then to teach in Israel"
    },
    {
      "id": 73,
      "start": 1008.6400146484375,
      "end": 1013.7200012207031,
      "text": " statutes and judgments as we think about that desire of Ezra as it's revealed to"
    },
    {
      "id": 74,
      "start": 1013.7200012207031,
      "end": 1017.0800170898438,
      "text": " us here in verse number 10 of this chapter we find that the Bible would"
    },
    {
      "id": 75,
      "start": 1017.0800170898438,
      "end": 1022.1600036621094,
      "text": " tell us in verse number 25 of Ezra 7 if you skip down there the Bible says and"
    },
    {
      "id": 76,
      "start": 1022.1600036621094,
      "end": 1028.280029296875,
      "text": " thou Ezra after the wisdom of thy God that is in thine hand set magistrates"
    },
    {
      "id": 77,
      "start": 1028.280029296875,
      "end": 1032.4800109863281,
      "text": " and judges which may judge all the people that are beyond the river all"
    },
    {
      "id": 78,
      "start": 1032.4800109863281,
      "end": 1039.0800170898438,
      "text": " such as know the laws of thy God notice this last phrase and teach ye them that"
    },
    {
      "id": 79,
      "start": 1039.0800170898438,
      "end": 1046.280029296875,
      "text": " know them not I'm glad that Ezra prepared I'm glad that he sought the"
    },
    {
      "id": 80,
      "start": 1046.280029296875,
      "end": 1051.6400146484375,
      "text": " Lord and sought the law of the Lord and that he was a doer of the word and not a"
    },
    {
      "id": 81,
      "start": 1051.6400146484375,
      "end": 1056.2000122070312,
      "text": " hearer only and that he desired to be able to teach in Israel these statutes"
    },
    {
      "id": 82,
      "start": 1056.2000122070312,
      "end": 1060.0,
      "text": " and judgments and we find that the opportunity had been granted to him and"
    },
    {
      "id": 83,
      "start": 1060.0,
      "end": 1067.0800170898438,
      "text": " he's told and to teach ye them that know them not teaching is exciting I know"
    },
    {
      "id": 84,
      "start": 1067.0800170898438,
      "end": 1071.280029296875,
      "text": " that not everyone has the gift of teaching and I understand that we've all"
    },
    {
      "id": 85,
      "start": 1071.280029296875,
      "end": 1076.52001953125,
      "text": " been gifted by the Lord in a different manner but the reality is that we have"
    },
    {
      "id": 86,
      "start": 1076.52001953125,
      "end": 1080.52001953125,
      "text": " opportunities even as I spoke of this morning to share the truth of the Word"
    },
    {
      "id": 87,
      "start": 1080.52001953125,
      "end": 1085.2400207519531,
      "text": " of God with those that we've come into contact with and that we'd be prepared"
    },
    {
      "id": 88,
      "start": 1085.2400207519531,
      "end": 1090.3600158691406,
      "text": " that we'd be ready we're gonna look at a truth in Nehemiah chapter number 8 and"
    },
    {
      "id": 89,
      "start": 1090.3600158691406,
      "end": 1094.760009765625,
      "text": " before I get there you can turn over to Nehemiah chapter number 8 and we'll look"
    },
    {
      "id": 90,
      "start": 1094.760009765625,
      "end": 1098.8400268554688,
      "text": " at that passage of Scripture here in just a moment but the reality is that"
    },
    {
      "id": 91,
      "start": 1098.8400268554688,
      "end": 1104.3600158691406,
      "text": " God teaches us in his Word that were to listen to this in first Peter 3 in verse"
    },
    {
      "id": 92,
      "start": 1104.3600158691406,
      "end": 1110.4000244140625,
      "text": " 15 but sanctify the Lord God in your hearts and be ready always to give an"
    },
    {
      "id": 93,
      "start": 1110.4000244140625,
      "end": 1115.6799926757812,
      "text": " answer to every man that asketh you a reason of the hope that is in you with"
    },
    {
      "id": 94,
      "start": 1115.6799926757812,
      "end": 1123.0400390625,
      "text": " meekness and fear be ready to give an answer Ezra he saw the Lord he saw the"
    },
    {
      "id": 95,
      "start": 1123.0400390625,
      "end": 1127.9600219726562,
      "text": " law of the Lord he prepared his heart to seek the law of the Lord and to do it"
    },
    {
      "id": 96,
      "start": 1127.9600219726562,
      "end": 1133.0800170898438,
      "text": " and to teach in Israel statutes and judgments turn to Nehemiah 8 you might"
    },
    {
      "id": 97,
      "start": 1133.0800170898438,
      "end": 1137.4000244140625,
      "text": " be there already as I mentioned a moment ago but notice in verse number 1 the"
    },
    {
      "id": 98,
      "start": 1137.4000244140625,
      "end": 1141.2000122070312,
      "text": " Bible says this and all the people gathered themselves together as one man"
    },
    {
      "id": 99,
      "start": 1141.2000122070312,
      "end": 1146.1199951171875,
      "text": " into the street that was before the water gate and they spake unto Ezra the"
    },
    {
      "id": 100,
      "start": 1146.1199951171875,
      "end": 1152.4000244140625,
      "text": " scribe to bring the book of the law of Moses which the Lord had commanded to"
    },
    {
      "id": 101,
      "start": 1152.4000244140625,
      "end": 1157.9600219726562,
      "text": " Israel now remember the Bible told us back in Ezra chapter 7 in verse number"
    },
    {
      "id": 102,
      "start": 1157.9600219726562,
      "end": 1163.9600219726562,
      "text": " 6 that he was a ready scribe in the law of Moses the Bible told us in verse"
    },
    {
      "id": 103,
      "start": 1164.0,
      "end": 1167.3599853515625,
      "text": " number 10 that Ezra had prepared his heart to seek the law of the Lord and to"
    },
    {
      "id": 104,
      "start": 1167.3599853515625,
      "end": 1171.3200073242188,
      "text": " do it and to teach in Israel statutes and judgments and so the Bible tells us"
    },
    {
      "id": 105,
      "start": 1171.3200073242188,
      "end": 1175.1199951171875,
      "text": " that the people gathered themselves together I hope in your mind's eye you"
    },
    {
      "id": 106,
      "start": 1175.1199951171875,
      "end": 1179.239990234375,
      "text": " can see this gathering in Nehemiah chapter number 8 and the Bible tells us"
    },
    {
      "id": 107,
      "start": 1179.239990234375,
      "end": 1184.4800415039062,
      "text": " that they spake unto Ezra and they said to Ezra who was the scribe they said"
    },
    {
      "id": 108,
      "start": 1184.4800415039062,
      "end": 1189.9200439453125,
      "text": " bring the book of the law of Moses and which the Lord had commanded to Israel"
    },
    {
      "id": 109,
      "start": 1189.9200439453125,
      "end": 1194.52001953125,
      "text": " notice in verse 2 and Ezra the priest brought the law before the congregation"
    },
    {
      "id": 110,
      "start": 1194.52001953125,
      "end": 1199.2000122070312,
      "text": " both of men and women and all that could hear with understanding upon the first"
    },
    {
      "id": 111,
      "start": 1199.2000122070312,
      "end": 1202.0800170898438,
      "text": " day of the"
    },
    {
      "id": 0,
      "start": 1202.0800170898438,
      "end": 1206.4400172233582,
      "text": " seventh month. And he read therein before the street that was before the water"
    },
    {
      "id": 1,
      "start": 1206.4400172233582,
      "end": 1213.2000169754028,
      "text": " gate from the morning until midday. He thought I preached long. Come on. It says"
    },
    {
      "id": 2,
      "start": 1213.2000169754028,
      "end": 1217.8000173568726,
      "text": " before the men and the women and those that could understand and the ears of"
    },
    {
      "id": 3,
      "start": 1217.8000173568726,
      "end": 1224.8000164031982,
      "text": " all the people were attentive under the book of the law. They had an approach to"
    },
    {
      "id": 4,
      "start": 1224.8000164031982,
      "end": 1229.320016860962,
      "text": " hearing the law of the Lord, to hearing the Word of God. The Bible tells us that"
    },
    {
      "id": 5,
      "start": 1229.320016860962,
      "end": 1233.2400169372559,
      "text": " they were attentive. The Bible says in verse number four, and Ezra the scribe"
    },
    {
      "id": 6,
      "start": 1233.2400169372559,
      "end": 1238.2400169372559,
      "text": " stood upon a pulpit of wood which they had made for the purpose. And beside him"
    },
    {
      "id": 7,
      "start": 1238.2400169372559,
      "end": 1243.7200164794922,
      "text": " stood Mattathiah and Shema and Ananiah and Uriah and Hilkiah, Massiah on his"
    },
    {
      "id": 8,
      "start": 1243.7200164794922,
      "end": 1248.6800155639648,
      "text": " right hand. On his left hand, Paddai and Mishael and Malkiah and Hashem and"
    },
    {
      "id": 9,
      "start": 1248.6800155639648,
      "end": 1254.1600189208984,
      "text": " Hashabadana, Zechariah and Meshulam. I'm glad we don't have names like that"
    },
    {
      "id": 10,
      "start": 1254.1600189208984,
      "end": 1260.3200187683105,
      "text": " today. Amen. And Ezra, notice verse 5, opened the book in the sight of all the"
    },
    {
      "id": 11,
      "start": 1260.3200187683105,
      "end": 1266.4400177001953,
      "text": " people. For he was above all the people. When he opened it, all the people stood"
    },
    {
      "id": 12,
      "start": 1266.4400177001953,
      "end": 1273.6800155639648,
      "text": " up. You think about the significance of what's happening and you think about the"
    },
    {
      "id": 13,
      "start": 1273.6800155639648,
      "end": 1277.9200134277344,
      "text": " preparation of Ezra that we looked at in Ezra 7. And we find that the people"
    },
    {
      "id": 14,
      "start": 1277.9200134277344,
      "end": 1281.4400177001953,
      "text": " stand up in reverence for the Word of God for that which they're going to"
    },
    {
      "id": 15,
      "start": 1281.4400177001953,
      "end": 1285.400016784668,
      "text": " hear. The Bible says that Ezra blessed the Lord, the great God, and all the"
    },
    {
      "id": 16,
      "start": 1285.400016784668,
      "end": 1292.7600173950195,
      "text": " people answered, amen, amen. With lifting up their hands, they bowed their heads"
    },
    {
      "id": 17,
      "start": 1292.7600173950195,
      "end": 1298.5600204467773,
      "text": " and worshiped the Lord with their faces to the ground. The Bible says also"
    },
    {
      "id": 18,
      "start": 1298.5600204467773,
      "end": 1307.2000198364258,
      "text": " Joshua and Bani and Sherabiah, Jamin, Aqab, Shabbathiah, Horaijah, Messiah,"
    },
    {
      "id": 19,
      "start": 1307.2000198364258,
      "end": 1313.5600204467773,
      "text": " Kelita, Azariah, Josabath, Hanan, Peliah, and the Levites, notice this, caused the"
    },
    {
      "id": 20,
      "start": 1313.5600204467773,
      "end": 1319.6000137329102,
      "text": " people to understand the law and the people stood in their place. In verse"
    },
    {
      "id": 21,
      "start": 1319.6000137329102,
      "end": 1326.0800170898438,
      "text": " number 8, the Bible says, so they read in the book in the law of God distinctly"
    },
    {
      "id": 22,
      "start": 1326.0800170898438,
      "end": 1333.9200134277344,
      "text": " and gave the sense and caused them to understand the reading. I believe that"
    },
    {
      "id": 23,
      "start": 1334.040023803711,
      "end": 1339.2400207519531,
      "text": " verse number 8 of Nehemiah, chapter number 8, is a great model for preaching."
    },
    {
      "id": 24,
      "start": 1339.2400207519531,
      "end": 1344.760009765625,
      "text": " Preaching is only preaching if we're using the book, the Word of God. You"
    },
    {
      "id": 25,
      "start": 1344.760009765625,
      "end": 1349.040023803711,
      "text": " don't need my opinions or anyone else's opinions, we need the Word of God. The"
    },
    {
      "id": 26,
      "start": 1349.040023803711,
      "end": 1354.52001953125,
      "text": " Bible says that they read in the book in the law of God distinctly. The Bible is"
    },
    {
      "id": 27,
      "start": 1354.52001953125,
      "end": 1359.8800201416016,
      "text": " the the resource that we go to and we know that it's what we need and God's"
    },
    {
      "id": 28,
      "start": 1359.9600219726562,
      "end": 1364.9200134277344,
      "text": " given it to us, but then notice this, and gave the sense, an explanation, an"
    },
    {
      "id": 29,
      "start": 1364.9200134277344,
      "end": 1372.5600128173828,
      "text": " exposition, then it says this, and caused them to understand the reading. And what"
    },
    {
      "id": 30,
      "start": 1372.5600128173828,
      "end": 1378.4400177001953,
      "text": " a joy these people as they gathered together and we see all that is"
    },
    {
      "id": 31,
      "start": 1378.4400177001953,
      "end": 1383.040023803711,
      "text": " happening and we understand this great opportunity and perhaps there are times"
    },
    {
      "id": 32,
      "start": 1383.040023803711,
      "end": 1388.1600189208984,
      "text": " in which we see Ezra the scribe that he's at this place and he's doing the"
    },
    {
      "id": 33,
      "start": 1388.2000122070312,
      "end": 1391.6000213623047,
      "text": " work that we find here in Nehemiah chapter number 8 and we think about how"
    },
    {
      "id": 34,
      "start": 1391.6000213623047,
      "end": 1396.8000183105469,
      "text": " wonderful this is and indeed it's wonderful. There was some preparation."
    },
    {
      "id": 35,
      "start": 1396.8000183105469,
      "end": 1402.7200164794922,
      "text": " There were some insights that God gave us to the character of this man Ezra"
    },
    {
      "id": 36,
      "start": 1402.7200164794922,
      "end": 1407.280014038086,
      "text": " back in Ezra chapter number 7. Notice in verse number 12, and all the people went"
    },
    {
      "id": 37,
      "start": 1407.280014038086,
      "end": 1410.3200225830078,
      "text": " their way to eat and to drink and to send portions and to make great mirth"
    },
    {
      "id": 38,
      "start": 1410.3200225830078,
      "end": 1414.4800109863281,
      "text": " because they had understood the words that were declared unto them. Isn't it a"
    },
    {
      "id": 39,
      "start": 1414.4800109863281,
      "end": 1420.9600219726562,
      "text": " wonderful thing when you understand the Word of God? There are times in which you"
    },
    {
      "id": 40,
      "start": 1420.9600219726562,
      "end": 1424.9200134277344,
      "text": " might wrestle over a portion of Scripture in your own personal walk with"
    },
    {
      "id": 41,
      "start": 1424.9200134277344,
      "end": 1428.52001953125,
      "text": " the Lord. You're studying the Word of God and you're reading it and you're, Lord I"
    },
    {
      "id": 42,
      "start": 1428.52001953125,
      "end": 1432.5600128173828,
      "text": " don't understand this and Lord teach me and we can rejoice in the fact that we"
    },
    {
      "id": 43,
      "start": 1432.5600128173828,
      "end": 1438.5600128173828,
      "text": " have the Holy Spirit who's our teacher. And we see that these people left and"
    },
    {
      "id": 44,
      "start": 1438.5600128173828,
      "end": 1442.6600189208984,
      "text": " they understood the words that were declared unto them and on the second day"
    },
    {
      "id": 45,
      "start": 1442.8200225830078,
      "end": 1446.1800231933594,
      "text": " verse 13, were gathered together the chief of the fathers of all the people,"
    },
    {
      "id": 46,
      "start": 1446.1800231933594,
      "end": 1452.1400146484375,
      "text": " the priests and the Levites. Notice this, unto Ezra the scribe, even to understand"
    },
    {
      "id": 47,
      "start": 1452.1400146484375,
      "end": 1457.7000122070312,
      "text": " the words of the law. Notice who was gathered to him according to verse"
    },
    {
      "id": 48,
      "start": 1457.7000122070312,
      "end": 1462.6200256347656,
      "text": " number 13 on the second day. It says that they were gathered to him, the chief of"
    },
    {
      "id": 49,
      "start": 1462.6200256347656,
      "end": 1468.02001953125,
      "text": " the fathers of all the people, the priests and the Levites. And so now Ezra"
    },
    {
      "id": 50,
      "start": 1468.02001953125,
      "end": 1473.7000122070312,
      "text": " has this opportunity to give truth, to give instruction to this group of people"
    },
    {
      "id": 51,
      "start": 1473.7000122070312,
      "end": 1480.1400146484375,
      "text": " that would gather here on this particular day. I love reading about the"
    },
    {
      "id": 52,
      "start": 1480.1400146484375,
      "end": 1486.7400207519531,
      "text": " ministry and the opportunity that Ezra had and I just wonder today in our lives"
    },
    {
      "id": 53,
      "start": 1486.7400207519531,
      "end": 1491.5400085449219,
      "text": " as we think about this Old Testament Bible character Ezra and we say man"
    },
    {
      "id": 54,
      "start": 1491.5400085449219,
      "end": 1496.2200317382812,
      "text": " that's wonderful that Ezra, a ready scribe, Ezra a man that had prepared his"
    },
    {
      "id": 55,
      "start": 1496.2200317382812,
      "end": 1500.5400085449219,
      "text": " heart to seek the law of the Lord and to do it and to teach in Israel statutes"
    },
    {
      "id": 56,
      "start": 1500.5400085449219,
      "end": 1506.5000305175781,
      "text": " and judgments. Can I tell you that the opportunity came and Ezra was ready. Can"
    },
    {
      "id": 57,
      "start": 1506.5000305175781,
      "end": 1511.9000244140625,
      "text": " you imagine the the way that the text of Scripture would read in Nehemiah 8 in"
    },
    {
      "id": 58,
      "start": 1511.9000244140625,
      "end": 1516.02001953125,
      "text": " verse number 1 when they spake unto Ezra and said bring the book of the law of"
    },
    {
      "id": 59,
      "start": 1516.02001953125,
      "end": 1522.3000183105469,
      "text": " Moses and come teach us and he's like ah give me some time. It just doesn't work"
    },
    {
      "id": 60,
      "start": 1522.3000183105469,
      "end": 1527.3000183105469,
      "text": " right he had already prepared he was ready. Notice what the Bible tells us in"
    },
    {
      "id": 61,
      "start": 1527.3000183105469,
      "end": 1532.7400207519531,
      "text": " Romans chapter number 1. I want to look at the example here briefly in"
    },
    {
      "id": 62,
      "start": 1532.7400207519531,
      "end": 1538.1000061035156,
      "text": " conclusion this evening of the testimony of the Apostle Paul. There are three"
    },
    {
      "id": 63,
      "start": 1538.1000061035156,
      "end": 1541.7400207519531,
      "text": " statements that he makes in Romans chapter number 1 verse 14, 15 and 16."
    },
    {
      "id": 64,
      "start": 1541.7400207519531,
      "end": 1546.4200134277344,
      "text": " I won't cover all of that and deal with it's really a message in of itself but I"
    },
    {
      "id": 65,
      "start": 1546.4200134277344,
      "end": 1550.7000122070312,
      "text": " just want to look at what he says in verse number 15 and I want to think"
    },
    {
      "id": 66,
      "start": 1550.7000122070312,
      "end": 1554.5400085449219,
      "text": " about the way in which the Bible tells us of Ezra that he was a ready scribe"
    },
    {
      "id": 67,
      "start": 1554.5400085449219,
      "end": 1559.02001953125,
      "text": " and how he did prepared his heart but we find here in Romans 1 in verse number"
    },
    {
      "id": 68,
      "start": 1559.02001953125,
      "end": 1564.1000061035156,
      "text": " 15 the Bible says this that Paul is speaking to these believers that he's"
    },
    {
      "id": 69,
      "start": 1564.1000061035156,
      "end": 1570.02001953125,
      "text": " writing to and he says this so as much as in me is I am ready to preach the"
    },
    {
      "id": 70,
      "start": 1570.02001953125,
      "end": 1577.6200256347656,
      "text": " gospel to you that are at Rome also. And I think about that Paul making that"
    },
    {
      "id": 71,
      "start": 1577.6600036621094,
      "end": 1582.9000244140625,
      "text": " declaration he was ready to go and to preach in Rome the gospel and I am"
    },
    {
      "id": 72,
      "start": 1582.9000244140625,
      "end": 1588.1800231933594,
      "text": " mindful of the way in which the Apostle Paul entered into his first missionary"
    },
    {
      "id": 73,
      "start": 1588.1800231933594,
      "end": 1592.4600219726562,
      "text": " journey when he went into the region of Galatia and the Bible tells us that they"
    },
    {
      "id": 74,
      "start": 1592.4600219726562,
      "end": 1597.2200317382812,
      "text": " came to Antioch and Pisidia it's recorded in Acts 13 and as they would go"
    },
    {
      "id": 75,
      "start": 1597.2200317382812,
      "end": 1601.780029296875,
      "text": " to the synagogue in that city the Bible says that those that were gathered said"
    },
    {
      "id": 76,
      "start": 1601.780029296875,
      "end": 1608.9400024414062,
      "text": " to Paul they said do you have any word of exhortation you know what Paul did"
    },
    {
      "id": 77,
      "start": 1608.9400024414062,
      "end": 1614.3000183105469,
      "text": " he stood up and he preached you can read the message in Acts 13 we don't have"
    },
    {
      "id": 78,
      "start": 1614.3000183105469,
      "end": 1618.0600280761719,
      "text": " anywhere near the amount of time to go through all of the message but we find"
    },
    {
      "id": 79,
      "start": 1618.0600280761719,
      "end": 1622.9000244140625,
      "text": " that what Paul did is he began all the way back in the Old Testament he began"
    },
    {
      "id": 80,
      "start": 1622.9000244140625,
      "end": 1628.1000061035156,
      "text": " preaching and teaching how that these Old Testament prophecies were pointing"
    },
    {
      "id": 81,
      "start": 1628.1000061035156,
      "end": 1633.6600036621094,
      "text": " to Messiah that this Jesus is the Christ he is the Messiah and we find"
    },
    {
      "id": 82,
      "start": 1633.6600036621094,
      "end": 1639.4600219726562,
      "text": " that the opportunity presented himself to him and he was ready he stood up and"
    },
    {
      "id": 83,
      "start": 1639.4600219726562,
      "end": 1645.7000122070312,
      "text": " he preached what a great message he preached a powerful message we find that"
    },
    {
      "id": 84,
      "start": 1645.7000122070312,
      "end": 1651.02001953125,
      "text": " there were some of course that returned and that responded excuse me and"
    },
    {
      "id": 85,
      "start": 1651.02001953125,
      "end": 1655.1400146484375,
      "text": " received the Lord Jesus Christ as our personal Savior and for that we can"
    },
    {
      "id": 86,
      "start": 1655.1400146484375,
      "end": 1661.8200073242188,
      "text": " certainly rejoice this evening we think of Ezra I wonder from this Old Testament"
    },
    {
      "id": 87,
      "start": 1661.8200073242188,
      "end": 1669.260009765625,
      "text": " character many many many years ago we see that after the remnant returned to"
    },
    {
      "id": 88,
      "start": 1669.260009765625,
      "end": 1674.8200073242188,
      "text": " Jerusalem that Ezra had the opportunity to go as well and the Bible tells us"
    },
    {
      "id": 89,
      "start": 1674.8200073242188,
      "end": 1678.2200317382812,
      "text": " that Ezra was a ready scribe and he had prepared his heart to seek the law the"
    },
    {
      "id": 90,
      "start": 1678.2200317382812,
      "end": 1684.8200073242188,
      "text": " Lord and to do it and to teach in Israel statutes and judgments I wonder"
    },
    {
      "id": 91,
      "start": 1684.8200073242188,
      "end": 1690.5000305175781,
      "text": " are we seeking or have we prepared our heart to seek the law of the Lord really"
    },
    {
      "id": 92,
      "start": 1690.5000305175781,
      "end": 1696.3000183105469,
      "text": " getting into the Bible allowing the Bible to get into us we're understanding"
    },
    {
      "id": 93,
      "start": 1696.3000183105469,
      "end": 1701.8200073242188,
      "text": " the importance of this book and not just to have some level of knowledge to speak"
    },
    {
      "id": 94,
      "start": 1701.9400024414062,
      "end": 1709.9000244140625,
      "text": " about it but to do it he was seeking the law the Lord and to do it and then to"
    },
    {
      "id": 95,
      "start": 1709.9000244140625,
      "end": 1713.8200073242188,
      "text": " teach in Israel statutes and judgments you know there's somebody that you that"
    },
    {
      "id": 96,
      "start": 1713.8200073242188,
      "end": 1719.02001953125,
      "text": " God might have in your life that you would have the opportunity to teach some"
    },
    {
      "id": 97,
      "start": 1719.02001953125,
      "end": 1723.739990234375,
      "text": " of the things of the Word of God might not be in a public setting it might not"
    },
    {
      "id": 98,
      "start": 1723.739990234375,
      "end": 1729.9000244140625,
      "text": " be in a as a profession quote-unquote but there might be some opportunities"
    },
    {
      "id": 99,
      "start": 1729.9000244140625,
      "end": 1734.9800415039062,
      "text": " that we have to to give an answer to a man of the hope that lieth within us to"
    },
    {
      "id": 100,
      "start": 1734.9800415039062,
      "end": 1741.2999877929688,
      "text": " teach them to give them the gospel what a great opportunity that is and how we"
    },
    {
      "id": 101,
      "start": 1741.2999877929688,
      "end": 1747.2999877929688,
      "text": " need to be ready ready servants ready to do the work of the Lord when when the"
    },
    {
      "id": 102,
      "start": 1747.2999877929688,
      "end": 1751.6199951171875,
      "text": " opportunity would come that we would not miss the opportunity because of we"
    },
    {
      "id": 103,
      "start": 1751.6199951171875,
      "end": 1755.8200073242188,
      "text": " because of the fact that we failed to prepare but that we would prepare even"
    },
    {
      "id": 104,
      "start": 1755.8200073242188,
      "end": 1760.9800415039062,
      "text": " now so that when the opportunity would present itself we'd be ready father we"
    },
    {
      "id": 105,
      "start": 1760.9800415039062,
      "end": 1764.9000244140625,
      "text": " love you and we thank you for loving us we thank you for thy word we thank you"
    },
    {
      "id": 106,
      "start": 1764.9000244140625,
      "end": 1770.5800170898438,
      "text": " for the truth of thy word and we thank you for the life and ministry of Ezra we"
    },
    {
      "id": 107,
      "start": 1770.5800170898438,
      "end": 1776.1000366210938,
      "text": " thank you for the opportunity to read of that which you allowed him to do in the"
    },
    {
      "id": 108,
      "start": 1776.1000366210938,
      "end": 1781.1000366210938,
      "text": " book of Nehemiah and the teaching of the law of the Lord and what a great"
    },
    {
      "id": 109,
      "start": 1781.1000366210938,
      "end": 1785.7000122070312,
      "text": " testimony we thank you that this was a man that was not only a student of the"
    },
    {
      "id": 110,
      "start": 1785.7000122070312,
      "end": 1791.6600341796875,
      "text": " word but a doer of the word Lord we thank you for the example and we pray"
    },
    {
      "id": 111,
      "start": 1791.6600341796875,
      "end": 1797.02001953125,
      "text": " that you would help us as your servants today to seek the law of the Lord to"
    },
    {
      "id": 112,
      "start": 1797.02001953125,
      "end": 1802.0599975585938,
      "text": " seek to understand thy word to daily dig into the word of God"
    },
    {
      "id": 0,
      "start": 1802.0599975585938,
      "end": 1807.0599975585938,
      "text": " and to allow Your Word to impact us and affect us and change us."
    },
    {
      "id": 1,
      "start": 1807.0599975585938,
      "end": 1811.8599977493286,
      "text": " I pray, God, that we'd be doers of the Word and not hearers only."
    },
    {
      "id": 2,
      "start": 1811.8599977493286,
      "end": 1816.459997177124,
      "text": " We do pray that You would give us opportunities to teach,"
    },
    {
      "id": 3,
      "start": 1816.459997177124,
      "end": 1818.8599967956543,
      "text": " not necessarily in a public setting,"
    },
    {
      "id": 4,
      "start": 1818.8599967956543,
      "end": 1823.6599979400635,
      "text": " but Lord, to be able to give some truth to those"
    },
    {
      "id": 5,
      "start": 1823.6599979400635,
      "end": 1826.459997177124,
      "text": " that we come into contact with from Your Word."
    },
    {
      "id": 6,
      "start": 1826.459997177124,
      "end": 1829.2599983215332,
      "text": " What a great blessing and privilege that is."
    },
    {
      "id": 7,
      "start": 1829.2599983215332,
      "end": 1831.459997177124,
      "text": " We pray, God, that You'd work in our hearts and lives,"
    },
    {
      "id": 8,
      "start": 1831.459997177124,
      "end": 1833.459997177124,
      "text": " even as we look at the example of Ezra,"
    },
    {
      "id": 9,
      "start": 1833.459997177124,
      "end": 1837.6599960327148,
      "text": " and seek to follow that wonderful pattern that was set forth,"
    },
    {
      "id": 10,
      "start": 1837.6599960327148,
      "end": 1840.8599967956543,
      "text": " that we too would be ready."
    },
    {
      "id": 11,
      "start": 1840.8599967956543,
      "end": 1843.4599990844727,
      "text": " For it's in Christ's name we pray, Amen."
    }
  ],
  "processed_at": "2025-04-17T20:01:04.398382"
}