{
  "video_id": "WWASD9CXEro",
  "text": "2, and we'll be looking at a passage of Scripture and continuing with this series, this thought of doing what we ought to do, and we'll be looking at 1 John 2 this evening, particularly verse number 6, and we'll look at this portion of Scripture. I do believe that it will take us two to three weeks to get through this particular admonition that we find here in 1 John 2, 6, because it's such depth to the statement that is made, and I'm going to begin reading in verse number 1, 1 John chapter 2 is such a powerful, God's Word is powerful, we understand that, and all of it is powerful, it is God's Word and we're thankful to have it preserved for us, but I love 1 John chapter 2, and it begins by saying this, my little children, these things write I unto you that you sin not. If any man sin, by the way, that's all of us, right, after salvation we still sin, and of course our goal is to not sin, and that's why he says that you sin not, and as we continue to draw closer and closer to the Lord as we abide in Him and we walk with Him, we should be sinning less and less, but we'll never be sinless until we get to Heaven. And so he says if any man sin, we have an advocate with the Father, notice it says Jesus Christ the righteous, aren't you so thankful that we have an advocate with the Father, and it says this in verse 2, He is the propitiation for our sins, and not for ours only, but also for the sins of the whole world, and praise the Lord for that wonderful truth, I'm so thankful that Christ took my place and took your place and paid for the sin of the entire world, there's not one person that's ever walked upon the face of the earth that is beyond the ability of God's saving grace, and I'm so thankful for that. Verse 3, and hereby we do know that we know Him if we keep His commandments, he that saith I know Him and keepeth not His commandments is a liar and the truth is not in him, but whoso keepeth His word and him verily is the love of God perfected, hereby know we that we are in Him, notice verse 6, the text for our study this evening, he that saith he abideth in Him ought himself also so to walk even as He walked. I've titled the message this evening, We Ought to Walk as Christ Walked. The truth of 1 John chapter 2 and verse number 6 requires for every believer to really examine the scriptures. Why do I say that? Well, the Bible says that he that saith he abideth in Him ought himself also so to walk even as He walked. So what is it that requires some examination of the scriptures on the part of every child of God? Well, it's for us to know how Christ walked. I'm thankful that God has given us the records of Matthew, Mark, Luke, and John, the gospel accounts, and we have the privilege of being able to read about the life and ministry of the Lord Jesus Christ. And so we find that here as we look at this thought that we ought, that he that saith he abideth in Him ought himself also so to walk even as He walked, and then we're reminded that this truth or this thought of the phrase our walk, that throughout the Bible it is clearly understood that our walk is really referring to how we live our lives. It's not talking about our gait, in other words, how we walk physically, our posture in our particular gait in our walk. No, it's talking about our lives. It's talking about how we lead and live our lives. It's also important for us to know a concept that is found in this second chapter of First John. We find that on three occasions here in First John chapter number two, the Bible will say this, he that saith, he that saith. In our text it says he that saith he abideth in Him. Now we understand John 15, Jesus said abide in me and I in you, and He talks about the vine and the branches and the truth that's contained in that passage of Scripture, and so we understand as the people of God, the children of God, that we're to abide in Him, but here the text says he that saith he abideth in Him. Now listen, we can say whatever we want to say, but as the old saying goes, the proof is in the pudding, and here we find he that saith he abideth in Him ought himself also so to walk even as he walked. The claim that the individual believer makes must be supported by their behavior. Earlier in the text in verse number three, it talked about the one that says, and hereby do we know that we know Him if we keep His commandments. Someone can say, I'm a believer, I'm a Christian, but they don't obey, they don't keep the commandments of God, they have no regard for God's Word, well the reality is that the Bible says that there are evidences that should be present in the life of its people. The reality is that we can ask it this way, is there evidence to support the claim? Is there evidence that supports the claim? If you say that you love me, but you hate your brother, right, it's what God says also, right, and so we understand throughout this book there's claims that are made, but what's the evidence? By the way, the evidence is seen in our behavior, seen in how we live our lives, how we lead our lives. And so when we begin to think about this truth, we ought to walk as Christ walked, I'm reminded of a couple of truths that God gives us. Notice this in your Bible there at 1 John, turn back if you will to 1 Peter and chapter number two, 1 Peter chapter number two, and I want you to see a familiar verse of Scripture, we often reference part of this verse, but I want you to see it here by way of introduction as we get into the thought tonight, how is, how did Christ walk, how did He live His life so that we could know that we're to walk like Him, am I walking like Him, I've said it before and you've heard me say it, that this little idea of what would Jesus do, I believe that many people that have that shirt that says it or the little bracelet that says WWJD and so on and so forth, I believe, and I'm not trying to be unkind or whatever, but I believe that many of them have absolutely no idea what Jesus would do because they've never actually studied the Scriptures to know how Christ behaved and how He lived. They say, well, Christ loved, listen, the way that they say that He loved is different than how He actually loved, amen, because they think, well, Jesus is love, God is love, so He permits us to do whatever we want to do because He loves me. That's not what the Bible teaches, and so we must get into the Scriptures. Notice in 1 Peter 2 and verse 21, for even here unto were ye called, because Christ also suffered for us, leaving us an example that we should follow His steps, who did no sin, neither was guile found in His mouth, who when He was reviled, reviled not again. When He suffered, He threatened not, but committed Himself to Him that judgeth righteously, who His own self bare our sins in His own body on the tree, that we, being dead to sins, should live unto righteousness by whose stripes ye are healed. For ye were as sheep going astray, but are now returned to the shepherd and bishop of your souls. And by the way, aren't you thankful that you're not what you once were? Because we were as sheep going astray, but now, He says, are returned to the shepherd and bishop of your souls. I'm so thankful, Psalm 23, the Lord is my shepherd, amen, and what a joy to have that personal understanding, but the Bible tells us in verse 21 that Jesus lived His life, He left us an example that we would follow His steps. If you will, in the book of Acts, in the 10th chapter, Acts chapter number 10, and then we'll get into some thoughts with regard to how Christ walked and how, therefore, we, as Christ followers of those that say we abide in Him, how we ought to walk. In Acts chapter 10, in verse number 38, we find that Peter is preaching here, and he's there with Cornelius, and you may have some level of being familiar with this passage of Scripture, and here we find that God had orchestrated amazingly for Peter to go and to speak and preach to Cornelius and those that he had gathered to preach the gospel, but right in the middle of his message, in verse number 38, notice what Peter says, how God anointed Jesus of Nazareth with the Holy Ghost and with power, notice this phrase, who went about doing good and healing all that were oppressed of the devil, for God was with Him. I want you to understand this evening that there's none good but God, He's the only one that's good, but He walked about doing good. Listen, as the people of God, as Christians, we have a testimony that we need to be concerned about. We need to be concerned that we live our lives in such a way that we're not bringing a reproach against the name of God. It ought not be that someone looks at our behavior and says, and they claim to be a Christian. I've heard employers that have made the comment that they don't want to hire Christians because they're lazy employees. Can I tell you, that's terrible, that's a terrible testimony. A Christian ought to be the hardest working employee that the employer ever did hire, because what thy hand findeth to do, do it as unto the Lord and not unto men, amen? When we find that it's... important how we walk, not only for the testimony of those around us, but to please our God. So if we say that we abide in Him, we ought to walk in the manner in which He walked. We ought to walk as Christ walked. And so how did He walk? I have several things that we're going to look at. Number one, if you're taking notes, Jesus walked wisely. He walked wisely. He walked in wisdom. If there's ever a day in which we need wisdom, it's today. We need the wisdom of God. We find that He walked wisely. Notice in the book of John, if you will, and of course with each of these particular thoughts that I'll give you on how Christ walked, and by the way, it's not an exhaustive list. It's just six things, and I am nowhere going to get through all six of them this evening. That's why I said it'd be at least two weeks. But the list is not exhaustive, but we will find with each of these items that I provide you with that within the gospel records, we see the evidence of Jesus walking in this manner. In John chapter number seven, John chapter number seven, we find that Jesus walked wisely. Why do we say that? Notice, if you will, in verse number one, the Bible says after these things, Jesus walked in Galilee. He walked in Galilee. Notice this. He would not walk in Jewry. Why? Because the Jews sought to kill Him. Now, He knew the intent of the Jewish people. By the way, many times throughout the Scriptures, you find that the religious leaders were seeking how they might destroy or how they might kill Jesus. And so here we find that Jesus knew, and therefore He walked in Galilee, but not in Jewry. And we find that as He would walk here, and we look through the text of Scripture, we see the feast of what's going on, and He tells them to go up because He's not going up yet. And by the way, that word yet is so important because He does go up, but in so many of the modern versions, it's missing, and they then bring the charge that Jesus lied because He said He wasn't going, and then He did go. And so we find that He says, I'm not going yet. And so He knew, and by the way, even as He gets there and He begins to say about those that were desiring to kill Him, there was some objection to the claim, but we know what was taking place. And so He walked wisely. Turn over to John 11, if you will, just a few chapters over, John chapter number 11. Look if you will here as we see what's taking place, again, in the life of the Lord Jesus Christ. And verse number 54, I'll just pick it up right in the middle here, and again, the same similar context and idea of what we saw in John 7. Here in John chapter 11 and verse 54, Jesus therefore walked no more openly among the Jews, but went fenced into a country near to the wilderness, into a city called Ephraim, and there continued with His disciples. And so was it that He did not walk openly in John chapter number 7 and verse number 1? Is it that He, here in John chapter 11 and verse 54, that He didn't walk openly among the Jews because He was fearful? No, it's because He was wise. See throughout the book of John, it's very interesting, there's this phrase that's used about the hour. And we find that it's first introduced to us in John chapter number 2, and if you were to trace the use of the phrase throughout the book of John, you find that it starts in John chapter number 2, that mine hour is not yet come, and it goes all the way to John 17 when He says the hour is come. And in between that period of time, we find that Jesus was fulfilling all that had to be fulfilled, and He was doing all that He was supposed to do until that appointed time, until the hour was come. And so knowing the intent of those religious leaders, knowing their heart to kill Him, He didn't, He wasn't walking fearfully, He was walking wisely. Can I tell you this evening, that we as the people of God, we need to walk in wisdom, we need to walk wisely. Notice if you will, in Matthew chapter 10, as we consider some instruction for us as the people of God, if we're seeking to take this truth from 1 John 2 and verse 6 to say that we ought to walk as Christ walked, we look at how He walked, and then we say, okay, what instruction do we have in God's Word for us as individual followers of Jesus Christ that we're to walk in like manner? Notice in Matthew chapter 10, and it's a verse of Scripture that we've often referred to, notice what Jesus says in Matthew 10, and in verse number 16, the Bible says this, behold, I send you forth as sheep in the midst of wolves. Be therefore, what's it say, wise as serpents and harmless as doves. You know, we understand the use of the analogies, and you find here that He says, I send you forth as sheep in the midst of wolves. How's that gonna fare for the sheep? Well, there's gonna be problems, there's danger, there's difficulty, but He says therefore we're to walk wisely, we're to walk in wisdom. I'm thankful that the shepherd gives us the protection that we need, but He says that we're to be therefore wise as serpents and harmless as doves. Notice in Colossians, if you will, in chapter number four, it's, we'll be looking at a lot of Scripture this evening, keep your fingers going, and Colossians chapter number four, and look if you will at verse number five, very simply, the Bible says walk in wisdom. Praise the Lord. I mean, talk about walking wisely, Colossians four and verse five, walk in wisdom toward them that are without, redeeming the time. Back in Ephesians, if you will, and look here in Ephesians chapter five, we read that the Bible teaches us that we're to walk circumspectly, not as fools, but as wise. So in Ephesians five and verse 15, we find that God tells us, as Paul is writing to these believers in Ephesus, that they're to walk circumspect, they're to be aware of their surroundings, they're to walk, basically, if you kind of get the idea, with your eyes wide open. And He says this, He ends the verse, not as fools, but as wise. Notice in the book of James, the Bible tells us a verse that we often quote in the first chapter, we'll look at James chapter three as well, but notice in James chapter number one, we think about this idea that Jesus walked wisely, and we also, as His people, as we understand tonight, we ought to walk as Christ walked, that we need to walk in wisdom, we need to walk wisely. In James chapter one, the Bible says in verse number five, if any of you lack wisdom, can I tell you this evening, that's all of us. You say, no, I'm wise, but we're not all wise. We don't know everything. And we must acknowledge that as we go through life, that I need God's wisdom. I need God's wisdom every day, for every scenario. There are no two scenarios that are going to ever be identical. And by the way, I want you to remember, when the Philistines came against David and the people of God, and David, he goes to God and he says, should I go out against the Philistines? And He says, yes, go. And they defeat the Philistines, and then the Philistines come again, and they, they're going to, you know, regroup and attack again, and God, what does, what does David do? He seeks the face of God, and God says, yes, but not the same way you went last time. This time do this, wait for the sound in the mulberry trees, right? And you begin to think, listen, if we just presume upon God and don't seek God for wisdom, we may approach things in our wisdom. And so when he says, if any of you lack wisdom, notice it says this, let them ask of God that giveth to all men liberally, and it braideth not, and it shall be given him. Now that's a great promise, absolutely wonderful to know that, okay, I lack wisdom, but I know the all wise God, He's my God, He's my Father, and He said, I will give you wisdom. Notice verse number six, it says this, but let him ask how? In faith. Nothing wavering, for he that wavereth is like a wave of the sea driven with the wind and tossed. And so what does it mean to ask in faith? Believing that God hears and answers prayer, believing that God is the all wise God, believing that God can give me the wisdom that I need for the situation in which I'm facing. Rarely people say, pastor, can I meet with you? I'd really like it if people would say, pastor, can I meet with you, and here's what I want to meet about. But rarely does that happen, and I'm not saying that it needs to be that way, I'm just saying what happens is I have no idea what that conversation is going to be like. Man, that helps me ask for wisdom. Because you know, as God, you know what's on their heart, you know what they want to talk about, but I have no idea, I have no way of preparing, I have no way, God, I need your wisdom. And I'm thankful that God gives wisdom. Notice in chapter three, when we think about the subject of wisdom here in James chapter number three, the Bible says this in verse number 13. Who is a wise man and endued with knowledge among you? Let him show of a good conversation his works with meekness of wisdom. But if you have bitter envying and strife in your hearts, glory not, and lie not against the truth. But this wisdom descendeth not from above, but is earthly, sensual, devilish. For where envying and strife is, there is confusion in every evil work, but the wisdom that is from above is first pure, then peaceable, gentle, and easy to be entreated, full of mercy and good fruits, without partiality and without hypocrisy. The fruit of righteousness is sown in peace of them that make peace. So we see here, there's this contrast that the wisdom that, notice in verse 15, this wisdom descendeth not from above, but is earthly. And then we see verse 17, but the wisdom that is from above. Listen, we want that heavenly wisdom. We need God's wisdom. We find that Jesus, when we consider the thought of 1 John 2, 6, that we ought to walk as Jesus walked, that we understand that we have to go back and find, okay, how did he walk? Because if I say that I abide in him, and by the way, we are commanded to abide in him, so if I'm abiding in him, the evidence that John tells us that he gives us is that he ought to himself also so to walk even as he walked. And so we ought to walk as Christ walked. How do I know how Christ walked? Well, thank God for the Gospels. And I go back and I begin to read and study, so we see number one, Jesus walked wisely. Number two, Jesus walked humbly. The humility of the Lord Jesus Christ is absolutely phenomenal. It's amazing to think about God in flesh. He's eternal. He has no beginning and no end. He's enjoyed the glory of heaven, but he left it to come to this sin-cursed world. The humility of the Lord Jesus Christ. And notice, if you will, in Mark chapter 10, again, as we look at the Gospel records to see some evidence with regard to the humility of Jesus Christ, that he walked humbly. We find that he walked wisely. Praise the Lord for the truth of that and the admonition that we have to walk also in wisdom. Now we find that he walked humbly. In Mark chapter 10, the Bible says this, in verse number 41, it says, and when the ten heard it, they began to be much displeased with James and John. What did they hear? Well, there was some question about a position and so on and so forth back in verse 35. And James and John, the sons of Zebedee, came unto him saying, Master, we would that thou shouldest do for us whatsoever we shall desire. And Jesus says, what would you that I should do for you? In verse 36 and verse 37, they said unto him, grant us that we may sit one on thy right hand and the other on thy left in thy glory. And so the Bible tells us in verse number 41 that the ten heard what James and John were discussing and they were much displeased, but Jesus, verse 42, called them to him and saith unto them, ye know not that ye know, excuse me, ye know that they which are accounted to rule over the Gentiles exercise lordship over them, and their great ones exercise authority upon them, but so shall it not be among you, but whosoever will be great among you shall be your, what's it say? Minister. Minister. You ever see people that think they're above something? I mean, here in northern Virginia, you see people every day that think they're above something. Amen? You just get out on the road. I mean, I saw a guy, I'm not like, I was just at, you know, this little hairpin turn down here at Waples Mill? I was sitting at the red light just, just the other day, Monday morning, I'm sitting at the red light, and I'm coming down Waples Mill turning right onto Oakton. And there's this joker that's going straight, right, on Waples Mill, got a red light, people coming the other way are the ones that have a green light, and he waits and he looks and he just goes, just absolutely blows the red light, because why? He can't, he's, he's privileged. It's unbelievable. People got a problem with pride. Seriously. But Jesus says whosoever will be great among you shall be your minister. Notice in verse 44, and whosoever of you will be the chiefest shall be servant of all. You ever meet those kind of people that want the preeminence? They want to, they want all the recognition, they want to be looked at, they want to have the chiefest of seats, they want all of that. And Jesus says, listen, whoever here is going to be chiefest shall be servant of all. It reminds me of diatrophies in the book of 3 John. The Bible says that he loveth to have the preeminence. In verse 45, notice the humility of Jesus, because we are mentioning that Jesus walked humbly. Notice in verse 45, for even the Son of Man came not to be ministered unto, but to minister, to give his life a ransom for many. Aren't you thankful for that? He came not to be ministered unto, but he came to minister. And oh, how he ministered. Notice in John 13, if you will, we see this declaration in Mark 10, but notice in John 13, I mean, this is the passage in which Jesus is washing the feet of the disciples. I mean, it is the lowest of low tasks to wash the feet. It was the, I mean, it was so low, I'm told, as I study and read and those that have studied with many years of looking at the culture and what have you, that you weren't even permitted to force a servant to do this task. It was so low. And the Bible says in John 13, beginning in verse number 4, he riseth from supper and laid aside his garments and took a towel and girded himself. After that, he poureth water into a base and began to wash the disciples' feet, and to wipe them with the towel wherewith he was girded. Can you imagine? God in flesh, the Lord Jesus Christ. I mean, I think, I hope, that some of us would probably respond the way that Peter did. Jesus, you're my master. You're my Lord. You're going to wash my feet? Verse 6, then cometh he to Simon Peter, and Peter saith unto him, Lord, dost thou wash my feet? Jesus answered and said unto him, What I do thou knowest not now, but thou shalt know hereafter. Peter saith unto him, Thou shalt never wash my feet. I mean, can you understand why Peter's saying this? Peter lived in the culture. Peter understood. And he knew who, listen, this is Peter that when Jesus said, Peter, all the disciples were there, but Peter's the one that answers. He says to all of them, and only Peter answers, says, Whom do men say that I am? Well, some say John the Baptist, some say one of the other prophets, Elijah, Jeremiah, whatever. But whom say ye that I am? And Peter says, Thou art the Christ, the Son of the living God. And now he's going to wash his feet. I understand why Peter would say, Thou shalt never wash my feet. Jesus said, If I wash thee not, thou hast no part with me. Then Peter changes. I mean, 180-degree turn here. He saith unto him, Lord, not my feet only, but also my hands and my head. Because when Jesus said, You have no part with me, he's like, I'm all in. I get it. Verse 10, Jesus saith unto him, He that is washed, he is not to say to wash his feet, but is clean every whip, and ye are clean, but not all. Of course, he's speaking of Judas, but it says in verse 11, For he knew who should betray him, therefore said he, ye are not all clean. So after he had washed their feet and had taken his garments and was set down again, he said unto them, Know ye what I have done to you? Ye call me master and lord. Notice this, and ye say, Well, for so I am. He is master and he is lord. If I then, your lord and master, have washed your feet, ye also ought to wash one another's feet. What humility that Jesus gave. Listen, the people of God should be humble. We should walk humbly. Notice, if you will, in Philippians chapter 2, a favorite passage of scripture. Philippians chapter 2 begins in verse number 5 by saying, Let this mind be in you which was also in Christ Jesus. Begin to see this unfolding truth in Philippians chapter 2, and the example of humility of our Lord and Savior is just amazing here. Such a wonderful passage of scripture. It says, Let this mind be in you which was also in Christ Jesus. Notice verse 6, Who being in the form of God, thought it not, Robert, to be equal with God, but made himself of no reputation, and took upon him the form of a servant, and was made in the likeness of men. Being found in fashion as a man, he humbled himself, became obedient unto death, even the death of the cross. It's interesting, in verse number 7, the Bible says, But he made himself of no reputation. You know, a lot of people today are trying to make a reputation for themselves. Jesus is God. He's the master. He owns everything. He created it all. And he made himself of no reputation. He walked humbly. Oh, that God's people would walk humbly. We're aware of in our society, unfortunately, they've hijacked a month of our calendar, and they've called it Pride Month. I have a pastor friend, some of you know him, Mark DeLoach. And Brother DeLoach determined this year that in his church in the month of June, it was going to be called Humility Month. And every single Sunday, my understanding is that he was planning to preach on the subject matter of how we as God's people are to walk in humility. because God resisteth the proud.\" If we're not careful, we can be prideful. We can be prideful. We find that for us here in Philippians chapter 2, we see the example of Christ in verses 5 through 8. Notice, if you will, just a few verses before. Before Paul gives the example of great humility, he gives to the people at Philippi this instruction. In verse number 3, he says, \"'Let nothing be done through strife or vainglory, but in lowliness of mind, let each esteem other better than themselves. Look not every man on his own things, but every man also on the things of others.'\" And then he gives the example of the Lord Jesus Christ. And the reality, when he says in verse 3, \"'Let nothing be done through strife and vainglory,' where does the strife come from? Well, the Bible tells us in the book of Proverbs that by pride cometh contention, contention and strife. And we find that it says, but in lowliness of mind.\" It's not necessarily having a low self-esteem. It's not that idea of getting caught up into this psychology area of things in our society. No, it's just recognizing how great our God is. Because really, if we're going to deal with the subject of walking humbly, if we're going to walk in humility as the people of God, the best way for us to do that is really just get our eyes on God and see how great He is. And then we recognize how blessed we are, that He would even love us, hear us, save us. It's amazing. We find this evening in the book of James, we'll finish and wrap up here in James chapter 4. We see it in 1 Peter as well, but this instruction for us, we find that we're to walk, we ought to walk as Christ walked. Well, how did Christ walk? Well, He walked wisely. All right, we also are to walk wisely. And by the way, it's not with the earthly wisdom, it's with the heavenly wisdom. It's with God's wisdom. He's the all wise God. Well, Jesus walked humbly. Okay, we too are to walk humbly. We're to walk in humility. Notice the truth of James 4 in verse number 6. The Bible says, but He giveth more grace. By the way, aren't you thankful for God's grace? It says this, wherefore He saith, God resisteth the proud, but giveth grace unto the humble. Sometimes I wonder if we really allow the significance of this verse of Scripture to really permeate our minds, that God resisteth the proud. You know, God hates pride. He hates pride. You know, the enemy, Satan, Lucifer, it was pride. I will be like, it was pride. God says, I hate pride. He says, He resisteth the proud, but He gives grace unto the humble. You know, sometimes it's really easy to become prideful. It really is. The best way I have found to keep our feet on the ground and keep a proper perspective is to keep our eyes on Jesus. We keep our eyes on Jesus and it will help us to walk humbly. This evening, we see this truth. We ought to walk as Christ walked. How do I know if I'm walking like Christ? Well, I go to the Gospels, I begin to study. Tonight, two simple thoughts. We'll continue next week. Walk wisely. How are we doing with that? Are we walking in wisdom? Do we have God's wisdom? Are we seeking for God's wisdom? Are we asking for God's wisdom? Do we even acknowledge that we need God's wisdom? Are we walking humbly? Are we walking as God walked? The Bible tells us this in 2 Corinthians. I'm just reminded of the depth of this verse of Scripture. And in 2 Corinthians 8 and verse 9, for you know the grace of our Lord Jesus Christ, that though he was rich, yet for your sakes he became poor, that you through his poverty might be rich. Wow, what a great truth. This evening, we'll walk humbly. We can't get prideful about, I got the right position. I got the right, no, no, no, don't get prideful. We are blessed to have been given a Bible, to have been exposed to the truth of God's word. And because we've been blessed, it's not so that we'd respond in being prideful, it's that we'd understand we're accountable. Because to whom much has been given, much is required. Can I say this evening, we've been given much, really have. And much is required. Let's walk in wisdom. Let's walk in humility as we seek to walk as Christ walked. Let's pray together. Father, we love you. Thank you for loving us. Thank you for the blessings. Thank you for the truth of your word. I pray God that you'd help us to walk as Christ walked. I pray that we'd live our lives in such a way that you'd be pleased, honored, and glorified. Bless our time of prayer. I pray that you'd be glorified for it's in Christ's name we pray. Amen. All right, start on the back of the prayer.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 7.239999771118164,
      "text": " 2, and we'll be looking at a passage of Scripture and continuing with this series, this thought"
    },
    {
      "id": 1,
      "start": 7.239999771118164,
      "end": 14.239999771118164,
      "text": " of doing what we ought to do, and we'll be looking at 1 John 2 this evening, particularly"
    },
    {
      "id": 2,
      "start": 14.239999771118164,
      "end": 18.84000015258789,
      "text": " verse number 6, and we'll look at this portion of Scripture."
    },
    {
      "id": 3,
      "start": 18.84000015258789,
      "end": 24.959999084472656,
      "text": " I do believe that it will take us two to three weeks to get through this particular admonition"
    },
    {
      "id": 4,
      "start": 24.959999084472656,
      "end": 32.20000076293945,
      "text": " that we find here in 1 John 2, 6, because it's such depth to the statement that is made,"
    },
    {
      "id": 5,
      "start": 32.20000076293945,
      "end": 38.040000915527344,
      "text": " and I'm going to begin reading in verse number 1, 1 John chapter 2 is such a powerful, God's"
    },
    {
      "id": 6,
      "start": 38.040000915527344,
      "end": 44.119998931884766,
      "text": " Word is powerful, we understand that, and all of it is powerful, it is God's Word and"
    },
    {
      "id": 7,
      "start": 44.119998931884766,
      "end": 50.36000061035156,
      "text": " we're thankful to have it preserved for us, but I love 1 John chapter 2, and it begins"
    },
    {
      "id": 8,
      "start": 50.36000061035156,
      "end": 56.0,
      "text": " by saying this, my little children, these things write I unto you that you sin not."
    },
    {
      "id": 9,
      "start": 56.0,
      "end": 61.400001525878906,
      "text": " If any man sin, by the way, that's all of us, right, after salvation we still sin, and"
    },
    {
      "id": 10,
      "start": 61.400001525878906,
      "end": 67.0,
      "text": " of course our goal is to not sin, and that's why he says that you sin not, and as we continue"
    },
    {
      "id": 11,
      "start": 67.0,
      "end": 71.81999969482422,
      "text": " to draw closer and closer to the Lord as we abide in Him and we walk with Him, we should"
    },
    {
      "id": 12,
      "start": 71.81999969482422,
      "end": 76.77999877929688,
      "text": " be sinning less and less, but we'll never be sinless until we get to Heaven."
    },
    {
      "id": 13,
      "start": 76.81999969482422,
      "end": 83.4000015258789,
      "text": " And so he says if any man sin, we have an advocate with the Father, notice it says Jesus"
    },
    {
      "id": 14,
      "start": 83.4000015258789,
      "end": 88.9800033569336,
      "text": " Christ the righteous, aren't you so thankful that we have an advocate with the Father,"
    },
    {
      "id": 15,
      "start": 88.9800033569336,
      "end": 96.73999786376953,
      "text": " and it says this in verse 2, He is the propitiation for our sins, and not for ours only, but also"
    },
    {
      "id": 16,
      "start": 96.73999786376953,
      "end": 104.05999755859375,
      "text": " for the sins of the whole world, and praise the Lord for that wonderful truth, I'm so"
    },
    {
      "id": 17,
      "start": 104.05999755859375,
      "end": 109.05999755859375,
      "text": " thankful that Christ took my place and took your place and paid for the sin of the entire"
    },
    {
      "id": 18,
      "start": 109.05999755859375,
      "end": 114.0999984741211,
      "text": " world, there's not one person that's ever walked upon the face of the earth that is"
    },
    {
      "id": 19,
      "start": 114.0999984741211,
      "end": 120.0199966430664,
      "text": " beyond the ability of God's saving grace, and I'm so thankful for that."
    },
    {
      "id": 20,
      "start": 120.0199966430664,
      "end": 126.37999725341797,
      "text": " Verse 3, and hereby we do know that we know Him if we keep His commandments, he that saith"
    },
    {
      "id": 21,
      "start": 126.37999725341797,
      "end": 132.4600067138672,
      "text": " I know Him and keepeth not His commandments is a liar and the truth is not in him, but"
    },
    {
      "id": 22,
      "start": 132.4600067138672,
      "end": 137.82000732421875,
      "text": " whoso keepeth His word and him verily is the love of God perfected, hereby know we"
    },
    {
      "id": 23,
      "start": 137.82000732421875,
      "end": 142.5800018310547,
      "text": " that we are in Him, notice verse 6, the text for our study this evening, he that saith"
    },
    {
      "id": 24,
      "start": 142.5800018310547,
      "end": 150.82000732421875,
      "text": " he abideth in Him ought himself also so to walk even as He walked."
    },
    {
      "id": 25,
      "start": 150.82000732421875,
      "end": 155.97999572753906,
      "text": " I've titled the message this evening, We Ought to Walk as Christ Walked."
    },
    {
      "id": 26,
      "start": 155.97999572753906,
      "end": 161.6999969482422,
      "text": " The truth of 1 John chapter 2 and verse number 6 requires for every believer to really examine"
    },
    {
      "id": 27,
      "start": 161.6999969482422,
      "end": 162.6999969482422,
      "text": " the scriptures."
    },
    {
      "id": 28,
      "start": 162.6999969482422,
      "end": 163.6999969482422,
      "text": " Why do I say that?"
    },
    {
      "id": 29,
      "start": 163.6999969482422,
      "end": 171.17999267578125,
      "text": " Well, the Bible says that he that saith he abideth in Him ought himself also so to walk"
    },
    {
      "id": 30,
      "start": 171.17999267578125,
      "end": 173.5,
      "text": " even as He walked."
    },
    {
      "id": 31,
      "start": 173.5,
      "end": 178.25999450683594,
      "text": " So what is it that requires some examination of the scriptures on the part of every child"
    },
    {
      "id": 32,
      "start": 178.25999450683594,
      "end": 179.25999450683594,
      "text": " of God?"
    },
    {
      "id": 33,
      "start": 179.25999450683594,
      "end": 182.3000030517578,
      "text": " Well, it's for us to know how Christ walked."
    },
    {
      "id": 34,
      "start": 182.3000030517578,
      "end": 186.5399932861328,
      "text": " I'm thankful that God has given us the records of Matthew, Mark, Luke, and John, the gospel"
    },
    {
      "id": 35,
      "start": 186.5399932861328,
      "end": 191.66000366210938,
      "text": " accounts, and we have the privilege of being able to read about the life and ministry of"
    },
    {
      "id": 36,
      "start": 191.66000366210938,
      "end": 193.02000427246094,
      "text": " the Lord Jesus Christ."
    },
    {
      "id": 37,
      "start": 193.02000427246094,
      "end": 199.05999755859375,
      "text": " And so we find that here as we look at this thought that we ought, that he that saith"
    },
    {
      "id": 38,
      "start": 199.05999755859375,
      "end": 205.02000427246094,
      "text": " he abideth in Him ought himself also so to walk even as He walked, and then we're reminded"
    },
    {
      "id": 39,
      "start": 205.02000427246094,
      "end": 211.25999450683594,
      "text": " that this truth or this thought of the phrase our walk, that throughout the Bible it is"
    },
    {
      "id": 40,
      "start": 211.25999450683594,
      "end": 216.66000366210938,
      "text": " clearly understood that our walk is really referring to how we live our lives."
    },
    {
      "id": 41,
      "start": 216.66000366210938,
      "end": 222.10000610351562,
      "text": " It's not talking about our gait, in other words, how we walk physically, our posture"
    },
    {
      "id": 42,
      "start": 222.10000610351562,
      "end": 225.25999450683594,
      "text": " in our particular gait in our walk."
    },
    {
      "id": 43,
      "start": 225.25999450683594,
      "end": 227.5,
      "text": " No, it's talking about our lives."
    },
    {
      "id": 44,
      "start": 227.5,
      "end": 231.67999267578125,
      "text": " It's talking about how we lead and live our lives."
    },
    {
      "id": 45,
      "start": 231.67999267578125,
      "end": 236.22000122070312,
      "text": " It's also important for us to know a concept that is found in this second chapter of First"
    },
    {
      "id": 46,
      "start": 236.22000122070312,
      "end": 237.4199981689453,
      "text": " John."
    },
    {
      "id": 47,
      "start": 237.4199981689453,
      "end": 242.13999938964844,
      "text": " We find that on three occasions here in First John chapter number two, the Bible will say"
    },
    {
      "id": 48,
      "start": 242.13999938964844,
      "end": 246.77999877929688,
      "text": " this, he that saith, he that saith."
    },
    {
      "id": 49,
      "start": 246.77999877929688,
      "end": 250.5399932861328,
      "text": " In our text it says he that saith he abideth in Him."
    },
    {
      "id": 50,
      "start": 250.5399932861328,
      "end": 256.3399963378906,
      "text": " Now we understand John 15, Jesus said abide in me and I in you, and He talks about the"
    },
    {
      "id": 51,
      "start": 256.3399963378906,
      "end": 261.0199890136719,
      "text": " vine and the branches and the truth that's contained in that passage of Scripture, and"
    },
    {
      "id": 52,
      "start": 261.0199890136719,
      "end": 265.4599914550781,
      "text": " so we understand as the people of God, the children of God, that we're to abide in Him,"
    },
    {
      "id": 53,
      "start": 265.4599914550781,
      "end": 270.0199890136719,
      "text": " but here the text says he that saith he abideth in Him."
    },
    {
      "id": 54,
      "start": 270.0199890136719,
      "end": 274.70001220703125,
      "text": " Now listen, we can say whatever we want to say, but as the old saying goes, the proof"
    },
    {
      "id": 55,
      "start": 274.70001220703125,
      "end": 281.3399963378906,
      "text": " is in the pudding, and here we find he that saith he abideth in Him ought himself also"
    },
    {
      "id": 56,
      "start": 281.3399963378906,
      "end": 284.4599914550781,
      "text": " so to walk even as he walked."
    },
    {
      "id": 57,
      "start": 284.4599914550781,
      "end": 290.4200134277344,
      "text": " The claim that the individual believer makes must be supported by their behavior."
    },
    {
      "id": 58,
      "start": 290.4200134277344,
      "end": 294.2200012207031,
      "text": " Earlier in the text in verse number three, it talked about the one that says, and hereby"
    },
    {
      "id": 59,
      "start": 294.2200012207031,
      "end": 298.3800048828125,
      "text": " do we know that we know Him if we keep His commandments."
    },
    {
      "id": 60,
      "start": 298.3800048828125,
      "end": 302.9800109863281,
      "text": " Someone can say, I'm a believer, I'm a Christian, but they don't obey, they don't keep the"
    },
    {
      "id": 61,
      "start": 302.9800109863281,
      "end": 308.5,
      "text": " commandments of God, they have no regard for God's Word, well the reality is that the Bible"
    },
    {
      "id": 62,
      "start": 308.5,
      "end": 315.4200134277344,
      "text": " says that there are evidences that should be present in the life of its people."
    },
    {
      "id": 63,
      "start": 315.4200134277344,
      "end": 323.3399963378906,
      "text": " The reality is that we can ask it this way, is there evidence to support the claim?"
    },
    {
      "id": 64,
      "start": 323.3399963378906,
      "end": 325.6199951171875,
      "text": " Is there evidence that supports the claim?"
    },
    {
      "id": 65,
      "start": 325.6199951171875,
      "end": 331.94000244140625,
      "text": " If you say that you love me, but you hate your brother, right, it's what God says also,"
    },
    {
      "id": 66,
      "start": 331.94000244140625,
      "end": 337.1400146484375,
      "text": " right, and so we understand throughout this book there's claims that are made, but what's"
    },
    {
      "id": 67,
      "start": 337.1400146484375,
      "end": 338.1400146484375,
      "text": " the evidence?"
    },
    {
      "id": 68,
      "start": 338.1400146484375,
      "end": 342.3800048828125,
      "text": " By the way, the evidence is seen in our behavior, seen in how we live our lives, how we lead"
    },
    {
      "id": 69,
      "start": 342.3800048828125,
      "end": 343.3800048828125,
      "text": " our lives."
    },
    {
      "id": 70,
      "start": 343.3800048828125,
      "end": 348.6199951171875,
      "text": " And so when we begin to think about this truth, we ought to walk as Christ walked, I'm reminded"
    },
    {
      "id": 71,
      "start": 348.6199951171875,
      "end": 351.6199951171875,
      "text": " of a couple of truths that God gives us."
    },
    {
      "id": 72,
      "start": 351.6199951171875,
      "end": 355.9800109863281,
      "text": " Notice this in your Bible there at 1 John, turn back if you will to 1 Peter and chapter"
    },
    {
      "id": 73,
      "start": 355.9800109863281,
      "end": 361.44000244140625,
      "text": " number two, 1 Peter chapter number two, and I want you to see a familiar verse of Scripture,"
    },
    {
      "id": 74,
      "start": 361.44000244140625,
      "end": 366.8999938964844,
      "text": " we often reference part of this verse, but I want you to see it here by way of introduction"
    },
    {
      "id": 75,
      "start": 366.8999938964844,
      "end": 373.8999938964844,
      "text": " as we get into the thought tonight, how is, how did Christ walk, how did He live His life"
    },
    {
      "id": 76,
      "start": 373.8999938964844,
      "end": 379.0199890136719,
      "text": " so that we could know that we're to walk like Him, am I walking like Him, I've said it before"
    },
    {
      "id": 77,
      "start": 379.0199890136719,
      "end": 384.739990234375,
      "text": " and you've heard me say it, that this little idea of what would Jesus do, I believe that"
    },
    {
      "id": 78,
      "start": 384.739990234375,
      "end": 391.6199951171875,
      "text": " many people that have that shirt that says it or the little bracelet that says WWJD and"
    },
    {
      "id": 79,
      "start": 391.6199951171875,
      "end": 396.2200012207031,
      "text": " so on and so forth, I believe, and I'm not trying to be unkind or whatever, but I believe"
    },
    {
      "id": 80,
      "start": 396.2200012207031,
      "end": 401.3800048828125,
      "text": " that many of them have absolutely no idea what Jesus would do because they've never"
    },
    {
      "id": 81,
      "start": 401.3800048828125,
      "end": 406.9800109863281,
      "text": " actually studied the Scriptures to know how Christ behaved and how He lived."
    },
    {
      "id": 82,
      "start": 406.9800109863281,
      "end": 410.8399963378906,
      "text": " They say, well, Christ loved, listen, the way that they say that He loved is different"
    },
    {
      "id": 83,
      "start": 410.8399963378906,
      "end": 417.8999938964844,
      "text": " than how He actually loved, amen, because they think, well, Jesus is love, God is love,"
    },
    {
      "id": 84,
      "start": 417.8999938964844,
      "end": 421.3399963378906,
      "text": " so He permits us to do whatever we want to do because He loves me."
    },
    {
      "id": 85,
      "start": 421.3399963378906,
      "end": 425.82000732421875,
      "text": " That's not what the Bible teaches, and so we must get into the Scriptures."
    },
    {
      "id": 86,
      "start": 425.82000732421875,
      "end": 430.7799987792969,
      "text": " Notice in 1 Peter 2 and verse 21, for even here unto were ye called, because Christ also"
    },
    {
      "id": 87,
      "start": 430.7799987792969,
      "end": 436.29998779296875,
      "text": " suffered for us, leaving us an example that we should follow His steps, who did no sin,"
    },
    {
      "id": 88,
      "start": 436.29998779296875,
      "end": 440.29998779296875,
      "text": " neither was guile found in His mouth, who when He was reviled, reviled not again."
    },
    {
      "id": 89,
      "start": 440.29998779296875,
      "end": 447.1400146484375,
      "text": " When He suffered, He threatened not, but committed Himself to Him that judgeth righteously,"
    },
    {
      "id": 90,
      "start": 447.1400146484375,
      "end": 453.6600036621094,
      "text": " who His own self bare our sins in His own body on the tree, that we, being dead to sins,"
    },
    {
      "id": 91,
      "start": 453.6600036621094,
      "end": 457.5,
      "text": " should live unto righteousness by whose stripes ye are healed."
    },
    {
      "id": 92,
      "start": 457.5,
      "end": 461.9800109863281,
      "text": " For ye were as sheep going astray, but are now returned to the shepherd and bishop of"
    },
    {
      "id": 93,
      "start": 461.9800109863281,
      "end": 462.9800109863281,
      "text": " your souls."
    },
    {
      "id": 94,
      "start": 462.9800109863281,
      "end": 466.5400085449219,
      "text": " And by the way, aren't you thankful that you're not what you once were?"
    },
    {
      "id": 95,
      "start": 466.5400085449219,
      "end": 472.739990234375,
      "text": " Because we were as sheep going astray, but now, He says, are returned to the shepherd"
    },
    {
      "id": 96,
      "start": 472.739990234375,
      "end": 473.739990234375,
      "text": " and bishop of your souls."
    },
    {
      "id": 97,
      "start": 473.739990234375,
      "end": 479.0199890136719,
      "text": " I'm so thankful, Psalm 23, the Lord is my shepherd, amen, and what a joy to have that"
    },
    {
      "id": 98,
      "start": 479.0199890136719,
      "end": 484.17999267578125,
      "text": " personal understanding, but the Bible tells us in verse 21 that Jesus lived His life,"
    },
    {
      "id": 99,
      "start": 484.17999267578125,
      "end": 488.1400146484375,
      "text": " He left us an example that we would follow His steps."
    },
    {
      "id": 100,
      "start": 488.1400146484375,
      "end": 493.260009765625,
      "text": " If you will, in the book of Acts, in the 10th chapter, Acts chapter number 10, and"
    },
    {
      "id": 101,
      "start": 493.260009765625,
      "end": 499.739990234375,
      "text": " then we'll get into some thoughts with regard to how Christ walked and how, therefore, we,"
    },
    {
      "id": 102,
      "start": 499.739990234375,
      "end": 505.29998779296875,
      "text": " as Christ followers of those that say we abide in Him, how we ought to walk."
    },
    {
      "id": 103,
      "start": 505.29998779296875,
      "end": 511.1000061035156,
      "text": " In Acts chapter 10, in verse number 38, we find that Peter is preaching here, and he's"
    },
    {
      "id": 104,
      "start": 511.1000061035156,
      "end": 517.780029296875,
      "text": " there with Cornelius, and you may have some level of being familiar with this passage"
    },
    {
      "id": 105,
      "start": 517.780029296875,
      "end": 523.6199951171875,
      "text": " of Scripture, and here we find that God had orchestrated amazingly for Peter to go and"
    },
    {
      "id": 106,
      "start": 523.6199951171875,
      "end": 528.1799926757812,
      "text": " to speak and preach to Cornelius and those that he had gathered to preach the gospel,"
    },
    {
      "id": 107,
      "start": 528.1799926757812,
      "end": 532.5800170898438,
      "text": " but right in the middle of his message, in verse number 38, notice what Peter says, how"
    },
    {
      "id": 108,
      "start": 532.5800170898438,
      "end": 538.7000122070312,
      "text": " God anointed Jesus of Nazareth with the Holy Ghost and with power, notice this phrase,"
    },
    {
      "id": 109,
      "start": 538.7000122070312,
      "end": 544.4600219726562,
      "text": " who went about doing good and healing all that were oppressed of the devil, for God"
    },
    {
      "id": 110,
      "start": 544.4600219726562,
      "end": 545.4600219726562,
      "text": " was with Him."
    },
    {
      "id": 111,
      "start": 546.1400146484375,
      "end": 551.3800048828125,
      "text": " I want you to understand this evening that there's none good but God, He's the only one"
    },
    {
      "id": 112,
      "start": 551.3800048828125,
      "end": 554.0999755859375,
      "text": " that's good, but He walked about doing good."
    },
    {
      "id": 113,
      "start": 554.0999755859375,
      "end": 562.4600219726562,
      "text": " Listen, as the people of God, as Christians, we have a testimony that we need to be concerned"
    },
    {
      "id": 114,
      "start": 562.4600219726562,
      "end": 563.4600219726562,
      "text": " about."
    },
    {
      "id": 115,
      "start": 563.4600219726562,
      "end": 568.219970703125,
      "text": " We need to be concerned that we live our lives in such a way that we're not bringing a reproach"
    },
    {
      "id": 116,
      "start": 568.219970703125,
      "end": 570.1400146484375,
      "text": " against the name of God."
    },
    {
      "id": 117,
      "start": 570.1400146484375,
      "end": 575.739990234375,
      "text": " It ought not be that someone looks at our behavior and says, and they claim to be a"
    },
    {
      "id": 118,
      "start": 575.739990234375,
      "end": 576.739990234375,
      "text": " Christian."
    },
    {
      "id": 119,
      "start": 576.739990234375,
      "end": 581.3400268554688,
      "text": " I've heard employers that have made the comment that they don't want to hire Christians because"
    },
    {
      "id": 120,
      "start": 581.3400268554688,
      "end": 583.739990234375,
      "text": " they're lazy employees."
    },
    {
      "id": 121,
      "start": 583.739990234375,
      "end": 586.8200073242188,
      "text": " Can I tell you, that's terrible, that's a terrible testimony."
    },
    {
      "id": 122,
      "start": 586.8200073242188,
      "end": 592.1400146484375,
      "text": " A Christian ought to be the hardest working employee that the employer ever did hire,"
    },
    {
      "id": 123,
      "start": 592.1400146484375,
      "end": 598.5399780273438,
      "text": " because what thy hand findeth to do, do it as unto the Lord and not unto men, amen?"
    },
    {
      "id": 124,
      "start": 598.5399780273438,
      "end": 600.1400146484375,
      "text": " When we find that it's..."
    },
    {
      "id": 0,
      "start": 600.1400146484375,
      "end": 608.120014667511,
      "text": " important how we walk, not only for the testimony of those around us, but to please our God."
    },
    {
      "id": 1,
      "start": 608.120014667511,
      "end": 613.5400142669678,
      "text": " So if we say that we abide in Him, we ought to walk in the manner in which He walked."
    },
    {
      "id": 2,
      "start": 613.5400142669678,
      "end": 615.5000143051147,
      "text": " We ought to walk as Christ walked."
    },
    {
      "id": 3,
      "start": 615.5000143051147,
      "end": 616.7000141143799,
      "text": " And so how did He walk?"
    },
    {
      "id": 4,
      "start": 616.7000141143799,
      "end": 618.8800144195557,
      "text": " I have several things that we're going to look at."
    },
    {
      "id": 5,
      "start": 618.8800144195557,
      "end": 622.7000141143799,
      "text": " Number one, if you're taking notes, Jesus walked wisely."
    },
    {
      "id": 6,
      "start": 622.7000141143799,
      "end": 623.7000141143799,
      "text": " He walked wisely."
    },
    {
      "id": 7,
      "start": 623.7000141143799,
      "end": 625.0600147247314,
      "text": " He walked in wisdom."
    },
    {
      "id": 8,
      "start": 625.0600147247314,
      "end": 629.2200145721436,
      "text": " If there's ever a day in which we need wisdom, it's today."
    },
    {
      "id": 9,
      "start": 629.940013885498,
      "end": 631.8200149536133,
      "text": " We need the wisdom of God."
    },
    {
      "id": 10,
      "start": 631.8200149536133,
      "end": 633.5000152587891,
      "text": " We find that He walked wisely."
    },
    {
      "id": 11,
      "start": 633.5000152587891,
      "end": 638.0600128173828,
      "text": " Notice in the book of John, if you will, and of course with each of these particular thoughts"
    },
    {
      "id": 12,
      "start": 638.0600128173828,
      "end": 642.1200141906738,
      "text": " that I'll give you on how Christ walked, and by the way, it's not an exhaustive list."
    },
    {
      "id": 13,
      "start": 642.1200141906738,
      "end": 647.1400146484375,
      "text": " It's just six things, and I am nowhere going to get through all six of them this evening."
    },
    {
      "id": 14,
      "start": 647.1400146484375,
      "end": 650.0600128173828,
      "text": " That's why I said it'd be at least two weeks."
    },
    {
      "id": 15,
      "start": 650.0600128173828,
      "end": 654.8200149536133,
      "text": " But the list is not exhaustive, but we will find with each of these items that I provide"
    },
    {
      "id": 16,
      "start": 654.8200149536133,
      "end": 661.5400161743164,
      "text": " you with that within the gospel records, we see the evidence of Jesus walking in this"
    },
    {
      "id": 17,
      "start": 661.5400161743164,
      "end": 662.5400161743164,
      "text": " manner."
    },
    {
      "id": 18,
      "start": 662.5400161743164,
      "end": 667.5000152587891,
      "text": " In John chapter number seven, John chapter number seven, we find that Jesus walked wisely."
    },
    {
      "id": 19,
      "start": 667.5000152587891,
      "end": 668.8600158691406,
      "text": " Why do we say that?"
    },
    {
      "id": 20,
      "start": 668.8600158691406,
      "end": 673.9600143432617,
      "text": " Notice, if you will, in verse number one, the Bible says after these things, Jesus walked"
    },
    {
      "id": 21,
      "start": 673.9600143432617,
      "end": 676.3600158691406,
      "text": " in Galilee."
    },
    {
      "id": 22,
      "start": 676.3600158691406,
      "end": 677.6200180053711,
      "text": " He walked in Galilee."
    },
    {
      "id": 23,
      "start": 677.6200180053711,
      "end": 678.6200180053711,
      "text": " Notice this."
    },
    {
      "id": 24,
      "start": 678.6200180053711,
      "end": 679.9400177001953,
      "text": " He would not walk in Jewry."
    },
    {
      "id": 25,
      "start": 679.9400177001953,
      "end": 680.9400177001953,
      "text": " Why?"
    },
    {
      "id": 26,
      "start": 680.9400177001953,
      "end": 684.4200134277344,
      "text": " Because the Jews sought to kill Him."
    },
    {
      "id": 27,
      "start": 685.0200119018555,
      "end": 688.6600112915039,
      "text": " Now, He knew the intent of the Jewish people."
    },
    {
      "id": 28,
      "start": 688.6600112915039,
      "end": 692.8200149536133,
      "text": " By the way, many times throughout the Scriptures, you find that the religious leaders were seeking"
    },
    {
      "id": 29,
      "start": 692.8200149536133,
      "end": 696.900016784668,
      "text": " how they might destroy or how they might kill Jesus."
    },
    {
      "id": 30,
      "start": 696.900016784668,
      "end": 703.5000152587891,
      "text": " And so here we find that Jesus knew, and therefore He walked in Galilee, but not in Jewry."
    },
    {
      "id": 31,
      "start": 703.5000152587891,
      "end": 707.3400115966797,
      "text": " And we find that as He would walk here, and we look through the text of Scripture, we"
    },
    {
      "id": 32,
      "start": 707.3400115966797,
      "end": 712.900016784668,
      "text": " see the feast of what's going on, and He tells them to go up because He's not going up yet."
    },
    {
      "id": 33,
      "start": 712.900016784668,
      "end": 717.5400161743164,
      "text": " And by the way, that word yet is so important because He does go up, but in so many of the"
    },
    {
      "id": 34,
      "start": 717.5400161743164,
      "end": 722.9800109863281,
      "text": " modern versions, it's missing, and they then bring the charge that Jesus lied because He"
    },
    {
      "id": 35,
      "start": 722.9800109863281,
      "end": 725.5200119018555,
      "text": " said He wasn't going, and then He did go."
    },
    {
      "id": 36,
      "start": 725.5200119018555,
      "end": 727.2600173950195,
      "text": " And so we find that He says, I'm not going yet."
    },
    {
      "id": 37,
      "start": 727.2600173950195,
      "end": 731.7400207519531,
      "text": " And so He knew, and by the way, even as He gets there and He begins to say about those"
    },
    {
      "id": 38,
      "start": 731.7400207519531,
      "end": 738.1400146484375,
      "text": " that were desiring to kill Him, there was some objection to the claim, but we know what"
    },
    {
      "id": 39,
      "start": 738.1400146484375,
      "end": 739.1400146484375,
      "text": " was taking place."
    },
    {
      "id": 40,
      "start": 739.1400146484375,
      "end": 740.5800170898438,
      "text": " And so He walked wisely."
    },
    {
      "id": 41,
      "start": 740.5800170898438,
      "end": 746.3000183105469,
      "text": " Turn over to John 11, if you will, just a few chapters over, John chapter number 11."
    },
    {
      "id": 42,
      "start": 746.3000183105469,
      "end": 751.8600158691406,
      "text": " Look if you will here as we see what's taking place, again, in the life of the Lord Jesus"
    },
    {
      "id": 43,
      "start": 751.8600158691406,
      "end": 753.1000213623047,
      "text": " Christ."
    },
    {
      "id": 44,
      "start": 753.1000213623047,
      "end": 757.9400177001953,
      "text": " And verse number 54, I'll just pick it up right in the middle here, and again, the same"
    },
    {
      "id": 45,
      "start": 757.9400177001953,
      "end": 761.9400177001953,
      "text": " similar context and idea of what we saw in John 7."
    },
    {
      "id": 46,
      "start": 761.9400177001953,
      "end": 768.5400085449219,
      "text": " Here in John chapter 11 and verse 54, Jesus therefore walked no more openly among the"
    },
    {
      "id": 47,
      "start": 768.9400177001953,
      "end": 773.9000091552734,
      "text": " Jews, but went fenced into a country near to the wilderness, into a city called Ephraim,"
    },
    {
      "id": 48,
      "start": 773.9000091552734,
      "end": 776.1800079345703,
      "text": " and there continued with His disciples."
    },
    {
      "id": 49,
      "start": 776.1800079345703,
      "end": 780.6200103759766,
      "text": " And so was it that He did not walk openly in John chapter number 7 and verse number"
    },
    {
      "id": 50,
      "start": 780.6200103759766,
      "end": 781.6200103759766,
      "text": " 1?"
    },
    {
      "id": 51,
      "start": 781.6200103759766,
      "end": 785.8000183105469,
      "text": " Is it that He, here in John chapter 11 and verse 54, that He didn't walk openly among"
    },
    {
      "id": 52,
      "start": 785.8000183105469,
      "end": 787.2200164794922,
      "text": " the Jews because He was fearful?"
    },
    {
      "id": 53,
      "start": 787.2200164794922,
      "end": 789.5400085449219,
      "text": " No, it's because He was wise."
    },
    {
      "id": 54,
      "start": 789.5400085449219,
      "end": 792.9400177001953,
      "text": " See throughout the book of John, it's very interesting, there's this phrase that's used"
    },
    {
      "id": 55,
      "start": 792.9400177001953,
      "end": 794.8600158691406,
      "text": " about the hour."
    },
    {
      "id": 56,
      "start": 794.8600158691406,
      "end": 798.1800079345703,
      "text": " And we find that it's first introduced to us in John chapter number 2, and if you were"
    },
    {
      "id": 57,
      "start": 798.8200073242188,
      "end": 802.5400085449219,
      "text": " to trace the use of the phrase throughout the book of John, you find that it starts"
    },
    {
      "id": 58,
      "start": 802.5400085449219,
      "end": 807.7000122070312,
      "text": " in John chapter number 2, that mine hour is not yet come, and it goes all the way to John"
    },
    {
      "id": 59,
      "start": 807.7000122070312,
      "end": 811.1400146484375,
      "text": " 17 when He says the hour is come."
    },
    {
      "id": 60,
      "start": 811.1400146484375,
      "end": 817.5400085449219,
      "text": " And in between that period of time, we find that Jesus was fulfilling all that had to"
    },
    {
      "id": 61,
      "start": 817.5400085449219,
      "end": 822.6600189208984,
      "text": " be fulfilled, and He was doing all that He was supposed to do until that appointed time,"
    },
    {
      "id": 62,
      "start": 822.6600189208984,
      "end": 824.4800109863281,
      "text": " until the hour was come."
    },
    {
      "id": 63,
      "start": 824.4800109863281,
      "end": 829.760009765625,
      "text": " And so knowing the intent of those religious leaders, knowing their heart to kill Him,"
    },
    {
      "id": 64,
      "start": 829.760009765625,
      "end": 834.4800109863281,
      "text": " He didn't, He wasn't walking fearfully, He was walking wisely."
    },
    {
      "id": 65,
      "start": 834.4800109863281,
      "end": 839.02001953125,
      "text": " Can I tell you this evening, that we as the people of God, we need to walk in wisdom,"
    },
    {
      "id": 66,
      "start": 839.02001953125,
      "end": 841.1200103759766,
      "text": " we need to walk wisely."
    },
    {
      "id": 67,
      "start": 841.1200103759766,
      "end": 845.4800109863281,
      "text": " Notice if you will, in Matthew chapter 10, as we consider some instruction for us as"
    },
    {
      "id": 68,
      "start": 845.4800109863281,
      "end": 850.52001953125,
      "text": " the people of God, if we're seeking to take this truth from 1 John 2 and verse 6 to say"
    },
    {
      "id": 69,
      "start": 850.52001953125,
      "end": 855.6800079345703,
      "text": " that we ought to walk as Christ walked, we look at how He walked, and then we say, okay,"
    },
    {
      "id": 70,
      "start": 855.6800079345703,
      "end": 861.6800231933594,
      "text": " what instruction do we have in God's Word for us as individual followers of Jesus Christ"
    },
    {
      "id": 71,
      "start": 861.6800231933594,
      "end": 863.7200012207031,
      "text": " that we're to walk in like manner?"
    },
    {
      "id": 72,
      "start": 863.7200012207031,
      "end": 869.1600036621094,
      "text": " Notice in Matthew chapter 10, and it's a verse of Scripture that we've often referred to,"
    },
    {
      "id": 73,
      "start": 869.1600036621094,
      "end": 875.4400024414062,
      "text": " notice what Jesus says in Matthew 10, and in verse number 16, the Bible says this, behold,"
    },
    {
      "id": 74,
      "start": 875.4400024414062,
      "end": 879.7000122070312,
      "text": " I send you forth as sheep in the midst of wolves."
    },
    {
      "id": 75,
      "start": 879.7000122070312,
      "end": 887.02001953125,
      "text": " Be therefore, what's it say, wise as serpents and harmless as doves."
    },
    {
      "id": 76,
      "start": 887.02001953125,
      "end": 893.9000244140625,
      "text": " You know, we understand the use of the analogies, and you find here that He says, I send you"
    },
    {
      "id": 77,
      "start": 893.9000244140625,
      "end": 897.9800109863281,
      "text": " forth as sheep in the midst of wolves."
    },
    {
      "id": 78,
      "start": 897.9800109863281,
      "end": 899.5,
      "text": " How's that gonna fare for the sheep?"
    },
    {
      "id": 79,
      "start": 899.5,
      "end": 904.9400024414062,
      "text": " Well, there's gonna be problems, there's danger, there's difficulty, but He says therefore"
    },
    {
      "id": 80,
      "start": 904.9400024414062,
      "end": 907.5,
      "text": " we're to walk wisely, we're to walk in wisdom."
    },
    {
      "id": 81,
      "start": 907.5,
      "end": 912.1000061035156,
      "text": " I'm thankful that the shepherd gives us the protection that we need, but He says that"
    },
    {
      "id": 82,
      "start": 912.1000061035156,
      "end": 915.5800170898438,
      "text": " we're to be therefore wise as serpents and harmless as doves."
    },
    {
      "id": 83,
      "start": 915.5800170898438,
      "end": 920.1000061035156,
      "text": " Notice in Colossians, if you will, in chapter number four, it's, we'll be looking at a lot"
    },
    {
      "id": 84,
      "start": 920.1000061035156,
      "end": 925.9000244140625,
      "text": " of Scripture this evening, keep your fingers going, and Colossians chapter number four,"
    },
    {
      "id": 85,
      "start": 925.9000244140625,
      "end": 932.6200256347656,
      "text": " and look if you will at verse number five, very simply, the Bible says walk in wisdom."
    },
    {
      "id": 86,
      "start": 932.6200256347656,
      "end": 933.6200256347656,
      "text": " Praise the Lord."
    },
    {
      "id": 87,
      "start": 933.7400207519531,
      "end": 937.9800109863281,
      "text": " I mean, talk about walking wisely, Colossians four and verse five, walk in wisdom toward"
    },
    {
      "id": 88,
      "start": 937.9800109863281,
      "end": 941.5,
      "text": " them that are without, redeeming the time."
    },
    {
      "id": 89,
      "start": 941.5,
      "end": 947.4200134277344,
      "text": " Back in Ephesians, if you will, and look here in Ephesians chapter five, we read that the"
    },
    {
      "id": 90,
      "start": 947.4200134277344,
      "end": 954.9000244140625,
      "text": " Bible teaches us that we're to walk circumspectly, not as fools, but as wise."
    },
    {
      "id": 91,
      "start": 954.9000244140625,
      "end": 960.8600158691406,
      "text": " So in Ephesians five and verse 15, we find that God tells us, as Paul is writing to these"
    },
    {
      "id": 92,
      "start": 960.8600158691406,
      "end": 965.4200134277344,
      "text": " believers in Ephesus, that they're to walk circumspect, they're to be aware of their"
    },
    {
      "id": 93,
      "start": 965.4200134277344,
      "end": 968.9000244140625,
      "text": " surroundings, they're to walk, basically, if you kind of get the idea, with your eyes"
    },
    {
      "id": 94,
      "start": 968.9000244140625,
      "end": 970.8400268554688,
      "text": " wide open."
    },
    {
      "id": 95,
      "start": 970.8400268554688,
      "end": 977.8200073242188,
      "text": " And He says this, He ends the verse, not as fools, but as wise."
    },
    {
      "id": 96,
      "start": 977.8200073242188,
      "end": 981.8600158691406,
      "text": " Notice in the book of James, the Bible tells us a verse that we often quote in the first"
    },
    {
      "id": 97,
      "start": 981.8600158691406,
      "end": 986.3000183105469,
      "text": " chapter, we'll look at James chapter three as well, but notice in James chapter number"
    },
    {
      "id": 98,
      "start": 986.3000183105469,
      "end": 993.02001953125,
      "text": " one, we think about this idea that Jesus walked wisely, and we also, as His people,"
    },
    {
      "id": 99,
      "start": 993.02001953125,
      "end": 998.02001953125,
      "text": " as we understand tonight, we ought to walk as Christ walked, that we need to walk in"
    },
    {
      "id": 100,
      "start": 998.02001953125,
      "end": 1000.260009765625,
      "text": " wisdom, we need to walk wisely."
    },
    {
      "id": 101,
      "start": 1000.260009765625,
      "end": 1004.8600158691406,
      "text": " In James chapter one, the Bible says in verse number five, if any of you lack wisdom, can"
    },
    {
      "id": 102,
      "start": 1004.8600158691406,
      "end": 1008.3800048828125,
      "text": " I tell you this evening, that's all of us."
    },
    {
      "id": 103,
      "start": 1008.3800048828125,
      "end": 1012.9000244140625,
      "text": " You say, no, I'm wise, but we're not all wise."
    },
    {
      "id": 104,
      "start": 1012.9000244140625,
      "end": 1015.1400146484375,
      "text": " We don't know everything."
    },
    {
      "id": 105,
      "start": 1015.1400146484375,
      "end": 1020.1400146484375,
      "text": " And we must acknowledge that as we go through life, that I need God's wisdom."
    },
    {
      "id": 106,
      "start": 1020.1400146484375,
      "end": 1023.8600158691406,
      "text": " I need God's wisdom every day, for every scenario."
    },
    {
      "id": 107,
      "start": 1023.8600158691406,
      "end": 1027.02001953125,
      "text": " There are no two scenarios that are going to ever be identical."
    },
    {
      "id": 108,
      "start": 1027.02001953125,
      "end": 1031.260009765625,
      "text": " And by the way, I want you to remember, when the Philistines came against David and the"
    },
    {
      "id": 109,
      "start": 1031.260009765625,
      "end": 1037.1800231933594,
      "text": " people of God, and David, he goes to God and he says, should I go out against the Philistines?"
    },
    {
      "id": 110,
      "start": 1037.1800231933594,
      "end": 1038.780029296875,
      "text": " And He says, yes, go."
    },
    {
      "id": 111,
      "start": 1038.780029296875,
      "end": 1042.1800231933594,
      "text": " And they defeat the Philistines, and then the Philistines come again, and they, they're"
    },
    {
      "id": 112,
      "start": 1042.1800231933594,
      "end": 1047.3800048828125,
      "text": " going to, you know, regroup and attack again, and God, what does, what does David do?"
    },
    {
      "id": 113,
      "start": 1047.3800048828125,
      "end": 1052.4800109863281,
      "text": " He seeks the face of God, and God says, yes, but not the same way you went last time."
    },
    {
      "id": 114,
      "start": 1052.4800109863281,
      "end": 1057.1400146484375,
      "text": " This time do this, wait for the sound in the mulberry trees, right?"
    },
    {
      "id": 115,
      "start": 1057.1400146484375,
      "end": 1063.3800048828125,
      "text": " And you begin to think, listen, if we just presume upon God and don't seek God for wisdom,"
    },
    {
      "id": 116,
      "start": 1063.3800048828125,
      "end": 1066.1800231933594,
      "text": " we may approach things in our wisdom."
    },
    {
      "id": 117,
      "start": 1066.5800170898438,
      "end": 1072.02001953125,
      "text": " And so when he says, if any of you lack wisdom, notice it says this, let them ask of God that"
    },
    {
      "id": 118,
      "start": 1072.02001953125,
      "end": 1078.1800231933594,
      "text": " giveth to all men liberally, and it braideth not, and it shall be given him."
    },
    {
      "id": 119,
      "start": 1078.1800231933594,
      "end": 1085.9400024414062,
      "text": " Now that's a great promise, absolutely wonderful to know that, okay, I lack wisdom, but I know"
    },
    {
      "id": 120,
      "start": 1085.9400024414062,
      "end": 1093.0600280761719,
      "text": " the all wise God, He's my God, He's my Father, and He said, I will give you wisdom."
    },
    {
      "id": 121,
      "start": 1093.0600280761719,
      "end": 1097.9000244140625,
      "text": " Notice verse number six, it says this, but let him ask how?"
    },
    {
      "id": 122,
      "start": 1097.9000244140625,
      "end": 1100.1000061035156,
      "text": " In faith."
    },
    {
      "id": 123,
      "start": 1100.1000061035156,
      "end": 1105.3800048828125,
      "text": " Nothing wavering, for he that wavereth is like a wave of the sea driven with the wind"
    },
    {
      "id": 124,
      "start": 1105.3800048828125,
      "end": 1106.3800048828125,
      "text": " and tossed."
    },
    {
      "id": 125,
      "start": 1106.3800048828125,
      "end": 1108.9000244140625,
      "text": " And so what does it mean to ask in faith?"
    },
    {
      "id": 126,
      "start": 1108.9000244140625,
      "end": 1113.8200073242188,
      "text": " Believing that God hears and answers prayer, believing that God is the all wise God, believing"
    },
    {
      "id": 127,
      "start": 1113.8200073242188,
      "end": 1122.3800048828125,
      "text": " that God can give me the wisdom that I need for the situation in which I'm facing."
    },
    {
      "id": 128,
      "start": 1122.3800048828125,
      "end": 1125.3400268554688,
      "text": " Rarely people say, pastor, can I meet with you?"
    },
    {
      "id": 129,
      "start": 1125.3400268554688,
      "end": 1128.3400268554688,
      "text": " I'd really like it if people would say, pastor, can I meet with you, and here's what I want"
    },
    {
      "id": 130,
      "start": 1128.3400268554688,
      "end": 1130.0599975585938,
      "text": " to meet about."
    },
    {
      "id": 131,
      "start": 1130.0599975585938,
      "end": 1133.9800415039062,
      "text": " But rarely does that happen, and I'm not saying that it needs to be that way, I'm just saying"
    },
    {
      "id": 132,
      "start": 1133.9800415039062,
      "end": 1139.2999877929688,
      "text": " what happens is I have no idea what that conversation is going to be like."
    },
    {
      "id": 133,
      "start": 1139.2999877929688,
      "end": 1143.02001953125,
      "text": " Man, that helps me ask for wisdom."
    },
    {
      "id": 134,
      "start": 1143.02001953125,
      "end": 1146.5,
      "text": " Because you know, as God, you know what's on their heart, you know what they want to"
    },
    {
      "id": 135,
      "start": 1146.5,
      "end": 1151.8200073242188,
      "text": " talk about, but I have no idea, I have no way of preparing, I have no way, God, I need"
    },
    {
      "id": 136,
      "start": 1151.8200073242188,
      "end": 1154.02001953125,
      "text": " your wisdom."
    },
    {
      "id": 137,
      "start": 1154.02001953125,
      "end": 1156.2999877929688,
      "text": " And I'm thankful that God gives wisdom."
    },
    {
      "id": 138,
      "start": 1156.2999877929688,
      "end": 1159.5800170898438,
      "text": " Notice in chapter three, when we think about the subject of wisdom here in James chapter"
    },
    {
      "id": 139,
      "start": 1159.5800170898438,
      "end": 1164.3400268554688,
      "text": " number three, the Bible says this in verse number 13."
    },
    {
      "id": 140,
      "start": 1164.3400268554688,
      "end": 1167.5,
      "text": " Who is a wise man and endued with knowledge among you?"
    },
    {
      "id": 141,
      "start": 1167.5,
      "end": 1172.5400390625,
      "text": " Let him show of a good conversation his works with meekness of wisdom."
    },
    {
      "id": 142,
      "start": 1172.5400390625,
      "end": 1176.5,
      "text": " But if you have bitter envying and strife in your hearts, glory not, and lie not against"
    },
    {
      "id": 143,
      "start": 1176.5,
      "end": 1177.5,
      "text": " the truth."
    },
    {
      "id": 144,
      "start": 1177.5,
      "end": 1181.8200073242188,
      "text": " But this wisdom descendeth not from above, but is earthly, sensual, devilish."
    },
    {
      "id": 145,
      "start": 1181.8200073242188,
      "end": 1185.9400024414062,
      "text": " For where envying and strife is, there is confusion in every evil work, but the wisdom"
    },
    {
      "id": 146,
      "start": 1185.9400024414062,
      "end": 1191.3800048828125,
      "text": " that is from above is first pure, then peaceable, gentle, and easy to be entreated, full of"
    },
    {
      "id": 147,
      "start": 1191.3800048828125,
      "end": 1196.4200439453125,
      "text": " mercy and good fruits, without partiality and without hypocrisy."
    },
    {
      "id": 148,
      "start": 1196.4200439453125,
      "end": 1200.0599975585938,
      "text": " The fruit of righteousness is sown in peace of them that make peace."
    },
    {
      "id": 0,
      "start": 1200.0599975585938,
      "end": 1204.7799973487854,
      "text": " So we see here, there's this contrast that the wisdom that, notice in verse 15,"
    },
    {
      "id": 1,
      "start": 1204.7799973487854,
      "end": 1209.6599979400635,
      "text": " this wisdom descendeth not from above, but is earthly. And then we see verse 17,"
    },
    {
      "id": 2,
      "start": 1209.6599979400635,
      "end": 1215.6599979400635,
      "text": " but the wisdom that is from above. Listen, we want that heavenly wisdom. We need God's wisdom."
    },
    {
      "id": 3,
      "start": 1217.0199966430664,
      "end": 1222.8599967956543,
      "text": " We find that Jesus, when we consider the thought of 1 John 2, 6, that we ought to walk as Jesus"
    },
    {
      "id": 4,
      "start": 1222.8599967956543,
      "end": 1227.8999977111816,
      "text": " walked, that we understand that we have to go back and find, okay, how did he walk?"
    },
    {
      "id": 5,
      "start": 1228.53999710083,
      "end": 1233.979995727539,
      "text": " Because if I say that I abide in him, and by the way, we are commanded to abide in him,"
    },
    {
      "id": 6,
      "start": 1233.979995727539,
      "end": 1242.6999969482422,
      "text": " so if I'm abiding in him, the evidence that John tells us that he gives us is that he ought to"
    },
    {
      "id": 7,
      "start": 1242.6999969482422,
      "end": 1248.6199989318848,
      "text": " himself also so to walk even as he walked. And so we ought to walk as Christ walked."
    },
    {
      "id": 8,
      "start": 1248.6199989318848,
      "end": 1254.4599990844727,
      "text": " How do I know how Christ walked? Well, thank God for the Gospels. And I go back and I begin to"
    },
    {
      "id": 9,
      "start": 1254.4599990844727,
      "end": 1259.4999961853027,
      "text": " read and study, so we see number one, Jesus walked wisely. Number two, Jesus walked humbly."
    },
    {
      "id": 10,
      "start": 1260.53999710083,
      "end": 1265.7399978637695,
      "text": " The humility of the Lord Jesus Christ is absolutely phenomenal. It's amazing to think"
    },
    {
      "id": 11,
      "start": 1265.7399978637695,
      "end": 1274.6199951171875,
      "text": " about God in flesh. He's eternal. He has no beginning and no end. He's enjoyed the"
    },
    {
      "id": 12,
      "start": 1276.0599975585938,
      "end": 1280.6999969482422,
      "text": " glory of heaven, but he left it to come to this sin-cursed world."
    },
    {
      "id": 13,
      "start": 1281.4199981689453,
      "end": 1286.9399948120117,
      "text": " The humility of the Lord Jesus Christ. And notice, if you will, in Mark chapter 10, again,"
    },
    {
      "id": 14,
      "start": 1286.9399948120117,
      "end": 1292.6999969482422,
      "text": " as we look at the Gospel records to see some evidence with regard to the humility of Jesus"
    },
    {
      "id": 15,
      "start": 1292.6999969482422,
      "end": 1298.1399993896484,
      "text": " Christ, that he walked humbly. We find that he walked wisely. Praise the Lord for the truth of"
    },
    {
      "id": 16,
      "start": 1298.1399993896484,
      "end": 1303.5,
      "text": " that and the admonition that we have to walk also in wisdom. Now we find that he walked humbly. In"
    },
    {
      "id": 17,
      "start": 1303.5,
      "end": 1309.8199996948242,
      "text": " Mark chapter 10, the Bible says this, in verse number 41, it says, and when the ten heard it,"
    },
    {
      "id": 18,
      "start": 1309.8199996948242,
      "end": 1313.7399978637695,
      "text": " they began to be much displeased with James and John. What did they hear? Well, there was some"
    },
    {
      "id": 19,
      "start": 1313.7399978637695,
      "end": 1319.1800003051758,
      "text": " question about a position and so on and so forth back in verse 35. And James and John, the sons of"
    },
    {
      "id": 20,
      "start": 1319.1800003051758,
      "end": 1323.4199981689453,
      "text": " Zebedee, came unto him saying, Master, we would that thou shouldest do for us whatsoever we shall"
    },
    {
      "id": 21,
      "start": 1323.4199981689453,
      "end": 1328.6199951171875,
      "text": " desire. And Jesus says, what would you that I should do for you? In verse 36 and verse 37,"
    },
    {
      "id": 22,
      "start": 1328.6199951171875,
      "end": 1333.1799926757812,
      "text": " they said unto him, grant us that we may sit one on thy right hand and the other on thy left in"
    },
    {
      "id": 23,
      "start": 1333.1799926757812,
      "end": 1339.5800018310547,
      "text": " thy glory. And so the Bible tells us in verse number 41 that the ten heard what James and John"
    },
    {
      "id": 24,
      "start": 1339.5800018310547,
      "end": 1347.0999908447266,
      "text": " were discussing and they were much displeased, but Jesus, verse 42, called them to him and saith"
    },
    {
      "id": 25,
      "start": 1347.0999908447266,
      "end": 1353.4199981689453,
      "text": " unto them, ye know not that ye know, excuse me, ye know that they which are accounted to rule over"
    },
    {
      "id": 26,
      "start": 1353.4199981689453,
      "end": 1360.1399993896484,
      "text": " the Gentiles exercise lordship over them, and their great ones exercise authority upon them,"
    },
    {
      "id": 27,
      "start": 1360.1399993896484,
      "end": 1366.9400024414062,
      "text": " but so shall it not be among you, but whosoever will be great among you shall be your, what's it"
    },
    {
      "id": 28,
      "start": 1366.9400024414062,
      "end": 1374.6999969482422,
      "text": " say? Minister. Minister. You ever see people that think they're above something? I mean, here in"
    },
    {
      "id": 29,
      "start": 1374.6999969482422,
      "end": 1379.5,
      "text": " northern Virginia, you see people every day that think they're above something. Amen? You just get"
    },
    {
      "id": 30,
      "start": 1379.5,
      "end": 1384.2200012207031,
      "text": " out on the road. I mean, I saw a guy, I'm not like, I was just at, you know, this little hairpin turn"
    },
    {
      "id": 31,
      "start": 1384.2200012207031,
      "end": 1388.0599975585938,
      "text": " down here at Waples Mill? I was sitting at the red light just, just the other day, Monday morning,"
    },
    {
      "id": 32,
      "start": 1388.0599975585938,
      "end": 1392.2200012207031,
      "text": " I'm sitting at the red light, and I'm coming down Waples Mill turning right onto Oakton."
    },
    {
      "id": 33,
      "start": 1392.9400024414062,
      "end": 1398.3800048828125,
      "text": " And there's this joker that's going straight, right, on Waples Mill, got a red light, people"
    },
    {
      "id": 34,
      "start": 1398.3800048828125,
      "end": 1401.8199920654297,
      "text": " coming the other way are the ones that have a green light, and he waits and he looks and he"
    },
    {
      "id": 35,
      "start": 1401.8199920654297,
      "end": 1405.8999938964844,
      "text": " just goes, just absolutely blows the red light, because why? He can't, he's, he's privileged."
    },
    {
      "id": 36,
      "start": 1407.6600036621094,
      "end": 1416.6199951171875,
      "text": " It's unbelievable. People got a problem with pride. Seriously. But Jesus says whosoever will"
    },
    {
      "id": 37,
      "start": 1416.6199951171875,
      "end": 1423.4199981689453,
      "text": " be great among you shall be your minister. Notice in verse 44, and whosoever of you will be the"
    },
    {
      "id": 38,
      "start": 1423.4199981689453,
      "end": 1430.1399993896484,
      "text": " chiefest shall be servant of all. You ever meet those kind of people that want the preeminence?"
    },
    {
      "id": 39,
      "start": 1431.0999908447266,
      "end": 1434.8600006103516,
      "text": " They want to, they want all the recognition, they want to be looked at, they want to have the"
    },
    {
      "id": 40,
      "start": 1434.8600006103516,
      "end": 1441.259994506836,
      "text": " chiefest of seats, they want all of that. And Jesus says, listen, whoever here is going to be"
    },
    {
      "id": 41,
      "start": 1441.3399963378906,
      "end": 1447.0999908447266,
      "text": " chiefest shall be servant of all. It reminds me of diatrophies in the book of 3 John. The Bible"
    },
    {
      "id": 42,
      "start": 1447.0999908447266,
      "end": 1455.8199920654297,
      "text": " says that he loveth to have the preeminence. In verse 45, notice the humility of Jesus, because"
    },
    {
      "id": 43,
      "start": 1455.8199920654297,
      "end": 1462.6199951171875,
      "text": " we are mentioning that Jesus walked humbly. Notice in verse 45, for even the Son of Man came not to"
    },
    {
      "id": 44,
      "start": 1462.6199951171875,
      "end": 1469.1000061035156,
      "text": " be ministered unto, but to minister, to give his life a ransom for many. Aren't you thankful for"
    },
    {
      "id": 45,
      "start": 1469.1000061035156,
      "end": 1477.5,
      "text": " that? He came not to be ministered unto, but he came to minister. And oh, how he ministered. Notice"
    },
    {
      "id": 46,
      "start": 1477.5,
      "end": 1483.9800109863281,
      "text": " in John 13, if you will, we see this declaration in Mark 10, but notice in John 13, I mean, this is"
    },
    {
      "id": 47,
      "start": 1483.9800109863281,
      "end": 1489.9800109863281,
      "text": " the passage in which Jesus is washing the feet of the disciples. I mean, it is the lowest of low tasks"
    },
    {
      "id": 48,
      "start": 1491.3399963378906,
      "end": 1498.7000122070312,
      "text": " to wash the feet. It was the, I mean, it was so low, I'm told, as I study and read and those that"
    },
    {
      "id": 49,
      "start": 1499.260009765625,
      "end": 1503.6600036621094,
      "text": " have studied with many years of looking at the culture and what have you,"
    },
    {
      "id": 50,
      "start": 1503.6600036621094,
      "end": 1508.1399841308594,
      "text": " that you weren't even permitted to force a servant to do this task. It was so low."
    },
    {
      "id": 51,
      "start": 1510.7799987792969,
      "end": 1513.6600036621094,
      "text": " And the Bible says in John 13, beginning in verse number 4,"
    },
    {
      "id": 52,
      "start": 1513.6600036621094,
      "end": 1518.8599853515625,
      "text": " he riseth from supper and laid aside his garments and took a towel and girded himself."
    },
    {
      "id": 53,
      "start": 1519.4199829101562,
      "end": 1523.260009765625,
      "text": " After that, he poureth water into a base and began to wash the disciples' feet,"
    },
    {
      "id": 54,
      "start": 1523.260009765625,
      "end": 1533.6600036621094,
      "text": " and to wipe them with the towel wherewith he was girded. Can you imagine? God in flesh,"
    },
    {
      "id": 55,
      "start": 1534.5400085449219,
      "end": 1539.0199890136719,
      "text": " the Lord Jesus Christ. I mean, I think, I hope,"
    },
    {
      "id": 56,
      "start": 1540.7000122070312,
      "end": 1543.8999938964844,
      "text": " that some of us would probably respond the way that Peter did."
    },
    {
      "id": 57,
      "start": 1544.2200012207031,
      "end": 1553.5,
      "text": " Jesus, you're my master. You're my Lord. You're going to wash my feet?"
    },
    {
      "id": 58,
      "start": 1557.3399963378906,
      "end": 1560.7000122070312,
      "text": " Verse 6, then cometh he to Simon Peter, and Peter saith unto him, Lord,"
    },
    {
      "id": 59,
      "start": 1561.5799865722656,
      "end": 1567.739990234375,
      "text": " dost thou wash my feet? Jesus answered and said unto him, What I do thou knowest not now,"
    },
    {
      "id": 60,
      "start": 1567.739990234375,
      "end": 1573.260009765625,
      "text": " but thou shalt know hereafter. Peter saith unto him, Thou shalt never wash my feet."
    },
    {
      "id": 61,
      "start": 1573.260009765625,
      "end": 1579.260009765625,
      "text": " I mean, can you understand why Peter's saying this? Peter lived in the culture. Peter understood."
    },
    {
      "id": 62,
      "start": 1580.5400085449219,
      "end": 1586.0599975585938,
      "text": " And he knew who, listen, this is Peter that when Jesus said, Peter, all the disciples were there,"
    },
    {
      "id": 63,
      "start": 1586.0599975585938,
      "end": 1590.7799987792969,
      "text": " but Peter's the one that answers. He says to all of them, and only Peter answers, says,"
    },
    {
      "id": 64,
      "start": 1590.7799987792969,
      "end": 1596.4599914550781,
      "text": " Whom do men say that I am? Well, some say John the Baptist, some say one of the other prophets,"
    },
    {
      "id": 65,
      "start": 1596.4599914550781,
      "end": 1603.4199829101562,
      "text": " Elijah, Jeremiah, whatever. But whom say ye that I am? And Peter says, Thou art the Christ,"
    },
    {
      "id": 66,
      "start": 1603.9800109863281,
      "end": 1609.739990234375,
      "text": " the Son of the living God. And now he's going to wash his feet."
    },
    {
      "id": 67,
      "start": 1612.9400024414062,
      "end": 1617.8200073242188,
      "text": " I understand why Peter would say, Thou shalt never wash my feet."
    },
    {
      "id": 68,
      "start": 1619.6600036621094,
      "end": 1624.5400085449219,
      "text": " Jesus said, If I wash thee not, thou hast no part with me. Then Peter changes. I mean,"
    },
    {
      "id": 69,
      "start": 1624.5400085449219,
      "end": 1629.5,
      "text": " 180-degree turn here. He saith unto him, Lord, not my feet only, but also my hands and my head."
    },
    {
      "id": 70,
      "start": 1631.0199890136719,
      "end": 1635.5799865722656,
      "text": " Because when Jesus said, You have no part with me, he's like, I'm all in. I get it."
    },
    {
      "id": 71,
      "start": 1637.1000061035156,
      "end": 1641.3399963378906,
      "text": " Verse 10, Jesus saith unto him, He that is washed, he is not to say to wash his feet,"
    },
    {
      "id": 72,
      "start": 1641.3399963378906,
      "end": 1645.5,
      "text": " but is clean every whip, and ye are clean, but not all. Of course, he's speaking of Judas,"
    },
    {
      "id": 73,
      "start": 1645.5,
      "end": 1649.3399963378906,
      "text": " but it says in verse 11, For he knew who should betray him, therefore said he,"
    },
    {
      "id": 74,
      "start": 1649.3399963378906,
      "end": 1653.8200073242188,
      "text": " ye are not all clean. So after he had washed their feet and had taken his garments and was"
    },
    {
      "id": 75,
      "start": 1653.8200073242188,
      "end": 1659.260009765625,
      "text": " set down again, he said unto them, Know ye what I have done to you? Ye call me master and lord."
    },
    {
      "id": 76,
      "start": 1660.0599975585938,
      "end": 1666.3800048828125,
      "text": " Notice this, and ye say, Well, for so I am. He is master and he is lord."
    },
    {
      "id": 77,
      "start": 1668.3800048828125,
      "end": 1673.739990234375,
      "text": " If I then, your lord and master, have washed your feet, ye also ought to wash one another's feet."
    },
    {
      "id": 78,
      "start": 1674.4599914550781,
      "end": 1681.5799865722656,
      "text": " What humility that Jesus gave. Listen, the people of God should be humble. We should walk humbly."
    },
    {
      "id": 79,
      "start": 1681.9800109863281,
      "end": 1686.8599853515625,
      "text": " Notice, if you will, in Philippians chapter 2, a favorite passage of scripture."
    },
    {
      "id": 80,
      "start": 1688.1399841308594,
      "end": 1693.5799865722656,
      "text": " Philippians chapter 2 begins in verse number 5 by saying, Let this mind be in you which was also"
    },
    {
      "id": 81,
      "start": 1693.5799865722656,
      "end": 1703.739990234375,
      "text": " in Christ Jesus. Begin to see this unfolding truth in Philippians chapter 2, and the example"
    },
    {
      "id": 82,
      "start": 1704.7000122070312,
      "end": 1710.2200012207031,
      "text": " of humility of our Lord and Savior is just amazing here. Such a"
    },
    {
      "id": 83,
      "start": 1714.1400146484375,
      "end": 1719.739990234375,
      "text": " wonderful passage of scripture. It says, Let this mind be in you which was also in Christ Jesus."
    },
    {
      "id": 84,
      "start": 1719.739990234375,
      "end": 1723.9000244140625,
      "text": " Notice verse 6, Who being in the form of God, thought it not, Robert, to be equal with God,"
    },
    {
      "id": 85,
      "start": 1723.9000244140625,
      "end": 1730.2999877929688,
      "text": " but made himself of no reputation, and took upon him the form of a servant, and was made in the"
    },
    {
      "id": 86,
      "start": 1730.2999877929688,
      "end": 1738.7000122070312,
      "text": " likeness of men. Being found in fashion as a man, he humbled himself, became obedient unto death,"
    },
    {
      "id": 87,
      "start": 1738.7000122070312,
      "end": 1743.739990234375,
      "text": " even the death of the cross. It's interesting, in verse number 7, the Bible says, But he made"
    },
    {
      "id": 88,
      "start": 1743.739990234375,
      "end": 1748.5399780273438,
      "text": " himself of no reputation. You know, a lot of people today are trying to make a reputation"
    },
    {
      "id": 89,
      "start": 1748.5399780273438,
      "end": 1754.1400146484375,
      "text": " for themselves. Jesus is God. He's the master. He owns everything. He created it all."
    },
    {
      "id": 90,
      "start": 1755.0999755859375,
      "end": 1763.0999755859375,
      "text": " And he made himself of no reputation. He walked humbly. Oh, that God's people would walk humbly."
    },
    {
      "id": 91,
      "start": 1764.7000122070312,
      "end": 1772.9400024414062,
      "text": " We're aware of in our society, unfortunately, they've hijacked a month of our calendar,"
    },
    {
      "id": 92,
      "start": 1772.9400024414062,
      "end": 1778.2999877929688,
      "text": " and they've called it Pride Month. I have a pastor friend, some of you know him, Mark"
    },
    {
      "id": 93,
      "start": 1778.5399780273438,
      "end": 1785.8200073242188,
      "text": " DeLoach. And Brother DeLoach determined this year that in his church in the month of June,"
    },
    {
      "id": 94,
      "start": 1785.8200073242188,
      "end": 1794.3800048828125,
      "text": " it was going to be called Humility Month. And every single Sunday, my understanding is that"
    },
    {
      "id": 95,
      "start": 1794.3800048828125,
      "end": 1799.9000244140625,
      "text": " he was planning to preach on the subject matter of how we as God's people are to walk in humility."
    },
    {
      "id": 0,
      "start": 1799.9000244140625,
      "end": 1803.340024471283,
      "text": " because God resisteth the proud.\""
    },
    {
      "id": 1,
      "start": 1803.340024471283,
      "end": 1806.460024356842,
      "text": " If we're not careful, we can be prideful."
    },
    {
      "id": 2,
      "start": 1806.460024356842,
      "end": 1808.5400247573853,
      "text": " We can be prideful."
    },
    {
      "id": 3,
      "start": 1808.5400247573853,
      "end": 1811.9000244140625,
      "text": " We find that for us here in Philippians chapter 2,"
    },
    {
      "id": 4,
      "start": 1811.9000244140625,
      "end": 1814.7800245285034,
      "text": " we see the example of Christ in verses 5 through 8."
    },
    {
      "id": 5,
      "start": 1814.7800245285034,
      "end": 1816.780023574829,
      "text": " Notice, if you will, just a few verses before."
    },
    {
      "id": 6,
      "start": 1816.780023574829,
      "end": 1819.9000244140625,
      "text": " Before Paul gives the example of great humility,"
    },
    {
      "id": 7,
      "start": 1819.9000244140625,
      "end": 1823.7400245666504,
      "text": " he gives to the people at Philippi this instruction."
    },
    {
      "id": 8,
      "start": 1823.7400245666504,
      "end": 1825.100025177002,
      "text": " In verse number 3, he says,"
    },
    {
      "id": 9,
      "start": 1825.100025177002,
      "end": 1828.9400253295898,
      "text": " \"'Let nothing be done through strife or vainglory,"
    },
    {
      "id": 10,
      "start": 1828.9400253295898,
      "end": 1830.620023727417,
      "text": " but in lowliness of mind,"
    },
    {
      "id": 11,
      "start": 1830.620023727417,
      "end": 1832.7800254821777,
      "text": " let each esteem other better than themselves."
    },
    {
      "id": 12,
      "start": 1833.5000228881836,
      "end": 1835.6600227355957,
      "text": " Look not every man on his own things,"
    },
    {
      "id": 13,
      "start": 1835.6600227355957,
      "end": 1837.5800247192383,
      "text": " but every man also on the things of others.'\""
    },
    {
      "id": 14,
      "start": 1838.8600234985352,
      "end": 1841.9000244140625,
      "text": " And then he gives the example of the Lord Jesus Christ."
    },
    {
      "id": 15,
      "start": 1841.9000244140625,
      "end": 1843.9800262451172,
      "text": " And the reality, when he says in verse 3,"
    },
    {
      "id": 16,
      "start": 1843.9800262451172,
      "end": 1846.6200256347656,
      "text": " \"'Let nothing be done through strife and vainglory,'"
    },
    {
      "id": 17,
      "start": 1846.6200256347656,
      "end": 1848.0600242614746,
      "text": " where does the strife come from?"
    },
    {
      "id": 18,
      "start": 1848.0600242614746,
      "end": 1849.9000244140625,
      "text": " Well, the Bible tells us in the book of Proverbs"
    },
    {
      "id": 19,
      "start": 1849.9000244140625,
      "end": 1853.9800262451172,
      "text": " that by pride cometh contention, contention and strife."
    },
    {
      "id": 20,
      "start": 1854.0600242614746,
      "end": 1857.6600227355957,
      "text": " And we find that it says, but in lowliness of mind.\""
    },
    {
      "id": 21,
      "start": 1858.6200256347656,
      "end": 1863.3400230407715,
      "text": " It's not necessarily having a low self-esteem."
    },
    {
      "id": 22,
      "start": 1863.3400230407715,
      "end": 1865.660026550293,
      "text": " It's not that idea of getting caught up"
    },
    {
      "id": 23,
      "start": 1865.660026550293,
      "end": 1871.0200271606445,
      "text": " into this psychology area of things in our society."
    },
    {
      "id": 24,
      "start": 1871.0200271606445,
      "end": 1873.9800262451172,
      "text": " No, it's just recognizing how great our God is."
    },
    {
      "id": 25,
      "start": 1874.8600234985352,
      "end": 1876.6200256347656,
      "text": " Because really, if we're going to deal"
    },
    {
      "id": 26,
      "start": 1876.6200256347656,
      "end": 1878.540023803711,
      "text": " with the subject of walking humbly,"
    },
    {
      "id": 27,
      "start": 1878.540023803711,
      "end": 1882.540023803711,
      "text": " if we're going to walk in humility as the people of God,"
    },
    {
      "id": 28,
      "start": 1882.540023803711,
      "end": 1885.5000228881836,
      "text": " the best way for us to do that is really just get our eyes on God"
    },
    {
      "id": 29,
      "start": 1885.5000228881836,
      "end": 1886.6200256347656,
      "text": " and see how great He is."
    },
    {
      "id": 30,
      "start": 1887.260025024414,
      "end": 1892.4600219726562,
      "text": " And then we recognize how blessed we are,"
    },
    {
      "id": 31,
      "start": 1893.9000244140625,
      "end": 1899.260025024414,
      "text": " that He would even love us, hear us, save us."
    },
    {
      "id": 32,
      "start": 1899.260025024414,
      "end": 1899.9000244140625,
      "text": " It's amazing."
    },
    {
      "id": 33,
      "start": 1901.660026550293,
      "end": 1903.5800247192383,
      "text": " We find this evening in the book of James,"
    },
    {
      "id": 34,
      "start": 1904.380027770996,
      "end": 1907.1000213623047,
      "text": " we'll finish and wrap up here in James chapter 4."
    },
    {
      "id": 35,
      "start": 1909.3400268554688,
      "end": 1911.1800231933594,
      "text": " We see it in 1 Peter as well,"
    },
    {
      "id": 36,
      "start": 1911.1800231933594,
      "end": 1912.7800216674805,
      "text": " but this instruction for us,"
    },
    {
      "id": 37,
      "start": 1912.7800216674805,
      "end": 1916.7000274658203,
      "text": " we find that we're to walk, we ought to walk as Christ walked."
    },
    {
      "id": 38,
      "start": 1916.7000274658203,
      "end": 1917.9800262451172,
      "text": " Well, how did Christ walk?"
    },
    {
      "id": 39,
      "start": 1917.9800262451172,
      "end": 1919.7400207519531,
      "text": " Well, He walked wisely."
    },
    {
      "id": 40,
      "start": 1919.7400207519531,
      "end": 1922.0600280761719,
      "text": " All right, we also are to walk wisely."
    },
    {
      "id": 41,
      "start": 1922.0600280761719,
      "end": 1925.660026550293,
      "text": " And by the way, it's not with the earthly wisdom,"
    },
    {
      "id": 42,
      "start": 1925.660026550293,
      "end": 1926.9400253295898,
      "text": " it's with the heavenly wisdom."
    },
    {
      "id": 43,
      "start": 1926.9400253295898,
      "end": 1928.6200256347656,
      "text": " It's with God's wisdom."
    },
    {
      "id": 44,
      "start": 1928.6200256347656,
      "end": 1930.0600280761719,
      "text": " He's the all wise God."
    },
    {
      "id": 45,
      "start": 1930.0600280761719,
      "end": 1931.6600189208984,
      "text": " Well, Jesus walked humbly."
    },
    {
      "id": 46,
      "start": 1931.6600189208984,
      "end": 1933.8200225830078,
      "text": " Okay, we too are to walk humbly."
    },
    {
      "id": 47,
      "start": 1933.8200225830078,
      "end": 1935.5000305175781,
      "text": " We're to walk in humility."
    },
    {
      "id": 48,
      "start": 1935.5000305175781,
      "end": 1937.7400207519531,
      "text": " Notice the truth of James 4 in verse number 6."
    },
    {
      "id": 49,
      "start": 1937.7400207519531,
      "end": 1939.5000305175781,
      "text": " The Bible says, but He giveth more grace."
    },
    {
      "id": 50,
      "start": 1939.5000305175781,
      "end": 1941.9800262451172,
      "text": " By the way, aren't you thankful for God's grace?"
    },
    {
      "id": 51,
      "start": 1943.260025024414,
      "end": 1945.3400268554688,
      "text": " It says this, wherefore He saith,"
    },
    {
      "id": 52,
      "start": 1945.3400268554688,
      "end": 1951.5800170898438,
      "text": " God resisteth the proud, but giveth grace unto the humble."
    },
    {
      "id": 53,
      "start": 1953.7400207519531,
      "end": 1961.1800231933594,
      "text": " Sometimes I wonder if we really allow the significance"
    },
    {
      "id": 54,
      "start": 1961.1800231933594,
      "end": 1963.9000244140625,
      "text": " of this verse of Scripture to really permeate our minds,"
    },
    {
      "id": 55,
      "start": 1965.02001953125,
      "end": 1968.4600219726562,
      "text": " that God resisteth the proud."
    },
    {
      "id": 56,
      "start": 1969.7400207519531,
      "end": 1971.4200286865234,
      "text": " You know, God hates pride."
    },
    {
      "id": 57,
      "start": 1973.5000305175781,
      "end": 1974.540023803711,
      "text": " He hates pride."
    },
    {
      "id": 58,
      "start": 1976.2200317382812,
      "end": 1980.9400177001953,
      "text": " You know, the enemy, Satan, Lucifer, it was pride."
    },
    {
      "id": 59,
      "start": 1981.5800170898438,
      "end": 1985.02001953125,
      "text": " I will be like, it was pride."
    },
    {
      "id": 60,
      "start": 1985.5800170898438,
      "end": 1986.780029296875,
      "text": " God says, I hate pride."
    },
    {
      "id": 61,
      "start": 1988.3800201416016,
      "end": 1993.260025024414,
      "text": " He says, He resisteth the proud, but He gives grace unto the humble."
    },
    {
      "id": 62,
      "start": 1994.1400299072266,
      "end": 1996.9400177001953,
      "text": " You know, sometimes it's really easy to become prideful."
    },
    {
      "id": 63,
      "start": 1996.9400177001953,
      "end": 1999.4200286865234,
      "text": " It really is."
    },
    {
      "id": 64,
      "start": 2001.02001953125,
      "end": 2004.7000274658203,
      "text": " The best way I have found to keep our feet on the ground"
    },
    {
      "id": 65,
      "start": 2004.7000274658203,
      "end": 2009.5800170898438,
      "text": " and keep a proper perspective is to keep our eyes on Jesus."
    },
    {
      "id": 66,
      "start": 2010.7000274658203,
      "end": 2013.6600189208984,
      "text": " We keep our eyes on Jesus and it will help us to walk humbly."
    },
    {
      "id": 67,
      "start": 2014.780029296875,
      "end": 2017.260025024414,
      "text": " This evening, we see this truth."
    },
    {
      "id": 68,
      "start": 2017.9000244140625,
      "end": 2020.7000274658203,
      "text": " We ought to walk as Christ walked."
    },
    {
      "id": 69,
      "start": 2021.9000244140625,
      "end": 2023.7400207519531,
      "text": " How do I know if I'm walking like Christ?"
    },
    {
      "id": 70,
      "start": 2023.7400207519531,
      "end": 2025.9000244140625,
      "text": " Well, I go to the Gospels, I begin to study."
    },
    {
      "id": 71,
      "start": 2026.6200256347656,
      "end": 2028.6200256347656,
      "text": " Tonight, two simple thoughts."
    },
    {
      "id": 72,
      "start": 2028.6200256347656,
      "end": 2029.7400207519531,
      "text": " We'll continue next week."
    },
    {
      "id": 73,
      "start": 2030.3800201416016,
      "end": 2031.260025024414,
      "text": " Walk wisely."
    },
    {
      "id": 74,
      "start": 2031.8200225830078,
      "end": 2032.8600311279297,
      "text": " How are we doing with that?"
    },
    {
      "id": 75,
      "start": 2032.8600311279297,
      "end": 2034.4600219726562,
      "text": " Are we walking in wisdom?"
    },
    {
      "id": 76,
      "start": 2034.4600219726562,
      "end": 2036.1400299072266,
      "text": " Do we have God's wisdom?"
    },
    {
      "id": 77,
      "start": 2036.1400299072266,
      "end": 2037.9000244140625,
      "text": " Are we seeking for God's wisdom?"
    },
    {
      "id": 78,
      "start": 2037.9000244140625,
      "end": 2039.9000244140625,
      "text": " Are we asking for God's wisdom?"
    },
    {
      "id": 79,
      "start": 2039.9000244140625,
      "end": 2042.6200256347656,
      "text": " Do we even acknowledge that we need God's wisdom?"
    },
    {
      "id": 80,
      "start": 2043.6600189208984,
      "end": 2044.9400177001953,
      "text": " Are we walking humbly?"
    },
    {
      "id": 81,
      "start": 2045.9800262451172,
      "end": 2051.260025024414,
      "text": " Are we walking as God walked?"
    },
    {
      "id": 82,
      "start": 2051.820022583008,
      "end": 2054.060028076172,
      "text": " The Bible tells us this in 2 Corinthians."
    },
    {
      "id": 83,
      "start": 2054.060028076172,
      "end": 2058.060028076172,
      "text": " I'm just reminded of the depth of this verse of Scripture."
    },
    {
      "id": 84,
      "start": 2058.060028076172,
      "end": 2060.2200317382812,
      "text": " And in 2 Corinthians 8 and verse 9,"
    },
    {
      "id": 85,
      "start": 2060.2200317382812,
      "end": 2062.3800354003906,
      "text": " for you know the grace of our Lord Jesus Christ,"
    },
    {
      "id": 86,
      "start": 2062.3800354003906,
      "end": 2065.4200134277344,
      "text": " that though he was rich, yet for your sakes he became poor,"
    },
    {
      "id": 87,
      "start": 2065.4200134277344,
      "end": 2067.9000244140625,
      "text": " that you through his poverty might be rich."
    },
    {
      "id": 88,
      "start": 2068.7000122070312,
      "end": 2070.780029296875,
      "text": " Wow, what a great truth."
    },
    {
      "id": 89,
      "start": 2072.8600158691406,
      "end": 2075.5800170898438,
      "text": " This evening, we'll walk humbly."
    },
    {
      "id": 90,
      "start": 2075.5800170898438,
      "end": 2079.4200134277344,
      "text": " We can't get prideful about, I got the right position."
    },
    {
      "id": 91,
      "start": 2079.4200134277344,
      "end": 2082.9400329589844,
      "text": " I got the right, no, no, no, don't get prideful."
    },
    {
      "id": 92,
      "start": 2082.9400329589844,
      "end": 2085.740020751953,
      "text": " We are blessed to have been given a Bible,"
    },
    {
      "id": 93,
      "start": 2086.300018310547,
      "end": 2088.300018310547,
      "text": " to have been exposed to the truth of God's word."
    },
    {
      "id": 94,
      "start": 2090.780029296875,
      "end": 2092.2200317382812,
      "text": " And because we've been blessed,"
    },
    {
      "id": 95,
      "start": 2092.2200317382812,
      "end": 2094.7000122070312,
      "text": " it's not so that we'd respond in being prideful,"
    },
    {
      "id": 96,
      "start": 2094.7000122070312,
      "end": 2096.4600219726562,
      "text": " it's that we'd understand we're accountable."
    },
    {
      "id": 97,
      "start": 2097.4200134277344,
      "end": 2100.5400390625,
      "text": " Because to whom much has been given, much is required."
    },
    {
      "id": 98,
      "start": 2101.1800231933594,
      "end": 2104.3800354003906,
      "text": " Can I say this evening, we've been given much, really have."
    },
    {
      "id": 99,
      "start": 2105.4200134277344,
      "end": 2106.780029296875,
      "text": " And much is required."
    },
    {
      "id": 100,
      "start": 2106.780029296875,
      "end": 2108.1400146484375,
      "text": " Let's walk in wisdom."
    },
    {
      "id": 101,
      "start": 2108.1400146484375,
      "end": 2112.1400146484375,
      "text": " Let's walk in humility as we seek to walk as Christ walked."
    },
    {
      "id": 102,
      "start": 2112.1400146484375,
      "end": 2112.780029296875,
      "text": " Let's pray together."
    },
    {
      "id": 103,
      "start": 2112.780029296875,
      "end": 2113.980010986328,
      "text": " Father, we love you."
    },
    {
      "id": 104,
      "start": 2113.980010986328,
      "end": 2115.1000366210938,
      "text": " Thank you for loving us."
    },
    {
      "id": 105,
      "start": 2115.1000366210938,
      "end": 2116.4600219726562,
      "text": " Thank you for the blessings."
    },
    {
      "id": 106,
      "start": 2116.4600219726562,
      "end": 2118.7000122070312,
      "text": " Thank you for the truth of your word."
    },
    {
      "id": 107,
      "start": 2118.7000122070312,
      "end": 2122.2200317382812,
      "text": " I pray God that you'd help us to walk as Christ walked."
    },
    {
      "id": 108,
      "start": 2122.9400329589844,
      "end": 2124.8600158691406,
      "text": " I pray that we'd live our lives in such a way"
    },
    {
      "id": 109,
      "start": 2124.8600158691406,
      "end": 2126.6200256347656,
      "text": " that you'd be pleased, honored, and glorified."
    },
    {
      "id": 110,
      "start": 2126.6200256347656,
      "end": 2127.9000244140625,
      "text": " Bless our time of prayer."
    },
    {
      "id": 111,
      "start": 2127.9000244140625,
      "end": 2130.8600158691406,
      "text": " I pray that you'd be glorified for it's in Christ's name we pray."
    },
    {
      "id": 112,
      "start": 2130.8600158691406,
      "end": 2131.820037841797,
      "text": " Amen."
    },
    {
      "id": 113,
      "start": 2131.820037841797,
      "end": 2133.1000366210938,
      "text": " All right, start on the back of the prayer."
    }
  ],
  "processed_at": "2025-04-14T22:17:03.107226"
}