{
  "video_id": "XXBT17UK3Ck",
  "text": "which Deborah was singing from, thou wilt keep him in perfect peace whose mind is stayed on thee because he trusteth in thee. And then verse number four says this, trust ye in the Lord forever, for in the Lord Jehovah is everlasting strength. Aren't you thankful? The God that we serve, he is the Lord God Almighty, El Shaddai, and he has all power, and we ought to trust him, amen? And what a blessing. And I'm so thankful for that song and that reminder. Hebrews chapter number 10, I'll be looking at verses one through 18 this morning. Hebrews chapter number 10, verses one through 18. I'm gonna read verse one and verse 12, and then we'll get into the message this morning. The Bible says in verse number one of Hebrews 10, for the law, having a shadow of good things to come, and not the very image of the things, can never, with those sacrifices which they offered year by year continually, make the comers thereunto perfect. And verse number 12 says, but this man, speaking of the Lord Jesus Christ, our great high priest, after he had offered one sacrifice for sins forever, sat down on the right hand of God. I wanna preach a message this morning that I've adopted the title from verse number 12, one sacrifice for sins forever. The discussion on the superiority of the Lord Jesus Christ and the priesthood of Christ in particular over these last several chapters of the book of Hebrews is coming to a conclusion. We, of course, understood as we started in chapter number five of Hebrews how that this subject matter of the priesthood of the Lord Jesus Christ and how his priesthood is superior to that of the Aaronic priesthood, that discussion began in chapter number five. We find that the writer of Hebrews presented the Lord Jesus Christ as being the fulfillment of Old Testament prophecy. In fact, many times throughout the book of Hebrews, even as we find this morning in our text of scripture, the writer will reference the Old Testament and he'll show how that the Lord Jesus Christ is the fulfillment of that particular prophecy. Of course, in line with what was being dealt with in chapter number five and discussed often was the prophecy from Psalm 110, that messianic psalm that the truth, my son, today have I begotten thee in Psalm two, but then in Psalm 100, thou art a priest forever, sorry, Psalm 110, after the order of Melchizedek. And we find that the writer of Hebrews presented the Lord Jesus Christ as being the fulfillment of this Old Testament prophecy. And then he has spent the next several chapters into chapter number 10 that we're studying here this morning to prove that Christ is superior. We have found, as we've studied through these chapters, that his priesthood is after the order of Melchizedek. Of course, that was the reference in Psalm 110, and we find the fulfillment in Hebrews five, the reference to that. And of course, as we studied through, remember chapter five, he had to have that moment of giving a warning because he said the things that he had to utter, that they were hard to utter, seeing you're dull of hearing, and then he gave a warning. But we find in chapter number seven of the book of Hebrews, he deals with that of Melchizedek and the fulfillment of that messianic prophecy in Psalm 110. We find that the Lord Jesus Christ, he passed through the heavens, not simply through the veil. We find that the Lord Jesus Christ, that his offering was for sin, the sin of the world, but it was not for his own sin. Remember, the priest, as he would make an offering, he first had to make an offering for his own sin, then for the sin of the people. But our Savior is perfect. He has no sin, had no sin. He is pure and just and righteous. And so we find, as we spoke about the superiority of the Lord Jesus Christ, our great high priest, we mentioned that truth. We find that he conquered death and lives forever. Remember, the priesthood in the Old Testament, there would be a time that the high priest would die. And then it would be the next person that would be in line to assume that title of being high priest. But we find that the Lord Jesus Christ, he conquered death, he rose from the dead, and he lives forevermore. He made one offering for sin forever. And we see that once again in focus here in Hebrews chapter number 10, these first 18 verses. And let's dig in. Look, if you're taking notes this morning, look at the first four verses. Number one this morning, the remembrance of sin. The remembrance of sin. Once again, we find that the Old Testament sacrificial system is in full view. The Bible begins by saying this in verse number one, as I read already, for the law, having a shadow of good things to come. And we've spoken often throughout this section of the book of Hebrews how the typologies and how that the Old Testament type is now presented in full view of the person of Jesus Christ. And we find that it says that it was a shadow of good things to come. And then notice this phrase, and not the very image of the things. It then says this, can never, never, can never. Amen, that's a pretty absolute statement, is it not? Can never, with those sacrifices which they offered year by year continually, make the comers thereunto perfect. But notice the natural conclusion that you would come to in verse number two when you look at the reality of what's being presented. It says this, in verse number two, the first statement, it's a question, it says, for then, would they not have ceased to be offered? In other words, if that Old Testament sacrificial system could make the comers thereunto perfect, if it was sufficient, then it would cease. It wouldn't have to continue to be done every day. And then of course, as the day of atonement comes in full view, we find annually. Remember, we mentioned on the day of atonement as we've studied the ninth chapter of the book of Hebrews how the high priest would go in, and he would go in once to offer for his own sin, and then he would come out, and then he would go in a second time to offer for the sin of the people, and we find that that then would have to be repeated annually on the day of atonement. We find that here, the natural conclusion that we come to in the writer's offering as of the question, would not it have ceased to be offered if it was possible to bring life, if it was possible to atone for sins, to make that sacrifice that would be sufficient forever, then it would cease. But the reality is that it was a picture. It was a type. And there was a remembrance of sin. You see in verse number three, the Bible says, well, let me finish verse number two, because that the worshipers once purged, notice, should have had no more conscience of sins. But in those sacrifices, there is a remembrance again, made of sins every year. The day of atonement was an important day in the nation of Israel's history on their calendar annually. And we find that again, even as we read in verse number 12 and in verse number 11 that proceeds that, talks about the fact that the priest standeth daily ministering and offering oftentimes the same sacrifices which can never take away sins. And we find that there was a remembrance of sins. There was no remission. And we'll get to that in just a moment. There was a constant remembrance of sin. And we find that the nation of Israel, the reality is that this is the plan that God put in place. He gave this sacrificial system and it would point to Messiah that would come. You understand that Paul says it this way in the book of Galatians, that when the fullness of time was come, God sent forth his son to be born of a virgin. But we find that as Paul continues dealing with that subject matter in the book of Galatians, and we often will view that passage of scripture, we find that he continues. He doesn't just speak about the incarnation, that he came, he was made of a woman, made under the law. And then verse number five of Galatians four says this, to redeem them that were under the law, that we might receive the adoption of sons. And so when the fullness of time was come, at the exact perfect time, God sent forth his son. And he sent them forth for a purpose and that purpose was to die to redeem mankind. And so all of that Old Testament sacrificial system, it's pointing to Messiah who would come. And we find that the Bible continues in verse number four again, for it is not possible that the blood of bulls and of goats should take away sins. Now listen, for us in 2020, if you've been around church long enough, this is common knowledge for us, right? Think about the Israelite, think about this one that's Jewish, that is being written to these initial recipients and think about the change that has happened because of Calvary. Prior to Calvary, it was appropriate for them to go and make these offerings, right? And so depending on your age, how old you were at the time of Calvary, all of those years before Calvary, this is what you did. This was your form of worship. You went to the temple, you were mindful of this regularly. And now we find that Jesus has come, he has settled the subject matter of sin. We dealt with that in chapter number nine last Sunday morning, he has settled it. And so now no longer do we bring those offerings. And we find that the writer is saying to these individuals, he's saying, it's not possible that the blood of. bulls and of goats should take away sins and we say amen hallelujah we know that again consider the initial recipients of the book they're being confronted with this truth and again what's happening is this thought of being pulled back into Judaism and all that's taking place at this particular era for these believers we find that the the book of Hebrews is written to show that Christ is far better don't return to that system that system is inefficient it cannot it's inadequate a better word it's inadequate it cannot cover sins it cannot atone for your sins there is a remembrance of sin we find that there in verse number four when it talks about the blood of bulls and of goats should take away sins and of course again as you look at verses three and four what's in full view as we found in chapter number nine and verse number seven was that specific day of atonement again we mentioned that if you stand back and look in Leviticus chapter number 16 and understand all of the details surrounding that which would be done on that particular day and it was an important day for the nation of Israel but we find that here the writer is is making it crystal clear he's coming to a natural conclusion of all that he's presented really coming to a climatic point if you will and he's saying it's that's not possible it's any it's inadequate it's not going to work in verse 311 it says every priest standeth daily ministering and offering oftentimes the same sacrifices again he says this which can never take away sins so we see there's a remembrance of sins Galatians 2 actually we'll go to Galatians 2 in just a moment let me look at Galatians 3 let me share these verses with you in verse 21 and 22 in Galatians chapter number 3 and we find here that the Apostle Paul is dealing in giving truth with regard to the law and he says this in verse 21 and 22 of Galatians 3 he says is the law then against the promises of God God forbid for if it had been a law given which could have given life verily righteousness should have been by the law but the scripture hath concluded all under sin that the promise by faith of Jesus Christ might be given to them that believe remember in verse 24 of this same text the Bible says that the law was our schoolmaster to bring us unto Christ that we might be justified by faith and we're mindful of the truth that the the law condemns the law shows us that we're insufficient in fact the Apostle Paul says that he had not known sin but by the law in Romans chapter number 7 he says for I had not known lust except the law had said thou shalt not covet and so he's showing how that the law brings us to Christ and shows us our need of a Savior but in this Old Testament sacrificial system that is in view these sacrifices that are mentioned in verse number one which they offered year by year continually they could not make the comers there unto perfect there was a remembrance of sins number two the remission of sins as we get into verses 5 through 18 we see this glorious truth with regard to the remission of sins the word remission means forgiveness or pardon of sins and literally carries the idea to let them go as if they had never even been committed and it wonderful to have remission to be pardoned to be forgiven what a joy we of course understand in the Old Testament there's many times in which we reference the grace and mercy of God but even finding within the Old Testament how that the psalmist would cry out that with thee there is forgiveness I think about the prayers of Ezra and he mentions how that our God is a God who is ready to pardon and that wonderful he's ready to forgive with him there is forgiveness as we look at verses 5 through 18 and we begin to consider the subject matter of the remission of sins we find here that really there is a plan in verses 5 through 9 if we break up the section you notice first of all the plan and again the writer of Hebrews will go back to the Old Testament and it's a reference to Psalm 40 verses 6 through 8 and as he references that Old Testament passage again as his as his custom has been throughout the book of Hebrews he'll present this truth and he'll show that Messiah the Lord Jesus Christ is the fulfillment so notice in verse number 5 the Bible says wherefore when he cometh into the world he saith sacrifice an offering thou wouldest not but a body hast thou prepared me in burnt offerings and sacrifices for sin thou hast had no pleasure then said I lo I come in the volume of the book it is written of me to do thy will Oh God we think often in the book of John as we hear the subject matter of his hour and we consider how that in John chapter number two really the first reference of his hour at the the miracle there at the marriage at Cana and he says mine hour is not yet come and you see multiple references to the hour throughout the book of John and it comes to a great truth in John chapter number 17 when Jesus is praying and he says father the hour is come and we find that the truth that we see in Hebrews 10 in verse number 70 says then said I lo I come in the volume of the book it is written of me to do thy will Oh God we understand the plan of redemption we understand that before the foundation of the world the Bible tells us in first Peter chapter number one that Jesus is the lamb that was slain before the foundation of the world that God had devised the plan of salvation of redemption see he knew that though he created Adam and Eve in a perfect environment he knew that they would fall and that they would sin and because of their sin there would need to be a sacrifice and he understood that throughout the entirety of the Old Testament these sacrifices of blood would be a picture of the Lord Jesus Christ God in flesh who would come and make that ultimate sacrifice when he offered himself we find here that in verse number eight the Bible says above back in Hebrews 10 in verse 8 above when he said sacrifice an offering and burnt offerings an offering of sin for sin thou wouldest not neither hath pleasure therein which are offered by the law again in verse 9 then said he lo I come to do thy will O God he taketh away the first that he may establish the second we've mentioned about the first covenant in the second covenant the new covenant as we've often referred to it in fact as we studied the last section of chapter 8 we dealt with the new covenant and we find that the reference will be made again in verses 16 through 18 in our text of Scripture with regard to this new covenant and it's interesting as we look at the passage of Scripture and we find that in verses 6 and 8 he mentions about this fact that there was no pleasure in these offerings and these sacrifices and we find that as you think about the history of Israel and you think about their their offerings Isaiah calls them vain oblations see here's what was happening in Israel's history again not necessarily that these people would understand and maybe a greater context than we would because of their closeness to the the Jewish tradition and all that they had gone through but we find that they often were criticized they were condemned in the Old Testament because of their vain oblations go back to the Isaiah 1 and see what the Lord says of course Isaiah is the prophet of God he's speaking the words of the Lord and we find that the indictment is given we'll look at a couple of chapters here within the prophets and notice what is said about these vain oblations in verse number 11 of Isaiah 1 to what purpose is the multitude of your sacrifices unto me sayeth the Lord I am full of the burnt offerings of rams and the fat of fed beasts and I delight not in the blood of bullocks or of lambs or of he goats verse 12 when you come to appear before me who hath required this at your hand to tread my courts bring no more vain oblations empty offerings incense and an abomination unto me the new moons and Sabbaths the calling of assemblies I cannot away with it is iniquity even the solemn meeting and we find that what was happening of course we understand the sin of idolatry that the nation of Israel was so often guilty of and they would make all sorts of offerings to these false deities but we also understand that what was happening in the nation of Israel is they would go through the motion but their heart was not with God they would simply do the motion they would conform outwardly they would do what had been prescribed thinking we've done what we've been told to do their heart see God is interested in our heart he wants our heart I've often said this if God has your heart he has all of you he has every part of you and all how we see what's happening in Israel's history and we understand that God is saying, listen, if your heart's not right, don't bring those offerings. I'm not pleased with those offerings. Jeremiah chapter number 6 and verse number 20 notice, again, a reference to this same type of behavior that is going on. In fact, we understand much that is taking place in the book of Jeremiah and the indictments that have been laid upon Judah throughout these first several chapters of the book and we find that in verse number 20 the Bible says this, To what purpose cometh there to me incense from Sheba and the sweet cane from a far country? Your burnt offerings are not acceptable, nor your sacrifices sweet unto me. It's pretty clear language, is it not? Notice what is said in Amos chapter number 5. Turn to the minor prophet, the book of Amos, Hosea, Joel, Amos, before Hosea is Daniel. Kind of give you a little bit of reference point. I often have heard as preachers would go to minor prophets, they say it's just after Genesis and before Revelation. It's not very helpful, amen, but try to give you a little reference point there. And Hosea, Joel, Amos. And Amos chapter 5, look here in verse number 20. Shall not the day of the Lord be darkness and not light, even very dark and no brightness in it? I hate, I despise your feast days, and I will not smell in your solemn assemblies. Though ye offer me burnt offerings and your meat offerings, I will not accept them, neither will I regard the peace offerings of your fat beast. Take thou away from me the noise of thy songs, for I will not hear the melody of thy vials. But let judgment run down as waters, and righteousness as a mighty stream. Have you offered unto me sacrifices and offerings in the wilderness forty years, O house of Israel? But ye have borne the tabernacle of your Molech and Chion, your images, the star of your God, which you made to yourselves. Therefore will I cause you to go into captivity beyond Damascus, saith the Lord, whose name is the God of hosts. Again, we see the idolatry mentioned here, specifically in verse number 26, and of course the nation of Israel constantly dealing with the sin of idolatry, but we find that as we look back in Hebrews chapter number 10 and we understand what's happening and we see the plan that God is revealing here to these recipients, these Jewish believers, that as we come to this climatic point of the argument of the superiority of the priesthood of the Lord Jesus Christ, he says, listen, the Old Testament is inadequate, that Old Testament sacrificial system inadequate. By the way, he points back to some historical times within the history of Israel that their heart was far from God. And now he comes to the plan and he says, the plan that I have with regard to I come, remember he said this, a body hast thou prepared me at the end of verse number five, I come, verse 7 and verse 9, to do thy will. And we find that the plan required a payment. The plan required a payment, but there was only one payment that was acceptable, and that was the blood of Jesus Christ. Again, we are familiar with this truth and as it's been presented throughout these chapters and we come to this 10th chapter and we see how it all comes together. Notice in verses 10 through 13 that that plan that has been discussed required a payment and it's the precious blood of the Lord Jesus Christ. In verse number 10, by the witch will we are sanctified through the offering of the body of Jesus Christ once for all. We read verse number 11 already, again another contrast between the single offering of the Lord Jesus Christ that dealt with sin forever versus the continual offering of that Old Testament sacrificial system that often caused the people to have that remembrance of sin. It could not take away sin and we read in verse number 12, but this man after he'd offered one sacrifice for sins forever sat down on the right hand of God from henceforth expecting till his enemies be made his footstool. Isn't it amazing what the sacrifice of the Lord Jesus Christ accomplished on the cross of Calvary? And we think about this truth that we find here that the the payment that was required because of that plan that was that was put in place by God Almighty, that it was the precious blood of Christ. We understand John 3 16, for God so loved the world that he gave his only begotten son, right? And what did he he sent his son Jesus Christ not simply to come and live upon this earth and then and be a good model and so on and so forth. No, he was born to die. We understand that in his lifetime that he did leave us an example that we should follow his steps. He is the perfect example, we understand that, but he's more than an example. He's more than just a teacher. We know in John chapter 3 Nicodemus says we know that thou art a teacher sent from God. He's so much greater than a teacher, amen? He is the truth. He's the Redeemer. He came, what, to seek and to save. How would he save? Through his death, his burial, and his glorious resurrection. In fact, as we're mindful of the truth that is before us of the payment, we understand that Peter would say that we're redeemed with the precious blood of Christ. In 1 Peter 1 in verse number 19, remember the truth of Romans 5 in verse number 8, but God commended his love toward us in that while we were yet sinners, Christ died for us. I want you to go back and look at a few verses of Scripture, if you would. Go back to Matthew chapter 26, and we're just gonna go through a few verses of Scripture to show the remission of sin and the reality that the plan required this payment. In Matthew chapter number 26, really on the eve of the Lord going to the cross of Calvary, we understand that here within the text of Scripture, we'll read about the betrayal and all that will take place in the hearing and what-have-you. In chapter number 26 and verse number 28, as they are observing what we would often refer to, the Passover there, the Lord's Supper, we reference this passage of Scripture in verse 28, for this is my blood of the New Testament which is shed for many, what does he say, for the remission of sins. Remember the word remission, forgiveness or pardon of sins, the idea of letting them go as if they had never been committed. See, our God is just. We have a problem in our nation today understanding justice. Amen? We really do. We have a problem understanding justice and equality. It's way, way gone as to what those words actually mean. Our God is just, and as a just God, he cannot just pretend that it never happened. There had to be a payment, and Jesus said, I'll pay it. But the payment had to be made, and the only payment that was acceptable was the payment that was made by the Lord Jesus Christ, and therefore justice could be served. Why? Because the fact that it had been paid for, the sin of mankind has been paid for with the blood of Jesus Christ, and so he says that this Last Supper, he says, this is my blood of the New Testament which is shed for many for the remission of sins. Go to the book of Acts and understand as we look through the book of Acts, the disciples as they're preaching, and I want you to consider in Acts chapter number 2 and verse number 38 as Peter is preaching, and I want you to understand that Peter was there in that passage in Matthew 26. He heard what the Lord Jesus Christ said, and between that moment in Matthew 26 and this one in Acts 2, some amazing things happened historically. Jesus actually went to the cross. He had not gone to the cross yet in Matthew 26, but he said that this blood was going to be shed for many for the remission of sins. What does he do? He goes to the cross. By the way, did Peter, was he aware of the fact that Jesus went to the cross? Sure he was. He denied him thrice, did he not? And we find that after that situation that Jesus is put into a borrowed tomb, he rises on the third day conquering sin, death, and the grave. He appears to his disciples. By the way, he appears to Peter, does he not? And we find that as he appears to Peter, remember John chapter number 21, and you read there how that they're fishing, and Jesus is on the shore, and he says, hey, do you have any fish? No. There'd been another time in which they'd been asked the same question, and they'd not caught any. In fact, it was at the calling of Peter, and God gave him, the Lord Jesus Christ said, hey, thrust out into the deep and cast out thy net for a draw of fishes, a draft of fishes, and we find that as we go through that passage of Scripture, we find that Peter initially was like, no, I mean, nevertheless, at thy will, we will. We toyed all the night, we caught nothing, but we'll do it. What'd they do? They caught a great host of fish. But in John chapter number 21, then I think it was probably their largest catch ever, and then John says, I think it's the Lord. As Peter do, he gets up to shore real quick. We find that Jesus, he gives some instruction. Peter, do you love me? Peter, do you love me? Peter, do you love me? Then we find that Acts chapter number 1 is recorded for us. We find that they're the Great Commission, the Ascension of the Lord Jesus Christ. I mean, these are amazing events that have happened between Matthew chapter 26 and Acts chapter number 2. He tells them they're to stay there in Acts chapter number 1, but you shall receive power after the Holy Ghost has come upon you. And so we find that they're there, they're tarrying, and we find that the Holy Spirit comes, Pentecost, Acts chapter number 2, and Peter is preaching. The message of Peter begins in verse number 14. We don't have time to read the entirety of the message, but we find that in Acts 2, in verse number 37, notice what it says. Now when they heard this, they heard the message that Peter preached, they were pricked in their heart and said unto Peter and to the rest of the apostles, Men and brethren, what shall we do? Then Peter said unto them, Repent and be baptized, every one of you, in the name of Jesus Christ. What does it say? For the remission of sins. And you shall receive the gift of the Holy Ghost. Why was it for the remission? Or how could it be that Peter could offer this salvation, this remission of sins? Because Jesus Christ shed his blood, because the payment was made. We find in Acts chapter number 10, notice, as we continue to move forward here throughout the book of Acts, and we'll just use this as our last example. Again, Peter is preaching here, and this is an amazing situation, as we find in Acts chapter number 10, of course, the situation with Cornelius and all that is taking place, and how that Peter receives that vision from the Lord, and Peter is given the instruction to go. He goes to the house of Cornelius, and I mean, they're just waiting for him to come, and they're ready for him to speak to him. What an opportunity. And Peter begins to preach. In fact, in verse number 34, it says, then Peter opened his mouth and begins to preach. And in verse number 43, the Bible says, to him give all the prophets witness that through his name, whosoever believeth in him shall receive remission of sins. This is a message that's being preached. Why? Because it's the message that we've been instructed to deliver, to preach. You find the theme of this subject throughout the New Testament. You find this preaching of the gospel for the remission of sin. And we come back to Hebrews chapter number 10, and we see the payment that was made, and we find that the plan had been established. It required, however, a payment. The payment resulted in the pardon. I'm so thankful for the pardon. As you go back to Hebrews chapter number 10, and you look at verses 14 through 18, you see the reference that is given here with regard to what the payment, the precious blood of Christ accomplished, what it resulted in, and that is the pardon. In verse number 14, for by one offering, he hath perfected forever them that are sanctified. Now let me ask you a really simple question. These New Testament, these first century believers, these Jewish believers, as they're dealing with all they're dealing with, and they're told on this side, you have the law. It's a shadow of good things to come. And you offer all of these offerings, and you're very familiar with this, and there's a remembrance of sin, and it's not possible. It can never take away sins. It's not possible. And then on this side, we have the sacrifice of the Lord Jesus Christ, by the way, that took place one time. And it did, it handled, it took care of the sin of mankind with one sacrifice for sins forever. And by this one offering, he hath perfected forever them that are sanctified. Which one do you want? It's kind of a no-brainer, is it not? I'm going to go with the one that is sufficient. I'm going to go with the one that satisfies God Almighty. And the pardon that is offered, it's perfected forever them that are sanctified. Notice verse 15, whereof the Holy Ghost also is a witness to us, for after that he had said before. Now we find again another reference to the Old Testament, in verses 16 through 18, we find the new covenant being referenced again. This is that quote that we looked at in Hebrews chapter number 8, in verses 6 through 13, and we're not going to review all of that, but really it goes back to Jeremiah chapter 31, and it deals with this new covenant. And notice what is said in verses 16, 17, and 18, and what a blessed truth is given with regard to this pardon. He says in verse 16, this is the covenant that I will make with them after those days, sayeth the Lord, I will put my laws into their hearts, and in their minds will I write them, and their sins and iniquities will I remember no more. Now where remission of these is, there is no more offering for sin. As we look at these three verses of Scripture, we'll remind ourselves of the truth from that 8th chapter when we looked at verses 6 down through verse number 13, and we dealt with that second, that new covenant. And as we dealt with the new covenant, we spent a lot of time dealing with the fact of specifically how it relates to Israel. There's a promise that's given to Israel. We understand that. And we went through, and if you did not hear that message, you could go back to that message, it was entitled, A Better Covenant. I preached that on July the 19th, and we dealt with how the specifics of the covenant, of this new covenant, how it relates to Israel. But then we mentioned how it relates to individual believers today. We spent a lot of time looking at a number of passages of Scripture, and we spoke about, in Romans chapter 11, how that we've been graft in, and what a joy to understand all of the dynamics of that truth. And we find here at the end of the section we're studying here this morning, in verses 16 through 18, this comes in focus again. And He gives to us the result, this pardon that is given. Notice, I will put My laws into their hearts, and in their minds will I write them. Notice verse 17, and their sins and iniquities will I remember no more. That's in direct contrast to that Levitical system that we see in the beginning of Hebrews 10. In fact, specifically in verse 3, it says that there is a remembrance again made of sins every year. And He says that this pardon, He says that their sins and iniquities will I remember no more. Notice, now where remission of these is, there is no more offering for sin. What He's saying in verse 18 is that there's only one acceptable payment for sin, and it's been made. There's nothing else that you can do. You want to stick to that Old Testament sacrificial system and make all of those sacrifices, it's not going to work. So we have today a number of religious organizations that would teach that somehow you need to achieve your own salvation. There are things that you need to do in order to obtain eternal life. The reality is that there's no more offering for sin. Why? Because Jesus paid it all. What did He say on the cross of Calvary? We understand there's seven last sayings of the Lord Jesus Christ. One of them in particular, it is finished. I've often used this terminology. When He said it is finished, He's saying it's done. Right? There's nothing that we need to do. There are some religious organizations that speak about doing, but Christ says no, it's finished. It's done. All you have to do is have the righteousness of God imputed upon your account. You receive the Lord Jesus Christ as your personal Savior. See, the gift of salvation, the gift of God which is eternal life, is being offered to every human being, every person, whosoever will may come. We sang that song this morning. Aren't you thankful for that truth? For whosoever shall call upon the name of the Lord shall be saved. I'm thankful for that truth of Scripture. Romans 10 and verse 13. And as we understand the payment being made, Jesus then offers the gift of eternal life, and all you must do is receive, accept that gift. You can reject it. Unfortunately, people do. They say, no, I'm going to try my own way. I'm going to do my own thing. I'm going to follow this teaching, this religious organization. I'm going to follow their teaching. But we find here that the culmination of all of this truth that has been given is that where remission of these is, how did the pardon come? How did that forgiveness come? Where did that remission come from? It was through that payment, right? God had a plan, a plan of redemption, but that plan required a payment. The payment is the precious blood of Christ, and we find that that payment results in a pardon. This morning, we can rejoice greatly in the fact that we've been forgiven, that we've been pardoned, that there is remission of sin. We find here that there's no more offering for sin, nothing else that could be acceptable. I'm mindful of what the Old Testament tells us. In fact, we sing about these truths often, about the truth of how that God forgives us and what a joy it is to be forgiven. And we find that in Psalm 103, in verse 12, the Bible says, as far as the east is from the west, so far hath He removed our transgressions from us. Isn't that wonderful? We find that in the book of Micah, the Bible speaks about the fact that they're buried in the sea. Notice in Micah 7, in verse number 19. the Bible says He will turn again, He will have compassion upon us, He will subdue our iniquities, and that will cast all their sins into the depths of the sea. Isn't that wonderful? And we find here this morning that as we are looking at this climatic point where the writer comes to these first 18 verses of chapter 10, and he says listen, there's a remembrance of sin in that law that's a shadow of good things to come. But in what Jesus Christ offered when He offered Himself, the offering that He made, there is a remission of sin. The forgiveness, the pardon. Now understand with me this morning that we find ourselves in the midst of a generation that often as you speak this message that is an important message to deliver, even as we've noted how in the book of Acts we're preaching this message of remission, this pardon of sin because of what Jesus Christ accomplished on the cross of Calvary that you will have some that say I'm doing the best I can, I'm working, I'm trying. The reality is that Ephesians 2 in verses 8 and 9 for by grace are you saved through faith and that not of yourselves is the gift of God, not of works lest any man should boast. Look at the book of Titus if you will, turn just a few pages back there from where you are in Hebrews and look at Titus chapter number 3 and notice what is said here with regard to salvation. The Bible says in Titus 3 and verse number 5, not by works of righteousness which we have done. We can't work our way to heaven. You can't be good enough to get to heaven. The Bible says there's none good. No, not one. Right? Romans 3. For all have sinned and come short in the glory of God. We say not by works of righteousness which we have done, but according to His mercy He saved us. By the washing of regeneration, renewing of the Holy Ghost. Aren't you thankful to be redeemed by the blood of the Lord Jesus Christ? Notice this truth over in the book of 1 Peter. I mentioned in 1 Peter 1 and verse number 19 where the Bible speaks about the precious blood of Christ, but look at verse 18 along with it in 1 Peter 1, verses 18 and 19. The Bible says here, let's catch it all. Let's look at verse number 17 with it. Notice, And if ye call on the Father, who without respect of persons judgeth according to every man's work, past the time of your sojourning here in fear, aren't you thankful that our God is no respecter of persons? He says in verse number 18, For as much as ye know, notice this, that ye were not redeemed with corruptible things, as silver and gold from your vain conversation received by tradition from your fathers. No, our redemption isn't with gold and silver, with those things that are corruptible. And we come to verse 19, But with the precious blood of Christ, as of a lamb without blemish and without spot, who verily, notice, was foreordained before the foundation of the world, and was manifest in these last times for you, who by Him do believe in God, that raised Him up from the dead and gave Him glory, that your faith and hope might be in God. So we begin to consider this truth that is before us this morning. And we understand there's only one way to have that pardon. Paul said it this way in Galatians 2. In verse 21, he said, I do not frustrate the grace of God. If righteousness came by the law, then Christ is dead in vain. If we could keep the law and get to heaven, there's no need for Christ to die. But the reality is that as we looked at already in Galatians 3, verses 21 and 22, the law could not give life. Therefore, Christ had to die. And can I tell you this morning that His death was not in vain. We find that it was the perfect sacrifice that was acceptable by God the Father. And this morning as we look at the truth of Hebrews 10, I really hope that this morning, two things would be the result of our study of these first 18 verses of Hebrews 10. Number one, I hope you would rejoice. I mean, it's a wonderful thing to be pardoned. Amen? I mean, it's wonderful to have that remission of sins, to understand that Jesus paid it all, to understand that we are redeemed by the blood of the Lamb, that we can sing about it. We sing plenty of songs. Redeemed how I love to proclaim it. Redeemed how? By the blood of the Lamb. Right? We sing about it. And we ought to. We ought to rejoice in the fact that we've been redeemed, that we've been forgiven, that we have been pardoned. What a joy. The reality is, as I mentioned, by that definition of remission, it says letting them go as if they had never been committed. Again, not in the sense of I'm going to turn a blind eye. Not in the sense of we're going to sweep it under the rug. But in the sense that Jesus paid it for you. He paid a debt that He did not owe. He paid a debt that I could not pay. There's nothing I could do to earn that forgiveness, to attain that salvation. It was given to me as a free gift because God Himself died in my place. And I ought to rejoice in that. And so should you. I'm often mindful of the songwriter who said, I'm not discouraged. Why? Because I'm heaven-bound. Amen? I mean, listen, I understand there's some things in this world that can weigh heavy on our hearts. I understand there are some things that we deal with and there are some things that are struggles and they're weights and they're heavy and they're burdens, but we understand that those things are just temporary. Right? Paul said, while we look not at those things which are temporal, but at those things which are eternal. In fact, in 2 Corinthians 4, verses 17 and 18, when he deals with that wonderful truth about having that eternal perspective, he deals with, listen, he says, our light affliction but which is for a moment. Now, if you've studied anything about the life of Paul, you understand that he dealt with quite a bit of affliction. Amen? He dealt with quite a bit of difficulty. But yet when he looks at it in light of eternity, he says, our light affliction but is for a moment. See, this morning we had to rejoice that we're heaven bound. The remission, the pardon that we've received. But can I tell you this morning that in addition to rejoicing over the truth that is presented to us here in Hebrews 10, verses 1 through 18, I really hope that we'd be motivated to tell someone. That we'd be motivated to tell someone. The reality is that there's a world that's dying. Every day. Globally. I understand everyone wants to talk about the number of deaths from the pandemic. I understand that. But you understand that every single day, over 150,000 people die around the world. Every day. The pandemic has brought a certain level of reality to people with regard to their mortality. They're more aware of it. But you can look at studies. In fact, I looked at some of them last week in comparing death rates daily of 2020 to some previous years. And really, the death rates are no different. People are not dying at an exponentially higher rate because of coronavirus than people are just dying every day anyway. Death is a certainty, right? People are dying every day. And we have an opportunity to give them this message. Listen, that what you're doing, the thing that you think is going to get you right with God, it's not possible. There's only one possible, there's only one acceptable way, and it's by the way of the cross. It's only through the blood of Jesus Christ that you can have remission. And begin to understand that we're living in the midst of a generation in which people are dying and they're dying and going to a Christless eternity. They're dying without the truth of salvation. And who's gonna tell them? Nobody from the CDC is preparing anybody for death. Nobody from the World Health Organization is preparing anybody for death. They're giving them particular things that they can do in order to potentially prevent getting coronavirus and what have you. But the reality is that whether you die from COVID or something else, we wanna give you truth on how you can be prepared for death. In fact, I spoke to one of our elected officials a couple months back. And I said, with all due respect, I understand exactly what you're saying. I began to share with them the reality of the likelihood of potentially contracting and dying from COVID and the numbers and how unlikely it was, though possible. So the reality is one day you will die, you'll die from something. Are you prepared for that day? They said, I think our conversation is over. I was saddened by that response. The reality is that in that response, I understood that the truth was that they were not prepared for that day. You come in contact with people regularly. I understand that it's a lot more challenging today. I understand that. But can I tell you that the gospel still works? The gospel still works. And as we would be purposed about taking a message, Listen, this is the greatest offer ever. That we say, listen, there's nothing you can do. You can do all of that stuff, but it's never going to take away sin. You can go to church every day of your life. You can give as much of your income as you can possibly give. You can pray whatever you want to pray. You can do whatever you want to do. It's never going to get you salvation. It's never going to work. Why? Because God's plan said that there was a required payment, and that that payment was only the blood of Christ. It was the only payment that was going to work. And that's what results in pardon. And so this morning, we have that truth. And it's good for us to rejoice in it. And we ought to. We ought to rejoice that we're heaven-bound. But can I tell you that we ought to purpose to tell someone. There's a, I can't remember the dean knows it. Is it 91.3 dean? That faith for the family, right? The news around here. And there's a particular segment on that particular radio station, and it's the Family Foundation. I can't remember what it is. But anyway, they end their program by saying something like this. Tell someone about, and whatever their show is called. But more importantly than that, tell somebody about Jesus. And I like the way that they use that tagline to end their particular segment, because the reality this morning is that we need to tell somebody about Jesus. There are people dying. And I'm mindful of the difficulties that we are presented with, but I'm mindful of the fact that our God is still in control. And that if we really ask God, God, would you give me this week. See, if we pray anything according to his will, he heareth us, right? Do you believe that you could pray today? God, would you give me a divine appointment this week? Give me an opportunity to speak to somebody about Jesus. Do you think God would be pleased in answering that prayer? I think he would, right? Because he's given us that responsibility, that duty. And so we purposely, and by the way, if we pray that way, I think we'll be more aware of the opportunities that God gives us, right? Why? Because we're praying, God, give me an opportunity. I know I've referenced before, D.L. Moody, it's well documented that he made a commitment to the Lord that he would share the gospel with one person every day. He was not gonna let a day go by where he did not share the gospel with at least one person. There are many a time that D.L. Moody would have busy schedule, things going on, and he would get up to his study late in the evening, and he would realize I'd not yet taken the opportunity to share the gospel with someone today, and he would leave his study, and he'd go find somebody to share the gospel with. No wonder God used him in such a way to see so many people saved. The message this morning that we have before us in Hebrews 10, verses one through 18, it's a glorious message. And it's a message that we ought to rejoice in having received. But this morning, someone, someone needs this message. Someone that's in your sphere of influence. There was a day in your life that you needed this message. Aren't you thankful this morning that somewhere along the line, someone obeyed the Lord to give the gospel? You say, well, I was born in a Christian home. Somebody told your parents. Well, they were born in a Christian home. Somebody told your grandparents. You understand what I'm saying? We can keep on going, we can play that game until somewhere we find where somebody gave the gospel to your family, right? No one gave the gospel to my grandparents, but I sure am happy that somebody gave it to my parents. I wasn't born in a Christian home, but my parents got saved when I was a teenager. I'm so thankful for it. And this morning, we don't just keep it to ourselves. We say this is a message that we're gonna proclaim. Amen? Jesus saves. What a joy. There's a remembrance of sin. And again, the people that are being written to, they need to understand that this system is no longer in place because Jesus has come and He has fulfilled all. What was in type is now available and it's the real thing. It's not any longer just a shadow of an image to come, a shadow of good things to come. No, it is now the very image. It's God in flesh that has died that paid the price. And you now have no longer a remembrance of sins, but you have remission of sins. And I'm so thankful for that. Let's pray. Father, we love you this morning. We thank you for loving us. We thank you for this one sacrifice for sin forever. We thank you that in your wisdom, in your omniscience, you created a plan by which your creation could be redeemed. And we understand as we study the whole of Scripture that that plan of redemption required a payment. All of the sacrifices and all of the blood that was shed in the Old Testament, being a type of Messiah who would one day come, we're thankful that when the fullness of time came, that God, you sent forth your son. We're thankful that he was born of a virgin and he was made under the law. We're thankful that he came to die to redeem. We're thankful that that payment results in a pardon. Oh, what joy it is to be forgiven. God, if there's one present here this morning that's never trusted the Lord Jesus Christ as their personal Savior. In fact, they're trying their own way. They're doing their own thing. God, I pray that you would help them to understand this morning that there's no more offering for sin. That that which was offered when Jesus offered himself is the only acceptable payment. Father, for those of us that have trusted the Lord Jesus Christ as our personal Savior, would you help us to rejoice this morning? God, help us to take it even a step further and help us to purpose to tell someone. In the midst of all that's going on in our society, Lord, I pray that you would help us daily to seek that opportunity, to pray, God, that you would lead our paths in such a way that we would have the opportunity to open our mouths and share the good tidings, the gospel of Jesus Christ, to proclaim that message loud and clear that Jesus saves. Lord, use us. Help us to redeem the time. Help us, Lord, to seek those opportunities and then to seize them as they're presented to us. We pray that many would come to know you as their personal Lord and Savior because of the power of the gospel message. Have your will and weigh in the hearts of your people over these next few moments. We pray that you'd move and work as only you can. We'll thank you for it. In Christ's name we pray. Would you stand with me? Heads are bowed, eyes are closed. Kimberly's gonna play quietly on the piano. Two things that I've asked that would be a result of this message this morning that I've challenged you with. Number one, that we'd rejoice in our salvation. Number two, that we'd purpose to tell someone. This morning, as Kimberly plays, would you ask the Lord to work in your heart and life? The altar is open as Kimberly plays.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 1.840000033378601,
      "text": " which Deborah was singing from,"
    },
    {
      "id": 1,
      "start": 1.840000033378601,
      "end": 3.9200000762939453,
      "text": " thou wilt keep him in perfect peace"
    },
    {
      "id": 2,
      "start": 3.9200000762939453,
      "end": 5.960000038146973,
      "text": " whose mind is stayed on thee"
    },
    {
      "id": 3,
      "start": 5.960000038146973,
      "end": 8.260000228881836,
      "text": " because he trusteth in thee."
    },
    {
      "id": 4,
      "start": 8.260000228881836,
      "end": 10.220000267028809,
      "text": " And then verse number four says this,"
    },
    {
      "id": 5,
      "start": 10.220000267028809,
      "end": 14.260000228881836,
      "text": " trust ye in the Lord forever,"
    },
    {
      "id": 6,
      "start": 14.260000228881836,
      "end": 18.18000030517578,
      "text": " for in the Lord Jehovah is everlasting strength."
    },
    {
      "id": 7,
      "start": 18.18000030517578,
      "end": 19.719999313354492,
      "text": " Aren't you thankful?"
    },
    {
      "id": 8,
      "start": 19.719999313354492,
      "end": 21.639999389648438,
      "text": " The God that we serve,"
    },
    {
      "id": 9,
      "start": 21.639999389648438,
      "end": 24.68000030517578,
      "text": " he is the Lord God Almighty, El Shaddai,"
    },
    {
      "id": 10,
      "start": 24.68000030517578,
      "end": 26.68000030517578,
      "text": " and he has all power,"
    },
    {
      "id": 11,
      "start": 26.68000030517578,
      "end": 28.639999389648438,
      "text": " and we ought to trust him, amen?"
    },
    {
      "id": 12,
      "start": 28.639999389648438,
      "end": 29.68000030517578,
      "text": " And what a blessing."
    },
    {
      "id": 13,
      "start": 29.81999969482422,
      "end": 32.400001525878906,
      "text": " And I'm so thankful for that song and that reminder."
    },
    {
      "id": 14,
      "start": 32.400001525878906,
      "end": 33.86000061035156,
      "text": " Hebrews chapter number 10,"
    },
    {
      "id": 15,
      "start": 33.86000061035156,
      "end": 36.36000061035156,
      "text": " I'll be looking at verses one through 18 this morning."
    },
    {
      "id": 16,
      "start": 36.36000061035156,
      "end": 38.81999969482422,
      "text": " Hebrews chapter number 10, verses one through 18."
    },
    {
      "id": 17,
      "start": 38.81999969482422,
      "end": 40.47999954223633,
      "text": " I'm gonna read verse one and verse 12,"
    },
    {
      "id": 18,
      "start": 40.47999954223633,
      "end": 42.08000183105469,
      "text": " and then we'll get into the message this morning."
    },
    {
      "id": 19,
      "start": 42.08000183105469,
      "end": 44.540000915527344,
      "text": " The Bible says in verse number one of Hebrews 10,"
    },
    {
      "id": 20,
      "start": 44.540000915527344,
      "end": 49.040000915527344,
      "text": " for the law, having a shadow of good things to come,"
    },
    {
      "id": 21,
      "start": 49.040000915527344,
      "end": 51.619998931884766,
      "text": " and not the very image of the things,"
    },
    {
      "id": 22,
      "start": 51.619998931884766,
      "end": 54.2599983215332,
      "text": " can never, with those sacrifices"
    },
    {
      "id": 23,
      "start": 54.2599983215332,
      "end": 57.7599983215332,
      "text": " which they offered year by year continually,"
    },
    {
      "id": 24,
      "start": 57.79999923706055,
      "end": 61.5,
      "text": " make the comers thereunto perfect."
    },
    {
      "id": 25,
      "start": 61.5,
      "end": 62.91999816894531,
      "text": " And verse number 12 says,"
    },
    {
      "id": 26,
      "start": 62.91999816894531,
      "end": 65.95999908447266,
      "text": " but this man, speaking of the Lord Jesus Christ,"
    },
    {
      "id": 27,
      "start": 65.95999908447266,
      "end": 68.26000213623047,
      "text": " our great high priest,"
    },
    {
      "id": 28,
      "start": 68.26000213623047,
      "end": 73.26000213623047,
      "text": " after he had offered one sacrifice for sins forever,"
    },
    {
      "id": 29,
      "start": 74.22000122070312,
      "end": 77.13999938964844,
      "text": " sat down on the right hand of God."
    },
    {
      "id": 30,
      "start": 77.13999938964844,
      "end": 78.5999984741211,
      "text": " I wanna preach a message this morning"
    },
    {
      "id": 31,
      "start": 78.5999984741211,
      "end": 80.9000015258789,
      "text": " that I've adopted the title from verse number 12,"
    },
    {
      "id": 32,
      "start": 80.9000015258789,
      "end": 84.62000274658203,
      "text": " one sacrifice for sins forever."
    },
    {
      "id": 33,
      "start": 84.62000274658203,
      "end": 87.58000183105469,
      "text": " The discussion on the superiority of the Lord Jesus Christ"
    },
    {
      "id": 34,
      "start": 88.4000015258789,
      "end": 89.94000244140625,
      "text": " and the priesthood of Christ in particular"
    },
    {
      "id": 35,
      "start": 89.94000244140625,
      "end": 92.68000030517578,
      "text": " over these last several chapters of the book of Hebrews"
    },
    {
      "id": 36,
      "start": 92.68000030517578,
      "end": 94.72000122070312,
      "text": " is coming to a conclusion."
    },
    {
      "id": 37,
      "start": 94.72000122070312,
      "end": 97.0,
      "text": " We, of course, understood as we started"
    },
    {
      "id": 38,
      "start": 97.0,
      "end": 99.19999694824219,
      "text": " in chapter number five of Hebrews"
    },
    {
      "id": 39,
      "start": 99.19999694824219,
      "end": 102.16000366210938,
      "text": " how that this subject matter of the priesthood"
    },
    {
      "id": 40,
      "start": 102.16000366210938,
      "end": 103.36000061035156,
      "text": " of the Lord Jesus Christ"
    },
    {
      "id": 41,
      "start": 103.36000061035156,
      "end": 105.76000213623047,
      "text": " and how his priesthood is superior"
    },
    {
      "id": 42,
      "start": 105.76000213623047,
      "end": 107.87999725341797,
      "text": " to that of the Aaronic priesthood,"
    },
    {
      "id": 43,
      "start": 107.87999725341797,
      "end": 111.05999755859375,
      "text": " that discussion began in chapter number five."
    },
    {
      "id": 44,
      "start": 111.05999755859375,
      "end": 113.36000061035156,
      "text": " We find that the writer of Hebrews"
    },
    {
      "id": 45,
      "start": 113.36000061035156,
      "end": 115.23999786376953,
      "text": " presented the Lord Jesus Christ"
    },
    {
      "id": 46,
      "start": 115.26000213623047,
      "end": 118.73999786376953,
      "text": " as being the fulfillment of Old Testament prophecy."
    },
    {
      "id": 47,
      "start": 118.73999786376953,
      "end": 121.41999816894531,
      "text": " In fact, many times throughout the book of Hebrews,"
    },
    {
      "id": 48,
      "start": 121.41999816894531,
      "end": 124.5,
      "text": " even as we find this morning in our text of scripture,"
    },
    {
      "id": 49,
      "start": 124.5,
      "end": 126.77999877929688,
      "text": " the writer will reference the Old Testament"
    },
    {
      "id": 50,
      "start": 126.77999877929688,
      "end": 129.5800018310547,
      "text": " and he'll show how that the Lord Jesus Christ"
    },
    {
      "id": 51,
      "start": 129.5800018310547,
      "end": 132.27999877929688,
      "text": " is the fulfillment of that particular prophecy."
    },
    {
      "id": 52,
      "start": 132.27999877929688,
      "end": 135.3000030517578,
      "text": " Of course, in line with what was being dealt with"
    },
    {
      "id": 53,
      "start": 135.3000030517578,
      "end": 137.86000061035156,
      "text": " in chapter number five and discussed often"
    },
    {
      "id": 54,
      "start": 137.86000061035156,
      "end": 140.94000244140625,
      "text": " was the prophecy from Psalm 110,"
    },
    {
      "id": 55,
      "start": 140.94000244140625,
      "end": 144.10000610351562,
      "text": " that messianic psalm that the truth,"
    },
    {
      "id": 56,
      "start": 144.36000061035156,
      "end": 146.75999450683594,
      "text": " my son, today have I begotten thee in Psalm two,"
    },
    {
      "id": 57,
      "start": 146.75999450683594,
      "end": 150.05999755859375,
      "text": " but then in Psalm 100, thou art a priest forever,"
    },
    {
      "id": 58,
      "start": 150.05999755859375,
      "end": 153.52000427246094,
      "text": " sorry, Psalm 110, after the order of Melchizedek."
    },
    {
      "id": 59,
      "start": 153.52000427246094,
      "end": 155.97999572753906,
      "text": " And we find that the writer of Hebrews"
    },
    {
      "id": 60,
      "start": 155.97999572753906,
      "end": 157.8800048828125,
      "text": " presented the Lord Jesus Christ"
    },
    {
      "id": 61,
      "start": 157.8800048828125,
      "end": 161.36000061035156,
      "text": " as being the fulfillment of this Old Testament prophecy."
    },
    {
      "id": 62,
      "start": 161.36000061035156,
      "end": 164.6199951171875,
      "text": " And then he has spent the next several chapters"
    },
    {
      "id": 63,
      "start": 164.6199951171875,
      "end": 165.83999633789062,
      "text": " into chapter number 10"
    },
    {
      "id": 64,
      "start": 165.83999633789062,
      "end": 167.63999938964844,
      "text": " that we're studying here this morning"
    },
    {
      "id": 65,
      "start": 167.63999938964844,
      "end": 171.94000244140625,
      "text": " to prove that Christ is superior."
    },
    {
      "id": 66,
      "start": 171.9600067138672,
      "end": 175.67999267578125,
      "text": " We have found, as we've studied through these chapters,"
    },
    {
      "id": 67,
      "start": 175.67999267578125,
      "end": 178.39999389648438,
      "text": " that his priesthood is after the order of Melchizedek."
    },
    {
      "id": 68,
      "start": 178.39999389648438,
      "end": 181.67999267578125,
      "text": " Of course, that was the reference in Psalm 110,"
    },
    {
      "id": 69,
      "start": 181.67999267578125,
      "end": 183.8800048828125,
      "text": " and we find the fulfillment in Hebrews five,"
    },
    {
      "id": 70,
      "start": 183.8800048828125,
      "end": 185.3800048828125,
      "text": " the reference to that."
    },
    {
      "id": 71,
      "start": 185.3800048828125,
      "end": 188.1199951171875,
      "text": " And of course, as we studied through,"
    },
    {
      "id": 72,
      "start": 188.1199951171875,
      "end": 189.17999267578125,
      "text": " remember chapter five,"
    },
    {
      "id": 73,
      "start": 189.17999267578125,
      "end": 191.9600067138672,
      "text": " he had to have that moment of giving a warning"
    },
    {
      "id": 74,
      "start": 191.9600067138672,
      "end": 194.60000610351562,
      "text": " because he said the things that he had to utter,"
    },
    {
      "id": 75,
      "start": 194.60000610351562,
      "end": 195.9199981689453,
      "text": " that they were hard to utter,"
    },
    {
      "id": 76,
      "start": 195.9199981689453,
      "end": 197.27999877929688,
      "text": " seeing you're dull of hearing,"
    },
    {
      "id": 77,
      "start": 197.27999877929688,
      "end": 198.82000732421875,
      "text": " and then he gave a warning."
    },
    {
      "id": 78,
      "start": 198.82000732421875,
      "end": 200.97999572753906,
      "text": " But we find in chapter number seven of the book of Hebrews,"
    },
    {
      "id": 79,
      "start": 201.0,
      "end": 203.0399932861328,
      "text": " he deals with that of Melchizedek"
    },
    {
      "id": 80,
      "start": 203.0399932861328,
      "end": 206.0800018310547,
      "text": " and the fulfillment of that messianic prophecy"
    },
    {
      "id": 81,
      "start": 206.0800018310547,
      "end": 207.0,
      "text": " in Psalm 110."
    },
    {
      "id": 82,
      "start": 207.0,
      "end": 209.39999389648438,
      "text": " We find that the Lord Jesus Christ,"
    },
    {
      "id": 83,
      "start": 209.39999389648438,
      "end": 210.82000732421875,
      "text": " he passed through the heavens,"
    },
    {
      "id": 84,
      "start": 210.82000732421875,
      "end": 213.27999877929688,
      "text": " not simply through the veil."
    },
    {
      "id": 85,
      "start": 213.27999877929688,
      "end": 215.0,
      "text": " We find that the Lord Jesus Christ,"
    },
    {
      "id": 86,
      "start": 215.0,
      "end": 217.27999877929688,
      "text": " that his offering was for sin,"
    },
    {
      "id": 87,
      "start": 217.27999877929688,
      "end": 218.9600067138672,
      "text": " the sin of the world,"
    },
    {
      "id": 88,
      "start": 218.9600067138672,
      "end": 220.74000549316406,
      "text": " but it was not for his own sin."
    },
    {
      "id": 89,
      "start": 220.74000549316406,
      "end": 223.5800018310547,
      "text": " Remember, the priest, as he would make an offering,"
    },
    {
      "id": 90,
      "start": 223.5800018310547,
      "end": 226.36000061035156,
      "text": " he first had to make an offering for his own sin,"
    },
    {
      "id": 91,
      "start": 226.36000061035156,
      "end": 228.36000061035156,
      "text": " then for the sin of the people."
    },
    {
      "id": 92,
      "start": 228.36000061035156,
      "end": 230.1999969482422,
      "text": " But our Savior is perfect."
    },
    {
      "id": 93,
      "start": 230.22000122070312,
      "end": 232.77999877929688,
      "text": " He has no sin, had no sin."
    },
    {
      "id": 94,
      "start": 232.77999877929688,
      "end": 235.97999572753906,
      "text": " He is pure and just and righteous."
    },
    {
      "id": 95,
      "start": 235.97999572753906,
      "end": 239.82000732421875,
      "text": " And so we find, as we spoke about the superiority"
    },
    {
      "id": 96,
      "start": 239.82000732421875,
      "end": 242.3000030517578,
      "text": " of the Lord Jesus Christ, our great high priest,"
    },
    {
      "id": 97,
      "start": 242.3000030517578,
      "end": 243.5,
      "text": " we mentioned that truth."
    },
    {
      "id": 98,
      "start": 243.5,
      "end": 246.94000244140625,
      "text": " We find that he conquered death and lives forever."
    },
    {
      "id": 99,
      "start": 246.94000244140625,
      "end": 249.25999450683594,
      "text": " Remember, the priesthood in the Old Testament,"
    },
    {
      "id": 100,
      "start": 249.25999450683594,
      "end": 251.6999969482422,
      "text": " there would be a time that the high priest would die."
    },
    {
      "id": 101,
      "start": 251.6999969482422,
      "end": 253.3800048828125,
      "text": " And then it would be the next person"
    },
    {
      "id": 102,
      "start": 253.3800048828125,
      "end": 254.94000244140625,
      "text": " that would be in line to assume"
    },
    {
      "id": 103,
      "start": 254.94000244140625,
      "end": 256.7799987792969,
      "text": " that title of being high priest."
    },
    {
      "id": 104,
      "start": 256.7799987792969,
      "end": 258.5799865722656,
      "text": " But we find that the Lord Jesus Christ,"
    },
    {
      "id": 105,
      "start": 258.5799865722656,
      "end": 262.1600036621094,
      "text": " he conquered death, he rose from the dead,"
    },
    {
      "id": 106,
      "start": 262.1600036621094,
      "end": 264.1199951171875,
      "text": " and he lives forevermore."
    },
    {
      "id": 107,
      "start": 264.1199951171875,
      "end": 267.8800048828125,
      "text": " He made one offering for sin forever."
    },
    {
      "id": 108,
      "start": 267.8800048828125,
      "end": 270.8399963378906,
      "text": " And we see that once again in focus here"
    },
    {
      "id": 109,
      "start": 270.8399963378906,
      "end": 273.7799987792969,
      "text": " in Hebrews chapter number 10, these first 18 verses."
    },
    {
      "id": 110,
      "start": 273.7799987792969,
      "end": 275.0799865722656,
      "text": " And let's dig in."
    },
    {
      "id": 111,
      "start": 275.0799865722656,
      "end": 276.6400146484375,
      "text": " Look, if you're taking notes this morning,"
    },
    {
      "id": 112,
      "start": 276.6400146484375,
      "end": 277.8399963378906,
      "text": " look at the first four verses."
    },
    {
      "id": 113,
      "start": 277.8399963378906,
      "end": 281.32000732421875,
      "text": " Number one this morning, the remembrance of sin."
    },
    {
      "id": 114,
      "start": 281.32000732421875,
      "end": 283.3599853515625,
      "text": " The remembrance of sin."
    },
    {
      "id": 115,
      "start": 283.3599853515625,
      "end": 285.1000061035156,
      "text": " Once again, we find that the Old Testament"
    },
    {
      "id": 116,
      "start": 285.1000061035156,
      "end": 287.29998779296875,
      "text": " sacrificial system is in full view."
    },
    {
      "id": 117,
      "start": 287.29998779296875,
      "end": 289.67999267578125,
      "text": " The Bible begins by saying this in verse number one,"
    },
    {
      "id": 118,
      "start": 289.67999267578125,
      "end": 291.6400146484375,
      "text": " as I read already, for the law,"
    },
    {
      "id": 119,
      "start": 291.6400146484375,
      "end": 295.0799865722656,
      "text": " having a shadow of good things to come."
    },
    {
      "id": 120,
      "start": 295.0799865722656,
      "end": 297.44000244140625,
      "text": " And we've spoken often throughout this section"
    },
    {
      "id": 121,
      "start": 297.44000244140625,
      "end": 300.0400085449219,
      "text": " of the book of Hebrews how the typologies"
    },
    {
      "id": 122,
      "start": 300.0400085449219,
      "end": 303.0799865722656,
      "text": " and how that the Old Testament type"
    },
    {
      "id": 123,
      "start": 303.0799865722656,
      "end": 306.9599914550781,
      "text": " is now presented in full view of the person of Jesus Christ."
    },
    {
      "id": 124,
      "start": 306.9599914550781,
      "end": 309.0,
      "text": " And we find that it says that it was a shadow"
    },
    {
      "id": 125,
      "start": 309.0,
      "end": 310.3399963378906,
      "text": " of good things to come."
    },
    {
      "id": 126,
      "start": 310.3399963378906,
      "end": 312.0,
      "text": " And then notice this phrase,"
    },
    {
      "id": 127,
      "start": 312.0,
      "end": 316.0400085449219,
      "text": " and not the very image of the things."
    },
    {
      "id": 128,
      "start": 316.1400146484375,
      "end": 321.1400146484375,
      "text": " It then says this, can never, never, can never."
    },
    {
      "id": 129,
      "start": 321.8599853515625,
      "end": 324.6600036621094,
      "text": " Amen, that's a pretty absolute statement, is it not?"
    },
    {
      "id": 130,
      "start": 324.6600036621094,
      "end": 327.70001220703125,
      "text": " Can never, with those sacrifices"
    },
    {
      "id": 131,
      "start": 327.70001220703125,
      "end": 331.3800048828125,
      "text": " which they offered year by year continually,"
    },
    {
      "id": 132,
      "start": 331.3800048828125,
      "end": 335.20001220703125,
      "text": " make the comers thereunto perfect."
    },
    {
      "id": 133,
      "start": 335.20001220703125,
      "end": 337.6600036621094,
      "text": " But notice the natural conclusion"
    },
    {
      "id": 134,
      "start": 337.6600036621094,
      "end": 340.2799987792969,
      "text": " that you would come to in verse number two"
    },
    {
      "id": 135,
      "start": 340.2799987792969,
      "end": 344.1000061035156,
      "text": " when you look at the reality of what's being presented."
    },
    {
      "id": 136,
      "start": 344.1199951171875,
      "end": 346.55999755859375,
      "text": " It says this, in verse number two, the first statement,"
    },
    {
      "id": 137,
      "start": 346.55999755859375,
      "end": 348.9200134277344,
      "text": " it's a question, it says, for then,"
    },
    {
      "id": 138,
      "start": 348.9200134277344,
      "end": 352.0400085449219,
      "text": " would they not have ceased to be offered?"
    },
    {
      "id": 139,
      "start": 352.0400085449219,
      "end": 355.6400146484375,
      "text": " In other words, if that Old Testament sacrificial system"
    },
    {
      "id": 140,
      "start": 355.6400146484375,
      "end": 358.32000732421875,
      "text": " could make the comers thereunto perfect,"
    },
    {
      "id": 141,
      "start": 358.32000732421875,
      "end": 362.1000061035156,
      "text": " if it was sufficient, then it would cease."
    },
    {
      "id": 142,
      "start": 362.1000061035156,
      "end": 365.239990234375,
      "text": " It wouldn't have to continue to be done every day."
    },
    {
      "id": 143,
      "start": 365.239990234375,
      "end": 367.20001220703125,
      "text": " And then of course, as the day of atonement"
    },
    {
      "id": 144,
      "start": 367.20001220703125,
      "end": 369.7799987792969,
      "text": " comes in full view, we find annually."
    },
    {
      "id": 145,
      "start": 369.7799987792969,
      "end": 371.55999755859375,
      "text": " Remember, we mentioned on the day of atonement"
    },
    {
      "id": 146,
      "start": 371.5799865722656,
      "end": 374.6199951171875,
      "text": " as we've studied the ninth chapter of the book of Hebrews"
    },
    {
      "id": 147,
      "start": 374.6199951171875,
      "end": 377.0799865722656,
      "text": " how the high priest would go in,"
    },
    {
      "id": 148,
      "start": 377.0799865722656,
      "end": 379.8599853515625,
      "text": " and he would go in once to offer for his own sin,"
    },
    {
      "id": 149,
      "start": 379.8599853515625,
      "end": 381.5799865722656,
      "text": " and then he would come out,"
    },
    {
      "id": 150,
      "start": 381.5799865722656,
      "end": 383.5,
      "text": " and then he would go in a second time"
    },
    {
      "id": 151,
      "start": 383.5,
      "end": 385.82000732421875,
      "text": " to offer for the sin of the people,"
    },
    {
      "id": 152,
      "start": 385.82000732421875,
      "end": 389.29998779296875,
      "text": " and we find that that then would have to be repeated"
    },
    {
      "id": 153,
      "start": 389.29998779296875,
      "end": 391.5799865722656,
      "text": " annually on the day of atonement."
    },
    {
      "id": 154,
      "start": 391.5799865722656,
      "end": 394.94000244140625,
      "text": " We find that here, the natural conclusion"
    },
    {
      "id": 155,
      "start": 394.94000244140625,
      "end": 396.70001220703125,
      "text": " that we come to in the writer's offering"
    },
    {
      "id": 156,
      "start": 396.70001220703125,
      "end": 400.2200012207031,
      "text": " as of the question, would not it have ceased to be offered"
    },
    {
      "id": 157,
      "start": 400.239990234375,
      "end": 402.9599914550781,
      "text": " if it was possible to bring life,"
    },
    {
      "id": 158,
      "start": 402.9599914550781,
      "end": 405.67999267578125,
      "text": " if it was possible to atone for sins,"
    },
    {
      "id": 159,
      "start": 405.67999267578125,
      "end": 409.5199890136719,
      "text": " to make that sacrifice that would be sufficient forever,"
    },
    {
      "id": 160,
      "start": 409.5199890136719,
      "end": 410.8800048828125,
      "text": " then it would cease."
    },
    {
      "id": 161,
      "start": 410.8800048828125,
      "end": 413.32000732421875,
      "text": " But the reality is that it was a picture."
    },
    {
      "id": 162,
      "start": 413.32000732421875,
      "end": 414.5199890136719,
      "text": " It was a type."
    },
    {
      "id": 163,
      "start": 414.5199890136719,
      "end": 416.5400085449219,
      "text": " And there was a remembrance of sin."
    },
    {
      "id": 164,
      "start": 416.5400085449219,
      "end": 417.9599914550781,
      "text": " You see in verse number three,"
    },
    {
      "id": 165,
      "start": 417.9599914550781,
      "end": 420.239990234375,
      "text": " the Bible says, well, let me finish verse number two,"
    },
    {
      "id": 166,
      "start": 420.239990234375,
      "end": 423.4800109863281,
      "text": " because that the worshipers once purged,"
    },
    {
      "id": 167,
      "start": 423.4800109863281,
      "end": 428.4800109863281,
      "text": " notice, should have had no more conscience of sins."
    },
    {
      "id": 168,
      "start": 429.4800109863281,
      "end": 434.4800109863281,
      "text": " But in those sacrifices, there is a remembrance again,"
    },
    {
      "id": 169,
      "start": 435.3399963378906,
      "end": 438.94000244140625,
      "text": " made of sins every year."
    },
    {
      "id": 170,
      "start": 438.94000244140625,
      "end": 440.5799865722656,
      "text": " The day of atonement was an important day"
    },
    {
      "id": 171,
      "start": 440.5799865722656,
      "end": 442.5400085449219,
      "text": " in the nation of Israel's history"
    },
    {
      "id": 172,
      "start": 442.5400085449219,
      "end": 444.5400085449219,
      "text": " on their calendar annually."
    },
    {
      "id": 173,
      "start": 444.5400085449219,
      "end": 448.5799865722656,
      "text": " And we find that again, even as we read in verse number 12"
    },
    {
      "id": 174,
      "start": 448.5799865722656,
      "end": 450.3399963378906,
      "text": " and in verse number 11 that proceeds that,"
    },
    {
      "id": 175,
      "start": 450.3399963378906,
      "end": 452.2200012207031,
      "text": " talks about the fact that the priest standeth"
    },
    {
      "id": 176,
      "start": 452.2200012207031,
      "end": 454.8599853515625,
      "text": " daily ministering and offering oftentimes"
    },
    {
      "id": 177,
      "start": 454.8599853515625,
      "end": 458.760009765625,
      "text": " the same sacrifices which can never take away sins."
    },
    {
      "id": 178,
      "start": 458.760009765625,
      "end": 461.79998779296875,
      "text": " And we find that there was a remembrance of sins."
    },
    {
      "id": 179,
      "start": 461.79998779296875,
      "end": 463.0400085449219,
      "text": " There was no remission."
    },
    {
      "id": 180,
      "start": 463.0400085449219,
      "end": 464.6600036621094,
      "text": " And we'll get to that in just a moment."
    },
    {
      "id": 181,
      "start": 464.6600036621094,
      "end": 467.5199890136719,
      "text": " There was a constant remembrance of sin."
    },
    {
      "id": 182,
      "start": 467.5199890136719,
      "end": 469.3999938964844,
      "text": " And we find that the nation of Israel,"
    },
    {
      "id": 183,
      "start": 469.3999938964844,
      "end": 472.8800048828125,
      "text": " the reality is that this is the plan that God put in place."
    },
    {
      "id": 184,
      "start": 472.8800048828125,
      "end": 475.239990234375,
      "text": " He gave this sacrificial system"
    },
    {
      "id": 185,
      "start": 475.239990234375,
      "end": 477.32000732421875,
      "text": " and it would point to Messiah that would come."
    },
    {
      "id": 186,
      "start": 477.32000732421875,
      "end": 479.4800109863281,
      "text": " You understand that Paul says it this way"
    },
    {
      "id": 187,
      "start": 479.4800109863281,
      "end": 480.739990234375,
      "text": " in the book of Galatians,"
    },
    {
      "id": 188,
      "start": 480.739990234375,
      "end": 482.9200134277344,
      "text": " that when the fullness of time was come,"
    },
    {
      "id": 189,
      "start": 482.94000244140625,
      "end": 486.260009765625,
      "text": " God sent forth his son to be born of a virgin."
    },
    {
      "id": 190,
      "start": 486.260009765625,
      "end": 488.739990234375,
      "text": " But we find that as Paul continues"
    },
    {
      "id": 191,
      "start": 488.739990234375,
      "end": 491.17999267578125,
      "text": " dealing with that subject matter in the book of Galatians,"
    },
    {
      "id": 192,
      "start": 491.17999267578125,
      "end": 494.1000061035156,
      "text": " and we often will view that passage of scripture,"
    },
    {
      "id": 193,
      "start": 494.1000061035156,
      "end": 496.7799987792969,
      "text": " we find that he continues."
    },
    {
      "id": 194,
      "start": 496.7799987792969,
      "end": 499.05999755859375,
      "text": " He doesn't just speak about the incarnation,"
    },
    {
      "id": 195,
      "start": 499.05999755859375,
      "end": 501.94000244140625,
      "text": " that he came, he was made of a woman, made under the law."
    },
    {
      "id": 196,
      "start": 501.94000244140625,
      "end": 506.17999267578125,
      "text": " And then verse number five of Galatians four says this,"
    },
    {
      "id": 197,
      "start": 506.17999267578125,
      "end": 509.5799865722656,
      "text": " to redeem them that were under the law,"
    },
    {
      "id": 198,
      "start": 509.5799865722656,
      "end": 511.9800109863281,
      "text": " that we might receive the adoption of sons."
    },
    {
      "id": 199,
      "start": 512.0,
      "end": 513.9600219726562,
      "text": " And so when the fullness of time was come,"
    },
    {
      "id": 200,
      "start": 513.9600219726562,
      "end": 518.3200073242188,
      "text": " at the exact perfect time, God sent forth his son."
    },
    {
      "id": 201,
      "start": 518.3200073242188,
      "end": 520.4000244140625,
      "text": " And he sent them forth for a purpose"
    },
    {
      "id": 202,
      "start": 520.4000244140625,
      "end": 523.280029296875,
      "text": " and that purpose was to die to redeem mankind."
    },
    {
      "id": 203,
      "start": 523.280029296875,
      "end": 525.9600219726562,
      "text": " And so all of that Old Testament sacrificial system,"
    },
    {
      "id": 204,
      "start": 525.9600219726562,
      "end": 529.1199951171875,
      "text": " it's pointing to Messiah who would come."
    },
    {
      "id": 205,
      "start": 529.1199951171875,
      "end": 530.760009765625,
      "text": " And we find that the Bible continues"
    },
    {
      "id": 206,
      "start": 530.760009765625,
      "end": 532.4400024414062,
      "text": " in verse number four again,"
    },
    {
      "id": 207,
      "start": 532.4400024414062,
      "end": 536.2000122070312,
      "text": " for it is not possible that the blood of bulls and of goats"
    },
    {
      "id": 208,
      "start": 536.2000122070312,
      "end": 538.52001953125,
      "text": " should take away sins."
    },
    {
      "id": 209,
      "start": 538.52001953125,
      "end": 541.260009765625,
      "text": " Now listen, for us in 2020,"
    },
    {
      "id": 210,
      "start": 541.280029296875,
      "end": 544.3200073242188,
      "text": " if you've been around church long enough,"
    },
    {
      "id": 211,
      "start": 544.3200073242188,
      "end": 548.0399780273438,
      "text": " this is common knowledge for us, right?"
    },
    {
      "id": 212,
      "start": 549.2000122070312,
      "end": 552.0399780273438,
      "text": " Think about the Israelite,"
    },
    {
      "id": 213,
      "start": 552.0399780273438,
      "end": 554.47998046875,
      "text": " think about this one that's Jewish,"
    },
    {
      "id": 214,
      "start": 554.47998046875,
      "end": 557.1599731445312,
      "text": " that is being written to these initial recipients"
    },
    {
      "id": 215,
      "start": 557.1599731445312,
      "end": 560.1599731445312,
      "text": " and think about the change that has happened"
    },
    {
      "id": 216,
      "start": 560.1599731445312,
      "end": 561.8400268554688,
      "text": " because of Calvary."
    },
    {
      "id": 217,
      "start": 561.8400268554688,
      "end": 565.4000244140625,
      "text": " Prior to Calvary, it was appropriate for them to go"
    },
    {
      "id": 218,
      "start": 565.4000244140625,
      "end": 568.1599731445312,
      "text": " and make these offerings, right?"
    },
    {
      "id": 219,
      "start": 568.1599731445312,
      "end": 570.0999755859375,
      "text": " And so depending on your age,"
    },
    {
      "id": 220,
      "start": 570.0999755859375,
      "end": 572.6599731445312,
      "text": " how old you were at the time of Calvary,"
    },
    {
      "id": 221,
      "start": 572.6599731445312,
      "end": 575.780029296875,
      "text": " all of those years before Calvary, this is what you did."
    },
    {
      "id": 222,
      "start": 575.780029296875,
      "end": 577.260009765625,
      "text": " This was your form of worship."
    },
    {
      "id": 223,
      "start": 577.260009765625,
      "end": 580.6400146484375,
      "text": " You went to the temple, you were mindful of this regularly."
    },
    {
      "id": 224,
      "start": 580.6400146484375,
      "end": 583.5800170898438,
      "text": " And now we find that Jesus has come,"
    },
    {
      "id": 225,
      "start": 583.5800170898438,
      "end": 586.3599853515625,
      "text": " he has settled the subject matter of sin."
    },
    {
      "id": 226,
      "start": 586.3599853515625,
      "end": 587.8599853515625,
      "text": " We dealt with that in chapter number nine"
    },
    {
      "id": 227,
      "start": 587.8599853515625,
      "end": 590.5399780273438,
      "text": " last Sunday morning, he has settled it."
    },
    {
      "id": 228,
      "start": 590.5399780273438,
      "end": 594.4600219726562,
      "text": " And so now no longer do we bring those offerings."
    },
    {
      "id": 229,
      "start": 594.4600219726562,
      "end": 597.8200073242188,
      "text": " And we find that the writer is saying to these individuals,"
    },
    {
      "id": 230,
      "start": 597.8200073242188,
      "end": 601.0800170898438,
      "text": " he's saying, it's not possible that the blood of."
    },
    {
      "id": 0,
      "start": 601.0800170898438,
      "end": 606.2400169372559,
      "text": " bulls and of goats should take away sins and we say amen hallelujah we know that"
    },
    {
      "id": 1,
      "start": 606.2400169372559,
      "end": 610.8000173568726,
      "text": " again consider the initial recipients of the book they're being confronted with"
    },
    {
      "id": 2,
      "start": 610.8000173568726,
      "end": 615.6000175476074,
      "text": " this truth and again what's happening is this thought of being pulled back into"
    },
    {
      "id": 3,
      "start": 615.6000175476074,
      "end": 620.0800170898438,
      "text": " Judaism and all that's taking place at this particular era for these believers"
    },
    {
      "id": 4,
      "start": 620.0800170898438,
      "end": 625.400016784668,
      "text": " we find that the the book of Hebrews is written to show that Christ is far"
    },
    {
      "id": 5,
      "start": 625.400016784668,
      "end": 631.9200172424316,
      "text": " better don't return to that system that system is inefficient it cannot it's"
    },
    {
      "id": 6,
      "start": 631.9200172424316,
      "end": 637.5600166320801,
      "text": " inadequate a better word it's inadequate it cannot cover sins it cannot atone for"
    },
    {
      "id": 7,
      "start": 637.5600166320801,
      "end": 644.2000160217285,
      "text": " your sins there is a remembrance of sin we find that there in verse number four"
    },
    {
      "id": 8,
      "start": 644.2000160217285,
      "end": 648.6000175476074,
      "text": " when it talks about the blood of bulls and of goats should take away sins and"
    },
    {
      "id": 9,
      "start": 648.6000175476074,
      "end": 652.9200172424316,
      "text": " of course again as you look at verses three and four what's in full view as we"
    },
    {
      "id": 10,
      "start": 652.9200172424316,
      "end": 657.3600158691406,
      "text": " found in chapter number nine and verse number seven was that specific day of"
    },
    {
      "id": 11,
      "start": 657.3600158691406,
      "end": 662.5200157165527,
      "text": " atonement again we mentioned that if you stand back and look in Leviticus chapter"
    },
    {
      "id": 12,
      "start": 662.5200157165527,
      "end": 666.5600204467773,
      "text": " number 16 and understand all of the details surrounding that which would be"
    },
    {
      "id": 13,
      "start": 666.5600204467773,
      "end": 670.5600204467773,
      "text": " done on that particular day and it was an important day for the nation of"
    },
    {
      "id": 14,
      "start": 670.5600204467773,
      "end": 676.6000137329102,
      "text": " Israel but we find that here the writer is is making it crystal clear he's"
    },
    {
      "id": 15,
      "start": 676.6000137329102,
      "end": 681.2400207519531,
      "text": " coming to a natural conclusion of all that he's presented really coming to a"
    },
    {
      "id": 16,
      "start": 681.3600158691406,
      "end": 686.2800140380859,
      "text": " climatic point if you will and he's saying it's that's not possible it's"
    },
    {
      "id": 17,
      "start": 686.2800140380859,
      "end": 691.7200164794922,
      "text": " any it's inadequate it's not going to work in verse 311 it says every priest"
    },
    {
      "id": 18,
      "start": 691.7200164794922,
      "end": 697.0400161743164,
      "text": " standeth daily ministering and offering oftentimes the same sacrifices again he"
    },
    {
      "id": 19,
      "start": 697.0400161743164,
      "end": 706.0400161743164,
      "text": " says this which can never take away sins so we see there's a remembrance of sins"
    },
    {
      "id": 20,
      "start": 706.0400161743164,
      "end": 710.3200149536133,
      "text": " Galatians 2 actually we'll go to Galatians 2 in just a moment let me look"
    },
    {
      "id": 21,
      "start": 710.3200149536133,
      "end": 714.2000198364258,
      "text": " at Galatians 3 let me share these verses with you in verse 21 and 22 in"
    },
    {
      "id": 22,
      "start": 714.2000198364258,
      "end": 720.7200164794922,
      "text": " Galatians chapter number 3 and we find here that the Apostle Paul is dealing"
    },
    {
      "id": 23,
      "start": 720.7200164794922,
      "end": 727.3200149536133,
      "text": " in giving truth with regard to the law and he says this in verse 21 and 22 of"
    },
    {
      "id": 24,
      "start": 727.3200149536133,
      "end": 734.0800170898438,
      "text": " Galatians 3 he says is the law then against the promises of God God forbid"
    },
    {
      "id": 25,
      "start": 734.1200103759766,
      "end": 740.0000152587891,
      "text": " for if it had been a law given which could have given life verily"
    },
    {
      "id": 26,
      "start": 740.0000152587891,
      "end": 747.4800109863281,
      "text": " righteousness should have been by the law but the scripture hath concluded all"
    },
    {
      "id": 27,
      "start": 747.4800109863281,
      "end": 754.5600128173828,
      "text": " under sin that the promise by faith of Jesus Christ might be given to them that"
    },
    {
      "id": 28,
      "start": 754.5600128173828,
      "end": 759.2000122070312,
      "text": " believe remember in verse 24 of this same text the Bible says that the law"
    },
    {
      "id": 29,
      "start": 759.2000122070312,
      "end": 765.4400177001953,
      "text": " was our schoolmaster to bring us unto Christ that we might be justified by"
    },
    {
      "id": 30,
      "start": 765.4400177001953,
      "end": 770.6800231933594,
      "text": " faith and we're mindful of the truth that the the law condemns the law shows"
    },
    {
      "id": 31,
      "start": 770.6800231933594,
      "end": 775.8800201416016,
      "text": " us that we're insufficient in fact the Apostle Paul says that he had not known"
    },
    {
      "id": 32,
      "start": 775.8800201416016,
      "end": 780.5600128173828,
      "text": " sin but by the law in Romans chapter number 7 he says for I had not known"
    },
    {
      "id": 33,
      "start": 780.5600128173828,
      "end": 784.8400115966797,
      "text": " lust except the law had said thou shalt not covet and so he's showing how that"
    },
    {
      "id": 34,
      "start": 784.8400115966797,
      "end": 790.52001953125,
      "text": " the law brings us to Christ and shows us our need of a Savior but in this Old"
    },
    {
      "id": 35,
      "start": 790.52001953125,
      "end": 795.2400207519531,
      "text": " Testament sacrificial system that is in view these sacrifices that are mentioned"
    },
    {
      "id": 36,
      "start": 795.2400207519531,
      "end": 799.760009765625,
      "text": " in verse number one which they offered year by year continually they could not"
    },
    {
      "id": 37,
      "start": 799.760009765625,
      "end": 805.5400238037109,
      "text": " make the comers there unto perfect there was a remembrance of sins number two the"
    },
    {
      "id": 38,
      "start": 805.5400238037109,
      "end": 811.6000213623047,
      "text": " remission of sins as we get into verses 5 through 18 we see this glorious truth"
    },
    {
      "id": 39,
      "start": 811.6000213623047,
      "end": 816.760009765625,
      "text": " with regard to the remission of sins the word remission means forgiveness or"
    },
    {
      "id": 40,
      "start": 816.760009765625,
      "end": 823.2800140380859,
      "text": " pardon of sins and literally carries the idea to let them go as if they had never"
    },
    {
      "id": 41,
      "start": 823.2800140380859,
      "end": 831.1600189208984,
      "text": " even been committed and it wonderful to have remission to be pardoned to be"
    },
    {
      "id": 42,
      "start": 831.1600189208984,
      "end": 836.8800201416016,
      "text": " forgiven what a joy we of course understand in the Old Testament there's"
    },
    {
      "id": 43,
      "start": 836.8800201416016,
      "end": 841.4400177001953,
      "text": " many times in which we reference the grace and mercy of God but even finding"
    },
    {
      "id": 44,
      "start": 841.4400177001953,
      "end": 845.3600158691406,
      "text": " within the Old Testament how that the psalmist would cry out that with thee"
    },
    {
      "id": 45,
      "start": 845.3600158691406,
      "end": 852.5600128173828,
      "text": " there is forgiveness I think about the prayers of Ezra and he mentions how that"
    },
    {
      "id": 46,
      "start": 852.5600128173828,
      "end": 859.280029296875,
      "text": " our God is a God who is ready to pardon and that wonderful he's ready to forgive"
    },
    {
      "id": 47,
      "start": 859.280029296875,
      "end": 864.0400085449219,
      "text": " with him there is forgiveness as we look at verses 5 through 18 and we begin to"
    },
    {
      "id": 48,
      "start": 864.0400085449219,
      "end": 867.8800048828125,
      "text": " consider the subject matter of the remission of sins we find here that"
    },
    {
      "id": 49,
      "start": 867.8800048828125,
      "end": 873.3600158691406,
      "text": " really there is a plan in verses 5 through 9 if we break up the section you"
    },
    {
      "id": 50,
      "start": 873.3600158691406,
      "end": 877.2000122070312,
      "text": " notice first of all the plan and again the writer of Hebrews will go back to"
    },
    {
      "id": 51,
      "start": 877.2000122070312,
      "end": 882.280029296875,
      "text": " the Old Testament and it's a reference to Psalm 40 verses 6 through 8 and as he"
    },
    {
      "id": 52,
      "start": 882.280029296875,
      "end": 886.8400268554688,
      "text": " references that Old Testament passage again as his as his custom has been"
    },
    {
      "id": 53,
      "start": 886.8400268554688,
      "end": 890.8800048828125,
      "text": " throughout the book of Hebrews he'll present this truth and he'll show that"
    },
    {
      "id": 54,
      "start": 890.8800048828125,
      "end": 895.0400085449219,
      "text": " Messiah the Lord Jesus Christ is the fulfillment so notice in verse number"
    },
    {
      "id": 55,
      "start": 895.0400085449219,
      "end": 900.2000122070312,
      "text": " 5 the Bible says wherefore when he cometh into the world he saith sacrifice"
    },
    {
      "id": 56,
      "start": 900.2000122070312,
      "end": 905.8400268554688,
      "text": " an offering thou wouldest not but a body hast thou prepared me in burnt offerings"
    },
    {
      "id": 57,
      "start": 905.8400268554688,
      "end": 912.760009765625,
      "text": " and sacrifices for sin thou hast had no pleasure then said I lo I come in the"
    },
    {
      "id": 58,
      "start": 912.760009765625,
      "end": 920.0800170898438,
      "text": " volume of the book it is written of me to do thy will Oh God we think often in"
    },
    {
      "id": 59,
      "start": 920.0800170898438,
      "end": 925.5600280761719,
      "text": " the book of John as we hear the subject matter of his hour and we consider how"
    },
    {
      "id": 60,
      "start": 925.5600280761719,
      "end": 929.5600280761719,
      "text": " that in John chapter number two really the first reference of his hour at the"
    },
    {
      "id": 61,
      "start": 929.5600280761719,
      "end": 934.6800231933594,
      "text": " the miracle there at the marriage at Cana and he says mine hour is not yet"
    },
    {
      "id": 62,
      "start": 934.6800231933594,
      "end": 940.1600036621094,
      "text": " come and you see multiple references to the hour throughout the book of John and"
    },
    {
      "id": 63,
      "start": 940.1600036621094,
      "end": 945.8000183105469,
      "text": " it comes to a great truth in John chapter number 17 when Jesus is praying"
    },
    {
      "id": 64,
      "start": 945.8000183105469,
      "end": 953.8000183105469,
      "text": " and he says father the hour is come and we find that the truth that we see in"
    },
    {
      "id": 65,
      "start": 953.8000183105469,
      "end": 958.6800231933594,
      "text": " Hebrews 10 in verse number 70 says then said I lo I come in the volume of the"
    },
    {
      "id": 66,
      "start": 958.6800231933594,
      "end": 965.0400085449219,
      "text": " book it is written of me to do thy will Oh God we understand the plan of"
    },
    {
      "id": 67,
      "start": 965.0400085449219,
      "end": 970.5600280761719,
      "text": " redemption we understand that before the foundation of the world the Bible tells"
    },
    {
      "id": 68,
      "start": 970.5600280761719,
      "end": 974.52001953125,
      "text": " us in first Peter chapter number one that Jesus is the lamb that was slain"
    },
    {
      "id": 69,
      "start": 974.52001953125,
      "end": 980.280029296875,
      "text": " before the foundation of the world that God had devised the plan of salvation of"
    },
    {
      "id": 70,
      "start": 980.280029296875,
      "end": 984.8400268554688,
      "text": " redemption see he knew that though he created Adam and Eve in a perfect"
    },
    {
      "id": 71,
      "start": 984.8400268554688,
      "end": 989.5600280761719,
      "text": " environment he knew that they would fall and that they would sin and because of"
    },
    {
      "id": 72,
      "start": 989.5600280761719,
      "end": 993.3600158691406,
      "text": " their sin there would need to be a sacrifice and he understood that"
    },
    {
      "id": 73,
      "start": 993.3600158691406,
      "end": 997.4800109863281,
      "text": " throughout the entirety of the Old Testament these sacrifices of blood would"
    },
    {
      "id": 74,
      "start": 997.4800109863281,
      "end": 1002.6800231933594,
      "text": " be a picture of the Lord Jesus Christ God in flesh who would come and make"
    },
    {
      "id": 75,
      "start": 1002.6800231933594,
      "end": 1008.8000183105469,
      "text": " that ultimate sacrifice when he offered himself we find here that in verse"
    },
    {
      "id": 76,
      "start": 1008.8000183105469,
      "end": 1012.760009765625,
      "text": " number eight the Bible says above back in Hebrews 10 in verse 8 above when he"
    },
    {
      "id": 77,
      "start": 1012.760009765625,
      "end": 1017.6200256347656,
      "text": " said sacrifice an offering and burnt offerings an offering of sin for sin"
    },
    {
      "id": 78,
      "start": 1017.6200256347656,
      "end": 1023.0800170898438,
      "text": " thou wouldest not neither hath pleasure therein which are offered by the law"
    },
    {
      "id": 79,
      "start": 1023.0800170898438,
      "end": 1029.6800231933594,
      "text": " again in verse 9 then said he lo I come to do thy will O God he taketh away the"
    },
    {
      "id": 80,
      "start": 1029.6800231933594,
      "end": 1036.0000305175781,
      "text": " first that he may establish the second we've mentioned about the first covenant"
    },
    {
      "id": 81,
      "start": 1036.0000305175781,
      "end": 1040.5600280761719,
      "text": " in the second covenant the new covenant as we've often referred to it in fact as"
    },
    {
      "id": 82,
      "start": 1040.5600280761719,
      "end": 1044.9200134277344,
      "text": " we studied the last section of chapter 8 we dealt with the new covenant and we"
    },
    {
      "id": 83,
      "start": 1044.9200134277344,
      "end": 1049.4800109863281,
      "text": " find that the reference will be made again in verses 16 through 18 in our"
    },
    {
      "id": 84,
      "start": 1049.4800109863281,
      "end": 1053.5600280761719,
      "text": " text of Scripture with regard to this new covenant and it's interesting as we"
    },
    {
      "id": 85,
      "start": 1053.5600280761719,
      "end": 1058.4800109863281,
      "text": " look at the passage of Scripture and we find that in verses 6 and 8 he mentions"
    },
    {
      "id": 86,
      "start": 1058.4800109863281,
      "end": 1063.2000122070312,
      "text": " about this fact that there was no pleasure in these offerings and these"
    },
    {
      "id": 87,
      "start": 1063.2000122070312,
      "end": 1069.1600036621094,
      "text": " sacrifices and we find that as you think about the history of Israel and you"
    },
    {
      "id": 88,
      "start": 1069.1600036621094,
      "end": 1077.0000305175781,
      "text": " think about their their offerings Isaiah calls them vain oblations see here's"
    },
    {
      "id": 89,
      "start": 1077.0000305175781,
      "end": 1081.8800048828125,
      "text": " what was happening in Israel's history again not necessarily that these people"
    },
    {
      "id": 90,
      "start": 1081.8800048828125,
      "end": 1086.3200073242188,
      "text": " would understand and maybe a greater context than we would because of their"
    },
    {
      "id": 91,
      "start": 1086.3200073242188,
      "end": 1091.8000183105469,
      "text": " closeness to the the Jewish tradition and all that they had gone through but"
    },
    {
      "id": 92,
      "start": 1091.8000183105469,
      "end": 1097.4800109863281,
      "text": " we find that they often were criticized they were condemned in the Old Testament"
    },
    {
      "id": 93,
      "start": 1097.4800109863281,
      "end": 1102.0400085449219,
      "text": " because of their vain oblations go back to the Isaiah 1 and see what the Lord"
    },
    {
      "id": 94,
      "start": 1102.0400085449219,
      "end": 1108.52001953125,
      "text": " says of course Isaiah is the prophet of God he's speaking the words of the Lord"
    },
    {
      "id": 95,
      "start": 1108.52001953125,
      "end": 1112.5600280761719,
      "text": " and we find that the indictment is given we'll look at a couple of chapters here"
    },
    {
      "id": 96,
      "start": 1112.5600280761719,
      "end": 1118.7999877929688,
      "text": " within the prophets and notice what is said about these vain oblations in verse"
    },
    {
      "id": 97,
      "start": 1118.7999877929688,
      "end": 1124.8800048828125,
      "text": " number 11 of Isaiah 1 to what purpose is the multitude of your sacrifices unto me"
    },
    {
      "id": 98,
      "start": 1124.8800048828125,
      "end": 1130.52001953125,
      "text": " sayeth the Lord I am full of the burnt offerings of rams and the fat of fed"
    },
    {
      "id": 99,
      "start": 1130.52001953125,
      "end": 1134.760009765625,
      "text": " beasts and I delight not in the blood of bullocks or of lambs or of he goats"
    },
    {
      "id": 100,
      "start": 1134.760009765625,
      "end": 1139.239990234375,
      "text": " verse 12 when you come to appear before me who hath required this at your hand"
    },
    {
      "id": 101,
      "start": 1139.239990234375,
      "end": 1147.280029296875,
      "text": " to tread my courts bring no more vain oblations empty offerings incense and"
    },
    {
      "id": 102,
      "start": 1147.280029296875,
      "end": 1150.8400268554688,
      "text": " an abomination unto me the new moons and Sabbaths the calling of assemblies I"
    },
    {
      "id": 103,
      "start": 1150.8400268554688,
      "end": 1156.1600341796875,
      "text": " cannot away with it is iniquity even the solemn meeting and we find that what was"
    },
    {
      "id": 104,
      "start": 1156.1600341796875,
      "end": 1159.7200317382812,
      "text": " happening of course we understand the sin of idolatry that the nation of"
    },
    {
      "id": 105,
      "start": 1159.7200317382812,
      "end": 1165.9600219726562,
      "text": " Israel was so often guilty of and they would make all sorts of offerings to"
    },
    {
      "id": 106,
      "start": 1165.9600219726562,
      "end": 1169.8800048828125,
      "text": " these false deities but we also understand that what was happening in"
    },
    {
      "id": 107,
      "start": 1169.8800048828125,
      "end": 1174.6400146484375,
      "text": " the nation of Israel is they would go through the motion but their heart was"
    },
    {
      "id": 108,
      "start": 1174.6400146484375,
      "end": 1182.9200439453125,
      "text": " not with God they would simply do the motion they would conform outwardly they"
    },
    {
      "id": 109,
      "start": 1182.9200439453125,
      "end": 1187.9200439453125,
      "text": " would do what had been prescribed thinking we've done what we've been told"
    },
    {
      "id": 110,
      "start": 1187.9200439453125,
      "end": 1194.9200439453125,
      "text": " to do their heart see God is interested in our heart he wants our heart I've"
    },
    {
      "id": 111,
      "start": 1194.9600219726562,
      "end": 1199.9200439453125,
      "text": " often said this if God has your heart he has all of you he has every part of you"
    },
    {
      "id": 112,
      "start": 1199.9200439453125,
      "end": 1202.9200439453125,
      "text": " and all"
    },
    {
      "id": 0,
      "start": 1202.9200439453125,
      "end": 1208.4600439071655,
      "text": " how we see what's happening in Israel's history and we understand that God is"
    },
    {
      "id": 1,
      "start": 1208.4600439071655,
      "end": 1212.5800437927246,
      "text": " saying, listen, if your heart's not right, don't bring those offerings. I'm not"
    },
    {
      "id": 2,
      "start": 1212.5800437927246,
      "end": 1216.9000434875488,
      "text": " pleased with those offerings. Jeremiah chapter number 6 and verse number 20"
    },
    {
      "id": 3,
      "start": 1216.9000434875488,
      "end": 1222.1800441741943,
      "text": " notice, again, a reference to this same type of behavior that is going on. In"
    },
    {
      "id": 4,
      "start": 1222.1800441741943,
      "end": 1227.1800441741943,
      "text": " fact, we understand much that is taking place in the book of Jeremiah and the"
    },
    {
      "id": 5,
      "start": 1227.1800441741943,
      "end": 1230.5800437927246,
      "text": " indictments that have been laid upon Judah throughout these first several"
    },
    {
      "id": 6,
      "start": 1230.5800437927246,
      "end": 1235.3000450134277,
      "text": " chapters of the book and we find that in verse number 20 the Bible says this,"
    },
    {
      "id": 7,
      "start": 1235.3000450134277,
      "end": 1239.5000457763672,
      "text": " To what purpose cometh there to me incense from Sheba and the sweet cane"
    },
    {
      "id": 8,
      "start": 1239.5000457763672,
      "end": 1246.060043334961,
      "text": " from a far country? Your burnt offerings are not acceptable, nor your sacrifices"
    },
    {
      "id": 9,
      "start": 1246.060043334961,
      "end": 1252.5800437927246,
      "text": " sweet unto me. It's pretty clear language, is it not? Notice what is said in Amos"
    },
    {
      "id": 10,
      "start": 1252.5800437927246,
      "end": 1258.6600456237793,
      "text": " chapter number 5. Turn to the minor prophet, the book of Amos, Hosea, Joel,"
    },
    {
      "id": 11,
      "start": 1258.6600456237793,
      "end": 1262.5000457763672,
      "text": " Amos, before Hosea is Daniel. Kind of give you a little bit of reference point."
    },
    {
      "id": 12,
      "start": 1262.5000457763672,
      "end": 1267.5000457763672,
      "text": " I often have heard as preachers would go to minor prophets, they say it's just"
    },
    {
      "id": 13,
      "start": 1267.5000457763672,
      "end": 1272.5400466918945,
      "text": " after Genesis and before Revelation. It's not very helpful, amen, but try to give"
    },
    {
      "id": 14,
      "start": 1272.5400466918945,
      "end": 1278.2200469970703,
      "text": " you a little reference point there. And Hosea, Joel, Amos. And Amos chapter 5,"
    },
    {
      "id": 15,
      "start": 1278.2200469970703,
      "end": 1285.3000411987305,
      "text": " look here in verse number 20. Shall not the day of the Lord be darkness and not"
    },
    {
      "id": 16,
      "start": 1285.3000411987305,
      "end": 1291.900047302246,
      "text": " light, even very dark and no brightness in it? I hate, I despise your feast days,"
    },
    {
      "id": 17,
      "start": 1291.900047302246,
      "end": 1296.6200408935547,
      "text": " and I will not smell in your solemn assemblies. Though ye offer me burnt"
    },
    {
      "id": 18,
      "start": 1296.6200408935547,
      "end": 1301.8600463867188,
      "text": " offerings and your meat offerings, I will not accept them, neither will I regard"
    },
    {
      "id": 19,
      "start": 1301.8600463867188,
      "end": 1307.5400466918945,
      "text": " the peace offerings of your fat beast. Take thou away from me the noise of thy"
    },
    {
      "id": 20,
      "start": 1307.5400466918945,
      "end": 1313.1000442504883,
      "text": " songs, for I will not hear the melody of thy vials. But let judgment run down as"
    },
    {
      "id": 21,
      "start": 1313.1000442504883,
      "end": 1317.7000427246094,
      "text": " waters, and righteousness as a mighty stream. Have you offered unto me"
    },
    {
      "id": 22,
      "start": 1317.7000427246094,
      "end": 1321.0200424194336,
      "text": " sacrifices and offerings in the wilderness forty years, O house of Israel?"
    },
    {
      "id": 23,
      "start": 1321.0200424194336,
      "end": 1326.900047302246,
      "text": " But ye have borne the tabernacle of your Molech and Chion, your images, the star of"
    },
    {
      "id": 24,
      "start": 1326.900047302246,
      "end": 1330.180046081543,
      "text": " your God, which you made to yourselves. Therefore will I cause you to go into"
    },
    {
      "id": 25,
      "start": 1330.180046081543,
      "end": 1336.7400512695312,
      "text": " captivity beyond Damascus, saith the Lord, whose name is the God of hosts. Again, we"
    },
    {
      "id": 26,
      "start": 1336.7400512695312,
      "end": 1341.5800476074219,
      "text": " see the idolatry mentioned here, specifically in verse number 26, and of"
    },
    {
      "id": 27,
      "start": 1341.5800476074219,
      "end": 1347.1800384521484,
      "text": " course the nation of Israel constantly dealing with the sin of idolatry, but we"
    },
    {
      "id": 28,
      "start": 1347.1800384521484,
      "end": 1351.5400390625,
      "text": " find that as we look back in Hebrews chapter number 10 and we understand"
    },
    {
      "id": 29,
      "start": 1351.5400390625,
      "end": 1357.7000427246094,
      "text": " what's happening and we see the plan that God is revealing here to these"
    },
    {
      "id": 30,
      "start": 1357.7000427246094,
      "end": 1363.9800415039062,
      "text": " recipients, these Jewish believers, that as we come to this climatic point"
    },
    {
      "id": 31,
      "start": 1363.9800415039062,
      "end": 1367.4200439453125,
      "text": " of the argument of the superiority of the priesthood of the Lord Jesus Christ,"
    },
    {
      "id": 32,
      "start": 1367.7400512695312,
      "end": 1372.1400451660156,
      "text": " he says, listen, the Old Testament is inadequate, that Old Testament sacrificial"
    },
    {
      "id": 33,
      "start": 1372.1400451660156,
      "end": 1376.5400390625,
      "text": " system inadequate. By the way, he points back to some historical times within the"
    },
    {
      "id": 34,
      "start": 1376.5400390625,
      "end": 1384.1400451660156,
      "text": " history of Israel that their heart was far from God. And now he comes to the"
    },
    {
      "id": 35,
      "start": 1384.1400451660156,
      "end": 1390.3800506591797,
      "text": " plan and he says, the plan that I have with regard to I come, remember he said"
    },
    {
      "id": 36,
      "start": 1390.3800506591797,
      "end": 1395.6200408935547,
      "text": " this, a body hast thou prepared me at the end of verse number five, I come, verse 7"
    },
    {
      "id": 37,
      "start": 1395.6200408935547,
      "end": 1403.1400451660156,
      "text": " and verse 9, to do thy will. And we find that the plan required a payment. The plan"
    },
    {
      "id": 38,
      "start": 1403.1400451660156,
      "end": 1408.1400451660156,
      "text": " required a payment, but there was only one payment that was acceptable, and that"
    },
    {
      "id": 39,
      "start": 1408.1400451660156,
      "end": 1413.6200408935547,
      "text": " was the blood of Jesus Christ. Again, we are familiar with this truth and as it's"
    },
    {
      "id": 40,
      "start": 1413.6200408935547,
      "end": 1418.300048828125,
      "text": " been presented throughout these chapters and we come to this 10th chapter and we"
    },
    {
      "id": 41,
      "start": 1418.300048828125,
      "end": 1424.8200378417969,
      "text": " see how it all comes together. Notice in verses 10 through 13 that that plan"
    },
    {
      "id": 42,
      "start": 1424.8200378417969,
      "end": 1429.4600372314453,
      "text": " that has been discussed required a payment and it's the precious blood of"
    },
    {
      "id": 43,
      "start": 1429.4600372314453,
      "end": 1434.1800384521484,
      "text": " the Lord Jesus Christ. In verse number 10, by the witch will we are sanctified"
    },
    {
      "id": 44,
      "start": 1434.1800384521484,
      "end": 1443.6600494384766,
      "text": " through the offering of the body of Jesus Christ once for all. We read verse"
    },
    {
      "id": 45,
      "start": 1443.6600494384766,
      "end": 1449.4200439453125,
      "text": " number 11 already, again another contrast between the single offering of the Lord"
    },
    {
      "id": 46,
      "start": 1449.4200439453125,
      "end": 1456.1400451660156,
      "text": " Jesus Christ that dealt with sin forever versus the continual offering of"
    },
    {
      "id": 47,
      "start": 1456.1400451660156,
      "end": 1460.5800476074219,
      "text": " that Old Testament sacrificial system that often caused the people to have"
    },
    {
      "id": 48,
      "start": 1460.5800476074219,
      "end": 1464.5400390625,
      "text": " that remembrance of sin. It could not take away sin and we read in verse"
    },
    {
      "id": 49,
      "start": 1464.5400390625,
      "end": 1469.4600524902344,
      "text": " number 12, but this man after he'd offered one sacrifice for sins forever"
    },
    {
      "id": 50,
      "start": 1469.4600524902344,
      "end": 1474.3400573730469,
      "text": " sat down on the right hand of God from henceforth expecting till his enemies be"
    },
    {
      "id": 51,
      "start": 1474.3400573730469,
      "end": 1479.780029296875,
      "text": " made his footstool. Isn't it amazing what the sacrifice of the Lord Jesus Christ"
    },
    {
      "id": 52,
      "start": 1479.780029296875,
      "end": 1485.2600402832031,
      "text": " accomplished on the cross of Calvary? And we think about this truth that we find"
    },
    {
      "id": 53,
      "start": 1485.2600402832031,
      "end": 1490.8600463867188,
      "text": " here that the the payment that was required because of that plan that was"
    },
    {
      "id": 54,
      "start": 1490.8600463867188,
      "end": 1495.6200561523438,
      "text": " that was put in place by God Almighty, that it was the precious blood of Christ."
    },
    {
      "id": 55,
      "start": 1495.6200561523438,
      "end": 1500.5800476074219,
      "text": " We understand John 3 16, for God so loved the world that he gave his only begotten"
    },
    {
      "id": 56,
      "start": 1500.780029296875,
      "end": 1506.1400451660156,
      "text": " son, right? And what did he he sent his son Jesus Christ not simply to come and"
    },
    {
      "id": 57,
      "start": 1506.1400451660156,
      "end": 1511.4200439453125,
      "text": " live upon this earth and then and be a good model and so on and so forth. No, he"
    },
    {
      "id": 58,
      "start": 1511.4200439453125,
      "end": 1516.4600524902344,
      "text": " was born to die. We understand that in his lifetime that he did leave us an"
    },
    {
      "id": 59,
      "start": 1516.4600524902344,
      "end": 1520.9000549316406,
      "text": " example that we should follow his steps. He is the perfect example, we understand"
    },
    {
      "id": 60,
      "start": 1520.9000549316406,
      "end": 1526.2200317382812,
      "text": " that, but he's more than an example. He's more than just a teacher. We know in"
    },
    {
      "id": 61,
      "start": 1526.2200317382812,
      "end": 1529.8200378417969,
      "text": " John chapter 3 Nicodemus says we know that thou art a teacher sent from God."
    },
    {
      "id": 62,
      "start": 1529.8600463867188,
      "end": 1536.6200561523438,
      "text": " He's so much greater than a teacher, amen? He is the truth. He's the Redeemer. He"
    },
    {
      "id": 63,
      "start": 1536.6200561523438,
      "end": 1544.1400451660156,
      "text": " came, what, to seek and to save. How would he save? Through his death, his burial, and"
    },
    {
      "id": 64,
      "start": 1544.1400451660156,
      "end": 1550.06005859375,
      "text": " his glorious resurrection. In fact, as we're mindful of the truth that is"
    },
    {
      "id": 65,
      "start": 1550.06005859375,
      "end": 1554.06005859375,
      "text": " before us of the payment, we understand that Peter would say that we're redeemed"
    },
    {
      "id": 66,
      "start": 1554.06005859375,
      "end": 1558.9200439453125,
      "text": " with the precious blood of Christ. In 1 Peter 1 in verse number 19, remember"
    },
    {
      "id": 67,
      "start": 1558.9200439453125,
      "end": 1563.6400451660156,
      "text": " the truth of Romans 5 in verse number 8, but God commended his love toward us in"
    },
    {
      "id": 68,
      "start": 1563.6400451660156,
      "end": 1569.9200439453125,
      "text": " that while we were yet sinners, Christ died for us. I want you to go back and"
    },
    {
      "id": 69,
      "start": 1569.9200439453125,
      "end": 1573.56005859375,
      "text": " look at a few verses of Scripture, if you would. Go back to Matthew chapter 26, and"
    },
    {
      "id": 70,
      "start": 1573.56005859375,
      "end": 1578.56005859375,
      "text": " we're just gonna go through a few verses of Scripture to show the remission of"
    },
    {
      "id": 71,
      "start": 1578.56005859375,
      "end": 1584.4400329589844,
      "text": " sin and the reality that the plan required this payment. In Matthew"
    },
    {
      "id": 72,
      "start": 1584.4400329589844,
      "end": 1590.4000549316406,
      "text": " chapter number 26, really on the eve of the Lord going to the cross of Calvary,"
    },
    {
      "id": 73,
      "start": 1590.4000549316406,
      "end": 1593.8400573730469,
      "text": " we understand that here within the text of Scripture, we'll read about the"
    },
    {
      "id": 74,
      "start": 1593.8400573730469,
      "end": 1598.6800537109375,
      "text": " betrayal and all that will take place in the hearing and what-have-you. In"
    },
    {
      "id": 75,
      "start": 1598.6800537109375,
      "end": 1603.7600402832031,
      "text": " chapter number 26 and verse number 28, as they are observing what we would often"
    },
    {
      "id": 76,
      "start": 1603.7600402832031,
      "end": 1608.2000427246094,
      "text": " refer to, the Passover there, the Lord's Supper, we reference this passage of"
    },
    {
      "id": 77,
      "start": 1608.2000427246094,
      "end": 1612.4400329589844,
      "text": " Scripture in verse 28, for this is my blood of the New Testament which is shed"
    },
    {
      "id": 78,
      "start": 1612.4800415039062,
      "end": 1618.56005859375,
      "text": " for many, what does he say, for the remission of sins. Remember the word"
    },
    {
      "id": 79,
      "start": 1618.56005859375,
      "end": 1622.9200439453125,
      "text": " remission, forgiveness or pardon of sins, the idea of letting them go as if they"
    },
    {
      "id": 80,
      "start": 1622.9200439453125,
      "end": 1629.3600463867188,
      "text": " had never been committed. See, our God is just. We have a problem in our nation"
    },
    {
      "id": 81,
      "start": 1629.3600463867188,
      "end": 1634.0400390625,
      "text": " today understanding justice. Amen? We really do. We have a problem understanding"
    },
    {
      "id": 82,
      "start": 1634.0400390625,
      "end": 1639.6800537109375,
      "text": " justice and equality. It's way, way gone as to what those words actually mean. Our"
    },
    {
      "id": 83,
      "start": 1639.9200439453125,
      "end": 1645.280029296875,
      "text": " God is just, and as a just God, he cannot just pretend that it never happened."
    },
    {
      "id": 84,
      "start": 1645.280029296875,
      "end": 1654.6200561523438,
      "text": " There had to be a payment, and Jesus said, I'll pay it. But the payment had to be"
    },
    {
      "id": 85,
      "start": 1654.6200561523438,
      "end": 1660.6400451660156,
      "text": " made, and the only payment that was acceptable was the payment that was made"
    },
    {
      "id": 86,
      "start": 1660.6400451660156,
      "end": 1666.4800415039062,
      "text": " by the Lord Jesus Christ, and therefore justice could be served. Why? Because the"
    },
    {
      "id": 87,
      "start": 1666.4800415039062,
      "end": 1671.9200439453125,
      "text": " fact that it had been paid for, the sin of mankind has been paid for with the"
    },
    {
      "id": 88,
      "start": 1671.9200439453125,
      "end": 1676.1600341796875,
      "text": " blood of Jesus Christ, and so he says that this Last Supper, he says, this is my"
    },
    {
      "id": 89,
      "start": 1676.1600341796875,
      "end": 1682.7600402832031,
      "text": " blood of the New Testament which is shed for many for the remission of sins. Go to"
    },
    {
      "id": 90,
      "start": 1682.7600402832031,
      "end": 1685.7600402832031,
      "text": " the book of Acts and understand as we look through the book of Acts, the"
    },
    {
      "id": 91,
      "start": 1685.7600402832031,
      "end": 1689.4400329589844,
      "text": " disciples as they're preaching, and I want you to consider in Acts chapter"
    },
    {
      "id": 92,
      "start": 1689.4400329589844,
      "end": 1694.0000305175781,
      "text": " number 2 and verse number 38 as Peter is preaching, and I want you to understand"
    },
    {
      "id": 93,
      "start": 1694.0000305175781,
      "end": 1698.800048828125,
      "text": " that Peter was there in that passage in Matthew 26. He heard what the Lord Jesus"
    },
    {
      "id": 94,
      "start": 1698.800048828125,
      "end": 1704.800048828125,
      "text": " Christ said, and between that moment in Matthew 26 and this one in Acts 2, some"
    },
    {
      "id": 95,
      "start": 1704.800048828125,
      "end": 1709.56005859375,
      "text": " amazing things happened historically. Jesus actually went to the cross. He had"
    },
    {
      "id": 96,
      "start": 1709.56005859375,
      "end": 1713.6000366210938,
      "text": " not gone to the cross yet in Matthew 26, but he said that this blood was going to"
    },
    {
      "id": 97,
      "start": 1713.6000366210938,
      "end": 1717.0000610351562,
      "text": " be shed for many for the remission of sins. What does he do? He goes to the"
    },
    {
      "id": 98,
      "start": 1717.0000610351562,
      "end": 1720.1600341796875,
      "text": " cross. By the way, did Peter, was he aware of the fact that Jesus went to the cross?"
    },
    {
      "id": 99,
      "start": 1720.1600341796875,
      "end": 1725.4000244140625,
      "text": " Sure he was. He denied him thrice, did he not? And we find that after that"
    },
    {
      "id": 100,
      "start": 1725.4000244140625,
      "end": 1730.4800415039062,
      "text": " situation that Jesus is put into a borrowed tomb, he rises on the third day"
    },
    {
      "id": 101,
      "start": 1730.4800415039062,
      "end": 1735.320068359375,
      "text": " conquering sin, death, and the grave. He appears to his disciples. By the way, he"
    },
    {
      "id": 102,
      "start": 1735.320068359375,
      "end": 1739.9600219726562,
      "text": " appears to Peter, does he not? And we find that as he appears to Peter, remember John"
    },
    {
      "id": 103,
      "start": 1739.9600219726562,
      "end": 1744.8400268554688,
      "text": " chapter number 21, and you read there how that they're fishing, and Jesus is on the"
    },
    {
      "id": 104,
      "start": 1744.8400268554688,
      "end": 1750.6800537109375,
      "text": " shore, and he says, hey, do you have any fish? No. There'd been another time in"
    },
    {
      "id": 105,
      "start": 1750.6800537109375,
      "end": 1753.8800659179688,
      "text": " which they'd been asked the same question, and they'd not caught any. In"
    },
    {
      "id": 106,
      "start": 1753.8800659179688,
      "end": 1757.8400268554688,
      "text": " fact, it was at the calling of Peter, and God gave him, the Lord Jesus Christ said,"
    },
    {
      "id": 107,
      "start": 1757.8400268554688,
      "end": 1764.4000244140625,
      "text": " hey, thrust out into the deep and cast out thy net for a draw of fishes, a draft"
    },
    {
      "id": 108,
      "start": 1764.4000244140625,
      "end": 1768.320068359375,
      "text": " of fishes, and we find that as we go through that passage of Scripture, we"
    },
    {
      "id": 109,
      "start": 1768.320068359375,
      "end": 1773.0800170898438,
      "text": " find that Peter initially was like, no, I mean, nevertheless, at thy will, we will."
    },
    {
      "id": 110,
      "start": 1773.1200561523438,
      "end": 1776.4400634765625,
      "text": " We toyed all the night, we caught nothing, but we'll do it. What'd they do? They"
    },
    {
      "id": 111,
      "start": 1776.4400634765625,
      "end": 1782.1200561523438,
      "text": " caught a great host of fish. But in John chapter number 21, then I think it was"
    },
    {
      "id": 112,
      "start": 1782.1200561523438,
      "end": 1787.8800659179688,
      "text": " probably their largest catch ever, and then John says, I think it's the Lord. As"
    },
    {
      "id": 113,
      "start": 1787.8800659179688,
      "end": 1793.8400268554688,
      "text": " Peter do, he gets up to shore real quick. We find that Jesus, he gives some"
    },
    {
      "id": 114,
      "start": 1793.8400268554688,
      "end": 1800.1200561523438,
      "text": " instruction. Peter, do you love me? Peter, do you love me? Peter, do you love me? Then we"
    },
    {
      "id": 115,
      "start": 1800.1200561523438,
      "end": 1804.7600708007812,
      "text": " find that Acts chapter number 1 is recorded for us."
    },
    {
      "id": 0,
      "start": 1804.7600708007812,
      "end": 1809.1600708961487,
      "text": " We find that they're the Great Commission, the Ascension of the Lord Jesus Christ."
    },
    {
      "id": 1,
      "start": 1809.1600708961487,
      "end": 1815.1600704193115,
      "text": " I mean, these are amazing events that have happened between Matthew chapter 26 and Acts chapter number 2."
    },
    {
      "id": 2,
      "start": 1815.1600704193115,
      "end": 1819.1600704193115,
      "text": " He tells them they're to stay there in Acts chapter number 1,"
    },
    {
      "id": 3,
      "start": 1819.1600704193115,
      "end": 1823.7600708007812,
      "text": " but you shall receive power after the Holy Ghost has come upon you."
    },
    {
      "id": 4,
      "start": 1823.7600708007812,
      "end": 1826.1600704193115,
      "text": " And so we find that they're there, they're tarrying,"
    },
    {
      "id": 5,
      "start": 1826.1600704193115,
      "end": 1831.1600704193115,
      "text": " and we find that the Holy Spirit comes, Pentecost, Acts chapter number 2,"
    },
    {
      "id": 6,
      "start": 1831.1600704193115,
      "end": 1832.9600715637207,
      "text": " and Peter is preaching."
    },
    {
      "id": 7,
      "start": 1833.1600704193115,
      "end": 1835.9600715637207,
      "text": " The message of Peter begins in verse number 14."
    },
    {
      "id": 8,
      "start": 1835.9600715637207,
      "end": 1838.7600708007812,
      "text": " We don't have time to read the entirety of the message,"
    },
    {
      "id": 9,
      "start": 1838.7600708007812,
      "end": 1842.7600708007812,
      "text": " but we find that in Acts 2, in verse number 37, notice what it says."
    },
    {
      "id": 10,
      "start": 1842.7600708007812,
      "end": 1847.3600692749023,
      "text": " Now when they heard this, they heard the message that Peter preached,"
    },
    {
      "id": 11,
      "start": 1847.3600692749023,
      "end": 1851.5600700378418,
      "text": " they were pricked in their heart and said unto Peter and to the rest of the apostles,"
    },
    {
      "id": 12,
      "start": 1851.5600700378418,
      "end": 1855.5600700378418,
      "text": " Men and brethren, what shall we do?"
    },
    {
      "id": 13,
      "start": 1855.5600700378418,
      "end": 1859.7600708007812,
      "text": " Then Peter said unto them, Repent and be baptized, every one of you, in the name of Jesus Christ."
    },
    {
      "id": 14,
      "start": 1859.7600708007812,
      "end": 1863.7600708007812,
      "text": " What does it say? For the remission of sins."
    },
    {
      "id": 15,
      "start": 1863.7600708007812,
      "end": 1866.1600723266602,
      "text": " And you shall receive the gift of the Holy Ghost."
    },
    {
      "id": 16,
      "start": 1866.1600723266602,
      "end": 1867.5600700378418,
      "text": " Why was it for the remission?"
    },
    {
      "id": 17,
      "start": 1867.5600700378418,
      "end": 1873.1600723266602,
      "text": " Or how could it be that Peter could offer this salvation, this remission of sins?"
    },
    {
      "id": 18,
      "start": 1873.1600723266602,
      "end": 1877.7600708007812,
      "text": " Because Jesus Christ shed his blood, because the payment was made."
    },
    {
      "id": 19,
      "start": 1877.7600708007812,
      "end": 1880.3600692749023,
      "text": " We find in Acts chapter number 10, notice,"
    },
    {
      "id": 20,
      "start": 1880.3600692749023,
      "end": 1883.7600708007812,
      "text": " as we continue to move forward here throughout the book of Acts,"
    },
    {
      "id": 21,
      "start": 1883.7600708007812,
      "end": 1886.560073852539,
      "text": " and we'll just use this as our last example."
    },
    {
      "id": 22,
      "start": 1886.560073852539,
      "end": 1891.1600723266602,
      "text": " Again, Peter is preaching here, and this is an amazing situation,"
    },
    {
      "id": 23,
      "start": 1891.1600723266602,
      "end": 1893.3600692749023,
      "text": " as we find in Acts chapter number 10, of course,"
    },
    {
      "id": 24,
      "start": 1893.3600692749023,
      "end": 1896.7600708007812,
      "text": " the situation with Cornelius and all that is taking place,"
    },
    {
      "id": 25,
      "start": 1896.7600708007812,
      "end": 1899.9600677490234,
      "text": " and how that Peter receives that vision from the Lord,"
    },
    {
      "id": 26,
      "start": 1899.9600677490234,
      "end": 1902.1600723266602,
      "text": " and Peter is given the instruction to go."
    },
    {
      "id": 27,
      "start": 1902.1600723266602,
      "end": 1905.9600677490234,
      "text": " He goes to the house of Cornelius, and I mean, they're just waiting for him to come,"
    },
    {
      "id": 28,
      "start": 1905.9600677490234,
      "end": 1909.1600723266602,
      "text": " and they're ready for him to speak to him."
    },
    {
      "id": 29,
      "start": 1909.1600723266602,
      "end": 1911.1600723266602,
      "text": " What an opportunity."
    },
    {
      "id": 30,
      "start": 1911.1600723266602,
      "end": 1912.560073852539,
      "text": " And Peter begins to preach."
    },
    {
      "id": 31,
      "start": 1912.560073852539,
      "end": 1914.1600723266602,
      "text": " In fact, in verse number 34, it says,"
    },
    {
      "id": 32,
      "start": 1914.1600723266602,
      "end": 1918.1600723266602,
      "text": " then Peter opened his mouth and begins to preach."
    },
    {
      "id": 33,
      "start": 1918.1600723266602,
      "end": 1920.9600677490234,
      "text": " And in verse number 43, the Bible says,"
    },
    {
      "id": 34,
      "start": 1920.9600677490234,
      "end": 1924.1600723266602,
      "text": " to him give all the prophets witness that through his name,"
    },
    {
      "id": 35,
      "start": 1924.1600723266602,
      "end": 1932.560073852539,
      "text": " whosoever believeth in him shall receive remission of sins."
    },
    {
      "id": 36,
      "start": 1932.560073852539,
      "end": 1934.1600646972656,
      "text": " This is a message that's being preached."
    },
    {
      "id": 37,
      "start": 1934.1600646972656,
      "end": 1939.9600677490234,
      "text": " Why? Because it's the message that we've been instructed to deliver, to preach."
    },
    {
      "id": 38,
      "start": 1940.1600646972656,
      "end": 1945.1600646972656,
      "text": " You find the theme of this subject throughout the New Testament."
    },
    {
      "id": 39,
      "start": 1945.1600646972656,
      "end": 1949.560073852539,
      "text": " You find this preaching of the gospel for the remission of sin."
    },
    {
      "id": 40,
      "start": 1949.560073852539,
      "end": 1952.3600769042969,
      "text": " And we come back to Hebrews chapter number 10,"
    },
    {
      "id": 41,
      "start": 1952.3600769042969,
      "end": 1955.1600646972656,
      "text": " and we see the payment that was made,"
    },
    {
      "id": 42,
      "start": 1955.1600646972656,
      "end": 1958.9600677490234,
      "text": " and we find that the plan had been established."
    },
    {
      "id": 43,
      "start": 1958.9600677490234,
      "end": 1961.3600769042969,
      "text": " It required, however, a payment."
    },
    {
      "id": 44,
      "start": 1961.3600769042969,
      "end": 1965.7600708007812,
      "text": " The payment resulted in the pardon."
    },
    {
      "id": 45,
      "start": 1965.7600708007812,
      "end": 1967.9600677490234,
      "text": " I'm so thankful for the pardon."
    },
    {
      "id": 46,
      "start": 1967.9600677490234,
      "end": 1970.1600646972656,
      "text": " As you go back to Hebrews chapter number 10,"
    },
    {
      "id": 47,
      "start": 1970.1600646972656,
      "end": 1972.1600646972656,
      "text": " and you look at verses 14 through 18,"
    },
    {
      "id": 48,
      "start": 1972.1600646972656,
      "end": 1977.1600646972656,
      "text": " you see the reference that is given here with regard to what the payment,"
    },
    {
      "id": 49,
      "start": 1977.1600646972656,
      "end": 1979.3600769042969,
      "text": " the precious blood of Christ accomplished,"
    },
    {
      "id": 50,
      "start": 1979.3600769042969,
      "end": 1982.3600769042969,
      "text": " what it resulted in, and that is the pardon."
    },
    {
      "id": 51,
      "start": 1982.3600769042969,
      "end": 1985.560073852539,
      "text": " In verse number 14, for by one offering,"
    },
    {
      "id": 52,
      "start": 1985.560073852539,
      "end": 1990.9600677490234,
      "text": " he hath perfected forever them that are sanctified."
    },
    {
      "id": 53,
      "start": 1990.9600677490234,
      "end": 1993.560073852539,
      "text": " Now let me ask you a really simple question."
    },
    {
      "id": 54,
      "start": 1993.560073852539,
      "end": 1996.560073852539,
      "text": " These New Testament, these first century believers,"
    },
    {
      "id": 55,
      "start": 1996.560073852539,
      "end": 1999.7600708007812,
      "text": " these Jewish believers, as they're dealing with all they're dealing with,"
    },
    {
      "id": 56,
      "start": 1999.7600708007812,
      "end": 2002.7600708007812,
      "text": " and they're told on this side, you have the law."
    },
    {
      "id": 57,
      "start": 2002.7600708007812,
      "end": 2004.560073852539,
      "text": " It's a shadow of good things to come."
    },
    {
      "id": 58,
      "start": 2004.560073852539,
      "end": 2007.3600769042969,
      "text": " And you offer all of these offerings, and you're very familiar with this,"
    },
    {
      "id": 59,
      "start": 2007.3600769042969,
      "end": 2010.7600708007812,
      "text": " and there's a remembrance of sin, and it's not possible."
    },
    {
      "id": 60,
      "start": 2010.7600708007812,
      "end": 2014.7600708007812,
      "text": " It can never take away sins. It's not possible."
    },
    {
      "id": 61,
      "start": 2014.7600708007812,
      "end": 2018.1600646972656,
      "text": " And then on this side, we have the sacrifice of the Lord Jesus Christ,"
    },
    {
      "id": 62,
      "start": 2018.1600646972656,
      "end": 2020.1600646972656,
      "text": " by the way, that took place one time."
    },
    {
      "id": 63,
      "start": 2020.1600646972656,
      "end": 2025.560073852539,
      "text": " And it did, it handled, it took care of the sin of mankind"
    },
    {
      "id": 64,
      "start": 2025.560073852539,
      "end": 2028.3600769042969,
      "text": " with one sacrifice for sins forever."
    },
    {
      "id": 65,
      "start": 2028.3600769042969,
      "end": 2030.3600769042969,
      "text": " And by this one offering,"
    },
    {
      "id": 66,
      "start": 2030.3600769042969,
      "end": 2033.560073852539,
      "text": " he hath perfected forever them that are sanctified."
    },
    {
      "id": 67,
      "start": 2033.560073852539,
      "end": 2035.9600677490234,
      "text": " Which one do you want?"
    },
    {
      "id": 68,
      "start": 2035.9600677490234,
      "end": 2039.7600708007812,
      "text": " It's kind of a no-brainer, is it not?"
    },
    {
      "id": 69,
      "start": 2039.7600708007812,
      "end": 2043.1600646972656,
      "text": " I'm going to go with the one that is sufficient."
    },
    {
      "id": 70,
      "start": 2043.1600646972656,
      "end": 2047.560073852539,
      "text": " I'm going to go with the one that satisfies God Almighty."
    },
    {
      "id": 71,
      "start": 2047.560073852539,
      "end": 2050.360076904297,
      "text": " And the pardon that is offered,"
    },
    {
      "id": 72,
      "start": 2050.360076904297,
      "end": 2054.1600646972656,
      "text": " it's perfected forever them that are sanctified."
    },
    {
      "id": 73,
      "start": 2054.1600646972656,
      "end": 2055.360076904297,
      "text": " Notice verse 15,"
    },
    {
      "id": 74,
      "start": 2055.360076904297,
      "end": 2057.7600708007812,
      "text": " whereof the Holy Ghost also is a witness to us,"
    },
    {
      "id": 75,
      "start": 2057.7600708007812,
      "end": 2059.9600677490234,
      "text": " for after that he had said before."
    },
    {
      "id": 76,
      "start": 2059.9600677490234,
      "end": 2062.360076904297,
      "text": " Now we find again another reference to the Old Testament,"
    },
    {
      "id": 77,
      "start": 2062.360076904297,
      "end": 2063.9600830078125,
      "text": " in verses 16 through 18,"
    },
    {
      "id": 78,
      "start": 2063.9600830078125,
      "end": 2066.56005859375,
      "text": " we find the new covenant being referenced again."
    },
    {
      "id": 79,
      "start": 2066.56005859375,
      "end": 2070.7600708007812,
      "text": " This is that quote that we looked at in Hebrews chapter number 8,"
    },
    {
      "id": 80,
      "start": 2070.7600708007812,
      "end": 2072.7600708007812,
      "text": " in verses 6 through 13,"
    },
    {
      "id": 81,
      "start": 2072.7600708007812,
      "end": 2074.56005859375,
      "text": " and we're not going to review all of that,"
    },
    {
      "id": 82,
      "start": 2074.56005859375,
      "end": 2077.7600708007812,
      "text": " but really it goes back to Jeremiah chapter 31,"
    },
    {
      "id": 83,
      "start": 2077.7600708007812,
      "end": 2079.9600830078125,
      "text": " and it deals with this new covenant."
    },
    {
      "id": 84,
      "start": 2079.9600830078125,
      "end": 2083.9600830078125,
      "text": " And notice what is said in verses 16, 17, and 18,"
    },
    {
      "id": 85,
      "start": 2083.9600830078125,
      "end": 2087.9600830078125,
      "text": " and what a blessed truth is given with regard to this pardon."
    },
    {
      "id": 86,
      "start": 2087.9600830078125,
      "end": 2089.360076904297,
      "text": " He says in verse 16,"
    },
    {
      "id": 87,
      "start": 2089.360076904297,
      "end": 2092.360076904297,
      "text": " this is the covenant that I will make with them after those days,"
    },
    {
      "id": 88,
      "start": 2092.360076904297,
      "end": 2095.9600830078125,
      "text": " sayeth the Lord, I will put my laws into their hearts,"
    },
    {
      "id": 89,
      "start": 2095.9600830078125,
      "end": 2097.9600830078125,
      "text": " and in their minds will I write them,"
    },
    {
      "id": 90,
      "start": 2097.9600830078125,
      "end": 2100.7600708007812,
      "text": " and their sins and iniquities will I remember no more."
    },
    {
      "id": 91,
      "start": 2100.7600708007812,
      "end": 2103.7600708007812,
      "text": " Now where remission of these is,"
    },
    {
      "id": 92,
      "start": 2103.7600708007812,
      "end": 2108.360076904297,
      "text": " there is no more offering for sin."
    },
    {
      "id": 93,
      "start": 2108.360076904297,
      "end": 2110.7600708007812,
      "text": " As we look at these three verses of Scripture,"
    },
    {
      "id": 94,
      "start": 2110.7600708007812,
      "end": 2112.7600708007812,
      "text": " we'll remind ourselves of the truth"
    },
    {
      "id": 95,
      "start": 2112.7600708007812,
      "end": 2115.9600830078125,
      "text": " from that 8th chapter when we looked at verses 6"
    },
    {
      "id": 96,
      "start": 2115.9600830078125,
      "end": 2118.1600646972656,
      "text": " down through verse number 13,"
    },
    {
      "id": 97,
      "start": 2118.1600646972656,
      "end": 2121.360076904297,
      "text": " and we dealt with that second, that new covenant."
    },
    {
      "id": 98,
      "start": 2121.360076904297,
      "end": 2122.9600830078125,
      "text": " And as we dealt with the new covenant,"
    },
    {
      "id": 99,
      "start": 2122.9600830078125,
      "end": 2125.9600830078125,
      "text": " we spent a lot of time dealing with the fact of"
    },
    {
      "id": 100,
      "start": 2125.9600830078125,
      "end": 2128.7600708007812,
      "text": " specifically how it relates to Israel."
    },
    {
      "id": 101,
      "start": 2128.7600708007812,
      "end": 2131.7600708007812,
      "text": " There's a promise that's given to Israel."
    },
    {
      "id": 102,
      "start": 2131.7600708007812,
      "end": 2133.1600646972656,
      "text": " We understand that."
    },
    {
      "id": 103,
      "start": 2133.1600646972656,
      "end": 2136.7600708007812,
      "text": " And we went through, and if you did not hear that message,"
    },
    {
      "id": 104,
      "start": 2136.7600708007812,
      "end": 2138.56005859375,
      "text": " you could go back to that message,"
    },
    {
      "id": 105,
      "start": 2138.56005859375,
      "end": 2140.56005859375,
      "text": " it was entitled, A Better Covenant."
    },
    {
      "id": 106,
      "start": 2140.56005859375,
      "end": 2142.56005859375,
      "text": " I preached that on July the 19th,"
    },
    {
      "id": 107,
      "start": 2142.56005859375,
      "end": 2146.1600646972656,
      "text": " and we dealt with how the specifics of the covenant,"
    },
    {
      "id": 108,
      "start": 2146.1600646972656,
      "end": 2148.7600708007812,
      "text": " of this new covenant, how it relates to Israel."
    },
    {
      "id": 109,
      "start": 2148.7600708007812,
      "end": 2150.7600708007812,
      "text": " But then we mentioned how it relates"
    },
    {
      "id": 110,
      "start": 2150.7600708007812,
      "end": 2153.1600646972656,
      "text": " to individual believers today."
    },
    {
      "id": 111,
      "start": 2153.1600646972656,
      "end": 2154.7600708007812,
      "text": " We spent a lot of time looking at"
    },
    {
      "id": 112,
      "start": 2154.7600708007812,
      "end": 2156.7600708007812,
      "text": " a number of passages of Scripture,"
    },
    {
      "id": 113,
      "start": 2156.7600708007812,
      "end": 2159.360076904297,
      "text": " and we spoke about, in Romans chapter 11,"
    },
    {
      "id": 114,
      "start": 2159.360076904297,
      "end": 2160.9600830078125,
      "text": " how that we've been graft in,"
    },
    {
      "id": 115,
      "start": 2160.9600830078125,
      "end": 2163.1600646972656,
      "text": " and what a joy to understand"
    },
    {
      "id": 116,
      "start": 2163.1600646972656,
      "end": 2165.56005859375,
      "text": " all of the dynamics of that truth."
    },
    {
      "id": 117,
      "start": 2165.56005859375,
      "end": 2168.7600708007812,
      "text": " And we find here at the end of the section"
    },
    {
      "id": 118,
      "start": 2168.7600708007812,
      "end": 2170.1600646972656,
      "text": " we're studying here this morning,"
    },
    {
      "id": 119,
      "start": 2170.1600646972656,
      "end": 2171.9600830078125,
      "text": " in verses 16 through 18,"
    },
    {
      "id": 120,
      "start": 2171.9600830078125,
      "end": 2174.360076904297,
      "text": " this comes in focus again."
    },
    {
      "id": 121,
      "start": 2174.360076904297,
      "end": 2176.9600830078125,
      "text": " And He gives to us the result,"
    },
    {
      "id": 122,
      "start": 2176.9600830078125,
      "end": 2178.7600708007812,
      "text": " this pardon that is given."
    },
    {
      "id": 123,
      "start": 2178.7600708007812,
      "end": 2181.9600830078125,
      "text": " Notice, I will put My laws into their hearts,"
    },
    {
      "id": 124,
      "start": 2181.9600830078125,
      "end": 2183.360076904297,
      "text": " and in their minds will I write them."
    },
    {
      "id": 125,
      "start": 2183.360076904297,
      "end": 2184.56005859375,
      "text": " Notice verse 17,"
    },
    {
      "id": 126,
      "start": 2184.56005859375,
      "end": 2188.7600708007812,
      "text": " and their sins and iniquities will I remember no more."
    },
    {
      "id": 127,
      "start": 2188.7600708007812,
      "end": 2191.9600830078125,
      "text": " That's in direct contrast to that Levitical system"
    },
    {
      "id": 128,
      "start": 2191.9600830078125,
      "end": 2194.360076904297,
      "text": " that we see in the beginning of Hebrews 10."
    },
    {
      "id": 129,
      "start": 2194.360076904297,
      "end": 2196.9600830078125,
      "text": " In fact, specifically in verse 3,"
    },
    {
      "id": 130,
      "start": 2196.9600830078125,
      "end": 2199.1600646972656,
      "text": " it says that there is a remembrance again"
    },
    {
      "id": 131,
      "start": 2199.1600646972656,
      "end": 2202.56005859375,
      "text": " made of sins every year."
    },
    {
      "id": 132,
      "start": 2202.56005859375,
      "end": 2204.7600708007812,
      "text": " And He says that this pardon,"
    },
    {
      "id": 133,
      "start": 2204.7600708007812,
      "end": 2206.56005859375,
      "text": " He says that their sins and iniquities"
    },
    {
      "id": 134,
      "start": 2206.56005859375,
      "end": 2207.7600708007812,
      "text": " will I remember no more."
    },
    {
      "id": 135,
      "start": 2207.7600708007812,
      "end": 2210.56005859375,
      "text": " Notice, now where remission of these is,"
    },
    {
      "id": 136,
      "start": 2210.56005859375,
      "end": 2214.56005859375,
      "text": " there is no more offering for sin."
    },
    {
      "id": 137,
      "start": 2214.56005859375,
      "end": 2216.7600708007812,
      "text": " What He's saying in verse 18"
    },
    {
      "id": 138,
      "start": 2216.7600708007812,
      "end": 2219.9600830078125,
      "text": " is that there's only one acceptable payment for sin,"
    },
    {
      "id": 139,
      "start": 2219.9600830078125,
      "end": 2221.360076904297,
      "text": " and it's been made."
    },
    {
      "id": 140,
      "start": 2221.360076904297,
      "end": 2224.7600708007812,
      "text": " There's nothing else that you can do."
    },
    {
      "id": 141,
      "start": 2224.7600708007812,
      "end": 2226.56005859375,
      "text": " You want to stick to that Old Testament"
    },
    {
      "id": 142,
      "start": 2226.56005859375,
      "end": 2228.9600830078125,
      "text": " sacrificial system and make all of those sacrifices,"
    },
    {
      "id": 143,
      "start": 2228.9600830078125,
      "end": 2232.56005859375,
      "text": " it's not going to work."
    },
    {
      "id": 144,
      "start": 2232.56005859375,
      "end": 2236.360076904297,
      "text": " So we have today a number of religious organizations"
    },
    {
      "id": 145,
      "start": 2236.360076904297,
      "end": 2238.1600646972656,
      "text": " that would teach that somehow"
    },
    {
      "id": 146,
      "start": 2238.1600646972656,
      "end": 2241.1600646972656,
      "text": " you need to achieve your own salvation."
    },
    {
      "id": 147,
      "start": 2241.1600646972656,
      "end": 2242.7600708007812,
      "text": " There are things that you need to do"
    },
    {
      "id": 148,
      "start": 2242.7600708007812,
      "end": 2245.360076904297,
      "text": " in order to obtain eternal life."
    },
    {
      "id": 149,
      "start": 2245.360076904297,
      "end": 2248.360076904297,
      "text": " The reality is that there's no more offering for sin."
    },
    {
      "id": 150,
      "start": 2248.360076904297,
      "end": 2250.7600708007812,
      "text": " Why? Because Jesus paid it all."
    },
    {
      "id": 151,
      "start": 2250.7600708007812,
      "end": 2252.56005859375,
      "text": " What did He say on the cross of Calvary?"
    },
    {
      "id": 152,
      "start": 2252.56005859375,
      "end": 2254.1600646972656,
      "text": " We understand there's seven last sayings"
    },
    {
      "id": 153,
      "start": 2254.1600646972656,
      "end": 2255.360076904297,
      "text": " of the Lord Jesus Christ."
    },
    {
      "id": 154,
      "start": 2255.360076904297,
      "end": 2256.7600708007812,
      "text": " One of them in particular,"
    },
    {
      "id": 155,
      "start": 2256.7600708007812,
      "end": 2261.56005859375,
      "text": " it is finished."
    },
    {
      "id": 156,
      "start": 2261.56005859375,
      "end": 2265.9600830078125,
      "text": " I've often used this terminology."
    },
    {
      "id": 157,
      "start": 2265.9600830078125,
      "end": 2267.56005859375,
      "text": " When He said it is finished,"
    },
    {
      "id": 158,
      "start": 2267.56005859375,
      "end": 2270.360076904297,
      "text": " He's saying it's done. Right?"
    },
    {
      "id": 159,
      "start": 2270.360076904297,
      "end": 2273.1600646972656,
      "text": " There's nothing that we need to do."
    },
    {
      "id": 160,
      "start": 2273.1600646972656,
      "end": 2275.1600646972656,
      "text": " There are some religious organizations"
    },
    {
      "id": 161,
      "start": 2275.1600646972656,
      "end": 2276.9600830078125,
      "text": " that speak about doing,"
    },
    {
      "id": 162,
      "start": 2276.9600830078125,
      "end": 2278.7600708007812,
      "text": " but Christ says no, it's finished."
    },
    {
      "id": 163,
      "start": 2278.7600708007812,
      "end": 2279.56005859375,
      "text": " It's done."
    },
    {
      "id": 164,
      "start": 2279.56005859375,
      "end": 2281.1600646972656,
      "text": " All you have to do is have"
    },
    {
      "id": 165,
      "start": 2281.1600646972656,
      "end": 2283.7600708007812,
      "text": " the righteousness of God imputed upon your account."
    },
    {
      "id": 166,
      "start": 2283.7600708007812,
      "end": 2285.56005859375,
      "text": " You receive the Lord Jesus Christ"
    },
    {
      "id": 167,
      "start": 2285.56005859375,
      "end": 2287.360076904297,
      "text": " as your personal Savior."
    },
    {
      "id": 168,
      "start": 2287.360076904297,
      "end": 2289.1600646972656,
      "text": " See, the gift of salvation,"
    },
    {
      "id": 169,
      "start": 2289.1600646972656,
      "end": 2291.360076904297,
      "text": " the gift of God which is eternal life,"
    },
    {
      "id": 170,
      "start": 2291.360076904297,
      "end": 2293.56005859375,
      "text": " is being offered to every human being,"
    },
    {
      "id": 171,
      "start": 2293.56005859375,
      "end": 2295.360076904297,
      "text": " every person, whosoever will may come."
    },
    {
      "id": 172,
      "start": 2295.360076904297,
      "end": 2296.9600830078125,
      "text": " We sang that song this morning."
    },
    {
      "id": 173,
      "start": 2296.9600830078125,
      "end": 2300.56005859375,
      "text": " Aren't you thankful for that truth?"
    },
    {
      "id": 174,
      "start": 2300.56005859375,
      "end": 2302.7600708007812,
      "text": " For whosoever shall call upon the name of the Lord"
    },
    {
      "id": 175,
      "start": 2302.7600708007812,
      "end": 2303.9600830078125,
      "text": " shall be saved."
    },
    {
      "id": 176,
      "start": 2303.9600830078125,
      "end": 2306.56005859375,
      "text": " I'm thankful for that truth of Scripture."
    },
    {
      "id": 177,
      "start": 2306.56005859375,
      "end": 2308.56005859375,
      "text": " Romans 10 and verse 13."
    },
    {
      "id": 178,
      "start": 2308.56005859375,
      "end": 2311.7600708007812,
      "text": " And as we understand the payment being made,"
    },
    {
      "id": 179,
      "start": 2311.7600708007812,
      "end": 2315.1600646972656,
      "text": " Jesus then offers the gift of eternal life,"
    },
    {
      "id": 180,
      "start": 2315.1600646972656,
      "end": 2316.7600708007812,
      "text": " and all you must do is receive,"
    },
    {
      "id": 181,
      "start": 2316.7600708007812,
      "end": 2317.7600708007812,
      "text": " accept that gift."
    },
    {
      "id": 182,
      "start": 2317.7600708007812,
      "end": 2319.9600830078125,
      "text": " You can reject it."
    },
    {
      "id": 183,
      "start": 2319.9600830078125,
      "end": 2322.1600952148438,
      "text": " Unfortunately, people do."
    },
    {
      "id": 184,
      "start": 2322.1600952148438,
      "end": 2324.1600952148438,
      "text": " They say, no, I'm going to try my own way."
    },
    {
      "id": 185,
      "start": 2324.1600952148438,
      "end": 2324.9600830078125,
      "text": " I'm going to do my own thing."
    },
    {
      "id": 186,
      "start": 2324.9600830078125,
      "end": 2326.56005859375,
      "text": " I'm going to follow this teaching,"
    },
    {
      "id": 187,
      "start": 2326.56005859375,
      "end": 2328.1600952148438,
      "text": " this religious organization."
    },
    {
      "id": 188,
      "start": 2328.1600952148438,
      "end": 2330.3600463867188,
      "text": " I'm going to follow their teaching."
    },
    {
      "id": 189,
      "start": 2330.3600463867188,
      "end": 2333.1600952148438,
      "text": " But we find here that the culmination"
    },
    {
      "id": 190,
      "start": 2333.1600952148438,
      "end": 2335.3600463867188,
      "text": " of all of this truth that has been given"
    },
    {
      "id": 191,
      "start": 2335.3600463867188,
      "end": 2338.3600463867188,
      "text": " is that where remission of these is,"
    },
    {
      "id": 192,
      "start": 2338.3600463867188,
      "end": 2339.9600830078125,
      "text": " how did the pardon come?"
    },
    {
      "id": 193,
      "start": 2339.9600830078125,
      "end": 2341.7600708007812,
      "text": " How did that forgiveness come?"
    },
    {
      "id": 194,
      "start": 2341.7600708007812,
      "end": 2343.1600952148438,
      "text": " Where did that remission come from?"
    },
    {
      "id": 195,
      "start": 2343.1600952148438,
      "end": 2345.7600708007812,
      "text": " It was through that payment, right?"
    },
    {
      "id": 196,
      "start": 2345.7600708007812,
      "end": 2348.56005859375,
      "text": " God had a plan, a plan of redemption,"
    },
    {
      "id": 197,
      "start": 2348.56005859375,
      "end": 2350.7600708007812,
      "text": " but that plan required a payment."
    },
    {
      "id": 198,
      "start": 2350.7600708007812,
      "end": 2353.1600952148438,
      "text": " The payment is the precious blood of Christ,"
    },
    {
      "id": 199,
      "start": 2353.1600952148438,
      "end": 2357.7600708007812,
      "text": " and we find that that payment results in a pardon."
    },
    {
      "id": 200,
      "start": 2357.7600708007812,
      "end": 2361.7600708007812,
      "text": " This morning, we can rejoice greatly"
    },
    {
      "id": 201,
      "start": 2361.7600708007812,
      "end": 2363.56005859375,
      "text": " in the fact that we've been forgiven,"
    },
    {
      "id": 202,
      "start": 2363.56005859375,
      "end": 2364.9600830078125,
      "text": " that we've been pardoned,"
    },
    {
      "id": 203,
      "start": 2364.9600830078125,
      "end": 2368.3600463867188,
      "text": " that there is remission of sin."
    },
    {
      "id": 204,
      "start": 2368.3600463867188,
      "end": 2371.56005859375,
      "text": " We find here that there's no more offering for sin,"
    },
    {
      "id": 205,
      "start": 2371.56005859375,
      "end": 2373.7600708007812,
      "text": " nothing else that could be acceptable."
    },
    {
      "id": 206,
      "start": 2373.7600708007812,
      "end": 2375.9600830078125,
      "text": " I'm mindful of what the Old Testament tells us."
    },
    {
      "id": 207,
      "start": 2375.9600830078125,
      "end": 2378.9600830078125,
      "text": " In fact, we sing about these truths often,"
    },
    {
      "id": 208,
      "start": 2378.9600830078125,
      "end": 2382.56005859375,
      "text": " about the truth of how that God forgives us"
    },
    {
      "id": 209,
      "start": 2382.56005859375,
      "end": 2385.56005859375,
      "text": " and what a joy it is to be forgiven."
    },
    {
      "id": 210,
      "start": 2385.56005859375,
      "end": 2388.3600463867188,
      "text": " And we find that in Psalm 103, in verse 12,"
    },
    {
      "id": 211,
      "start": 2388.3600463867188,
      "end": 2388.9600830078125,
      "text": " the Bible says,"
    },
    {
      "id": 212,
      "start": 2388.9600830078125,
      "end": 2390.9600830078125,
      "text": " as far as the east is from the west,"
    },
    {
      "id": 213,
      "start": 2390.9600830078125,
      "end": 2395.56005859375,
      "text": " so far hath He removed our transgressions from us."
    },
    {
      "id": 214,
      "start": 2395.56005859375,
      "end": 2397.1600952148438,
      "text": " Isn't that wonderful?"
    },
    {
      "id": 215,
      "start": 2397.1600952148438,
      "end": 2399.3600463867188,
      "text": " We find that in the book of Micah,"
    },
    {
      "id": 216,
      "start": 2399.3600463867188,
      "end": 2400.7600708007812,
      "text": " the Bible speaks about the fact"
    },
    {
      "id": 217,
      "start": 2400.7600708007812,
      "end": 2402.7600708007812,
      "text": " that they're buried in the sea."
    },
    {
      "id": 218,
      "start": 2402.7600708007812,
      "end": 2404.7600708007812,
      "text": " Notice in Micah 7, in verse number 19."
    },
    {
      "id": 0,
      "start": 2404.7600708007812,
      "end": 2407.320070743561,
      "text": " the Bible says He will turn again,"
    },
    {
      "id": 1,
      "start": 2407.320070743561,
      "end": 2409.0800709724426,
      "text": " He will have compassion upon us,"
    },
    {
      "id": 2,
      "start": 2409.0800709724426,
      "end": 2410.9200706481934,
      "text": " He will subdue our iniquities,"
    },
    {
      "id": 3,
      "start": 2410.9200706481934,
      "end": 2413.220070838928,
      "text": " and that will cast all their sins"
    },
    {
      "id": 4,
      "start": 2413.220070838928,
      "end": 2417.560070991516,
      "text": " into the depths of the sea."
    },
    {
      "id": 5,
      "start": 2417.560070991516,
      "end": 2419.720070838928,
      "text": " Isn't that wonderful?"
    },
    {
      "id": 6,
      "start": 2419.720070838928,
      "end": 2421.8400707244873,
      "text": " And we find here this morning"
    },
    {
      "id": 7,
      "start": 2421.8400707244873,
      "end": 2425.7600708007812,
      "text": " that as we are looking at this climatic point"
    },
    {
      "id": 8,
      "start": 2425.7600708007812,
      "end": 2428.200071334839,
      "text": " where the writer comes to these first 18 verses"
    },
    {
      "id": 9,
      "start": 2428.200071334839,
      "end": 2429.360071182251,
      "text": " of chapter 10,"
    },
    {
      "id": 10,
      "start": 2429.360071182251,
      "end": 2430.440071105957,
      "text": " and he says listen,"
    },
    {
      "id": 11,
      "start": 2430.440071105957,
      "end": 2433.560070037842,
      "text": " there's a remembrance of sin"
    },
    {
      "id": 12,
      "start": 2433.560070037842,
      "end": 2437.5200691223145,
      "text": " in that law that's a shadow of good things to come."
    },
    {
      "id": 13,
      "start": 2437.5200691223145,
      "end": 2440.4800720214844,
      "text": " But in what Jesus Christ offered"
    },
    {
      "id": 14,
      "start": 2440.4800720214844,
      "end": 2441.7600708007812,
      "text": " when He offered Himself,"
    },
    {
      "id": 15,
      "start": 2441.7600708007812,
      "end": 2443.280071258545,
      "text": " the offering that He made,"
    },
    {
      "id": 16,
      "start": 2443.280071258545,
      "end": 2446.120071411133,
      "text": " there is a remission of sin."
    },
    {
      "id": 17,
      "start": 2446.120071411133,
      "end": 2448.720069885254,
      "text": " The forgiveness, the pardon."
    },
    {
      "id": 18,
      "start": 2448.720069885254,
      "end": 2450.6800689697266,
      "text": " Now understand with me this morning"
    },
    {
      "id": 19,
      "start": 2450.6800689697266,
      "end": 2453.040069580078,
      "text": " that we find ourselves in the midst"
    },
    {
      "id": 20,
      "start": 2453.040069580078,
      "end": 2455.120071411133,
      "text": " of a generation that often as you speak"
    },
    {
      "id": 21,
      "start": 2455.120071411133,
      "end": 2457.560070037842,
      "text": " this message that is an important message"
    },
    {
      "id": 22,
      "start": 2457.560070037842,
      "end": 2458.560070037842,
      "text": " to deliver,"
    },
    {
      "id": 23,
      "start": 2458.560070037842,
      "end": 2460.840072631836,
      "text": " even as we've noted how in the book of Acts"
    },
    {
      "id": 24,
      "start": 2460.840072631836,
      "end": 2463.7600708007812,
      "text": " we're preaching this message of remission,"
    },
    {
      "id": 25,
      "start": 2463.7600708007812,
      "end": 2465.4800720214844,
      "text": " this pardon of sin"
    },
    {
      "id": 26,
      "start": 2465.4800720214844,
      "end": 2467.600070953369,
      "text": " because of what Jesus Christ accomplished"
    },
    {
      "id": 27,
      "start": 2467.600070953369,
      "end": 2468.9600677490234,
      "text": " on the cross of Calvary"
    },
    {
      "id": 28,
      "start": 2468.9600677490234,
      "end": 2470.4000701904297,
      "text": " that you will have some that say"
    },
    {
      "id": 29,
      "start": 2470.4000701904297,
      "end": 2471.720069885254,
      "text": " I'm doing the best I can,"
    },
    {
      "id": 30,
      "start": 2471.720069885254,
      "end": 2473.440071105957,
      "text": " I'm working, I'm trying."
    },
    {
      "id": 31,
      "start": 2473.440071105957,
      "end": 2476.16007232666,
      "text": " The reality is that Ephesians 2 in verses 8 and 9"
    },
    {
      "id": 32,
      "start": 2476.16007232666,
      "end": 2477.9600677490234,
      "text": " for by grace are you saved through faith"
    },
    {
      "id": 33,
      "start": 2477.9600677490234,
      "end": 2480.600067138672,
      "text": " and that not of yourselves is the gift of God,"
    },
    {
      "id": 34,
      "start": 2480.600067138672,
      "end": 2484.7600708007812,
      "text": " not of works lest any man should boast."
    },
    {
      "id": 35,
      "start": 2484.7600708007812,
      "end": 2486.8000717163086,
      "text": " Look at the book of Titus if you will,"
    },
    {
      "id": 36,
      "start": 2486.8000717163086,
      "end": 2488.8800735473633,
      "text": " turn just a few pages back"
    },
    {
      "id": 37,
      "start": 2488.8800735473633,
      "end": 2490.8000717163086,
      "text": " there from where you are in Hebrews"
    },
    {
      "id": 38,
      "start": 2490.8000717163086,
      "end": 2493.640068054199,
      "text": " and look at Titus chapter number 3"
    },
    {
      "id": 39,
      "start": 2493.640068054199,
      "end": 2496.0800704956055,
      "text": " and notice what is said here"
    },
    {
      "id": 40,
      "start": 2496.0800704956055,
      "end": 2499.2800674438477,
      "text": " with regard to salvation."
    },
    {
      "id": 41,
      "start": 2499.2800674438477,
      "end": 2501.9600677490234,
      "text": " The Bible says in Titus 3 and verse number 5,"
    },
    {
      "id": 42,
      "start": 2501.9600677490234,
      "end": 2504.9200744628906,
      "text": " not by works of righteousness"
    },
    {
      "id": 43,
      "start": 2504.9200744628906,
      "end": 2508.120071411133,
      "text": " which we have done."
    },
    {
      "id": 44,
      "start": 2508.120071411133,
      "end": 2510.640068054199,
      "text": " We can't work our way to heaven."
    },
    {
      "id": 45,
      "start": 2510.640068054199,
      "end": 2513.7600708007812,
      "text": " You can't be good enough to get to heaven."
    },
    {
      "id": 46,
      "start": 2513.7600708007812,
      "end": 2515.4800720214844,
      "text": " The Bible says there's none good."
    },
    {
      "id": 47,
      "start": 2515.4800720214844,
      "end": 2516.840072631836,
      "text": " No, not one."
    },
    {
      "id": 48,
      "start": 2516.840072631836,
      "end": 2518.4000701904297,
      "text": " Right? Romans 3."
    },
    {
      "id": 49,
      "start": 2518.4000701904297,
      "end": 2519.8000717163086,
      "text": " For all have sinned and come short"
    },
    {
      "id": 50,
      "start": 2519.840072631836,
      "end": 2521.9200744628906,
      "text": " in the glory of God."
    },
    {
      "id": 51,
      "start": 2521.9200744628906,
      "end": 2523.6800689697266,
      "text": " We say not by works of righteousness"
    },
    {
      "id": 52,
      "start": 2523.6800689697266,
      "end": 2524.8000717163086,
      "text": " which we have done,"
    },
    {
      "id": 53,
      "start": 2524.8000717163086,
      "end": 2529.4800720214844,
      "text": " but according to His mercy He saved us."
    },
    {
      "id": 54,
      "start": 2529.4800720214844,
      "end": 2531.120071411133,
      "text": " By the washing of regeneration,"
    },
    {
      "id": 55,
      "start": 2531.120071411133,
      "end": 2534.320068359375,
      "text": " renewing of the Holy Ghost."
    },
    {
      "id": 56,
      "start": 2534.320068359375,
      "end": 2536.600067138672,
      "text": " Aren't you thankful to be redeemed"
    },
    {
      "id": 57,
      "start": 2536.600067138672,
      "end": 2538.6400756835938,
      "text": " by the blood of the Lord Jesus Christ?"
    },
    {
      "id": 58,
      "start": 2538.6400756835938,
      "end": 2541.1600646972656,
      "text": " Notice this truth over in the book of 1 Peter."
    },
    {
      "id": 59,
      "start": 2541.1600646972656,
      "end": 2543.8800659179688,
      "text": " I mentioned in 1 Peter 1 and verse number 19"
    },
    {
      "id": 60,
      "start": 2543.8800659179688,
      "end": 2544.9200744628906,
      "text": " where the Bible speaks about"
    },
    {
      "id": 61,
      "start": 2544.9200744628906,
      "end": 2546.040069580078,
      "text": " the precious blood of Christ,"
    },
    {
      "id": 62,
      "start": 2546.040069580078,
      "end": 2547.9600677490234,
      "text": " but look at verse 18 along with it"
    },
    {
      "id": 63,
      "start": 2547.9600677490234,
      "end": 2552.320068359375,
      "text": " in 1 Peter 1, verses 18 and 19."
    },
    {
      "id": 64,
      "start": 2552.320068359375,
      "end": 2556.840072631836,
      "text": " The Bible says here,"
    },
    {
      "id": 65,
      "start": 2556.840072631836,
      "end": 2558.080078125,
      "text": " let's catch it all."
    },
    {
      "id": 66,
      "start": 2558.080078125,
      "end": 2559.8800659179688,
      "text": " Let's look at verse number 17 with it."
    },
    {
      "id": 67,
      "start": 2559.8800659179688,
      "end": 2560.6800689697266,
      "text": " Notice,"
    },
    {
      "id": 68,
      "start": 2560.6800689697266,
      "end": 2562.6400756835938,
      "text": " And if ye call on the Father,"
    },
    {
      "id": 69,
      "start": 2562.6400756835938,
      "end": 2565.280075073242,
      "text": " who without respect of persons"
    },
    {
      "id": 70,
      "start": 2565.280075073242,
      "end": 2567.2000732421875,
      "text": " judgeth according to every man's work,"
    },
    {
      "id": 71,
      "start": 2567.2000732421875,
      "end": 2569.560073852539,
      "text": " past the time of your sojourning here in fear,"
    },
    {
      "id": 72,
      "start": 2569.560073852539,
      "end": 2571.2400665283203,
      "text": " aren't you thankful that our God"
    },
    {
      "id": 73,
      "start": 2571.2400665283203,
      "end": 2573.9600677490234,
      "text": " is no respecter of persons?"
    },
    {
      "id": 74,
      "start": 2573.9600677490234,
      "end": 2575.4800720214844,
      "text": " He says in verse number 18,"
    },
    {
      "id": 75,
      "start": 2575.4800720214844,
      "end": 2577.6400756835938,
      "text": " For as much as ye know,"
    },
    {
      "id": 76,
      "start": 2577.6400756835938,
      "end": 2578.4800720214844,
      "text": " notice this,"
    },
    {
      "id": 77,
      "start": 2578.4800720214844,
      "end": 2582.600067138672,
      "text": " that ye were not redeemed with corruptible things,"
    },
    {
      "id": 78,
      "start": 2582.600067138672,
      "end": 2586.040069580078,
      "text": " as silver and gold from your vain conversation"
    },
    {
      "id": 79,
      "start": 2586.040069580078,
      "end": 2589.320068359375,
      "text": " received by tradition from your fathers."
    },
    {
      "id": 80,
      "start": 2589.320068359375,
      "end": 2591.800064086914,
      "text": " No, our redemption isn't with gold and silver,"
    },
    {
      "id": 81,
      "start": 2591.800064086914,
      "end": 2594.6400756835938,
      "text": " with those things that are corruptible."
    },
    {
      "id": 82,
      "start": 2594.6400756835938,
      "end": 2595.9600677490234,
      "text": " And we come to verse 19,"
    },
    {
      "id": 83,
      "start": 2595.9600677490234,
      "end": 2599.080078125,
      "text": " But with the precious blood of Christ,"
    },
    {
      "id": 84,
      "start": 2599.080078125,
      "end": 2601.600067138672,
      "text": " as of a lamb without blemish and without spot,"
    },
    {
      "id": 85,
      "start": 2601.600067138672,
      "end": 2603.0000762939453,
      "text": " who verily, notice,"
    },
    {
      "id": 86,
      "start": 2603.0000762939453,
      "end": 2605.6400756835938,
      "text": " was foreordained before the foundation of the world,"
    },
    {
      "id": 87,
      "start": 2605.6400756835938,
      "end": 2608.4400634765625,
      "text": " and was manifest in these last times for you,"
    },
    {
      "id": 88,
      "start": 2608.4400634765625,
      "end": 2610.360076904297,
      "text": " who by Him do believe in God,"
    },
    {
      "id": 89,
      "start": 2610.360076904297,
      "end": 2611.6800689697266,
      "text": " that raised Him up from the dead"
    },
    {
      "id": 90,
      "start": 2611.6800689697266,
      "end": 2612.9200744628906,
      "text": " and gave Him glory,"
    },
    {
      "id": 91,
      "start": 2612.9200744628906,
      "end": 2618.840072631836,
      "text": " that your faith and hope might be in God."
    },
    {
      "id": 92,
      "start": 2618.840072631836,
      "end": 2621.4400634765625,
      "text": " So we begin to consider this truth"
    },
    {
      "id": 93,
      "start": 2621.4400634765625,
      "end": 2623.2000732421875,
      "text": " that is before us this morning."
    },
    {
      "id": 94,
      "start": 2623.2000732421875,
      "end": 2625.560073852539,
      "text": " And we understand there's only one way"
    },
    {
      "id": 95,
      "start": 2625.560073852539,
      "end": 2626.800064086914,
      "text": " to have that pardon."
    },
    {
      "id": 96,
      "start": 2626.800064086914,
      "end": 2628.6400756835938,
      "text": " Paul said it this way in Galatians 2."
    },
    {
      "id": 97,
      "start": 2628.6400756835938,
      "end": 2629.9600677490234,
      "text": " In verse 21, he said,"
    },
    {
      "id": 98,
      "start": 2629.9600677490234,
      "end": 2631.7200775146484,
      "text": " I do not frustrate the grace of God."
    },
    {
      "id": 99,
      "start": 2631.7200775146484,
      "end": 2633.6400756835938,
      "text": " If righteousness came by the law,"
    },
    {
      "id": 100,
      "start": 2633.6400756835938,
      "end": 2639.2000732421875,
      "text": " then Christ is dead in vain."
    },
    {
      "id": 101,
      "start": 2639.2000732421875,
      "end": 2640.9200744628906,
      "text": " If we could keep the law and get to heaven,"
    },
    {
      "id": 102,
      "start": 2640.9200744628906,
      "end": 2644.0000762939453,
      "text": " there's no need for Christ to die."
    },
    {
      "id": 103,
      "start": 2644.0000762939453,
      "end": 2646.2400665283203,
      "text": " But the reality is that as we looked at already"
    },
    {
      "id": 104,
      "start": 2646.2400665283203,
      "end": 2648.6400756835938,
      "text": " in Galatians 3, verses 21 and 22,"
    },
    {
      "id": 105,
      "start": 2648.6400756835938,
      "end": 2650.7600708007812,
      "text": " the law could not give life."
    },
    {
      "id": 106,
      "start": 2650.7600708007812,
      "end": 2652.9200744628906,
      "text": " Therefore, Christ had to die."
    },
    {
      "id": 107,
      "start": 2652.9200744628906,
      "end": 2653.9200744628906,
      "text": " And can I tell you this morning"
    },
    {
      "id": 108,
      "start": 2653.9200744628906,
      "end": 2658.120071411133,
      "text": " that His death was not in vain."
    },
    {
      "id": 109,
      "start": 2658.120071411133,
      "end": 2659.8800659179688,
      "text": " We find that it was the perfect sacrifice"
    },
    {
      "id": 110,
      "start": 2659.8800659179688,
      "end": 2662.320068359375,
      "text": " that was acceptable by God the Father."
    },
    {
      "id": 111,
      "start": 2662.360076904297,
      "end": 2664.0000610351562,
      "text": " And this morning as we look at the truth"
    },
    {
      "id": 112,
      "start": 2664.0000610351562,
      "end": 2665.4400634765625,
      "text": " of Hebrews 10,"
    },
    {
      "id": 113,
      "start": 2665.4400634765625,
      "end": 2667.6400756835938,
      "text": " I really hope that this morning,"
    },
    {
      "id": 114,
      "start": 2667.6400756835938,
      "end": 2670.4400634765625,
      "text": " two things would be the result of our study"
    },
    {
      "id": 115,
      "start": 2670.4400634765625,
      "end": 2673.1200561523438,
      "text": " of these first 18 verses of Hebrews 10."
    },
    {
      "id": 116,
      "start": 2673.1200561523438,
      "end": 2675.8800659179688,
      "text": " Number one, I hope you would rejoice."
    },
    {
      "id": 117,
      "start": 2675.8800659179688,
      "end": 2679.1200561523438,
      "text": " I mean, it's a wonderful thing to be pardoned."
    },
    {
      "id": 118,
      "start": 2679.1200561523438,
      "end": 2680.080078125,
      "text": " Amen?"
    },
    {
      "id": 119,
      "start": 2680.080078125,
      "end": 2683.0000610351562,
      "text": " I mean, it's wonderful to have that remission of sins,"
    },
    {
      "id": 120,
      "start": 2683.0000610351562,
      "end": 2685.4800720214844,
      "text": " to understand that Jesus paid it all,"
    },
    {
      "id": 121,
      "start": 2685.4800720214844,
      "end": 2687.6800842285156,
      "text": " to understand that we are redeemed"
    },
    {
      "id": 122,
      "start": 2687.6800842285156,
      "end": 2688.8800659179688,
      "text": " by the blood of the Lamb,"
    },
    {
      "id": 123,
      "start": 2688.8800659179688,
      "end": 2690.2000732421875,
      "text": " that we can sing about it."
    },
    {
      "id": 124,
      "start": 2690.2000732421875,
      "end": 2691.800079345703,
      "text": " We sing plenty of songs."
    },
    {
      "id": 125,
      "start": 2691.800079345703,
      "end": 2693.9200744628906,
      "text": " Redeemed how I love to proclaim it."
    },
    {
      "id": 126,
      "start": 2693.9200744628906,
      "end": 2694.9600830078125,
      "text": " Redeemed how?"
    },
    {
      "id": 127,
      "start": 2694.9600830078125,
      "end": 2696.4000854492188,
      "text": " By the blood of the Lamb."
    },
    {
      "id": 128,
      "start": 2696.4000854492188,
      "end": 2698.080078125,
      "text": " Right? We sing about it."
    },
    {
      "id": 129,
      "start": 2698.080078125,
      "end": 2699.280059814453,
      "text": " And we ought to."
    },
    {
      "id": 130,
      "start": 2699.280059814453,
      "end": 2700.840057373047,
      "text": " We ought to rejoice in the fact"
    },
    {
      "id": 131,
      "start": 2700.840057373047,
      "end": 2701.6800842285156,
      "text": " that we've been redeemed,"
    },
    {
      "id": 132,
      "start": 2701.6800842285156,
      "end": 2703.1200561523438,
      "text": " that we've been forgiven,"
    },
    {
      "id": 133,
      "start": 2703.1200561523438,
      "end": 2705.360076904297,
      "text": " that we have been pardoned."
    },
    {
      "id": 134,
      "start": 2705.360076904297,
      "end": 2707.600067138672,
      "text": " What a joy."
    },
    {
      "id": 135,
      "start": 2707.600067138672,
      "end": 2709.080078125,
      "text": " The reality is, as I mentioned,"
    },
    {
      "id": 136,
      "start": 2709.080078125,
      "end": 2711.1600646972656,
      "text": " by that definition of remission,"
    },
    {
      "id": 137,
      "start": 2711.1600646972656,
      "end": 2713.840057373047,
      "text": " it says letting them go as if they had never been committed."
    },
    {
      "id": 138,
      "start": 2713.840057373047,
      "end": 2716.2000732421875,
      "text": " Again, not in the sense of I'm going to turn a blind eye."
    },
    {
      "id": 139,
      "start": 2716.2000732421875,
      "end": 2718.56005859375,
      "text": " Not in the sense of we're going to sweep it under the rug."
    },
    {
      "id": 140,
      "start": 2718.600067138672,
      "end": 2723.320068359375,
      "text": " But in the sense that Jesus paid it for you."
    },
    {
      "id": 141,
      "start": 2723.320068359375,
      "end": 2725.5200805664062,
      "text": " He paid a debt that He did not owe."
    },
    {
      "id": 142,
      "start": 2725.5200805664062,
      "end": 2728.1600646972656,
      "text": " He paid a debt that I could not pay."
    },
    {
      "id": 143,
      "start": 2728.1600646972656,
      "end": 2731.600067138672,
      "text": " There's nothing I could do to earn that forgiveness,"
    },
    {
      "id": 144,
      "start": 2731.600067138672,
      "end": 2733.7600708007812,
      "text": " to attain that salvation."
    },
    {
      "id": 145,
      "start": 2733.7600708007812,
      "end": 2736.0000610351562,
      "text": " It was given to me as a free gift"
    },
    {
      "id": 146,
      "start": 2736.0000610351562,
      "end": 2739.2000732421875,
      "text": " because God Himself died in my place."
    },
    {
      "id": 147,
      "start": 2739.2000732421875,
      "end": 2741.8800659179688,
      "text": " And I ought to rejoice in that."
    },
    {
      "id": 148,
      "start": 2741.8800659179688,
      "end": 2743.7600708007812,
      "text": " And so should you."
    },
    {
      "id": 149,
      "start": 2743.7600708007812,
      "end": 2747.9200744628906,
      "text": " I'm often mindful of the songwriter who said,"
    },
    {
      "id": 150,
      "start": 2747.9600830078125,
      "end": 2750.600067138672,
      "text": " I'm not discouraged."
    },
    {
      "id": 151,
      "start": 2750.600067138672,
      "end": 2752.600067138672,
      "text": " Why? Because I'm heaven-bound."
    },
    {
      "id": 152,
      "start": 2752.600067138672,
      "end": 2753.600067138672,
      "text": " Amen?"
    },
    {
      "id": 153,
      "start": 2753.600067138672,
      "end": 2756.040069580078,
      "text": " I mean, listen, I understand there's some things"
    },
    {
      "id": 154,
      "start": 2756.040069580078,
      "end": 2758.320068359375,
      "text": " in this world that can weigh heavy on our hearts."
    },
    {
      "id": 155,
      "start": 2758.320068359375,
      "end": 2760.7600708007812,
      "text": " I understand there are some things that we deal with"
    },
    {
      "id": 156,
      "start": 2760.7600708007812,
      "end": 2764.2400817871094,
      "text": " and there are some things that are struggles"
    },
    {
      "id": 157,
      "start": 2764.2400817871094,
      "end": 2765.9600830078125,
      "text": " and they're weights and they're heavy"
    },
    {
      "id": 158,
      "start": 2765.9600830078125,
      "end": 2767.1600646972656,
      "text": " and they're burdens,"
    },
    {
      "id": 159,
      "start": 2767.1600646972656,
      "end": 2771.0000610351562,
      "text": " but we understand that those things are just temporary."
    },
    {
      "id": 160,
      "start": 2771.0000610351562,
      "end": 2771.6800842285156,
      "text": " Right?"
    },
    {
      "id": 161,
      "start": 2771.6800842285156,
      "end": 2773.6400756835938,
      "text": " Paul said, while we look not at those things"
    },
    {
      "id": 162,
      "start": 2773.6400756835938,
      "end": 2774.5200805664062,
      "text": " which are temporal,"
    },
    {
      "id": 163,
      "start": 2774.5200805664062,
      "end": 2776.2000732421875,
      "text": " but at those things which are eternal."
    },
    {
      "id": 164,
      "start": 2776.2000732421875,
      "end": 2778.7600708007812,
      "text": " In fact, in 2 Corinthians 4, verses 17 and 18,"
    },
    {
      "id": 165,
      "start": 2778.7600708007812,
      "end": 2780.360076904297,
      "text": " when he deals with that wonderful truth"
    },
    {
      "id": 166,
      "start": 2780.360076904297,
      "end": 2783.4400634765625,
      "text": " about having that eternal perspective,"
    },
    {
      "id": 167,
      "start": 2783.4400634765625,
      "end": 2785.280059814453,
      "text": " he deals with, listen, he says,"
    },
    {
      "id": 168,
      "start": 2785.280059814453,
      "end": 2789.320068359375,
      "text": " our light affliction but which is for a moment."
    },
    {
      "id": 169,
      "start": 2789.320068359375,
      "end": 2791.7200622558594,
      "text": " Now, if you've studied anything about the life of Paul,"
    },
    {
      "id": 170,
      "start": 2791.7200622558594,
      "end": 2795.6800842285156,
      "text": " you understand that he dealt with quite a bit of affliction."
    },
    {
      "id": 171,
      "start": 2795.6800842285156,
      "end": 2796.5200805664062,
      "text": " Amen?"
    },
    {
      "id": 172,
      "start": 2796.5200805664062,
      "end": 2798.7600708007812,
      "text": " He dealt with quite a bit of difficulty."
    },
    {
      "id": 173,
      "start": 2798.7600708007812,
      "end": 2801.080078125,
      "text": " But yet when he looks at it in light of eternity,"
    },
    {
      "id": 174,
      "start": 2801.080078125,
      "end": 2805.1200561523438,
      "text": " he says, our light affliction but is for a moment."
    },
    {
      "id": 175,
      "start": 2805.1200561523438,
      "end": 2809.2000732421875,
      "text": " See, this morning we had to rejoice that we're heaven bound."
    },
    {
      "id": 176,
      "start": 2809.2000732421875,
      "end": 2812.1200561523438,
      "text": " The remission, the pardon that we've received."
    },
    {
      "id": 177,
      "start": 2812.1200561523438,
      "end": 2813.4000854492188,
      "text": " But can I tell you this morning"
    },
    {
      "id": 178,
      "start": 2813.4000854492188,
      "end": 2815.6400756835938,
      "text": " that in addition to rejoicing over the truth"
    },
    {
      "id": 179,
      "start": 2815.6400756835938,
      "end": 2817.1600646972656,
      "text": " that is presented to us here"
    },
    {
      "id": 180,
      "start": 2817.1600646972656,
      "end": 2821.0000610351562,
      "text": " in Hebrews 10, verses 1 through 18,"
    },
    {
      "id": 181,
      "start": 2821.0000610351562,
      "end": 2825.320068359375,
      "text": " I really hope that we'd be motivated to tell someone."
    },
    {
      "id": 182,
      "start": 2825.320068359375,
      "end": 2828.320068359375,
      "text": " That we'd be motivated to tell someone."
    },
    {
      "id": 183,
      "start": 2828.320068359375,
      "end": 2833.2000732421875,
      "text": " The reality is that there's a world that's dying."
    },
    {
      "id": 184,
      "start": 2833.2000732421875,
      "end": 2834.4800720214844,
      "text": " Every day."
    },
    {
      "id": 185,
      "start": 2834.4800720214844,
      "end": 2835.320068359375,
      "text": " Globally."
    },
    {
      "id": 186,
      "start": 2835.320068359375,
      "end": 2836.7600708007812,
      "text": " I understand everyone wants to talk about"
    },
    {
      "id": 187,
      "start": 2836.7600708007812,
      "end": 2838.6400756835938,
      "text": " the number of deaths from the pandemic."
    },
    {
      "id": 188,
      "start": 2838.6400756835938,
      "end": 2839.8800659179688,
      "text": " I understand that."
    },
    {
      "id": 189,
      "start": 2841.280059814453,
      "end": 2845.0000610351562,
      "text": " But you understand that every single day,"
    },
    {
      "id": 190,
      "start": 2845.0000610351562,
      "end": 2848.1600646972656,
      "text": " over 150,000 people die around the world."
    },
    {
      "id": 191,
      "start": 2848.1600646972656,
      "end": 2849.0000610351562,
      "text": " Every day."
    },
    {
      "id": 192,
      "start": 2851.360076904297,
      "end": 2856.360076904297,
      "text": " The pandemic has brought a certain level of reality"
    },
    {
      "id": 193,
      "start": 2856.6400756835938,
      "end": 2859.1200561523438,
      "text": " to people with regard to their mortality."
    },
    {
      "id": 194,
      "start": 2860.280059814453,
      "end": 2861.6400756835938,
      "text": " They're more aware of it."
    },
    {
      "id": 195,
      "start": 2862.600067138672,
      "end": 2864.360076904297,
      "text": " But you can look at studies."
    },
    {
      "id": 196,
      "start": 2864.360076904297,
      "end": 2866.1200561523438,
      "text": " In fact, I looked at some of them last week"
    },
    {
      "id": 197,
      "start": 2866.1200561523438,
      "end": 2869.840057373047,
      "text": " in comparing death rates daily of 2020"
    },
    {
      "id": 198,
      "start": 2869.840057373047,
      "end": 2871.4000854492188,
      "text": " to some previous years."
    },
    {
      "id": 199,
      "start": 2871.4000854492188,
      "end": 2874.040069580078,
      "text": " And really, the death rates are no different."
    },
    {
      "id": 200,
      "start": 2875.8800659179688,
      "end": 2878.4400634765625,
      "text": " People are not dying at an exponentially higher rate"
    },
    {
      "id": 201,
      "start": 2878.4400634765625,
      "end": 2879.7200622558594,
      "text": " because of coronavirus"
    },
    {
      "id": 202,
      "start": 2879.7200622558594,
      "end": 2881.9200744628906,
      "text": " than people are just dying every day anyway."
    },
    {
      "id": 203,
      "start": 2883.080078125,
      "end": 2885.080078125,
      "text": " Death is a certainty, right?"
    },
    {
      "id": 204,
      "start": 2885.080078125,
      "end": 2887.280059814453,
      "text": " People are dying every day."
    },
    {
      "id": 205,
      "start": 2887.280059814453,
      "end": 2890.320068359375,
      "text": " And we have an opportunity to give them this message."
    },
    {
      "id": 206,
      "start": 2890.320068359375,
      "end": 2892.1600646972656,
      "text": " Listen, that what you're doing,"
    },
    {
      "id": 207,
      "start": 2892.1600646972656,
      "end": 2896.2000732421875,
      "text": " the thing that you think is going to get you"
    },
    {
      "id": 208,
      "start": 2896.2000732421875,
      "end": 2898.1600646972656,
      "text": " right with God, it's not possible."
    },
    {
      "id": 209,
      "start": 2898.1600646972656,
      "end": 2900.0000610351562,
      "text": " There's only one possible,"
    },
    {
      "id": 210,
      "start": 2900.0000610351562,
      "end": 2901.4800720214844,
      "text": " there's only one acceptable way,"
    },
    {
      "id": 211,
      "start": 2901.4800720214844,
      "end": 2903.040069580078,
      "text": " and it's by the way of the cross."
    },
    {
      "id": 212,
      "start": 2903.040069580078,
      "end": 2905.320068359375,
      "text": " It's only through the blood of Jesus Christ"
    },
    {
      "id": 213,
      "start": 2905.320068359375,
      "end": 2907.600067138672,
      "text": " that you can have remission."
    },
    {
      "id": 214,
      "start": 2907.600067138672,
      "end": 2909.4400634765625,
      "text": " And begin to understand that we're living"
    },
    {
      "id": 215,
      "start": 2909.4400634765625,
      "end": 2912.1600646972656,
      "text": " in the midst of a generation in which people are dying"
    },
    {
      "id": 216,
      "start": 2912.1600646972656,
      "end": 2915.1200561523438,
      "text": " and they're dying and going to a Christless eternity."
    },
    {
      "id": 217,
      "start": 2915.1200561523438,
      "end": 2918.080078125,
      "text": " They're dying without the truth of salvation."
    },
    {
      "id": 218,
      "start": 2918.080078125,
      "end": 2919.6400756835938,
      "text": " And who's gonna tell them?"
    },
    {
      "id": 219,
      "start": 2921.320068359375,
      "end": 2925.60009765625,
      "text": " Nobody from the CDC is preparing anybody for death."
    },
    {
      "id": 220,
      "start": 2926.56005859375,
      "end": 2928.3600463867188,
      "text": " Nobody from the World Health Organization"
    },
    {
      "id": 221,
      "start": 2928.3600463867188,
      "end": 2930.1200561523438,
      "text": " is preparing anybody for death."
    },
    {
      "id": 222,
      "start": 2931.1600952148438,
      "end": 2933.56005859375,
      "text": " They're giving them particular things that they can do"
    },
    {
      "id": 223,
      "start": 2933.56005859375,
      "end": 2937.60009765625,
      "text": " in order to potentially prevent getting coronavirus"
    },
    {
      "id": 224,
      "start": 2937.60009765625,
      "end": 2938.6800537109375,
      "text": " and what have you."
    },
    {
      "id": 225,
      "start": 2938.6800537109375,
      "end": 2941.080078125,
      "text": " But the reality is that whether you die from COVID"
    },
    {
      "id": 226,
      "start": 2941.080078125,
      "end": 2943.1200561523438,
      "text": " or something else, we wanna give you truth"
    },
    {
      "id": 227,
      "start": 2943.1200561523438,
      "end": 2945.2400512695312,
      "text": " on how you can be prepared for death."
    },
    {
      "id": 228,
      "start": 2946.5200805664062,
      "end": 2949.2800903320312,
      "text": " In fact, I spoke to one of our elected officials"
    },
    {
      "id": 229,
      "start": 2949.2800903320312,
      "end": 2951.2400512695312,
      "text": " a couple months back."
    },
    {
      "id": 230,
      "start": 2951.2400512695312,
      "end": 2952.6800537109375,
      "text": " And I said, with all due respect,"
    },
    {
      "id": 231,
      "start": 2952.6800537109375,
      "end": 2954.6800537109375,
      "text": " I understand exactly what you're saying."
    },
    {
      "id": 232,
      "start": 2955.56005859375,
      "end": 2957.60009765625,
      "text": " I began to share with them the reality"
    },
    {
      "id": 233,
      "start": 2957.60009765625,
      "end": 2960.6800537109375,
      "text": " of the likelihood of potentially contracting"
    },
    {
      "id": 234,
      "start": 2960.6800537109375,
      "end": 2963.840087890625,
      "text": " and dying from COVID and the numbers"
    },
    {
      "id": 235,
      "start": 2963.840087890625,
      "end": 2967.320068359375,
      "text": " and how unlikely it was, though possible."
    },
    {
      "id": 236,
      "start": 2969.800048828125,
      "end": 2971.56005859375,
      "text": " So the reality is one day you will die,"
    },
    {
      "id": 237,
      "start": 2971.56005859375,
      "end": 2972.8800659179688,
      "text": " you'll die from something."
    },
    {
      "id": 238,
      "start": 2973.840087890625,
      "end": 2975.6400756835938,
      "text": " Are you prepared for that day?"
    },
    {
      "id": 239,
      "start": 2975.6400756835938,
      "end": 2978.320068359375,
      "text": " They said, I think our conversation is over."
    },
    {
      "id": 240,
      "start": 2978.3600463867188,
      "end": 2981.0000610351562,
      "text": " I was saddened by that response."
    },
    {
      "id": 241,
      "start": 2981.0000610351562,
      "end": 2983.0000610351562,
      "text": " The reality is that in that response,"
    },
    {
      "id": 242,
      "start": 2983.0000610351562,
      "end": 2984.6400756835938,
      "text": " I understood that the truth was that"
    },
    {
      "id": 243,
      "start": 2984.6400756835938,
      "end": 2986.4800415039062,
      "text": " they were not prepared for that day."
    },
    {
      "id": 244,
      "start": 2987.4400634765625,
      "end": 2989.9200439453125,
      "text": " You come in contact with people regularly."
    },
    {
      "id": 245,
      "start": 2989.9200439453125,
      "end": 2993.3600463867188,
      "text": " I understand that it's a lot more challenging today."
    },
    {
      "id": 246,
      "start": 2993.3600463867188,
      "end": 2994.4400634765625,
      "text": " I understand that."
    },
    {
      "id": 247,
      "start": 2995.56005859375,
      "end": 2998.320068359375,
      "text": " But can I tell you that the gospel still works?"
    },
    {
      "id": 248,
      "start": 2998.320068359375,
      "end": 3000.800048828125,
      "text": " The gospel still works."
    },
    {
      "id": 249,
      "start": 3000.800048828125,
      "end": 3004.800048828125,
      "text": " And as we would be purposed about taking a message,"
    },
    {
      "id": 0,
      "start": 3004.800048828125,
      "end": 3010.4000487327576,
      "text": " Listen, this is the greatest offer ever."
    },
    {
      "id": 1,
      "start": 3010.4000487327576,
      "end": 3013.1600484848022,
      "text": " That we say, listen, there's nothing you can do."
    },
    {
      "id": 2,
      "start": 3013.1600484848022,
      "end": 3015.1600484848022,
      "text": " You can do all of that stuff,"
    },
    {
      "id": 3,
      "start": 3015.1600484848022,
      "end": 3017.120048522949,
      "text": " but it's never going to take away sin."
    },
    {
      "id": 4,
      "start": 3017.120048522949,
      "end": 3018.8600492477417,
      "text": " You can go to church every day of your life."
    },
    {
      "id": 5,
      "start": 3018.8600492477417,
      "end": 3020.8600482940674,
      "text": " You can give as much of your income"
    },
    {
      "id": 6,
      "start": 3020.8600482940674,
      "end": 3022.120048522949,
      "text": " as you can possibly give."
    },
    {
      "id": 7,
      "start": 3022.120048522949,
      "end": 3023.7800483703613,
      "text": " You can pray whatever you want to pray."
    },
    {
      "id": 8,
      "start": 3023.7800483703613,
      "end": 3025.4000492095947,
      "text": " You can do whatever you want to do."
    },
    {
      "id": 9,
      "start": 3025.4000492095947,
      "end": 3029.6000480651855,
      "text": " It's never going to get you salvation."
    },
    {
      "id": 10,
      "start": 3029.6000480651855,
      "end": 3030.7600479125977,
      "text": " It's never going to work."
    },
    {
      "id": 11,
      "start": 3030.7600479125977,
      "end": 3031.640048980713,
      "text": " Why?"
    },
    {
      "id": 12,
      "start": 3031.640048980713,
      "end": 3034.0200481414795,
      "text": " Because God's plan said"
    },
    {
      "id": 13,
      "start": 3034.0200481414795,
      "end": 3036.460048675537,
      "text": " that there was a required payment,"
    },
    {
      "id": 14,
      "start": 3036.460048675537,
      "end": 3041.140048980713,
      "text": " and that that payment was only the blood of Christ."
    },
    {
      "id": 15,
      "start": 3041.140048980713,
      "end": 3043.140048980713,
      "text": " It was the only payment that was going to work."
    },
    {
      "id": 16,
      "start": 3043.140048980713,
      "end": 3045.2200469970703,
      "text": " And that's what results in pardon."
    },
    {
      "id": 17,
      "start": 3045.2200469970703,
      "end": 3048.460048675537,
      "text": " And so this morning, we have that truth."
    },
    {
      "id": 18,
      "start": 3048.460048675537,
      "end": 3050.140048980713,
      "text": " And it's good for us to rejoice in it."
    },
    {
      "id": 19,
      "start": 3050.140048980713,
      "end": 3051.540050506592,
      "text": " And we ought to."
    },
    {
      "id": 20,
      "start": 3051.540050506592,
      "end": 3054.900047302246,
      "text": " We ought to rejoice that we're heaven-bound."
    },
    {
      "id": 21,
      "start": 3054.900047302246,
      "end": 3056.980049133301,
      "text": " But can I tell you that we ought to purpose"
    },
    {
      "id": 22,
      "start": 3056.980049133301,
      "end": 3059.060047149658,
      "text": " to tell someone."
    },
    {
      "id": 23,
      "start": 3059.060047149658,
      "end": 3063.300048828125,
      "text": " There's a, I can't remember the dean knows it."
    },
    {
      "id": 24,
      "start": 3063.460048675537,
      "end": 3065.3400497436523,
      "text": " Is it 91.3 dean?"
    },
    {
      "id": 25,
      "start": 3065.3400497436523,
      "end": 3068.620048522949,
      "text": " That faith for the family, right?"
    },
    {
      "id": 26,
      "start": 3068.620048522949,
      "end": 3070.1400451660156,
      "text": " The news around here."
    },
    {
      "id": 27,
      "start": 3070.1400451660156,
      "end": 3073.200050354004,
      "text": " And there's a particular segment"
    },
    {
      "id": 28,
      "start": 3073.200050354004,
      "end": 3075.500045776367,
      "text": " on that particular radio station,"
    },
    {
      "id": 29,
      "start": 3075.500045776367,
      "end": 3078.0600509643555,
      "text": " and it's the Family Foundation."
    },
    {
      "id": 30,
      "start": 3078.0600509643555,
      "end": 3078.900047302246,
      "text": " I can't remember what it is."
    },
    {
      "id": 31,
      "start": 3078.900047302246,
      "end": 3081.7400512695312,
      "text": " But anyway, they end their program"
    },
    {
      "id": 32,
      "start": 3081.7400512695312,
      "end": 3083.700050354004,
      "text": " by saying something like this."
    },
    {
      "id": 33,
      "start": 3083.700050354004,
      "end": 3087.700050354004,
      "text": " Tell someone about, and whatever their show is called."
    },
    {
      "id": 34,
      "start": 3087.700050354004,
      "end": 3089.100051879883,
      "text": " But more importantly than that,"
    },
    {
      "id": 35,
      "start": 3089.100051879883,
      "end": 3091.8600463867188,
      "text": " tell somebody about Jesus."
    },
    {
      "id": 36,
      "start": 3093.5400466918945,
      "end": 3096.2600479125977,
      "text": " And I like the way that they use that tagline"
    },
    {
      "id": 37,
      "start": 3096.2600479125977,
      "end": 3098.980049133301,
      "text": " to end their particular segment,"
    },
    {
      "id": 38,
      "start": 3098.980049133301,
      "end": 3100.620048522949,
      "text": " because the reality this morning"
    },
    {
      "id": 39,
      "start": 3100.620048522949,
      "end": 3103.300048828125,
      "text": " is that we need to tell somebody about Jesus."
    },
    {
      "id": 40,
      "start": 3103.300048828125,
      "end": 3104.500045776367,
      "text": " There are people dying."
    },
    {
      "id": 41,
      "start": 3105.700050354004,
      "end": 3109.1400451660156,
      "text": " And I'm mindful of the difficulties"
    },
    {
      "id": 42,
      "start": 3109.1400451660156,
      "end": 3110.300048828125,
      "text": " that we are presented with,"
    },
    {
      "id": 43,
      "start": 3110.300048828125,
      "end": 3111.500045776367,
      "text": " but I'm mindful of the fact"
    },
    {
      "id": 44,
      "start": 3111.500045776367,
      "end": 3114.020050048828,
      "text": " that our God is still in control."
    },
    {
      "id": 45,
      "start": 3114.020050048828,
      "end": 3115.900047302246,
      "text": " And that if we really ask God,"
    },
    {
      "id": 46,
      "start": 3115.900047302246,
      "end": 3118.300048828125,
      "text": " God, would you give me this week."
    },
    {
      "id": 47,
      "start": 3118.300048828125,
      "end": 3119.9400482177734,
      "text": " See, if we pray anything according to his will,"
    },
    {
      "id": 48,
      "start": 3119.9400482177734,
      "end": 3122.0600509643555,
      "text": " he heareth us, right?"
    },
    {
      "id": 49,
      "start": 3122.0600509643555,
      "end": 3125.180046081543,
      "text": " Do you believe that you could pray today?"
    },
    {
      "id": 50,
      "start": 3125.180046081543,
      "end": 3128.5400466918945,
      "text": " God, would you give me a divine appointment this week?"
    },
    {
      "id": 51,
      "start": 3128.5400466918945,
      "end": 3133.540054321289,
      "text": " Give me an opportunity to speak to somebody about Jesus."
    },
    {
      "id": 52,
      "start": 3134.4200439453125,
      "end": 3137.9800415039062,
      "text": " Do you think God would be pleased in answering that prayer?"
    },
    {
      "id": 53,
      "start": 3137.9800415039062,
      "end": 3140.020050048828,
      "text": " I think he would, right?"
    },
    {
      "id": 54,
      "start": 3140.020050048828,
      "end": 3142.780044555664,
      "text": " Because he's given us that responsibility, that duty."
    },
    {
      "id": 55,
      "start": 3142.780044555664,
      "end": 3144.9800415039062,
      "text": " And so we purposely, and by the way,"
    },
    {
      "id": 56,
      "start": 3144.9800415039062,
      "end": 3147.4600524902344,
      "text": " if we pray that way,"
    },
    {
      "id": 57,
      "start": 3147.4600524902344,
      "end": 3149.580047607422,
      "text": " I think we'll be more aware"
    },
    {
      "id": 58,
      "start": 3149.6200561523438,
      "end": 3152.8600463867188,
      "text": " of the opportunities that God gives us, right?"
    },
    {
      "id": 59,
      "start": 3152.8600463867188,
      "end": 3153.7000427246094,
      "text": " Why?"
    },
    {
      "id": 60,
      "start": 3153.7000427246094,
      "end": 3155.820053100586,
      "text": " Because we're praying, God, give me an opportunity."
    },
    {
      "id": 61,
      "start": 3155.820053100586,
      "end": 3157.820053100586,
      "text": " I know I've referenced before,"
    },
    {
      "id": 62,
      "start": 3157.820053100586,
      "end": 3159.260055541992,
      "text": " D.L. Moody, it's well documented"
    },
    {
      "id": 63,
      "start": 3159.260055541992,
      "end": 3160.500045776367,
      "text": " that he made a commitment to the Lord"
    },
    {
      "id": 64,
      "start": 3160.500045776367,
      "end": 3163.9400482177734,
      "text": " that he would share the gospel with one person every day."
    },
    {
      "id": 65,
      "start": 3163.9400482177734,
      "end": 3165.340042114258,
      "text": " He was not gonna let a day go by"
    },
    {
      "id": 66,
      "start": 3165.340042114258,
      "end": 3168.9400482177734,
      "text": " where he did not share the gospel with at least one person."
    },
    {
      "id": 67,
      "start": 3168.9400482177734,
      "end": 3170.540054321289,
      "text": " There are many a time that D.L. Moody"
    },
    {
      "id": 68,
      "start": 3170.540054321289,
      "end": 3173.100051879883,
      "text": " would have busy schedule, things going on,"
    },
    {
      "id": 69,
      "start": 3173.100051879883,
      "end": 3176.2200469970703,
      "text": " and he would get up to his study late in the evening,"
    },
    {
      "id": 70,
      "start": 3176.2200469970703,
      "end": 3178.500045776367,
      "text": " and he would realize I'd not yet taken the opportunity"
    },
    {
      "id": 71,
      "start": 3178.500045776367,
      "end": 3180.260055541992,
      "text": " to share the gospel with someone today,"
    },
    {
      "id": 72,
      "start": 3180.260055541992,
      "end": 3181.540054321289,
      "text": " and he would leave his study,"
    },
    {
      "id": 73,
      "start": 3181.540054321289,
      "end": 3185.7400512695312,
      "text": " and he'd go find somebody to share the gospel with."
    },
    {
      "id": 74,
      "start": 3185.7400512695312,
      "end": 3188.100051879883,
      "text": " No wonder God used him in such a way"
    },
    {
      "id": 75,
      "start": 3188.100051879883,
      "end": 3189.8600463867188,
      "text": " to see so many people saved."
    },
    {
      "id": 76,
      "start": 3191.260055541992,
      "end": 3195.100051879883,
      "text": " The message this morning that we have before us"
    },
    {
      "id": 77,
      "start": 3195.100051879883,
      "end": 3196.780044555664,
      "text": " in Hebrews 10, verses one through 18,"
    },
    {
      "id": 78,
      "start": 3196.780044555664,
      "end": 3198.540054321289,
      "text": " it's a glorious message."
    },
    {
      "id": 79,
      "start": 3199.820053100586,
      "end": 3202.580047607422,
      "text": " And it's a message that we ought to rejoice"
    },
    {
      "id": 80,
      "start": 3202.580047607422,
      "end": 3204.6600494384766,
      "text": " in having received."
    },
    {
      "id": 81,
      "start": 3204.6600494384766,
      "end": 3209.4600524902344,
      "text": " But this morning, someone, someone needs this message."
    },
    {
      "id": 82,
      "start": 3209.4600524902344,
      "end": 3212.3800506591797,
      "text": " Someone that's in your sphere of influence."
    },
    {
      "id": 83,
      "start": 3212.3800506591797,
      "end": 3215.9000549316406,
      "text": " There was a day in your life that you needed this message."
    },
    {
      "id": 84,
      "start": 3215.9000549316406,
      "end": 3217.1800537109375,
      "text": " Aren't you thankful this morning"
    },
    {
      "id": 85,
      "start": 3217.1800537109375,
      "end": 3218.9400482177734,
      "text": " that somewhere along the line,"
    },
    {
      "id": 86,
      "start": 3218.9400482177734,
      "end": 3222.9800415039062,
      "text": " someone obeyed the Lord to give the gospel?"
    },
    {
      "id": 87,
      "start": 3222.9800415039062,
      "end": 3224.4600524902344,
      "text": " You say, well, I was born in a Christian home."
    },
    {
      "id": 88,
      "start": 3224.4600524902344,
      "end": 3226.100051879883,
      "text": " Somebody told your parents."
    },
    {
      "id": 89,
      "start": 3226.100051879883,
      "end": 3227.1800537109375,
      "text": " Well, they were born in a Christian home."
    },
    {
      "id": 90,
      "start": 3227.1800537109375,
      "end": 3228.6600494384766,
      "text": " Somebody told your grandparents."
    },
    {
      "id": 91,
      "start": 3228.6600494384766,
      "end": 3229.500045776367,
      "text": " You understand what I'm saying?"
    },
    {
      "id": 92,
      "start": 3229.500045776367,
      "end": 3230.9000549316406,
      "text": " We can keep on going, we can play that game"
    },
    {
      "id": 93,
      "start": 3230.9000549316406,
      "end": 3233.340042114258,
      "text": " until somewhere we find where somebody"
    },
    {
      "id": 94,
      "start": 3233.340042114258,
      "end": 3236.4200439453125,
      "text": " gave the gospel to your family, right?"
    },
    {
      "id": 95,
      "start": 3238.100051879883,
      "end": 3240.9800415039062,
      "text": " No one gave the gospel to my grandparents,"
    },
    {
      "id": 96,
      "start": 3240.9800415039062,
      "end": 3244.4200439453125,
      "text": " but I sure am happy that somebody gave it to my parents."
    },
    {
      "id": 97,
      "start": 3244.4200439453125,
      "end": 3246.820053100586,
      "text": " I wasn't born in a Christian home,"
    },
    {
      "id": 98,
      "start": 3246.820053100586,
      "end": 3249.1800537109375,
      "text": " but my parents got saved when I was a teenager."
    },
    {
      "id": 99,
      "start": 3250.060043334961,
      "end": 3251.9400482177734,
      "text": " I'm so thankful for it."
    },
    {
      "id": 100,
      "start": 3251.9400482177734,
      "end": 3255.7000427246094,
      "text": " And this morning, we don't just keep it to ourselves."
    },
    {
      "id": 101,
      "start": 3255.7000427246094,
      "end": 3258.6200561523438,
      "text": " We say this is a message that we're gonna proclaim."
    },
    {
      "id": 102,
      "start": 3258.6200561523438,
      "end": 3259.7000427246094,
      "text": " Amen?"
    },
    {
      "id": 103,
      "start": 3259.7000427246094,
      "end": 3260.820037841797,
      "text": " Jesus saves."
    },
    {
      "id": 104,
      "start": 3260.820037841797,
      "end": 3261.7400512695312,
      "text": " What a joy."
    },
    {
      "id": 105,
      "start": 3261.780059814453,
      "end": 3263.7000427246094,
      "text": " There's a remembrance of sin."
    },
    {
      "id": 106,
      "start": 3263.7000427246094,
      "end": 3267.4200439453125,
      "text": " And again, the people that are being written to,"
    },
    {
      "id": 107,
      "start": 3267.4200439453125,
      "end": 3270.3800354003906,
      "text": " they need to understand that this system"
    },
    {
      "id": 108,
      "start": 3270.3800354003906,
      "end": 3273.9400634765625,
      "text": " is no longer in place because Jesus has come"
    },
    {
      "id": 109,
      "start": 3273.9400634765625,
      "end": 3276.260040283203,
      "text": " and He has fulfilled all."
    },
    {
      "id": 110,
      "start": 3276.260040283203,
      "end": 3280.4600524902344,
      "text": " What was in type is now available and it's the real thing."
    },
    {
      "id": 111,
      "start": 3280.4600524902344,
      "end": 3283.7000427246094,
      "text": " It's not any longer just a shadow of an image to come,"
    },
    {
      "id": 112,
      "start": 3283.7000427246094,
      "end": 3284.8600463867188,
      "text": " a shadow of good things to come."
    },
    {
      "id": 113,
      "start": 3284.8600463867188,
      "end": 3286.7000427246094,
      "text": " No, it is now the very image."
    },
    {
      "id": 114,
      "start": 3286.7000427246094,
      "end": 3290.580047607422,
      "text": " It's God in flesh that has died that paid the price."
    },
    {
      "id": 115,
      "start": 3290.580047607422,
      "end": 3293.7000427246094,
      "text": " And you now have no longer a remembrance of sins,"
    },
    {
      "id": 116,
      "start": 3293.7000427246094,
      "end": 3296.9800415039062,
      "text": " but you have remission of sins."
    },
    {
      "id": 117,
      "start": 3296.9800415039062,
      "end": 3298.2200622558594,
      "text": " And I'm so thankful for that."
    },
    {
      "id": 118,
      "start": 3298.2200622558594,
      "end": 3299.06005859375,
      "text": " Let's pray."
    },
    {
      "id": 119,
      "start": 3299.06005859375,
      "end": 3299.9000549316406,
      "text": " Father, we love you this morning."
    },
    {
      "id": 120,
      "start": 3299.9000549316406,
      "end": 3301.5400390625,
      "text": " We thank you for loving us."
    },
    {
      "id": 121,
      "start": 3301.5400390625,
      "end": 3305.020050048828,
      "text": " We thank you for this one sacrifice for sin forever."
    },
    {
      "id": 122,
      "start": 3306.5400390625,
      "end": 3310.9800415039062,
      "text": " We thank you that in your wisdom, in your omniscience,"
    },
    {
      "id": 123,
      "start": 3314.300048828125,
      "end": 3319.06005859375,
      "text": " you created a plan by which your creation could be redeemed."
    },
    {
      "id": 124,
      "start": 3320.06005859375,
      "end": 3323.7400512695312,
      "text": " And we understand as we study the whole of Scripture"
    },
    {
      "id": 125,
      "start": 3323.7400512695312,
      "end": 3327.1000366210938,
      "text": " that that plan of redemption required a payment."
    },
    {
      "id": 126,
      "start": 3330.6600341796875,
      "end": 3333.9000549316406,
      "text": " All of the sacrifices and all of the blood"
    },
    {
      "id": 127,
      "start": 3333.9000549316406,
      "end": 3335.8600463867188,
      "text": " that was shed in the Old Testament,"
    },
    {
      "id": 128,
      "start": 3337.6200561523438,
      "end": 3342.340057373047,
      "text": " being a type of Messiah who would one day come,"
    },
    {
      "id": 129,
      "start": 3343.6200561523438,
      "end": 3346.9800415039062,
      "text": " we're thankful that when the fullness of time came,"
    },
    {
      "id": 130,
      "start": 3347.340057373047,
      "end": 3349.3800354003906,
      "text": " that God, you sent forth your son."
    },
    {
      "id": 131,
      "start": 3350.3800354003906,
      "end": 3352.4600524902344,
      "text": " We're thankful that he was born of a virgin"
    },
    {
      "id": 132,
      "start": 3352.4600524902344,
      "end": 3354.1800537109375,
      "text": " and he was made under the law."
    },
    {
      "id": 133,
      "start": 3354.1800537109375,
      "end": 3357.2200622558594,
      "text": " We're thankful that he came to die to redeem."
    },
    {
      "id": 134,
      "start": 3359.5000610351562,
      "end": 3362.4600524902344,
      "text": " We're thankful that that payment results in a pardon."
    },
    {
      "id": 135,
      "start": 3363.340057373047,
      "end": 3366.1000366210938,
      "text": " Oh, what joy it is to be forgiven."
    },
    {
      "id": 136,
      "start": 3367.020050048828,
      "end": 3369.6600341796875,
      "text": " God, if there's one present here this morning"
    },
    {
      "id": 137,
      "start": 3369.6600341796875,
      "end": 3371.580047607422,
      "text": " that's never trusted the Lord Jesus Christ"
    },
    {
      "id": 138,
      "start": 3371.580047607422,
      "end": 3372.4600524902344,
      "text": " as their personal Savior."
    },
    {
      "id": 139,
      "start": 3372.4600524902344,
      "end": 3375.260040283203,
      "text": " In fact, they're trying their own way."
    },
    {
      "id": 140,
      "start": 3376.260040283203,
      "end": 3377.7400512695312,
      "text": " They're doing their own thing."
    },
    {
      "id": 141,
      "start": 3378.6600341796875,
      "end": 3379.780059814453,
      "text": " God, I pray that you would help them"
    },
    {
      "id": 142,
      "start": 3379.780059814453,
      "end": 3381.1000366210938,
      "text": " to understand this morning"
    },
    {
      "id": 143,
      "start": 3382.3800354003906,
      "end": 3385.3800354003906,
      "text": " that there's no more offering for sin."
    },
    {
      "id": 144,
      "start": 3386.5400390625,
      "end": 3390.300048828125,
      "text": " That that which was offered when Jesus offered himself"
    },
    {
      "id": 145,
      "start": 3390.300048828125,
      "end": 3392.300048828125,
      "text": " is the only acceptable payment."
    },
    {
      "id": 146,
      "start": 3394.4200439453125,
      "end": 3396.5400390625,
      "text": " Father, for those of us that have trusted"
    },
    {
      "id": 147,
      "start": 3396.5400390625,
      "end": 3398.340057373047,
      "text": " the Lord Jesus Christ as our personal Savior,"
    },
    {
      "id": 148,
      "start": 3398.340057373047,
      "end": 3400.4600524902344,
      "text": " would you help us to rejoice this morning?"
    },
    {
      "id": 149,
      "start": 3402.7400512695312,
      "end": 3404.6200561523438,
      "text": " God, help us to take it even a step further"
    },
    {
      "id": 150,
      "start": 3404.9800415039062,
      "end": 3407.1800537109375,
      "text": " and help us to purpose to tell someone."
    },
    {
      "id": 151,
      "start": 3408.580047607422,
      "end": 3411.5400390625,
      "text": " In the midst of all that's going on in our society,"
    },
    {
      "id": 152,
      "start": 3415.020050048828,
      "end": 3417.340057373047,
      "text": " Lord, I pray that you would help us daily"
    },
    {
      "id": 153,
      "start": 3418.5400390625,
      "end": 3420.260040283203,
      "text": " to seek that opportunity,"
    },
    {
      "id": 154,
      "start": 3420.260040283203,
      "end": 3422.780059814453,
      "text": " to pray, God, that you would lead our paths"
    },
    {
      "id": 155,
      "start": 3424.300048828125,
      "end": 3426.6600341796875,
      "text": " in such a way that we would have the opportunity"
    },
    {
      "id": 156,
      "start": 3426.6600341796875,
      "end": 3430.300048828125,
      "text": " to open our mouths and share the good tidings,"
    },
    {
      "id": 157,
      "start": 3430.300048828125,
      "end": 3432.3800354003906,
      "text": " the gospel of Jesus Christ,"
    },
    {
      "id": 158,
      "start": 3433.2200622558594,
      "end": 3438.2200622558594,
      "text": " to proclaim that message loud and clear that Jesus saves."
    },
    {
      "id": 159,
      "start": 3438.6200561523438,
      "end": 3440.260040283203,
      "text": " Lord, use us."
    },
    {
      "id": 160,
      "start": 3440.260040283203,
      "end": 3441.9800415039062,
      "text": " Help us to redeem the time."
    },
    {
      "id": 161,
      "start": 3441.9800415039062,
      "end": 3445.580047607422,
      "text": " Help us, Lord, to seek those opportunities"
    },
    {
      "id": 162,
      "start": 3445.580047607422,
      "end": 3448.4600524902344,
      "text": " and then to seize them as they're presented to us."
    },
    {
      "id": 163,
      "start": 3449.5400390625,
      "end": 3451.06005859375,
      "text": " We pray that many would come to know you"
    },
    {
      "id": 164,
      "start": 3451.06005859375,
      "end": 3452.7400512695312,
      "text": " as their personal Lord and Savior"
    },
    {
      "id": 165,
      "start": 3454.820037841797,
      "end": 3458.3800354003906,
      "text": " because of the power of the gospel message."
    },
    {
      "id": 166,
      "start": 3458.3800354003906,
      "end": 3460.820037841797,
      "text": " Have your will and weigh in the hearts of your people"
    },
    {
      "id": 167,
      "start": 3460.820037841797,
      "end": 3462.9000549316406,
      "text": " over these next few moments."
    },
    {
      "id": 168,
      "start": 3462.9000549316406,
      "end": 3465.6200561523438,
      "text": " We pray that you'd move and work as only you can."
    },
    {
      "id": 169,
      "start": 3465.6200561523438,
      "end": 3466.4600524902344,
      "text": " We'll thank you for it."
    },
    {
      "id": 170,
      "start": 3466.4600524902344,
      "end": 3467.3800354003906,
      "text": " In Christ's name we pray."
    },
    {
      "id": 171,
      "start": 3467.3800354003906,
      "end": 3468.2200622558594,
      "text": " Would you stand with me?"
    },
    {
      "id": 172,
      "start": 3468.2200622558594,
      "end": 3469.780059814453,
      "text": " Heads are bowed, eyes are closed."
    },
    {
      "id": 173,
      "start": 3469.780059814453,
      "end": 3471.9800415039062,
      "text": " Kimberly's gonna play quietly on the piano."
    },
    {
      "id": 174,
      "start": 3473.260040283203,
      "end": 3475.780059814453,
      "text": " Two things that I've asked that would be a result"
    },
    {
      "id": 175,
      "start": 3475.780059814453,
      "end": 3478.7400512695312,
      "text": " of this message this morning that I've challenged you with."
    },
    {
      "id": 176,
      "start": 3478.7400512695312,
      "end": 3480.7400512695312,
      "text": " Number one, that we'd rejoice in our salvation."
    },
    {
      "id": 177,
      "start": 3480.7400512695312,
      "end": 3483.020050048828,
      "text": " Number two, that we'd purpose to tell someone."
    },
    {
      "id": 178,
      "start": 3484.6600341796875,
      "end": 3486.3800354003906,
      "text": " This morning, as Kimberly plays,"
    },
    {
      "id": 179,
      "start": 3486.3800354003906,
      "end": 3490.5400390625,
      "text": " would you ask the Lord to work in your heart and life?"
    },
    {
      "id": 180,
      "start": 3490.820037841797,
      "end": 3492.9000549316406,
      "text": " The altar is open as Kimberly plays."
    }
  ],
  "processed_at": "2025-04-17T14:49:41.896096"
}