{
  "video_id": "XzbN4ONOJUs",
  "text": "First Timothy chapter two. I want you to hold your spot there and turn over to Acts chapter number 20. In fact, we'll begin in Acts chapter number 20, but we will be preaching through First Timothy two verses nine through 15 this morning. But by way of introduction, we'll reference part of the charge that Paul issues in Acts chapter number 20 to the leaders of the church at Ephesus. It is necessary as we're studying through the book of First Timothy, eventually we'll get through Second Timothy as well, Lord willing, in this calendar year, our theme is continue and how we must continue. We see that thought interwoven in First and Second Timothy. We find that it is necessary as we study these two books of the Bible that we understand where Timothy is ministering, not only where, but why. Why is it that God had Timothy in Ephesus? He's there in Ephesus. We see that in First Timothy chapter number one. And we find that Timothy was given a specific task, a responsibility while he was ministering there in Ephesus. We find that he was to set some things in order. We find that as you look at the book of Titus, you would find of Titus with regard to being in Crete, he too was given specific responsibility with regard to similar things that Timothy is doing there in Ephesus. We find as we've studied the first chapter that he was to confront the false teaching. There were false teachers that had crept in and he was to confront that false teaching and he was to teach sound doctrine. And on Wednesday evening from the book of First Thessalonians chapter five verses 20 and 21, I preached on Wednesday evening, taught from that passage of scripture of sound in the faith and how we need to be sound in the faith. And we find that as Timothy would receive this letter, First Timothy, the letter that we're studying through here on Sunday mornings, that as he would receive that letter, that it would be a reminder to Timothy of his responsibility, the reason that he was there. You know, there are some times that we can get busy in the work and we can kind of lose sight of really why we're there and what God's purpose is for us in that place. And we find that this letter, First Timothy, would serve as a reminder to Timothy with regard to his responsibility. Not only would it serve as a reminder, but I believe it would serve as an encouragement. Paul is encouraging Timothy to continue. Though there might be some opposition that you're dealing with, though there might be some pushback with regard to what you're dealing with, you need to continue and finish the race, finish the course. And we find that this letter would provide both a reminder but also encouragement. As we enter into the second and third chapter of the book of First Timothy, we find that God begins to address the subject of behavior in his church. And we find that we've already looked at the first eight verses in chapter number two, and we acknowledge that there in chapter number two, the emphasis is placed in the beginning of that portion of scripture on prayer. And we spent several weeks dealing on the subject matter of prayer and the importance, remember, Jesus said, my house should be a house of prayer. And we find prayer is so important. It's a privilege that we have as the children of God that we can go boldly under the throne of grace, that we have the promises that he hears us and he answers us and that he's able to do, exceeding abundantly above all that we ask or think. What a wonderful God we serve, that he would listen to us, that we could enter into his presence at any time for as long as we want, and we can worship him through prayer, we can bring our petitions to him in prayer, and what a joy it is to be in his presence. We must acknowledge that as we look at the second and third chapter of the book of 1 Timothy, that this is God giving instruction with regard to behavior in his church. So we must understand, number one, that it's God's church. Amen, it's not my church, it's not your church. I know sometimes we use that phraseology of my church or our church, and I understand that, but ultimately, we must acknowledge this morning that it's God's church, and we understand this morning that if it's God's church and he's established it, then he also, through his word, has given the instruction on how people, his people, are to behave in his church. Amen, and that's important for us to understand. We find that though Timothy is receiving this letter from Paul, we understand that all scripture is given by inspiration of God, and it's profitable for us. We understand that the Bible is authoritative. It is profitable, and as we look at the second and third chapter over the next couple of weeks, we're gonna deal with this subject, behavior in God's church, behavior in God's church. Today is part one. Next week, well, we got a missionary next week, so it'll be part two the following week, but we look at this subject, and because it is his church, understand this morning that because it is his church, he has the authority and the right to dictate, I choose that word on purpose, to dictate how we are to behave in his church, amen? It's his church. We're his people. He has the right to dictate behavior that is appropriate and acceptable versus behavior that is unacceptable and inappropriate, amen, and it's his church, and so we should rejoice in that this morning. I have you in Acts chapter number 20. I want you to notice just a few verses before we jump over to the book of 1 Timothy. Notice in Acts chapter 20 and verse 28, the Bible says this, take heed therefore unto yourselves and to all the flock over which the Holy Ghost hath made you overseers, so he's speaking to the leaders of the church at Ephesus, to feed the church of God. Notice this phrase, which he hath purchased with his own blood, amen? Redeemed, we were singing this morning, saved by the blood of the crucified one, and the church is his church. It's not our church, it's his church. Notice in verse 29, as Paul gives this charge to the elders, the leaders of the church, he says, for I know this, that after my departing shall grievous wolves enter in among you, not sparing the flock. Verse number 30 of Acts 20, also of your own selves shall men arise, speaking perverse things to draw away disciples after them. So God in his wisdom and in his omniscience and the fact that he's eternal, he knew what would happen in Ephesus. So therefore he used the apostle Paul to give this charge to the leaders in Acts chapter number 20 of the church at Ephesus, but then in God's infinite wisdom, he had Timothy stay there in Ephesus to be able to teach and to instruct and to help this church walk worthy and please God, this church at Ephesus. You know, the church at Ephesus is addressed in the book of Revelation, and they're charged with the fact that they left their first love. That's a serious charge. And we find that Timothy is there and Timothy is giving this instruction. And first, Timothy, I have you in chapter two, but I want you to look very quickly at chapter three, really the latter statements with regard to this section of chapter two and three on behavior in God's church. And I want you to see what Paul says beginning in verse number 14 of chapter three. In first Timothy three in verse number 14, notice what it says. These things write I unto thee. Okay, so what things? Well, the things that are contained in this letter, in this book. So Paul's saying here, I'm writing these things and then notice, hoping to come unto thee shortly. Now, he didn't know when he was gonna be able to come. We find in chapter number four, the memory verse for the month of April. He says, till I come, give attendance. And he's speaking about his desire to come, give attendance to what? Well, to reading, to exhortation, to doctrine. Now we understand also that one day Jesus is gonna come and what a blessed truth that is. The head of the church, he's gonna come. The chief shepherd, he's gonna come and he's gonna take us back to be with him. What a joyous truth that is. By the way, I wanna live for him until that trumpet sounds. That was what was said in that song that Julianna sang. And I hope that that is your joy, your desire this morning. But notice in verse 15, he says, but if I tarry long, that thou mayest know how thou oughtest to behave thyself in the house of God. Notice, which is the church of the living God, the pillar and ground of the truth. So here in these chapters, Paul is giving Timothy instruction with regard to behavior in God's church. As I mentioned, the second chapter begins with an emphasis on prayer. When we come to the end of the chapter of chapter number two and we find most of chapter number three, the first 13 verses of chapter number three, deal with, address the matter of roles and structure within God's church. Now, understand this morning that the passage that is before us at the end of chapter number two addresses specifically women in the church. Now, don't get mad to start out right now, because this is God's Word, amen? And we have to understand what God says. And we find that as God is going to address the subject matter, that God gives great clarity with regard to the roles and responsibilities, the structure, again, within His church. It's His church. And He has the right to demand of us that we behave in alignment to His Word. By the way, if we want to have God's blessing upon our ministry, we better do God's work God's way, amen? You say, well, there's some churches that are real big that don't follow God's Word. Numbers doesn't mean everything, amen? There's some lousy athletic teams that get people to show up to pay big bucks to watch them fumble and flounder around, and they have 60,000 people that pay to go. Crowds don't mean everything, okay? So as we look at the text of Scripture this morning, notice in verse number 9, the Bible says in like manner also, 1 Timothy 2, beginning in verse number 9, in like manner also that women adorn themselves in modest apparel with shamefacedness and sobriety, not with braided hair or gold or pearls or costly array, but which becometh women professing godliness with good works. Let the woman learn in silence with all subjection, but I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence. For Adam was first formed, then Eve, and Adam was not deceived, but the woman being deceived was in the transgression. Notwithstanding, she shall be saved and childbearing if they continue in faith and charity and holiness with sobriety. Let me say today that as we look at this passage of Scripture, and again, specifically the passage we'll deal with address women in the church. Understand with me that in the beginning, God said that He created male and female. This nonsense that's going on in our world today with gender confusion and gender dysphoria, whatever else you want to call it, is a bunch of nonsense, and God said that He made in the beginning male and female, amen? And by the way, they're made in the image of God, amen? But God has established structure. Someone said this to me this week with regard to a ministry opportunity that we were going to partner together with and try to do, and here's what he said to me as a pastor of another church and he wants to come alongside and help us with something, and he said, listen, we're going to put ourselves under your authority because anything with two heads is a monster. Those were his words to me. And he said, we are going to put our church and our folks that will help with this ministry under your authority. God has given authority. Here in this passage of Scripture, we find that God addresses the roles of women within the church, and we find that as we look at this passage of Scripture, just two thoughts this morning, as we look at this, number one, if you're taking notes, there's instruction with respect to attire, to attire, and we find that God in verse 9 and 10 gives this instruction. Now, we find that there's an obvious emphasis in this text of Scripture on that which is modest and that which is appropriate. You find that the Bible says in like manner also that women adorn themselves in modest apparel with shamefacedness and sobriety, not with braided hair or gold or pearls or costly array, but which becometh women professing godliness with good works. As we look at those two verses of Scripture, we would really understand that as you again recognize where Timothy is ministering and what's going on in Ephesus, there was a tendency, if you read some historical data, there's a tendency within some, within this region, to be real worried about their attire, almost like a fashion show type of thing. Listen, when you go to church, you're not going to a fashion show, amen? It's to be modest and it's to be appropriate. We find that as we look at these verses of Scripture, as God is giving instruction with respect to attire, that God is giving us this instruction. This is not simply Paul providing the instruction, it's God speaking through Paul, using Paul as his human penman to give the instruction. We find that the Bible, really as you study the whole of Scripture, you'll find that there are many references with regard to attire and that which is appropriate. We understand this morning that there are different people that would have different opinions with regard to what is modest or what is appropriate. So here's what I'm thankful for, God didn't leave it for my opinion or your opinion, He gave us truth in His Word, amen? And we need to take that truth and we need to understand that we apply it. I would say this by way of application of a number of verses that we don't have time to go to all of them this morning, but we would say this, it should not be too short, it should not be too low, and it should not be too tight. Now let me say this, God is addressing women in this particular text of Scripture. But understand today that as we enter into this 2024 and all the things are going on, some of those same things need to be said to men. There's some men that wear some clothes that are too tight, amen? And they ought not. I don't know how many of you tried to buy a suit recently, but they got all this modern fit suit stuff, I don't fit in what they have, amen? And the reality is that modesty and appropriateness is important, why? Because it's God's house. We're coming not for a fashion show, but we're coming to worship our God. And we're coming to worship Him. The text here, as we look at this and we see what's going on, and we find that modesty and appropriateness has been an issue, not just in 2024, but it's been an issue throughout the entire church age, and therefore God gives the instruction. Let me say this also, we're not going to, again, you can jot down the verses, but if you were to go back to Proverbs chapter 7, and verse number 10 specifically, the Bible speaks about the attire of an harlot, okay? Now you say, man, pastor, that's strong language, that's the Bible, it's the words that are used in Proverbs 7 and verse number 10, and why do I bring that up this morning? Well, because there was attire that was communicating something to those that were in that society. What was the attire communicating? That they were an harlot. That's why the attire is referred to as the attire of an harlot, okay? Now I would argue this morning that in our 2024, as we look at what's taking place in our world today, that probably what God is referring to in Proverbs 7 and verse number 10 was actually a whole lot modest, more modest than a lot of things that are available today. I understand the difficulties, I have a wife and two daughters, I understand the difficulties, but we must acknowledge this morning the fact that God has given us instruction. I want to remind you that in Genesis chapter 38 and verses 14 and 15, what Tamar did was changed her garments and her appearance, and you can read of what takes place with Judah and Tamar, and Judah says, can I come in unto thee? Why? Because her attire was changed, her appearance was changed, she led on that she was available in that fashion. So we find this morning that God is giving us this instruction, and it's good instruction, it's profitable instruction. Now we find if you take over 1 Peter chapter 3, look over there, as we look at a sister passage of Scripture in 1 Peter chapter number 3, that deals with this same subject matter, and we find that here in 1 Peter chapter number 3 and verses 3 and 4, the Bible says this, whose adorning, let it not be that outward adorning of plaiting the hair and of wearing of gold or of putting on of apparel, but let it be the hidden man of the heart, and that which is not corruptible, even the ornament of a meek and quiet spirit, which is in the sight of God of great price. Now why do I come to 1 Peter chapter 3? Well the same reason so many people look at 1 Samuel chapter 16, and I'll just reference that passage of Scripture, we won't turn there. In 1 Samuel chapter number 16, God gives Samuel the responsibility of anointing the next king of Israel. We know, if you know the Bible this morning, that that is David who will be the next king, but David, when all the sons of Jesse are gathered together, he's left out in the field taking care of the sheep. And so Eliab stands before Samuel first, and he sees this young man, and he says, surely this is the Lord's anointed. And God says, look not at the outward appearance. Man, all we can see is the outward, but God looks on the heart. I reference 1 Samuel 16 and look at 1 Peter chapter 3 because I've heard so many times over the years, when you talk about the subject that is before us in 1 Timothy chapter 2, verses 9 and 10, as God gives instruction with respect to attire, with regard to that which is modest and that which is appropriate, is it doesn't matter what's on the outside because God looks at the heart. Can I tell you this morning that you have misapplied the truth of God's Word? Because when God says that He sees the heart, He also says man can only see the outward. Let me say it this way this morning. If our inward is right, it's shown up on the outward. Amen? Now, I understand that you can clean something up and it can be corrupt inside. The whited sepulchers, right? You read that? They're full of dead man's bones but they look real good on the outside. So we understand that principle. What I'm saying to you this morning is that if our heart is right, if we desire to please God and to walk worthy, then we look at a subject like this and we say, hey listen, I want to be modest and I want to be appropriate. Male or female. We ought to be modest and we ought to be appropriate. Amen? I would say this, as we look at this text of scripture, and I say this to myself and I say this to others as well, that I believe this morning that it's important, it's imperative that husbands and fathers take an active role in guiding their wives and their daughters with respect to what is modest and appropriate. Why do I say that? Because you're a man and you know. Do I have to go further than that or can we understand this morning? You're a man and you know, and so you can know if what your wife or daughter is wearing is modest and appropriate. And you, God has placed in that position to help and what a blessing it is. The church is not a fashion place. It's not a place to come for a fashion, no, it's good to look nice and put on your best and all those things. I'm not suggesting that that's not something that we should do, but the reality is that we see that God gives instruction and this instruction is important for us. If we look at verses 11 through 15, number two this morning, instruction with regard to authority. We see in verses 9 and 10 instruction with regard to attire. We see in verses 11 through 15 instruction with regard to authority. Now remember again that God established the church and He instructs the church. So God gives this in 1 Timothy 2 verses 10 through, 11 through 15, He gives us instruction with regard to authority. This instruction will continue into chapter number three. Remember the chapter divisions and verse divisions were put into the Bible to help us with ease of finding portions of Scripture, but the thought at the, in chapter two and three is a singular thought with regard to behavior in God's church. Sorry, somebody wore a lot of cologne today, Dean, he's not in here right now, and that stuff is killing me with my allergies, amen? I'm going to tell him, listen, you've got to get rid of, get something different, amen? And, but my allergies, I don't, I stopped wearing cologne because it messes me all up in the springtime. But anyhow, we find that it's the book of Ephesians in the fifth chapter specifically, the book of Colossians in the third chapter specifically, where God addresses authority in the home. Here in 1 Timothy chapter number two and three, God is dealing with authority in His church. By the way, let me say this, God is the one who established the home, amen? God is the one who established government. God is the one that established the church. Those are the three entities, if you will, that God established that are still in operation today. And in God's word, He's provided instruction with regard to each institute that He started. So not only did He, did He begin the home, but He instructed, He instituted the home and He instructed the home. He instituted the church and He instructed the church. He instituted government and He gives instruction. You say, well, they're not following it. Listen, there are churches and there are homes and there are governments that are in direct rebellion to the one who established those entities, amen? There are homes all across our nation. This message this morning is not on the home. This subject is dealing with the church. But there are homes all across this nation that are messed up because they're not following the instruction that God has given in His word. Just the way it is. There are churches that are messed up because they're not following the instruction that God gives in His word. We ought not get mad at the instruction manual. We ought to be thankful to the God who gave us the instructions and understanding that He's provided us the path by which we can please Him. You ever buy a device? Any of you, you drove here this morning and there are certain things that the manufacturer of the automobile that you drove here in have put in order that you have to do in order to drive that vehicle. Now it used to be that you always needed a key to start the vehicle. Now they have these push button things and you don't have to put the key in the ignition but you still got to have a key in the vehicle, right? And you have to do some things and you have to follow, well, I don't want to put the key in there. I'm just going to sit there. You can get mad at Ford and whoever else, whatever vehicle you drive, you can get upset with them. Why do I have to press the brake to get out of park? I'm not going to do it. Well, you ain't going anywhere, right? I mean, is that the case? You have different appliances that you have at home and different processes that you need to follow in order to make that thing work. Typically, people don't get mad and say, I'm not going to do it. No, they just follow the instructions. Now, some of us men put the instructions to the side and think we can figure it out without the instruction manual. And then after we get all kinds of sideways trying to do something, we say, you know, maybe I should look at the instructions. We go over and grab them and then we can get the thing working. But as we look at the instructions, we understand that God is the eternal, all-wise God and He's provided instruction for His church. So look at the authority or the instruction that's given with regard to authority here in this passage of Scripture. We find the Bible says in verse number 11 and 12, let the woman learn in silence with all subjection, but I suffer not a woman to teach nor to usurp authority over the man, but to be in silence. So we find here in verses 11 and 12 that women are not to teach or have authority over men in God's church. Now let me say this this morning. This is not popular today, but it's biblical. It's biblical, amen? There are churches all across our land that have women pastors. And there are people today that are saying, hey, it's 2024, can't we get with the times? Why can't we have a lady be the pastor? Well, because the eternal God, who is the creator of all things, established in His word structure and authority. He did not say that the woman was not of equal value to the man. He did not say that, no, He just said in the church, the woman is not to have that authority over a man. And we're going to look at a couple of verses of Scripture in a little while where what is the role and what is the ministry of women in the church? Because there is a place, there is an opportunity of ministry, and we're thankful for that. But the Bible says, then I suffer not a woman to teach nor to usurp authority over the man, but to be in silence. Now we understand this morning, I've mentioned already, you no doubt have seen it, we're not a Southern Baptist church, but recently the Southern Baptists have had a real issue with this subject matter. There are plenty of other denominations that have been dealing with it for decades, really, but we find that most recently with the Southern Baptists, and I have people occasionally, they find out we're a Baptist church, are you part of the Southern Baptist Convention? We're not, we're independent Baptists. However, there was a huge issue at this last big conference that they had, why? Because there are Southern Baptist churches that want to ordain women to be pastors. The Southern Baptists took a position on it, but there's this push. Listen, I said it on Wednesday evening, and I hope that we can understand it this morning, it does not matter how much the culture pushes, we have to be biblical. We have to be biblical. Listen, this morning as we understand the situation in Ephesus, and we understand what's taking place, and even as we understand today that God has given us His eternal word, and He's outside of time, and His word is relevant to every generation, and His instruction is important for us to follow, that God said that the women are not to have authority over the man. If God wanted in a particular year for that to change, then God, who is eternal, could have told us... us at this time in church history, then these changes are going to be made. But God didn't say that. So God gave us the instruction. God provided us with this instruction. It's important that we understand it and that we apply it. We find that in Ephesus, just as it's in our day today, the church has always been called to influence the society, not for the society to influence the church. You know what one of the big problems was in Corinth? There are lots of them. But one of the main problems in Corinth was that the city, the culture, the society was impacting and influencing the church. And God said, no, the church is supposed to influence the culture. But what happens today, because a message like this is not very popular, is that you have culture pushing and you have people folding, saying, well, we'll just kind of, you know, we just want to be, want to fit in, and we want to be, listen, I want to please God. Amen? As an individual, as a church, I want to please God. That ought to be your goal as well. We find that God, here in this passage of Scripture, goes all the way back to creation with regard to providing an answer, if you will, or reason behind the instruction that He gives to us in verses 11 and 12. By the way, I think that's gracious of God. God doesn't have to explain to us why He set any rules in place. Amen? He's God. It's His right. But He goes back to creation, notice in verses 13 and 14, the example that He uses. He says this, for Adam was first formed, then Eve. So He goes back to the order of creation. When God created man initially, He created Adam. But then He found there's no help for him. Now God knew that, and then He creates Eve, right? That's the order of creation. We can go back and look at that in the book of Genesis. We find that in Genesis chapter number 3, now we see in verse number 13, He goes all the way back to the beginning in Genesis 1 with creation. We come to verse 14, and He goes to Genesis chapter number 3 with the fall of man. Notice what He says, and Adam was not deceived, but the woman being deceived was in the transgression. It's very interesting as you look at verse number 14 in 1 Timothy chapter number 2, because as you look at the whole of Scripture, you look at various aspects of the New Testament referring back to the fall of man in the garden in Genesis chapter number 3, Adam is always the responsible party. Never is Eve the responsible party. Always Adam. As in Adam, all die. As for by one man, sin entered into the world, Romans chapter 5 and verse number 12. Adam's always responsible. Let me say this, before God created Eve, God gave Adam the instruction with regard to what could be eaten and what could not be eaten. God didn't deliver that to Eve, He delivered it to Adam. Adam, however, had a responsibility to communicate that to Eve. Why is it that the serpent, the most subtle beast of the field, why is it that he comes to Eve in Genesis chapter number 3? Well, we understand as we look at Genesis chapter number 3 that he comes to Eve and he begins to deceive her. Yea, hath God said, no, it's not going to be that way. God knows that in the day that you eat thereof, your eyes are going to be open, you're going to be like God's and He deals with an emotional approach and He deals with, look, it's good for you and He shows that fruit and she is deceived and she eats of that fruit. Adam, no deception whatsoever. He knew, but he did. We find that as man is held accountable, we find that to be the case with Adam and God references back to Genesis 1 and Genesis 3 with regard to providing us with some really background reason, if you will, for why He's providing this instruction for His church with regard to structure and authority and we find that He says, Adam was formed first, then Eve. Eve was deceived, Adam was not. Adam knew right well what he was doing and he took of the fruit and sin entered in the world. You know, it's very interesting, God, again, this passage of Scripture is dealing with instruction, behavior in His church and specifically this section is dealing with authority in the church, not in the home, but we find that God, as you look at the Scriptures, the New Testament as we're dealing with the church, there's no church in the Old Testament. You find the nation of Israel, you can find there are several ladies, women that God used in a great way. In the church, you find there are many ladies and women that God used in a great way, but when it comes to a matter of authority, God says that the man, notice in chapter 3, this is a true saying, if a man desire the office of a bishop, and so we're going to find in chapter 3, He continues with this idea of behavior in the church, in His church, and He deals with the pastor and the deacon, the two offices, to be a man, because it's a matter of instruction with regard to authority. God has given to us that responsibility and God has provided for us the examples in His Word. We find this morning that Adam is the one that's held accountable. It's very interesting also, if you were to go to Genesis 18, we're not going to go there this morning, but in Genesis 18, dealing with Sarah and Abraham, you'll find that Sarah laughed. Do you remember this? When God says she's going to have a baby, right? And she laughed. You know what's very interesting? God never asked Sarah why she laughed. You know who He asked? Abraham. You know why He asked Abraham? Because God told Abraham, you're going to have a son. And Abraham had the responsibility to communicate God's truth to his wife, Sarah. Amen? And when she laughed, God didn't ask her why she laughed. He asked. So, you know, authority is one of those things that so many people want it, but they don't understand the responsibility that comes with authority. The responsibility comes with authority. During the COVID years, I had several people that attacked my leadership through COVID. They thought they knew better. They thought we should this, we should that. And on more than one occasion, I said, hey, if you want to be the pastor, you can. I'll resign right now. You know why? It wasn't easy. Every decision I made, half of the people liked it and half of the people didn't. Just the way it is. With authority comes responsibility. You know what I told people time after time, Bart? I said, you know what? I'm not trying to please you. I'm trying to please God. You know the greatest thing you could do for you, or do for me, is pray for me that God will give me wisdom. It was a difficult time. See, people want authority, but you understand there's responsibility with authority. And God holds Adam responsible. God holds Abraham responsible. He's given to His church this instruction with regard to authority. And it's vital that we don't worry about what the culture is doing. We don't worry about what other denomination is doing. We say, no, God gave us an instruction manual, and we're going to follow what God gave us. Notice in verse 15, notwithstanding, she shall be saved and childbearing if they continue in faith and charity and holiness with sobriety. Now, many people say verse 15 is one of the hardest verses in all the New Testament to be able to interpret and explain. It is greatly challenging. And I'm going to give you my understanding of the verse. If you think something different, man, I'll talk to you about it. I'm going to give you my understanding. It's not talking about being saved and childbearing, that you won't die when you give birth. Why do we know that? Because many of godly women have died giving birth. So it can't mean that a woman would be saved, they would be able to give birth and not die, because many have, okay? Some have the idea that maybe it's dealing with that the Savior would come through a woman, the virgin birth. Certainly that could be part of the situation. But I think really what Paul is dealing with here is understanding what the role of the women would be in training their children, in bringing up their children. Now we find that God gives the responsibility to the husbands that we find as you look in Ephesians 5 and 6, Colossians chapter number 3, that were to bring them up in the nurture and admonition of the Lord. But God gives, listen, there's something different in the ability of training children between a male and a female. I often look at Holly and say, I cannot do what you do. I can't. She teaches them little kids, works in a nursery, man, I'd be outside of my mind. I'm just telling you the truth. When our kids were little, she'd go to a ladies meeting and man, I'd be setting my watch for when she's getting home, because there's only so many things I can handle, amen? I'm not equipped for it. And I have no problem acknowledging that. So we find that the woman, the wife, the mother has this opportunity. We also understand that it cannot mean that… that all godly women would have children, because we know that there are some that are barren. We can read of that even in the Scriptures. Amen? So we find that the role, and here's what I believe this morning, that when we understand the instruction that God has given us, and we embrace what He's given us, we can thrive. But so long as we want to resist, because we've been influenced by our culture and our society, and we want to hold our hands against it, and we say, don't you know that we're living in the 21st century, and don't you know, listen, you're gonna just, you're beating your head against a wall. If you just say, this is what God's role is for me, and I find what my role is, and I do what God's called me to do, I can thrive, and collectively we can please God, because we're doing what God has called us to do. I've used this terminology recently. Some of you may have heard me say it to you, but I've used this terminology in a number of different contexts, and I'll use it here this morning when we think about these roles and responsibilities and authority that God gives in His church, and what I would say is this phrase, stay in your lane. Stay in your lane. What do I mean by that? Well, when you drive your car, it's important that you stay in your lane, right? How many of you have been driving and somebody tried to get in your lane? I say something like this. Pick one, buddy. I mean, you gotta pick one or the other. You can't drive in both. Is that right? What happens if they drive in both? Well, there's a problem. Those lines on the roads are important. They give us what our boundaries are, right? There's a lot of model of vehicles here in Northern Virginia that don't, that did not come equipped with blinkers, right? Amen? They just move and shift and do whatever they wanna do, but my model came with a blinker, and when I wanna shift lanes, I gotta turn on my blinker, right? And I'm giving indication, right? Well, listen, God's given us roles and responsibilities, and when we understand what the God of the universe, the one who instituted the church, when He gives us what our roles are, we don't have to stand in rebellion towards God. We accept what our role is. We stay in our lane, and we please God. It's an amazing concept, but so often, man wants to stand in rebellion to God. Listen, even saved people rebel against God. It happens all the time. In Titus, turn over there, and we'll be done. Titus chapter number two, I want you to see a great responsibility that God has given to women in the church. We know in verse number 15, with regard to child rearing and what have you, but I want you to see in Titus chapter two, again, Titus and Timothy are really similar with regard to the instruction that's given. Titus is in Crete. Timothy's in Ephesus, but God is giving them great responsibility, very similar in these letters, but notice in chapter two, in verse number one, it says, but speak thou the things which become sound doctrine, and then notice where he says in verse number two that the aged men be sober, grave, temperate, and sound in faith and charity and patience, and then notice in verse number three, the aged women likewise that they be in behavior as becometh holiness, not false accusers, not given to much wine, teachers of good things, and then notice this, that they may teach the young women to be sober, to love their husbands, to love their children, to be discreet, chaste, keepers at home, good, obedient to their own husbands, that the word of God be not blasphemed, and then verse six goes to young men, and so we see in verses three through five, God gives instruction with regard to the aged women. Listen, I'm not gonna put a category on who's an aged women and who's not. You figure that out, amen? But the reality is God has given a great opportunity to the ladies that are mature, aged is the word that is used, to have a godly influence on a next generation. You know what I believe's happened in our churches? We've failed. We have failed. We have failed in discipleship, we have failed, listen, why are more people leaving the church than are coming to the church? Because we failed. They get to a certain age, I'm like, I'm out, I'm done. You can't make me come anymore. But the aged women have a huge opportunity to influence the younger women. You know how much more effective it is for you aged women to talk to these younger girls about modesty and appropriateness than it is for me? I'm begging you this morning, it's your responsibility. It's a hard thing for a pastor to have to deal with that. Now I do, I have to, I preach the whole counsel of God, but the aged women, there's a great opportunity. But you know what so often happens? Is I have people that come to me and complain about things that are taking place, but they're not doing what God instructed them to do. I'm not mad about any of it this morning, but I'm simply saying God's given us roles and responsibilities. And instead of desiring to have somebody else's role and responsibility, why don't we embrace the role and responsibility that God has given to us and do what God has given us to do so that he would be glorified. Behavior in God's church. Let's pray. Father, we love you. We thank you for loving us. Thank you for the word of God. God, I know this morning this isn't super popular, but it's biblical. God, I pray that you deal with each of us as only you can. God, help us to follow your word, to obey your word. Lord, help us to be doers of the word. I pray that you'd move and work in this moment of invitation. If there's one not sure of heaven, God, I pray they'd be saved today. We didn't preach on the gospel or salvation. We sang about it. God, if there's someone not sure of heaven, I pray they'd come this morning. We take a Bible and show them how they can know for sure that heaven's their home. God, I pray that you'd move and work, that you'd be glorified through every decision that's made, for it's in Christ's name we pray. We just.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 1.840000033378601,
      "text": " First Timothy chapter two."
    },
    {
      "id": 1,
      "start": 1.840000033378601,
      "end": 3.240000009536743,
      "text": " I want you to hold your spot there"
    },
    {
      "id": 2,
      "start": 3.240000009536743,
      "end": 5.559999942779541,
      "text": " and turn over to Acts chapter number 20."
    },
    {
      "id": 3,
      "start": 5.559999942779541,
      "end": 8.020000457763672,
      "text": " In fact, we'll begin in Acts chapter number 20,"
    },
    {
      "id": 4,
      "start": 8.020000457763672,
      "end": 9.319999694824219,
      "text": " but we will be preaching through"
    },
    {
      "id": 5,
      "start": 9.319999694824219,
      "end": 13.199999809265137,
      "text": " First Timothy two verses nine through 15 this morning."
    },
    {
      "id": 6,
      "start": 13.199999809265137,
      "end": 15.319999694824219,
      "text": " But by way of introduction,"
    },
    {
      "id": 7,
      "start": 15.319999694824219,
      "end": 17.200000762939453,
      "text": " we'll reference part of the charge"
    },
    {
      "id": 8,
      "start": 17.200000762939453,
      "end": 20.200000762939453,
      "text": " that Paul issues in Acts chapter number 20"
    },
    {
      "id": 9,
      "start": 20.200000762939453,
      "end": 23.459999084472656,
      "text": " to the leaders of the church at Ephesus."
    },
    {
      "id": 10,
      "start": 23.459999084472656,
      "end": 25.200000762939453,
      "text": " It is necessary as we're studying"
    },
    {
      "id": 11,
      "start": 25.200000762939453,
      "end": 26.360000610351562,
      "text": " through the book of First Timothy,"
    },
    {
      "id": 12,
      "start": 26.360000610351562,
      "end": 28.239999771118164,
      "text": " eventually we'll get through Second Timothy as well,"
    },
    {
      "id": 13,
      "start": 28.239999771118164,
      "end": 30.5,
      "text": " Lord willing, in this calendar year,"
    },
    {
      "id": 14,
      "start": 30.5,
      "end": 33.900001525878906,
      "text": " our theme is continue and how we must continue."
    },
    {
      "id": 15,
      "start": 33.900001525878906,
      "end": 38.040000915527344,
      "text": " We see that thought interwoven in First and Second Timothy."
    },
    {
      "id": 16,
      "start": 38.040000915527344,
      "end": 39.68000030517578,
      "text": " We find that it is necessary"
    },
    {
      "id": 17,
      "start": 39.68000030517578,
      "end": 42.599998474121094,
      "text": " as we study these two books of the Bible"
    },
    {
      "id": 18,
      "start": 42.599998474121094,
      "end": 45.779998779296875,
      "text": " that we understand where Timothy is ministering,"
    },
    {
      "id": 19,
      "start": 45.779998779296875,
      "end": 47.91999816894531,
      "text": " not only where, but why."
    },
    {
      "id": 20,
      "start": 47.91999816894531,
      "end": 50.560001373291016,
      "text": " Why is it that God had Timothy in Ephesus?"
    },
    {
      "id": 21,
      "start": 50.560001373291016,
      "end": 51.560001373291016,
      "text": " He's there in Ephesus."
    },
    {
      "id": 22,
      "start": 51.560001373291016,
      "end": 53.720001220703125,
      "text": " We see that in First Timothy chapter number one."
    },
    {
      "id": 23,
      "start": 53.720001220703125,
      "end": 57.720001220703125,
      "text": " And we find that Timothy was given a specific task,"
    },
    {
      "id": 24,
      "start": 58.119998931884766,
      "end": 62.720001220703125,
      "text": " a responsibility while he was ministering there in Ephesus."
    },
    {
      "id": 25,
      "start": 62.720001220703125,
      "end": 65.91999816894531,
      "text": " We find that he was to set some things in order."
    },
    {
      "id": 26,
      "start": 65.91999816894531,
      "end": 68.12000274658203,
      "text": " We find that as you look at the book of Titus,"
    },
    {
      "id": 27,
      "start": 68.12000274658203,
      "end": 71.31999969482422,
      "text": " you would find of Titus with regard to being in Crete,"
    },
    {
      "id": 28,
      "start": 71.31999969482422,
      "end": 73.91999816894531,
      "text": " he too was given specific responsibility"
    },
    {
      "id": 29,
      "start": 73.91999816894531,
      "end": 76.4000015258789,
      "text": " with regard to similar things"
    },
    {
      "id": 30,
      "start": 76.4000015258789,
      "end": 79.23999786376953,
      "text": " that Timothy is doing there in Ephesus."
    },
    {
      "id": 31,
      "start": 79.23999786376953,
      "end": 82.16000366210938,
      "text": " We find as we've studied the first chapter"
    },
    {
      "id": 32,
      "start": 82.16000366210938,
      "end": 85.63999938964844,
      "text": " that he was to confront the false teaching."
    },
    {
      "id": 33,
      "start": 85.63999938964844,
      "end": 87.83999633789062,
      "text": " There were false teachers that had crept in"
    },
    {
      "id": 34,
      "start": 87.83999633789062,
      "end": 90.12000274658203,
      "text": " and he was to confront that false teaching"
    },
    {
      "id": 35,
      "start": 90.12000274658203,
      "end": 93.5199966430664,
      "text": " and he was to teach sound doctrine."
    },
    {
      "id": 36,
      "start": 93.5199966430664,
      "end": 95.37999725341797,
      "text": " And on Wednesday evening"
    },
    {
      "id": 37,
      "start": 95.37999725341797,
      "end": 97.31999969482422,
      "text": " from the book of First Thessalonians chapter five"
    },
    {
      "id": 38,
      "start": 97.31999969482422,
      "end": 101.08000183105469,
      "text": " verses 20 and 21, I preached on Wednesday evening,"
    },
    {
      "id": 39,
      "start": 101.08000183105469,
      "end": 105.16000366210938,
      "text": " taught from that passage of scripture of sound in the faith"
    },
    {
      "id": 40,
      "start": 105.16000366210938,
      "end": 107.76000213623047,
      "text": " and how we need to be sound in the faith."
    },
    {
      "id": 41,
      "start": 107.76000213623047,
      "end": 111.63999938964844,
      "text": " And we find that as Timothy would receive this letter,"
    },
    {
      "id": 42,
      "start": 111.63999938964844,
      "end": 113.23999786376953,
      "text": " First Timothy, the letter that we're studying"
    },
    {
      "id": 43,
      "start": 113.23999786376953,
      "end": 114.87999725341797,
      "text": " through here on Sunday mornings,"
    },
    {
      "id": 44,
      "start": 114.87999725341797,
      "end": 116.95999908447266,
      "text": " that as he would receive that letter,"
    },
    {
      "id": 45,
      "start": 116.95999908447266,
      "end": 119.55999755859375,
      "text": " that it would be a reminder to Timothy"
    },
    {
      "id": 46,
      "start": 119.55999755859375,
      "end": 123.95999908447266,
      "text": " of his responsibility, the reason that he was there."
    },
    {
      "id": 47,
      "start": 123.95999908447266,
      "end": 124.9000015258789,
      "text": " You know, there are some times"
    },
    {
      "id": 48,
      "start": 124.9000015258789,
      "end": 126.68000030517578,
      "text": " that we can get busy in the work"
    },
    {
      "id": 49,
      "start": 126.68000030517578,
      "end": 131.1999969482422,
      "text": " and we can kind of lose sight of really why we're there"
    },
    {
      "id": 50,
      "start": 131.1999969482422,
      "end": 135.60000610351562,
      "text": " and what God's purpose is for us in that place."
    },
    {
      "id": 51,
      "start": 135.60000610351562,
      "end": 138.44000244140625,
      "text": " And we find that this letter, First Timothy,"
    },
    {
      "id": 52,
      "start": 138.44000244140625,
      "end": 142.0800018310547,
      "text": " would serve as a reminder to Timothy"
    },
    {
      "id": 53,
      "start": 142.0800018310547,
      "end": 144.44000244140625,
      "text": " with regard to his responsibility."
    },
    {
      "id": 54,
      "start": 144.9600067138672,
      "end": 147.16000366210938,
      "text": " Not only would it serve as a reminder,"
    },
    {
      "id": 55,
      "start": 147.16000366210938,
      "end": 150.39999389648438,
      "text": " but I believe it would serve as an encouragement."
    },
    {
      "id": 56,
      "start": 150.39999389648438,
      "end": 154.83999633789062,
      "text": " Paul is encouraging Timothy to continue."
    },
    {
      "id": 57,
      "start": 154.83999633789062,
      "end": 157.47999572753906,
      "text": " Though there might be some opposition"
    },
    {
      "id": 58,
      "start": 157.47999572753906,
      "end": 158.32000732421875,
      "text": " that you're dealing with,"
    },
    {
      "id": 59,
      "start": 158.32000732421875,
      "end": 159.94000244140625,
      "text": " though there might be some pushback"
    },
    {
      "id": 60,
      "start": 159.94000244140625,
      "end": 162.5800018310547,
      "text": " with regard to what you're dealing with,"
    },
    {
      "id": 61,
      "start": 162.5800018310547,
      "end": 167.5800018310547,
      "text": " you need to continue and finish the race, finish the course."
    },
    {
      "id": 62,
      "start": 168.16000366210938,
      "end": 172.27999877929688,
      "text": " And we find that this letter would provide both a reminder"
    },
    {
      "id": 63,
      "start": 172.27999877929688,
      "end": 173.8000030517578,
      "text": " but also encouragement."
    },
    {
      "id": 64,
      "start": 173.83999633789062,
      "end": 175.75999450683594,
      "text": " As we enter into the second and third chapter"
    },
    {
      "id": 65,
      "start": 175.75999450683594,
      "end": 177.1199951171875,
      "text": " of the book of First Timothy,"
    },
    {
      "id": 66,
      "start": 177.1199951171875,
      "end": 179.8000030517578,
      "text": " we find that God begins to address"
    },
    {
      "id": 67,
      "start": 179.8000030517578,
      "end": 183.8800048828125,
      "text": " the subject of behavior in his church."
    },
    {
      "id": 68,
      "start": 183.8800048828125,
      "end": 185.1999969482422,
      "text": " And we find that we've already looked"
    },
    {
      "id": 69,
      "start": 185.1999969482422,
      "end": 188.0,
      "text": " at the first eight verses in chapter number two,"
    },
    {
      "id": 70,
      "start": 188.0,
      "end": 190.8800048828125,
      "text": " and we acknowledge that there in chapter number two,"
    },
    {
      "id": 71,
      "start": 190.8800048828125,
      "end": 193.4600067138672,
      "text": " the emphasis is placed in the beginning"
    },
    {
      "id": 72,
      "start": 193.4600067138672,
      "end": 195.63999938964844,
      "text": " of that portion of scripture on prayer."
    },
    {
      "id": 73,
      "start": 195.63999938964844,
      "end": 196.83999633789062,
      "text": " And we spent several weeks"
    },
    {
      "id": 74,
      "start": 196.83999633789062,
      "end": 198.67999267578125,
      "text": " dealing on the subject matter of prayer"
    },
    {
      "id": 75,
      "start": 198.67999267578125,
      "end": 200.36000061035156,
      "text": " and the importance, remember,"
    },
    {
      "id": 76,
      "start": 200.36000061035156,
      "end": 203.8000030517578,
      "text": " Jesus said, my house should be a house of prayer."
    },
    {
      "id": 77,
      "start": 203.8000030517578,
      "end": 206.36000061035156,
      "text": " And we find prayer is so important."
    },
    {
      "id": 78,
      "start": 206.36000061035156,
      "end": 209.55999755859375,
      "text": " It's a privilege that we have as the children of God"
    },
    {
      "id": 79,
      "start": 209.55999755859375,
      "end": 212.39999389648438,
      "text": " that we can go boldly under the throne of grace,"
    },
    {
      "id": 80,
      "start": 212.39999389648438,
      "end": 215.39999389648438,
      "text": " that we have the promises that he hears us"
    },
    {
      "id": 81,
      "start": 215.39999389648438,
      "end": 217.9600067138672,
      "text": " and he answers us and that he's able to do,"
    },
    {
      "id": 82,
      "start": 217.9600067138672,
      "end": 221.8000030517578,
      "text": " exceeding abundantly above all that we ask or think."
    },
    {
      "id": 83,
      "start": 221.8000030517578,
      "end": 223.83999633789062,
      "text": " What a wonderful God we serve,"
    },
    {
      "id": 84,
      "start": 223.83999633789062,
      "end": 225.02000427246094,
      "text": " that he would listen to us,"
    },
    {
      "id": 85,
      "start": 225.02000427246094,
      "end": 227.24000549316406,
      "text": " that we could enter into his presence at any time"
    },
    {
      "id": 86,
      "start": 227.24000549316406,
      "end": 228.63999938964844,
      "text": " for as long as we want,"
    },
    {
      "id": 87,
      "start": 228.75999450683594,
      "end": 230.5399932861328,
      "text": " and we can worship him through prayer,"
    },
    {
      "id": 88,
      "start": 230.5399932861328,
      "end": 233.24000549316406,
      "text": " we can bring our petitions to him in prayer,"
    },
    {
      "id": 89,
      "start": 233.24000549316406,
      "end": 235.8000030517578,
      "text": " and what a joy it is to be in his presence."
    },
    {
      "id": 90,
      "start": 235.8000030517578,
      "end": 237.67999267578125,
      "text": " We must acknowledge that as we look at"
    },
    {
      "id": 91,
      "start": 237.67999267578125,
      "end": 241.39999389648438,
      "text": " the second and third chapter of the book of 1 Timothy,"
    },
    {
      "id": 92,
      "start": 241.39999389648438,
      "end": 245.83999633789062,
      "text": " that this is God giving instruction"
    },
    {
      "id": 93,
      "start": 245.83999633789062,
      "end": 248.72000122070312,
      "text": " with regard to behavior in his church."
    },
    {
      "id": 94,
      "start": 248.72000122070312,
      "end": 252.32000732421875,
      "text": " So we must understand, number one, that it's God's church."
    },
    {
      "id": 95,
      "start": 252.32000732421875,
      "end": 254.8000030517578,
      "text": " Amen, it's not my church, it's not your church."
    },
    {
      "id": 96,
      "start": 254.8000030517578,
      "end": 257.55999755859375,
      "text": " I know sometimes we use that phraseology"
    },
    {
      "id": 97,
      "start": 257.55999755859375,
      "end": 261.0,
      "text": " of my church or our church, and I understand that,"
    },
    {
      "id": 98,
      "start": 261.0,
      "end": 264.29998779296875,
      "text": " but ultimately, we must acknowledge this morning"
    },
    {
      "id": 99,
      "start": 264.29998779296875,
      "end": 267.8800048828125,
      "text": " that it's God's church, and we understand this morning"
    },
    {
      "id": 100,
      "start": 267.8800048828125,
      "end": 271.0400085449219,
      "text": " that if it's God's church and he's established it,"
    },
    {
      "id": 101,
      "start": 271.0400085449219,
      "end": 275.8800048828125,
      "text": " then he also, through his word, has given the instruction"
    },
    {
      "id": 102,
      "start": 275.8800048828125,
      "end": 280.8800048828125,
      "text": " on how people, his people, are to behave in his church."
    },
    {
      "id": 103,
      "start": 281.8800048828125,
      "end": 285.20001220703125,
      "text": " Amen, and that's important for us to understand."
    },
    {
      "id": 104,
      "start": 285.20001220703125,
      "end": 288.2799987792969,
      "text": " We find that though Timothy is receiving this letter"
    },
    {
      "id": 105,
      "start": 288.2799987792969,
      "end": 290.8800048828125,
      "text": " from Paul, we understand that all scripture"
    },
    {
      "id": 106,
      "start": 290.8800048828125,
      "end": 295.82000732421875,
      "text": " is given by inspiration of God, and it's profitable for us."
    },
    {
      "id": 107,
      "start": 295.82000732421875,
      "end": 298.5799865722656,
      "text": " We understand that the Bible is authoritative."
    },
    {
      "id": 108,
      "start": 298.5799865722656,
      "end": 302.1600036621094,
      "text": " It is profitable, and as we look at the second"
    },
    {
      "id": 109,
      "start": 302.1600036621094,
      "end": 303.82000732421875,
      "text": " and third chapter over the next couple of weeks,"
    },
    {
      "id": 110,
      "start": 303.82000732421875,
      "end": 305.4200134277344,
      "text": " we're gonna deal with this subject,"
    },
    {
      "id": 111,
      "start": 305.4200134277344,
      "end": 308.8599853515625,
      "text": " behavior in God's church, behavior in God's church."
    },
    {
      "id": 112,
      "start": 308.8800048828125,
      "end": 310.0799865722656,
      "text": " Today is part one."
    },
    {
      "id": 113,
      "start": 310.0799865722656,
      "end": 311.82000732421875,
      "text": " Next week, well, we got a missionary next week,"
    },
    {
      "id": 114,
      "start": 311.82000732421875,
      "end": 313.67999267578125,
      "text": " so it'll be part two the following week,"
    },
    {
      "id": 115,
      "start": 313.67999267578125,
      "end": 318.67999267578125,
      "text": " but we look at this subject, and because it is his church,"
    },
    {
      "id": 116,
      "start": 318.67999267578125,
      "end": 322.4599914550781,
      "text": " understand this morning that because it is his church,"
    },
    {
      "id": 117,
      "start": 322.4599914550781,
      "end": 327.4599914550781,
      "text": " he has the authority and the right to dictate,"
    },
    {
      "id": 118,
      "start": 330.260009765625,
      "end": 332.3800048828125,
      "text": " I choose that word on purpose,"
    },
    {
      "id": 119,
      "start": 332.3800048828125,
      "end": 337.3800048828125,
      "text": " to dictate how we are to behave in his church, amen?"
    },
    {
      "id": 120,
      "start": 338.2200012207031,
      "end": 340.4200134277344,
      "text": " It's his church."
    },
    {
      "id": 121,
      "start": 340.4200134277344,
      "end": 342.0199890136719,
      "text": " We're his people."
    },
    {
      "id": 122,
      "start": 342.0199890136719,
      "end": 345.70001220703125,
      "text": " He has the right to dictate behavior"
    },
    {
      "id": 123,
      "start": 345.70001220703125,
      "end": 347.8399963378906,
      "text": " that is appropriate and acceptable"
    },
    {
      "id": 124,
      "start": 347.8399963378906,
      "end": 352.5400085449219,
      "text": " versus behavior that is unacceptable and inappropriate,"
    },
    {
      "id": 125,
      "start": 352.5400085449219,
      "end": 354.739990234375,
      "text": " amen, and it's his church,"
    },
    {
      "id": 126,
      "start": 354.739990234375,
      "end": 357.739990234375,
      "text": " and so we should rejoice in that this morning."
    },
    {
      "id": 127,
      "start": 357.739990234375,
      "end": 359.4599914550781,
      "text": " I have you in Acts chapter number 20."
    },
    {
      "id": 128,
      "start": 359.4599914550781,
      "end": 361.0199890136719,
      "text": " I want you to notice just a few verses"
    },
    {
      "id": 129,
      "start": 361.0199890136719,
      "end": 363.32000732421875,
      "text": " before we jump over to the book of 1 Timothy."
    },
    {
      "id": 130,
      "start": 363.32000732421875,
      "end": 365.6199951171875,
      "text": " Notice in Acts chapter 20 and verse 28,"
    },
    {
      "id": 131,
      "start": 365.6199951171875,
      "end": 366.5,
      "text": " the Bible says this,"
    },
    {
      "id": 132,
      "start": 366.5,
      "end": 370.5799865722656,
      "text": " take heed therefore unto yourselves"
    },
    {
      "id": 133,
      "start": 370.5799865722656,
      "end": 373.3800048828125,
      "text": " and to all the flock over which the Holy Ghost"
    },
    {
      "id": 134,
      "start": 373.3800048828125,
      "end": 375.3800048828125,
      "text": " hath made you overseers,"
    },
    {
      "id": 135,
      "start": 375.3800048828125,
      "end": 378.3800048828125,
      "text": " so he's speaking to the leaders of the church at Ephesus,"
    },
    {
      "id": 136,
      "start": 378.3800048828125,
      "end": 381.6199951171875,
      "text": " to feed the church of God."
    },
    {
      "id": 137,
      "start": 381.6199951171875,
      "end": 383.0199890136719,
      "text": " Notice this phrase,"
    },
    {
      "id": 138,
      "start": 383.0199890136719,
      "end": 388.0199890136719,
      "text": " which he hath purchased with his own blood, amen?"
    },
    {
      "id": 139,
      "start": 390.9200134277344,
      "end": 392.70001220703125,
      "text": " Redeemed, we were singing this morning,"
    },
    {
      "id": 140,
      "start": 392.70001220703125,
      "end": 396.1000061035156,
      "text": " saved by the blood of the crucified one,"
    },
    {
      "id": 141,
      "start": 396.1000061035156,
      "end": 398.5,
      "text": " and the church is his church."
    },
    {
      "id": 142,
      "start": 398.5,
      "end": 400.8800048828125,
      "text": " It's not our church, it's his church."
    },
    {
      "id": 143,
      "start": 400.8800048828125,
      "end": 404.1400146484375,
      "text": " Notice in verse 29, as Paul gives this charge"
    },
    {
      "id": 144,
      "start": 404.1400146484375,
      "end": 406.05999755859375,
      "text": " to the elders, the leaders of the church,"
    },
    {
      "id": 145,
      "start": 406.05999755859375,
      "end": 407.4599914550781,
      "text": " he says, for I know this,"
    },
    {
      "id": 146,
      "start": 407.4599914550781,
      "end": 411.0199890136719,
      "text": " that after my departing shall grievous wolves"
    },
    {
      "id": 147,
      "start": 411.0199890136719,
      "end": 414.739990234375,
      "text": " enter in among you, not sparing the flock."
    },
    {
      "id": 148,
      "start": 414.739990234375,
      "end": 417.2200012207031,
      "text": " Verse number 30 of Acts 20,"
    },
    {
      "id": 149,
      "start": 417.2200012207031,
      "end": 421.1000061035156,
      "text": " also of your own selves shall men arise,"
    },
    {
      "id": 150,
      "start": 421.1000061035156,
      "end": 426.1000061035156,
      "text": " speaking perverse things to draw away disciples after them."
    },
    {
      "id": 151,
      "start": 427.2200012207031,
      "end": 432.0199890136719,
      "text": " So God in his wisdom and in his omniscience"
    },
    {
      "id": 152,
      "start": 432.0199890136719,
      "end": 433.8999938964844,
      "text": " and the fact that he's eternal,"
    },
    {
      "id": 153,
      "start": 433.8999938964844,
      "end": 437.3800048828125,
      "text": " he knew what would happen in Ephesus."
    },
    {
      "id": 154,
      "start": 437.3800048828125,
      "end": 439.82000732421875,
      "text": " So therefore he used the apostle Paul"
    },
    {
      "id": 155,
      "start": 439.82000732421875,
      "end": 442.5400085449219,
      "text": " to give this charge to the leaders"
    },
    {
      "id": 156,
      "start": 442.5400085449219,
      "end": 444.8999938964844,
      "text": " in Acts chapter number 20 of the church at Ephesus,"
    },
    {
      "id": 157,
      "start": 444.8999938964844,
      "end": 447.3399963378906,
      "text": " but then in God's infinite wisdom,"
    },
    {
      "id": 158,
      "start": 447.3399963378906,
      "end": 450.70001220703125,
      "text": " he had Timothy stay there in Ephesus"
    },
    {
      "id": 159,
      "start": 450.70001220703125,
      "end": 453.2200012207031,
      "text": " to be able to teach and to instruct"
    },
    {
      "id": 160,
      "start": 453.2200012207031,
      "end": 456.4599914550781,
      "text": " and to help this church walk worthy"
    },
    {
      "id": 161,
      "start": 456.4599914550781,
      "end": 458.8999938964844,
      "text": " and please God, this church at Ephesus."
    },
    {
      "id": 162,
      "start": 458.8999938964844,
      "end": 463.5799865722656,
      "text": " You know, the church at Ephesus is addressed in the book"
    },
    {
      "id": 163,
      "start": 463.5799865722656,
      "end": 465.5,
      "text": " of Revelation, and they're charged"
    },
    {
      "id": 164,
      "start": 465.5,
      "end": 468.0799865722656,
      "text": " with the fact that they left their first love."
    },
    {
      "id": 165,
      "start": 469.260009765625,
      "end": 471.05999755859375,
      "text": " That's a serious charge."
    },
    {
      "id": 166,
      "start": 471.05999755859375,
      "end": 473.1000061035156,
      "text": " And we find that Timothy is there"
    },
    {
      "id": 167,
      "start": 473.1000061035156,
      "end": 475.260009765625,
      "text": " and Timothy is giving this instruction."
    },
    {
      "id": 168,
      "start": 475.260009765625,
      "end": 477.5,
      "text": " And first, Timothy, I have you in chapter two,"
    },
    {
      "id": 169,
      "start": 477.5,
      "end": 481.05999755859375,
      "text": " but I want you to look very quickly at chapter three,"
    },
    {
      "id": 170,
      "start": 481.05999755859375,
      "end": 484.9800109863281,
      "text": " really the latter statements with regard to this section"
    },
    {
      "id": 171,
      "start": 484.9800109863281,
      "end": 487.94000244140625,
      "text": " of chapter two and three on behavior in God's church."
    },
    {
      "id": 172,
      "start": 487.94000244140625,
      "end": 490.17999267578125,
      "text": " And I want you to see what Paul says"
    },
    {
      "id": 173,
      "start": 490.17999267578125,
      "end": 493.8599853515625,
      "text": " beginning in verse number 14 of chapter three."
    },
    {
      "id": 174,
      "start": 493.8599853515625,
      "end": 495.5799865722656,
      "text": " In first Timothy three in verse number 14,"
    },
    {
      "id": 175,
      "start": 495.5799865722656,
      "end": 497.0199890136719,
      "text": " notice what it says."
    },
    {
      "id": 176,
      "start": 497.0199890136719,
      "end": 501.5400085449219,
      "text": " These things write I unto thee."
    },
    {
      "id": 177,
      "start": 501.5400085449219,
      "end": 502.5799865722656,
      "text": " Okay, so what things?"
    },
    {
      "id": 178,
      "start": 502.5799865722656,
      "end": 504.260009765625,
      "text": " Well, the things that are contained in this letter,"
    },
    {
      "id": 179,
      "start": 504.260009765625,
      "end": 505.1000061035156,
      "text": " in this book."
    },
    {
      "id": 180,
      "start": 505.1000061035156,
      "end": 507.6199951171875,
      "text": " So Paul's saying here, I'm writing these things"
    },
    {
      "id": 181,
      "start": 507.6199951171875,
      "end": 510.5,
      "text": " and then notice, hoping to come unto thee shortly."
    },
    {
      "id": 182,
      "start": 510.5,
      "end": 513.280029296875,
      "text": " Now, he didn't know when he was gonna be able to come."
    },
    {
      "id": 183,
      "start": 513.280029296875,
      "end": 514.9000244140625,
      "text": " We find in chapter number four,"
    },
    {
      "id": 184,
      "start": 514.9000244140625,
      "end": 516.4199829101562,
      "text": " the memory verse for the month of April."
    },
    {
      "id": 185,
      "start": 516.4199829101562,
      "end": 518.6799926757812,
      "text": " He says, till I come, give attendance."
    },
    {
      "id": 186,
      "start": 518.6799926757812,
      "end": 520.9000244140625,
      "text": " And he's speaking about his desire to come,"
    },
    {
      "id": 187,
      "start": 520.9000244140625,
      "end": 522.02001953125,
      "text": " give attendance to what?"
    },
    {
      "id": 188,
      "start": 522.02001953125,
      "end": 525.3400268554688,
      "text": " Well, to reading, to exhortation, to doctrine."
    },
    {
      "id": 189,
      "start": 525.3400268554688,
      "end": 528.02001953125,
      "text": " Now we understand also that one day Jesus is gonna come"
    },
    {
      "id": 190,
      "start": 528.02001953125,
      "end": 530.0999755859375,
      "text": " and what a blessed truth that is."
    },
    {
      "id": 191,
      "start": 530.0999755859375,
      "end": 531.5999755859375,
      "text": " The head of the church, he's gonna come."
    },
    {
      "id": 192,
      "start": 531.5999755859375,
      "end": 533.5800170898438,
      "text": " The chief shepherd, he's gonna come"
    },
    {
      "id": 193,
      "start": 533.5800170898438,
      "end": 536.2999877929688,
      "text": " and he's gonna take us back to be with him."
    },
    {
      "id": 194,
      "start": 536.2999877929688,
      "end": 538.97998046875,
      "text": " What a joyous truth that is."
    },
    {
      "id": 195,
      "start": 538.97998046875,
      "end": 542.9400024414062,
      "text": " By the way, I wanna live for him until that trumpet sounds."
    },
    {
      "id": 196,
      "start": 542.9400024414062,
      "end": 545.5,
      "text": " That was what was said in that song that Julianna sang."
    },
    {
      "id": 197,
      "start": 545.5,
      "end": 548.5999755859375,
      "text": " And I hope that that is your joy, your desire this morning."
    },
    {
      "id": 198,
      "start": 548.5999755859375,
      "end": 552.8400268554688,
      "text": " But notice in verse 15, he says, but if I tarry long,"
    },
    {
      "id": 199,
      "start": 552.8400268554688,
      "end": 557.8400268554688,
      "text": " that thou mayest know how thou oughtest to behave thyself"
    },
    {
      "id": 200,
      "start": 559.260009765625,
      "end": 562.5399780273438,
      "text": " in the house of God."
    },
    {
      "id": 201,
      "start": 562.5399780273438,
      "end": 566.5,
      "text": " Notice, which is the church of the living God,"
    },
    {
      "id": 202,
      "start": 566.5,
      "end": 570.6599731445312,
      "text": " the pillar and ground of the truth."
    },
    {
      "id": 203,
      "start": 572.5,
      "end": 576.97998046875,
      "text": " So here in these chapters, Paul is giving Timothy"
    },
    {
      "id": 204,
      "start": 576.97998046875,
      "end": 581.5399780273438,
      "text": " instruction with regard to behavior in God's church."
    },
    {
      "id": 205,
      "start": 581.5399780273438,
      "end": 583.0599975585938,
      "text": " As I mentioned, the second chapter begins"
    },
    {
      "id": 206,
      "start": 583.0599975585938,
      "end": 585.280029296875,
      "text": " with an emphasis on prayer."
    },
    {
      "id": 207,
      "start": 585.280029296875,
      "end": 587.97998046875,
      "text": " When we come to the end of the chapter of chapter number two"
    },
    {
      "id": 208,
      "start": 587.97998046875,
      "end": 589.9400024414062,
      "text": " and we find most of chapter number three,"
    },
    {
      "id": 209,
      "start": 590.4600219726562,
      "end": 592.8599853515625,
      "text": " the first 13 verses of chapter number three,"
    },
    {
      "id": 210,
      "start": 592.8599853515625,
      "end": 597.8599853515625,
      "text": " deal with, address the matter of roles and structure"
    },
    {
      "id": 211,
      "start": 598.4199829101562,
      "end": 600.260009765625,
      "text": " within God's church."
    },
    {
      "id": 0,
      "start": 600.260009765625,
      "end": 605.0400099754333,
      "text": " Now, understand this morning that the passage that is before us at the end of chapter number"
    },
    {
      "id": 1,
      "start": 605.0400099754333,
      "end": 609.840009689331,
      "text": " two addresses specifically women in the church."
    },
    {
      "id": 2,
      "start": 609.840009689331,
      "end": 614.5600099563599,
      "text": " Now, don't get mad to start out right now, because this is God's Word, amen?"
    },
    {
      "id": 3,
      "start": 614.5600099563599,
      "end": 616.840009689331,
      "text": " And we have to understand what God says."
    },
    {
      "id": 4,
      "start": 616.840009689331,
      "end": 623.6000099182129,
      "text": " And we find that as God is going to address the subject matter, that God gives great clarity"
    },
    {
      "id": 5,
      "start": 623.9000091552734,
      "end": 633.9000091552734,
      "text": " with regard to the roles and responsibilities, the structure, again, within His church."
    },
    {
      "id": 6,
      "start": 633.9000091552734,
      "end": 635.320011138916,
      "text": " It's His church."
    },
    {
      "id": 7,
      "start": 635.320011138916,
      "end": 645.2800102233887,
      "text": " And He has the right to demand of us that we behave in alignment to His Word."
    },
    {
      "id": 8,
      "start": 645.2800102233887,
      "end": 651.8800086975098,
      "text": " By the way, if we want to have God's blessing upon our ministry, we better do God's work"
    },
    {
      "id": 9,
      "start": 651.8800086975098,
      "end": 654.4400100708008,
      "text": " God's way, amen?"
    },
    {
      "id": 10,
      "start": 654.4400100708008,
      "end": 659.1200103759766,
      "text": " You say, well, there's some churches that are real big that don't follow God's Word."
    },
    {
      "id": 11,
      "start": 659.1200103759766,
      "end": 664.4400100708008,
      "text": " Numbers doesn't mean everything, amen?"
    },
    {
      "id": 12,
      "start": 664.4400100708008,
      "end": 671.0000076293945,
      "text": " There's some lousy athletic teams that get people to show up to pay big bucks to watch"
    },
    {
      "id": 13,
      "start": 671.0000076293945,
      "end": 678.1200103759766,
      "text": " them fumble and flounder around, and they have 60,000 people that pay to go."
    },
    {
      "id": 14,
      "start": 678.1200103759766,
      "end": 681.5600128173828,
      "text": " Crowds don't mean everything, okay?"
    },
    {
      "id": 15,
      "start": 681.5600128173828,
      "end": 685.5400085449219,
      "text": " So as we look at the text of Scripture this morning, notice in verse number 9, the Bible"
    },
    {
      "id": 16,
      "start": 685.5400085449219,
      "end": 690.4800109863281,
      "text": " says in like manner also, 1 Timothy 2, beginning in verse number 9, in like manner also that"
    },
    {
      "id": 17,
      "start": 690.4800109863281,
      "end": 697.140007019043,
      "text": " women adorn themselves in modest apparel with shamefacedness and sobriety, not with braided"
    },
    {
      "id": 18,
      "start": 697.140007019043,
      "end": 702.8400115966797,
      "text": " hair or gold or pearls or costly array, but which becometh women professing godliness"
    },
    {
      "id": 19,
      "start": 702.8400115966797,
      "end": 704.4800109863281,
      "text": " with good works."
    },
    {
      "id": 20,
      "start": 704.4800109863281,
      "end": 710.5600128173828,
      "text": " Let the woman learn in silence with all subjection, but I suffer not a woman to teach, nor to"
    },
    {
      "id": 21,
      "start": 710.5600128173828,
      "end": 714.0400085449219,
      "text": " usurp authority over the man, but to be in silence."
    },
    {
      "id": 22,
      "start": 714.0400085449219,
      "end": 719.5600128173828,
      "text": " For Adam was first formed, then Eve, and Adam was not deceived, but the woman being deceived"
    },
    {
      "id": 23,
      "start": 719.5600128173828,
      "end": 722.1600112915039,
      "text": " was in the transgression."
    },
    {
      "id": 24,
      "start": 722.1600112915039,
      "end": 727.9600067138672,
      "text": " Notwithstanding, she shall be saved and childbearing if they continue in faith and charity and"
    },
    {
      "id": 25,
      "start": 727.9600067138672,
      "end": 731.6400146484375,
      "text": " holiness with sobriety."
    },
    {
      "id": 26,
      "start": 731.6400146484375,
      "end": 736.760009765625,
      "text": " Let me say today that as we look at this passage of Scripture, and again, specifically the"
    },
    {
      "id": 27,
      "start": 736.760009765625,
      "end": 740.6000061035156,
      "text": " passage we'll deal with address women in the church."
    },
    {
      "id": 28,
      "start": 740.6000061035156,
      "end": 745.4800109863281,
      "text": " Understand with me that in the beginning, God said that He created male and female."
    },
    {
      "id": 29,
      "start": 745.4800109863281,
      "end": 750.4000091552734,
      "text": " This nonsense that's going on in our world today with gender confusion and gender dysphoria,"
    },
    {
      "id": 30,
      "start": 750.4000091552734,
      "end": 755.5600128173828,
      "text": " whatever else you want to call it, is a bunch of nonsense, and God said that He made in"
    },
    {
      "id": 31,
      "start": 755.5600128173828,
      "end": 759.5200042724609,
      "text": " the beginning male and female, amen?"
    },
    {
      "id": 32,
      "start": 759.5200042724609,
      "end": 763.6800079345703,
      "text": " And by the way, they're made in the image of God, amen?"
    },
    {
      "id": 33,
      "start": 763.6800079345703,
      "end": 767.1600036621094,
      "text": " But God has established structure."
    },
    {
      "id": 34,
      "start": 767.1600036621094,
      "end": 771.4400024414062,
      "text": " Someone said this to me this week with regard to a ministry opportunity that we were going"
    },
    {
      "id": 35,
      "start": 771.4400024414062,
      "end": 775.4800109863281,
      "text": " to partner together with and try to do, and here's what he said to me as a pastor of another"
    },
    {
      "id": 36,
      "start": 775.4800109863281,
      "end": 779.2400054931641,
      "text": " church and he wants to come alongside and help us with something, and he said, listen,"
    },
    {
      "id": 37,
      "start": 779.2400054931641,
      "end": 787.4000091552734,
      "text": " we're going to put ourselves under your authority because anything with two heads is a monster."
    },
    {
      "id": 38,
      "start": 787.4000091552734,
      "end": 789.4400024414062,
      "text": " Those were his words to me."
    },
    {
      "id": 39,
      "start": 789.4400024414062,
      "end": 795.0000152587891,
      "text": " And he said, we are going to put our church and our folks that will help with this ministry"
    },
    {
      "id": 40,
      "start": 795.0000152587891,
      "end": 798.2000122070312,
      "text": " under your authority."
    },
    {
      "id": 41,
      "start": 798.2000122070312,
      "end": 799.4400024414062,
      "text": " God has given authority."
    },
    {
      "id": 42,
      "start": 799.4400024414062,
      "end": 806.4800109863281,
      "text": " Here in this passage of Scripture, we find that God addresses the roles of women within"
    },
    {
      "id": 43,
      "start": 806.4800109863281,
      "end": 811.1600036621094,
      "text": " the church, and we find that as we look at this passage of Scripture, just two thoughts"
    },
    {
      "id": 44,
      "start": 811.1600036621094,
      "end": 815.7200164794922,
      "text": " this morning, as we look at this, number one, if you're taking notes, there's instruction"
    },
    {
      "id": 45,
      "start": 815.7200164794922,
      "end": 823.4000091552734,
      "text": " with respect to attire, to attire, and we find that God in verse 9 and 10 gives this"
    },
    {
      "id": 46,
      "start": 823.4000091552734,
      "end": 824.4000091552734,
      "text": " instruction."
    },
    {
      "id": 47,
      "start": 824.4000091552734,
      "end": 830.0800170898438,
      "text": " Now, we find that there's an obvious emphasis in this text of Scripture on that which is"
    },
    {
      "id": 48,
      "start": 830.0800170898438,
      "end": 833.3200073242188,
      "text": " modest and that which is appropriate."
    },
    {
      "id": 49,
      "start": 833.3200073242188,
      "end": 839.2000122070312,
      "text": " You find that the Bible says in like manner also that women adorn themselves in modest"
    },
    {
      "id": 50,
      "start": 839.2000122070312,
      "end": 844.8000030517578,
      "text": " apparel with shamefacedness and sobriety, not with braided hair or gold or pearls or"
    },
    {
      "id": 51,
      "start": 844.8800048828125,
      "end": 851.2000122070312,
      "text": " costly array, but which becometh women professing godliness with good works."
    },
    {
      "id": 52,
      "start": 851.2000122070312,
      "end": 856.3600158691406,
      "text": " As we look at those two verses of Scripture, we would really understand that as you again"
    },
    {
      "id": 53,
      "start": 856.3600158691406,
      "end": 862.2799987792969,
      "text": " recognize where Timothy is ministering and what's going on in Ephesus, there was a tendency,"
    },
    {
      "id": 54,
      "start": 862.2799987792969,
      "end": 869.2400207519531,
      "text": " if you read some historical data, there's a tendency within some, within this region,"
    },
    {
      "id": 55,
      "start": 869.2400207519531,
      "end": 875.2799987792969,
      "text": " to be real worried about their attire, almost like a fashion show type of thing."
    },
    {
      "id": 56,
      "start": 875.2799987792969,
      "end": 880.4800109863281,
      "text": " Listen, when you go to church, you're not going to a fashion show, amen?"
    },
    {
      "id": 57,
      "start": 880.4800109863281,
      "end": 883.0800170898438,
      "text": " It's to be modest and it's to be appropriate."
    },
    {
      "id": 58,
      "start": 883.0800170898438,
      "end": 887.4400024414062,
      "text": " We find that as we look at these verses of Scripture, as God is giving instruction with"
    },
    {
      "id": 59,
      "start": 887.4400024414062,
      "end": 892.1800231933594,
      "text": " respect to attire, that God is giving us this instruction."
    },
    {
      "id": 60,
      "start": 892.1800231933594,
      "end": 898.2799987792969,
      "text": " This is not simply Paul providing the instruction, it's God speaking through Paul, using Paul"
    },
    {
      "id": 61,
      "start": 898.3200073242188,
      "end": 902.2400207519531,
      "text": " as his human penman to give the instruction."
    },
    {
      "id": 62,
      "start": 902.2400207519531,
      "end": 906.2400207519531,
      "text": " We find that the Bible, really as you study the whole of Scripture, you'll find that there"
    },
    {
      "id": 63,
      "start": 906.2400207519531,
      "end": 911.7000122070312,
      "text": " are many references with regard to attire and that which is appropriate."
    },
    {
      "id": 64,
      "start": 911.7000122070312,
      "end": 915.4800109863281,
      "text": " We understand this morning that there are different people that would have different"
    },
    {
      "id": 65,
      "start": 915.4800109863281,
      "end": 919.3399963378906,
      "text": " opinions with regard to what is modest or what is appropriate."
    },
    {
      "id": 66,
      "start": 919.3399963378906,
      "end": 923.1199951171875,
      "text": " So here's what I'm thankful for, God didn't leave it for my opinion or your opinion, He"
    },
    {
      "id": 67,
      "start": 923.1199951171875,
      "end": 926.5599975585938,
      "text": " gave us truth in His Word, amen?"
    },
    {
      "id": 68,
      "start": 926.5599975585938,
      "end": 929.8399963378906,
      "text": " And we need to take that truth and we need to understand that we apply it."
    },
    {
      "id": 69,
      "start": 929.8399963378906,
      "end": 933.8399963378906,
      "text": " I would say this by way of application of a number of verses that we don't have time"
    },
    {
      "id": 70,
      "start": 933.8399963378906,
      "end": 939.760009765625,
      "text": " to go to all of them this morning, but we would say this, it should not be too short,"
    },
    {
      "id": 71,
      "start": 939.760009765625,
      "end": 944.02001953125,
      "text": " it should not be too low, and it should not be too tight."
    },
    {
      "id": 72,
      "start": 944.02001953125,
      "end": 949.2000122070312,
      "text": " Now let me say this, God is addressing women in this particular text of Scripture."
    },
    {
      "id": 73,
      "start": 949.2000122070312,
      "end": 954.3600158691406,
      "text": " But understand today that as we enter into this 2024 and all the things are going on,"
    },
    {
      "id": 74,
      "start": 954.3600158691406,
      "end": 957.52001953125,
      "text": " some of those same things need to be said to men."
    },
    {
      "id": 75,
      "start": 957.52001953125,
      "end": 961.8000183105469,
      "text": " There's some men that wear some clothes that are too tight, amen?"
    },
    {
      "id": 76,
      "start": 961.8000183105469,
      "end": 962.8000183105469,
      "text": " And they ought not."
    },
    {
      "id": 77,
      "start": 962.8000183105469,
      "end": 966.0800170898438,
      "text": " I don't know how many of you tried to buy a suit recently, but they got all this modern"
    },
    {
      "id": 78,
      "start": 966.0800170898438,
      "end": 972.3200073242188,
      "text": " fit suit stuff, I don't fit in what they have, amen?"
    },
    {
      "id": 79,
      "start": 972.3200073242188,
      "end": 977.4000244140625,
      "text": " And the reality is that modesty and appropriateness is important, why?"
    },
    {
      "id": 80,
      "start": 977.4000244140625,
      "end": 979.3200073242188,
      "text": " Because it's God's house."
    },
    {
      "id": 81,
      "start": 979.3200073242188,
      "end": 983.7799987792969,
      "text": " We're coming not for a fashion show, but we're coming to worship our God."
    },
    {
      "id": 82,
      "start": 983.7799987792969,
      "end": 985.5400085449219,
      "text": " And we're coming to worship Him."
    },
    {
      "id": 83,
      "start": 985.5400085449219,
      "end": 990.6400146484375,
      "text": " The text here, as we look at this and we see what's going on, and we find that modesty"
    },
    {
      "id": 84,
      "start": 990.6400146484375,
      "end": 995.260009765625,
      "text": " and appropriateness has been an issue, not just in 2024, but it's been an issue throughout"
    },
    {
      "id": 85,
      "start": 995.260009765625,
      "end": 999.9000244140625,
      "text": " the entire church age, and therefore God gives the instruction."
    },
    {
      "id": 86,
      "start": 999.9000244140625,
      "end": 1003.5800170898438,
      "text": " Let me say this also, we're not going to, again, you can jot down the verses, but if"
    },
    {
      "id": 87,
      "start": 1003.5800170898438,
      "end": 1008.9600219726562,
      "text": " you were to go back to Proverbs chapter 7, and verse number 10 specifically, the Bible"
    },
    {
      "id": 88,
      "start": 1008.9600219726562,
      "end": 1013.2200012207031,
      "text": " speaks about the attire of an harlot, okay?"
    },
    {
      "id": 89,
      "start": 1013.6600036621094,
      "end": 1016.6199951171875,
      "text": " Now you say, man, pastor, that's strong language, that's the Bible, it's the words that are"
    },
    {
      "id": 90,
      "start": 1016.6199951171875,
      "end": 1020.7799987792969,
      "text": " used in Proverbs 7 and verse number 10, and why do I bring that up this morning?"
    },
    {
      "id": 91,
      "start": 1020.7799987792969,
      "end": 1031.3000183105469,
      "text": " Well, because there was attire that was communicating something to those that were in that society."
    },
    {
      "id": 92,
      "start": 1031.3000183105469,
      "end": 1033.3399963378906,
      "text": " What was the attire communicating?"
    },
    {
      "id": 93,
      "start": 1033.3399963378906,
      "end": 1035.7000122070312,
      "text": " That they were an harlot."
    },
    {
      "id": 94,
      "start": 1035.7000122070312,
      "end": 1041.7799987792969,
      "text": " That's why the attire is referred to as the attire of an harlot, okay?"
    },
    {
      "id": 95,
      "start": 1041.7799987792969,
      "end": 1047.9800109863281,
      "text": " Now I would argue this morning that in our 2024, as we look at what's taking place in"
    },
    {
      "id": 96,
      "start": 1047.9800109863281,
      "end": 1052.6600036621094,
      "text": " our world today, that probably what God is referring to in Proverbs 7 and verse number"
    },
    {
      "id": 97,
      "start": 1052.6600036621094,
      "end": 1058.6600036621094,
      "text": " 10 was actually a whole lot modest, more modest than a lot of things that are available today."
    },
    {
      "id": 98,
      "start": 1058.6600036621094,
      "end": 1063.7799987792969,
      "text": " I understand the difficulties, I have a wife and two daughters, I understand the difficulties,"
    },
    {
      "id": 99,
      "start": 1063.7799987792969,
      "end": 1069.3399963378906,
      "text": " but we must acknowledge this morning the fact that God has given us instruction."
    },
    {
      "id": 100,
      "start": 1069.3399963378906,
      "end": 1076.3800048828125,
      "text": " I want to remind you that in Genesis chapter 38 and verses 14 and 15, what Tamar did was"
    },
    {
      "id": 101,
      "start": 1076.3800048828125,
      "end": 1082.7799987792969,
      "text": " changed her garments and her appearance, and you can read of what takes place with Judah"
    },
    {
      "id": 102,
      "start": 1082.7799987792969,
      "end": 1087.5400085449219,
      "text": " and Tamar, and Judah says, can I come in unto thee?"
    },
    {
      "id": 103,
      "start": 1087.5400085449219,
      "end": 1088.5400085449219,
      "text": " Why?"
    },
    {
      "id": 104,
      "start": 1088.5400085449219,
      "end": 1096.260009765625,
      "text": " Because her attire was changed, her appearance was changed, she led on that she was available"
    },
    {
      "id": 105,
      "start": 1096.260009765625,
      "end": 1098.7400207519531,
      "text": " in that fashion."
    },
    {
      "id": 106,
      "start": 1098.7400207519531,
      "end": 1104.6600036621094,
      "text": " So we find this morning that God is giving us this instruction, and it's good instruction,"
    },
    {
      "id": 107,
      "start": 1104.6600036621094,
      "end": 1107.1400146484375,
      "text": " it's profitable instruction."
    },
    {
      "id": 108,
      "start": 1107.1400146484375,
      "end": 1112.4400024414062,
      "text": " Now we find if you take over 1 Peter chapter 3, look over there, as we look at a sister"
    },
    {
      "id": 109,
      "start": 1112.4400024414062,
      "end": 1119.3400268554688,
      "text": " passage of Scripture in 1 Peter chapter number 3, that deals with this same subject matter,"
    },
    {
      "id": 110,
      "start": 1119.3400268554688,
      "end": 1128.3400268554688,
      "text": " and we find that here in 1 Peter chapter number 3 and verses 3 and 4, the Bible says this,"
    },
    {
      "id": 111,
      "start": 1128.3400268554688,
      "end": 1134.8200073242188,
      "text": " whose adorning, let it not be that outward adorning of plaiting the hair and of wearing"
    },
    {
      "id": 112,
      "start": 1134.8200073242188,
      "end": 1139.5800170898438,
      "text": " of gold or of putting on of apparel, but let it be the hidden man of the heart, and that"
    },
    {
      "id": 113,
      "start": 1139.5800170898438,
      "end": 1144.1400146484375,
      "text": " which is not corruptible, even the ornament of a meek and quiet spirit, which is in the"
    },
    {
      "id": 114,
      "start": 1144.1400146484375,
      "end": 1146.1400146484375,
      "text": " sight of God of great price."
    },
    {
      "id": 115,
      "start": 1146.1400146484375,
      "end": 1148.1400146484375,
      "text": " Now why do I come to 1 Peter chapter 3?"
    },
    {
      "id": 116,
      "start": 1148.1400146484375,
      "end": 1152.5,
      "text": " Well the same reason so many people look at 1 Samuel chapter 16, and I'll just reference"
    },
    {
      "id": 117,
      "start": 1152.5,
      "end": 1155.02001953125,
      "text": " that passage of Scripture, we won't turn there."
    },
    {
      "id": 118,
      "start": 1155.02001953125,
      "end": 1160.1400146484375,
      "text": " In 1 Samuel chapter number 16, God gives Samuel the responsibility of anointing the"
    },
    {
      "id": 119,
      "start": 1160.1400146484375,
      "end": 1162.1400146484375,
      "text": " next king of Israel."
    },
    {
      "id": 120,
      "start": 1162.1400146484375,
      "end": 1166.9000244140625,
      "text": " We know, if you know the Bible this morning, that that is David who will be the next king,"
    },
    {
      "id": 121,
      "start": 1166.9000244140625,
      "end": 1171.9000244140625,
      "text": " but David, when all the sons of Jesse are gathered together, he's left out in the field"
    },
    {
      "id": 122,
      "start": 1171.9000244140625,
      "end": 1173.4199829101562,
      "text": " taking care of the sheep."
    },
    {
      "id": 123,
      "start": 1173.4199829101562,
      "end": 1181.6199951171875,
      "text": " And so Eliab stands before Samuel first, and he sees this young man, and he says, surely"
    },
    {
      "id": 124,
      "start": 1181.9000244140625,
      "end": 1184.780029296875,
      "text": " this is the Lord's anointed."
    },
    {
      "id": 125,
      "start": 1184.780029296875,
      "end": 1191.780029296875,
      "text": " And God says, look not at the outward appearance."
    },
    {
      "id": 126,
      "start": 1191.780029296875,
      "end": 1199.7000122070312,
      "text": " Man, all we can see is the outward, but God looks on the heart."
    },
    {
      "id": 0,
      "start": 1199.7000122070312,
      "end": 1205.9400119781494,
      "text": " I reference 1 Samuel 16 and look at 1 Peter chapter 3 because I've heard so many times"
    },
    {
      "id": 1,
      "start": 1205.9400119781494,
      "end": 1211.380012512207,
      "text": " over the years, when you talk about the subject that is before us in 1 Timothy chapter 2,"
    },
    {
      "id": 2,
      "start": 1211.380012512207,
      "end": 1217.2600116729736,
      "text": " verses 9 and 10, as God gives instruction with respect to attire, with regard to that"
    },
    {
      "id": 3,
      "start": 1217.2600116729736,
      "end": 1221.5200119018555,
      "text": " which is modest and that which is appropriate, is it doesn't matter what's on the outside"
    },
    {
      "id": 4,
      "start": 1221.5200119018555,
      "end": 1224.0600128173828,
      "text": " because God looks at the heart."
    },
    {
      "id": 5,
      "start": 1224.0600128173828,
      "end": 1228.9800128936768,
      "text": " Can I tell you this morning that you have misapplied the truth of God's Word?"
    },
    {
      "id": 6,
      "start": 1228.9800128936768,
      "end": 1236.6200103759766,
      "text": " Because when God says that He sees the heart, He also says man can only see the outward."
    },
    {
      "id": 7,
      "start": 1236.6200103759766,
      "end": 1238.7600135803223,
      "text": " Let me say it this way this morning."
    },
    {
      "id": 8,
      "start": 1238.7600135803223,
      "end": 1243.220012664795,
      "text": " If our inward is right, it's shown up on the outward."
    },
    {
      "id": 9,
      "start": 1243.220012664795,
      "end": 1244.220012664795,
      "text": " Amen?"
    },
    {
      "id": 10,
      "start": 1244.220012664795,
      "end": 1249.160011291504,
      "text": " Now, I understand that you can clean something up and it can be corrupt inside."
    },
    {
      "id": 11,
      "start": 1249.160011291504,
      "end": 1250.880012512207,
      "text": " The whited sepulchers, right?"
    },
    {
      "id": 12,
      "start": 1250.880012512207,
      "end": 1251.880012512207,
      "text": " You read that?"
    },
    {
      "id": 13,
      "start": 1251.880012512207,
      "end": 1255.160011291504,
      "text": " They're full of dead man's bones but they look real good on the outside."
    },
    {
      "id": 14,
      "start": 1255.160011291504,
      "end": 1256.4800109863281,
      "text": " So we understand that principle."
    },
    {
      "id": 15,
      "start": 1256.4800109863281,
      "end": 1261.1000137329102,
      "text": " What I'm saying to you this morning is that if our heart is right, if we desire to please"
    },
    {
      "id": 16,
      "start": 1261.1000137329102,
      "end": 1265.9400100708008,
      "text": " God and to walk worthy, then we look at a subject like this and we say, hey listen,"
    },
    {
      "id": 17,
      "start": 1265.9400100708008,
      "end": 1269.8400115966797,
      "text": " I want to be modest and I want to be appropriate."
    },
    {
      "id": 18,
      "start": 1269.8400115966797,
      "end": 1270.8400115966797,
      "text": " Male or female."
    },
    {
      "id": 19,
      "start": 1270.8400115966797,
      "end": 1273.760009765625,
      "text": " We ought to be modest and we ought to be appropriate."
    },
    {
      "id": 20,
      "start": 1273.760009765625,
      "end": 1274.760009765625,
      "text": " Amen?"
    },
    {
      "id": 21,
      "start": 1274.760009765625,
      "end": 1279.0600128173828,
      "text": " I would say this, as we look at this text of scripture, and I say this to myself and"
    },
    {
      "id": 22,
      "start": 1279.0600128173828,
      "end": 1285.160011291504,
      "text": " I say this to others as well, that I believe this morning that it's important, it's imperative"
    },
    {
      "id": 23,
      "start": 1285.160011291504,
      "end": 1293.000015258789,
      "text": " that husbands and fathers take an active role in guiding their wives and their daughters"
    },
    {
      "id": 24,
      "start": 1293.000015258789,
      "end": 1296.380012512207,
      "text": " with respect to what is modest and appropriate."
    },
    {
      "id": 25,
      "start": 1296.380012512207,
      "end": 1297.380012512207,
      "text": " Why do I say that?"
    },
    {
      "id": 26,
      "start": 1297.380012512207,
      "end": 1300.5600128173828,
      "text": " Because you're a man and you know."
    },
    {
      "id": 27,
      "start": 1300.5600128173828,
      "end": 1303.8400115966797,
      "text": " Do I have to go further than that or can we understand this morning?"
    },
    {
      "id": 28,
      "start": 1303.8400115966797,
      "end": 1309.280014038086,
      "text": " You're a man and you know, and so you can know if what your wife or daughter is wearing"
    },
    {
      "id": 29,
      "start": 1309.280014038086,
      "end": 1312.9600143432617,
      "text": " is modest and appropriate."
    },
    {
      "id": 30,
      "start": 1312.9600143432617,
      "end": 1319.280014038086,
      "text": " And you, God has placed in that position to help and what a blessing it is."
    },
    {
      "id": 31,
      "start": 1319.280014038086,
      "end": 1320.760009765625,
      "text": " The church is not a fashion place."
    },
    {
      "id": 32,
      "start": 1320.760009765625,
      "end": 1325.7200088500977,
      "text": " It's not a place to come for a fashion, no, it's good to look nice and put on your best"
    },
    {
      "id": 33,
      "start": 1325.7200088500977,
      "end": 1326.7200088500977,
      "text": " and all those things."
    },
    {
      "id": 34,
      "start": 1326.7200088500977,
      "end": 1331.1200103759766,
      "text": " I'm not suggesting that that's not something that we should do, but the reality is that"
    },
    {
      "id": 35,
      "start": 1331.1200103759766,
      "end": 1336.52001953125,
      "text": " we see that God gives instruction and this instruction is important for us."
    },
    {
      "id": 36,
      "start": 1336.52001953125,
      "end": 1342.5800170898438,
      "text": " If we look at verses 11 through 15, number two this morning, instruction with regard"
    },
    {
      "id": 37,
      "start": 1342.5800170898438,
      "end": 1344.9200134277344,
      "text": " to authority."
    },
    {
      "id": 38,
      "start": 1344.9200134277344,
      "end": 1349.6800079345703,
      "text": " We see in verses 9 and 10 instruction with regard to attire."
    },
    {
      "id": 39,
      "start": 1349.6800079345703,
      "end": 1353.4000091552734,
      "text": " We see in verses 11 through 15 instruction with regard to authority."
    },
    {
      "id": 40,
      "start": 1353.4000091552734,
      "end": 1358.4400177001953,
      "text": " Now remember again that God established the church and He instructs the church."
    },
    {
      "id": 41,
      "start": 1358.4400177001953,
      "end": 1366.6000061035156,
      "text": " So God gives this in 1 Timothy 2 verses 10 through, 11 through 15, He gives us instruction"
    },
    {
      "id": 42,
      "start": 1366.6000061035156,
      "end": 1368.6400146484375,
      "text": " with regard to authority."
    },
    {
      "id": 43,
      "start": 1368.6400146484375,
      "end": 1372.000015258789,
      "text": " This instruction will continue into chapter number three."
    },
    {
      "id": 44,
      "start": 1372.000015258789,
      "end": 1377.4600067138672,
      "text": " Remember the chapter divisions and verse divisions were put into the Bible to help us with ease"
    },
    {
      "id": 45,
      "start": 1377.4600067138672,
      "end": 1382.4000091552734,
      "text": " of finding portions of Scripture, but the thought at the, in chapter two and three is"
    },
    {
      "id": 46,
      "start": 1382.4000091552734,
      "end": 1387.2000122070312,
      "text": " a singular thought with regard to behavior in God's church."
    },
    {
      "id": 47,
      "start": 1387.9600067138672,
      "end": 1391.8400115966797,
      "text": " Sorry, somebody wore a lot of cologne today, Dean, he's not in here right now, and that"
    },
    {
      "id": 48,
      "start": 1391.8400115966797,
      "end": 1394.7200164794922,
      "text": " stuff is killing me with my allergies, amen?"
    },
    {
      "id": 49,
      "start": 1394.7200164794922,
      "end": 1398.1600189208984,
      "text": " I'm going to tell him, listen, you've got to get rid of, get something different, amen?"
    },
    {
      "id": 50,
      "start": 1398.1600189208984,
      "end": 1402.280014038086,
      "text": " And, but my allergies, I don't, I stopped wearing cologne because it messes me all up"
    },
    {
      "id": 51,
      "start": 1402.280014038086,
      "end": 1403.6400146484375,
      "text": " in the springtime."
    },
    {
      "id": 52,
      "start": 1403.6400146484375,
      "end": 1409.4000091552734,
      "text": " But anyhow, we find that it's the book of Ephesians in the fifth chapter specifically,"
    },
    {
      "id": 53,
      "start": 1409.4000091552734,
      "end": 1415.760009765625,
      "text": " the book of Colossians in the third chapter specifically, where God addresses authority"
    },
    {
      "id": 54,
      "start": 1415.760009765625,
      "end": 1417.760009765625,
      "text": " in the home."
    },
    {
      "id": 55,
      "start": 1417.760009765625,
      "end": 1423.8800048828125,
      "text": " Here in 1 Timothy chapter number two and three, God is dealing with authority in His church."
    },
    {
      "id": 56,
      "start": 1423.8800048828125,
      "end": 1431.52001953125,
      "text": " By the way, let me say this, God is the one who established the home, amen?"
    },
    {
      "id": 57,
      "start": 1431.52001953125,
      "end": 1435.760009765625,
      "text": " God is the one who established government."
    },
    {
      "id": 58,
      "start": 1435.760009765625,
      "end": 1438.6000061035156,
      "text": " God is the one that established the church."
    },
    {
      "id": 59,
      "start": 1438.6000061035156,
      "end": 1444.1600189208984,
      "text": " Those are the three entities, if you will, that God established that are still in operation"
    },
    {
      "id": 60,
      "start": 1444.1600189208984,
      "end": 1445.1600189208984,
      "text": " today."
    },
    {
      "id": 61,
      "start": 1445.1600189208984,
      "end": 1454.8000183105469,
      "text": " And in God's word, He's provided instruction with regard to each institute that He started."
    },
    {
      "id": 62,
      "start": 1454.8000183105469,
      "end": 1461.0,
      "text": " So not only did He, did He begin the home, but He instructed, He instituted the home"
    },
    {
      "id": 63,
      "start": 1461.0,
      "end": 1462.8400268554688,
      "text": " and He instructed the home."
    },
    {
      "id": 64,
      "start": 1462.8400268554688,
      "end": 1465.9200134277344,
      "text": " He instituted the church and He instructed the church."
    },
    {
      "id": 65,
      "start": 1465.9200134277344,
      "end": 1468.6800231933594,
      "text": " He instituted government and He gives instruction."
    },
    {
      "id": 66,
      "start": 1468.6800231933594,
      "end": 1470.2000122070312,
      "text": " You say, well, they're not following it."
    },
    {
      "id": 67,
      "start": 1470.2000122070312,
      "end": 1475.7200012207031,
      "text": " Listen, there are churches and there are homes and there are governments that are in"
    },
    {
      "id": 68,
      "start": 1475.7200012207031,
      "end": 1482.6000061035156,
      "text": " direct rebellion to the one who established those entities, amen?"
    },
    {
      "id": 69,
      "start": 1482.6000061035156,
      "end": 1485.8000183105469,
      "text": " There are homes all across our nation."
    },
    {
      "id": 70,
      "start": 1485.8000183105469,
      "end": 1488.5599975585938,
      "text": " This message this morning is not on the home."
    },
    {
      "id": 71,
      "start": 1488.5599975585938,
      "end": 1490.1600036621094,
      "text": " This subject is dealing with the church."
    },
    {
      "id": 72,
      "start": 1490.1600036621094,
      "end": 1497.3600158691406,
      "text": " But there are homes all across this nation that are messed up because they're not following"
    },
    {
      "id": 73,
      "start": 1497.3600158691406,
      "end": 1502.6000061035156,
      "text": " the instruction that God has given in His word."
    },
    {
      "id": 74,
      "start": 1502.6000061035156,
      "end": 1503.8800048828125,
      "text": " Just the way it is."
    },
    {
      "id": 75,
      "start": 1503.8800048828125,
      "end": 1509.8000183105469,
      "text": " There are churches that are messed up because they're not following the instruction that"
    },
    {
      "id": 76,
      "start": 1509.8000183105469,
      "end": 1513.0400085449219,
      "text": " God gives in His word."
    },
    {
      "id": 77,
      "start": 1513.0400085449219,
      "end": 1515.6800231933594,
      "text": " We ought not get mad at the instruction manual."
    },
    {
      "id": 78,
      "start": 1515.6800231933594,
      "end": 1520.4000244140625,
      "text": " We ought to be thankful to the God who gave us the instructions and understanding that"
    },
    {
      "id": 79,
      "start": 1520.4000244140625,
      "end": 1524.2799987792969,
      "text": " He's provided us the path by which we can please Him."
    },
    {
      "id": 80,
      "start": 1524.2799987792969,
      "end": 1527.2000122070312,
      "text": " You ever buy a device?"
    },
    {
      "id": 81,
      "start": 1527.2000122070312,
      "end": 1531.6000061035156,
      "text": " Any of you, you drove here this morning and there are certain things that the manufacturer"
    },
    {
      "id": 82,
      "start": 1531.6000061035156,
      "end": 1536.3200073242188,
      "text": " of the automobile that you drove here in have put in order that you have to do in order"
    },
    {
      "id": 83,
      "start": 1536.3200073242188,
      "end": 1538.3600158691406,
      "text": " to drive that vehicle."
    },
    {
      "id": 84,
      "start": 1538.3600158691406,
      "end": 1541.3200073242188,
      "text": " Now it used to be that you always needed a key to start the vehicle."
    },
    {
      "id": 85,
      "start": 1541.3200073242188,
      "end": 1544.4000244140625,
      "text": " Now they have these push button things and you don't have to put the key in the ignition"
    },
    {
      "id": 86,
      "start": 1544.4000244140625,
      "end": 1548.6000061035156,
      "text": " but you still got to have a key in the vehicle, right?"
    },
    {
      "id": 87,
      "start": 1548.6000061035156,
      "end": 1553.52001953125,
      "text": " And you have to do some things and you have to follow, well, I don't want to put the key"
    },
    {
      "id": 88,
      "start": 1553.52001953125,
      "end": 1554.52001953125,
      "text": " in there."
    },
    {
      "id": 89,
      "start": 1554.52001953125,
      "end": 1558.52001953125,
      "text": " I'm just going to sit there."
    },
    {
      "id": 90,
      "start": 1558.52001953125,
      "end": 1564.0,
      "text": " You can get mad at Ford and whoever else, whatever vehicle you drive, you can get upset"
    },
    {
      "id": 91,
      "start": 1564.0,
      "end": 1565.0,
      "text": " with them."
    },
    {
      "id": 92,
      "start": 1565.0,
      "end": 1567.9200134277344,
      "text": " Why do I have to press the brake to get out of park?"
    },
    {
      "id": 93,
      "start": 1567.9200134277344,
      "end": 1569.2799987792969,
      "text": " I'm not going to do it."
    },
    {
      "id": 94,
      "start": 1569.2799987792969,
      "end": 1571.6000061035156,
      "text": " Well, you ain't going anywhere, right?"
    },
    {
      "id": 95,
      "start": 1571.6000061035156,
      "end": 1573.8800048828125,
      "text": " I mean, is that the case?"
    },
    {
      "id": 96,
      "start": 1573.8800048828125,
      "end": 1579.0,
      "text": " You have different appliances that you have at home and different processes that you need"
    },
    {
      "id": 97,
      "start": 1579.0,
      "end": 1582.6000061035156,
      "text": " to follow in order to make that thing work."
    },
    {
      "id": 98,
      "start": 1582.6800231933594,
      "end": 1586.9200134277344,
      "text": " Typically, people don't get mad and say, I'm not going to do it."
    },
    {
      "id": 99,
      "start": 1586.9200134277344,
      "end": 1588.9200134277344,
      "text": " No, they just follow the instructions."
    },
    {
      "id": 100,
      "start": 1588.9200134277344,
      "end": 1592.7200012207031,
      "text": " Now, some of us men put the instructions to the side and think we can figure it out without"
    },
    {
      "id": 101,
      "start": 1592.7200012207031,
      "end": 1594.8800048828125,
      "text": " the instruction manual."
    },
    {
      "id": 102,
      "start": 1594.8800048828125,
      "end": 1597.9200134277344,
      "text": " And then after we get all kinds of sideways trying to do something, we say, you know,"
    },
    {
      "id": 103,
      "start": 1597.9200134277344,
      "end": 1600.0400085449219,
      "text": " maybe I should look at the instructions."
    },
    {
      "id": 104,
      "start": 1600.0400085449219,
      "end": 1603.4400024414062,
      "text": " We go over and grab them and then we can get the thing working."
    },
    {
      "id": 105,
      "start": 1603.4400024414062,
      "end": 1609.1200256347656,
      "text": " But as we look at the instructions, we understand that God is the eternal, all-wise God and"
    },
    {
      "id": 106,
      "start": 1609.1200256347656,
      "end": 1611.2799987792969,
      "text": " He's provided instruction for His church."
    },
    {
      "id": 107,
      "start": 1611.2799987792969,
      "end": 1616.0400085449219,
      "text": " So look at the authority or the instruction that's given with regard to authority here"
    },
    {
      "id": 108,
      "start": 1616.0400085449219,
      "end": 1617.6600036621094,
      "text": " in this passage of Scripture."
    },
    {
      "id": 109,
      "start": 1617.6600036621094,
      "end": 1622.8200073242188,
      "text": " We find the Bible says in verse number 11 and 12, let the woman learn in silence with"
    },
    {
      "id": 110,
      "start": 1622.8200073242188,
      "end": 1628.2400207519531,
      "text": " all subjection, but I suffer not a woman to teach nor to usurp authority over the man,"
    },
    {
      "id": 111,
      "start": 1628.2400207519531,
      "end": 1629.6800231933594,
      "text": " but to be in silence."
    },
    {
      "id": 112,
      "start": 1629.6800231933594,
      "end": 1637.9200134277344,
      "text": " So we find here in verses 11 and 12 that women are not to teach or have authority over men"
    },
    {
      "id": 113,
      "start": 1637.9200134277344,
      "end": 1639.3200073242188,
      "text": " in God's church."
    },
    {
      "id": 114,
      "start": 1639.8000183105469,
      "end": 1641.6400146484375,
      "text": " Now let me say this this morning."
    },
    {
      "id": 115,
      "start": 1641.6400146484375,
      "end": 1647.0,
      "text": " This is not popular today, but it's biblical."
    },
    {
      "id": 116,
      "start": 1647.0,
      "end": 1649.8800048828125,
      "text": " It's biblical, amen?"
    },
    {
      "id": 117,
      "start": 1649.8800048828125,
      "end": 1655.8400268554688,
      "text": " There are churches all across our land that have women pastors."
    },
    {
      "id": 118,
      "start": 1655.8400268554688,
      "end": 1661.1600036621094,
      "text": " And there are people today that are saying, hey, it's 2024, can't we get with the times?"
    },
    {
      "id": 119,
      "start": 1661.1600036621094,
      "end": 1664.9600219726562,
      "text": " Why can't we have a lady be the pastor?"
    },
    {
      "id": 120,
      "start": 1664.9600219726562,
      "end": 1671.0,
      "text": " Well, because the eternal God, who is the creator of all things, established in His"
    },
    {
      "id": 121,
      "start": 1671.0,
      "end": 1675.1600036621094,
      "text": " word structure and authority."
    },
    {
      "id": 122,
      "start": 1675.1600036621094,
      "end": 1680.52001953125,
      "text": " He did not say that the woman was not of equal value to the man."
    },
    {
      "id": 123,
      "start": 1680.52001953125,
      "end": 1687.0599975585938,
      "text": " He did not say that, no, He just said in the church, the woman is not to have that authority"
    },
    {
      "id": 124,
      "start": 1687.0599975585938,
      "end": 1688.0599975585938,
      "text": " over a man."
    },
    {
      "id": 125,
      "start": 1688.0599975585938,
      "end": 1691.4400024414062,
      "text": " And we're going to look at a couple of verses of Scripture in a little while where what"
    },
    {
      "id": 126,
      "start": 1691.4400024414062,
      "end": 1695.7200012207031,
      "text": " is the role and what is the ministry of women in the church?"
    },
    {
      "id": 127,
      "start": 1695.7200012207031,
      "end": 1700.2400207519531,
      "text": " Because there is a place, there is an opportunity of ministry, and we're thankful for that."
    },
    {
      "id": 128,
      "start": 1700.2400207519531,
      "end": 1705.1600036621094,
      "text": " But the Bible says, then I suffer not a woman to teach nor to usurp authority over the man,"
    },
    {
      "id": 129,
      "start": 1705.1600036621094,
      "end": 1707.2799987792969,
      "text": " but to be in silence."
    },
    {
      "id": 130,
      "start": 1707.2799987792969,
      "end": 1711.6400146484375,
      "text": " Now we understand this morning, I've mentioned already, you no doubt have seen it, we're"
    },
    {
      "id": 131,
      "start": 1711.6400146484375,
      "end": 1717.9400024414062,
      "text": " not a Southern Baptist church, but recently the Southern Baptists have had a real issue"
    },
    {
      "id": 132,
      "start": 1717.9400024414062,
      "end": 1720.0400390625,
      "text": " with this subject matter."
    },
    {
      "id": 133,
      "start": 1720.0400390625,
      "end": 1725.02001953125,
      "text": " There are plenty of other denominations that have been dealing with it for decades, really,"
    },
    {
      "id": 134,
      "start": 1725.02001953125,
      "end": 1729.1400146484375,
      "text": " but we find that most recently with the Southern Baptists, and I have people occasionally,"
    },
    {
      "id": 135,
      "start": 1729.1400146484375,
      "end": 1731.8400268554688,
      "text": " they find out we're a Baptist church, are you part of the Southern Baptist Convention?"
    },
    {
      "id": 136,
      "start": 1731.8400268554688,
      "end": 1734.239990234375,
      "text": " We're not, we're independent Baptists."
    },
    {
      "id": 137,
      "start": 1734.239990234375,
      "end": 1740.760009765625,
      "text": " However, there was a huge issue at this last big conference that they had, why?"
    },
    {
      "id": 138,
      "start": 1740.760009765625,
      "end": 1746.4000244140625,
      "text": " Because there are Southern Baptist churches that want to ordain women to be pastors."
    },
    {
      "id": 139,
      "start": 1746.4000244140625,
      "end": 1751.0400390625,
      "text": " The Southern Baptists took a position on it, but there's this push."
    },
    {
      "id": 140,
      "start": 1751.0400390625,
      "end": 1756.7999877929688,
      "text": " Listen, I said it on Wednesday evening, and I hope that we can understand it this morning,"
    },
    {
      "id": 141,
      "start": 1756.7999877929688,
      "end": 1764.8800048828125,
      "text": " it does not matter how much the culture pushes, we have to be biblical."
    },
    {
      "id": 142,
      "start": 1764.8800048828125,
      "end": 1766.1199951171875,
      "text": " We have to be biblical."
    },
    {
      "id": 143,
      "start": 1766.1199951171875,
      "end": 1770.6000366210938,
      "text": " Listen, this morning as we understand the situation in Ephesus, and we understand what's"
    },
    {
      "id": 144,
      "start": 1770.6000366210938,
      "end": 1777.3599853515625,
      "text": " taking place, and even as we understand today that God has given us His eternal word, and"
    },
    {
      "id": 145,
      "start": 1777.3599853515625,
      "end": 1782.7999877929688,
      "text": " He's outside of time, and His word is relevant to every generation, and His instruction is"
    },
    {
      "id": 146,
      "start": 1782.7999877929688,
      "end": 1789.6400146484375,
      "text": " important for us to follow, that God said that the women are not to have authority over"
    },
    {
      "id": 147,
      "start": 1789.6400146484375,
      "end": 1793.280029296875,
      "text": " the man."
    },
    {
      "id": 148,
      "start": 1793.280029296875,
      "end": 1798.7200317382812,
      "text": " If God wanted in a particular year for that to change, then God, who is eternal, could"
    },
    {
      "id": 149,
      "start": 1798.7200317382812,
      "end": 1799.8400268554688,
      "text": " have told us..."
    },
    {
      "id": 0,
      "start": 1799.8400268554688,
      "end": 1806.2400269508362,
      "text": " us at this time in church history, then these changes are going to be made."
    },
    {
      "id": 1,
      "start": 1806.2400269508362,
      "end": 1808.200026512146,
      "text": " But God didn't say that."
    },
    {
      "id": 2,
      "start": 1808.200026512146,
      "end": 1810.040026664734,
      "text": " So God gave us the instruction."
    },
    {
      "id": 3,
      "start": 1810.040026664734,
      "end": 1814.040026664734,
      "text": " God provided us with this instruction."
    },
    {
      "id": 4,
      "start": 1814.040026664734,
      "end": 1817.5600261688232,
      "text": " It's important that we understand it and that we apply it."
    },
    {
      "id": 5,
      "start": 1817.5600261688232,
      "end": 1825.0000267028809,
      "text": " We find that in Ephesus, just as it's in our day today, the church has always been called"
    },
    {
      "id": 6,
      "start": 1825.0000267028809,
      "end": 1833.9600257873535,
      "text": " to influence the society, not for the society to influence the church."
    },
    {
      "id": 7,
      "start": 1833.9600257873535,
      "end": 1836.8000259399414,
      "text": " You know what one of the big problems was in Corinth?"
    },
    {
      "id": 8,
      "start": 1836.8000259399414,
      "end": 1838.1200256347656,
      "text": " There are lots of them."
    },
    {
      "id": 9,
      "start": 1838.1200256347656,
      "end": 1844.9000282287598,
      "text": " But one of the main problems in Corinth was that the city, the culture, the society was"
    },
    {
      "id": 10,
      "start": 1844.9000282287598,
      "end": 1848.760025024414,
      "text": " impacting and influencing the church."
    },
    {
      "id": 11,
      "start": 1848.760025024414,
      "end": 1855.320026397705,
      "text": " And God said, no, the church is supposed to influence the culture."
    },
    {
      "id": 12,
      "start": 1855.320026397705,
      "end": 1863.4800262451172,
      "text": " But what happens today, because a message like this is not very popular, is that you"
    },
    {
      "id": 13,
      "start": 1863.4800262451172,
      "end": 1872.040023803711,
      "text": " have culture pushing and you have people folding, saying, well, we'll just kind of, you know,"
    },
    {
      "id": 14,
      "start": 1872.040023803711,
      "end": 1878.5600280761719,
      "text": " we just want to be, want to fit in, and we want to be, listen, I want to please God."
    },
    {
      "id": 15,
      "start": 1878.5600280761719,
      "end": 1880.1000289916992,
      "text": " Amen?"
    },
    {
      "id": 16,
      "start": 1880.1000289916992,
      "end": 1883.2000274658203,
      "text": " As an individual, as a church, I want to please God."
    },
    {
      "id": 17,
      "start": 1883.2000274658203,
      "end": 1885.4600296020508,
      "text": " That ought to be your goal as well."
    },
    {
      "id": 18,
      "start": 1885.4600296020508,
      "end": 1891.040023803711,
      "text": " We find that God, here in this passage of Scripture, goes all the way back to creation"
    },
    {
      "id": 19,
      "start": 1891.040023803711,
      "end": 1897.7200241088867,
      "text": " with regard to providing an answer, if you will, or reason behind the instruction that"
    },
    {
      "id": 20,
      "start": 1897.7200241088867,
      "end": 1899.6000289916992,
      "text": " He gives to us in verses 11 and 12."
    },
    {
      "id": 21,
      "start": 1899.6000289916992,
      "end": 1903.4400253295898,
      "text": " By the way, I think that's gracious of God."
    },
    {
      "id": 22,
      "start": 1903.4400253295898,
      "end": 1907.280029296875,
      "text": " God doesn't have to explain to us why He set any rules in place."
    },
    {
      "id": 23,
      "start": 1907.280029296875,
      "end": 1908.4400253295898,
      "text": " Amen?"
    },
    {
      "id": 24,
      "start": 1908.4400253295898,
      "end": 1910.280029296875,
      "text": " He's God."
    },
    {
      "id": 25,
      "start": 1910.280029296875,
      "end": 1911.880027770996,
      "text": " It's His right."
    },
    {
      "id": 26,
      "start": 1911.880027770996,
      "end": 1916.2400283813477,
      "text": " But He goes back to creation, notice in verses 13 and 14, the example that He uses."
    },
    {
      "id": 27,
      "start": 1916.2400283813477,
      "end": 1920.3200302124023,
      "text": " He says this, for Adam was first formed, then Eve."
    },
    {
      "id": 28,
      "start": 1920.3200302124023,
      "end": 1923.4400253295898,
      "text": " So He goes back to the order of creation."
    },
    {
      "id": 29,
      "start": 1923.4400253295898,
      "end": 1926.6800231933594,
      "text": " When God created man initially, He created Adam."
    },
    {
      "id": 30,
      "start": 1926.6800231933594,
      "end": 1928.1600341796875,
      "text": " But then He found there's no help for him."
    },
    {
      "id": 31,
      "start": 1928.1600341796875,
      "end": 1932.0000305175781,
      "text": " Now God knew that, and then He creates Eve, right?"
    },
    {
      "id": 32,
      "start": 1932.0000305175781,
      "end": 1933.52001953125,
      "text": " That's the order of creation."
    },
    {
      "id": 33,
      "start": 1933.52001953125,
      "end": 1936.2400207519531,
      "text": " We can go back and look at that in the book of Genesis."
    },
    {
      "id": 34,
      "start": 1936.2400207519531,
      "end": 1941.2400207519531,
      "text": " We find that in Genesis chapter number 3, now we see in verse number 13, He goes all"
    },
    {
      "id": 35,
      "start": 1941.2400207519531,
      "end": 1944.2000274658203,
      "text": " the way back to the beginning in Genesis 1 with creation."
    },
    {
      "id": 36,
      "start": 1944.2000274658203,
      "end": 1950.02001953125,
      "text": " We come to verse 14, and He goes to Genesis chapter number 3 with the fall of man."
    },
    {
      "id": 37,
      "start": 1950.260025024414,
      "end": 1962.780029296875,
      "text": " Notice what He says, and Adam was not deceived, but the woman being deceived was in the transgression."
    },
    {
      "id": 38,
      "start": 1962.780029296875,
      "end": 1966.5800323486328,
      "text": " It's very interesting as you look at verse number 14 in 1 Timothy chapter number 2, because"
    },
    {
      "id": 39,
      "start": 1966.5800323486328,
      "end": 1970.8600311279297,
      "text": " as you look at the whole of Scripture, you look at various aspects of the New Testament"
    },
    {
      "id": 40,
      "start": 1970.8600311279297,
      "end": 1975.9200286865234,
      "text": " referring back to the fall of man in the garden in Genesis chapter number 3, Adam is always"
    },
    {
      "id": 41,
      "start": 1975.9200286865234,
      "end": 1978.7400207519531,
      "text": " the responsible party."
    },
    {
      "id": 42,
      "start": 1978.7400207519531,
      "end": 1982.02001953125,
      "text": " Never is Eve the responsible party."
    },
    {
      "id": 43,
      "start": 1982.02001953125,
      "end": 1984.260025024414,
      "text": " Always Adam."
    },
    {
      "id": 44,
      "start": 1984.260025024414,
      "end": 1986.3600311279297,
      "text": " As in Adam, all die."
    },
    {
      "id": 45,
      "start": 1986.3600311279297,
      "end": 1991.780029296875,
      "text": " As for by one man, sin entered into the world, Romans chapter 5 and verse number 12."
    },
    {
      "id": 46,
      "start": 1991.780029296875,
      "end": 1992.780029296875,
      "text": " Adam's always responsible."
    },
    {
      "id": 47,
      "start": 1992.780029296875,
      "end": 1999.8600311279297,
      "text": " Let me say this, before God created Eve, God gave Adam the instruction with regard to what"
    },
    {
      "id": 48,
      "start": 1999.8600311279297,
      "end": 2003.0600280761719,
      "text": " could be eaten and what could not be eaten."
    },
    {
      "id": 49,
      "start": 2003.0600280761719,
      "end": 2006.1000213623047,
      "text": " God didn't deliver that to Eve, He delivered it to Adam."
    },
    {
      "id": 50,
      "start": 2006.1000213623047,
      "end": 2009.8800201416016,
      "text": " Adam, however, had a responsibility to communicate that to Eve."
    },
    {
      "id": 51,
      "start": 2009.8800201416016,
      "end": 2013.1400299072266,
      "text": " Why is it that the serpent, the most subtle beast of the field, why is it that he comes"
    },
    {
      "id": 52,
      "start": 2013.1400299072266,
      "end": 2016.4200286865234,
      "text": " to Eve in Genesis chapter number 3?"
    },
    {
      "id": 53,
      "start": 2016.4200286865234,
      "end": 2021.6200256347656,
      "text": " Well, we understand as we look at Genesis chapter number 3 that he comes to Eve and"
    },
    {
      "id": 54,
      "start": 2021.6200256347656,
      "end": 2024.2200317382812,
      "text": " he begins to deceive her."
    },
    {
      "id": 55,
      "start": 2024.2200317382812,
      "end": 2029.300033569336,
      "text": " Yea, hath God said, no, it's not going to be that way."
    },
    {
      "id": 56,
      "start": 2029.300033569336,
      "end": 2032.5000305175781,
      "text": " God knows that in the day that you eat thereof, your eyes are going to be open, you're going"
    },
    {
      "id": 57,
      "start": 2032.5000305175781,
      "end": 2039.3800201416016,
      "text": " to be like God's and He deals with an emotional approach and He deals with, look, it's good"
    },
    {
      "id": 58,
      "start": 2039.3800201416016,
      "end": 2046.0600280761719,
      "text": " for you and He shows that fruit and she is deceived and she eats of that fruit."
    },
    {
      "id": 59,
      "start": 2046.0600280761719,
      "end": 2048.8600311279297,
      "text": " Adam, no deception whatsoever."
    },
    {
      "id": 60,
      "start": 2048.8600311279297,
      "end": 2055.02001953125,
      "text": " He knew, but he did."
    },
    {
      "id": 61,
      "start": 2055.02001953125,
      "end": 2061.6600341796875,
      "text": " We find that as man is held accountable, we find that to be the case with Adam and God"
    },
    {
      "id": 62,
      "start": 2061.820037841797,
      "end": 2068.4200134277344,
      "text": " references back to Genesis 1 and Genesis 3 with regard to providing us with some really"
    },
    {
      "id": 63,
      "start": 2068.4200134277344,
      "end": 2075.7000122070312,
      "text": " background reason, if you will, for why He's providing this instruction for His church"
    },
    {
      "id": 64,
      "start": 2075.7000122070312,
      "end": 2082.7000122070312,
      "text": " with regard to structure and authority and we find that He says, Adam was formed first,"
    },
    {
      "id": 65,
      "start": 2082.7000122070312,
      "end": 2084.9400329589844,
      "text": " then Eve."
    },
    {
      "id": 66,
      "start": 2084.9400329589844,
      "end": 2088.740020751953,
      "text": " Eve was deceived, Adam was not."
    },
    {
      "id": 67,
      "start": 2088.740020751953,
      "end": 2095.02001953125,
      "text": " Adam knew right well what he was doing and he took of the fruit and sin entered in the"
    },
    {
      "id": 68,
      "start": 2095.02001953125,
      "end": 2096.02001953125,
      "text": " world."
    },
    {
      "id": 69,
      "start": 2096.02001953125,
      "end": 2100.7000122070312,
      "text": " You know, it's very interesting, God, again, this passage of Scripture is dealing with"
    },
    {
      "id": 70,
      "start": 2100.7000122070312,
      "end": 2106.500030517578,
      "text": " instruction, behavior in His church and specifically this section is dealing with authority in"
    },
    {
      "id": 71,
      "start": 2106.500030517578,
      "end": 2111.8600158691406,
      "text": " the church, not in the home, but we find that God, as you look at the Scriptures, the New"
    },
    {
      "id": 72,
      "start": 2111.8600158691406,
      "end": 2115.02001953125,
      "text": " Testament as we're dealing with the church, there's no church in the Old Testament."
    },
    {
      "id": 73,
      "start": 2115.02001953125,
      "end": 2119.1800231933594,
      "text": " You find the nation of Israel, you can find there are several ladies, women that God used"
    },
    {
      "id": 74,
      "start": 2119.1800231933594,
      "end": 2120.740020751953,
      "text": " in a great way."
    },
    {
      "id": 75,
      "start": 2120.740020751953,
      "end": 2125.5400390625,
      "text": " In the church, you find there are many ladies and women that God used in a great way, but"
    },
    {
      "id": 76,
      "start": 2125.5400390625,
      "end": 2131.5800170898438,
      "text": " when it comes to a matter of authority, God says that the man, notice in chapter 3, this"
    },
    {
      "id": 77,
      "start": 2131.5800170898438,
      "end": 2137.300018310547,
      "text": " is a true saying, if a man desire the office of a bishop, and so we're going to find in"
    },
    {
      "id": 78,
      "start": 2137.300018310547,
      "end": 2142.1000366210938,
      "text": " chapter 3, He continues with this idea of behavior in the church, in His church, and"
    },
    {
      "id": 79,
      "start": 2142.1000366210938,
      "end": 2148.9800415039062,
      "text": " He deals with the pastor and the deacon, the two offices, to be a man, because it's"
    },
    {
      "id": 80,
      "start": 2148.9800415039062,
      "end": 2153.2200317382812,
      "text": " a matter of instruction with regard to authority."
    },
    {
      "id": 81,
      "start": 2153.2200317382812,
      "end": 2160.7000122070312,
      "text": " God has given to us that responsibility and God has provided for us the examples in His"
    },
    {
      "id": 82,
      "start": 2160.7000122070312,
      "end": 2161.7000122070312,
      "text": " Word."
    },
    {
      "id": 83,
      "start": 2161.7000122070312,
      "end": 2164.3800354003906,
      "text": " We find this morning that Adam is the one that's held accountable."
    },
    {
      "id": 84,
      "start": 2164.3800354003906,
      "end": 2167.3800354003906,
      "text": " It's very interesting also, if you were to go to Genesis 18, we're not going to go there"
    },
    {
      "id": 85,
      "start": 2167.3800354003906,
      "end": 2173.6200256347656,
      "text": " this morning, but in Genesis 18, dealing with Sarah and Abraham, you'll find that"
    },
    {
      "id": 86,
      "start": 2173.6200256347656,
      "end": 2174.6200256347656,
      "text": " Sarah laughed."
    },
    {
      "id": 87,
      "start": 2174.6200256347656,
      "end": 2175.6200256347656,
      "text": " Do you remember this?"
    },
    {
      "id": 88,
      "start": 2175.6200256347656,
      "end": 2176.9400329589844,
      "text": " When God says she's going to have a baby, right?"
    },
    {
      "id": 89,
      "start": 2176.9400329589844,
      "end": 2178.3400268554688,
      "text": " And she laughed."
    },
    {
      "id": 90,
      "start": 2178.3400268554688,
      "end": 2179.5400390625,
      "text": " You know what's very interesting?"
    },
    {
      "id": 91,
      "start": 2179.5400390625,
      "end": 2181.9800415039062,
      "text": " God never asked Sarah why she laughed."
    },
    {
      "id": 92,
      "start": 2181.9800415039062,
      "end": 2184.9800415039062,
      "text": " You know who He asked?"
    },
    {
      "id": 93,
      "start": 2184.9800415039062,
      "end": 2186.740020751953,
      "text": " Abraham."
    },
    {
      "id": 94,
      "start": 2186.740020751953,
      "end": 2189.02001953125,
      "text": " You know why He asked Abraham?"
    },
    {
      "id": 95,
      "start": 2189.02001953125,
      "end": 2192.300018310547,
      "text": " Because God told Abraham, you're going to have a son."
    },
    {
      "id": 96,
      "start": 2192.300018310547,
      "end": 2199.1800231933594,
      "text": " And Abraham had the responsibility to communicate God's truth to his wife, Sarah."
    },
    {
      "id": 97,
      "start": 2199.1800231933594,
      "end": 2200.1800231933594,
      "text": " Amen?"
    },
    {
      "id": 98,
      "start": 2200.1800231933594,
      "end": 2204.5800170898438,
      "text": " And when she laughed, God didn't ask her why she laughed."
    },
    {
      "id": 99,
      "start": 2204.5800170898438,
      "end": 2205.5800170898438,
      "text": " He asked."
    },
    {
      "id": 100,
      "start": 2205.5800170898438,
      "end": 2211.9000244140625,
      "text": " So, you know, authority is one of those things that so many people want it, but they don't"
    },
    {
      "id": 101,
      "start": 2211.9000244140625,
      "end": 2216.7000122070312,
      "text": " understand the responsibility that comes with authority."
    },
    {
      "id": 102,
      "start": 2216.7000122070312,
      "end": 2218.9800415039062,
      "text": " The responsibility comes with authority."
    },
    {
      "id": 103,
      "start": 2218.9800415039062,
      "end": 2225.820037841797,
      "text": " During the COVID years, I had several people that attacked my leadership through COVID."
    },
    {
      "id": 104,
      "start": 2225.820037841797,
      "end": 2227.02001953125,
      "text": " They thought they knew better."
    },
    {
      "id": 105,
      "start": 2227.02001953125,
      "end": 2228.8400268554688,
      "text": " They thought we should this, we should that."
    },
    {
      "id": 106,
      "start": 2228.8400268554688,
      "end": 2231.3400268554688,
      "text": " And on more than one occasion, I said, hey, if you want to be the pastor, you can."
    },
    {
      "id": 107,
      "start": 2231.3400268554688,
      "end": 2233.2200317382812,
      "text": " I'll resign right now."
    },
    {
      "id": 108,
      "start": 2233.2200317382812,
      "end": 2234.2200317382812,
      "text": " You know why?"
    },
    {
      "id": 109,
      "start": 2234.2200317382812,
      "end": 2236.4200134277344,
      "text": " It wasn't easy."
    },
    {
      "id": 110,
      "start": 2236.4200134277344,
      "end": 2241.300018310547,
      "text": " Every decision I made, half of the people liked it and half of the people didn't."
    },
    {
      "id": 111,
      "start": 2241.300018310547,
      "end": 2242.740020751953,
      "text": " Just the way it is."
    },
    {
      "id": 112,
      "start": 2242.740020751953,
      "end": 2243.740020751953,
      "text": " With authority comes responsibility."
    },
    {
      "id": 113,
      "start": 2243.740020751953,
      "end": 2245.5800170898438,
      "text": " You know what I told people time after time, Bart?"
    },
    {
      "id": 114,
      "start": 2245.5800170898438,
      "end": 2246.5800170898438,
      "text": " I said, you know what?"
    },
    {
      "id": 115,
      "start": 2246.5800170898438,
      "end": 2247.5800170898438,
      "text": " I'm not trying to please you."
    },
    {
      "id": 116,
      "start": 2247.5800170898438,
      "end": 2248.5800170898438,
      "text": " I'm trying to please God."
    },
    {
      "id": 117,
      "start": 2249.1800231933594,
      "end": 2251.740020751953,
      "text": " You know the greatest thing you could do for you, or do for me, is pray for me that God"
    },
    {
      "id": 118,
      "start": 2251.740020751953,
      "end": 2253.740020751953,
      "text": " will give me wisdom."
    },
    {
      "id": 119,
      "start": 2253.740020751953,
      "end": 2255.5400390625,
      "text": " It was a difficult time."
    },
    {
      "id": 120,
      "start": 2255.5400390625,
      "end": 2261.1000366210938,
      "text": " See, people want authority, but you understand there's responsibility with authority."
    },
    {
      "id": 121,
      "start": 2261.1000366210938,
      "end": 2263.1000366210938,
      "text": " And God holds Adam responsible."
    },
    {
      "id": 122,
      "start": 2263.1000366210938,
      "end": 2265.02001953125,
      "text": " God holds Abraham responsible."
    },
    {
      "id": 123,
      "start": 2265.02001953125,
      "end": 2270.4400329589844,
      "text": " He's given to His church this instruction with regard to authority."
    },
    {
      "id": 124,
      "start": 2270.4400329589844,
      "end": 2274.000030517578,
      "text": " And it's vital that we don't worry about what the culture is doing."
    },
    {
      "id": 125,
      "start": 2274.000030517578,
      "end": 2276.6600341796875,
      "text": " We don't worry about what other denomination is doing."
    },
    {
      "id": 126,
      "start": 2276.6600341796875,
      "end": 2283.5800170898438,
      "text": " We say, no, God gave us an instruction manual, and we're going to follow what God gave us."
    },
    {
      "id": 127,
      "start": 2283.5800170898438,
      "end": 2288.780029296875,
      "text": " Notice in verse 15, notwithstanding, she shall be saved and childbearing if they continue"
    },
    {
      "id": 128,
      "start": 2288.780029296875,
      "end": 2291.02001953125,
      "text": " in faith and charity and holiness with sobriety."
    },
    {
      "id": 129,
      "start": 2291.02001953125,
      "end": 2294.740020751953,
      "text": " Now, many people say verse 15 is one of the hardest verses in all the New Testament to"
    },
    {
      "id": 130,
      "start": 2294.740020751953,
      "end": 2296.4200134277344,
      "text": " be able to interpret and explain."
    },
    {
      "id": 131,
      "start": 2296.4200134277344,
      "end": 2297.4200134277344,
      "text": " It is greatly challenging."
    },
    {
      "id": 132,
      "start": 2297.4200134277344,
      "end": 2300.6800231933594,
      "text": " And I'm going to give you my understanding of the verse."
    },
    {
      "id": 133,
      "start": 2300.6800231933594,
      "end": 2302.820037841797,
      "text": " If you think something different, man, I'll talk to you about it."
    },
    {
      "id": 134,
      "start": 2302.820037841797,
      "end": 2304.1200256347656,
      "text": " I'm going to give you my understanding."
    },
    {
      "id": 135,
      "start": 2304.1200256347656,
      "end": 2308.52001953125,
      "text": " It's not talking about being saved and childbearing, that you won't die when you give birth."
    },
    {
      "id": 136,
      "start": 2308.52001953125,
      "end": 2309.6400146484375,
      "text": " Why do we know that?"
    },
    {
      "id": 137,
      "start": 2309.6400146484375,
      "end": 2314.2000122070312,
      "text": " Because many of godly women have died giving birth."
    },
    {
      "id": 138,
      "start": 2314.2000122070312,
      "end": 2319.4800415039062,
      "text": " So it can't mean that a woman would be saved, they would be able to give birth and not die,"
    },
    {
      "id": 139,
      "start": 2319.4800415039062,
      "end": 2323.300048828125,
      "text": " because many have, okay?"
    },
    {
      "id": 140,
      "start": 2323.300048828125,
      "end": 2328.4400024414062,
      "text": " Some have the idea that maybe it's dealing with that the Savior would come through a"
    },
    {
      "id": 141,
      "start": 2328.4400024414062,
      "end": 2330.3600463867188,
      "text": " woman, the virgin birth."
    },
    {
      "id": 142,
      "start": 2330.3600463867188,
      "end": 2332.9600219726562,
      "text": " Certainly that could be part of the situation."
    },
    {
      "id": 143,
      "start": 2332.9600219726562,
      "end": 2339.2000122070312,
      "text": " But I think really what Paul is dealing with here is understanding what the role of the"
    },
    {
      "id": 144,
      "start": 2339.2000122070312,
      "end": 2346.7200317382812,
      "text": " women would be in training their children, in bringing up their children."
    },
    {
      "id": 145,
      "start": 2346.7200317382812,
      "end": 2351.7200317382812,
      "text": " Now we find that God gives the responsibility to the husbands that we find as you look in"
    },
    {
      "id": 146,
      "start": 2351.7200317382812,
      "end": 2356.2400512695312,
      "text": " Ephesians 5 and 6, Colossians chapter number 3, that were to bring them up in the nurture"
    },
    {
      "id": 147,
      "start": 2356.2400512695312,
      "end": 2357.7400512695312,
      "text": " and admonition of the Lord."
    },
    {
      "id": 148,
      "start": 2357.7400512695312,
      "end": 2363.3800048828125,
      "text": " But God gives, listen, there's something different in the ability of training children between"
    },
    {
      "id": 149,
      "start": 2363.3800048828125,
      "end": 2365.5,
      "text": " a male and a female."
    },
    {
      "id": 150,
      "start": 2365.5,
      "end": 2369.4600219726562,
      "text": " I often look at Holly and say, I cannot do what you do."
    },
    {
      "id": 151,
      "start": 2369.4600219726562,
      "end": 2370.7400512695312,
      "text": " I can't."
    },
    {
      "id": 152,
      "start": 2370.7400512695312,
      "end": 2374.3800048828125,
      "text": " She teaches them little kids, works in a nursery, man, I'd be outside of my mind."
    },
    {
      "id": 153,
      "start": 2374.3800048828125,
      "end": 2376.4200439453125,
      "text": " I'm just telling you the truth."
    },
    {
      "id": 154,
      "start": 2376.4200439453125,
      "end": 2380.5800170898438,
      "text": " When our kids were little, she'd go to a ladies meeting and man, I'd be setting my watch for"
    },
    {
      "id": 155,
      "start": 2380.5800170898438,
      "end": 2385.0400390625,
      "text": " when she's getting home, because there's only so many things I can handle, amen?"
    },
    {
      "id": 156,
      "start": 2385.0400390625,
      "end": 2387.02001953125,
      "text": " I'm not equipped for it."
    },
    {
      "id": 157,
      "start": 2387.02001953125,
      "end": 2391.1000366210938,
      "text": " And I have no problem acknowledging that."
    },
    {
      "id": 158,
      "start": 2391.1000366210938,
      "end": 2397.4200439453125,
      "text": " So we find that the woman, the wife, the mother has this opportunity."
    },
    {
      "id": 159,
      "start": 2397.4200439453125,
      "end": 2399.7400512695312,
      "text": " We also understand that it cannot mean that…"
    },
    {
      "id": 0,
      "start": 2399.7400512695312,
      "end": 2401.5000512599945,
      "text": " that all godly women would have children,"
    },
    {
      "id": 1,
      "start": 2401.5000512599945,
      "end": 2403.2200512886047,
      "text": " because we know that there are some that are barren."
    },
    {
      "id": 2,
      "start": 2403.2200512886047,
      "end": 2406.4000511169434,
      "text": " We can read of that even in the Scriptures."
    },
    {
      "id": 3,
      "start": 2407.460051059723,
      "end": 2408.340051651001,
      "text": " Amen?"
    },
    {
      "id": 4,
      "start": 2408.340051651001,
      "end": 2410.1000509262085,
      "text": " So we find that the role,"
    },
    {
      "id": 5,
      "start": 2410.1000509262085,
      "end": 2411.96005153656,
      "text": " and here's what I believe this morning,"
    },
    {
      "id": 6,
      "start": 2411.96005153656,
      "end": 2413.5200510025024,
      "text": " that when we understand the instruction"
    },
    {
      "id": 7,
      "start": 2413.5200510025024,
      "end": 2414.8600511550903,
      "text": " that God has given us,"
    },
    {
      "id": 8,
      "start": 2414.8600511550903,
      "end": 2417.4600505828857,
      "text": " and we embrace what He's given us,"
    },
    {
      "id": 9,
      "start": 2417.4600505828857,
      "end": 2418.840051651001,
      "text": " we can thrive."
    },
    {
      "id": 10,
      "start": 2420.1400508880615,
      "end": 2422.8600521087646,
      "text": " But so long as we want to resist,"
    },
    {
      "id": 11,
      "start": 2422.8600521087646,
      "end": 2425.0200519561768,
      "text": " because we've been influenced by our culture"
    },
    {
      "id": 12,
      "start": 2425.0200519561768,
      "end": 2425.9800510406494,
      "text": " and our society,"
    },
    {
      "id": 13,
      "start": 2425.9800510406494,
      "end": 2428.0600509643555,
      "text": " and we want to hold our hands against it,"
    },
    {
      "id": 14,
      "start": 2428.0600509643555,
      "end": 2429.9400520324707,
      "text": " and we say, don't you know"
    },
    {
      "id": 15,
      "start": 2429.9400520324707,
      "end": 2431.660051345825,
      "text": " that we're living in the 21st century,"
    },
    {
      "id": 16,
      "start": 2431.660051345825,
      "end": 2432.700050354004,
      "text": " and don't you know,"
    },
    {
      "id": 17,
      "start": 2432.700050354004,
      "end": 2434.020050048828,
      "text": " listen, you're gonna just,"
    },
    {
      "id": 18,
      "start": 2434.020050048828,
      "end": 2436.7800521850586,
      "text": " you're beating your head against a wall."
    },
    {
      "id": 19,
      "start": 2438.4600524902344,
      "end": 2442.3000526428223,
      "text": " If you just say, this is what God's role is for me,"
    },
    {
      "id": 20,
      "start": 2442.3000526428223,
      "end": 2444.3800506591797,
      "text": " and I find what my role is,"
    },
    {
      "id": 21,
      "start": 2444.3800506591797,
      "end": 2446.860050201416,
      "text": " and I do what God's called me to do,"
    },
    {
      "id": 22,
      "start": 2446.860050201416,
      "end": 2448.5000495910645,
      "text": " I can thrive,"
    },
    {
      "id": 23,
      "start": 2448.5000495910645,
      "end": 2450.6600494384766,
      "text": " and collectively we can please God,"
    },
    {
      "id": 24,
      "start": 2450.6600494384766,
      "end": 2455.14005279541,
      "text": " because we're doing what God has called us to do."
    },
    {
      "id": 25,
      "start": 2455.14005279541,
      "end": 2458.3000526428223,
      "text": " I've used this terminology recently."
    },
    {
      "id": 26,
      "start": 2458.3000526428223,
      "end": 2460.700050354004,
      "text": " Some of you may have heard me say it to you,"
    },
    {
      "id": 27,
      "start": 2460.700050354004,
      "end": 2461.980052947998,
      "text": " but I've used this terminology"
    },
    {
      "id": 28,
      "start": 2461.980052947998,
      "end": 2464.700050354004,
      "text": " in a number of different contexts,"
    },
    {
      "id": 29,
      "start": 2464.700050354004,
      "end": 2466.2600479125977,
      "text": " and I'll use it here this morning"
    },
    {
      "id": 30,
      "start": 2466.2600479125977,
      "end": 2469.100051879883,
      "text": " when we think about these roles and responsibilities"
    },
    {
      "id": 31,
      "start": 2469.100051879883,
      "end": 2471.300048828125,
      "text": " and authority that God gives in His church,"
    },
    {
      "id": 32,
      "start": 2471.300048828125,
      "end": 2473.220054626465,
      "text": " and what I would say is this phrase,"
    },
    {
      "id": 33,
      "start": 2473.220054626465,
      "end": 2474.420051574707,
      "text": " stay in your lane."
    },
    {
      "id": 34,
      "start": 2475.3400497436523,
      "end": 2476.540054321289,
      "text": " Stay in your lane."
    },
    {
      "id": 35,
      "start": 2476.540054321289,
      "end": 2477.4600524902344,
      "text": " What do I mean by that?"
    },
    {
      "id": 36,
      "start": 2477.4600524902344,
      "end": 2479.64005279541,
      "text": " Well, when you drive your car,"
    },
    {
      "id": 37,
      "start": 2479.64005279541,
      "end": 2482.540054321289,
      "text": " it's important that you stay in your lane, right?"
    },
    {
      "id": 38,
      "start": 2482.540054321289,
      "end": 2483.580047607422,
      "text": " How many of you have been driving"
    },
    {
      "id": 39,
      "start": 2483.580047607422,
      "end": 2485.520050048828,
      "text": " and somebody tried to get in your lane?"
    },
    {
      "id": 40,
      "start": 2486.4600524902344,
      "end": 2487.620048522949,
      "text": " I say something like this."
    },
    {
      "id": 41,
      "start": 2487.620048522949,
      "end": 2488.980049133301,
      "text": " Pick one, buddy."
    },
    {
      "id": 42,
      "start": 2488.980049133301,
      "end": 2490.7400512695312,
      "text": " I mean, you gotta pick one or the other."
    },
    {
      "id": 43,
      "start": 2490.7400512695312,
      "end": 2492.540054321289,
      "text": " You can't drive in both."
    },
    {
      "id": 44,
      "start": 2492.540054321289,
      "end": 2494.0000534057617,
      "text": " Is that right?"
    },
    {
      "id": 45,
      "start": 2494.0000534057617,
      "end": 2495.540054321289,
      "text": " What happens if they drive in both?"
    },
    {
      "id": 46,
      "start": 2495.540054321289,
      "end": 2496.8600540161133,
      "text": " Well, there's a problem."
    },
    {
      "id": 47,
      "start": 2497.9000549316406,
      "end": 2501.220054626465,
      "text": " Those lines on the roads are important."
    },
    {
      "id": 48,
      "start": 2501.220054626465,
      "end": 2505.1800537109375,
      "text": " They give us what our boundaries are, right?"
    },
    {
      "id": 49,
      "start": 2505.1800537109375,
      "end": 2506.700050354004,
      "text": " There's a lot of model of vehicles"
    },
    {
      "id": 50,
      "start": 2506.700050354004,
      "end": 2507.8600540161133,
      "text": " here in Northern Virginia that don't,"
    },
    {
      "id": 51,
      "start": 2507.8600540161133,
      "end": 2511.0600509643555,
      "text": " that did not come equipped with blinkers, right?"
    },
    {
      "id": 52,
      "start": 2511.0600509643555,
      "end": 2511.980049133301,
      "text": " Amen?"
    },
    {
      "id": 53,
      "start": 2511.980049133301,
      "end": 2514.4600524902344,
      "text": " They just move and shift and do whatever they wanna do,"
    },
    {
      "id": 54,
      "start": 2514.4600524902344,
      "end": 2517.9000549316406,
      "text": " but my model came with a blinker,"
    },
    {
      "id": 55,
      "start": 2517.9000549316406,
      "end": 2519.980049133301,
      "text": " and when I wanna shift lanes,"
    },
    {
      "id": 56,
      "start": 2519.980049133301,
      "end": 2521.2600479125977,
      "text": " I gotta turn on my blinker, right?"
    },
    {
      "id": 57,
      "start": 2521.2600479125977,
      "end": 2523.020050048828,
      "text": " And I'm giving indication, right?"
    },
    {
      "id": 58,
      "start": 2523.020050048828,
      "end": 2526.980049133301,
      "text": " Well, listen, God's given us roles and responsibilities,"
    },
    {
      "id": 59,
      "start": 2526.980049133301,
      "end": 2530.4200439453125,
      "text": " and when we understand what the God of the universe,"
    },
    {
      "id": 60,
      "start": 2530.4200439453125,
      "end": 2532.2200469970703,
      "text": " the one who instituted the church,"
    },
    {
      "id": 61,
      "start": 2532.2200469970703,
      "end": 2534.780044555664,
      "text": " when He gives us what our roles are,"
    },
    {
      "id": 62,
      "start": 2534.780044555664,
      "end": 2538.1400451660156,
      "text": " we don't have to stand in rebellion towards God."
    },
    {
      "id": 63,
      "start": 2538.1400451660156,
      "end": 2540.340057373047,
      "text": " We accept what our role is."
    },
    {
      "id": 64,
      "start": 2540.340057373047,
      "end": 2543.780044555664,
      "text": " We stay in our lane, and we please God."
    },
    {
      "id": 65,
      "start": 2543.780044555664,
      "end": 2545.780044555664,
      "text": " It's an amazing concept,"
    },
    {
      "id": 66,
      "start": 2545.780044555664,
      "end": 2549.4200439453125,
      "text": " but so often, man wants to stand in rebellion to God."
    },
    {
      "id": 67,
      "start": 2549.4200439453125,
      "end": 2551.9800567626953,
      "text": " Listen, even saved people rebel against God."
    },
    {
      "id": 68,
      "start": 2553.340057373047,
      "end": 2555.540054321289,
      "text": " It happens all the time."
    },
    {
      "id": 69,
      "start": 2555.540054321289,
      "end": 2557.1400451660156,
      "text": " In Titus, turn over there, and we'll be done."
    },
    {
      "id": 70,
      "start": 2557.1400451660156,
      "end": 2559.1400451660156,
      "text": " Titus chapter number two,"
    },
    {
      "id": 71,
      "start": 2559.1400451660156,
      "end": 2563.4600524902344,
      "text": " I want you to see a great responsibility"
    },
    {
      "id": 72,
      "start": 2563.4600524902344,
      "end": 2565.6200561523438,
      "text": " that God has given to women in the church."
    },
    {
      "id": 73,
      "start": 2565.6200561523438,
      "end": 2567.8600463867188,
      "text": " We know in verse number 15,"
    },
    {
      "id": 74,
      "start": 2567.8600463867188,
      "end": 2570.4200439453125,
      "text": " with regard to child rearing and what have you,"
    },
    {
      "id": 75,
      "start": 2570.4200439453125,
      "end": 2572.300048828125,
      "text": " but I want you to see in Titus chapter two,"
    },
    {
      "id": 76,
      "start": 2572.300048828125,
      "end": 2575.2200469970703,
      "text": " again, Titus and Timothy are really similar"
    },
    {
      "id": 77,
      "start": 2575.2200469970703,
      "end": 2577.1400451660156,
      "text": " with regard to the instruction that's given."
    },
    {
      "id": 78,
      "start": 2577.1400451660156,
      "end": 2578.9400482177734,
      "text": " Titus is in Crete."
    },
    {
      "id": 79,
      "start": 2578.9400482177734,
      "end": 2580.1800537109375,
      "text": " Timothy's in Ephesus,"
    },
    {
      "id": 80,
      "start": 2580.1800537109375,
      "end": 2583.4600524902344,
      "text": " but God is giving them great responsibility,"
    },
    {
      "id": 81,
      "start": 2583.4600524902344,
      "end": 2586.1400451660156,
      "text": " very similar in these letters,"
    },
    {
      "id": 82,
      "start": 2586.1400451660156,
      "end": 2588.4200439453125,
      "text": " but notice in chapter two, in verse number one,"
    },
    {
      "id": 83,
      "start": 2588.4200439453125,
      "end": 2589.7400512695312,
      "text": " it says, but speak thou the things"
    },
    {
      "id": 84,
      "start": 2589.7400512695312,
      "end": 2592.020050048828,
      "text": " which become sound doctrine,"
    },
    {
      "id": 85,
      "start": 2592.020050048828,
      "end": 2594.2200469970703,
      "text": " and then notice where he says in verse number two"
    },
    {
      "id": 86,
      "start": 2594.2200469970703,
      "end": 2597.300048828125,
      "text": " that the aged men be sober, grave, temperate,"
    },
    {
      "id": 87,
      "start": 2597.7000579833984,
      "end": 2599.7000579833984,
      "text": " and sound in faith and charity and patience,"
    },
    {
      "id": 88,
      "start": 2599.7000579833984,
      "end": 2601.7400512695312,
      "text": " and then notice in verse number three,"
    },
    {
      "id": 89,
      "start": 2601.7400512695312,
      "end": 2605.6200561523438,
      "text": " the aged women likewise that they be in behavior"
    },
    {
      "id": 90,
      "start": 2605.6200561523438,
      "end": 2609.340057373047,
      "text": " as becometh holiness, not false accusers,"
    },
    {
      "id": 91,
      "start": 2609.340057373047,
      "end": 2611.540054321289,
      "text": " not given to much wine, teachers of good things,"
    },
    {
      "id": 92,
      "start": 2611.540054321289,
      "end": 2615.300048828125,
      "text": " and then notice this, that they may teach the young women"
    },
    {
      "id": 93,
      "start": 2615.300048828125,
      "end": 2618.540054321289,
      "text": " to be sober, to love their husbands, to love their children,"
    },
    {
      "id": 94,
      "start": 2618.540054321289,
      "end": 2621.340057373047,
      "text": " to be discreet, chaste, keepers at home,"
    },
    {
      "id": 95,
      "start": 2621.340057373047,
      "end": 2623.3800506591797,
      "text": " good, obedient to their own husbands,"
    },
    {
      "id": 96,
      "start": 2623.3800506591797,
      "end": 2626.7000579833984,
      "text": " that the word of God be not blasphemed,"
    },
    {
      "id": 97,
      "start": 2626.7000579833984,
      "end": 2628.6600494384766,
      "text": " and then verse six goes to young men,"
    },
    {
      "id": 98,
      "start": 2628.6600494384766,
      "end": 2630.9000549316406,
      "text": " and so we see in verses three through five,"
    },
    {
      "id": 99,
      "start": 2630.9000549316406,
      "end": 2633.9800567626953,
      "text": " God gives instruction with regard to the aged women."
    },
    {
      "id": 100,
      "start": 2633.9800567626953,
      "end": 2635.9800567626953,
      "text": " Listen, I'm not gonna put a category"
    },
    {
      "id": 101,
      "start": 2635.9800567626953,
      "end": 2637.820053100586,
      "text": " on who's an aged women and who's not."
    },
    {
      "id": 102,
      "start": 2637.820053100586,
      "end": 2639.4200439453125,
      "text": " You figure that out, amen?"
    },
    {
      "id": 103,
      "start": 2639.4200439453125,
      "end": 2644.020050048828,
      "text": " But the reality is God has given a great opportunity"
    },
    {
      "id": 104,
      "start": 2644.020050048828,
      "end": 2647.1800537109375,
      "text": " to the ladies that are mature,"
    },
    {
      "id": 105,
      "start": 2647.1800537109375,
      "end": 2649.1400451660156,
      "text": " aged is the word that is used,"
    },
    {
      "id": 106,
      "start": 2649.1400451660156,
      "end": 2653.080047607422,
      "text": " to have a godly influence on a next generation."
    },
    {
      "id": 107,
      "start": 2653.080047607422,
      "end": 2655.9000549316406,
      "text": " You know what I believe's happened in our churches?"
    },
    {
      "id": 108,
      "start": 2655.9000549316406,
      "end": 2656.820037841797,
      "text": " We've failed."
    },
    {
      "id": 109,
      "start": 2658.1800537109375,
      "end": 2659.9400634765625,
      "text": " We have failed."
    },
    {
      "id": 110,
      "start": 2659.9400634765625,
      "end": 2663.820037841797,
      "text": " We have failed in discipleship, we have failed,"
    },
    {
      "id": 111,
      "start": 2663.820037841797,
      "end": 2665.6600646972656,
      "text": " listen, why are more people leaving the church"
    },
    {
      "id": 112,
      "start": 2665.6600646972656,
      "end": 2666.9800415039062,
      "text": " than are coming to the church?"
    },
    {
      "id": 113,
      "start": 2666.9800415039062,
      "end": 2668.1000366210938,
      "text": " Because we failed."
    },
    {
      "id": 114,
      "start": 2668.1000366210938,
      "end": 2671.1800537109375,
      "text": " They get to a certain age, I'm like, I'm out, I'm done."
    },
    {
      "id": 115,
      "start": 2671.1800537109375,
      "end": 2672.820037841797,
      "text": " You can't make me come anymore."
    },
    {
      "id": 116,
      "start": 2674.280059814453,
      "end": 2678.020050048828,
      "text": " But the aged women have a huge opportunity"
    },
    {
      "id": 117,
      "start": 2678.020050048828,
      "end": 2680.2200622558594,
      "text": " to influence the younger women."
    },
    {
      "id": 118,
      "start": 2680.2200622558594,
      "end": 2682.5000610351562,
      "text": " You know how much more effective it is"
    },
    {
      "id": 119,
      "start": 2683.340057373047,
      "end": 2687.6200561523438,
      "text": " for you aged women to talk to these younger girls"
    },
    {
      "id": 120,
      "start": 2687.6200561523438,
      "end": 2691.280059814453,
      "text": " about modesty and appropriateness than it is for me?"
    },
    {
      "id": 121,
      "start": 2693.6000366210938,
      "end": 2697.780059814453,
      "text": " I'm begging you this morning, it's your responsibility."
    },
    {
      "id": 122,
      "start": 2698.8800659179688,
      "end": 2703.340057373047,
      "text": " It's a hard thing for a pastor to have to deal with that."
    },
    {
      "id": 123,
      "start": 2703.340057373047,
      "end": 2706.9000549316406,
      "text": " Now I do, I have to, I preach the whole counsel of God,"
    },
    {
      "id": 124,
      "start": 2706.9000549316406,
      "end": 2710.06005859375,
      "text": " but the aged women, there's a great opportunity."
    },
    {
      "id": 125,
      "start": 2710.9800415039062,
      "end": 2713.6600646972656,
      "text": " But you know what so often happens?"
    },
    {
      "id": 126,
      "start": 2713.6600646972656,
      "end": 2716.4800415039062,
      "text": " Is I have people that come to me and complain"
    },
    {
      "id": 127,
      "start": 2716.4800415039062,
      "end": 2717.8800659179688,
      "text": " about things that are taking place,"
    },
    {
      "id": 128,
      "start": 2717.8800659179688,
      "end": 2722.5400390625,
      "text": " but they're not doing what God instructed them to do."
    },
    {
      "id": 129,
      "start": 2724.260040283203,
      "end": 2726.020050048828,
      "text": " I'm not mad about any of it this morning,"
    },
    {
      "id": 130,
      "start": 2726.020050048828,
      "end": 2728.300048828125,
      "text": " but I'm simply saying God's given us"
    },
    {
      "id": 131,
      "start": 2728.300048828125,
      "end": 2730.300048828125,
      "text": " roles and responsibilities."
    },
    {
      "id": 132,
      "start": 2730.300048828125,
      "end": 2733.3800659179688,
      "text": " And instead of desiring to have somebody else's role"
    },
    {
      "id": 133,
      "start": 2733.3800659179688,
      "end": 2736.2200622558594,
      "text": " and responsibility, why don't we embrace the role"
    },
    {
      "id": 134,
      "start": 2736.2200622558594,
      "end": 2738.9800415039062,
      "text": " and responsibility that God has given to us"
    },
    {
      "id": 135,
      "start": 2738.9800415039062,
      "end": 2741.6600646972656,
      "text": " and do what God has given us to do"
    },
    {
      "id": 136,
      "start": 2741.6600646972656,
      "end": 2743.9200439453125,
      "text": " so that he would be glorified."
    },
    {
      "id": 137,
      "start": 2743.9200439453125,
      "end": 2746.1000366210938,
      "text": " Behavior in God's church."
    },
    {
      "id": 138,
      "start": 2746.1000366210938,
      "end": 2746.9400634765625,
      "text": " Let's pray."
    },
    {
      "id": 139,
      "start": 2746.9400634765625,
      "end": 2747.760040283203,
      "text": " Father, we love you."
    },
    {
      "id": 140,
      "start": 2747.760040283203,
      "end": 2748.7400512695312,
      "text": " We thank you for loving us."
    },
    {
      "id": 141,
      "start": 2748.7400512695312,
      "end": 2750.580047607422,
      "text": " Thank you for the word of God."
    },
    {
      "id": 142,
      "start": 2750.580047607422,
      "end": 2753.1400451660156,
      "text": " God, I know this morning this isn't super popular,"
    },
    {
      "id": 143,
      "start": 2753.1400451660156,
      "end": 2754.260040283203,
      "text": " but it's biblical."
    },
    {
      "id": 144,
      "start": 2755.340057373047,
      "end": 2758.5400390625,
      "text": " God, I pray that you deal with each of us as only you can."
    },
    {
      "id": 145,
      "start": 2759.6600646972656,
      "end": 2764.6600646972656,
      "text": " God, help us to follow your word, to obey your word."
    },
    {
      "id": 146,
      "start": 2765.5400390625,
      "end": 2770.5400390625,
      "text": " Lord, help us to be doers of the word."
    },
    {
      "id": 147,
      "start": 2772.7400512695312,
      "end": 2776.1800537109375,
      "text": " I pray that you'd move and work in this moment of invitation."
    },
    {
      "id": 148,
      "start": 2776.1800537109375,
      "end": 2777.4600524902344,
      "text": " If there's one not sure of heaven,"
    },
    {
      "id": 149,
      "start": 2777.4600524902344,
      "end": 2778.9400634765625,
      "text": " God, I pray they'd be saved today."
    },
    {
      "id": 150,
      "start": 2778.9400634765625,
      "end": 2780.9400634765625,
      "text": " We didn't preach on the gospel or salvation."
    },
    {
      "id": 151,
      "start": 2780.9400634765625,
      "end": 2782.780059814453,
      "text": " We sang about it."
    },
    {
      "id": 152,
      "start": 2782.780059814453,
      "end": 2785.1800537109375,
      "text": " God, if there's someone not sure of heaven,"
    },
    {
      "id": 153,
      "start": 2785.1800537109375,
      "end": 2786.1800537109375,
      "text": " I pray they'd come this morning."
    },
    {
      "id": 154,
      "start": 2786.1800537109375,
      "end": 2787.9800415039062,
      "text": " We take a Bible and show them how they can know for sure"
    },
    {
      "id": 155,
      "start": 2787.9800415039062,
      "end": 2789.2200622558594,
      "text": " that heaven's their home."
    },
    {
      "id": 156,
      "start": 2790.3800659179688,
      "end": 2792.4200439453125,
      "text": " God, I pray that you'd move and work,"
    },
    {
      "id": 157,
      "start": 2792.4200439453125,
      "end": 2793.9000549316406,
      "text": " that you'd be glorified through every decision"
    },
    {
      "id": 158,
      "start": 2794.7400512695312,
      "end": 2796.300048828125,
      "text": " that's made, for it's in Christ's name we pray."
    },
    {
      "id": 159,
      "start": 2796.300048828125,
      "end": 2797.1400451660156,
      "text": " We just."
    }
  ],
  "processed_at": "2025-04-15T07:55:31.160192"
}