{
  "video_id": "Y7Ff430VPN0",
  "text": "this evening, turn to the book of Acts, if you will, Acts chapter number 13. When you find your spot there in Acts chapter number 13, I want you to stick a bookmark or something in there, your prayer bulletin, because I really wanna begin this evening with a passage that's familiar to us in Matthew chapter number nine. And so we'll be focusing in Acts 13, but I wanna, by way of introduction, look here at Matthew chapter number nine. So once you've found your place in Acts 13, turn back to Matthew nine, if you will. I mentioned during the announcements that our missions conference begins in just 10 days. I believe that it's a unique privilege that we have to be involved in world missions, to be involved in what God is doing globally. I know that we often share with you updates from our missionaries, and on Wednesday evenings, on the back of our prayer bulletin, we every week have three updates, and it's a joy to be able to hear what God is doing. I had the privilege yesterday of being at a pastor's meeting, and while I was at that pastor's meeting, we got to hear from three church planters, and then from a fourth man who's just started a church as well, and he's just moving forward. We really didn't know him, just being introduced to him, and it's exciting to see some young guys that are going to some new locations and planning churches, and you think about missions, not only foreign, but even domestic, and thinking about the privilege of being involved in what God is doing, and that is that we're reaching the world with the gospel. In Matthew chapter number nine, the passage is familiar to us. It's the latter part of this passage of Scripture, and I want you to notice in verse number 35 that the Bible says this, that Jesus went about all the cities and villages, teaching in their synagogues, and preaching the gospel of the kingdom, and healing every sickness and every disease among the people. And then I want you to notice in verse 36, the Bible says, but when he saw the multitudes, he was moved with compassion on them. Why was it? We see that he's moved with compassion because of what he saw, and you notice the Scriptures tell us at the end of verse number 36 what it was. He saw this multitude of people, the multitudes as it says, and it says because they fainted and were scattered abroad as sheep having no shepherd. So the Lord Jesus Christ, as he's going, it says that he went in all the cities and villages, as he's going, teaching and preaching and healing, he sees the multitudes and he's moved with compassion on them. And then he turns to his disciples. In verse 37 and verse 38, we see that he turns to his disciples and he says something to the disciples that is very familiar to us. And first in verse number 37, he informs his disciples of the condition. Notice the Bible says that then saith he, the Lord Jesus Christ, God in flesh, unto his disciples, notice what he informed them of, the harvest truly is plenteous, but the laborers are few. This is the condition. And Jesus is informing his disciples of this condition. And he says that the harvest truly is plenteous, but the laborers are few. This was true at this moment because we know that our Lord is truthful and it was absolutely accurate as he made this declaration and informing the disciples as to the condition of the people. We find that I believe this evening that we could still, as we look at the condition that was presented to these disciples, that we still today could say that the harvest truly is plenteous, but the laborers are few. After Jesus informed, we find that he then commands them. Notice what it is in verse 38. He says, pray ye therefore, the Lord of the harvest, that he will send forth laborers into his harvest. And I find the instruction that is given, the information in verse 37, followed by the instruction and the direction, the command to pray in verse number 38. And I wonder this evening how often, if we were to evaluate our prayer lives and our prayer time, I wonder how often we are praying that the Lord of the harvest would send forth laborers into his harvest. I believe that's a unique privilege of ours as the people of God to serve God. And it's extremely rewarding when you see God call people to the ministry. And we find that God is still calling people to the ministry. The harvest is plenteous, but the laborers are few, but yet we find that he's calling and he's sending forth laborers into his harvest. As in our minds and in my mind over the next couple of weeks, 10 days as we prepare for our missions conference. And I think it's always important as we have special events on our calendar for us to be prepared, not only mentally and physically, but spiritually prepared for that which we're embarking upon. We're gonna have a missions conference. I wanna preach some messages on missions and Lord willing, try to get our heart prepared and ready for that which we will receive during that particular conference. We have revival meeting in the fall. I seek the face of the Lord with regard to messages in advance of those special meetings that I could preach so that we could be prepared for the meeting that is at hand. And this evening, we see this instruction in Matthew chapter number nine. And now I want you to turn to the Acts chapter 13 and really the text for our message this evening. And if you're taking notes, I've simply entitled the message this evening, sent forth, sent forth. We're looking at Acts 13 verses one through 12. Lord willing, unless he gives different direction, I will preach the latter part of Acts chapter number 13 next Wednesday evening, excuse me, of Acts chapter 14, the latter part of Acts chapter number 14 next Wednesday evening. But as we look at the beginning part of Acts chapter number 13, we know that there's a division in the book of Acts and all that's taking place. But really I find that as we look at that passage of scripture in Matthew chapter nine, when the Lord sees the multitudes and he's moved with compassion, he informs his servants, the disciples, that the harvest truly is plenteous, the laborers are few. And then he commands them, he instructs them to pray. And he instructs them to pray that he would send forth laborers. And we find here in Acts chapter number 13 that they were sent forth. And what a blessing to see how God is working in and through his church. As we begin Acts 13, we find that we're dealing with the church in Antioch. And you notice that the Bible says this in verse number one of Acts 13. Now, there were in the church that was at Antioch certain prophets and teachers, as Barnabas and Simeon, that was called Niger, and Lucius of Cyrene and Manaan, which had been brought up with Herod the Tetrarch and Saul. Notice verse two, the Bible says as they ministered to the Lord and fasted. Often we find that throughout the scriptures that in fact, in verse number three, it will mention that they fasted and prayed, but often we find the connection with fasting and prayer. Some have said of yesteryear that fasting makes no sense without prayer. And I think that's a very valid point. And so we find that this church, the church in Antioch is a church in which they've grown in their ministering. And you think about the servants of the Lord that God has placed in that particular assembly. When you look at verse number one and you find that God is working. And as we look at this passage of scripture, I find that right away in verses really one through three, then into verse number four, the specifics are given, but God gives His plan. If you're taking notes, I would say this, the mission was embraced. We see a church that receives the plan of God. And as the plan of God is given to this local assembly, we find that they embrace the mission that is entrusted to them. The Bible says in verse number two, as they ministered to the Lord and fasted, the Holy Ghost said, notice what is said in verse number two, separate me Barnabas and Saul for the work whereunto I have called them. We begin to see in Acts chapter 13 is often referenced and referred to as being the first missionary journey and appropriately coined as such. And we find that as this first missionary journey would begin that this church, they're assembled there in Antioch, they're ministering, they're serving, they're fasting. No doubt they were praying and they were preaching and the ministry was just thriving. God was blessing, God was working. And the Holy Spirit, the Holy Ghost comes and He says, separate me Barnabas and Saul for the work whereunto I have called them. And so we find here right away that God's plan is being revealed. And we find that God's plan is being revealed. And I said that the mission was embraced because we see the response in verse number three when the Bible says that when they had fasted and prayed and laid their hands on them, they sent them away. There's no discussion with regard to the place of ministry or leadership that these individuals had within the church of Antioch and the way in which they needed it. to stay? No, they obeyed the Lord. They obeyed the direction that God is giving. The plan of God is revealed and we find that it's embraced. We find this evening as we would understand what's happening here in this first missionary journey and you look at the next few verses and see the places in which they went, you will find that as God's plan is revealed, you will find that God's plan always fulfills God's purpose. Back in Acts 1, in verse 8, you find that the record, if you will, of the Great Commission is listed for us here in the book of Acts. We find it in all of the Gospels and then here in the book of Acts as well. And you find that Jesus, before he ascended to heaven, said this, but you shall receive power after the Holy Ghost has come upon you and you shall be witnesses unto me both in Jerusalem and in all Judea and in Samaria and under the uttermost part of the earth. In Acts 13, when we find that the Holy Spirit of God comes to this body of believers and says, separate me Barnabas and Saul for the work wherein to have called them, we see God's plan being revealed but it's fulfilling his purpose. We find that God had allowed for the Gospel to, of course, be there in Jerusalem. And as you think about Acts 1-8, as we just read it, and you think about the divisions that are given, and you think about Acts 2-7 dealing with the Gospel being there in Jerusalem. And then as you go and you move forward and you look at chapters 8-12, I mentioned, I referenced Acts 8-4 on Sunday evening, that then they that were scattered abroad went everywhere preaching the Word. And as we look at Acts 8-12, you begin to see how that they were scattered abroad and the Gospel goes into Judea and into Samaria. And as you enter into Acts 13, and I believe from Acts 13 all the way to the present day, we find that God is fulfilling his plan to get the Gospel to the uttermost. It begins, though, really in Acts 13. As they had been in Jerusalem, they'd been in Judea and Samaria, and now we find that Paul and Barnabas are going to be separated, they're going to be sent out, and the Gospel is going to now be preached to the world. We find that it would begin and it would spread. We understand that as we read through the missionary journeys that are recorded in the book of Acts, that there would be churches that would be established in this particular missionary journey. They go to the region of Galatia, and we find that the particular cities, and we'll look at it in just a few moments, that they go to, and the churches that are established, you read the book of Galatians, and you find that that book is written to the churches that are in Galatia. How did they get there? It's a result of this first missionary journey. It's a result of God sending forth laborers. Somebody, as we look at the pattern and the blueprint that is given, if you will, in Matthew 9, he said that they were to pray to the Lord of the harvest that he would send forth laborers, and we find that here in Acts 13, they're sent forth. The Holy Spirit of God comes, and he says, separate me, Barnabas, and Saul for the work wherein to have called them, and you notice at the end of verse number three, it says, and then they sent them away. Verse four, so they, being sent forth by the Holy Ghost, departed unto Seleucia, and from thence they sailed to Cyprus, and when they were at Salamis, notice, they preached the word of God in the synagogues of the Jews, and they had also John to their minister, and so we find that they go forth, and the purpose of this mission was no doubt embraced, and it was to carry forth the gospel, the word of God, and as we would understand God's plan being revealed to the church here in Antioch, and we'd understand the way in which his plan fulfills his purpose, we would easily conclude this evening that it's always best for the people of God to embrace the plan of God. God's plan is perfect. Amen? I've been asked many times over the years about the individual in some remote part of the world that's never heard the gospel, and what happens to that individual when they die. I'm not sure if you've ever received that question, but on a number of occasions, I have received that question. It is very interesting if you were to study church history or to study missiology, and you'd understand how that there were many, many references throughout history of missionaries showing up to particular fields and finding of the people there, how that they were praying that if there's a God, would you send somebody so that we'd understand the truth, and you can read wonderful accounts and testimonies of how God has worked and moved. But the reality is that the problem that many people seek to point out in asking that question is they seek to put some sort of blame upon God for somebody spending eternity in the lake of fire that's in a remote location that never heard the gospel. But really, the responsibility falls squarely on the shoulders of the church, because God's plan has been clearly given. It's that God's plan must be embraced by God's people, and when God's plan is embraced by the people of God, we find that God will work as he promises to do so. And as we look at this passage of Scripture and we begin to think about the progression through the next several chapters of the book of Acts, and then really looking through all of the history up until even present day, you begin to see how God works and what God does and how God's plan, when it's embraced, is fulfilled in bringing forth his purpose, and churches being established all over the world, and people being saved. And it's a wonderful thing. There's so often that individuals and perhaps groups of individuals would like to sit around and have discussions, roundtable discussions, on what are we going to do to reach the world, and what are we going to do to, you know, reach seven and a half billion people, and so on and so forth. And the reality is that we really don't need to have any roundtable discussions. We really just need to do what God told us to do. Amen? Because when we actively, each and every one of us, fulfill the purpose and the plan that God has for us, and we're all in it together. Listen, the church in Antioch had a vital part in this. And then there were individuals, Paul and Barnabas, and then John has mentioned that was going as their minister. They had a vital part, but each person doing their part, bringing to pass the plan of God, and bringing honor and glory to God. And we find here that it is absolutely imperative that we understand that it is God's plan that must be embraced. I'm not suggesting that we don't share some ideas and deal with some maybe approach and methodology, if you will, but the unfortunate thing is there are times in which we can spend so much time talking about doing something that we never actually do it. And that's not just the fault of a church. That really can be found in any arena of life. People just stand around and talk about doing something, and it's like, you just need to get busy doing it, you know? And this thing isn't going to, it's not going to happen on its own. It's not going to just, you know, be fixed. You got to do it. And so we know that God has given a plan, and so we see the mission is embraced. Number two, if you will, the mission field was evangelized. You find that in verse number five, and then we'll look at a verse in chapter number 14, but in verse number five, right in the middle of the verse there, it says they preached the Word of God. They preached the Word of God. They understood what they were being sent forth to do. They understood that they had a purpose, a very specific purpose, and they were being sent forth to preach the Word of God. We find that in Acts chapter number 14, and we'll come back and finish up through verse number 12 of Acts 13, but I want you to just for a moment look at Acts 14 and verse number 7, and here the Bible is telling us about when they were, they fled unto Lystra and Derbe, cities of Lyconia, that it says in verse number seven, and there they preached the gospel. If I could quickly go through here this 13th chapter and really understand what's taking place, and we find that in verse number five, the Bible tells us specifically the region at the end of verse number four, and from thence they sailed to Cyprus, and when they were at Salamis, they preached the Word of God in the synagogues of the Jews, and they had also John to their minister, and so the Bible begins to tell us here in verses five through twelve about the ministry there on the island of Cyprus, and they preached the Word. It says, when they had gone through the isle unto Paphos, they found a certain sorcerer, a false prophet, a Jew, whose name was Bargesas, which was with the deputy of the country, Sergius Paulus, a prudent man. Notice when it says, who called for Barnabas and Saul and desired to hear the Word of God. You wonder why God sent them to where He sent them? The Bible tells us here that there's a man there that desired to hear the Word of God. What a blessing. The Bible says that there's always going to be opposition. The Bible records the opposition, but here the Bible says in verse 8, But Elamist, the sorcerer, for so is his name by interpretation, withstood them, seeking to turn away the deputy from the faith. There's always opposition. There is a spiritual battle that is raging. And as the people of God seek to embrace the plan of God and fulfill the mission that has been assigned to us, we find that it will be met with opposition. Does it mean that we just give up? Say, well, I guess, you know, we tried. We did the best we could, didn't we? Here the Bible says that they were met with opposition, and then in verse 9, Then Saul, who also is called Paul, filled with the Holy Ghost, set his eyes on him, and said, O fool of all subtlety and all mischief, thou child of the devil, thou enemy of all righteousness, hope thou not cease to pervert the right ways of the Lord. And now, behold, the hand of the Lord is upon thee, and thou shalt be blind, not seeing the sun for a season. And immediately there fell on him a mist and a darkness, and he went about seeking some to lead him by the hand. That's an amazing sight, is it not? The Bible says, Then the deputy, verse number 12, When he saw what was done, believed, being astonished at the doctrine of the Lord. As we begin to look at Acts 13 and kind of break it up very quickly this evening and just briefly examine this passage of Scripture, we find that as the mission that was assigned to the church here in Antioch, as that plan was embraced, that really we find the evangelization of this region of the world in which they are sent to, and it begins with the island of Cyprus. But as we go further into the chapter, beginning in verse number 13 and really going through Acts 14 and verse number 20, you find that it then goes to the region of Galatia. And I mentioned that a few moments ago when you read the book of Galatians, you find that it says in the beginning, opening verses unto the churches of Galatia. It's not written to the church of Galatia because there were multiple churches there. And we find that here in Acts 13 and 14, as you study this first missionary journey, that you see how the gospel arrived into those particular regions. You find that it's there in Acts 13 and verse number 14. It says, But when they departed from Perga, they came to Antioch in Pisidia, and went into the synagogue on the Sabbath day, and sat down. And as they went in, the Bible says that they were reading the law, following the normal process of what would happen. And then there were some that said, Ye men and brethren, if ye have any word of exhortation for the people, say on. Then Paul stood up, and beckoning with his hands, said, Men of Israel, and ye that fear God, give audience. And Paul begins to preach, and what does he preach? He preaches the gospel of Jesus Christ. You can read through, and you can find that in verse number 28, he deals with the death of Christ. In verse number 29, he deals with the burial of Christ. In verse 30, he deals with the resurrection of Christ. What is the gospel? It is the death, burial, and resurrection of Jesus Christ. It is the good news. Amen? We find that's exactly what Paul preaches. They come to this first city, Antioch and Pisidia, and we find that he preaches the word of God. From there, they go to Iconium, according to what we see in Acts 14. In verse number 1, it says, And it came to pass in Iconium. Why did they leave? Why was it that they moved on? Well, in verse number 50 of Acts 13, it says, But the Jews stirred up the devout and honorable women and the chief men of the city, and raised persecution against Paul and Barnabas, and expelled them out of their coast. But here's the amazing thing. There were some people that got saved in Antioch and Pisidia. And as those people got saved, there was a church that was established there. We find that Paul and those that were traveling with him, Paul and Barnabas, we find that they depart, and they now come to Iconium. And now, as they would be there in Iconium, they would have the opportunity, as God tells us in verse 7, that there they preached the gospel. And the Bible tells us in verse number 3, that they were, look at what it says, Long time therefore abode they, speaking boldly in the Lord. And so they're there preaching the gospel, and now there's another city, another group of people, that are being confronted with the gospel where a church is going to be established. We find that the people of Iconium, before long, they wanted to get rid of these guys as well. We find that the Bible tells us in verse number 17, Nevertheless, he left not himself without witness, and that he did good, and gave us rain from heaven, and fruitful seasons, filling all our hearts with food and gladness. And with these sayings, scarce restrained they the people, that they had not done sacrifice unto them. But notice in verse number 19, And there came thither certain Jews from where? From Antioch and Iconium. And it says that they came, and they persuaded the people, and having stoned Paul, drew him out of the city, supposing he had been dead. Howbeit, as the disciples stood round about him, he rose up and came into the city, and the next day he departed with Barnabas to Derbe. And I want you to just think about this for just a moment. We understand the mission, we understand the focus, and we understand what's taking place, and here as we see the progression and what's taking place, and you understand the persecution and that which they're dealing with, and you find that the Bible tells us in verse number 20 that the next day they departed with Barnabas to Derbe, and it says in verse 21, And when they had preached the gospel to that city, and had taught many, they returned again to Lystra, and to Iconium, and Antioch. I just want you to think here this evening about this first missionary journey, and as we consider the truth of what Jesus said to the disciples in Matthew 9, and couple it with this passage in Acts 13, When Jesus said to the disciples, he was moved with compassion, why? Because he saw the multitudes, that they were as sheep scattered without a shepherd. And he says to them, Truly the harvest is plenteous, but the laborers are few. Pray ye therefore that the Lord of the harvest would send forth laborers into his harvest. And here, they were sent forth. I believe that beginning here, all the way to present day, God is sending forth his laborers. And we as the people of God need to be praying. It needs to be part of our daily prayer list, if you will, that we're praying that God would send forth laborers. And then, as God calls, just as he called here in this passage of scripture, Paul and Barnabas, the church then has a role in helping that ministry be fulfilled. And what a joy. I understand that God's not going to call all of us. It would be wonderful if God would call one of us, some of us, but then those of us that are still part of this fellowship, we then can come alongside and assist. These individuals that will be with us, that have been with us in the past, that are missionaries, we find that they are sent out. They were sitting in a pew, like you are, at some point in their lives, and God said, God called them to the ministry, and they prepared, and now they give us an opportunity to partner with them as they go to the place that they've been assigned to to carry forth the gospel. Lord willing, we'll have the opportunity to look next week at the end of Acts 14. It's an exciting passage of scripture because what you find at the end of Acts 14 is the return from this first missionary journey. And you see as they return, and just the connection that they have and all that they discuss, and what a wonderful blessing it is. And we find that here, as we would consider this first missionary journey, very briefly overviewing chapter 13 and getting into chapter number 14, that really this work was the result of them embracing the mission that was given to them. The assignment, the task that was assigned there at the beginning of Acts 13. Because they embraced it, because they said we're going to fulfill, we're going to be obedient to the plan that's been revealed to us, we then have the privilege of seeing how the gospel goes forth and how churches are established. And it's an absolute blessing to study the word of God and to see how God's plan works. It shouldn't surprise us, by the way, that God's plan works, amen? He's God, of course his plan is going to work. So we have the privilege of getting in line and in step with what God has given us to do and then seeing what only God can do. Sent forth, he said, pray, the Lord of the harvest that he would send forth laborers. I hope that we're praying to that end. And I hope this evening that as we see those that would be sent forth, even as Paul and Barnabas were sent forth, that we would continue to pray for them and then be engaged and involved on how we could support them in fulfilling the ministry that God has given them specifically. Let's pray together. Father, we love you. We thank you for loving us. We thank you for the word of God. What a blessing and privilege it is to read about the instruction that you gave there to your disciples in Matthew 9. We are grateful for the record. We're moved even as our Savior was moved with compassion. passion and we are understanding that we're living in a time in which the world is confused and the church has the answers. God I pray that you would help us even as the church at Antioch there in Acts 13 embraced the plan that you revealed to them. I pray God that you would help us. I pray that over the next 10 days as we not only physically and mentally but most importantly spiritually prepare for our missions conference that it would work in each of our lives. I pray that we would be ready for the meeting that we'll have and that we'll be prepared to receive the challenges that will be delivered. God we pray that you'd work in our midst and that you alone would be glorified. We thank you for the privilege of prayer. We pray that as we now have our time of prayer this evening I pray that you'd bless each aspect of it. We do thank you for the unique privilege that we have to come boldly before your throne knowing that you hear and answer. We pray God that you alone would be glorified for it's in Christ's name we pray, amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.119999885559082,
      "text": " this evening, turn to the book of Acts, if you will,"
    },
    {
      "id": 1,
      "start": 2.119999885559082,
      "end": 4.0,
      "text": " Acts chapter number 13."
    },
    {
      "id": 2,
      "start": 4.0,
      "end": 6.519999980926514,
      "text": " When you find your spot there in Acts chapter number 13,"
    },
    {
      "id": 3,
      "start": 6.519999980926514,
      "end": 9.979999542236328,
      "text": " I want you to stick a bookmark or something in there,"
    },
    {
      "id": 4,
      "start": 9.979999542236328,
      "end": 11.359999656677246,
      "text": " your prayer bulletin,"
    },
    {
      "id": 5,
      "start": 11.359999656677246,
      "end": 13.600000381469727,
      "text": " because I really wanna begin this evening"
    },
    {
      "id": 6,
      "start": 13.600000381469727,
      "end": 15.720000267028809,
      "text": " with a passage that's familiar to us"
    },
    {
      "id": 7,
      "start": 15.720000267028809,
      "end": 17.68000030517578,
      "text": " in Matthew chapter number nine."
    },
    {
      "id": 8,
      "start": 17.68000030517578,
      "end": 20.440000534057617,
      "text": " And so we'll be focusing in Acts 13,"
    },
    {
      "id": 9,
      "start": 20.440000534057617,
      "end": 22.139999389648438,
      "text": " but I wanna, by way of introduction,"
    },
    {
      "id": 10,
      "start": 22.139999389648438,
      "end": 24.440000534057617,
      "text": " look here at Matthew chapter number nine."
    },
    {
      "id": 11,
      "start": 24.440000534057617,
      "end": 26.920000076293945,
      "text": " So once you've found your place in Acts 13,"
    },
    {
      "id": 12,
      "start": 26.920000076293945,
      "end": 29.559999465942383,
      "text": " turn back to Matthew nine, if you will."
    },
    {
      "id": 13,
      "start": 29.600000381469727,
      "end": 31.479999542236328,
      "text": " I mentioned during the announcements"
    },
    {
      "id": 14,
      "start": 31.479999542236328,
      "end": 34.2400016784668,
      "text": " that our missions conference begins in just 10 days."
    },
    {
      "id": 15,
      "start": 34.2400016784668,
      "end": 36.119998931884766,
      "text": " I believe that it's a unique privilege"
    },
    {
      "id": 16,
      "start": 36.119998931884766,
      "end": 39.47999954223633,
      "text": " that we have to be involved in world missions,"
    },
    {
      "id": 17,
      "start": 39.47999954223633,
      "end": 43.279998779296875,
      "text": " to be involved in what God is doing globally."
    },
    {
      "id": 18,
      "start": 43.279998779296875,
      "end": 45.599998474121094,
      "text": " I know that we often share with you updates"
    },
    {
      "id": 19,
      "start": 45.599998474121094,
      "end": 46.63999938964844,
      "text": " from our missionaries,"
    },
    {
      "id": 20,
      "start": 46.63999938964844,
      "end": 48.560001373291016,
      "text": " and on Wednesday evenings,"
    },
    {
      "id": 21,
      "start": 48.560001373291016,
      "end": 49.91999816894531,
      "text": " on the back of our prayer bulletin,"
    },
    {
      "id": 22,
      "start": 49.91999816894531,
      "end": 52.900001525878906,
      "text": " we every week have three updates,"
    },
    {
      "id": 23,
      "start": 52.900001525878906,
      "end": 56.2400016784668,
      "text": " and it's a joy to be able to hear what God is doing."
    },
    {
      "id": 24,
      "start": 56.2400016784668,
      "end": 57.31999969482422,
      "text": " I had the privilege yesterday"
    },
    {
      "id": 25,
      "start": 57.31999969482422,
      "end": 59.560001373291016,
      "text": " of being at a pastor's meeting,"
    },
    {
      "id": 26,
      "start": 59.560001373291016,
      "end": 62.15999984741211,
      "text": " and while I was at that pastor's meeting,"
    },
    {
      "id": 27,
      "start": 62.15999984741211,
      "end": 64.73999786376953,
      "text": " we got to hear from three church planters,"
    },
    {
      "id": 28,
      "start": 64.73999786376953,
      "end": 66.83999633789062,
      "text": " and then from a fourth man"
    },
    {
      "id": 29,
      "start": 66.83999633789062,
      "end": 68.95999908447266,
      "text": " who's just started a church as well,"
    },
    {
      "id": 30,
      "start": 68.95999908447266,
      "end": 71.0,
      "text": " and he's just moving forward."
    },
    {
      "id": 31,
      "start": 71.0,
      "end": 72.76000213623047,
      "text": " We really didn't know him,"
    },
    {
      "id": 32,
      "start": 72.76000213623047,
      "end": 74.44000244140625,
      "text": " just being introduced to him,"
    },
    {
      "id": 33,
      "start": 74.44000244140625,
      "end": 76.68000030517578,
      "text": " and it's exciting to see some young guys"
    },
    {
      "id": 34,
      "start": 76.68000030517578,
      "end": 79.81999969482422,
      "text": " that are going to some new locations and planning churches,"
    },
    {
      "id": 35,
      "start": 79.81999969482422,
      "end": 82.0,
      "text": " and you think about missions,"
    },
    {
      "id": 36,
      "start": 82.0,
      "end": 83.94000244140625,
      "text": " not only foreign, but even domestic,"
    },
    {
      "id": 37,
      "start": 83.94000244140625,
      "end": 86.83999633789062,
      "text": " and thinking about the privilege of being involved"
    },
    {
      "id": 38,
      "start": 86.83999633789062,
      "end": 88.36000061035156,
      "text": " in what God is doing,"
    },
    {
      "id": 39,
      "start": 88.36000061035156,
      "end": 91.5199966430664,
      "text": " and that is that we're reaching the world with the gospel."
    },
    {
      "id": 40,
      "start": 91.5199966430664,
      "end": 93.5199966430664,
      "text": " In Matthew chapter number nine,"
    },
    {
      "id": 41,
      "start": 93.5199966430664,
      "end": 95.68000030517578,
      "text": " the passage is familiar to us."
    },
    {
      "id": 42,
      "start": 95.68000030517578,
      "end": 98.72000122070312,
      "text": " It's the latter part of this passage of Scripture,"
    },
    {
      "id": 43,
      "start": 98.72000122070312,
      "end": 100.68000030517578,
      "text": " and I want you to notice in verse number 35"
    },
    {
      "id": 44,
      "start": 100.68000030517578,
      "end": 102.55999755859375,
      "text": " that the Bible says this,"
    },
    {
      "id": 45,
      "start": 102.55999755859375,
      "end": 105.95999908447266,
      "text": " that Jesus went about all the cities and villages,"
    },
    {
      "id": 46,
      "start": 105.95999908447266,
      "end": 107.31999969482422,
      "text": " teaching in their synagogues,"
    },
    {
      "id": 47,
      "start": 107.31999969482422,
      "end": 110.26000213623047,
      "text": " and preaching the gospel of the kingdom,"
    },
    {
      "id": 48,
      "start": 110.26000213623047,
      "end": 112.80000305175781,
      "text": " and healing every sickness and every disease"
    },
    {
      "id": 49,
      "start": 112.80000305175781,
      "end": 115.69999694824219,
      "text": " among the people."
    },
    {
      "id": 50,
      "start": 115.69999694824219,
      "end": 117.73999786376953,
      "text": " And then I want you to notice in verse 36,"
    },
    {
      "id": 51,
      "start": 117.73999786376953,
      "end": 120.9800033569336,
      "text": " the Bible says, but when he saw the multitudes,"
    },
    {
      "id": 52,
      "start": 120.9800033569336,
      "end": 123.73999786376953,
      "text": " he was moved with compassion on them."
    },
    {
      "id": 53,
      "start": 123.73999786376953,
      "end": 125.0999984741211,
      "text": " Why was it?"
    },
    {
      "id": 54,
      "start": 125.0999984741211,
      "end": 127.69999694824219,
      "text": " We see that he's moved with compassion"
    },
    {
      "id": 55,
      "start": 127.69999694824219,
      "end": 128.82000732421875,
      "text": " because of what he saw,"
    },
    {
      "id": 56,
      "start": 128.82000732421875,
      "end": 131.33999633789062,
      "text": " and you notice the Scriptures tell us"
    },
    {
      "id": 57,
      "start": 131.33999633789062,
      "end": 134.17999267578125,
      "text": " at the end of verse number 36 what it was."
    },
    {
      "id": 58,
      "start": 134.17999267578125,
      "end": 136.10000610351562,
      "text": " He saw this multitude of people,"
    },
    {
      "id": 59,
      "start": 136.10000610351562,
      "end": 137.89999389648438,
      "text": " the multitudes as it says,"
    },
    {
      "id": 60,
      "start": 137.89999389648438,
      "end": 140.13999938964844,
      "text": " and it says because they fainted"
    },
    {
      "id": 61,
      "start": 140.13999938964844,
      "end": 145.13999938964844,
      "text": " and were scattered abroad as sheep having no shepherd."
    },
    {
      "id": 62,
      "start": 146.13999938964844,
      "end": 148.6999969482422,
      "text": " So the Lord Jesus Christ, as he's going,"
    },
    {
      "id": 63,
      "start": 148.6999969482422,
      "end": 151.02000427246094,
      "text": " it says that he went in all the cities and villages,"
    },
    {
      "id": 64,
      "start": 151.02000427246094,
      "end": 153.89999389648438,
      "text": " as he's going, teaching and preaching and healing,"
    },
    {
      "id": 65,
      "start": 153.89999389648438,
      "end": 155.4600067138672,
      "text": " he sees the multitudes"
    },
    {
      "id": 66,
      "start": 155.4600067138672,
      "end": 158.22000122070312,
      "text": " and he's moved with compassion on them."
    },
    {
      "id": 67,
      "start": 159.33999633789062,
      "end": 162.13999938964844,
      "text": " And then he turns to his disciples."
    },
    {
      "id": 68,
      "start": 162.13999938964844,
      "end": 164.6999969482422,
      "text": " In verse 37 and verse 38,"
    },
    {
      "id": 69,
      "start": 164.6999969482422,
      "end": 167.3000030517578,
      "text": " we see that he turns to his disciples"
    },
    {
      "id": 70,
      "start": 167.3000030517578,
      "end": 169.22000122070312,
      "text": " and he says something to the disciples"
    },
    {
      "id": 71,
      "start": 169.22000122070312,
      "end": 171.74000549316406,
      "text": " that is very familiar to us."
    },
    {
      "id": 72,
      "start": 171.77999877929688,
      "end": 173.77999877929688,
      "text": " And first in verse number 37,"
    },
    {
      "id": 73,
      "start": 173.77999877929688,
      "end": 177.13999938964844,
      "text": " he informs his disciples of the condition."
    },
    {
      "id": 74,
      "start": 177.13999938964844,
      "end": 180.5399932861328,
      "text": " Notice the Bible says that then saith he,"
    },
    {
      "id": 75,
      "start": 180.5399932861328,
      "end": 182.6199951171875,
      "text": " the Lord Jesus Christ, God in flesh,"
    },
    {
      "id": 76,
      "start": 182.6199951171875,
      "end": 184.13999938964844,
      "text": " unto his disciples,"
    },
    {
      "id": 77,
      "start": 184.13999938964844,
      "end": 186.13999938964844,
      "text": " notice what he informed them of,"
    },
    {
      "id": 78,
      "start": 186.13999938964844,
      "end": 191.13999938964844,
      "text": " the harvest truly is plenteous,"
    },
    {
      "id": 79,
      "start": 191.6199951171875,
      "end": 193.5,
      "text": " but the laborers are few."
    },
    {
      "id": 80,
      "start": 194.4199981689453,
      "end": 196.13999938964844,
      "text": " This is the condition."
    },
    {
      "id": 81,
      "start": 196.13999938964844,
      "end": 200.86000061035156,
      "text": " And Jesus is informing his disciples of this condition."
    },
    {
      "id": 82,
      "start": 200.86000061035156,
      "end": 205.6199951171875,
      "text": " And he says that the harvest truly is plenteous,"
    },
    {
      "id": 83,
      "start": 206.5800018310547,
      "end": 208.86000061035156,
      "text": " but the laborers are few."
    },
    {
      "id": 84,
      "start": 208.86000061035156,
      "end": 210.94000244140625,
      "text": " This was true at this moment"
    },
    {
      "id": 85,
      "start": 210.94000244140625,
      "end": 214.10000610351562,
      "text": " because we know that our Lord is truthful"
    },
    {
      "id": 86,
      "start": 214.10000610351562,
      "end": 216.3800048828125,
      "text": " and it was absolutely accurate"
    },
    {
      "id": 87,
      "start": 216.3800048828125,
      "end": 218.3000030517578,
      "text": " as he made this declaration"
    },
    {
      "id": 88,
      "start": 218.3000030517578,
      "end": 219.6999969482422,
      "text": " and informing the disciples"
    },
    {
      "id": 89,
      "start": 219.6999969482422,
      "end": 223.86000061035156,
      "text": " as to the condition of the people."
    },
    {
      "id": 90,
      "start": 223.86000061035156,
      "end": 225.97999572753906,
      "text": " We find that I believe this evening"
    },
    {
      "id": 91,
      "start": 225.97999572753906,
      "end": 227.25999450683594,
      "text": " that we could still,"
    },
    {
      "id": 92,
      "start": 227.25999450683594,
      "end": 228.82000732421875,
      "text": " as we look at the condition"
    },
    {
      "id": 93,
      "start": 228.82000732421875,
      "end": 231.33999633789062,
      "text": " that was presented to these disciples,"
    },
    {
      "id": 94,
      "start": 231.33999633789062,
      "end": 234.5,
      "text": " that we still today could say"
    },
    {
      "id": 95,
      "start": 234.5,
      "end": 237.6999969482422,
      "text": " that the harvest truly is plenteous,"
    },
    {
      "id": 96,
      "start": 237.6999969482422,
      "end": 239.3000030517578,
      "text": " but the laborers are few."
    },
    {
      "id": 97,
      "start": 241.05999755859375,
      "end": 243.74000549316406,
      "text": " After Jesus informed,"
    },
    {
      "id": 98,
      "start": 243.74000549316406,
      "end": 246.5,
      "text": " we find that he then commands them."
    },
    {
      "id": 99,
      "start": 246.5,
      "end": 249.10000610351562,
      "text": " Notice what it is in verse 38."
    },
    {
      "id": 100,
      "start": 249.10000610351562,
      "end": 252.82000732421875,
      "text": " He says, pray ye therefore,"
    },
    {
      "id": 101,
      "start": 252.82000732421875,
      "end": 255.13999938964844,
      "text": " the Lord of the harvest,"
    },
    {
      "id": 102,
      "start": 255.13999938964844,
      "end": 258.6199951171875,
      "text": " that he will send forth laborers"
    },
    {
      "id": 103,
      "start": 258.6199951171875,
      "end": 260.739990234375,
      "text": " into his harvest."
    },
    {
      "id": 104,
      "start": 260.739990234375,
      "end": 263.1400146484375,
      "text": " And I find the instruction that is given,"
    },
    {
      "id": 105,
      "start": 263.1400146484375,
      "end": 264.9800109863281,
      "text": " the information in verse 37,"
    },
    {
      "id": 106,
      "start": 264.9800109863281,
      "end": 266.4599914550781,
      "text": " followed by the instruction"
    },
    {
      "id": 107,
      "start": 266.4599914550781,
      "end": 269.4200134277344,
      "text": " and the direction, the command to pray"
    },
    {
      "id": 108,
      "start": 269.4200134277344,
      "end": 270.5400085449219,
      "text": " in verse number 38."
    },
    {
      "id": 109,
      "start": 270.5400085449219,
      "end": 272.739990234375,
      "text": " And I wonder this evening"
    },
    {
      "id": 110,
      "start": 272.739990234375,
      "end": 277.70001220703125,
      "text": " how often, if we were to evaluate our prayer lives"
    },
    {
      "id": 111,
      "start": 277.70001220703125,
      "end": 278.5400085449219,
      "text": " and our prayer time,"
    },
    {
      "id": 112,
      "start": 278.5400085449219,
      "end": 281.8999938964844,
      "text": " I wonder how often we are praying"
    },
    {
      "id": 113,
      "start": 281.8999938964844,
      "end": 283.1400146484375,
      "text": " that the Lord of the harvest"
    },
    {
      "id": 114,
      "start": 283.1400146484375,
      "end": 287.260009765625,
      "text": " would send forth laborers into his harvest."
    },
    {
      "id": 115,
      "start": 287.260009765625,
      "end": 290.260009765625,
      "text": " I believe that's a unique privilege of ours"
    },
    {
      "id": 116,
      "start": 290.260009765625,
      "end": 292.5,
      "text": " as the people of God to serve God."
    },
    {
      "id": 117,
      "start": 292.5,
      "end": 294.70001220703125,
      "text": " And it's extremely rewarding"
    },
    {
      "id": 118,
      "start": 294.70001220703125,
      "end": 298.0199890136719,
      "text": " when you see God call people to the ministry."
    },
    {
      "id": 119,
      "start": 298.0199890136719,
      "end": 299.05999755859375,
      "text": " And we find that God"
    },
    {
      "id": 120,
      "start": 299.05999755859375,
      "end": 300.94000244140625,
      "text": " is still calling people to the ministry."
    },
    {
      "id": 121,
      "start": 300.94000244140625,
      "end": 302.5799865722656,
      "text": " The harvest is plenteous,"
    },
    {
      "id": 122,
      "start": 302.5799865722656,
      "end": 303.6600036621094,
      "text": " but the laborers are few,"
    },
    {
      "id": 123,
      "start": 303.6600036621094,
      "end": 305.6199951171875,
      "text": " but yet we find that he's calling"
    },
    {
      "id": 124,
      "start": 305.6199951171875,
      "end": 309.17999267578125,
      "text": " and he's sending forth laborers into his harvest."
    },
    {
      "id": 125,
      "start": 309.17999267578125,
      "end": 311.1000061035156,
      "text": " As in our minds and in my mind"
    },
    {
      "id": 126,
      "start": 311.1000061035156,
      "end": 312.8599853515625,
      "text": " over the next couple of weeks,"
    },
    {
      "id": 127,
      "start": 312.8599853515625,
      "end": 315.4599914550781,
      "text": " 10 days as we prepare for our missions conference."
    },
    {
      "id": 128,
      "start": 315.5,
      "end": 318.5799865722656,
      "text": " And I think it's always important"
    },
    {
      "id": 129,
      "start": 318.5799865722656,
      "end": 321.3800048828125,
      "text": " as we have special events on our calendar"
    },
    {
      "id": 130,
      "start": 321.3800048828125,
      "end": 322.739990234375,
      "text": " for us to be prepared,"
    },
    {
      "id": 131,
      "start": 322.739990234375,
      "end": 324.29998779296875,
      "text": " not only mentally and physically,"
    },
    {
      "id": 132,
      "start": 324.29998779296875,
      "end": 326.29998779296875,
      "text": " but spiritually prepared"
    },
    {
      "id": 133,
      "start": 326.29998779296875,
      "end": 328.5400085449219,
      "text": " for that which we're embarking upon."
    },
    {
      "id": 134,
      "start": 328.5400085449219,
      "end": 329.70001220703125,
      "text": " We're gonna have a missions conference."
    },
    {
      "id": 135,
      "start": 329.70001220703125,
      "end": 331.3399963378906,
      "text": " I wanna preach some messages on missions"
    },
    {
      "id": 136,
      "start": 331.3399963378906,
      "end": 332.4200134277344,
      "text": " and Lord willing,"
    },
    {
      "id": 137,
      "start": 332.4200134277344,
      "end": 335.0199890136719,
      "text": " try to get our heart prepared and ready"
    },
    {
      "id": 138,
      "start": 335.0199890136719,
      "end": 336.5,
      "text": " for that which we will receive"
    },
    {
      "id": 139,
      "start": 336.5,
      "end": 337.94000244140625,
      "text": " during that particular conference."
    },
    {
      "id": 140,
      "start": 337.94000244140625,
      "end": 339.94000244140625,
      "text": " We have revival meeting in the fall."
    },
    {
      "id": 141,
      "start": 339.94000244140625,
      "end": 342.05999755859375,
      "text": " I seek the face of the Lord"
    },
    {
      "id": 142,
      "start": 342.05999755859375,
      "end": 343.4599914550781,
      "text": " with regard to messages"
    },
    {
      "id": 143,
      "start": 343.5,
      "end": 345.70001220703125,
      "text": " in advance of those special meetings"
    },
    {
      "id": 144,
      "start": 345.70001220703125,
      "end": 346.5400085449219,
      "text": " that I could preach"
    },
    {
      "id": 145,
      "start": 346.5400085449219,
      "end": 348.29998779296875,
      "text": " so that we could be prepared"
    },
    {
      "id": 146,
      "start": 348.29998779296875,
      "end": 350.3800048828125,
      "text": " for the meeting that is at hand."
    },
    {
      "id": 147,
      "start": 350.3800048828125,
      "end": 351.70001220703125,
      "text": " And this evening,"
    },
    {
      "id": 148,
      "start": 351.70001220703125,
      "end": 353.94000244140625,
      "text": " we see this instruction"
    },
    {
      "id": 149,
      "start": 353.94000244140625,
      "end": 355.29998779296875,
      "text": " in Matthew chapter number nine."
    },
    {
      "id": 150,
      "start": 355.29998779296875,
      "end": 357.3399963378906,
      "text": " And now I want you to turn to the Acts chapter 13"
    },
    {
      "id": 151,
      "start": 357.3399963378906,
      "end": 360.4599914550781,
      "text": " and really the text for our message this evening."
    },
    {
      "id": 152,
      "start": 360.4599914550781,
      "end": 362.29998779296875,
      "text": " And if you're taking notes,"
    },
    {
      "id": 153,
      "start": 362.29998779296875,
      "end": 365.4599914550781,
      "text": " I've simply entitled the message this evening,"
    },
    {
      "id": 154,
      "start": 365.4599914550781,
      "end": 369.1000061035156,
      "text": " sent forth, sent forth."
    },
    {
      "id": 155,
      "start": 369.1000061035156,
      "end": 371.7799987792969,
      "text": " We're looking at Acts 13 verses one through 12."
    },
    {
      "id": 156,
      "start": 372.7799987792969,
      "end": 377.5799865722656,
      "text": " Lord willing, unless he gives different direction,"
    },
    {
      "id": 157,
      "start": 377.5799865722656,
      "end": 380.4599914550781,
      "text": " I will preach the latter part of Acts chapter number 13"
    },
    {
      "id": 158,
      "start": 380.4599914550781,
      "end": 382.4200134277344,
      "text": " next Wednesday evening,"
    },
    {
      "id": 159,
      "start": 382.4200134277344,
      "end": 384.7799987792969,
      "text": " excuse me, of Acts chapter 14,"
    },
    {
      "id": 160,
      "start": 384.7799987792969,
      "end": 386.5,
      "text": " the latter part of Acts chapter number 14"
    },
    {
      "id": 161,
      "start": 386.5,
      "end": 388.1000061035156,
      "text": " next Wednesday evening."
    },
    {
      "id": 162,
      "start": 388.1000061035156,
      "end": 389.8999938964844,
      "text": " But as we look at the beginning part"
    },
    {
      "id": 163,
      "start": 389.8999938964844,
      "end": 391.05999755859375,
      "text": " of Acts chapter number 13,"
    },
    {
      "id": 164,
      "start": 391.05999755859375,
      "end": 392.4599914550781,
      "text": " we know that there's a division"
    },
    {
      "id": 165,
      "start": 392.4599914550781,
      "end": 393.29998779296875,
      "text": " in the book of Acts"
    },
    {
      "id": 166,
      "start": 393.29998779296875,
      "end": 394.3800048828125,
      "text": " and all that's taking place."
    },
    {
      "id": 167,
      "start": 394.3800048828125,
      "end": 396.0199890136719,
      "text": " But really I find"
    },
    {
      "id": 168,
      "start": 396.0199890136719,
      "end": 398.3399963378906,
      "text": " that as we look at that passage of scripture"
    },
    {
      "id": 169,
      "start": 398.3399963378906,
      "end": 399.4599914550781,
      "text": " in Matthew chapter nine,"
    },
    {
      "id": 170,
      "start": 399.4599914550781,
      "end": 401.17999267578125,
      "text": " when the Lord sees the multitudes"
    },
    {
      "id": 171,
      "start": 401.17999267578125,
      "end": 402.70001220703125,
      "text": " and he's moved with compassion,"
    },
    {
      "id": 172,
      "start": 402.70001220703125,
      "end": 406.4599914550781,
      "text": " he informs his servants, the disciples,"
    },
    {
      "id": 173,
      "start": 406.4599914550781,
      "end": 408.5400085449219,
      "text": " that the harvest truly is plenteous,"
    },
    {
      "id": 174,
      "start": 408.5400085449219,
      "end": 409.8599853515625,
      "text": " the laborers are few."
    },
    {
      "id": 175,
      "start": 409.8599853515625,
      "end": 410.8999938964844,
      "text": " And then he commands them,"
    },
    {
      "id": 176,
      "start": 410.8999938964844,
      "end": 413.29998779296875,
      "text": " he instructs them to pray."
    },
    {
      "id": 177,
      "start": 413.29998779296875,
      "end": 414.29998779296875,
      "text": " And he instructs them to pray"
    },
    {
      "id": 178,
      "start": 414.29998779296875,
      "end": 416.739990234375,
      "text": " that he would send forth laborers."
    },
    {
      "id": 179,
      "start": 416.739990234375,
      "end": 418.5799865722656,
      "text": " And we find here in Acts chapter number 13"
    },
    {
      "id": 180,
      "start": 418.5799865722656,
      "end": 420.3399963378906,
      "text": " that they were sent forth."
    },
    {
      "id": 181,
      "start": 420.3399963378906,
      "end": 423.0199890136719,
      "text": " And what a blessing to see how God is working"
    },
    {
      "id": 182,
      "start": 423.0199890136719,
      "end": 424.5799865722656,
      "text": " in and through his church."
    },
    {
      "id": 183,
      "start": 424.5799865722656,
      "end": 426.260009765625,
      "text": " As we begin Acts 13,"
    },
    {
      "id": 184,
      "start": 426.260009765625,
      "end": 429.4200134277344,
      "text": " we find that we're dealing with the church in Antioch."
    },
    {
      "id": 185,
      "start": 429.4200134277344,
      "end": 431.0199890136719,
      "text": " And you notice that the Bible says this"
    },
    {
      "id": 186,
      "start": 431.0199890136719,
      "end": 433.05999755859375,
      "text": " in verse number one of Acts 13."
    },
    {
      "id": 187,
      "start": 433.05999755859375,
      "end": 435.29998779296875,
      "text": " Now, there were in the church"
    },
    {
      "id": 188,
      "start": 435.29998779296875,
      "end": 439.5400085449219,
      "text": " that was at Antioch certain prophets and teachers,"
    },
    {
      "id": 189,
      "start": 439.5400085449219,
      "end": 441.0199890136719,
      "text": " as Barnabas and Simeon,"
    },
    {
      "id": 190,
      "start": 441.0199890136719,
      "end": 442.0199890136719,
      "text": " that was called Niger,"
    },
    {
      "id": 191,
      "start": 442.0199890136719,
      "end": 444.4200134277344,
      "text": " and Lucius of Cyrene and Manaan,"
    },
    {
      "id": 192,
      "start": 444.4200134277344,
      "end": 448.9800109863281,
      "text": " which had been brought up with Herod the Tetrarch and Saul."
    },
    {
      "id": 193,
      "start": 448.9800109863281,
      "end": 450.4200134277344,
      "text": " Notice verse two,"
    },
    {
      "id": 194,
      "start": 450.4200134277344,
      "end": 455.05999755859375,
      "text": " the Bible says as they ministered to the Lord and fasted."
    },
    {
      "id": 195,
      "start": 455.05999755859375,
      "end": 457.4599914550781,
      "text": " Often we find that throughout the scriptures"
    },
    {
      "id": 196,
      "start": 457.4599914550781,
      "end": 459.6199951171875,
      "text": " that in fact, in verse number three,"
    },
    {
      "id": 197,
      "start": 459.6199951171875,
      "end": 461.4200134277344,
      "text": " it will mention that they fasted and prayed,"
    },
    {
      "id": 198,
      "start": 461.4200134277344,
      "end": 465.7799987792969,
      "text": " but often we find the connection with fasting and prayer."
    },
    {
      "id": 199,
      "start": 465.7799987792969,
      "end": 467.5,
      "text": " Some have said of yesteryear"
    },
    {
      "id": 200,
      "start": 467.5,
      "end": 469.82000732421875,
      "text": " that fasting makes no sense without prayer."
    },
    {
      "id": 201,
      "start": 469.82000732421875,
      "end": 471.8599853515625,
      "text": " And I think that's a very valid point."
    },
    {
      "id": 202,
      "start": 471.8599853515625,
      "end": 473.4200134277344,
      "text": " And so we find that this church,"
    },
    {
      "id": 203,
      "start": 473.4200134277344,
      "end": 475.05999755859375,
      "text": " the church in Antioch is a church"
    },
    {
      "id": 204,
      "start": 475.05999755859375,
      "end": 477.1000061035156,
      "text": " in which they've grown in their ministering."
    },
    {
      "id": 205,
      "start": 477.1000061035156,
      "end": 479.3399963378906,
      "text": " And you think about the servants of the Lord"
    },
    {
      "id": 206,
      "start": 479.3399963378906,
      "end": 482.5400085449219,
      "text": " that God has placed in that particular assembly."
    },
    {
      "id": 207,
      "start": 482.5400085449219,
      "end": 484.1000061035156,
      "text": " When you look at verse number one"
    },
    {
      "id": 208,
      "start": 484.1000061035156,
      "end": 486.6600036621094,
      "text": " and you find that God is working."
    },
    {
      "id": 209,
      "start": 486.6600036621094,
      "end": 489.29998779296875,
      "text": " And as we look at this passage of scripture,"
    },
    {
      "id": 210,
      "start": 489.29998779296875,
      "end": 494.05999755859375,
      "text": " I find that right away in verses really one through three,"
    },
    {
      "id": 211,
      "start": 494.05999755859375,
      "end": 497.6600036621094,
      "text": " then into verse number four, the specifics are given,"
    },
    {
      "id": 212,
      "start": 497.6600036621094,
      "end": 500.29998779296875,
      "text": " but God gives His plan."
    },
    {
      "id": 213,
      "start": 500.29998779296875,
      "end": 502.05999755859375,
      "text": " If you're taking notes, I would say this,"
    },
    {
      "id": 214,
      "start": 502.05999755859375,
      "end": 503.6199951171875,
      "text": " the mission was embraced."
    },
    {
      "id": 215,
      "start": 503.6199951171875,
      "end": 506.5,
      "text": " We see a church that receives the plan of God."
    },
    {
      "id": 216,
      "start": 506.5,
      "end": 509.9800109863281,
      "text": " And as the plan of God is given to this local assembly,"
    },
    {
      "id": 217,
      "start": 509.9800109863281,
      "end": 512.6599731445312,
      "text": " we find that they embrace the mission"
    },
    {
      "id": 218,
      "start": 512.6599731445312,
      "end": 514.3400268554688,
      "text": " that is entrusted to them."
    },
    {
      "id": 219,
      "start": 514.3400268554688,
      "end": 515.7000122070312,
      "text": " The Bible says in verse number two,"
    },
    {
      "id": 220,
      "start": 515.7000122070312,
      "end": 519.260009765625,
      "text": " as they ministered to the Lord and fasted,"
    },
    {
      "id": 221,
      "start": 519.260009765625,
      "end": 522.0999755859375,
      "text": " the Holy Ghost said,"
    },
    {
      "id": 222,
      "start": 522.0999755859375,
      "end": 524.5800170898438,
      "text": " notice what is said in verse number two,"
    },
    {
      "id": 223,
      "start": 524.5800170898438,
      "end": 529.0999755859375,
      "text": " separate me Barnabas and Saul for the work"
    },
    {
      "id": 224,
      "start": 529.0999755859375,
      "end": 532.5,
      "text": " whereunto I have called them."
    },
    {
      "id": 225,
      "start": 532.5,
      "end": 534.8200073242188,
      "text": " We begin to see in Acts chapter 13"
    },
    {
      "id": 226,
      "start": 534.8200073242188,
      "end": 536.8599853515625,
      "text": " is often referenced and referred to"
    },
    {
      "id": 227,
      "start": 536.8599853515625,
      "end": 539.1799926757812,
      "text": " as being the first missionary journey"
    },
    {
      "id": 228,
      "start": 539.1799926757812,
      "end": 541.6599731445312,
      "text": " and appropriately coined as such."
    },
    {
      "id": 229,
      "start": 541.6599731445312,
      "end": 544.3800048828125,
      "text": " And we find that as this first missionary journey"
    },
    {
      "id": 230,
      "start": 544.3800048828125,
      "end": 546.7000122070312,
      "text": " would begin that this church,"
    },
    {
      "id": 231,
      "start": 546.7000122070312,
      "end": 548.6599731445312,
      "text": " they're assembled there in Antioch,"
    },
    {
      "id": 232,
      "start": 548.6599731445312,
      "end": 550.739990234375,
      "text": " they're ministering, they're serving, they're fasting."
    },
    {
      "id": 233,
      "start": 550.739990234375,
      "end": 553.97998046875,
      "text": " No doubt they were praying and they were preaching"
    },
    {
      "id": 234,
      "start": 553.97998046875,
      "end": 557.02001953125,
      "text": " and the ministry was just thriving."
    },
    {
      "id": 235,
      "start": 557.02001953125,
      "end": 559.780029296875,
      "text": " God was blessing, God was working."
    },
    {
      "id": 236,
      "start": 559.780029296875,
      "end": 564.6199951171875,
      "text": " And the Holy Spirit, the Holy Ghost comes and He says,"
    },
    {
      "id": 237,
      "start": 564.6199951171875,
      "end": 568.4600219726562,
      "text": " separate me Barnabas and Saul for the work"
    },
    {
      "id": 238,
      "start": 568.4600219726562,
      "end": 569.9400024414062,
      "text": " whereunto I have called them."
    },
    {
      "id": 239,
      "start": 569.9400024414062,
      "end": 571.6599731445312,
      "text": " And so we find here right away"
    },
    {
      "id": 240,
      "start": 571.6599731445312,
      "end": 574.6599731445312,
      "text": " that God's plan is being revealed."
    },
    {
      "id": 241,
      "start": 574.6599731445312,
      "end": 577.219970703125,
      "text": " And we find that God's plan is being revealed."
    },
    {
      "id": 242,
      "start": 577.3400268554688,
      "end": 579.3400268554688,
      "text": " And I said that the mission was embraced"
    },
    {
      "id": 243,
      "start": 579.3400268554688,
      "end": 582.0999755859375,
      "text": " because we see the response in verse number three"
    },
    {
      "id": 244,
      "start": 582.0999755859375,
      "end": 585.0599975585938,
      "text": " when the Bible says that when they had fasted and prayed"
    },
    {
      "id": 245,
      "start": 585.0599975585938,
      "end": 587.5800170898438,
      "text": " and laid their hands on them,"
    },
    {
      "id": 246,
      "start": 587.5800170898438,
      "end": 590.4600219726562,
      "text": " they sent them away."
    },
    {
      "id": 247,
      "start": 590.4600219726562,
      "end": 592.5,
      "text": " There's no discussion with regard"
    },
    {
      "id": 248,
      "start": 592.5,
      "end": 595.8599853515625,
      "text": " to the place of ministry or leadership"
    },
    {
      "id": 249,
      "start": 595.8599853515625,
      "end": 598.6599731445312,
      "text": " that these individuals had within the church of Antioch"
    },
    {
      "id": 250,
      "start": 598.6599731445312,
      "end": 600.4600219726562,
      "text": " and the way in which they needed it."
    },
    {
      "id": 0,
      "start": 600.4600219726562,
      "end": 607.7400221824646,
      "text": " to stay? No, they obeyed the Lord. They obeyed the direction that God is giving. The plan of God is"
    },
    {
      "id": 1,
      "start": 607.7400221824646,
      "end": 612.9400215148926,
      "text": " revealed and we find that it's embraced. We find this evening as we would understand what's"
    },
    {
      "id": 2,
      "start": 612.9400215148926,
      "end": 618.2200222015381,
      "text": " happening here in this first missionary journey and you look at the next few verses and see the"
    },
    {
      "id": 3,
      "start": 618.2200222015381,
      "end": 623.5000228881836,
      "text": " places in which they went, you will find that as God's plan is revealed, you will find that God's"
    },
    {
      "id": 4,
      "start": 623.5000228881836,
      "end": 633.9000205993652,
      "text": " plan always fulfills God's purpose. Back in Acts 1, in verse 8, you find that the record,"
    },
    {
      "id": 5,
      "start": 633.9000205993652,
      "end": 638.4600219726562,
      "text": " if you will, of the Great Commission is listed for us here in the book of Acts. We find it in"
    },
    {
      "id": 6,
      "start": 638.4600219726562,
      "end": 643.6600227355957,
      "text": " all of the Gospels and then here in the book of Acts as well. And you find that Jesus, before he"
    },
    {
      "id": 7,
      "start": 643.6600227355957,
      "end": 648.9400215148926,
      "text": " ascended to heaven, said this, but you shall receive power after the Holy Ghost has come upon"
    },
    {
      "id": 8,
      "start": 648.9400215148926,
      "end": 654.8600234985352,
      "text": " you and you shall be witnesses unto me both in Jerusalem and in all Judea and in Samaria and"
    },
    {
      "id": 9,
      "start": 654.8600234985352,
      "end": 662.140022277832,
      "text": " under the uttermost part of the earth. In Acts 13, when we find that the Holy Spirit of God"
    },
    {
      "id": 10,
      "start": 662.140022277832,
      "end": 667.9800186157227,
      "text": " comes to this body of believers and says, separate me Barnabas and Saul for the work"
    },
    {
      "id": 11,
      "start": 667.9800186157227,
      "end": 673.5000228881836,
      "text": " wherein to have called them, we see God's plan being revealed but it's fulfilling his purpose."
    },
    {
      "id": 12,
      "start": 674.3000183105469,
      "end": 680.3800201416016,
      "text": " We find that God had allowed for the Gospel to, of course, be there in Jerusalem. And as you think"
    },
    {
      "id": 13,
      "start": 680.3800201416016,
      "end": 684.3800201416016,
      "text": " about Acts 1-8, as we just read it, and you think about the divisions that are given,"
    },
    {
      "id": 14,
      "start": 684.3800201416016,
      "end": 691.02001953125,
      "text": " and you think about Acts 2-7 dealing with the Gospel being there in Jerusalem. And then as"
    },
    {
      "id": 15,
      "start": 691.02001953125,
      "end": 696.9400253295898,
      "text": " you go and you move forward and you look at chapters 8-12, I mentioned, I referenced Acts 8-4"
    },
    {
      "id": 16,
      "start": 696.9400253295898,
      "end": 701.7400207519531,
      "text": " on Sunday evening, that then they that were scattered abroad went everywhere preaching the"
    },
    {
      "id": 17,
      "start": 702.7000198364258,
      "end": 709.3400192260742,
      "text": " Word. And as we look at Acts 8-12, you begin to see how that they were scattered abroad and the"
    },
    {
      "id": 18,
      "start": 709.3400192260742,
      "end": 719.1800231933594,
      "text": " Gospel goes into Judea and into Samaria. And as you enter into Acts 13, and I believe from Acts"
    },
    {
      "id": 19,
      "start": 719.1800231933594,
      "end": 726.3800201416016,
      "text": " 13 all the way to the present day, we find that God is fulfilling his plan to get the Gospel to"
    },
    {
      "id": 20,
      "start": 726.3800201416016,
      "end": 734.6200256347656,
      "text": " the uttermost. It begins, though, really in Acts 13. As they had been in Jerusalem, they'd been in"
    },
    {
      "id": 21,
      "start": 734.6200256347656,
      "end": 739.9800262451172,
      "text": " Judea and Samaria, and now we find that Paul and Barnabas are going to be separated, they're going"
    },
    {
      "id": 22,
      "start": 739.9800262451172,
      "end": 747.8200225830078,
      "text": " to be sent out, and the Gospel is going to now be preached to the world. We find that it would begin"
    },
    {
      "id": 23,
      "start": 747.8200225830078,
      "end": 751.6600189208984,
      "text": " and it would spread. We understand that as we read through the missionary journeys that are"
    },
    {
      "id": 24,
      "start": 751.6600189208984,
      "end": 755.7400207519531,
      "text": " recorded in the book of Acts, that there would be churches that would be established in this"
    },
    {
      "id": 25,
      "start": 755.7400207519531,
      "end": 762.0600280761719,
      "text": " particular missionary journey. They go to the region of Galatia, and we find that the particular"
    },
    {
      "id": 26,
      "start": 762.0600280761719,
      "end": 766.0600280761719,
      "text": " cities, and we'll look at it in just a few moments, that they go to, and the churches that are"
    },
    {
      "id": 27,
      "start": 766.0600280761719,
      "end": 771.2600250244141,
      "text": " established, you read the book of Galatians, and you find that that book is written to the churches"
    },
    {
      "id": 28,
      "start": 771.2600250244141,
      "end": 776.2200164794922,
      "text": " that are in Galatia. How did they get there? It's a result of this first missionary journey."
    },
    {
      "id": 29,
      "start": 776.3000183105469,
      "end": 783.9800262451172,
      "text": " It's a result of God sending forth laborers. Somebody, as we look at the pattern and the"
    },
    {
      "id": 30,
      "start": 784.5400238037109,
      "end": 789.8200225830078,
      "text": " blueprint that is given, if you will, in Matthew 9, he said that they were to pray to the Lord of"
    },
    {
      "id": 31,
      "start": 789.8200225830078,
      "end": 796.8600158691406,
      "text": " the harvest that he would send forth laborers, and we find that here in Acts 13, they're sent forth."
    },
    {
      "id": 32,
      "start": 796.8600158691406,
      "end": 802.3000183105469,
      "text": " The Holy Spirit of God comes, and he says, separate me, Barnabas, and Saul for the work"
    },
    {
      "id": 33,
      "start": 802.3000183105469,
      "end": 805.9000244140625,
      "text": " wherein to have called them, and you notice at the end of verse number three, it says, and then"
    },
    {
      "id": 34,
      "start": 805.9000244140625,
      "end": 814.9400177001953,
      "text": " they sent them away. Verse four, so they, being sent forth by the Holy Ghost, departed"
    },
    {
      "id": 35,
      "start": 814.9400177001953,
      "end": 820.780029296875,
      "text": " unto Seleucia, and from thence they sailed to Cyprus, and when they were at Salamis, notice,"
    },
    {
      "id": 36,
      "start": 820.780029296875,
      "end": 827.1000213623047,
      "text": " they preached the word of God in the synagogues of the Jews, and they had also John to their"
    },
    {
      "id": 37,
      "start": 827.1000213623047,
      "end": 834.9400177001953,
      "text": " minister, and so we find that they go forth, and the purpose of this mission was no doubt embraced,"
    },
    {
      "id": 38,
      "start": 834.9400177001953,
      "end": 841.2600250244141,
      "text": " and it was to carry forth the gospel, the word of God, and as we would understand God's plan being"
    },
    {
      "id": 39,
      "start": 841.2600250244141,
      "end": 846.9400177001953,
      "text": " revealed to the church here in Antioch, and we'd understand the way in which his plan fulfills his"
    },
    {
      "id": 40,
      "start": 846.9400177001953,
      "end": 852.9400177001953,
      "text": " purpose, we would easily conclude this evening that it's always best for the people of God"
    },
    {
      "id": 41,
      "start": 853.5800170898438,
      "end": 861.9800109863281,
      "text": " to embrace the plan of God. God's plan is perfect. Amen? I've been asked many times over the years"
    },
    {
      "id": 42,
      "start": 863.1000366210938,
      "end": 868.2200317382812,
      "text": " about the individual in some remote part of the world that's never heard the gospel,"
    },
    {
      "id": 43,
      "start": 869.02001953125,
      "end": 874.6200256347656,
      "text": " and what happens to that individual when they die. I'm not sure if you've ever received that"
    },
    {
      "id": 44,
      "start": 874.6200256347656,
      "end": 880.3800354003906,
      "text": " question, but on a number of occasions, I have received that question. It is very interesting"
    },
    {
      "id": 45,
      "start": 880.3800354003906,
      "end": 885.1000366210938,
      "text": " if you were to study church history or to study missiology, and you'd understand how that there"
    },
    {
      "id": 46,
      "start": 885.1000366210938,
      "end": 891.6600341796875,
      "text": " were many, many references throughout history of missionaries showing up to particular fields and"
    },
    {
      "id": 47,
      "start": 891.6600341796875,
      "end": 897.1000366210938,
      "text": " finding of the people there, how that they were praying that if there's a God, would you send"
    },
    {
      "id": 48,
      "start": 897.1000366210938,
      "end": 903.5800170898438,
      "text": " somebody so that we'd understand the truth, and you can read wonderful accounts and testimonies"
    },
    {
      "id": 49,
      "start": 903.5800170898438,
      "end": 911.5800170898438,
      "text": " of how God has worked and moved. But the reality is that the problem that many people seek to"
    },
    {
      "id": 50,
      "start": 912.2200317382812,
      "end": 919.02001953125,
      "text": " point out in asking that question is they seek to put some sort of blame upon God"
    },
    {
      "id": 51,
      "start": 919.8200073242188,
      "end": 924.9400329589844,
      "text": " for somebody spending eternity in the lake of fire that's in a remote location that never heard"
    },
    {
      "id": 52,
      "start": 924.9400329589844,
      "end": 930.5400085449219,
      "text": " the gospel. But really, the responsibility falls squarely on the shoulders of the church,"
    },
    {
      "id": 53,
      "start": 931.5000305175781,
      "end": 939.9000244140625,
      "text": " because God's plan has been clearly given. It's that God's plan must be embraced by God's people,"
    },
    {
      "id": 54,
      "start": 940.4600219726562,
      "end": 948.6200256347656,
      "text": " and when God's plan is embraced by the people of God, we find that God will work as he promises to"
    },
    {
      "id": 55,
      "start": 948.6200256347656,
      "end": 955.3400268554688,
      "text": " do so. And as we look at this passage of Scripture and we begin to think about the progression"
    },
    {
      "id": 56,
      "start": 955.3400268554688,
      "end": 959.5000305175781,
      "text": " through the next several chapters of the book of Acts, and then really looking through all of"
    },
    {
      "id": 57,
      "start": 960.2200317382812,
      "end": 968.9400329589844,
      "text": " the history up until even present day, you begin to see how God works and what God does and how"
    },
    {
      "id": 58,
      "start": 968.9400329589844,
      "end": 975.6600341796875,
      "text": " God's plan, when it's embraced, is fulfilled in bringing forth his purpose, and churches"
    },
    {
      "id": 59,
      "start": 975.6600341796875,
      "end": 982.1400146484375,
      "text": " being established all over the world, and people being saved. And it's a wonderful thing. There's"
    },
    {
      "id": 60,
      "start": 982.1400146484375,
      "end": 989.7400207519531,
      "text": " so often that individuals and perhaps groups of individuals would like to sit around and have"
    },
    {
      "id": 61,
      "start": 989.7400207519531,
      "end": 994.6200256347656,
      "text": " discussions, roundtable discussions, on what are we going to do to reach the world, and what are"
    },
    {
      "id": 62,
      "start": 994.6200256347656,
      "end": 999.5000305175781,
      "text": " we going to do to, you know, reach seven and a half billion people, and so on and so forth. And"
    },
    {
      "id": 63,
      "start": 999.5000305175781,
      "end": 1005.5800170898438,
      "text": " the reality is that we really don't need to have any roundtable discussions. We really just need"
    },
    {
      "id": 64,
      "start": 1005.5800170898438,
      "end": 1012.3000183105469,
      "text": " to do what God told us to do. Amen? Because when we actively, each and every one of us, fulfill"
    },
    {
      "id": 65,
      "start": 1012.3000183105469,
      "end": 1017.7400207519531,
      "text": " the purpose and the plan that God has for us, and we're all in it together. Listen, the church in"
    },
    {
      "id": 66,
      "start": 1017.7400207519531,
      "end": 1024.4600219726562,
      "text": " Antioch had a vital part in this. And then there were individuals, Paul and Barnabas, and then John"
    },
    {
      "id": 67,
      "start": 1024.4600219726562,
      "end": 1030.780029296875,
      "text": " has mentioned that was going as their minister. They had a vital part, but each person doing their"
    },
    {
      "id": 68,
      "start": 1030.780029296875,
      "end": 1038.3800354003906,
      "text": " part, bringing to pass the plan of God, and bringing honor and glory to God. And we find here"
    },
    {
      "id": 69,
      "start": 1038.3800354003906,
      "end": 1044.4600219726562,
      "text": " that it is absolutely imperative that we understand that it is God's plan that must be"
    },
    {
      "id": 70,
      "start": 1044.4600219726562,
      "end": 1050.9400329589844,
      "text": " embraced. I'm not suggesting that we don't share some ideas and deal with some maybe approach and"
    },
    {
      "id": 71,
      "start": 1050.9400329589844,
      "end": 1057.5800170898438,
      "text": " methodology, if you will, but the unfortunate thing is there are times in which we can spend so much"
    },
    {
      "id": 72,
      "start": 1057.5800170898438,
      "end": 1065.3400268554688,
      "text": " time talking about doing something that we never actually do it. And that's not just the fault of a"
    },
    {
      "id": 73,
      "start": 1065.3400268554688,
      "end": 1071.9000244140625,
      "text": " church. That really can be found in any arena of life. People just stand around and talk about doing"
    },
    {
      "id": 74,
      "start": 1071.9000244140625,
      "end": 1075.9000244140625,
      "text": " something, and it's like, you just need to get busy doing it, you know? And this thing isn't"
    },
    {
      "id": 75,
      "start": 1075.9000244140625,
      "end": 1080.6200256347656,
      "text": " going to, it's not going to happen on its own. It's not going to just, you know, be fixed. You got to do it."
    },
    {
      "id": 76,
      "start": 1080.780029296875,
      "end": 1087.7400207519531,
      "text": " And so we know that God has given a plan, and so we see the mission is embraced."
    },
    {
      "id": 77,
      "start": 1087.7400207519531,
      "end": 1092.3800354003906,
      "text": " Number two, if you will, the mission field was evangelized. You find that in verse number five,"
    },
    {
      "id": 78,
      "start": 1093.1000366210938,
      "end": 1097.3400268554688,
      "text": " and then we'll look at a verse in chapter number 14, but in verse number five, right in the middle"
    },
    {
      "id": 79,
      "start": 1097.3400268554688,
      "end": 1103.6600341796875,
      "text": " of the verse there, it says they preached the Word of God. They preached the Word of God. They understood"
    },
    {
      "id": 80,
      "start": 1103.6600341796875,
      "end": 1108.780029296875,
      "text": " what they were being sent forth to do. They understood that they had a purpose, a very specific"
    },
    {
      "id": 81,
      "start": 1108.780029296875,
      "end": 1114.6199951171875,
      "text": " purpose, and they were being sent forth to preach the Word of God. We find that in Acts chapter"
    },
    {
      "id": 82,
      "start": 1114.6199951171875,
      "end": 1118.6199951171875,
      "text": " number 14, and we'll come back and finish up through verse number 12 of Acts 13, but I want"
    },
    {
      "id": 83,
      "start": 1118.6199951171875,
      "end": 1123.5800170898438,
      "text": " you to just for a moment look at Acts 14 and verse number 7, and here the Bible is telling us about"
    },
    {
      "id": 84,
      "start": 1123.5800170898438,
      "end": 1130.8600463867188,
      "text": " when they were, they fled unto Lystra and Derbe, cities of Lyconia, that it says in verse number"
    },
    {
      "id": 85,
      "start": 1131.260009765625,
      "end": 1139.7400512695312,
      "text": " seven, and there they preached the gospel. If I could quickly go through here this 13th chapter"
    },
    {
      "id": 86,
      "start": 1139.7400512695312,
      "end": 1144.780029296875,
      "text": " and really understand what's taking place, and we find that in verse number five, the Bible tells us"
    },
    {
      "id": 87,
      "start": 1144.780029296875,
      "end": 1150.2200317382812,
      "text": " specifically the region at the end of verse number four, and from thence they sailed to Cyprus,"
    },
    {
      "id": 88,
      "start": 1150.2200317382812,
      "end": 1154.6199951171875,
      "text": " and when they were at Salamis, they preached the Word of God in the synagogues of the Jews,"
    },
    {
      "id": 89,
      "start": 1155.5,
      "end": 1160.5400390625,
      "text": " and they had also John to their minister, and so the Bible begins to tell us here in verses"
    },
    {
      "id": 90,
      "start": 1160.5400390625,
      "end": 1165.9000244140625,
      "text": " five through twelve about the ministry there on the island of Cyprus, and they preached the Word."
    },
    {
      "id": 91,
      "start": 1165.9000244140625,
      "end": 1171.6600341796875,
      "text": " It says, when they had gone through the isle unto Paphos, they found a certain sorcerer,"
    },
    {
      "id": 92,
      "start": 1171.6600341796875,
      "end": 1178.300048828125,
      "text": " a false prophet, a Jew, whose name was Bargesas, which was with the deputy of the country,"
    },
    {
      "id": 93,
      "start": 1178.300048828125,
      "end": 1184.6199951171875,
      "text": " Sergius Paulus, a prudent man. Notice when it says, who called for Barnabas and Saul"
    },
    {
      "id": 94,
      "start": 1185.1799926757812,
      "end": 1192.2200317382812,
      "text": " and desired to hear the Word of God. You wonder why God sent them to where He sent them?"
    },
    {
      "id": 95,
      "start": 1193.9000244140625,
      "end": 1200.2200317382812,
      "text": " The Bible tells us here that there's a man there that desired to hear the Word of God."
    },
    {
      "id": 0,
      "start": 1200.2200317382812,
      "end": 1202.2200317382812,
      "text": " What a blessing."
    },
    {
      "id": 1,
      "start": 1202.2200317382812,
      "end": 1205.2200317382812,
      "text": " The Bible says that there's always going to be opposition."
    },
    {
      "id": 2,
      "start": 1205.2200317382812,
      "end": 1208.2200317382812,
      "text": " The Bible records the opposition, but here the Bible says in verse 8,"
    },
    {
      "id": 3,
      "start": 1208.2200317382812,
      "end": 1211.2200317382812,
      "text": " But Elamist, the sorcerer, for so is his name by interpretation,"
    },
    {
      "id": 4,
      "start": 1211.2200317382812,
      "end": 1215.2200317382812,
      "text": " withstood them, seeking to turn away the deputy from the faith."
    },
    {
      "id": 5,
      "start": 1215.2200317382812,
      "end": 1217.2200317382812,
      "text": " There's always opposition."
    },
    {
      "id": 6,
      "start": 1217.2200317382812,
      "end": 1221.2200317382812,
      "text": " There is a spiritual battle that is raging."
    },
    {
      "id": 7,
      "start": 1221.2200317382812,
      "end": 1225.2200317382812,
      "text": " And as the people of God seek to embrace the plan of God"
    },
    {
      "id": 8,
      "start": 1225.2200317382812,
      "end": 1228.2200317382812,
      "text": " and fulfill the mission that has been assigned to us,"
    },
    {
      "id": 9,
      "start": 1228.2200317382812,
      "end": 1232.2200317382812,
      "text": " we find that it will be met with opposition."
    },
    {
      "id": 10,
      "start": 1232.2200317382812,
      "end": 1234.2200317382812,
      "text": " Does it mean that we just give up?"
    },
    {
      "id": 11,
      "start": 1234.2200317382812,
      "end": 1236.2200317382812,
      "text": " Say, well, I guess, you know, we tried."
    },
    {
      "id": 12,
      "start": 1236.2200317382812,
      "end": 1239.2200317382812,
      "text": " We did the best we could, didn't we?"
    },
    {
      "id": 13,
      "start": 1239.2200317382812,
      "end": 1243.2200317382812,
      "text": " Here the Bible says that they were met with opposition,"
    },
    {
      "id": 14,
      "start": 1243.2200317382812,
      "end": 1244.2200317382812,
      "text": " and then in verse 9,"
    },
    {
      "id": 15,
      "start": 1244.2200317382812,
      "end": 1246.2200317382812,
      "text": " Then Saul, who also is called Paul,"
    },
    {
      "id": 16,
      "start": 1246.2200317382812,
      "end": 1249.2200317382812,
      "text": " filled with the Holy Ghost, set his eyes on him,"
    },
    {
      "id": 17,
      "start": 1249.2200317382812,
      "end": 1252.2200317382812,
      "text": " and said, O fool of all subtlety and all mischief,"
    },
    {
      "id": 18,
      "start": 1252.2200317382812,
      "end": 1255.2200317382812,
      "text": " thou child of the devil, thou enemy of all righteousness,"
    },
    {
      "id": 19,
      "start": 1255.2200317382812,
      "end": 1258.2200317382812,
      "text": " hope thou not cease to pervert the right ways of the Lord."
    },
    {
      "id": 20,
      "start": 1258.2200317382812,
      "end": 1260.2200317382812,
      "text": " And now, behold, the hand of the Lord is upon thee,"
    },
    {
      "id": 21,
      "start": 1260.2200317382812,
      "end": 1263.2200317382812,
      "text": " and thou shalt be blind, not seeing the sun for a season."
    },
    {
      "id": 22,
      "start": 1263.2200317382812,
      "end": 1266.2200317382812,
      "text": " And immediately there fell on him a mist and a darkness,"
    },
    {
      "id": 23,
      "start": 1266.2200317382812,
      "end": 1270.2200317382812,
      "text": " and he went about seeking some to lead him by the hand."
    },
    {
      "id": 24,
      "start": 1270.2200317382812,
      "end": 1273.2200317382812,
      "text": " That's an amazing sight, is it not?"
    },
    {
      "id": 25,
      "start": 1273.2200317382812,
      "end": 1276.2200317382812,
      "text": " The Bible says, Then the deputy, verse number 12,"
    },
    {
      "id": 26,
      "start": 1276.2200317382812,
      "end": 1277.2200317382812,
      "text": " When he saw what was done,"
    },
    {
      "id": 27,
      "start": 1277.2200317382812,
      "end": 1280.2200317382812,
      "text": " believed, being astonished at the doctrine of the Lord."
    },
    {
      "id": 28,
      "start": 1280.2200317382812,
      "end": 1282.2200317382812,
      "text": " As we begin to look at Acts 13"
    },
    {
      "id": 29,
      "start": 1282.2200317382812,
      "end": 1284.2200317382812,
      "text": " and kind of break it up very quickly this evening"
    },
    {
      "id": 30,
      "start": 1284.2200317382812,
      "end": 1287.2200317382812,
      "text": " and just briefly examine this passage of Scripture,"
    },
    {
      "id": 31,
      "start": 1287.2200317382812,
      "end": 1290.2200317382812,
      "text": " we find that as the mission that was assigned"
    },
    {
      "id": 32,
      "start": 1290.2200317382812,
      "end": 1292.2200317382812,
      "text": " to the church here in Antioch,"
    },
    {
      "id": 33,
      "start": 1292.2200317382812,
      "end": 1293.2200317382812,
      "text": " as that plan was embraced,"
    },
    {
      "id": 34,
      "start": 1293.2200317382812,
      "end": 1296.2200317382812,
      "text": " that really we find the evangelization"
    },
    {
      "id": 35,
      "start": 1296.2200317382812,
      "end": 1300.2200317382812,
      "text": " of this region of the world in which they are sent to,"
    },
    {
      "id": 36,
      "start": 1300.2200317382812,
      "end": 1302.2200317382812,
      "text": " and it begins with the island of Cyprus."
    },
    {
      "id": 37,
      "start": 1302.2200317382812,
      "end": 1305.2200317382812,
      "text": " But as we go further into the chapter,"
    },
    {
      "id": 38,
      "start": 1305.2200317382812,
      "end": 1306.2200317382812,
      "text": " beginning in verse number 13"
    },
    {
      "id": 39,
      "start": 1306.2200317382812,
      "end": 1310.2200317382812,
      "text": " and really going through Acts 14 and verse number 20,"
    },
    {
      "id": 40,
      "start": 1310.2200317382812,
      "end": 1313.2200317382812,
      "text": " you find that it then goes to the region of Galatia."
    },
    {
      "id": 41,
      "start": 1313.2200317382812,
      "end": 1315.2200317382812,
      "text": " And I mentioned that a few moments ago"
    },
    {
      "id": 42,
      "start": 1315.2200317382812,
      "end": 1317.2200317382812,
      "text": " when you read the book of Galatians,"
    },
    {
      "id": 43,
      "start": 1317.2200317382812,
      "end": 1319.2200317382812,
      "text": " you find that it says in the beginning,"
    },
    {
      "id": 44,
      "start": 1319.2200317382812,
      "end": 1323.2200317382812,
      "text": " opening verses unto the churches of Galatia."
    },
    {
      "id": 45,
      "start": 1323.2200317382812,
      "end": 1325.2200317382812,
      "text": " It's not written to the church of Galatia"
    },
    {
      "id": 46,
      "start": 1325.2200317382812,
      "end": 1327.2200317382812,
      "text": " because there were multiple churches there."
    },
    {
      "id": 47,
      "start": 1327.2200317382812,
      "end": 1330.2200317382812,
      "text": " And we find that here in Acts 13 and 14,"
    },
    {
      "id": 48,
      "start": 1330.2200317382812,
      "end": 1332.2200317382812,
      "text": " as you study this first missionary journey,"
    },
    {
      "id": 49,
      "start": 1332.2200317382812,
      "end": 1335.2200317382812,
      "text": " that you see how the gospel arrived"
    },
    {
      "id": 50,
      "start": 1335.2200317382812,
      "end": 1337.2200317382812,
      "text": " into those particular regions."
    },
    {
      "id": 51,
      "start": 1337.2200317382812,
      "end": 1340.2200317382812,
      "text": " You find that it's there in Acts 13 and verse number 14."
    },
    {
      "id": 52,
      "start": 1340.2200317382812,
      "end": 1342.2200317382812,
      "text": " It says, But when they departed from Perga,"
    },
    {
      "id": 53,
      "start": 1342.2200317382812,
      "end": 1345.2200317382812,
      "text": " they came to Antioch in Pisidia,"
    },
    {
      "id": 54,
      "start": 1345.2200317382812,
      "end": 1348.2200317382812,
      "text": " and went into the synagogue on the Sabbath day,"
    },
    {
      "id": 55,
      "start": 1348.2200317382812,
      "end": 1350.2200317382812,
      "text": " and sat down."
    },
    {
      "id": 56,
      "start": 1350.2200317382812,
      "end": 1352.2200317382812,
      "text": " And as they went in, the Bible says"
    },
    {
      "id": 57,
      "start": 1352.2200317382812,
      "end": 1354.2200317382812,
      "text": " that they were reading the law,"
    },
    {
      "id": 58,
      "start": 1354.2200317382812,
      "end": 1357.2200317382812,
      "text": " following the normal process of what would happen."
    },
    {
      "id": 59,
      "start": 1357.2200317382812,
      "end": 1359.2200317382812,
      "text": " And then there were some that said,"
    },
    {
      "id": 60,
      "start": 1359.2200317382812,
      "end": 1362.2200317382812,
      "text": " Ye men and brethren, if ye have any word of exhortation"
    },
    {
      "id": 61,
      "start": 1362.2200317382812,
      "end": 1364.2200317382812,
      "text": " for the people, say on."
    },
    {
      "id": 62,
      "start": 1364.2200317382812,
      "end": 1366.2200317382812,
      "text": " Then Paul stood up, and beckoning with his hands,"
    },
    {
      "id": 63,
      "start": 1366.2200317382812,
      "end": 1370.2200317382812,
      "text": " said, Men of Israel, and ye that fear God, give audience."
    },
    {
      "id": 64,
      "start": 1370.2200317382812,
      "end": 1372.2200317382812,
      "text": " And Paul begins to preach, and what does he preach?"
    },
    {
      "id": 65,
      "start": 1372.2200317382812,
      "end": 1376.2200317382812,
      "text": " He preaches the gospel of Jesus Christ."
    },
    {
      "id": 66,
      "start": 1376.2200317382812,
      "end": 1378.2200317382812,
      "text": " You can read through, and you can find"
    },
    {
      "id": 67,
      "start": 1378.2200317382812,
      "end": 1381.2200317382812,
      "text": " that in verse number 28, he deals with the death of Christ."
    },
    {
      "id": 68,
      "start": 1381.2200317382812,
      "end": 1384.2200317382812,
      "text": " In verse number 29, he deals with the burial of Christ."
    },
    {
      "id": 69,
      "start": 1384.2200317382812,
      "end": 1387.2200317382812,
      "text": " In verse 30, he deals with the resurrection of Christ."
    },
    {
      "id": 70,
      "start": 1387.2200317382812,
      "end": 1389.2200317382812,
      "text": " What is the gospel?"
    },
    {
      "id": 71,
      "start": 1389.2200317382812,
      "end": 1392.2200317382812,
      "text": " It is the death, burial, and resurrection of Jesus Christ."
    },
    {
      "id": 72,
      "start": 1392.2200317382812,
      "end": 1394.2200317382812,
      "text": " It is the good news. Amen?"
    },
    {
      "id": 73,
      "start": 1394.2200317382812,
      "end": 1397.2200317382812,
      "text": " We find that's exactly what Paul preaches."
    },
    {
      "id": 74,
      "start": 1397.2200317382812,
      "end": 1400.2200317382812,
      "text": " They come to this first city, Antioch and Pisidia,"
    },
    {
      "id": 75,
      "start": 1400.2200317382812,
      "end": 1403.2200317382812,
      "text": " and we find that he preaches the word of God."
    },
    {
      "id": 76,
      "start": 1403.2200317382812,
      "end": 1406.2200317382812,
      "text": " From there, they go to Iconium,"
    },
    {
      "id": 77,
      "start": 1406.2200317382812,
      "end": 1408.2200317382812,
      "text": " according to what we see in Acts 14."
    },
    {
      "id": 78,
      "start": 1408.2200317382812,
      "end": 1410.2200317382812,
      "text": " In verse number 1, it says,"
    },
    {
      "id": 79,
      "start": 1410.2200317382812,
      "end": 1412.2200317382812,
      "text": " And it came to pass in Iconium."
    },
    {
      "id": 80,
      "start": 1412.2200317382812,
      "end": 1414.2200317382812,
      "text": " Why did they leave?"
    },
    {
      "id": 81,
      "start": 1414.2200317382812,
      "end": 1416.2200317382812,
      "text": " Why was it that they moved on?"
    },
    {
      "id": 82,
      "start": 1416.2200317382812,
      "end": 1418.2200317382812,
      "text": " Well, in verse number 50 of Acts 13, it says,"
    },
    {
      "id": 83,
      "start": 1418.2200317382812,
      "end": 1421.2200317382812,
      "text": " But the Jews stirred up the devout and honorable women"
    },
    {
      "id": 84,
      "start": 1421.2200317382812,
      "end": 1423.2200317382812,
      "text": " and the chief men of the city,"
    },
    {
      "id": 85,
      "start": 1423.2200317382812,
      "end": 1425.2200317382812,
      "text": " and raised persecution against Paul and Barnabas,"
    },
    {
      "id": 86,
      "start": 1425.2200317382812,
      "end": 1430.2200317382812,
      "text": " and expelled them out of their coast."
    },
    {
      "id": 87,
      "start": 1430.2200317382812,
      "end": 1432.2200317382812,
      "text": " But here's the amazing thing."
    },
    {
      "id": 88,
      "start": 1432.2200317382812,
      "end": 1436.2200317382812,
      "text": " There were some people that got saved in Antioch and Pisidia."
    },
    {
      "id": 89,
      "start": 1436.2200317382812,
      "end": 1438.2200317382812,
      "text": " And as those people got saved,"
    },
    {
      "id": 90,
      "start": 1438.2200317382812,
      "end": 1440.2200317382812,
      "text": " there was a church that was established there."
    },
    {
      "id": 91,
      "start": 1440.2200317382812,
      "end": 1444.2200317382812,
      "text": " We find that Paul and those that were traveling with him,"
    },
    {
      "id": 92,
      "start": 1444.2200317382812,
      "end": 1447.2200317382812,
      "text": " Paul and Barnabas, we find that they depart,"
    },
    {
      "id": 93,
      "start": 1447.2200317382812,
      "end": 1450.2200317382812,
      "text": " and they now come to Iconium."
    },
    {
      "id": 94,
      "start": 1450.2200317382812,
      "end": 1452.2200317382812,
      "text": " And now, as they would be there in Iconium,"
    },
    {
      "id": 95,
      "start": 1452.2200317382812,
      "end": 1454.2200317382812,
      "text": " they would have the opportunity,"
    },
    {
      "id": 96,
      "start": 1454.2200317382812,
      "end": 1456.2200317382812,
      "text": " as God tells us in verse 7,"
    },
    {
      "id": 97,
      "start": 1456.2200317382812,
      "end": 1458.2200317382812,
      "text": " that there they preached the gospel."
    },
    {
      "id": 98,
      "start": 1458.2200317382812,
      "end": 1460.2200317382812,
      "text": " And the Bible tells us in verse number 3,"
    },
    {
      "id": 99,
      "start": 1460.2200317382812,
      "end": 1462.2200317382812,
      "text": " that they were, look at what it says,"
    },
    {
      "id": 100,
      "start": 1462.2200317382812,
      "end": 1464.2200317382812,
      "text": " Long time therefore abode they,"
    },
    {
      "id": 101,
      "start": 1464.2200317382812,
      "end": 1466.2200317382812,
      "text": " speaking boldly in the Lord."
    },
    {
      "id": 102,
      "start": 1466.2200317382812,
      "end": 1468.2200317382812,
      "text": " And so they're there preaching the gospel,"
    },
    {
      "id": 103,
      "start": 1468.2200317382812,
      "end": 1471.2200317382812,
      "text": " and now there's another city, another group of people,"
    },
    {
      "id": 104,
      "start": 1471.2200317382812,
      "end": 1473.2200317382812,
      "text": " that are being confronted with the gospel"
    },
    {
      "id": 105,
      "start": 1473.2200317382812,
      "end": 1476.2200317382812,
      "text": " where a church is going to be established."
    },
    {
      "id": 106,
      "start": 1476.2200317382812,
      "end": 1478.2200317382812,
      "text": " We find that the people of Iconium,"
    },
    {
      "id": 107,
      "start": 1478.2200317382812,
      "end": 1481.2200317382812,
      "text": " before long, they wanted to get rid of these guys as well."
    },
    {
      "id": 108,
      "start": 1481.2200317382812,
      "end": 1485.2200317382812,
      "text": " We find that the Bible tells us in verse number 17,"
    },
    {
      "id": 109,
      "start": 1485.2200317382812,
      "end": 1487.2200317382812,
      "text": " Nevertheless, he left not himself without witness,"
    },
    {
      "id": 110,
      "start": 1487.2200317382812,
      "end": 1490.2200317382812,
      "text": " and that he did good, and gave us rain from heaven,"
    },
    {
      "id": 111,
      "start": 1490.2200317382812,
      "end": 1492.2200317382812,
      "text": " and fruitful seasons, filling all our hearts"
    },
    {
      "id": 112,
      "start": 1492.2200317382812,
      "end": 1493.2200317382812,
      "text": " with food and gladness."
    },
    {
      "id": 113,
      "start": 1493.2200317382812,
      "end": 1496.2200317382812,
      "text": " And with these sayings, scarce restrained they the people,"
    },
    {
      "id": 114,
      "start": 1496.2200317382812,
      "end": 1498.2200317382812,
      "text": " that they had not done sacrifice unto them."
    },
    {
      "id": 115,
      "start": 1498.2200317382812,
      "end": 1500.2200317382812,
      "text": " But notice in verse number 19,"
    },
    {
      "id": 116,
      "start": 1500.2200317382812,
      "end": 1504.2200317382812,
      "text": " And there came thither certain Jews from where?"
    },
    {
      "id": 117,
      "start": 1504.2200317382812,
      "end": 1506.2200317382812,
      "text": " From Antioch and Iconium."
    },
    {
      "id": 118,
      "start": 1506.2200317382812,
      "end": 1508.2200317382812,
      "text": " And it says that they came,"
    },
    {
      "id": 119,
      "start": 1508.2200317382812,
      "end": 1510.2200317382812,
      "text": " and they persuaded the people,"
    },
    {
      "id": 120,
      "start": 1510.2200317382812,
      "end": 1513.2200317382812,
      "text": " and having stoned Paul, drew him out of the city,"
    },
    {
      "id": 121,
      "start": 1513.2200317382812,
      "end": 1515.2200317382812,
      "text": " supposing he had been dead."
    },
    {
      "id": 122,
      "start": 1515.2200317382812,
      "end": 1518.2200317382812,
      "text": " Howbeit, as the disciples stood round about him,"
    },
    {
      "id": 123,
      "start": 1518.2200317382812,
      "end": 1520.2200317382812,
      "text": " he rose up and came into the city,"
    },
    {
      "id": 124,
      "start": 1520.2200317382812,
      "end": 1524.2200317382812,
      "text": " and the next day he departed with Barnabas to Derbe."
    },
    {
      "id": 125,
      "start": 1524.2200317382812,
      "end": 1527.2200317382812,
      "text": " And I want you to just think about this for just a moment."
    },
    {
      "id": 126,
      "start": 1527.2200317382812,
      "end": 1530.2200317382812,
      "text": " We understand the mission, we understand the focus,"
    },
    {
      "id": 127,
      "start": 1530.2200317382812,
      "end": 1532.2200317382812,
      "text": " and we understand what's taking place,"
    },
    {
      "id": 128,
      "start": 1532.2200317382812,
      "end": 1536.2200317382812,
      "text": " and here as we see the progression and what's taking place,"
    },
    {
      "id": 129,
      "start": 1536.2200317382812,
      "end": 1538.2200317382812,
      "text": " and you understand the persecution"
    },
    {
      "id": 130,
      "start": 1538.2200317382812,
      "end": 1540.2200317382812,
      "text": " and that which they're dealing with,"
    },
    {
      "id": 131,
      "start": 1540.2200317382812,
      "end": 1543.2200317382812,
      "text": " and you find that the Bible tells us in verse number 20"
    },
    {
      "id": 132,
      "start": 1543.2200317382812,
      "end": 1547.2200317382812,
      "text": " that the next day they departed with Barnabas to Derbe,"
    },
    {
      "id": 133,
      "start": 1547.2200317382812,
      "end": 1549.2200317382812,
      "text": " and it says in verse 21,"
    },
    {
      "id": 134,
      "start": 1549.2200317382812,
      "end": 1552.2200317382812,
      "text": " And when they had preached the gospel to that city,"
    },
    {
      "id": 135,
      "start": 1552.2200317382812,
      "end": 1553.2200317382812,
      "text": " and had taught many,"
    },
    {
      "id": 136,
      "start": 1553.2200317382812,
      "end": 1557.2200317382812,
      "text": " they returned again to Lystra, and to Iconium, and Antioch."
    },
    {
      "id": 137,
      "start": 1557.2200317382812,
      "end": 1560.2200317382812,
      "text": " I just want you to think here this evening"
    },
    {
      "id": 138,
      "start": 1560.2200317382812,
      "end": 1563.2200317382812,
      "text": " about this first missionary journey,"
    },
    {
      "id": 139,
      "start": 1563.2200317382812,
      "end": 1566.2200317382812,
      "text": " and as we consider the truth"
    },
    {
      "id": 140,
      "start": 1566.2200317382812,
      "end": 1569.2200317382812,
      "text": " of what Jesus said to the disciples in Matthew 9,"
    },
    {
      "id": 141,
      "start": 1569.2200317382812,
      "end": 1572.2200317382812,
      "text": " and couple it with this passage in Acts 13,"
    },
    {
      "id": 142,
      "start": 1572.2200317382812,
      "end": 1574.2200317382812,
      "text": " When Jesus said to the disciples,"
    },
    {
      "id": 143,
      "start": 1574.2200317382812,
      "end": 1576.2200317382812,
      "text": " he was moved with compassion, why?"
    },
    {
      "id": 144,
      "start": 1576.2200317382812,
      "end": 1577.2200317382812,
      "text": " Because he saw the multitudes,"
    },
    {
      "id": 145,
      "start": 1577.2200317382812,
      "end": 1580.2200317382812,
      "text": " that they were as sheep scattered without a shepherd."
    },
    {
      "id": 146,
      "start": 1580.2200317382812,
      "end": 1581.2200317382812,
      "text": " And he says to them,"
    },
    {
      "id": 147,
      "start": 1581.2200317382812,
      "end": 1587.2200317382812,
      "text": " Truly the harvest is plenteous, but the laborers are few."
    },
    {
      "id": 148,
      "start": 1587.2200317382812,
      "end": 1589.2200317382812,
      "text": " Pray ye therefore that the Lord of the harvest"
    },
    {
      "id": 149,
      "start": 1589.2200317382812,
      "end": 1593.2200317382812,
      "text": " would send forth laborers into his harvest."
    },
    {
      "id": 150,
      "start": 1593.2200317382812,
      "end": 1596.2200317382812,
      "text": " And here, they were sent forth."
    },
    {
      "id": 151,
      "start": 1596.2200317382812,
      "end": 1598.2200317382812,
      "text": " I believe that beginning here,"
    },
    {
      "id": 152,
      "start": 1598.2200317382812,
      "end": 1600.2200317382812,
      "text": " all the way to present day,"
    },
    {
      "id": 153,
      "start": 1600.2200317382812,
      "end": 1604.2200317382812,
      "text": " God is sending forth his laborers."
    },
    {
      "id": 154,
      "start": 1604.2200317382812,
      "end": 1607.2200317382812,
      "text": " And we as the people of God need to be praying."
    },
    {
      "id": 155,
      "start": 1607.2200317382812,
      "end": 1611.2200317382812,
      "text": " It needs to be part of our daily prayer list, if you will,"
    },
    {
      "id": 156,
      "start": 1611.2200317382812,
      "end": 1615.2200317382812,
      "text": " that we're praying that God would send forth laborers."
    },
    {
      "id": 157,
      "start": 1615.2200317382812,
      "end": 1619.2200317382812,
      "text": " And then, as God calls, just as he called here"
    },
    {
      "id": 158,
      "start": 1619.2200317382812,
      "end": 1622.2200317382812,
      "text": " in this passage of scripture, Paul and Barnabas,"
    },
    {
      "id": 159,
      "start": 1622.2200317382812,
      "end": 1625.2200317382812,
      "text": " the church then has a role in helping"
    },
    {
      "id": 160,
      "start": 1625.2200317382812,
      "end": 1628.2200317382812,
      "text": " that ministry be fulfilled."
    },
    {
      "id": 161,
      "start": 1628.2200317382812,
      "end": 1629.2200317382812,
      "text": " And what a joy."
    },
    {
      "id": 162,
      "start": 1629.2200317382812,
      "end": 1631.2200317382812,
      "text": " I understand that God's not going to call all of us."
    },
    {
      "id": 163,
      "start": 1631.2200317382812,
      "end": 1635.2200317382812,
      "text": " It would be wonderful if God would call one of us,"
    },
    {
      "id": 164,
      "start": 1635.2200317382812,
      "end": 1638.2200317382812,
      "text": " some of us, but then those of us"
    },
    {
      "id": 165,
      "start": 1638.2200317382812,
      "end": 1640.2200317382812,
      "text": " that are still part of this fellowship,"
    },
    {
      "id": 166,
      "start": 1640.2200317382812,
      "end": 1644.2200317382812,
      "text": " we then can come alongside and assist."
    },
    {
      "id": 167,
      "start": 1644.2200317382812,
      "end": 1646.2200317382812,
      "text": " These individuals that will be with us,"
    },
    {
      "id": 168,
      "start": 1646.2200317382812,
      "end": 1648.2200317382812,
      "text": " that have been with us in the past,"
    },
    {
      "id": 169,
      "start": 1648.2200317382812,
      "end": 1649.2200317382812,
      "text": " that are missionaries,"
    },
    {
      "id": 170,
      "start": 1650.2200317382812,
      "end": 1654.2200317382812,
      "text": " we find that they are sent out."
    },
    {
      "id": 171,
      "start": 1654.2200317382812,
      "end": 1656.2200317382812,
      "text": " They were sitting in a pew, like you are,"
    },
    {
      "id": 172,
      "start": 1656.2200317382812,
      "end": 1659.2200317382812,
      "text": " at some point in their lives, and God said,"
    },
    {
      "id": 173,
      "start": 1659.2200317382812,
      "end": 1662.2200317382812,
      "text": " God called them to the ministry, and they prepared,"
    },
    {
      "id": 174,
      "start": 1662.2200317382812,
      "end": 1667.2200317382812,
      "text": " and now they give us an opportunity to partner with them"
    },
    {
      "id": 175,
      "start": 1667.2200317382812,
      "end": 1670.2200317382812,
      "text": " as they go to the place that they've been assigned to"
    },
    {
      "id": 176,
      "start": 1670.2200317382812,
      "end": 1672.2200317382812,
      "text": " to carry forth the gospel."
    },
    {
      "id": 177,
      "start": 1672.2200317382812,
      "end": 1674.2200317382812,
      "text": " Lord willing, we'll have the opportunity to look"
    },
    {
      "id": 178,
      "start": 1674.2200317382812,
      "end": 1676.2200317382812,
      "text": " next week at the end of Acts 14."
    },
    {
      "id": 179,
      "start": 1676.2200317382812,
      "end": 1678.2200317382812,
      "text": " It's an exciting passage of scripture"
    },
    {
      "id": 180,
      "start": 1678.2200317382812,
      "end": 1680.2200317382812,
      "text": " because what you find at the end of Acts 14"
    },
    {
      "id": 181,
      "start": 1680.2200317382812,
      "end": 1683.2200317382812,
      "text": " is the return from this first missionary journey."
    },
    {
      "id": 182,
      "start": 1683.2200317382812,
      "end": 1685.2200317382812,
      "text": " And you see as they return,"
    },
    {
      "id": 183,
      "start": 1685.2200317382812,
      "end": 1687.2200317382812,
      "text": " and just the connection that they have"
    },
    {
      "id": 184,
      "start": 1687.2200317382812,
      "end": 1689.2200317382812,
      "text": " and all that they discuss,"
    },
    {
      "id": 185,
      "start": 1689.2200317382812,
      "end": 1691.2200317382812,
      "text": " and what a wonderful blessing it is."
    },
    {
      "id": 186,
      "start": 1691.2200317382812,
      "end": 1693.2200317382812,
      "text": " And we find that here, as we would consider"
    },
    {
      "id": 187,
      "start": 1693.2200317382812,
      "end": 1695.2200317382812,
      "text": " this first missionary journey,"
    },
    {
      "id": 188,
      "start": 1695.2200317382812,
      "end": 1697.2200317382812,
      "text": " very briefly overviewing chapter 13"
    },
    {
      "id": 189,
      "start": 1697.2200317382812,
      "end": 1699.2200317382812,
      "text": " and getting into chapter number 14,"
    },
    {
      "id": 190,
      "start": 1699.2200317382812,
      "end": 1702.2200317382812,
      "text": " that really this work was the result"
    },
    {
      "id": 191,
      "start": 1702.2200317382812,
      "end": 1707.2200317382812,
      "text": " of them embracing the mission that was given to them."
    },
    {
      "id": 192,
      "start": 1707.2200317382812,
      "end": 1711.2200317382812,
      "text": " The assignment, the task that was assigned"
    },
    {
      "id": 193,
      "start": 1711.2200317382812,
      "end": 1713.2200317382812,
      "text": " there at the beginning of Acts 13."
    },
    {
      "id": 194,
      "start": 1713.2200317382812,
      "end": 1715.2200317382812,
      "text": " Because they embraced it,"
    },
    {
      "id": 195,
      "start": 1715.2200317382812,
      "end": 1718.2200317382812,
      "text": " because they said we're going to fulfill,"
    },
    {
      "id": 196,
      "start": 1718.2200317382812,
      "end": 1720.2200317382812,
      "text": " we're going to be obedient to the plan"
    },
    {
      "id": 197,
      "start": 1720.2200317382812,
      "end": 1722.2200317382812,
      "text": " that's been revealed to us,"
    },
    {
      "id": 198,
      "start": 1722.2200317382812,
      "end": 1724.2200317382812,
      "text": " we then have the privilege of seeing"
    },
    {
      "id": 199,
      "start": 1724.2200317382812,
      "end": 1726.2200317382812,
      "text": " how the gospel goes forth"
    },
    {
      "id": 200,
      "start": 1726.2200317382812,
      "end": 1728.2200317382812,
      "text": " and how churches are established."
    },
    {
      "id": 201,
      "start": 1728.2200317382812,
      "end": 1731.2200317382812,
      "text": " And it's an absolute blessing to study the word of God"
    },
    {
      "id": 202,
      "start": 1731.2200317382812,
      "end": 1735.2200317382812,
      "text": " and to see how God's plan works."
    },
    {
      "id": 203,
      "start": 1735.2200317382812,
      "end": 1737.2200317382812,
      "text": " It shouldn't surprise us, by the way,"
    },
    {
      "id": 204,
      "start": 1737.2200317382812,
      "end": 1739.2200317382812,
      "text": " that God's plan works, amen?"
    },
    {
      "id": 205,
      "start": 1739.2200317382812,
      "end": 1742.2200317382812,
      "text": " He's God, of course his plan is going to work."
    },
    {
      "id": 206,
      "start": 1742.2200317382812,
      "end": 1744.2200317382812,
      "text": " So we have the privilege of getting in line"
    },
    {
      "id": 207,
      "start": 1744.2200317382812,
      "end": 1747.2200317382812,
      "text": " and in step with what God has given us to do"
    },
    {
      "id": 208,
      "start": 1747.2200317382812,
      "end": 1751.2200317382812,
      "text": " and then seeing what only God can do."
    },
    {
      "id": 209,
      "start": 1751.2200317382812,
      "end": 1755.2200317382812,
      "text": " Sent forth, he said, pray,"
    },
    {
      "id": 210,
      "start": 1755.2200317382812,
      "end": 1758.2200317382812,
      "text": " the Lord of the harvest that he would send forth laborers."
    },
    {
      "id": 211,
      "start": 1758.2200317382812,
      "end": 1761.2200317382812,
      "text": " I hope that we're praying to that end."
    },
    {
      "id": 212,
      "start": 1761.2200317382812,
      "end": 1764.2200317382812,
      "text": " And I hope this evening that as we see"
    },
    {
      "id": 213,
      "start": 1764.2200317382812,
      "end": 1766.2200317382812,
      "text": " those that would be sent forth,"
    },
    {
      "id": 214,
      "start": 1766.2200317382812,
      "end": 1768.2200317382812,
      "text": " even as Paul and Barnabas were sent forth,"
    },
    {
      "id": 215,
      "start": 1768.2200317382812,
      "end": 1771.2200317382812,
      "text": " that we would continue to pray for them"
    },
    {
      "id": 216,
      "start": 1771.2200317382812,
      "end": 1773.2200317382812,
      "text": " and then be engaged and involved"
    },
    {
      "id": 217,
      "start": 1773.2200317382812,
      "end": 1775.2200317382812,
      "text": " on how we could support them"
    },
    {
      "id": 218,
      "start": 1775.2200317382812,
      "end": 1778.2200317382812,
      "text": " in fulfilling the ministry that God has given them specifically."
    },
    {
      "id": 219,
      "start": 1778.2200317382812,
      "end": 1779.2200317382812,
      "text": " Let's pray together."
    },
    {
      "id": 220,
      "start": 1779.2200317382812,
      "end": 1780.2200317382812,
      "text": " Father, we love you."
    },
    {
      "id": 221,
      "start": 1780.2200317382812,
      "end": 1781.2200317382812,
      "text": " We thank you for loving us."
    },
    {
      "id": 222,
      "start": 1781.2200317382812,
      "end": 1783.2200317382812,
      "text": " We thank you for the word of God."
    },
    {
      "id": 223,
      "start": 1783.2200317382812,
      "end": 1785.2200317382812,
      "text": " What a blessing and privilege it is"
    },
    {
      "id": 224,
      "start": 1785.2200317382812,
      "end": 1789.2200317382812,
      "text": " to read about the instruction"
    },
    {
      "id": 225,
      "start": 1789.2200317382812,
      "end": 1791.2200317382812,
      "text": " that you gave there to your disciples"
    },
    {
      "id": 226,
      "start": 1791.2200317382812,
      "end": 1793.2200317382812,
      "text": " in Matthew 9."
    },
    {
      "id": 227,
      "start": 1793.2200317382812,
      "end": 1796.2200317382812,
      "text": " We are grateful for the record."
    },
    {
      "id": 228,
      "start": 1796.2200317382812,
      "end": 1799.2200317382812,
      "text": " We're moved even as our Savior"
    },
    {
      "id": 229,
      "start": 1799.2200317382812,
      "end": 1801.2200317382812,
      "text": " was moved with compassion."
    },
    {
      "id": 0,
      "start": 1801.2200317382812,
      "end": 1812.4200315475464,
      "text": " passion and we are understanding that we're living in a time in which the world is confused"
    },
    {
      "id": 1,
      "start": 1812.4200315475464,
      "end": 1817.2800312042236,
      "text": " and the church has the answers."
    },
    {
      "id": 2,
      "start": 1817.2800312042236,
      "end": 1822.5000324249268,
      "text": " God I pray that you would help us even as the church at Antioch there in Acts 13 embraced"
    },
    {
      "id": 3,
      "start": 1822.5000324249268,
      "end": 1824.900032043457,
      "text": " the plan that you revealed to them."
    },
    {
      "id": 4,
      "start": 1824.900032043457,
      "end": 1827.5000324249268,
      "text": " I pray God that you would help us."
    },
    {
      "id": 5,
      "start": 1827.5000324249268,
      "end": 1833.7000312805176,
      "text": " I pray that over the next 10 days as we not only physically and mentally but most importantly"
    },
    {
      "id": 6,
      "start": 1833.7000312805176,
      "end": 1838.340030670166,
      "text": " spiritually prepare for our missions conference that it would work in each of our lives."
    },
    {
      "id": 7,
      "start": 1838.340030670166,
      "end": 1846.0600318908691,
      "text": " I pray that we would be ready for the meeting that we'll have and that we'll be prepared"
    },
    {
      "id": 8,
      "start": 1846.0600318908691,
      "end": 1854.300033569336,
      "text": " to receive the challenges that will be delivered."
    },
    {
      "id": 9,
      "start": 1854.300033569336,
      "end": 1858.2200317382812,
      "text": " God we pray that you'd work in our midst and that you alone would be glorified."
    },
    {
      "id": 10,
      "start": 1858.2200317382812,
      "end": 1859.7200317382812,
      "text": " We thank you for the privilege of prayer."
    },
    {
      "id": 11,
      "start": 1859.7200317382812,
      "end": 1864.5800323486328,
      "text": " We pray that as we now have our time of prayer this evening I pray that you'd bless each"
    },
    {
      "id": 12,
      "start": 1864.5800323486328,
      "end": 1865.5800323486328,
      "text": " aspect of it."
    },
    {
      "id": 13,
      "start": 1865.5800323486328,
      "end": 1871.1200332641602,
      "text": " We do thank you for the unique privilege that we have to come boldly before your throne"
    },
    {
      "id": 14,
      "start": 1871.1200332641602,
      "end": 1874.2200317382812,
      "text": " knowing that you hear and answer."
    },
    {
      "id": 15,
      "start": 1874.2200317382812,
      "end": 1878.6200332641602,
      "text": " We pray God that you alone would be glorified for it's in Christ's name we pray, amen."
    }
  ],
  "processed_at": "2025-04-17T06:21:50.997850"
}