{
  "video_id": "YEDoYu2HKC8",
  "text": "so much about the spirit of a church. And I have just so appreciated the music and the way that it's been done, but also the music that has been done. I love songs that are theologically correct, harmonious in their sound, and played by people who understand what they're singing and playing in living it out. So it's been a real blessing to me. I have enjoyed Fellowship Baptist Church this week. I haven't seen you. Maybe that's why I've enjoyed you so much. I don't know. And maybe you feel the same about me. All you've had to do is put up with me for, I always say 30 minutes a night, and then my wife will hit me with her elbow and say, never 30, always 40. And so it's probably been much longer than 30 minutes. But thank you for tuning in. Thank you for the few that are able to be here and are here tonight. I just want you to know that it's been a real blessing to me. I love your pastor and his family, and love the opportunity to be here. Take your Bible if you would, and while you're turning to Psalm 63, let me say this. I'm going to preach a very elementary message tonight. Now, elementary doesn't mean that it's not a much needed message. And the truth is that as you listen to this message, you may be tempted to say to yourself, well, everybody knows that. I know that. The question isn't, do we know it? The question is, is it part of our lives? Have we appropriated it? Is it a part of the discipline of our lives? I hope you'll ask yourself that question as we consider these things tonight. Notice with me in Psalm 63 and verse one. Oh God, thou art my God. Early will I seek thee. My soul thirsteth for thee. My flesh longeth for thee in a dry and thirsty land where no water is. See thy power and thy glory. So as I have seen thee in the sanctuary, because thy loving kindness is better than life, my lips shall praise thee. And thus will I bless thee while I live. I will lift up my hands in thy name. My soul shall be satisfied as with marrow and fatness, and my mouth shall praise thee with joyful lips. When I remember thee upon my bed and meditate on thee in the night watches, because thou has been my help, therefore in the shadow of thy wings will I rejoice. My soul followeth hard after thee. Thy right hand upholdeth me. Let's pray. Father, we thank you for the beauty of these words and for the meaning of these words for our lives. Thank you for what you taught David and what David now teaches us through your Holy Spirit. And I pray, Lord, that as elementary as this is, that God, you would convict our hearts that knowing it is not the same as the discipline of life that accomplishes it. So convict us. Our desire is to seek you because we want to know you. The greatest need we have in our lives is to know you more. And I pray tonight that you would help us to see that. I pray for those who may be under the sound of my voice who have never been saved. Lord, I ask you to convince them of their need, their sin, but also, Lord, would you convince them that you love them and that you want them. So Lord, do a work in our hearts. Thank you for this opportunity. Thank you for this technology that we can be together. If not in the same place, we can be together in your word and hear this preaching. Blessed we pray in Jesus' name, amen. If I could choose a word that I think describes our generation, that word would be something like stress. I think pressure might be the thought as well. I've lived a few years, and to be honest with you, I don't think I've ever lived in a generation that is under more perceived and real stress than this generation. We live in a time where our children feel pressured. Everything from science to soccer, they've got to excel in. We live in a time where it seems like life has speeded up. If they create one more time-saving device, I'm not buying it because I don't have any more time for time-saving devices. We have family problems, economic problems, political problems, world problems. Have you noticed that? And I'm not saying that to try to discourage anyone. They are stressful times, and there is an incredible amount of pressure on every life, but I'm saying it for this reason. If we're not careful, if we are not purposeful, if we're not intentional, we will let the pressure and the stress that life in this world brings set the direction for our life instead of intentionally allowing God to set the direction for our lives. We come tonight and we are in a revival meeting. And I sometimes ask myself, well, what is revival? Is revival evangelism? It's certainly an aspect. We certainly should move towards an evangelistic spirit if we indeed have revived hearts. But I would suggest to you that a revival is believers looking down into their own hearts and examining their own lives and answering some very vital questions from the Lord to us, and that revival can really be understood in this thought. A renewed seeking of the Lord. A renewed seeking of the Lord. I wanna do a little exercise here. 244 times in the Bible, the word seek is used. I'm not going to read all 244. And I'll be honest with you, not all 244 times does the word seek refer to seeking the Lord. But by far the vast majority of times, perhaps 225 to 30, it is used and it is in reference to God's people seeking the Lord. Let me read just a couple of those to you. 1 Chronicles 16 and verse 10. Glory ye in his holy name. Let the heart of them rejoice that seek the Lord. Psalm 105 verse four, seek the Lord and his strength. Seek his face forevermore. Psalm 40 verse 16, let all those that seek thee rejoice and be glad in thee. Let such as love thy salvation say continually, the Lord be magnified. Psalm 119 and verse two, blessed are they that keep his testimonies and that seek him with the whole heart. Hebrews 11 and verse six, but without faith it is impossible to please him. For he that cometh to God must believe that he is and he is a rewarder of them that diligently seek him. Matthew 6.33, but seek ye first the kingdom of God and his righteousness and all these things shall be added unto you. And then a verse that we often consider during our revival time, 2 Chronicles 7.14. If my people, which are called by my name, shall humble themselves and pray and seek my face and turn from their wicked ways, then will I hear from heaven and will forgive their sin and heal their land. I don't think I can overstate tonight the importance of this thought in reference to revival. If God's people do not seek him, then they will not be saved. If God's people do not seek him, then they will not be saved. seek Him. If our lives are directed by the pressure and the direction of the world that the world sends us, no matter what our intentions are, if our direction is set by the world and we are not intentionally and purposefully seeking the Lord, can I be very honest with you tonight? Revival won't come. Revival will not come in the halls of Congress. Revival won't come in the Capitol at Richmond. Revival won't come because of an economic resurgence. Revival comes only when God's people are revived. Sometimes I think we look in all the wrong places, and the place to look for revival is in my heart, in your heart. When we set ourselves again to seek the Lord amidst all the pressure of schedules, society, success, you and I must cause ourselves to keep the right things a priority in our lives. When we come to Psalm 63, David gives us a wonderful example of that. I want you to understand that David was a man who understood pressure. He understood the pressure of leadership. He was leading a kingdom, leading armies. David understood the pressure of problems. Goodness, he had many, many difficult things in his life, some of his own making. And yet one of the things that I so love about David is that in his life he was intentional. He was purposeful in the thought that he would seek the Lord. The Lord would have priority in his life. When we come to Psalm 63, David is not in the palace. When we come to Psalm 63, David is not in the temple rejoicing as the Levites sing hymns of worship. When we come to Psalm 63, I want you to understand as it says in the inscription in the psalm, he was in the wilderness of Judah. If you've been to the Holy Land, you know that the wilderness of Judah is an accurate description of the land of Judah. It is an arid place, hot during the day, cold at night. And again, there is not, there are certainly places of oasis, but water is far apart, and vegetation is sparse, and it is a difficult place to survive. David is in the wilderness of Judah because just a day before, his own son Absalom has raised rebellion against him and has taken the gates of Jerusalem and as he is proceeding through the city, hunting down his father, David and a few of his family are able to escape and down over Brook Kidron and out into the wilderness, unprepared, unsupplied. They find themselves in the wilderness of Judea. If I understand strategy of those days, David would have separated himself from Abigail and from Bathsheba and from his children that were out with him. He would have put them in one place, hoping that if Absalom found him, he would slay him and care not about the kids. And so when we come to Psalm 63, I believe the scene that we have is David awaiting daylight. David with the weight of his world on his shoulders, David with decisions to be made about provision and about protection, about where to go, where to hide, what to do, who to trust, who not to trust, and in the midst of all those pressing matters, David says, Oh God, thou art my God. Early will I seek thee. And in the midst of this catastrophe, David says, I know what's important. All the things I have to attend to, I don't have the wisdom to do until I have sought the mind of God. And I cannot let the urgency of schedule push me away from the necessity of knowing the mind of God. And so in that morning, in that cold place, perhaps the mouth of a cave or under the outcropping of a rock or maybe finding a sparse tree and lying down beneath it for the night, in the morning he looks for the sun because he wants to cry out to his God for direction. Oh God, I'm going to seek thee. I want to give you two simple thoughts tonight. Number one, what is it to seek God? Number two, how is it a believer seeks the Lord? Number one, what does it mean to seek after God? Three thoughts under that. Number one, to seek God first requires that we have a personal relationship with the Lord. Would you hear me tonight? None of us sought the Lord before he sought us. None of us were of such wonderful righteousness. None of us sought the Lord until he sought us. I'm so thankful that in February of 1975, the Lord found me. And the wonderful privilege of knowing that Jesus Christ, the Son of God, loved me, a sinful man, not only by nature but by practice. I inherited my sin nature, but I employed it as well. I'm guilty. And that God so loved a man like me that he would come, a lost sheep, really a life that had no meaning, that he should care about it, but he loved me in such a way that he left heaven and came to sinful earth, and emptied himself of his right to be worshipped and treated as God, and took upon himself the form of a servant, and was obedient to the will of his Father even unto death, even the death of the cross. And there on that cross, in a transaction that we will not fully understand until we stand in heaven in front of him, he suffered for me and died and bled for me. And in that moment, if I look to him and confess that my sin put him on that cross, and I call out to him using my mouth from a heart that believes, and I call upon him, will you save me? He will. And my sin is placed on him and judged in him, and his righteousness is placed on me, and God sees no longer my sinfulness but the righteousness of his Son. I want to tell you, I've been saved a while now. I've been saved since 1975. That's a long time. I'm not over it yet. I'm not over. You see, I know what I was when God found me. We used to have a statement, I'm born and raised in Cincinnati, Ohio, and I've lived before there were shopping malls, and if you were going to go shopping, you went downtown. And if you were in Edwards, it meant that you didn't have much money to go shopping at all. And when we would go to Shillito's, that was the department store, we would not go in on the first floor. That's where the people that had money bought. No, no, the Edwards is shopped in the bargain basement. And you know where Jesus found me? He found me in the bargain basement and lifted me out of that. And I'm not over it. And whoever you are and wherever you are tonight, Jesus loves you, and he came for you. And it is as effective in 2021 as it was in 1975, as it was in the great revival meetings of the century of the 1800s, the Great Awakening, and as much as it ever has been, it is true today. If you will but admit your sin and call upon Jesus to be your Savior, he will save you. And then an incredible privilege is yours. Because he sought you and found you, you now have the privilege of seeking and knowing and becoming like him. And it ought to be the passion... pursuit of every believer's life, to desire to know Him, to really know Him. I remember when I first saw my wife, I was eating a, you don't need to know this, but now I'm telling you, I'm an old man and we're allowed to tell stories. And I was in the chemistry hall at the University of Cincinnati, I was eating my lunch sitting on the floor, and she walked in the door a vision of loveliness. And for me it was love at first sight, I'm not kidding about that. It was not for her, I had to work at it, but we got around to it. But my point of telling you that is, is I spent near 50 years now getting to know her, wanting to know her, understanding the things that she loves, and understanding what makes her happy and what makes her sad. And I want to know all about her. Hey, that same pursuit ought to be in the heart of believers. I want to know Him. Several years ago, Dr. Clarence Sexton called me and he said, Mike, I've been invited to the White House. There's a meeting of Christian college presidents, we're going to meet with President Bush at the White House. I don't know how to get over to the White House. Will you pick me up at National Airport? Will you drive me over to the White House and I'll get you into that meeting? And I said, Preacher, I'll be glad to pick you up. You're not going to get me in that meeting, but I'll be glad to pick you up, take you to the White House, wait for you, and take you back. Well, lo and behold, he got me in the meeting. And when we came into a room, about 25 seats, they sat me right there in front of the presidential lectern. And when President Bush came in, I don't know why, but he made eye contact with me and he talked as if he was talking to me the whole time. I mean, we were just being buddies there. He's looking at me, I'm looking at him. Hour and eight minutes, he talks. When he gets done talking, he comes down around the pleasant presidential lectern, down one step, comes to my seat, takes my hand, lifts me up, and shakes my hand. I am convinced he thought I was Rush Limbaugh. As he's shaking my hand, I see a camera flash. About a week later, my secretary called my office and said, Hey, the White House is on the phone. And I said, Right, sure. I took the call and it was the photographer of the White House. And he said, Were you in a blue suit and a gold tie when you shook President's hand? I said, Yes, I was. He said, Well, Reverend Edwards, the President wants to send you something. About two weeks after that, I got in the mail a beautifully framed picture of me shaking the hand of President George Bush. And he's written on the photograph, Reverend Edwards, thanks for what you do. Pray for me. Appreciate the opportunity to meet you. Now, I tell you all that to tell you this. President Bush and I are very close friends. We're not close friends. He wouldn't know me if he saw me. If I bumped into him on the street, I would get arrested. No, if I were to know President Bush, it would mean that I would have to sit down with him and converse with him. I would have to hear him say what he thought about things and felt about things. I would have to give him a view of my heart. I would have to ask him questions. I would have to have lengthy talks with him to know him. You know one of my great fears for our generation of believers? We have become satisfied with a handshake with Jesus. It's all we have time for, because we're stressed and we're pressured and and we're busy and we've got to be here and we've got to be there, and our intention is always to know him. And we even dedicate a couple hours a week to go to church to learn of him. But there needs to be a passion to sit down and be spoken to and to speak to to know him. Secondly, not only must we have that passion, there has to be a desire to know more of him, following on with that thought. David had the Lord, but he wanted to know more of the Lord. That phrase in verse 1, early will I seek thee, has the thought of urgently awaiting dawn, because you want something to take place. I have three children, all grown and married and have seven grandkids, but my children were normal children. They were very obedient and pleased us and pleased the Lord. But they didn't always want to get up early, and I can remember one morning each year where they were always ready to get up. As a matter of fact, I would fool around with them and I'd say the night before, I'd say, you know, boy I'm not going in the office tomorrow, I'm tired and I'm just gonna sleep till 10 or 11 o'clock. I've never done that in my life, but they'd go, oh dad, don't do that. And I'd hear the pitter-patter of little feet at about 5 or 5.30 or 6, and they would go sit on the steps and Melissa, our oldest, would say to the boys, don't make noise or he'll never get up. And then we'd get up and man they'd run downstairs. Can I ask you a question? What morning of the year was that? It was Christmas morning. Why were they excited about getting up? Because there was something waiting for them. There was something new, something they desired, there was something that excited them. Can I ask you this question and answer yourself honestly, when was the last time you approached the Word of God with anywhere near that excitement, that desire, that sureness that something new was there and it was going to grip your heart, grip your soul, and it was going to make a difference in what you did that day and in your life as you move forward? Where has that gone? And can I say to you I fear that most believers, because of the pressure and the schedule and the time and the pace, have lost the fervency of seeking the Lord in His Word, in the quiet of His Word. A.W. Tozer said this, and I quote, complacency is a deadly foe of all spiritual growth. Come near to the holy men and women of the past and you will soon feel the heat of their desire after God. They mourned for Him, they prayed and wrestled and sought for Him day and night, in season and out, and when they had found Him the finding was all the sweeter for the long-seeking. You see, we have found so many other avenues to be satisfied in, so many other venues, so much other media, that in truth we don't even consider the absolute wonder of meeting God in quiet and allowing Him to speak to us. There's always more to know. There's always ways that we can grow. May we never come to the place where we think there is not something else for us to learn, some other way for us to grow and mature. We never arrive, and every morning, every day, should be a passionate search to know Him more and to be more like Him. Here's number three, it's understanding that only God can fulfill the needs of our heart. Look at verse two a moment. I'm sorry, verse one, O God, thou art my God, early will I seek thee, my soul thirsteth for thee, my flesh longeth for thee in a dry and thirsty land where no water is. Our schedules push us past our time with God, and we think that in the excitement of the day or the busyness of the day we will find that which satisfies us, and the truth is we arrive home late in the evening exhausted physically and mentally and as unsatisfied as when we left and rushed into the day. David understood something, that if the Lord wasn't in it, it didn't satisfy. Hey, he's lost the palace. He's not in the palace. He's lost his armies. He's lost his servants. He's lost his staff. He has been reduced to nothing, and yet in this place we find him willing to seek the Lord, because David had made a realization in his life that satisfaction never was in having a palace, that it never could be found in leading armies. As a matter of fact, he came to understand that leading armies was really tough work that you didn't want to do. I'm old enough to have lived through several bubbles, I think most people in this room are. You remember the stock bubble, the tech stock bubble, the 1980, 1998? All you got to do is buy a hundred shares of Cisco, Oracle, or Microsoft, and you will be a millionaire! And I watched people leverage themselves to buy stock, to buy stock, to buy stock, and then the bubble went pop. You remember the housing bubble? Ooh, I was in the DC area in those days, and I would have people come to me, and they'd say, Preacher, you just don't understand, and we never do, but they would say, I'm gonna buy this $750,000 house, now I've got $10,000 to put down, and I'm gonna leverage the rest, and I'd say that's not wise, that's not wise, that's not wise, and they'd say, no, it's gonna continue to appreciate, I'm gonna flip it in two years and make a quarter mill! Pop. And the house they bought for $750,000 was worth four. You say, Preacher, does this have a point? Yeah. Stop looking for it in the world. Stop looking for satisfaction in what you have. Stop looking for satisfaction in what you do in your career. I'm not saying be bad at your career, I'm not saying don't be secure, I'm saying to you that's not where your passion ought to lie! Because satisfaction is in Him, and when you lose the palace, you don't lose Him, and when the stock blows up, you don't lose Him, because He is where satisfaction, that's what our flesh should long for. Very quickly, I've been too long, how does a person seek after God? Okay, Lord, or Preacher, I get it. Seeking after the Lord is to know Him, to desire to know more of Him, and to realize that knowing Him and having Him is where real satisfaction is. Okay, how do I get it done? How do I seek the Lord? Three thoughts, very quickly. Number one, keep a passion for God. Keep a passion for God. I love what David says in verse 8, my soul followeth hard after thee, thy right hand upholdeth me. What does David mean, I follow hard after the Lord? What does that even mean? And can I suggest to you that every person in this room knows what it means? If we were to take a Strong's Concordance and look at it, we would find that that Hebrew word for followeth hard is the exact word that God uses in Genesis chapter 22, or chapter 2 in verse 24, when he talks to a husband and a wife, and he says that we are to cleave unto our wives. To follow hard after God is like a man cleaving after his wife, or for his wife. My wife and I, as you and your wife, love each other. We have a romantic love, but we have something far greater than a romantic love. We have a committed love. We have a love that goes beyond the ups and downs of life and just is committed. There is no one in my life that I have a closer relationship to on this earth, other than the Lord, than my wife. No one comes before my wife. No hobby, no interest, no work comes before my wife. No child, no grandchild, maybe my puppy Emma. Kidding. I love to fish. My wife does not love to fish. If my wife came to me and said, honey, I know you had this fishing trip planned, but I need you to do this, can I assure you of something? The rods and the reels would be put up immediately. Now I'm not trying to be silly and all that, I'm trying to illustrate how quickly we set God aside to do everything else. I'd meet with you in the morning, God, but traffic. I'd meet with you in the morning, God, but I've got another meeting. I'd meet with you in the morning, God, but I got kids! Kids were never given to us to be an excuse to not know God. What are you saying, preacher? I'm saying he's got to be first, and he's got to take precedence, and I know we talk about knowing the Lord and walking with the Lord. I'm not asking tonight if we know that we ought to, I'm asking have we instituted in our lives the discipline where God is first, and we follow hard after God, and we never put him second. We never put him second. When I pastored for so many years in Woodbridge, Woodbridge, for those of you that know nothing about the south part of this great capital area, is 22 miles from the Washington Monument. Most of my men worked in one of the alphabet parts of the government, or the Pentagon, or Crystal City, somewhere there, and if they had to be at their desk at 8, they had to be on I-95 to go all of 22 miles. They had to be on 95 at 515, which meant if they wanted to brush their teeth, they had to be up at 430, which means if they wanted to meet with God in the morning. I've had men come to me and say, preacher, do you understand I get up at 430? Do you understand that I have a high-pressure and fast-paced job, and yet you're saying to me that you think I need to get up before 430 to meet with God? And with no arrogance, no arrogance, and no false bravado, I would say to them, yes, that's what I'm saying to you. Because there's not a day in your life you're wise enough to be your wife's husband without God's leadership. There's not a day in your life where you're good enough to be your children's father without God's leadership. There's not a day that you're strong enough to go into that world place and serve alongside those who are lost and have no vision of your God. There's not a day that you're strong enough without God. I know it's hard, and I take no pleasure in saying it, but yes, that's what I'm saying to you. Time with God is more important. We have to find time to spend consistent time with him alone, alone. David had provisions to take care of, protection to provide. David no doubt wanted to rush to his family and rush to his children and hold them. He was frightened for them, but he understood something, that it was time alone with God that would give him the ability to provide for them what he needed. Time alone. Listen, fatherhood in our nation, I'm afraid, has been reduced to taking our kids to Disney World or standing on the side of a soccer field and cheering, and I'm glad for that, and I'm not against that, but I'm telling you, time alone with God prepares the heart and gives wisdom. And then I would say that we have to place God in every part of our life and every part of our home. I tell this story to just illustrate it. When we were starting Heritage, it took everything we had, and it was just my wife and three kids, myself, and back in the 80s, early 80s, and for every mother in here, there were days in America where your children did not have to be in a car seat. And so we had been out passing out tracks, and we were coming back into the church parking lot, old ramshackle building, and the two kids were in the back, and our youngest, Josh, maybe two and a half, three years old, was, I think, standing between me and Nancy, and Nancy had her arm around him, and we pulled into the church parking lot, and he said, we home, we home. I looked at Nancy, and at first she was just almost get ready to cry because she was thinking to herself, he doesn't even know where he lives, not the brightest child. No, you know, we talked about it, we've never regretted, that our kids didn't see the distinction of having to be home to be comfortable, having to be here to be comfortable. They were as comfortable with being at church, in living their life at church, and I don't mean just church, I mean in Jesus. And being passionate about knowing God and seeking God takes us to the places we serve. We've lived in a world, I'll talk about it tomorrow night, where the word self has been served has been replaced with the word self. But you and I, if we're seeking the Lord, it will take us to the places where we serve. And I want you to notice just this, and with this I am done. Would you remind yourself that David is in a cave, he's lost his palace, he's lost his armies, his servants, he has no meal prepared for him this morning, he's probably cold and damp. And yet look at verse 5, my soul shall be satisfied as with marrow and fatness. Satisfied with marrow and fatness. David, you've lost it all. And he would reply to us, I haven't lost God. I want you to notice in verse 7, because thou has been my health, therefore in the shadow of thy wings will I rejoice. Rejoice? David, you ought to need antidepressant medicine. You're in a cave, dude, you've lost everything, you may well lose your life this day. And David says, huh, you know what? I live in the shadow of his wings, been in scrapes before. I rejoice! Look at verse 11, but the king shall rejoice in God. Notice verse 3, because thy loving kindness is better than life, my lips shall praise thee. Praise God? David, he's forsaken you. Don't you understand, David? He must not care about you, you've lost everything. Look at verse 4, thus will I bless thee while I live. I will lift up my hands in thy name. You know what I see? I see David not as a great and grand king, but as a humbled man seeking God's help and protection, and in this cave as the sun is coming up, and maybe shivering and damp, and maybe frightened and worried about what the day holds, and yet I see this man lifting his hands to the Lord, praising the Lord. I wonder if we don't praise the Lord more because we're not correctly seeking him. I wonder if we lack joy in our lives because we are so exhausted by going the direction this world pushes us. I don't mean worldly stuff, I don't mean carnal stuff, I mean just the absolute necessity sometimes of life, and we just get our priorities wrong, and we're busy, and we're running, and we're moving, and we're doing, and we're joyless. I wonder if we never feel satisfied, and never have that sense, because in truth what is missing from our lives is the absolute priority of seeking Him first. I want to go on forever, but I'm not. I'm going to tell what preacher told me just a few moments ago, just so impressed me. A missionary, Stephen Trell, I'll just give his name, but not where he's at, had a young man that wanted to walk beside him, wanted to carry some very small packages, and just was persistent, I want to be by you, I want to carry that, I want to be around you, I want to be by you, and finally this missionary asked the young man, why do you want to be by me? Because he said, every time I see you, there just seems to be light. I want to get close to that light. Does anybody want to be around you? Does anybody sniff God on you? Does anybody look at you and say, man, I'm miserable in this pandemic. Look at them, they're all filled with joy. Well, you don't understand, Pastor, I have to wear a mask, I have to get a vaccine, I have to do this, and you just don't understand, and David had lost it all. And he had joy, and he praised God, and he was satisfied, and by the way, people were drawn to him, and people came to help him, and God had never forsaken him, because that king humbled on his knees in a cave. I said, it's early, sun's coming up, I think I'll keep my priorities straight and seek God early. It will make all the difference. Would you pray with me? Father, we're so grateful for your blessing. We just stand amazed at our salvation. Lord, I'm not glad I got saved later in life, but I am glad that I understand the miracle of it, the wonder of it. Lord, I just want more of you. I want to understand your Word, and I want to obey it. I want to be able to share it. I want influence. I want all that, not selfishly, but Lord, the key to all of that is not rushing off into life without you. It is understanding that in our lives, you must always be the priority. You are always number one. You are always to be our passion, and other things have to be put to the side. Other things have to be put second, and third, and fourth, and nothing can take your place. And Lord, if we will discipline our lives that way, we will find what David found, that we can praise you even when our circumstances are dire, that we can rejoice in you even when it seems we've lost everything else. And the deepest satisfaction a life can know, morrow and fatness, we can have joy in the blessings you give because we have you, and we know you. Lord, if there is ever to be revival in this nation, in this community, it will be when Christians decide to re-establish priorities with you and seeking you first. Would you speak to our hearts about that tonight? And I say to those who are on livestream, listen, God is not mad at us when we realize these things, and we understand that we've mixed up our priorities. God is glad when we make that realization, and I pray that you'll make your chair, your sofa, your kitchen chair, your altar, and take a few moments on your knees before God and say, God, my priorities have gotten mixed up. I'm missing joy. I'm not happy or satisfied, and it's because I've put other things before you. And if there's one under the sound of my voice that doesn't know Jesus, can I assure you that he is seeking you tonight, and he loves you. And if you will but call upon him, confessing and admitting your sin and asking him to be your Savior, whosoever shall call upon the name of the Lord shall be saved. So Holy Spirit, would you work now and speak to us, I pray, in Jesus name. Amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 2.359999895095825,
      "text": " so much about the spirit of a church."
    },
    {
      "id": 1,
      "start": 2.359999895095825,
      "end": 7.360000133514404,
      "text": " And I have just so appreciated the music"
    },
    {
      "id": 2,
      "start": 8.119999885559082,
      "end": 9.760000228881836,
      "text": " and the way that it's been done,"
    },
    {
      "id": 3,
      "start": 9.760000228881836,
      "end": 13.100000381469727,
      "text": " but also the music that has been done."
    },
    {
      "id": 4,
      "start": 13.100000381469727,
      "end": 16.360000610351562,
      "text": " I love songs that are theologically correct,"
    },
    {
      "id": 5,
      "start": 16.360000610351562,
      "end": 18.719999313354492,
      "text": " harmonious in their sound,"
    },
    {
      "id": 6,
      "start": 18.719999313354492,
      "end": 22.399999618530273,
      "text": " and played by people who understand what they're singing"
    },
    {
      "id": 7,
      "start": 22.399999618530273,
      "end": 24.479999542236328,
      "text": " and playing in living it out."
    },
    {
      "id": 8,
      "start": 24.479999542236328,
      "end": 27.040000915527344,
      "text": " So it's been a real blessing to me."
    },
    {
      "id": 9,
      "start": 27.079999923706055,
      "end": 30.559999465942383,
      "text": " I have enjoyed Fellowship Baptist Church this week."
    },
    {
      "id": 10,
      "start": 30.559999465942383,
      "end": 31.440000534057617,
      "text": " I haven't seen you."
    },
    {
      "id": 11,
      "start": 31.440000534057617,
      "end": 33.880001068115234,
      "text": " Maybe that's why I've enjoyed you so much."
    },
    {
      "id": 12,
      "start": 33.880001068115234,
      "end": 34.959999084472656,
      "text": " I don't know."
    },
    {
      "id": 13,
      "start": 34.959999084472656,
      "end": 37.7599983215332,
      "text": " And maybe you feel the same about me."
    },
    {
      "id": 14,
      "start": 37.7599983215332,
      "end": 40.720001220703125,
      "text": " All you've had to do is put up with me for,"
    },
    {
      "id": 15,
      "start": 40.720001220703125,
      "end": 43.91999816894531,
      "text": " I always say 30 minutes a night,"
    },
    {
      "id": 16,
      "start": 43.91999816894531,
      "end": 46.119998931884766,
      "text": " and then my wife will hit me with her elbow"
    },
    {
      "id": 17,
      "start": 46.119998931884766,
      "end": 48.84000015258789,
      "text": " and say, never 30, always 40."
    },
    {
      "id": 18,
      "start": 48.84000015258789,
      "end": 52.31999969482422,
      "text": " And so it's probably been much longer than 30 minutes."
    },
    {
      "id": 19,
      "start": 52.31999969482422,
      "end": 54.119998931884766,
      "text": " But thank you for tuning in."
    },
    {
      "id": 20,
      "start": 54.119998931884766,
      "end": 57.599998474121094,
      "text": " Thank you for the few that are able to be here"
    },
    {
      "id": 21,
      "start": 57.599998474121094,
      "end": 59.13999938964844,
      "text": " and are here tonight."
    },
    {
      "id": 22,
      "start": 59.13999938964844,
      "end": 61.619998931884766,
      "text": " I just want you to know that it's been a real blessing to me."
    },
    {
      "id": 23,
      "start": 61.619998931884766,
      "end": 63.560001373291016,
      "text": " I love your pastor and his family,"
    },
    {
      "id": 24,
      "start": 64.4800033569336,
      "end": 67.41999816894531,
      "text": " and love the opportunity to be here."
    },
    {
      "id": 25,
      "start": 67.41999816894531,
      "end": 68.80000305175781,
      "text": " Take your Bible if you would,"
    },
    {
      "id": 26,
      "start": 68.80000305175781,
      "end": 73.05999755859375,
      "text": " and while you're turning to Psalm 63, let me say this."
    },
    {
      "id": 27,
      "start": 73.05999755859375,
      "end": 78.05999755859375,
      "text": " I'm going to preach a very elementary message tonight."
    },
    {
      "id": 28,
      "start": 78.27999877929688,
      "end": 80.5199966430664,
      "text": " Now, elementary doesn't mean"
    },
    {
      "id": 29,
      "start": 80.5199966430664,
      "end": 83.05999755859375,
      "text": " that it's not a much needed message."
    },
    {
      "id": 30,
      "start": 83.9000015258789,
      "end": 87.86000061035156,
      "text": " And the truth is that as you listen to this message,"
    },
    {
      "id": 31,
      "start": 87.86000061035156,
      "end": 90.18000030517578,
      "text": " you may be tempted to say to yourself,"
    },
    {
      "id": 32,
      "start": 90.18000030517578,
      "end": 92.30000305175781,
      "text": " well, everybody knows that."
    },
    {
      "id": 33,
      "start": 92.30000305175781,
      "end": 94.45999908447266,
      "text": " I know that."
    },
    {
      "id": 34,
      "start": 94.45999908447266,
      "end": 98.30000305175781,
      "text": " The question isn't, do we know it?"
    },
    {
      "id": 35,
      "start": 98.30000305175781,
      "end": 102.37999725341797,
      "text": " The question is, is it part of our lives?"
    },
    {
      "id": 36,
      "start": 102.37999725341797,
      "end": 104.62000274658203,
      "text": " Have we appropriated it?"
    },
    {
      "id": 37,
      "start": 104.62000274658203,
      "end": 109.22000122070312,
      "text": " Is it a part of the discipline of our lives?"
    },
    {
      "id": 38,
      "start": 109.22000122070312,
      "end": 111.55999755859375,
      "text": " I hope you'll ask yourself that question"
    },
    {
      "id": 39,
      "start": 111.55999755859375,
      "end": 113.87999725341797,
      "text": " as we consider these things tonight."
    },
    {
      "id": 40,
      "start": 113.87999725341797,
      "end": 117.4800033569336,
      "text": " Notice with me in Psalm 63 and verse one."
    },
    {
      "id": 41,
      "start": 118.76000213623047,
      "end": 123.4000015258789,
      "text": " Oh God, thou art my God."
    },
    {
      "id": 42,
      "start": 123.4000015258789,
      "end": 126.4800033569336,
      "text": " Early will I seek thee."
    },
    {
      "id": 43,
      "start": 126.4800033569336,
      "end": 128.86000061035156,
      "text": " My soul thirsteth for thee."
    },
    {
      "id": 44,
      "start": 128.86000061035156,
      "end": 131.47999572753906,
      "text": " My flesh longeth for thee"
    },
    {
      "id": 45,
      "start": 131.47999572753906,
      "end": 135.9199981689453,
      "text": " in a dry and thirsty land where no water is."
    },
    {
      "id": 46,
      "start": 136.8800048828125,
      "end": 140.1199951171875,
      "text": " See thy power and thy glory."
    },
    {
      "id": 47,
      "start": 140.1199951171875,
      "end": 143.1999969482422,
      "text": " So as I have seen thee in the sanctuary,"
    },
    {
      "id": 48,
      "start": 144.16000366210938,
      "end": 148.0399932861328,
      "text": " because thy loving kindness is better than life,"
    },
    {
      "id": 49,
      "start": 148.0399932861328,
      "end": 150.72000122070312,
      "text": " my lips shall praise thee."
    },
    {
      "id": 50,
      "start": 150.72000122070312,
      "end": 153.32000732421875,
      "text": " And thus will I bless thee while I live."
    },
    {
      "id": 51,
      "start": 153.32000732421875,
      "end": 156.16000366210938,
      "text": " I will lift up my hands in thy name."
    },
    {
      "id": 52,
      "start": 157.10000610351562,
      "end": 162.10000610351562,
      "text": " My soul shall be satisfied as with marrow and fatness,"
    },
    {
      "id": 53,
      "start": 162.44000244140625,
      "end": 166.75999450683594,
      "text": " and my mouth shall praise thee with joyful lips."
    },
    {
      "id": 54,
      "start": 166.75999450683594,
      "end": 169.36000061035156,
      "text": " When I remember thee upon my bed"
    },
    {
      "id": 55,
      "start": 169.36000061035156,
      "end": 172.8000030517578,
      "text": " and meditate on thee in the night watches,"
    },
    {
      "id": 56,
      "start": 172.8000030517578,
      "end": 175.32000732421875,
      "text": " because thou has been my help,"
    },
    {
      "id": 57,
      "start": 175.32000732421875,
      "end": 180.27999877929688,
      "text": " therefore in the shadow of thy wings will I rejoice."
    },
    {
      "id": 58,
      "start": 180.27999877929688,
      "end": 185.10000610351562,
      "text": " My soul followeth hard after thee."
    },
    {
      "id": 59,
      "start": 185.10000610351562,
      "end": 188.6199951171875,
      "text": " Thy right hand upholdeth me."
    },
    {
      "id": 60,
      "start": 188.6199951171875,
      "end": 189.4600067138672,
      "text": " Let's pray."
    },
    {
      "id": 61,
      "start": 190.60000610351562,
      "end": 194.32000732421875,
      "text": " Father, we thank you for the beauty of these words"
    },
    {
      "id": 62,
      "start": 195.16000366210938,
      "end": 200.16000366210938,
      "text": " and for the meaning of these words for our lives."
    },
    {
      "id": 63,
      "start": 201.16000366210938,
      "end": 203.1999969482422,
      "text": " Thank you for what you taught David"
    },
    {
      "id": 64,
      "start": 203.1999969482422,
      "end": 206.52000427246094,
      "text": " and what David now teaches us through your Holy Spirit."
    },
    {
      "id": 65,
      "start": 207.9600067138672,
      "end": 211.36000061035156,
      "text": " And I pray, Lord, that as elementary as this is,"
    },
    {
      "id": 66,
      "start": 212.52000427246094,
      "end": 214.8000030517578,
      "text": " that God, you would convict our hearts"
    },
    {
      "id": 67,
      "start": 214.8000030517578,
      "end": 219.8000030517578,
      "text": " that knowing it is not the same as the discipline of life"
    },
    {
      "id": 68,
      "start": 219.83999633789062,
      "end": 221.0800018310547,
      "text": " that accomplishes it."
    },
    {
      "id": 69,
      "start": 221.9199981689453,
      "end": 224.1199951171875,
      "text": " So convict us."
    },
    {
      "id": 70,
      "start": 224.1199951171875,
      "end": 228.16000366210938,
      "text": " Our desire is to seek you because we want to know you."
    },
    {
      "id": 71,
      "start": 228.16000366210938,
      "end": 232.6999969482422,
      "text": " The greatest need we have in our lives is to know you more."
    },
    {
      "id": 72,
      "start": 234.36000061035156,
      "end": 238.0800018310547,
      "text": " And I pray tonight that you would help us to see that."
    },
    {
      "id": 73,
      "start": 238.0800018310547,
      "end": 241.60000610351562,
      "text": " I pray for those who may be under the sound of my voice"
    },
    {
      "id": 74,
      "start": 241.60000610351562,
      "end": 244.1999969482422,
      "text": " who have never been saved."
    },
    {
      "id": 75,
      "start": 245.60000610351562,
      "end": 250.60000610351562,
      "text": " Lord, I ask you to convince them of their need, their sin,"
    },
    {
      "id": 76,
      "start": 251.74000549316406,
      "end": 256.5199890136719,
      "text": " but also, Lord, would you convince them that you love them"
    },
    {
      "id": 77,
      "start": 257.4800109863281,
      "end": 258.9599914550781,
      "text": " and that you want them."
    },
    {
      "id": 78,
      "start": 259.8800048828125,
      "end": 261.79998779296875,
      "text": " So Lord, do a work in our hearts."
    },
    {
      "id": 79,
      "start": 261.79998779296875,
      "end": 263.3999938964844,
      "text": " Thank you for this opportunity."
    },
    {
      "id": 80,
      "start": 263.3999938964844,
      "end": 267.67999267578125,
      "text": " Thank you for this technology that we can be together."
    },
    {
      "id": 81,
      "start": 267.67999267578125,
      "end": 271.44000244140625,
      "text": " If not in the same place, we can be together in your word"
    },
    {
      "id": 82,
      "start": 271.44000244140625,
      "end": 273.32000732421875,
      "text": " and hear this preaching."
    },
    {
      "id": 83,
      "start": 273.32000732421875,
      "end": 276.739990234375,
      "text": " Blessed we pray in Jesus' name, amen."
    },
    {
      "id": 84,
      "start": 277.739990234375,
      "end": 280.2200012207031,
      "text": " If I could choose a word"
    },
    {
      "id": 85,
      "start": 280.2200012207031,
      "end": 283.8800048828125,
      "text": " that I think describes our generation,"
    },
    {
      "id": 86,
      "start": 284.7799987792969,
      "end": 289.29998779296875,
      "text": " that word would be something like stress."
    },
    {
      "id": 87,
      "start": 290.260009765625,
      "end": 295.0199890136719,
      "text": " I think pressure might be the thought as well."
    },
    {
      "id": 88,
      "start": 295.0199890136719,
      "end": 298.6600036621094,
      "text": " I've lived a few years, and to be honest with you,"
    },
    {
      "id": 89,
      "start": 298.6600036621094,
      "end": 303.1000061035156,
      "text": " I don't think I've ever lived in a generation"
    },
    {
      "id": 90,
      "start": 303.2200012207031,
      "end": 308.2200012207031,
      "text": " that is under more perceived and real stress"
    },
    {
      "id": 91,
      "start": 309.4599914550781,
      "end": 311.7200012207031,
      "text": " than this generation."
    },
    {
      "id": 92,
      "start": 311.7200012207031,
      "end": 316.0199890136719,
      "text": " We live in a time where our children feel pressured."
    },
    {
      "id": 93,
      "start": 316.0199890136719,
      "end": 319.9800109863281,
      "text": " Everything from science to soccer, they've got to excel in."
    },
    {
      "id": 94,
      "start": 320.8599853515625,
      "end": 325.8599853515625,
      "text": " We live in a time where it seems like life has speeded up."
    },
    {
      "id": 95,
      "start": 326.6600036621094,
      "end": 330.739990234375,
      "text": " If they create one more time-saving device,"
    },
    {
      "id": 96,
      "start": 330.739990234375,
      "end": 334.29998779296875,
      "text": " I'm not buying it because I don't have any more time"
    },
    {
      "id": 97,
      "start": 334.29998779296875,
      "end": 337.3399963378906,
      "text": " for time-saving devices."
    },
    {
      "id": 98,
      "start": 337.3399963378906,
      "end": 340.17999267578125,
      "text": " We have family problems, economic problems,"
    },
    {
      "id": 99,
      "start": 340.17999267578125,
      "end": 344.1000061035156,
      "text": " political problems, world problems."
    },
    {
      "id": 100,
      "start": 344.1000061035156,
      "end": 346.260009765625,
      "text": " Have you noticed that?"
    },
    {
      "id": 101,
      "start": 346.260009765625,
      "end": 350.5799865722656,
      "text": " And I'm not saying that to try to discourage anyone."
    },
    {
      "id": 102,
      "start": 350.5799865722656,
      "end": 352.1400146484375,
      "text": " They are stressful times,"
    },
    {
      "id": 103,
      "start": 352.1400146484375,
      "end": 357.1400146484375,
      "text": " and there is an incredible amount of pressure on every life,"
    },
    {
      "id": 104,
      "start": 357.82000732421875,
      "end": 359.8800048828125,
      "text": " but I'm saying it for this reason."
    },
    {
      "id": 105,
      "start": 361.260009765625,
      "end": 366.260009765625,
      "text": " If we're not careful, if we are not purposeful,"
    },
    {
      "id": 106,
      "start": 366.5400085449219,
      "end": 371.5400085449219,
      "text": " if we're not intentional, we will let the pressure"
    },
    {
      "id": 107,
      "start": 371.5799865722656,
      "end": 376.5799865722656,
      "text": " and the stress that life in this world brings"
    },
    {
      "id": 108,
      "start": 376.8999938964844,
      "end": 379.94000244140625,
      "text": " set the direction for our life"
    },
    {
      "id": 109,
      "start": 379.94000244140625,
      "end": 384.6199951171875,
      "text": " instead of intentionally allowing God"
    },
    {
      "id": 110,
      "start": 384.6199951171875,
      "end": 387.8599853515625,
      "text": " to set the direction for our lives."
    },
    {
      "id": 111,
      "start": 388.8599853515625,
      "end": 393.8599853515625,
      "text": " We come tonight and we are in a revival meeting."
    },
    {
      "id": 112,
      "start": 394.82000732421875,
      "end": 399.5400085449219,
      "text": " And I sometimes ask myself, well, what is revival?"
    },
    {
      "id": 113,
      "start": 399.5400085449219,
      "end": 401.8599853515625,
      "text": " Is revival evangelism?"
    },
    {
      "id": 114,
      "start": 401.8599853515625,
      "end": 403.5,
      "text": " It's certainly an aspect."
    },
    {
      "id": 115,
      "start": 403.5,
      "end": 407.6600036621094,
      "text": " We certainly should move towards an evangelistic spirit"
    },
    {
      "id": 116,
      "start": 407.6600036621094,
      "end": 411.4200134277344,
      "text": " if we indeed have revived hearts."
    },
    {
      "id": 117,
      "start": 411.4200134277344,
      "end": 416.1000061035156,
      "text": " But I would suggest to you that a revival is believers"
    },
    {
      "id": 118,
      "start": 416.1400146484375,
      "end": 418.8599853515625,
      "text": " looking down into their own hearts"
    },
    {
      "id": 119,
      "start": 418.8599853515625,
      "end": 421.6600036621094,
      "text": " and examining their own lives"
    },
    {
      "id": 120,
      "start": 421.6600036621094,
      "end": 425.4200134277344,
      "text": " and answering some very vital questions"
    },
    {
      "id": 121,
      "start": 425.4200134277344,
      "end": 427.6600036621094,
      "text": " from the Lord to us,"
    },
    {
      "id": 122,
      "start": 427.6600036621094,
      "end": 432.4200134277344,
      "text": " and that revival can really be understood in this thought."
    },
    {
      "id": 123,
      "start": 433.29998779296875,
      "end": 437.55999755859375,
      "text": " A renewed seeking of the Lord."
    },
    {
      "id": 124,
      "start": 438.6600036621094,
      "end": 441.5,
      "text": " A renewed seeking of the Lord."
    },
    {
      "id": 125,
      "start": 441.5,
      "end": 444.5,
      "text": " I wanna do a little exercise here."
    },
    {
      "id": 126,
      "start": 444.5,
      "end": 449.5,
      "text": " 244 times in the Bible, the word seek is used."
    },
    {
      "id": 127,
      "start": 449.5799865722656,
      "end": 453.29998779296875,
      "text": " I'm not going to read all 244."
    },
    {
      "id": 128,
      "start": 453.29998779296875,
      "end": 457.7799987792969,
      "text": " And I'll be honest with you, not all 244 times"
    },
    {
      "id": 129,
      "start": 457.7799987792969,
      "end": 462.739990234375,
      "text": " does the word seek refer to seeking the Lord."
    },
    {
      "id": 130,
      "start": 462.739990234375,
      "end": 467.739990234375,
      "text": " But by far the vast majority of times, perhaps 225 to 30,"
    },
    {
      "id": 131,
      "start": 469.3800048828125,
      "end": 472.5799865722656,
      "text": " it is used and it is in reference"
    },
    {
      "id": 132,
      "start": 472.5799865722656,
      "end": 477.5799865722656,
      "text": " to God's people seeking the Lord."
    },
    {
      "id": 133,
      "start": 477.7799987792969,
      "end": 481.1000061035156,
      "text": " Let me read just a couple of those to you."
    },
    {
      "id": 134,
      "start": 481.1000061035156,
      "end": 484.6600036621094,
      "text": " 1 Chronicles 16 and verse 10."
    },
    {
      "id": 135,
      "start": 484.6600036621094,
      "end": 487.82000732421875,
      "text": " Glory ye in his holy name."
    },
    {
      "id": 136,
      "start": 487.82000732421875,
      "end": 492.82000732421875,
      "text": " Let the heart of them rejoice that seek the Lord."
    },
    {
      "id": 137,
      "start": 494.05999755859375,
      "end": 499.05999755859375,
      "text": " Psalm 105 verse four, seek the Lord and his strength."
    },
    {
      "id": 138,
      "start": 499.82000732421875,
      "end": 503.44000244140625,
      "text": " Seek his face forevermore."
    },
    {
      "id": 139,
      "start": 503.44000244140625,
      "end": 508.1400146484375,
      "text": " Psalm 40 verse 16, let all those that seek thee"
    },
    {
      "id": 140,
      "start": 508.1400146484375,
      "end": 511.1000061035156,
      "text": " rejoice and be glad in thee."
    },
    {
      "id": 141,
      "start": 511.1000061035156,
      "end": 515.1400146484375,
      "text": " Let such as love thy salvation say continually,"
    },
    {
      "id": 142,
      "start": 515.1400146484375,
      "end": 517.97998046875,
      "text": " the Lord be magnified."
    },
    {
      "id": 143,
      "start": 517.97998046875,
      "end": 522.219970703125,
      "text": " Psalm 119 and verse two, blessed are they"
    },
    {
      "id": 144,
      "start": 522.219970703125,
      "end": 525.760009765625,
      "text": " that keep his testimonies and that seek him"
    },
    {
      "id": 145,
      "start": 525.760009765625,
      "end": 528.739990234375,
      "text": " with the whole heart."
    },
    {
      "id": 146,
      "start": 528.780029296875,
      "end": 532.4199829101562,
      "text": " Hebrews 11 and verse six, but without faith"
    },
    {
      "id": 147,
      "start": 532.4199829101562,
      "end": 534.5399780273438,
      "text": " it is impossible to please him."
    },
    {
      "id": 148,
      "start": 534.5399780273438,
      "end": 538.6199951171875,
      "text": " For he that cometh to God must believe that he is"
    },
    {
      "id": 149,
      "start": 538.6199951171875,
      "end": 543.6199951171875,
      "text": " and he is a rewarder of them that diligently seek him."
    },
    {
      "id": 150,
      "start": 545.1400146484375,
      "end": 550.1400146484375,
      "text": " Matthew 6.33, but seek ye first the kingdom of God"
    },
    {
      "id": 151,
      "start": 550.7000122070312,
      "end": 553.9000244140625,
      "text": " and his righteousness and all these things"
    },
    {
      "id": 152,
      "start": 553.9000244140625,
      "end": 556.7999877929688,
      "text": " shall be added unto you."
    },
    {
      "id": 153,
      "start": 556.7999877929688,
      "end": 559.5800170898438,
      "text": " And then a verse that we often consider"
    },
    {
      "id": 154,
      "start": 559.5800170898438,
      "end": 563.8599853515625,
      "text": " during our revival time, 2 Chronicles 7.14."
    },
    {
      "id": 155,
      "start": 563.8599853515625,
      "end": 568.8599853515625,
      "text": " If my people, which are called by my name,"
    },
    {
      "id": 156,
      "start": 569.02001953125,
      "end": 574.02001953125,
      "text": " shall humble themselves and pray and seek my face"
    },
    {
      "id": 157,
      "start": 577.6199951171875,
      "end": 580.4000244140625,
      "text": " and turn from their wicked ways,"
    },
    {
      "id": 158,
      "start": 580.4000244140625,
      "end": 585.4000244140625,
      "text": " then will I hear from heaven and will forgive their sin"
    },
    {
      "id": 159,
      "start": 585.52001953125,
      "end": 588.4000244140625,
      "text": " and heal their land."
    },
    {
      "id": 160,
      "start": 588.4000244140625,
      "end": 591.0800170898438,
      "text": " I don't think I can overstate tonight"
    },
    {
      "id": 161,
      "start": 591.0800170898438,
      "end": 595.6599731445312,
      "text": " the importance of this thought in reference to revival."
    },
    {
      "id": 162,
      "start": 596.8400268554688,
      "end": 601.8400268554688,
      "text": " If God's people do not seek him,"
    },
    {
      "id": 163,
      "start": 602.8400268554688,
      "end": 605.8400268554688,
      "text": " then they will not be saved."
    },
    {
      "id": 164,
      "start": 605.8400268554688,
      "end": 608.8400268554688,
      "text": " If God's people do not seek him,"
    },
    {
      "id": 165,
      "start": 608.8400268554688,
      "end": 611.8400268554688,
      "text": " then they will not be saved."
    },
    {
      "id": 0,
      "start": 611.8400268554688,
      "end": 620.1200265884399,
      "text": " seek Him. If our lives are directed by the pressure and the direction of the"
    },
    {
      "id": 1,
      "start": 620.1200265884399,
      "end": 625.6800270080566,
      "text": " world that the world sends us, no matter what our intentions are, if our direction"
    },
    {
      "id": 2,
      "start": 625.6800270080566,
      "end": 631.2800273895264,
      "text": " is set by the world and we are not intentionally and purposefully seeking"
    },
    {
      "id": 3,
      "start": 631.2800273895264,
      "end": 637.7200260162354,
      "text": " the Lord, can I be very honest with you tonight? Revival won't come. Revival will"
    },
    {
      "id": 4,
      "start": 637.7200260162354,
      "end": 642.9600276947021,
      "text": " not come in the halls of Congress. Revival won't come in the Capitol at"
    },
    {
      "id": 5,
      "start": 642.9600276947021,
      "end": 649.2000274658203,
      "text": " Richmond. Revival won't come because of an economic resurgence."
    },
    {
      "id": 6,
      "start": 649.2000274658203,
      "end": 657.3600273132324,
      "text": " Revival comes only when God's people are revived. Sometimes I think we look in all"
    },
    {
      "id": 7,
      "start": 657.3600273132324,
      "end": 665.720027923584,
      "text": " the wrong places, and the place to look for revival is in my heart, in your heart."
    },
    {
      "id": 8,
      "start": 665.720027923584,
      "end": 675.160026550293,
      "text": " When we set ourselves again to seek the Lord amidst all the pressure of"
    },
    {
      "id": 9,
      "start": 675.160026550293,
      "end": 682.7600250244141,
      "text": " schedules, society, success, you and I must cause ourselves to keep the right"
    },
    {
      "id": 10,
      "start": 682.7600250244141,
      "end": 690.2000274658203,
      "text": " things a priority in our lives. When we come to Psalm 63, David gives us a"
    },
    {
      "id": 11,
      "start": 690.2000274658203,
      "end": 695.8400268554688,
      "text": " wonderful example of that. I want you to understand that David was a man who"
    },
    {
      "id": 12,
      "start": 695.8400268554688,
      "end": 701.6000289916992,
      "text": " understood pressure. He understood the pressure of leadership. He was leading a"
    },
    {
      "id": 13,
      "start": 701.6000289916992,
      "end": 708.2000274658203,
      "text": " kingdom, leading armies. David understood the pressure of problems. Goodness, he had"
    },
    {
      "id": 14,
      "start": 708.2000274658203,
      "end": 713.9600296020508,
      "text": " many, many difficult things in his life, some of his own making. And yet one of"
    },
    {
      "id": 15,
      "start": 714.0400238037109,
      "end": 721.4800262451172,
      "text": " the things that I so love about David is that in his life he was intentional. He"
    },
    {
      "id": 16,
      "start": 721.4800262451172,
      "end": 727.1200256347656,
      "text": " was purposeful in the thought that he would seek the Lord. The Lord would have"
    },
    {
      "id": 17,
      "start": 727.1200256347656,
      "end": 734.4400253295898,
      "text": " priority in his life. When we come to Psalm 63, David is not in the palace."
    },
    {
      "id": 18,
      "start": 734.4400253295898,
      "end": 743.6400299072266,
      "text": " When we come to Psalm 63, David is not in the temple rejoicing as the Levites"
    },
    {
      "id": 19,
      "start": 743.6400299072266,
      "end": 751.0400238037109,
      "text": " sing hymns of worship. When we come to Psalm 63, I want you to understand as it says in"
    },
    {
      "id": 20,
      "start": 751.0400238037109,
      "end": 758.0400238037109,
      "text": " the inscription in the psalm, he was in the wilderness of Judah. If you've been"
    },
    {
      "id": 21,
      "start": 758.0400238037109,
      "end": 762.7200317382812,
      "text": " to the Holy Land, you know that the wilderness of Judah is an accurate"
    },
    {
      "id": 22,
      "start": 762.7200317382812,
      "end": 769.8000335693359,
      "text": " description of the land of Judah. It is an arid place, hot during the day, cold"
    },
    {
      "id": 23,
      "start": 769.9200286865234,
      "end": 776.7200317382812,
      "text": " at night. And again, there is not, there are certainly places of oasis, but water"
    },
    {
      "id": 24,
      "start": 776.7200317382812,
      "end": 783.2000274658203,
      "text": " is far apart, and vegetation is sparse, and it is a difficult place to survive."
    },
    {
      "id": 25,
      "start": 783.2000274658203,
      "end": 791.52001953125,
      "text": " David is in the wilderness of Judah because just a day before, his own son"
    },
    {
      "id": 26,
      "start": 791.52001953125,
      "end": 799.4800262451172,
      "text": " Absalom has raised rebellion against him and has taken the gates of Jerusalem"
    },
    {
      "id": 27,
      "start": 799.6400299072266,
      "end": 806.4800262451172,
      "text": " and as he is proceeding through the city, hunting down his father, David and a few"
    },
    {
      "id": 28,
      "start": 806.4800262451172,
      "end": 812.7600250244141,
      "text": " of his family are able to escape and down over Brook Kidron and out into the"
    },
    {
      "id": 29,
      "start": 812.7600250244141,
      "end": 818.52001953125,
      "text": " wilderness, unprepared, unsupplied. They find themselves in the wilderness of"
    },
    {
      "id": 30,
      "start": 818.52001953125,
      "end": 825.6400299072266,
      "text": " Judea. If I understand strategy of those days, David would have separated himself"
    },
    {
      "id": 31,
      "start": 825.8800201416016,
      "end": 832.2400207519531,
      "text": " from Abigail and from Bathsheba and from his children that were out with him. He"
    },
    {
      "id": 32,
      "start": 832.2400207519531,
      "end": 837.280029296875,
      "text": " would have put them in one place, hoping that if Absalom found him, he would slay"
    },
    {
      "id": 33,
      "start": 837.280029296875,
      "end": 845.8400268554688,
      "text": " him and care not about the kids. And so when we come to Psalm 63, I believe the"
    },
    {
      "id": 34,
      "start": 845.8400268554688,
      "end": 853.2000274658203,
      "text": " scene that we have is David awaiting daylight. David with the weight of his"
    },
    {
      "id": 35,
      "start": 853.8400268554688,
      "end": 860.0400238037109,
      "text": " world on his shoulders, David with decisions to be made about provision and"
    },
    {
      "id": 36,
      "start": 860.0400238037109,
      "end": 865.6800231933594,
      "text": " about protection, about where to go, where to hide, what to do, who to trust, who not"
    },
    {
      "id": 37,
      "start": 865.6800231933594,
      "end": 876.3200378417969,
      "text": " to trust, and in the midst of all those pressing matters, David says, Oh God, thou"
    },
    {
      "id": 38,
      "start": 876.4800415039062,
      "end": 888.0000305175781,
      "text": " art my God. Early will I seek thee. And in the midst of this catastrophe, David"
    },
    {
      "id": 39,
      "start": 888.0000305175781,
      "end": 894.4800415039062,
      "text": " says, I know what's important. All the things I have to attend to, I don't have"
    },
    {
      "id": 40,
      "start": 894.4800415039062,
      "end": 901.6000366210938,
      "text": " the wisdom to do until I have sought the mind of God. And I cannot let the urgency"
    },
    {
      "id": 41,
      "start": 901.6000366210938,
      "end": 910.1600341796875,
      "text": " of schedule push me away from the necessity of knowing the mind of God. And"
    },
    {
      "id": 42,
      "start": 910.1600341796875,
      "end": 917.1200256347656,
      "text": " so in that morning, in that cold place, perhaps the mouth of a cave or under the"
    },
    {
      "id": 43,
      "start": 917.1200256347656,
      "end": 923.4000244140625,
      "text": " outcropping of a rock or maybe finding a sparse tree and lying down beneath it"
    },
    {
      "id": 44,
      "start": 923.4000244140625,
      "end": 928.0800170898438,
      "text": " for the night, in the morning he looks for the sun because he wants to cry out"
    },
    {
      "id": 45,
      "start": 928.0800170898438,
      "end": 935.6400146484375,
      "text": " to his God for direction. Oh God, I'm going to seek thee. I want to give you"
    },
    {
      "id": 46,
      "start": 935.6400146484375,
      "end": 945.52001953125,
      "text": " two simple thoughts tonight. Number one, what is it to seek God? Number two, how is"
    },
    {
      "id": 47,
      "start": 945.52001953125,
      "end": 955.4000244140625,
      "text": " it a believer seeks the Lord? Number one, what does it mean to seek after God?"
    },
    {
      "id": 48,
      "start": 955.4400329589844,
      "end": 961.9200134277344,
      "text": " Three thoughts under that. Number one, to seek God first requires that we have a"
    },
    {
      "id": 49,
      "start": 961.9200134277344,
      "end": 969.4000244140625,
      "text": " personal relationship with the Lord. Would you hear me tonight? None of us"
    },
    {
      "id": 50,
      "start": 969.4000244140625,
      "end": 978.7200317382812,
      "text": " sought the Lord before he sought us. None of us were of such wonderful"
    },
    {
      "id": 51,
      "start": 978.7200317382812,
      "end": 985.2000122070312,
      "text": " righteousness. None of us sought the Lord until he sought us. I'm so thankful"
    },
    {
      "id": 52,
      "start": 985.2000122070312,
      "end": 994.9200134277344,
      "text": " that in February of 1975, the Lord found me. And the wonderful privilege of"
    },
    {
      "id": 53,
      "start": 994.9200134277344,
      "end": 1002.3600158691406,
      "text": " knowing that Jesus Christ, the Son of God, loved me, a sinful man, not only by"
    },
    {
      "id": 54,
      "start": 1002.4800415039062,
      "end": 1009.4400329589844,
      "text": " nature but by practice. I inherited my sin nature, but I employed it as well. I'm"
    },
    {
      "id": 55,
      "start": 1009.4400329589844,
      "end": 1017.8800354003906,
      "text": " guilty. And that God so loved a man like me that he would come, a lost sheep,"
    },
    {
      "id": 56,
      "start": 1017.8800354003906,
      "end": 1024.2400207519531,
      "text": " really a life that had no meaning, that he should care about it, but he loved me"
    },
    {
      "id": 57,
      "start": 1024.2400207519531,
      "end": 1032.0000305175781,
      "text": " in such a way that he left heaven and came to sinful earth, and emptied himself"
    },
    {
      "id": 58,
      "start": 1032.0000305175781,
      "end": 1039.3200378417969,
      "text": " of his right to be worshipped and treated as God, and took upon himself the"
    },
    {
      "id": 59,
      "start": 1039.3200378417969,
      "end": 1045.0800170898438,
      "text": " form of a servant, and was obedient to the will of his Father even unto death,"
    },
    {
      "id": 60,
      "start": 1045.0800170898438,
      "end": 1053.2000122070312,
      "text": " even the death of the cross. And there on that cross, in a transaction that we will"
    },
    {
      "id": 61,
      "start": 1053.2000122070312,
      "end": 1059.8400268554688,
      "text": " not fully understand until we stand in heaven in front of him, he suffered for"
    },
    {
      "id": 62,
      "start": 1059.8400268554688,
      "end": 1068.0000305175781,
      "text": " me and died and bled for me. And in that moment, if I look to him and confess that"
    },
    {
      "id": 63,
      "start": 1068.0000305175781,
      "end": 1076.7600402832031,
      "text": " my sin put him on that cross, and I call out to him using my mouth from a heart"
    },
    {
      "id": 64,
      "start": 1076.7600402832031,
      "end": 1087.1600341796875,
      "text": " that believes, and I call upon him, will you save me? He will. And my sin is placed"
    },
    {
      "id": 65,
      "start": 1087.1600341796875,
      "end": 1094.6400146484375,
      "text": " on him and judged in him, and his righteousness is placed on me, and God"
    },
    {
      "id": 66,
      "start": 1094.6400146484375,
      "end": 1100.9200134277344,
      "text": " sees no longer my sinfulness but the righteousness of his Son. I want to tell"
    },
    {
      "id": 67,
      "start": 1100.9200134277344,
      "end": 1108.4400329589844,
      "text": " you, I've been saved a while now. I've been saved since 1975. That's a long time. I'm"
    },
    {
      "id": 68,
      "start": 1108.4400329589844,
      "end": 1117.4000244140625,
      "text": " not over it yet. I'm not over. You see, I know what I was when God found me. We used"
    },
    {
      "id": 69,
      "start": 1117.4000244140625,
      "end": 1122.280029296875,
      "text": " to have a statement, I'm born and raised in Cincinnati, Ohio, and I've lived"
    },
    {
      "id": 70,
      "start": 1122.280029296875,
      "end": 1125.9200439453125,
      "text": " before there were shopping malls, and if you were going to go shopping, you went"
    },
    {
      "id": 71,
      "start": 1125.9200439453125,
      "end": 1130.6000366210938,
      "text": " downtown. And if you were in Edwards, it meant that you didn't have much money to"
    },
    {
      "id": 72,
      "start": 1130.6000366210938,
      "end": 1135.4800415039062,
      "text": " go shopping at all. And when we would go to Shillito's, that was the department"
    },
    {
      "id": 73,
      "start": 1135.4800415039062,
      "end": 1140.6400146484375,
      "text": " store, we would not go in on the first floor. That's where the people that had"
    },
    {
      "id": 74,
      "start": 1140.6400146484375,
      "end": 1147.0400390625,
      "text": " money bought. No, no, the Edwards is shopped in the bargain basement. And you"
    },
    {
      "id": 75,
      "start": 1147.0400390625,
      "end": 1154.4000244140625,
      "text": " know where Jesus found me? He found me in the bargain basement and lifted me out"
    },
    {
      "id": 76,
      "start": 1154.4000244140625,
      "end": 1163.0,
      "text": " of that. And I'm not over it. And whoever you are and wherever you are tonight,"
    },
    {
      "id": 77,
      "start": 1163.280029296875,
      "end": 1173.3200073242188,
      "text": " Jesus loves you, and he came for you. And it is as effective in 2021 as it was in"
    },
    {
      "id": 78,
      "start": 1173.3200073242188,
      "end": 1179.8800048828125,
      "text": " 1975, as it was in the great revival meetings of the century of"
    },
    {
      "id": 79,
      "start": 1179.8800048828125,
      "end": 1185.9200439453125,
      "text": " the 1800s, the Great Awakening, and as much as it ever has been, it is true"
    },
    {
      "id": 80,
      "start": 1185.9200439453125,
      "end": 1192.8400268554688,
      "text": " today. If you will but admit your sin and call upon Jesus to be your Savior, he"
    },
    {
      "id": 81,
      "start": 1192.8400268554688,
      "end": 1199.9600219726562,
      "text": " will save you. And then an incredible privilege is yours. Because he sought you"
    },
    {
      "id": 82,
      "start": 1199.9600219726562,
      "end": 1208.9600219726562,
      "text": " and found you, you now have the privilege of seeking and knowing and becoming like"
    },
    {
      "id": 83,
      "start": 1208.9600219726562,
      "end": 1213.8400268554688,
      "text": " him. And it ought to be the passion..."
    },
    {
      "id": 0,
      "start": 1213.8400268554688,
      "end": 1221.8200268745422,
      "text": " pursuit of every believer's life, to desire to know Him, to really know Him. I"
    },
    {
      "id": 1,
      "start": 1221.8200268745422,
      "end": 1228.0200271606445,
      "text": " remember when I first saw my wife, I was eating a, you don't need to know this, but"
    },
    {
      "id": 2,
      "start": 1228.0200271606445,
      "end": 1231.380027770996,
      "text": " now I'm telling you, I'm an old man and we're allowed to tell stories. And I"
    },
    {
      "id": 3,
      "start": 1231.380027770996,
      "end": 1235.3000259399414,
      "text": " was in the chemistry hall at the University of Cincinnati, I was eating my"
    },
    {
      "id": 4,
      "start": 1235.3000259399414,
      "end": 1239.740026473999,
      "text": " lunch sitting on the floor, and she walked in the door a vision of"
    },
    {
      "id": 5,
      "start": 1239.740026473999,
      "end": 1245.3400268554688,
      "text": " loveliness. And for me it was love at first sight, I'm not kidding about that."
    },
    {
      "id": 6,
      "start": 1245.3400268554688,
      "end": 1251.7000274658203,
      "text": " It was not for her, I had to work at it, but we got around to it. But my point of"
    },
    {
      "id": 7,
      "start": 1251.7000274658203,
      "end": 1259.6800270080566,
      "text": " telling you that is, is I spent near 50 years now getting to know her, wanting to"
    },
    {
      "id": 8,
      "start": 1259.6800270080566,
      "end": 1266.5400276184082,
      "text": " know her, understanding the things that she loves, and understanding what"
    },
    {
      "id": 9,
      "start": 1266.5400276184082,
      "end": 1272.1400260925293,
      "text": " makes her happy and what makes her sad. And I want to know all about her. Hey,"
    },
    {
      "id": 10,
      "start": 1272.1400260925293,
      "end": 1281.0200271606445,
      "text": " that same pursuit ought to be in the heart of believers. I want to know Him."
    },
    {
      "id": 11,
      "start": 1281.0200271606445,
      "end": 1287.8200302124023,
      "text": " Several years ago, Dr. Clarence Sexton called me and he said, Mike, I've been"
    },
    {
      "id": 12,
      "start": 1287.8200302124023,
      "end": 1292.9000244140625,
      "text": " invited to the White House. There's a meeting of Christian college presidents,"
    },
    {
      "id": 13,
      "start": 1292.9400253295898,
      "end": 1297.260025024414,
      "text": " we're going to meet with President Bush at the White House. I don't know how to"
    },
    {
      "id": 14,
      "start": 1297.260025024414,
      "end": 1300.780029296875,
      "text": " get over to the White House. Will you pick me up at National Airport? Will you"
    },
    {
      "id": 15,
      "start": 1300.780029296875,
      "end": 1304.9000244140625,
      "text": " drive me over to the White House and I'll get you into that meeting? And I"
    },
    {
      "id": 16,
      "start": 1304.9000244140625,
      "end": 1307.5800247192383,
      "text": " said, Preacher, I'll be glad to pick you up. You're not going to get me in that"
    },
    {
      "id": 17,
      "start": 1307.5800247192383,
      "end": 1310.5000305175781,
      "text": " meeting, but I'll be glad to pick you up, take you to the White House, wait for you,"
    },
    {
      "id": 18,
      "start": 1310.5000305175781,
      "end": 1316.540023803711,
      "text": " and take you back. Well, lo and behold, he got me in the meeting. And when we"
    },
    {
      "id": 19,
      "start": 1316.540023803711,
      "end": 1322.2200241088867,
      "text": " came into a room, about 25 seats, they sat me right there in front of the"
    },
    {
      "id": 20,
      "start": 1322.2200241088867,
      "end": 1327.540023803711,
      "text": " presidential lectern. And when President Bush came in, I don't know why, but he"
    },
    {
      "id": 21,
      "start": 1327.540023803711,
      "end": 1332.0600280761719,
      "text": " made eye contact with me and he talked as if he was talking to me the whole"
    },
    {
      "id": 22,
      "start": 1332.0600280761719,
      "end": 1335.9400253295898,
      "text": " time. I mean, we were just being buddies there. He's looking at me, I'm looking at"
    },
    {
      "id": 23,
      "start": 1335.9400253295898,
      "end": 1341.660026550293,
      "text": " him. Hour and eight minutes, he talks. When he gets done talking, he comes down"
    },
    {
      "id": 24,
      "start": 1341.660026550293,
      "end": 1346.9000244140625,
      "text": " around the pleasant presidential lectern, down one step, comes to my seat, takes my"
    },
    {
      "id": 25,
      "start": 1346.9000244140625,
      "end": 1352.8600311279297,
      "text": " hand, lifts me up, and shakes my hand. I am convinced he thought I was Rush Limbaugh."
    },
    {
      "id": 26,
      "start": 1352.8600311279297,
      "end": 1362.780029296875,
      "text": " As he's shaking my hand, I see a camera flash. About a week later, my secretary"
    },
    {
      "id": 27,
      "start": 1362.780029296875,
      "end": 1367.260025024414,
      "text": " called my office and said, Hey, the White House is on the phone. And I said, Right,"
    },
    {
      "id": 28,
      "start": 1367.260025024414,
      "end": 1372.9400329589844,
      "text": " sure. I took the call and it was the photographer of the White"
    },
    {
      "id": 29,
      "start": 1372.9400329589844,
      "end": 1378.5000305175781,
      "text": " House. And he said, Were you in a blue suit and a gold tie when you shook"
    },
    {
      "id": 30,
      "start": 1378.5000305175781,
      "end": 1383.3400268554688,
      "text": " President's hand? I said, Yes, I was. He said, Well, Reverend Edwards, the President"
    },
    {
      "id": 31,
      "start": 1383.3400268554688,
      "end": 1388.3800201416016,
      "text": " wants to send you something. About two weeks after that, I got in the mail a"
    },
    {
      "id": 32,
      "start": 1388.3800201416016,
      "end": 1395.5000305175781,
      "text": " beautifully framed picture of me shaking the hand of President George Bush. And"
    },
    {
      "id": 33,
      "start": 1395.5000305175781,
      "end": 1401.6600341796875,
      "text": " he's written on the photograph, Reverend Edwards, thanks for what you do. Pray for"
    },
    {
      "id": 34,
      "start": 1401.6600341796875,
      "end": 1406.6200256347656,
      "text": " me. Appreciate the opportunity to meet you. Now, I tell you all that to tell you"
    },
    {
      "id": 35,
      "start": 1406.6200256347656,
      "end": 1415.8600311279297,
      "text": " this. President Bush and I are very close friends. We're not close friends. He"
    },
    {
      "id": 36,
      "start": 1415.8600311279297,
      "end": 1420.9800262451172,
      "text": " wouldn't know me if he saw me. If I bumped into him on the street, I would"
    },
    {
      "id": 37,
      "start": 1420.9800262451172,
      "end": 1428.7400207519531,
      "text": " get arrested. No, if I were to know President Bush, it would mean that I"
    },
    {
      "id": 38,
      "start": 1428.7400207519531,
      "end": 1433.5800323486328,
      "text": " would have to sit down with him and converse with him. I would have to hear"
    },
    {
      "id": 39,
      "start": 1433.5800323486328,
      "end": 1438.8600311279297,
      "text": " him say what he thought about things and felt about things. I would have to give"
    },
    {
      "id": 40,
      "start": 1438.8600311279297,
      "end": 1443.780029296875,
      "text": " him a view of my heart. I would have to ask him questions. I would have to have"
    },
    {
      "id": 41,
      "start": 1443.780029296875,
      "end": 1450.0600280761719,
      "text": " lengthy talks with him to know him. You know one of my great fears for our"
    },
    {
      "id": 42,
      "start": 1450.1800231933594,
      "end": 1458.540023803711,
      "text": " generation of believers? We have become satisfied with a handshake with Jesus."
    },
    {
      "id": 43,
      "start": 1458.7400207519531,
      "end": 1464.8200225830078,
      "text": " It's all we have time for, because we're stressed and we're pressured and and"
    },
    {
      "id": 44,
      "start": 1464.8200225830078,
      "end": 1468.9800262451172,
      "text": " we're busy and we've got to be here and we've got to be there, and our intention"
    },
    {
      "id": 45,
      "start": 1468.9800262451172,
      "end": 1474.1000366210938,
      "text": " is always to know him. And we even dedicate a couple hours a week to go to"
    },
    {
      "id": 46,
      "start": 1474.1000366210938,
      "end": 1482.8600158691406,
      "text": " church to learn of him. But there needs to be a passion to sit down and be"
    },
    {
      "id": 47,
      "start": 1482.8600158691406,
      "end": 1492.1400146484375,
      "text": " spoken to and to speak to to know him. Secondly, not only must we have that"
    },
    {
      "id": 48,
      "start": 1492.1400146484375,
      "end": 1497.9800415039062,
      "text": " passion, there has to be a desire to know more of him, following on with that"
    },
    {
      "id": 49,
      "start": 1498.02001953125,
      "end": 1503.9400329589844,
      "text": " thought. David had the Lord, but he wanted to know more of the Lord. That"
    },
    {
      "id": 50,
      "start": 1503.9400329589844,
      "end": 1512.1800231933594,
      "text": " phrase in verse 1, early will I seek thee, has the thought of urgently awaiting"
    },
    {
      "id": 51,
      "start": 1512.1800231933594,
      "end": 1519.6200256347656,
      "text": " dawn, because you want something to take place. I have three children, all grown"
    },
    {
      "id": 52,
      "start": 1519.6200256347656,
      "end": 1525.1400146484375,
      "text": " and married and have seven grandkids, but my children were normal children. They"
    },
    {
      "id": 53,
      "start": 1525.1400146484375,
      "end": 1531.7000122070312,
      "text": " were very obedient and pleased us and pleased the Lord. But they didn't always"
    },
    {
      "id": 54,
      "start": 1531.7000122070312,
      "end": 1536.7400207519531,
      "text": " want to get up early, and I can remember one morning each year where they were"
    },
    {
      "id": 55,
      "start": 1536.7400207519531,
      "end": 1542.5800170898438,
      "text": " always ready to get up. As a matter of fact, I would fool around with them and"
    },
    {
      "id": 56,
      "start": 1542.5800170898438,
      "end": 1546.2600402832031,
      "text": " I'd say the night before, I'd say, you know, boy I'm not going in the office"
    },
    {
      "id": 57,
      "start": 1546.2600402832031,
      "end": 1551.7000122070312,
      "text": " tomorrow, I'm tired and I'm just gonna sleep till 10 or 11 o'clock. I've never"
    },
    {
      "id": 58,
      "start": 1551.7000122070312,
      "end": 1557.5400390625,
      "text": " done that in my life, but they'd go, oh dad, don't do that. And I'd hear the"
    },
    {
      "id": 59,
      "start": 1557.5400390625,
      "end": 1562.4400329589844,
      "text": " pitter-patter of little feet at about 5 or 5.30 or 6, and they would go sit on"
    },
    {
      "id": 60,
      "start": 1562.4400329589844,
      "end": 1567.02001953125,
      "text": " the steps and Melissa, our oldest, would say to the boys, don't make noise or"
    },
    {
      "id": 61,
      "start": 1567.02001953125,
      "end": 1572.7000122070312,
      "text": " he'll never get up. And then we'd get up and man they'd run downstairs. Can I ask"
    },
    {
      "id": 62,
      "start": 1572.7000122070312,
      "end": 1578.5800170898438,
      "text": " you a question? What morning of the year was that? It was Christmas morning. Why were"
    },
    {
      "id": 63,
      "start": 1578.5800170898438,
      "end": 1584.5400390625,
      "text": " they excited about getting up? Because there was something waiting for them."
    },
    {
      "id": 64,
      "start": 1584.5400390625,
      "end": 1590.9800415039062,
      "text": " There was something new, something they desired, there was something that excited"
    },
    {
      "id": 65,
      "start": 1590.9800415039062,
      "end": 1596.6400146484375,
      "text": " them. Can I ask you this question and answer yourself honestly, when was the"
    },
    {
      "id": 66,
      "start": 1596.6400146484375,
      "end": 1604.3000183105469,
      "text": " last time you approached the Word of God with anywhere near that excitement, that"
    },
    {
      "id": 67,
      "start": 1604.3000183105469,
      "end": 1610.6600341796875,
      "text": " desire, that sureness that something new was there and it was going to grip your"
    },
    {
      "id": 68,
      "start": 1610.6600341796875,
      "end": 1615.3000183105469,
      "text": " heart, grip your soul, and it was going to make a difference in what you did that"
    },
    {
      "id": 69,
      "start": 1615.3000183105469,
      "end": 1621.5400390625,
      "text": " day and in your life as you move forward? Where has that gone? And can I say to you"
    },
    {
      "id": 70,
      "start": 1621.5400390625,
      "end": 1629.4600219726562,
      "text": " I fear that most believers, because of the pressure and the schedule and the"
    },
    {
      "id": 71,
      "start": 1629.4600219726562,
      "end": 1639.02001953125,
      "text": " time and the pace, have lost the fervency of seeking the Lord in His Word, in the"
    },
    {
      "id": 72,
      "start": 1639.02001953125,
      "end": 1645.5000305175781,
      "text": " quiet of His Word. A.W. Tozer said this, and I quote,"
    },
    {
      "id": 73,
      "start": 1645.5000305175781,
      "end": 1653.9400329589844,
      "text": " complacency is a deadly foe of all spiritual growth. Come near to the holy"
    },
    {
      "id": 74,
      "start": 1654.1400146484375,
      "end": 1660.1800231933594,
      "text": " men and women of the past and you will soon feel the heat of their desire after"
    },
    {
      "id": 75,
      "start": 1660.1800231933594,
      "end": 1666.3000183105469,
      "text": " God. They mourned for Him, they prayed and wrestled and sought for Him day and"
    },
    {
      "id": 76,
      "start": 1666.3000183105469,
      "end": 1672.1400146484375,
      "text": " night, in season and out, and when they had found Him the finding was all the"
    },
    {
      "id": 77,
      "start": 1672.1400146484375,
      "end": 1679.4400329589844,
      "text": " sweeter for the long-seeking. You see, we have found so many other avenues to be"
    },
    {
      "id": 78,
      "start": 1679.4400329589844,
      "end": 1687.280029296875,
      "text": " satisfied in, so many other venues, so much other media, that in truth we don't"
    },
    {
      "id": 79,
      "start": 1687.280029296875,
      "end": 1694.6000366210938,
      "text": " even consider the absolute wonder of meeting God in quiet and allowing Him to"
    },
    {
      "id": 80,
      "start": 1694.6000366210938,
      "end": 1705.3200378417969,
      "text": " speak to us. There's always more to know. There's always ways that we can grow. May"
    },
    {
      "id": 81,
      "start": 1705.3200378417969,
      "end": 1710.1200256347656,
      "text": " we never come to the place where we think there is not something"
    },
    {
      "id": 82,
      "start": 1710.1200256347656,
      "end": 1717.5600280761719,
      "text": " else for us to learn, some other way for us to grow and mature. We never arrive,"
    },
    {
      "id": 83,
      "start": 1717.5600280761719,
      "end": 1726.4800415039062,
      "text": " and every morning, every day, should be a passionate search to know Him more and"
    },
    {
      "id": 84,
      "start": 1726.4800415039062,
      "end": 1733.2000122070312,
      "text": " to be more like Him. Here's number three, it's understanding that only God can"
    },
    {
      "id": 85,
      "start": 1733.2400512695312,
      "end": 1741.0400390625,
      "text": " fulfill the needs of our heart. Look at verse two a moment. I'm sorry, verse one,"
    },
    {
      "id": 86,
      "start": 1741.0400390625,
      "end": 1747.5599975585938,
      "text": " O God, thou art my God, early will I seek thee, my soul thirsteth for thee, my flesh"
    },
    {
      "id": 87,
      "start": 1747.5599975585938,
      "end": 1756.2000122070312,
      "text": " longeth for thee in a dry and thirsty land where no water is. Our schedules"
    },
    {
      "id": 88,
      "start": 1756.2000122070312,
      "end": 1761.5599975585938,
      "text": " push us past our time with God, and we think that in the excitement of the day"
    },
    {
      "id": 89,
      "start": 1761.5599975585938,
      "end": 1766.800048828125,
      "text": " or the busyness of the day we will find that which satisfies us, and the truth is"
    },
    {
      "id": 90,
      "start": 1766.800048828125,
      "end": 1772.1800537109375,
      "text": " we arrive home late in the evening exhausted physically and mentally and as"
    },
    {
      "id": 91,
      "start": 1772.1800537109375,
      "end": 1780.800048828125,
      "text": " unsatisfied as when we left and rushed into the day. David understood something,"
    },
    {
      "id": 92,
      "start": 1780.800048828125,
      "end": 1790.280029296875,
      "text": " that if the Lord wasn't in it, it didn't satisfy. Hey, he's lost the palace. He's"
    },
    {
      "id": 93,
      "start": 1790.280029296875,
      "end": 1798.1600341796875,
      "text": " not in the palace. He's lost his armies. He's lost his servants. He's lost his"
    },
    {
      "id": 94,
      "start": 1798.1600341796875,
      "end": 1806.7200317382812,
      "text": " staff. He has been reduced to nothing, and yet in this place we find him willing to"
    },
    {
      "id": 95,
      "start": 1806.7200317382812,
      "end": 1811.8400268554688,
      "text": " seek the Lord, because David had made a realization in his life that"
    },
    {
      "id": 96,
      "start": 1811.8400268554688,
      "end": 1816.2000122070312,
      "text": " satisfaction never was in"
    },
    {
      "id": 0,
      "start": 1816.2000122070312,
      "end": 1821.1800122261047,
      "text": " having a palace, that it never could be found in leading armies. As a matter of"
    },
    {
      "id": 1,
      "start": 1821.1800122261047,
      "end": 1825.6200122833252,
      "text": " fact, he came to understand that leading armies was really tough work that you"
    },
    {
      "id": 2,
      "start": 1825.6200122833252,
      "end": 1832.6200122833252,
      "text": " didn't want to do. I'm old enough to have lived through several bubbles, I think"
    },
    {
      "id": 3,
      "start": 1832.6200122833252,
      "end": 1838.1800117492676,
      "text": " most people in this room are. You remember the stock bubble, the tech stock"
    },
    {
      "id": 4,
      "start": 1838.1800117492676,
      "end": 1845.0000114440918,
      "text": " bubble, the 1980, 1998? All you got to do is buy a hundred shares of Cisco, Oracle,"
    },
    {
      "id": 5,
      "start": 1845.0000114440918,
      "end": 1851.0200119018555,
      "text": " or Microsoft, and you will be a millionaire! And I watched people leverage"
    },
    {
      "id": 6,
      "start": 1851.0200119018555,
      "end": 1857.4600105285645,
      "text": " themselves to buy stock, to buy stock, to buy stock, and then the bubble went pop."
    },
    {
      "id": 7,
      "start": 1857.4600105285645,
      "end": 1864.380012512207,
      "text": " You remember the housing bubble? Ooh, I was in the DC area in those days, and I"
    },
    {
      "id": 8,
      "start": 1864.380012512207,
      "end": 1868.1000137329102,
      "text": " would have people come to me, and they'd say, Preacher, you just don't understand,"
    },
    {
      "id": 9,
      "start": 1868.1000137329102,
      "end": 1873.9200134277344,
      "text": " and we never do, but they would say, I'm gonna buy this $750,000 house, now"
    },
    {
      "id": 10,
      "start": 1873.9200134277344,
      "end": 1878.940013885498,
      "text": " I've got $10,000 to put down, and I'm gonna leverage the rest, and I'd say"
    },
    {
      "id": 11,
      "start": 1878.940013885498,
      "end": 1884.6000137329102,
      "text": " that's not wise, that's not wise, that's not wise, and they'd say, no, it's gonna"
    },
    {
      "id": 12,
      "start": 1884.6000137329102,
      "end": 1890.5400085449219,
      "text": " continue to appreciate, I'm gonna flip it in two years and make a quarter mill!"
    },
    {
      "id": 13,
      "start": 1890.5400085449219,
      "end": 1899.1000137329102,
      "text": " Pop. And the house they bought for $750,000 was worth four. You say, Preacher, does"
    },
    {
      "id": 14,
      "start": 1899.1200103759766,
      "end": 1905.760009765625,
      "text": " this have a point? Yeah. Stop looking for it in the world. Stop looking for"
    },
    {
      "id": 15,
      "start": 1905.760009765625,
      "end": 1911.5600128173828,
      "text": " satisfaction in what you have. Stop looking for satisfaction in what you do"
    },
    {
      "id": 16,
      "start": 1911.5600128173828,
      "end": 1916.4000091552734,
      "text": " in your career. I'm not saying be bad at your career, I'm not saying don't be"
    },
    {
      "id": 17,
      "start": 1916.4000091552734,
      "end": 1924.4800109863281,
      "text": " secure, I'm saying to you that's not where your passion ought to lie! Because"
    },
    {
      "id": 18,
      "start": 1924.4800109863281,
      "end": 1930.500015258789,
      "text": " satisfaction is in Him, and when you lose the palace, you don't lose Him, and"
    },
    {
      "id": 19,
      "start": 1930.500015258789,
      "end": 1938.380012512207,
      "text": " when the stock blows up, you don't lose Him, because He is where satisfaction,"
    },
    {
      "id": 20,
      "start": 1938.380012512207,
      "end": 1943.4200134277344,
      "text": " that's what our flesh should long for. Very quickly, I've been too long, how does"
    },
    {
      "id": 21,
      "start": 1943.4200134277344,
      "end": 1950.280014038086,
      "text": " a person seek after God? Okay, Lord, or Preacher, I get it. Seeking after the Lord"
    },
    {
      "id": 22,
      "start": 1950.280014038086,
      "end": 1956.3800048828125,
      "text": " is to know Him, to desire to know more of Him, and to realize that knowing Him"
    },
    {
      "id": 23,
      "start": 1956.3800048828125,
      "end": 1960.9400177001953,
      "text": " and having Him is where real satisfaction is. Okay, how do I get it"
    },
    {
      "id": 24,
      "start": 1960.9400177001953,
      "end": 1966.1000061035156,
      "text": " done? How do I seek the Lord? Three thoughts, very quickly. Number one, keep a"
    },
    {
      "id": 25,
      "start": 1966.1000061035156,
      "end": 1977.8200073242188,
      "text": " passion for God. Keep a passion for God. I love what David says in verse 8, my soul"
    },
    {
      "id": 26,
      "start": 1977.8400115966797,
      "end": 1984.5600128173828,
      "text": " followeth hard after thee, thy right hand upholdeth me. What does David mean, I"
    },
    {
      "id": 27,
      "start": 1984.5600128173828,
      "end": 1990.4200134277344,
      "text": " follow hard after the Lord? What does that even mean? And can I suggest to you"
    },
    {
      "id": 28,
      "start": 1990.4200134277344,
      "end": 1995.3400115966797,
      "text": " that every person in this room knows what it means? If we were to take a"
    },
    {
      "id": 29,
      "start": 1995.3400115966797,
      "end": 2000.1400146484375,
      "text": " Strong's Concordance and look at it, we would find that that Hebrew word for"
    },
    {
      "id": 30,
      "start": 2000.1400146484375,
      "end": 2006.8600158691406,
      "text": " followeth hard is the exact word that God uses in Genesis chapter 22, or chapter"
    },
    {
      "id": 31,
      "start": 2006.8600158691406,
      "end": 2010.760009765625,
      "text": " 2 in verse 24, when he talks to a husband and a wife, and he says that we"
    },
    {
      "id": 32,
      "start": 2010.760009765625,
      "end": 2020.02001953125,
      "text": " are to cleave unto our wives. To follow hard after God is like a man cleaving"
    },
    {
      "id": 33,
      "start": 2020.02001953125,
      "end": 2027.9800109863281,
      "text": " after his wife, or for his wife. My wife and I, as you and your wife, love each"
    },
    {
      "id": 34,
      "start": 2027.9800109863281,
      "end": 2034.1000061035156,
      "text": " other. We have a romantic love, but we have something far greater than a"
    },
    {
      "id": 35,
      "start": 2034.1400146484375,
      "end": 2040.500015258789,
      "text": " romantic love. We have a committed love. We have a love that goes beyond the ups"
    },
    {
      "id": 36,
      "start": 2040.500015258789,
      "end": 2046.9400177001953,
      "text": " and downs of life and just is committed. There is no one in my life that I have a"
    },
    {
      "id": 37,
      "start": 2046.9400177001953,
      "end": 2053.1400146484375,
      "text": " closer relationship to on this earth, other than the Lord, than my wife. No one"
    },
    {
      "id": 38,
      "start": 2053.1400146484375,
      "end": 2060.5800170898438,
      "text": " comes before my wife. No hobby, no interest, no work comes before my wife. No"
    },
    {
      "id": 39,
      "start": 2060.5800170898438,
      "end": 2067.540008544922,
      "text": " child, no grandchild, maybe my puppy Emma."
    },
    {
      "id": 40,
      "start": 2068.02001953125,
      "end": 2078.5,
      "text": " Kidding. I love to fish. My wife does not love to fish. If my wife came to me and"
    },
    {
      "id": 41,
      "start": 2078.5,
      "end": 2083.1800231933594,
      "text": " said, honey, I know you had this fishing trip planned, but I need you"
    },
    {
      "id": 42,
      "start": 2083.1800231933594,
      "end": 2088.6200256347656,
      "text": " to do this, can I assure you of something? The rods and the reels would be put up"
    },
    {
      "id": 43,
      "start": 2088.6200256347656,
      "end": 2094.220001220703,
      "text": " immediately. Now I'm not trying to be silly and all that, I'm trying to"
    },
    {
      "id": 44,
      "start": 2094.220001220703,
      "end": 2103.5,
      "text": " illustrate how quickly we set God aside to do everything else. I'd meet with you"
    },
    {
      "id": 45,
      "start": 2103.5,
      "end": 2107.779998779297,
      "text": " in the morning, God, but traffic. I'd meet with you in the morning, God, but I've"
    },
    {
      "id": 46,
      "start": 2107.779998779297,
      "end": 2113.3400268554688,
      "text": " got another meeting. I'd meet with you in the morning, God, but I got kids! Kids"
    },
    {
      "id": 47,
      "start": 2113.3400268554688,
      "end": 2123.3800048828125,
      "text": " were never given to us to be an excuse to not know God. What are you saying, preacher? I'm"
    },
    {
      "id": 48,
      "start": 2123.3800048828125,
      "end": 2129.6200256347656,
      "text": " saying he's got to be first, and he's got to take precedence, and I know we talk"
    },
    {
      "id": 49,
      "start": 2129.6200256347656,
      "end": 2135.3400268554688,
      "text": " about knowing the Lord and walking with the Lord. I'm not asking tonight if we"
    },
    {
      "id": 50,
      "start": 2135.3400268554688,
      "end": 2141.8200073242188,
      "text": " know that we ought to, I'm asking have we instituted in our lives the discipline"
    },
    {
      "id": 51,
      "start": 2141.8200073242188,
      "end": 2149.0599975585938,
      "text": " where God is first, and we follow hard after God, and we never put him second."
    },
    {
      "id": 52,
      "start": 2149.0599975585938,
      "end": 2157.5,
      "text": " We never put him second. When I pastored for so many years in Woodbridge, Woodbridge,"
    },
    {
      "id": 53,
      "start": 2157.5,
      "end": 2162.02001953125,
      "text": " for those of you that know nothing about the south part of this great capital"
    },
    {
      "id": 54,
      "start": 2162.02001953125,
      "end": 2168.3400268554688,
      "text": " area, is 22 miles from the Washington Monument. Most of my men worked in one of"
    },
    {
      "id": 55,
      "start": 2168.3400268554688,
      "end": 2172.300018310547,
      "text": " the alphabet parts of the government, or the Pentagon, or Crystal City, somewhere"
    },
    {
      "id": 56,
      "start": 2172.300018310547,
      "end": 2178.779998779297,
      "text": " there, and if they had to be at their desk at 8, they had to be on I-95 to go"
    },
    {
      "id": 57,
      "start": 2178.779998779297,
      "end": 2186.1400146484375,
      "text": " all of 22 miles. They had to be on 95 at 515, which meant if they wanted to brush"
    },
    {
      "id": 58,
      "start": 2186.1400146484375,
      "end": 2191.1800231933594,
      "text": " their teeth, they had to be up at 430, which means if they wanted to meet with"
    },
    {
      "id": 59,
      "start": 2191.1800231933594,
      "end": 2199.779998779297,
      "text": " God in the morning. I've had men come to me and say, preacher, do you understand I"
    },
    {
      "id": 60,
      "start": 2199.779998779297,
      "end": 2206.3400268554688,
      "text": " get up at 430? Do you understand that I have a high-pressure and fast-paced job,"
    },
    {
      "id": 61,
      "start": 2206.3400268554688,
      "end": 2213.4600219726562,
      "text": " and yet you're saying to me that you think I need to get up before 430 to"
    },
    {
      "id": 62,
      "start": 2213.4600219726562,
      "end": 2224.220001220703,
      "text": " meet with God? And with no arrogance, no arrogance, and no false bravado, I would"
    },
    {
      "id": 63,
      "start": 2224.220001220703,
      "end": 2232.6600036621094,
      "text": " say to them, yes, that's what I'm saying to you. Because there's not a day in your"
    },
    {
      "id": 64,
      "start": 2232.6600036621094,
      "end": 2240.260009765625,
      "text": " life you're wise enough to be your wife's husband without God's leadership."
    },
    {
      "id": 65,
      "start": 2240.260009765625,
      "end": 2245.6200256347656,
      "text": " There's not a day in your life where you're good enough to be your children's"
    },
    {
      "id": 66,
      "start": 2245.6200256347656,
      "end": 2252.6200256347656,
      "text": " father without God's leadership. There's not a day that you're strong enough to"
    },
    {
      "id": 67,
      "start": 2252.6200256347656,
      "end": 2259.4200134277344,
      "text": " go into that world place and serve alongside those who are lost and have no"
    },
    {
      "id": 68,
      "start": 2259.4200134277344,
      "end": 2266.1400146484375,
      "text": " vision of your God. There's not a day that you're strong enough without God. I"
    },
    {
      "id": 69,
      "start": 2266.4600219726562,
      "end": 2273.1800231933594,
      "text": " know it's hard, and I take no pleasure in saying it, but yes, that's what I'm saying"
    },
    {
      "id": 70,
      "start": 2273.1800231933594,
      "end": 2281.5,
      "text": " to you. Time with God is more important. We have to find time to spend consistent"
    },
    {
      "id": 71,
      "start": 2281.5,
      "end": 2292.720001220703,
      "text": " time with him alone, alone. David had provisions to take care of, protection to"
    },
    {
      "id": 72,
      "start": 2292.720001220703,
      "end": 2299.2000122070312,
      "text": " provide. David no doubt wanted to rush to his family and rush to his children"
    },
    {
      "id": 73,
      "start": 2299.2000122070312,
      "end": 2304.4400024414062,
      "text": " and hold them. He was frightened for them, but he understood something, that it was"
    },
    {
      "id": 74,
      "start": 2304.4400024414062,
      "end": 2311.040008544922,
      "text": " time alone with God that would give him the ability to provide for them what he"
    },
    {
      "id": 75,
      "start": 2311.040008544922,
      "end": 2317.6400146484375,
      "text": " needed. Time alone. Listen, fatherhood in our nation, I'm afraid, has been reduced"
    },
    {
      "id": 76,
      "start": 2317.6400146484375,
      "end": 2321.6000061035156,
      "text": " to taking our kids to Disney World or standing on the side of a soccer field"
    },
    {
      "id": 77,
      "start": 2321.6000061035156,
      "end": 2326.8800048828125,
      "text": " and cheering, and I'm glad for that, and I'm not against that, but I'm telling you,"
    },
    {
      "id": 78,
      "start": 2326.8800048828125,
      "end": 2335.8400268554688,
      "text": " time alone with God prepares the heart and gives wisdom. And then I would say"
    },
    {
      "id": 79,
      "start": 2335.8400268554688,
      "end": 2340.7200317382812,
      "text": " that we have to place God in every part of our life and every part of our home. I"
    },
    {
      "id": 80,
      "start": 2340.7200317382812,
      "end": 2347.3200073242188,
      "text": " tell this story to just illustrate it. When we were starting Heritage, it took"
    },
    {
      "id": 81,
      "start": 2347.3200073242188,
      "end": 2352.7200317382812,
      "text": " everything we had, and it was just my wife and three kids, myself, and back in"
    },
    {
      "id": 82,
      "start": 2352.7200317382812,
      "end": 2359.280029296875,
      "text": " the 80s, early 80s, and for every mother in here, there were days in America where"
    },
    {
      "id": 83,
      "start": 2359.280029296875,
      "end": 2363.8800048828125,
      "text": " your children did not have to be in a car seat. And so we had been out passing"
    },
    {
      "id": 84,
      "start": 2363.8800048828125,
      "end": 2368.239990234375,
      "text": " out tracks, and we were coming back into the church parking lot, old ramshackle"
    },
    {
      "id": 85,
      "start": 2368.239990234375,
      "end": 2372.6799926757812,
      "text": " building, and the two kids were in the back, and our youngest, Josh, maybe two and"
    },
    {
      "id": 86,
      "start": 2372.6799926757812,
      "end": 2377.7200317382812,
      "text": " a half, three years old, was, I think, standing between me and Nancy, and Nancy"
    },
    {
      "id": 87,
      "start": 2377.7200317382812,
      "end": 2382.0400390625,
      "text": " had her arm around him, and we pulled into the church parking lot, and he"
    },
    {
      "id": 88,
      "start": 2382.0400390625,
      "end": 2392.7200317382812,
      "text": " said, we home, we home. I looked at Nancy, and at first she was just almost get"
    },
    {
      "id": 89,
      "start": 2392.7200317382812,
      "end": 2397.239990234375,
      "text": " ready to cry because she was thinking to herself, he doesn't even know where he"
    },
    {
      "id": 90,
      "start": 2397.239990234375,
      "end": 2404.7200317382812,
      "text": " lives, not the brightest child. No, you know, we talked about it, we've never"
    },
    {
      "id": 91,
      "start": 2404.7200317382812,
      "end": 2411.52001953125,
      "text": " regretted, that our kids didn't see the distinction of having to be home to be"
    },
    {
      "id": 92,
      "start": 2411.52001953125,
      "end": 2415.6000366210938,
      "text": " comfortable, having to be here to be comfortable. They were as comfortable"
    },
    {
      "id": 93,
      "start": 2415.6000366210938,
      "end": 2418.4000244140625,
      "text": " with"
    },
    {
      "id": 0,
      "start": 2418.4000244140625,
      "end": 2423.80002450943,
      "text": " being at church, in living their life at church, and I don't mean just church, I"
    },
    {
      "id": 1,
      "start": 2423.80002450943,
      "end": 2432.6800241470337,
      "text": " mean in Jesus. And being passionate about knowing God and seeking God takes us to"
    },
    {
      "id": 2,
      "start": 2432.6800241470337,
      "end": 2440.120023727417,
      "text": " the places we serve. We've lived in a world, I'll talk about it tomorrow night,"
    },
    {
      "id": 3,
      "start": 2440.120023727417,
      "end": 2446.760025024414,
      "text": " where the word self has been served has been replaced with the word self. But you"
    },
    {
      "id": 4,
      "start": 2446.760025024414,
      "end": 2454.44002532959,
      "text": " and I, if we're seeking the Lord, it will take us to the places where we serve. And"
    },
    {
      "id": 5,
      "start": 2454.44002532959,
      "end": 2459.360023498535,
      "text": " I want you to notice just this, and with this I am done. Would you remind yourself"
    },
    {
      "id": 6,
      "start": 2459.360023498535,
      "end": 2466.6800231933594,
      "text": " that David is in a cave, he's lost his palace, he's lost his armies, his servants,"
    },
    {
      "id": 7,
      "start": 2466.6800231933594,
      "end": 2472.5600242614746,
      "text": " he has no meal prepared for him this morning, he's probably cold and damp. And"
    },
    {
      "id": 8,
      "start": 2472.5600242614746,
      "end": 2480.4000244140625,
      "text": " yet look at verse 5, my soul shall be satisfied as with marrow and fatness."
    },
    {
      "id": 9,
      "start": 2480.4000244140625,
      "end": 2486.880027770996,
      "text": " Satisfied with marrow and fatness. David, you've lost it all. And he would reply to"
    },
    {
      "id": 10,
      "start": 2486.880027770996,
      "end": 2494.4000244140625,
      "text": " us, I haven't lost God. I want you to notice in verse 7, because thou has been"
    },
    {
      "id": 11,
      "start": 2494.4000244140625,
      "end": 2501.1200256347656,
      "text": " my health, therefore in the shadow of thy wings will I rejoice. Rejoice? David, you"
    },
    {
      "id": 12,
      "start": 2501.1200256347656,
      "end": 2506.0800247192383,
      "text": " ought to need antidepressant medicine. You're in a cave, dude, you've lost"
    },
    {
      "id": 13,
      "start": 2506.0800247192383,
      "end": 2511.320022583008,
      "text": " everything, you may well lose your life this day. And David says, huh, you know"
    },
    {
      "id": 14,
      "start": 2511.320022583008,
      "end": 2516.6800231933594,
      "text": " what? I live in the shadow of his wings, been in scrapes before. I rejoice! Look at"
    },
    {
      "id": 15,
      "start": 2516.6800231933594,
      "end": 2527.040023803711,
      "text": " verse 11, but the king shall rejoice in God. Notice verse 3, because thy loving"
    },
    {
      "id": 16,
      "start": 2527.040023803711,
      "end": 2534.9600219726562,
      "text": " kindness is better than life, my lips shall praise thee. Praise God? David, he's"
    },
    {
      "id": 17,
      "start": 2534.9600219726562,
      "end": 2540.320022583008,
      "text": " forsaken you. Don't you understand, David? He must not care about you, you've lost"
    },
    {
      "id": 18,
      "start": 2540.320022583008,
      "end": 2547.2000274658203,
      "text": " everything. Look at verse 4, thus will I bless thee while I live. I will lift up"
    },
    {
      "id": 19,
      "start": 2547.2000274658203,
      "end": 2553.3600311279297,
      "text": " my hands in thy name. You know what I see? I see David not as a great and grand"
    },
    {
      "id": 20,
      "start": 2553.3600311279297,
      "end": 2560.6000213623047,
      "text": " king, but as a humbled man seeking God's help and protection, and in this cave as"
    },
    {
      "id": 21,
      "start": 2560.6000213623047,
      "end": 2566.6800231933594,
      "text": " the sun is coming up, and maybe shivering and damp, and maybe frightened"
    },
    {
      "id": 22,
      "start": 2566.6800231933594,
      "end": 2575.1200256347656,
      "text": " and worried about what the day holds, and yet I see this man lifting his hands to the Lord,"
    },
    {
      "id": 23,
      "start": 2575.1200256347656,
      "end": 2590.320022583008,
      "text": " praising the Lord. I wonder if we don't praise the Lord more because we're not"
    },
    {
      "id": 24,
      "start": 2590.320022583008,
      "end": 2600.240020751953,
      "text": " correctly seeking him. I wonder if we lack joy in our lives because we are so"
    },
    {
      "id": 25,
      "start": 2600.240020751953,
      "end": 2606.040023803711,
      "text": " exhausted by going the direction this world pushes us. I don't mean worldly"
    },
    {
      "id": 26,
      "start": 2606.040023803711,
      "end": 2612.9600219726562,
      "text": " stuff, I don't mean carnal stuff, I mean just the absolute necessity sometimes of"
    },
    {
      "id": 27,
      "start": 2612.9600219726562,
      "end": 2618.320022583008,
      "text": " life, and we just get our priorities wrong, and we're busy, and we're"
    },
    {
      "id": 28,
      "start": 2618.320022583008,
      "end": 2627.3600311279297,
      "text": " running, and we're moving, and we're doing, and we're joyless. I wonder if we never"
    },
    {
      "id": 29,
      "start": 2627.3600311279297,
      "end": 2634.8400268554688,
      "text": " feel satisfied, and never have that sense, because in truth what is missing"
    },
    {
      "id": 30,
      "start": 2634.8400268554688,
      "end": 2648.480026245117,
      "text": " from our lives is the absolute priority of seeking Him first. I want to go on"
    },
    {
      "id": 31,
      "start": 2648.480026245117,
      "end": 2653.0800170898438,
      "text": " forever, but I'm not. I'm going to tell what preacher told me just a few moments"
    },
    {
      "id": 32,
      "start": 2653.0800170898438,
      "end": 2659.000030517578,
      "text": " ago, just so impressed me. A missionary, Stephen Trell, I'll just give his name,"
    },
    {
      "id": 33,
      "start": 2659.000030517578,
      "end": 2665.6800231933594,
      "text": " but not where he's at, had a young man that wanted to walk beside him, wanted to"
    },
    {
      "id": 34,
      "start": 2665.6800231933594,
      "end": 2670.240020751953,
      "text": " carry some very small packages, and just was persistent, I want to be by you, I"
    },
    {
      "id": 35,
      "start": 2670.240020751953,
      "end": 2674.2000274658203,
      "text": " want to carry that, I want to be around you, I want to be by you, and finally"
    },
    {
      "id": 36,
      "start": 2674.2000274658203,
      "end": 2679.6400146484375,
      "text": " this missionary asked the young man, why do you want to be by me? Because he said,"
    },
    {
      "id": 37,
      "start": 2679.6400146484375,
      "end": 2686.0400390625,
      "text": " every time I see you, there just seems to be light. I want to get close to that"
    },
    {
      "id": 38,
      "start": 2686.0400390625,
      "end": 2693.8400268554688,
      "text": " light. Does anybody want to be around you?"
    },
    {
      "id": 39,
      "start": 2694.0800170898438,
      "end": 2702.0800170898438,
      "text": " Does anybody sniff God on you? Does anybody look at you and say, man, I'm"
    },
    {
      "id": 40,
      "start": 2702.0800170898438,
      "end": 2706.3600158691406,
      "text": " miserable in this pandemic. Look at them, they're all filled with joy. Well, you"
    },
    {
      "id": 41,
      "start": 2706.6800231933594,
      "end": 2711.240020751953,
      "text": " don't understand, Pastor, I have to wear a mask, I have to get a vaccine, I have to"
    },
    {
      "id": 42,
      "start": 2711.240020751953,
      "end": 2719.7200317382812,
      "text": " do this, and you just don't understand, and David had lost it all. And he had joy,"
    },
    {
      "id": 43,
      "start": 2719.7200317382812,
      "end": 2727.760009765625,
      "text": " and he praised God, and he was satisfied, and by the way, people were drawn to him,"
    },
    {
      "id": 44,
      "start": 2727.760009765625,
      "end": 2735.240020751953,
      "text": " and people came to help him, and God had never forsaken him, because that king"
    },
    {
      "id": 45,
      "start": 2735.240020751953,
      "end": 2744.000030517578,
      "text": " humbled on his knees in a cave. I said, it's early, sun's coming up, I think I'll"
    },
    {
      "id": 46,
      "start": 2744.000030517578,
      "end": 2755.240020751953,
      "text": " keep my priorities straight and seek God early. It will make all the difference."
    },
    {
      "id": 47,
      "start": 2755.240020751953,
      "end": 2763.1200256347656,
      "text": " Would you pray with me? Father, we're so grateful for your blessing. We just stand"
    },
    {
      "id": 48,
      "start": 2763.1200256347656,
      "end": 2772.6000366210938,
      "text": " amazed at our salvation. Lord, I'm not glad I got saved later in life, but I am"
    },
    {
      "id": 49,
      "start": 2772.6000366210938,
      "end": 2782.000030517578,
      "text": " glad that I understand the miracle of it, the wonder of it. Lord, I just want more"
    },
    {
      "id": 50,
      "start": 2782.000030517578,
      "end": 2789.560028076172,
      "text": " of you. I want to understand your Word, and I want to obey it. I want to be able"
    },
    {
      "id": 51,
      "start": 2789.560028076172,
      "end": 2800.480010986328,
      "text": " to share it. I want influence. I want all that, not selfishly, but Lord, the key to"
    },
    {
      "id": 52,
      "start": 2800.480010986328,
      "end": 2810.240020751953,
      "text": " all of that is not rushing off into life without you. It is understanding that in"
    },
    {
      "id": 53,
      "start": 2810.240020751953,
      "end": 2818.9200134277344,
      "text": " our lives, you must always be the priority. You are always number one. You"
    },
    {
      "id": 54,
      "start": 2819.000030517578,
      "end": 2825.560028076172,
      "text": " are always to be our passion, and other things have to be put to the side. Other"
    },
    {
      "id": 55,
      "start": 2825.560028076172,
      "end": 2830.6800231933594,
      "text": " things have to be put second, and third, and fourth, and nothing can take your"
    },
    {
      "id": 56,
      "start": 2830.6800231933594,
      "end": 2838.480010986328,
      "text": " place. And Lord, if we will discipline our lives that way, we will find what David"
    },
    {
      "id": 57,
      "start": 2838.480010986328,
      "end": 2846.0800170898438,
      "text": " found, that we can praise you even when our circumstances are dire, that we can"
    },
    {
      "id": 58,
      "start": 2846.0800170898438,
      "end": 2854.280029296875,
      "text": " rejoice in you even when it seems we've lost everything else. And the deepest"
    },
    {
      "id": 59,
      "start": 2854.280029296875,
      "end": 2861.560028076172,
      "text": " satisfaction a life can know, morrow and fatness, we can have joy in the blessings"
    },
    {
      "id": 60,
      "start": 2861.560028076172,
      "end": 2869.9600219726562,
      "text": " you give because we have you, and we know you. Lord, if there is ever to be revival"
    },
    {
      "id": 61,
      "start": 2870.0800170898438,
      "end": 2880.280029296875,
      "text": " in this nation, in this community, it will be when Christians decide to re-establish"
    },
    {
      "id": 62,
      "start": 2880.280029296875,
      "end": 2888.6400146484375,
      "text": " priorities with you and seeking you first. Would you speak to our hearts"
    },
    {
      "id": 63,
      "start": 2888.6400146484375,
      "end": 2895.760009765625,
      "text": " about that tonight? And I say to those who are on livestream, listen, God is not"
    },
    {
      "id": 64,
      "start": 2895.760009765625,
      "end": 2902.0400390625,
      "text": " mad at us when we realize these things, and we understand that we've mixed up"
    },
    {
      "id": 65,
      "start": 2902.0400390625,
      "end": 2907.4000244140625,
      "text": " our priorities. God is glad when we make that realization, and I pray that you'll"
    },
    {
      "id": 66,
      "start": 2907.4000244140625,
      "end": 2913.9200134277344,
      "text": " make your chair, your sofa, your kitchen chair, your altar, and take a few"
    },
    {
      "id": 67,
      "start": 2913.9200134277344,
      "end": 2919.6400146484375,
      "text": " moments on your knees before God and say, God, my priorities have gotten mixed up."
    },
    {
      "id": 68,
      "start": 2919.6400146484375,
      "end": 2924.800018310547,
      "text": " I'm missing joy. I'm not happy or satisfied, and it's because I've put"
    },
    {
      "id": 69,
      "start": 2924.800018310547,
      "end": 2932.4400024414062,
      "text": " other things before you. And if there's one under the sound of my voice that"
    },
    {
      "id": 70,
      "start": 2932.4400024414062,
      "end": 2939.1199951171875,
      "text": " doesn't know Jesus, can I assure you that he is seeking you tonight, and he loves"
    },
    {
      "id": 71,
      "start": 2939.1199951171875,
      "end": 2946.800048828125,
      "text": " you. And if you will but call upon him, confessing and admitting your sin and"
    },
    {
      "id": 72,
      "start": 2946.800048828125,
      "end": 2951.760009765625,
      "text": " asking him to be your Savior, whosoever shall call upon the name of the Lord"
    },
    {
      "id": 73,
      "start": 2951.760009765625,
      "end": 2960.3600463867188,
      "text": " shall be saved. So Holy Spirit, would you work now and speak to us, I pray, in Jesus"
    },
    {
      "id": 74,
      "start": 2960.3600463867188,
      "end": 2964.3200073242188,
      "text": " name. Amen."
    }
  ],
  "processed_at": "2025-04-17T03:40:21.854158"
}