{
  "video_id": "ZadXdqo8T-A",
  "text": "book of First Thessalonians, nor the second book of Thessalonians. However, over the next several months, we're going to study through these two books and really looking at the concluding statements that are made in each of the books. I've titled the series, Walkworthy and Please God. Walkworthy and Please God. And so on Wednesday nights, for the next several months, we're going to have this subject matter of Walkworthy and Please God. On Sunday evening, the last service of 2023, I preached a message from the book of Ecclesiastes, and here the conclusion of the whole matter. This is the whole duty of man. What was it? Fear God and keep His commandments. And we find that as we come to the New Testament, even as we mentioned on Sunday evening, looking at Ephesians 5 and verse number 10, and a number of other passages in the New Testament as well, that we find that in the New Testament, God has given us instruction as a local church on how we are to behave. In fact, in 1 Timothy 3 and verse 15, in a few months, we'll get to that portion of Scripture. We find that the Bible says that Timothy is receiving this instruction in Paul so that if I tarry long, that thou know how thou oughtest to behave thyself in the house of God. And we understand that there is appropriate behavior in God's house, and there is that behavior that would please God. As we think about the church at Thessalonica, and really this evening starting an introductory kind of a lesson to this series of Walkworthy and Please God, I've titled the message tonight, Simply Walkworthy. And as we think about the church at Thessalonica, it was during the second missionary journey that the Apostle Paul was used of the Lord to travel to the city of Thessalonica. As best we can tell, because of the opposition that was faced, Paul was there for just a brief time. We'll look at Acts 17 here in just a moment. But we find that God would use the Apostle Paul, under the inspiration of the Holy Spirit of God, to write two letters to this church at Thessalonica. Notice, if you will, in 1 Thessalonians 2 and verse number 12, and I'm going to read the two verses that we're going to use really as theme verses as we study here on Wednesday evenings this thought of Walkworthy and Please God. In 1 Thessalonians 2 and verse number 12, the Bible says that you would walk worthy of God, who hath called you unto his kingdom and glory. Then skip over, if you will, to 1 Thessalonians chapter number 4, and look at verse 1. The Bible says, furthermore then, we beseech you, brethren, and exhort you by the Lord Jesus, that as you have received of us, notice, how you ought to walk and to please God, so you would abound more and more, for ye know what commandments we gave you by the Lord Jesus. We mentioned on Sunday evening about fearing God and keeping his commandments. We looked at a number of passages in the book of Deuteronomy specifically, where the Bible said that we're to know all of his commandments at all times. And we find that as Paul would write here to the church at Thessalonica, he says, for ye know what commandments we gave you by the Lord Jesus in verse 2 of chapter 4. As you take the content of 1 and 2 Thessalonians and you think about this local church, God is giving this church instruction with regard to how they can walk worthy and please God. As we begin to think about the ministry in Thessalonica and the opposition that was faced, if you hold your place here and turn back to Acts 17, we'll just look very briefly at these few verses and see what happened there as this church was established. In Acts 17 and verse number 1, we'll just look at a few verses here. The Bible says, now when they had passed through Amphipolis and Apollonia, they came to Thessalonica. Notice the Bible says where was a synagogue of the Jews. And Paul, according to verse number 2, as his manner was, went in unto them and three Sabbath days reasoned with them out of the scriptures. He used the Old Testament. He used the word of God. He used the scriptures that are available. Notice the Bible says that he did this for three Sabbath days. That's why we understand that it was a short period of time that Paul was there in Thessalonica. Notice in verse 3, what is he giving them? What is he teaching them? Opening and alleging that Christ must needs have suffered and risen again from the dead. And that this Jesus whom I preach unto you is Christ. Now there's a whole message right in verse number 3 with regard to the message that the Apostle Paul is delivering to these Jewish folks at this synagogue in Thessalonica. And the name Jesus means Jehovah is salvation, God incarnate. When he, Paul, would reference Jesus, they would understand that the individual, the person that he was speaking of. And we find that he says that this Jesus whom I preach unto you is Christ. He is the anointed one. He is the Messiah. He is the Son of God, God in flesh. And we find that the Bible says in verse number 4, some of them believed and consorted with Paul and Silas, some of the devout Greeks, a great multitude, and of the chief women not a few. But the Jews which believed not moved with envy, took unto them certain lewd fellows of the baser sort, and gathered company, and set all the city of an uproar, and assaulted the house of Jason, and sought to bring them out to the people. And so we find that due to the opposition, again, Paul was not there in Thessalonica for a long time. He would be sent to Berea, if you continue to read through, and we're not going to take the time to do so, but we find that in verse number 10, the brethren sent Paul and Silas away. They sent him to Berea, and he's not in Berea very long. And the people from Thessalonica that were upset, that caused the uproar, they follow him to Berea, and Paul ends up in Athens. And we find that when he's in Athens, of course he's there, and his spirit is moved within him because he sees a city that is wholly given to idolatry, and he preaches to them Christ. But we find that in this brief time that the Apostle Paul was in Thessalonica, that the gospel was preached, souls were saved, and a local church was established. And that's exciting for us to understand how God moved and worked through this second missionary journey to see a local church established. Now, we find that God, again, as I mentioned a few moments ago, would use Paul to then write these two letters, 1 Thessalonians and 2 Thessalonians, back to this church that was established on this second missionary journey. In many ways, the church in Thessalonica is a model church. We use that terminology. You've heard me use it before. I've said something like this, there's no perfect church, there's no perfect church members, there's no perfect pastor. We're all sinners saved by grace, and we're not perfect, but we serve a perfect God. We have a perfect book, and we ought to be thankful for that. But we understand that this church that we find in Thessalonica, really in a number of ways, is a model church. As you study through 1 and 2 Thessalonians, you will discover much for which this church will be commended for. However, in the conclusion of each letter, in 1 Thessalonians chapter 1, excuse me, chapter 5, verses 12-28, and 2 Thessalonians chapter 3, verses 6-18, in each of the conclusions of these two letters, we find that Paul leaves the believers with practical instruction. The practical instruction that he gives them is so that they might walk worthy and please God. Just as we've titled this mini-series over the next several months, we've looked at the verses already in 1 Thessalonians 2, 12, and chapter 4, verses 1-2, and we find that this instruction is provided so that these believers, this church at Thessalonica, this body of believers, that they could walk worthy and please God. God has providentially preserved this instruction for every generation of believers. Now that's exciting. I'm thankful that God would give the instruction to the church at Thessalonica, hey, here's some instruction, here's some practical instruction on how you can walk worthy and how you can please God. But then God providentially preserved that for every generation of believers. Therefore, we conclude that the principles in the closing verses of each of these books are to be known and implemented by every local church. We find that as God would preserve it, He didn't preserve it so that we could just look back a couple of thousand years at a church and say, well, that was good instruction for that church. No, our God is an eternal God. He has no beginning, no ending, and He gave instruction to this local church in Thessalonica. He's preserved it for us so that we can take those principles and we can know them and we can implement them so that we can walk worthy and please God. Now, over the next several months, we will examine those principles to ensure that we can know them and implement them. Again, chapter number 5, beginning in verse number 12, going through the end of the chapter. And then in 2 Thessalonians chapter number 3, beginning in verse number 6 and going through the end of the chapter. There are a number of principles. In fact, as you read the latter part of 1 Thessalonians chapter number 5, really beginning in verse number 16, it's like just, bam, bullet points almost of just practical instruction for the church. And so we're going to take the time over the next several months to dig into these principles so that we, as a local church, just as the church at Thessalonica could take and incorporate these principles, abide by them, thus pleasing God and walking worthy that we too can do that same thing. Tonight, before we jump into the latter portion of these books... Tonight I want to briefly examine this church at Thessalonica and really consider why it is that so often we refer to this church as being a model church. There are five truths that I want to look at briefly through these two books this evening that would give us reason to say the church at Thessalonica is a model church. Now why am I laying this groundwork? We could understand if God is writing to the church in Corinth and saying, hey, here's some things that you need to do to walk worthy and please God. Why? Because the church at Corinth was a mess. The church at Corinth had divisions and all sorts of problems that were going on in Corinth. In fact, you can go through the book of 1 Corinthians and you can find 12 or 15 different things that were going on in Corinth that would help us to understand the church in Corinth was in no way, shape, or form a model church. They needed some instruction. They needed to apply some things. They were just all sorts of divisions and contentions that were prevalent within that local church. But we look at a church like Thessalonica, we say, man, this is a model church. This is a good church. This is a church that's doing something for God, and they were. And yet, at the end of each book, God gives them a list of principles and says, listen, if you want to walk worthy and you want to please me, here's some things that you need to be aware of and that you need to implement. One thing that I find in our Christian life is that we never arrive. We never arrive. There's always room for spiritual growth. We find that there's never time for days off. There's never time that we can just kind of throw in the towel and say, man, we can coast for a little while. Because if you decide to do that, then before long you're going to be going backwards instead of going forward. Our theme, continue, the idea to persevere, to go on, to continue, to move forward. We're not just sitting on the premises. We're not just in a defensive posture. We're to be going forth with the gospel of Jesus Christ, continuing, and we find that even for a model church, a church that is commended for a number of things, we find that there is instruction, practical principles that are given to them in each of these letters whereby God is saying, listen, don't forget these things. Remember to continue doing these things, and in so doing, you will walk worthy and please God. Number one on why this church, why I would say this church is a model church, number one, they were growing spiritually. They were growing spiritually. So often we speak about the importance of growing numerically, and no doubt that is a byproduct of spiritual growth, and a church should be growing numerically, and we desire to grow numerically, but we must understand the importance of a church growing spiritually, of individual believers growing spiritually. The Bible tells us as newborn babes desire the sincere milk of the word that ye may grow thereby. And we find that this church, I would say, is a model church because they were growing spiritually. They were members of this church. Remember the church is not a building. The church is the believers, the people of God, and they were growing spiritually. Look in 1 Thessalonians chapter 1. Look what the Bible says in verse number 3, and then we're going to go over to 2 Thessalonians chapter 1 and just make a quick comparison, and I want you to see how they were growing spiritually. The period of time between writing the first and second book of Thessalonians is not really that long, and we find that Paul, as he's writing these two letters, in fact many would have these dated in the same year, maybe just a mere number of months in between the two writings, and we find that in chapter 1 of the first book, in verse number 3, notice what Paul says, remembering without ceasing your work of faith and labor of love and patience of hope in our Lord Jesus Christ in the sight of God and our Father. And so we see that their work of faith, their labor of love, their patience of hope are referenced in verse number 3 of chapter 1. Turn over to 2 Thessalonians chapter 1, and notice what Paul says, again mere months perhaps between the two writings of these letters, and we find that Paul, as he's again thanking God for these believers in Thessalonica, in 2 Thessalonians 1 and verse number 3, notice what Paul says, we are bound to thank God always for you, brethren, as it is me. Notice what he says, because that your faith, did you see what it says, groweth exceedingly. I like that verbiage, don't you? The Bible says, and then faith cometh by hearing, and hearing by the word of God. We find that Paul, as he's writing, again under the inspiration of the Holy Spirit of God, he mentions their faith in the first book, but now as he's writing the second book, he says, listen, we're thanking God because we're understanding that your faith groweth, and he says it groweth exceedingly. Now I'm not sure in your mind's eye, in your sanctified imagination, what you think of when you hear that term groweth exceedingly. I appreciate that word exceedingly. He doesn't just say that your faith groweth, that would be sufficient, it would help us to see that there was some growth, there was some progress that's being made, but notice Paul says that your faith groweth exceedingly. Man, this is exciting. Notice he continues and says, and the charity, that's the love of every one of you all toward each other, then notice the word, aboundeth. Man, this is exciting to see the spiritual growth of this church in Thessalonica. We begin to look at this church and we begin to say, why is it that I would say, why is it that theologians of yesteryear would say that the church of Thessalonica is a model church? Number one, that I've looked through these books and I've come up with is that they were growing spiritually. Number two, number two, they were examples to other believers. Turn back to the first book, if you will, of Thessalonians, 1 Thessalonians chapter 1, and we find that they were examples. I'm thankful that the Lord Jesus Christ is our example. Peter mentions that, that he left us an example that we should follow his steps, but we find that we understand the importance of being examples to others. Remember the Apostle Paul, he mentioned about be ye followers of me even as I also am of Christ. We find that in the church at Corinth. We find that he says to Timothy, the things that thou hast heard of me among many witnesses, the same commit thou to faithful men, which we'll be able to teach others also in 2 Timothy chapter number 2. And we find for this church in Thessalonica, they were examples to other believers. Notice in 1 Thessalonians 1 and verse number 7, the Bible says so that ye, that's the church, the believers at the church in Thessalonica, so that ye were in samples to all that believe in Macedonia and Achaia. Now when he says that you are in sample or an example, I find that as I look at the book and I look at the context that this is given in a positive fashion. He's not saying that you were an example of what not to do, no, you were an example of what to do and the proper way to receive God's word. In fact, in chapter 2 and verse number 13, the Bible says for this cause also thank we God without ceasing because when you receive the word of God which ye heard of us, notice you received it not as the word of men, but as it is in truth, the word of God which effectually worketh also in you that believe. And so their approach and their receiving of God's word, that was an example. And it was an example to these other believers, these people that heard the gospel in Macedonia and Achaia, and Paul says that you believers in Thessalonica, you were an example. Number three, why is this church, the church at Thessalonica, why are they a model church? Well I would say number three, they were actively sharing the gospel, they were actively sharing the gospel. They were growing spiritually, they were examples to other believers, but they were actively sharing the gospel. And what a blessing to see in verse number eight of 1 Thessalonians 1 how that God references their work of sharing the gospel. Paul says it this way, unto the inspiration of the Holy Spirit of God, for from you, again remember he's writing to the church of the Thessalonians according to 1 1, he says for from you sounded out the word of the Lord, not only in Macedonia and Achaia, but also in every place your faith to God's word is spread abroad so that we need not to speak anything. And that's pretty exciting, a church. The apostle Paul, best we can tell from Acts 17, is there for just a very brief time as God would lead him on that second missionary journey to go to the city of Thessalonica, but there was great opposition, but in those few weeks that he had the opportunity to be there, the word of God was preached, souls were saved, a church was established, and now as this church is being written to, and we look throughout these two letters, we find that there's much for which they can be commended for. Many reasons that we can go to this church and say this is a model church, they were actively sharing the gospel, they understood the power of the gospel, they understood how they had been saved, and because of their salvation and because of understanding the power of the gospel, they then wanted to... share that truth with others. We shared a prayer letter update from a missionary just a few weeks ago. And as we talked about that missionary over in Africa, and we talked about in Uganda there, how this one young man trusted Christ as his savior. And after he trusted Christ as his savior, he wanted to go back to his own village to be able to tell his friends and his family about the Lord, tell them about Jesus Christ. Why? Because his life had been changed. He understood what the gospel did for him, and he goes back to his village there in Uganda, and there's a dozen and a half people that trust Christ as their savior. That's exciting. And we find that here, this church in Thessalonica, they were actively sharing the gospel. They understood that God had saved them, and they had a responsibility to grow spiritually. They had a responsibility to be an example to other believers, but they had a responsibility to actively share the gospel. Number four, I would say this. Why is the church in Thessalonica a model church? Well, number four, they continued through opposition. They continued through opposition. In 1 Thessalonians 3, I want you to notice what the Bible says. In verse number one, Paul says, wherefore, when we could no longer forbear, we thought it good to be left in Athens alone, and sent Timotheus our brother, and minister of God, and fellow laborer in the gospel of Christ to establish you and to comfort you concerning your faith. Now, again, I mentioned briefly from Acts 17 the opposition that they face, and they say these that have turned the world upside down have come hither also in that passage of Scripture, and Paul and Silas, they go down to Berea, and then they chase them down to Berea, and Paul ends up in Athens, and so Paul is referencing that in verse number one of chapter three, and he says we no longer could forbear. Paul was concerned about these believers in Thessalonica. He knew that they received the gospel, they had been saved, but he knew the opposition was so great that he and others had to flee, and so he's saying we could no longer forbear, so what do we do? We sent Timothy, and Timothy was gonna come, and he was going to establish you and to comfort you. Notice in verse number three that no man should be moved by these afflictions. For yourselves know that we are appointed thereunto, and you think about the truth of yea, all those that live godly in Christ Jesus shall suffer persecution. Of course, that's in second Timothy three in verse 13, and we find here that Paul is saying listen, these afflictions that you're facing, it was our desire that you would not be moved by these afflictions. Again, that it would not cause you to give up, to turn back. In verse four, for verily when we were with you, we told you before that we should suffer tribulation even as it came to pass, and ye know. Now remember, I mentioned this on Sunday morning, the word persecution carries with it of the idea of harass or trouble with the intent or the purpose of making one run or flee, and he says in verse number four that we told you before that we should suffer tribulation even as it come to pass, and ye know. And so this tribulation, this persecution that they were facing, Paul was concerned, but I'm saying that they were a model church because they continued through the opposition. In verse number five it says for this cause, when I could no longer forbear, I sent to know your faith, lest by some means the tempter have tempted you, and our labor be in vain. Can you see the heart of Paul in verse number five? Who's the tempter? Well, that's the enemy, that's the devil, and he says lest the tempter have tempted you, and notice he says our labor be in vain. But now, when Timotheus came from you unto us, and brought us good tidings of your faith and charity, and that ye have good remembrance of us, always desiring greatly to see us as we also to see you. Therefore, brethren, we were comforted over you in all our affliction and distress by your faith, for now we live, if you stand fast in the Lord, for what thanks can we render to God again for you, for all the joy wherewith we joy for your sakes before our God night and day, praying exceedingly that we might see your face and might perfect that which is lacking in your faith. And so we find that Paul is rejoicing, he's saying listen, this church, they continued even though they faced opposition. Notice in the second letter, 2 Thessalonians chapter one, notice what God tells us with regard to this church, and they continued through opposition, we see it in chapter three of the first letter, but now in 2 Thessalonians chapter number one, we looked at verse three a moment ago, but look at verse number four, in 2 Thessalonians one and verse four, so that we ourselves glory in you in the churches of God, notice for your patience and faith in all your persecutions and tribulations that ye endure. Paul said, this church, God said, this church, they continued through opposition, they faced the opposition, but they didn't quit, they didn't turn back, they didn't say, listen, this isn't what we signed up for, this isn't what we didn't, life was easy before we, no, no, no, they continued, even though they faced the opposition, they dealt with the persecutions and the tribulations that are mentioned in 2 Thessalonians one and verse four, and he says that ye endure, they continued, even though they faced the opposition, they were growing spiritually, even though they faced the opposition, they were examples to other believers, perhaps in one particular area of continuing in spite of opposition, though they faced opposition, they were actively sharing the gospel, wow, that's exciting, the fifth reason that I would say this church is a model church is that they love the brethren, they love the brethren, you know, Jesus said this in John 13, and you can take a moment and turn over there, in John chapter 13, the Lord Jesus Christ washed the feet of the disciples, began giving instruction with regard to his departure, and in this particular text of scripture, he says that he's giving them a new commandment, and it's recorded for us in John 13 in verse 34, he says a new commandment I give unto you, that you love one another as I have loved you, that you also love one another, by this shall all men know that you're my disciples, if you have love one to another, and we find that as we look at the church in Thessalonica, they were a church that was known for loving the brethren, notice what the Bible says, if you will, in chapter number four of 1 Thessalonians, in 1 Thessalonians chapter four, we mentioned already in the first chapter, he talked about their labor of love, but now we see specifically talking about brotherly love, or this loving the brethren, we see the book of 1 John deals with this quite a bit as well, but as written to a local church, we find that they're commended with regard to their brotherly love, notice in verse number nine of 1 Thessalonians four, the apostle Paul says this, but as touching brotherly love, you need not that I write unto you, for ye yourselves are taught of God to love one another, we can see as we just read in John 13 and verse 34, how God, the Lord Jesus Christ gave that instruction before his departure, and we find in verse 10, notice what he says, and indeed ye do it, you do what, you love one another, toward all the brethren, which are in all Macedonia, now I love the way that this is worded, because he says that you do it toward all the brethren, not just the ones that you get along with most, amen, not just the ones that you kind of, you know, we kind of connect with better than, no, no, he says that you love, why? Because we're taught of God to love the brethren, and he says here that you do it, but then notice what he says, but we beseech you at the end of verse number 10, brethren, that ye increase more and more, we mentioned that in 2 Thessalonians 1 and verse number 3, he talked about how your love or your charity of every one of you all toward each other aboundeth, and we find here in chapter four of the first letter, that Paul says that ye know, you're taught of God with regard to brotherly love, and indeed you do it, but he says that ye increase more and more, and we find even as I mentioned a few moments ago, that we never arrive in the Christian life, and though they're commended for their love, their love for the brethren, and though they're an example for us, and they're a model church in that regard, that Paul still says increase, increase more and more, and we find that as we look at this particular church, this church in Thessalonica, this church that we're gonna study these principles at the end of 1 Thessalonians 5, and at the end of 2 Thessalonians 3 over the next several months, and consider this subject matter of walk worthy, and please God, some could give the argument, they're already pleasing God, sure they were, but they needed to continue, there were some principles that were necessary for them to be given, for them to be taught that they needed to know, and implement in their lives, so that they could walk worthy. please God. And God has providentially preserved these two letters. No, we're not the church of the Thessalonians. We're not the church in Thessalonica, but we are a local New Testament church. We're a church just like churches for the last couple thousand years have had the opportunity to read and study these books and to understand that God has given instruction to a local church. He's preserved it for every generation of believers so that we too can look at this instruction and say, we need to know this and then implement this in our lives as a body of believers so that we might walk worthy and please God. Over the next several months, we're going to begin in 1 Thessalonians 5 and verse number 12 next Wednesday, we're going to begin there and we're going to take our time going through each of these principles and seeking to understand them because this is, listen, the Bible says of itself that all scripture is given by inspiration of God and is profitable. It's profitable. And here we find that the instruction contained in the conclusion, in the concluding remarks in both of these letters to the same local church is profitable instruction for each of us still today in 2024 and we must take heed to it so that we could say, we want to walk worthy and please God. Walk worthy and please God. Let's pray. Father, we love you. We thank you for loving us. We thank you for the privilege that you've given us to gather tonight. We thank you, God, for your word and for the truth that you've given us. We thank you for the opportunity that we have to study these two important books. We thank you, God, for the church at Thessalonica and as we had an opportunity just for a little while this evening to look at these five reasons that we might conclude that this church is a model church and Lord, we thank you for their testimony. We thank you for their example, but Lord, we understand that over the next several months as we study these portions of scripture that even though they were a model church, they were still given instruction principles that they needed to know and implement so that they might walk worthy and please them. Lord, I pray that our heart tonight, that our heart over these next several months as we study these principles would be a heart that would desire to walk worthy and to please God. I pray, Lord, that you'd bless our time of prayer. We thank you for the opportunity that we have on Wednesday evenings to gather, not only to study your word, but to pray corporately. We thank you for the power of prayer. We pray that you'd work through every aspect of this service and we'll thank you for it. In Christ's name we pray. Amen.",
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 4.320000171661377,
      "text": " book of First Thessalonians, nor the second book of Thessalonians. However, over the next"
    },
    {
      "id": 1,
      "start": 4.320000171661377,
      "end": 10.520000457763672,
      "text": " several months, we're going to study through these two books and really looking at the"
    },
    {
      "id": 2,
      "start": 10.520000457763672,
      "end": 16.799999237060547,
      "text": " concluding statements that are made in each of the books. I've titled the series, Walkworthy"
    },
    {
      "id": 3,
      "start": 16.799999237060547,
      "end": 22.520000457763672,
      "text": " and Please God. Walkworthy and Please God. And so on Wednesday nights, for the next several"
    },
    {
      "id": 4,
      "start": 22.520000457763672,
      "end": 29.520000457763672,
      "text": " months, we're going to have this subject matter of Walkworthy and Please God. On Sunday evening,"
    },
    {
      "id": 5,
      "start": 30.0,
      "end": 35.279998779296875,
      "text": " the last service of 2023, I preached a message from the book of Ecclesiastes, and here the"
    },
    {
      "id": 6,
      "start": 35.279998779296875,
      "end": 39.0,
      "text": " conclusion of the whole matter. This is the whole duty of man. What was it? Fear God and"
    },
    {
      "id": 7,
      "start": 39.0,
      "end": 43.2400016784668,
      "text": " keep His commandments. And we find that as we come to the New Testament, even as we mentioned"
    },
    {
      "id": 8,
      "start": 43.2400016784668,
      "end": 48.47999954223633,
      "text": " on Sunday evening, looking at Ephesians 5 and verse number 10, and a number of other"
    },
    {
      "id": 9,
      "start": 48.47999954223633,
      "end": 52.52000045776367,
      "text": " passages in the New Testament as well, that we find that in the New Testament, God has"
    },
    {
      "id": 10,
      "start": 52.52000045776367,
      "end": 58.2400016784668,
      "text": " given us instruction as a local church on how we are to behave. In fact, in 1 Timothy"
    },
    {
      "id": 11,
      "start": 58.2400016784668,
      "end": 61.91999816894531,
      "text": " 3 and verse 15, in a few months, we'll get to that portion of Scripture. We find that"
    },
    {
      "id": 12,
      "start": 61.91999816894531,
      "end": 66.83999633789062,
      "text": " the Bible says that Timothy is receiving this instruction in Paul so that if I tarry long,"
    },
    {
      "id": 13,
      "start": 66.83999633789062,
      "end": 72.04000091552734,
      "text": " that thou know how thou oughtest to behave thyself in the house of God. And we understand"
    },
    {
      "id": 14,
      "start": 72.04000091552734,
      "end": 76.04000091552734,
      "text": " that there is appropriate behavior in God's house, and there is that behavior that would"
    },
    {
      "id": 15,
      "start": 76.04000091552734,
      "end": 81.31999969482422,
      "text": " please God. As we think about the church at Thessalonica, and really this evening starting"
    },
    {
      "id": 16,
      "start": 81.31999969482422,
      "end": 86.63999938964844,
      "text": " an introductory kind of a lesson to this series of Walkworthy and Please God, I've titled"
    },
    {
      "id": 17,
      "start": 86.63999938964844,
      "end": 92.19999694824219,
      "text": " the message tonight, Simply Walkworthy. And as we think about the church at Thessalonica,"
    },
    {
      "id": 18,
      "start": 92.19999694824219,
      "end": 96.16000366210938,
      "text": " it was during the second missionary journey that the Apostle Paul was used of the Lord"
    },
    {
      "id": 19,
      "start": 96.16000366210938,
      "end": 101.68000030517578,
      "text": " to travel to the city of Thessalonica. As best we can tell, because of the opposition"
    },
    {
      "id": 20,
      "start": 101.68000030517578,
      "end": 105.83999633789062,
      "text": " that was faced, Paul was there for just a brief time. We'll look at Acts 17 here in"
    },
    {
      "id": 21,
      "start": 105.83999633789062,
      "end": 110.08000183105469,
      "text": " just a moment. But we find that God would use the Apostle Paul, under the inspiration"
    },
    {
      "id": 22,
      "start": 110.08000183105469,
      "end": 115.55999755859375,
      "text": " of the Holy Spirit of God, to write two letters to this church at Thessalonica. Notice, if"
    },
    {
      "id": 23,
      "start": 115.55999755859375,
      "end": 119.16000366210938,
      "text": " you will, in 1 Thessalonians 2 and verse number 12, and I'm going to read the two"
    },
    {
      "id": 24,
      "start": 119.16000366210938,
      "end": 125.16000366210938,
      "text": " verses that we're going to use really as theme verses as we study here on Wednesday evenings"
    },
    {
      "id": 25,
      "start": 125.16000366210938,
      "end": 130.16000366210938,
      "text": " this thought of Walkworthy and Please God. In 1 Thessalonians 2 and verse number 12,"
    },
    {
      "id": 26,
      "start": 130.16000366210938,
      "end": 137.1999969482422,
      "text": " the Bible says that you would walk worthy of God, who hath called you unto his kingdom"
    },
    {
      "id": 27,
      "start": 137.1999969482422,
      "end": 141.77999877929688,
      "text": " and glory. Then skip over, if you will, to 1 Thessalonians chapter number 4, and look"
    },
    {
      "id": 28,
      "start": 141.77999877929688,
      "end": 149.17999267578125,
      "text": " at verse 1. The Bible says, furthermore then, we beseech you, brethren, and exhort you by"
    },
    {
      "id": 29,
      "start": 149.17999267578125,
      "end": 155.3000030517578,
      "text": " the Lord Jesus, that as you have received of us, notice, how you ought to walk and to"
    },
    {
      "id": 30,
      "start": 155.3000030517578,
      "end": 163.33999633789062,
      "text": " please God, so you would abound more and more, for ye know what commandments we gave you"
    },
    {
      "id": 31,
      "start": 163.33999633789062,
      "end": 169.33999633789062,
      "text": " by the Lord Jesus. We mentioned on Sunday evening about fearing God and keeping his"
    },
    {
      "id": 32,
      "start": 169.3800048828125,
      "end": 173.4600067138672,
      "text": " commandments. We looked at a number of passages in the book of Deuteronomy specifically, where"
    },
    {
      "id": 33,
      "start": 173.4600067138672,
      "end": 177.86000061035156,
      "text": " the Bible said that we're to know all of his commandments at all times. And we find that"
    },
    {
      "id": 34,
      "start": 177.86000061035156,
      "end": 182.74000549316406,
      "text": " as Paul would write here to the church at Thessalonica, he says, for ye know what commandments"
    },
    {
      "id": 35,
      "start": 182.74000549316406,
      "end": 189.74000549316406,
      "text": " we gave you by the Lord Jesus in verse 2 of chapter 4. As you take the content of 1 and"
    },
    {
      "id": 36,
      "start": 189.74000549316406,
      "end": 196.6199951171875,
      "text": " 2 Thessalonians and you think about this local church, God is giving this church instruction"
    },
    {
      "id": 37,
      "start": 196.6199951171875,
      "end": 202.3800048828125,
      "text": " with regard to how they can walk worthy and please God. As we begin to think about the"
    },
    {
      "id": 38,
      "start": 202.3800048828125,
      "end": 206.13999938964844,
      "text": " ministry in Thessalonica and the opposition that was faced, if you hold your place here"
    },
    {
      "id": 39,
      "start": 206.13999938964844,
      "end": 211.89999389648438,
      "text": " and turn back to Acts 17, we'll just look very briefly at these few verses and see what"
    },
    {
      "id": 40,
      "start": 211.89999389648438,
      "end": 219.5399932861328,
      "text": " happened there as this church was established. In Acts 17 and verse number 1, we'll just"
    },
    {
      "id": 41,
      "start": 219.5399932861328,
      "end": 224.05999755859375,
      "text": " look at a few verses here. The Bible says, now when they had passed through Amphipolis"
    },
    {
      "id": 42,
      "start": 224.05999755859375,
      "end": 230.77999877929688,
      "text": " and Apollonia, they came to Thessalonica. Notice the Bible says where was a synagogue"
    },
    {
      "id": 43,
      "start": 230.77999877929688,
      "end": 237.10000610351562,
      "text": " of the Jews. And Paul, according to verse number 2, as his manner was, went in unto"
    },
    {
      "id": 44,
      "start": 237.10000610351562,
      "end": 243.77999877929688,
      "text": " them and three Sabbath days reasoned with them out of the scriptures. He used the Old"
    },
    {
      "id": 45,
      "start": 243.77999877929688,
      "end": 247.6999969482422,
      "text": " Testament. He used the word of God. He used the scriptures that are available. Notice"
    },
    {
      "id": 46,
      "start": 247.6999969482422,
      "end": 251.3000030517578,
      "text": " the Bible says that he did this for three Sabbath days. That's why we understand that"
    },
    {
      "id": 47,
      "start": 251.3000030517578,
      "end": 256.1000061035156,
      "text": " it was a short period of time that Paul was there in Thessalonica. Notice in verse 3,"
    },
    {
      "id": 48,
      "start": 256.1000061035156,
      "end": 262.2200012207031,
      "text": " what is he giving them? What is he teaching them? Opening and alleging that Christ must"
    },
    {
      "id": 49,
      "start": 262.2200012207031,
      "end": 269.1400146484375,
      "text": " needs have suffered and risen again from the dead. And that this Jesus whom I preach unto"
    },
    {
      "id": 50,
      "start": 269.1400146484375,
      "end": 275.29998779296875,
      "text": " you is Christ. Now there's a whole message right in verse number 3 with regard to the"
    },
    {
      "id": 51,
      "start": 275.29998779296875,
      "end": 280.17999267578125,
      "text": " message that the Apostle Paul is delivering to these Jewish folks at this synagogue in"
    },
    {
      "id": 52,
      "start": 280.2200012207031,
      "end": 287.2200012207031,
      "text": " Thessalonica. And the name Jesus means Jehovah is salvation, God incarnate. When he, Paul,"
    },
    {
      "id": 53,
      "start": 287.2200012207031,
      "end": 292.2200012207031,
      "text": " would reference Jesus, they would understand that the individual, the person that he was"
    },
    {
      "id": 54,
      "start": 292.2200012207031,
      "end": 298.7799987792969,
      "text": " speaking of. And we find that he says that this Jesus whom I preach unto you is Christ."
    },
    {
      "id": 55,
      "start": 298.7799987792969,
      "end": 304.94000244140625,
      "text": " He is the anointed one. He is the Messiah. He is the Son of God, God in flesh. And we"
    },
    {
      "id": 56,
      "start": 304.94000244140625,
      "end": 310.82000732421875,
      "text": " find that the Bible says in verse number 4, some of them believed and consorted with"
    },
    {
      "id": 57,
      "start": 310.82000732421875,
      "end": 315.1000061035156,
      "text": " Paul and Silas, some of the devout Greeks, a great multitude, and of the chief women"
    },
    {
      "id": 58,
      "start": 315.1000061035156,
      "end": 321.3399963378906,
      "text": " not a few. But the Jews which believed not moved with envy, took unto them certain lewd"
    },
    {
      "id": 59,
      "start": 321.3399963378906,
      "end": 326.239990234375,
      "text": " fellows of the baser sort, and gathered company, and set all the city of an uproar, and assaulted"
    },
    {
      "id": 60,
      "start": 326.239990234375,
      "end": 330.9800109863281,
      "text": " the house of Jason, and sought to bring them out to the people. And so we find that due"
    },
    {
      "id": 61,
      "start": 330.9800109863281,
      "end": 335.3800048828125,
      "text": " to the opposition, again, Paul was not there in Thessalonica for a long time. He would"
    },
    {
      "id": 62,
      "start": 335.3800048828125,
      "end": 339.9800109863281,
      "text": " be sent to Berea, if you continue to read through, and we're not going to take the time"
    },
    {
      "id": 63,
      "start": 339.9800109863281,
      "end": 344.94000244140625,
      "text": " to do so, but we find that in verse number 10, the brethren sent Paul and Silas away."
    },
    {
      "id": 64,
      "start": 344.94000244140625,
      "end": 350.29998779296875,
      "text": " They sent him to Berea, and he's not in Berea very long. And the people from Thessalonica"
    },
    {
      "id": 65,
      "start": 350.29998779296875,
      "end": 356.94000244140625,
      "text": " that were upset, that caused the uproar, they follow him to Berea, and Paul ends up in Athens."
    },
    {
      "id": 66,
      "start": 356.94000244140625,
      "end": 361.0400085449219,
      "text": " And we find that when he's in Athens, of course he's there, and his spirit is moved"
    },
    {
      "id": 67,
      "start": 361.0400085449219,
      "end": 365.0199890136719,
      "text": " within him because he sees a city that is wholly given to idolatry, and he preaches"
    },
    {
      "id": 68,
      "start": 365.0199890136719,
      "end": 370.739990234375,
      "text": " to them Christ. But we find that in this brief time that the Apostle Paul was in Thessalonica,"
    },
    {
      "id": 69,
      "start": 370.739990234375,
      "end": 376.0199890136719,
      "text": " that the gospel was preached, souls were saved, and a local church was established. And that's"
    },
    {
      "id": 70,
      "start": 376.0199890136719,
      "end": 381.5799865722656,
      "text": " exciting for us to understand how God moved and worked through this second missionary"
    },
    {
      "id": 71,
      "start": 381.5799865722656,
      "end": 387.8999938964844,
      "text": " journey to see a local church established. Now, we find that God, again, as I mentioned"
    },
    {
      "id": 72,
      "start": 387.8999938964844,
      "end": 393.05999755859375,
      "text": " a few moments ago, would use Paul to then write these two letters, 1 Thessalonians and"
    },
    {
      "id": 73,
      "start": 393.05999755859375,
      "end": 398.7799987792969,
      "text": " 2 Thessalonians, back to this church that was established on this second missionary"
    },
    {
      "id": 74,
      "start": 398.7799987792969,
      "end": 405.4200134277344,
      "text": " journey. In many ways, the church in Thessalonica is a model church. We use that terminology."
    },
    {
      "id": 75,
      "start": 405.4200134277344,
      "end": 409.5400085449219,
      "text": " You've heard me use it before. I've said something like this, there's no perfect church, there's"
    },
    {
      "id": 76,
      "start": 409.5400085449219,
      "end": 415.17999267578125,
      "text": " no perfect church members, there's no perfect pastor. We're all sinners saved by grace,"
    },
    {
      "id": 77,
      "start": 415.17999267578125,
      "end": 419.9800109863281,
      "text": " and we're not perfect, but we serve a perfect God. We have a perfect book, and we ought"
    },
    {
      "id": 78,
      "start": 419.9800109863281,
      "end": 426.05999755859375,
      "text": " to be thankful for that. But we understand that this church that we find in Thessalonica,"
    },
    {
      "id": 79,
      "start": 426.05999755859375,
      "end": 431.44000244140625,
      "text": " really in a number of ways, is a model church. As you study through 1 and 2 Thessalonians,"
    },
    {
      "id": 80,
      "start": 431.44000244140625,
      "end": 437.7799987792969,
      "text": " you will discover much for which this church will be commended for. However, in the conclusion"
    },
    {
      "id": 81,
      "start": 437.7799987792969,
      "end": 444.0199890136719,
      "text": " of each letter, in 1 Thessalonians chapter 1, excuse me, chapter 5, verses 12-28, and"
    },
    {
      "id": 82,
      "start": 444.0199890136719,
      "end": 450.3800048828125,
      "text": " 2 Thessalonians chapter 3, verses 6-18, in each of the conclusions of these two letters,"
    },
    {
      "id": 83,
      "start": 450.3800048828125,
      "end": 457.1000061035156,
      "text": " we find that Paul leaves the believers with practical instruction. The practical instruction"
    },
    {
      "id": 84,
      "start": 457.1000061035156,
      "end": 462.4200134277344,
      "text": " that he gives them is so that they might walk worthy and please God. Just as we've titled"
    },
    {
      "id": 85,
      "start": 462.4200134277344,
      "end": 467.4200134277344,
      "text": " this mini-series over the next several months, we've looked at the verses already in 1 Thessalonians"
    },
    {
      "id": 86,
      "start": 467.4200134277344,
      "end": 473.05999755859375,
      "text": " 2, 12, and chapter 4, verses 1-2, and we find that this instruction is provided so"
    },
    {
      "id": 87,
      "start": 473.05999755859375,
      "end": 478.94000244140625,
      "text": " that these believers, this church at Thessalonica, this body of believers, that they could walk"
    },
    {
      "id": 88,
      "start": 478.94000244140625,
      "end": 487.5400085449219,
      "text": " worthy and please God. God has providentially preserved this instruction for every generation"
    },
    {
      "id": 89,
      "start": 487.5400085449219,
      "end": 492.17999267578125,
      "text": " of believers. Now that's exciting. I'm thankful that God would give the instruction to the"
    },
    {
      "id": 90,
      "start": 492.17999267578125,
      "end": 497.2200012207031,
      "text": " church at Thessalonica, hey, here's some instruction, here's some practical instruction on how you"
    },
    {
      "id": 91,
      "start": 497.2200012207031,
      "end": 504.260009765625,
      "text": " can walk worthy and how you can please God. But then God providentially preserved that"
    },
    {
      "id": 92,
      "start": 504.260009765625,
      "end": 510.5799865722656,
      "text": " for every generation of believers. Therefore, we conclude that the principles in the closing"
    },
    {
      "id": 93,
      "start": 510.5799865722656,
      "end": 516.2999877929688,
      "text": " verses of each of these books are to be known and implemented by every local church. We"
    },
    {
      "id": 94,
      "start": 516.2999877929688,
      "end": 520.6199951171875,
      "text": " find that as God would preserve it, He didn't preserve it so that we could just look back"
    },
    {
      "id": 95,
      "start": 520.6199951171875,
      "end": 524.5399780273438,
      "text": " a couple of thousand years at a church and say, well, that was good instruction for that"
    },
    {
      "id": 96,
      "start": 524.5399780273438,
      "end": 530.3400268554688,
      "text": " church. No, our God is an eternal God. He has no beginning, no ending, and He gave instruction"
    },
    {
      "id": 97,
      "start": 530.3400268554688,
      "end": 535.5800170898438,
      "text": " to this local church in Thessalonica. He's preserved it for us so that we can take those"
    },
    {
      "id": 98,
      "start": 535.5800170898438,
      "end": 542.3200073242188,
      "text": " principles and we can know them and we can implement them so that we can walk worthy"
    },
    {
      "id": 99,
      "start": 542.3200073242188,
      "end": 548.6799926757812,
      "text": " and please God. Now, over the next several months, we will examine those principles to"
    },
    {
      "id": 100,
      "start": 548.6799926757812,
      "end": 553.6599731445312,
      "text": " ensure that we can know them and implement them. Again, chapter number 5, beginning in"
    },
    {
      "id": 101,
      "start": 553.6599731445312,
      "end": 557.7000122070312,
      "text": " verse number 12, going through the end of the chapter. And then in 2 Thessalonians chapter"
    },
    {
      "id": 102,
      "start": 557.7000122070312,
      "end": 561.4199829101562,
      "text": " number 3, beginning in verse number 6 and going through the end of the chapter. There"
    },
    {
      "id": 103,
      "start": 561.4199829101562,
      "end": 566.780029296875,
      "text": " are a number of principles. In fact, as you read the latter part of 1 Thessalonians chapter"
    },
    {
      "id": 104,
      "start": 566.780029296875,
      "end": 572.219970703125,
      "text": " number 5, really beginning in verse number 16, it's like just, bam, bullet points almost"
    },
    {
      "id": 105,
      "start": 572.219970703125,
      "end": 576.9600219726562,
      "text": " of just practical instruction for the church. And so we're going to take the time over the"
    },
    {
      "id": 106,
      "start": 576.9600219726562,
      "end": 583.9600219726562,
      "text": " next several months to dig into these principles so that we, as a local church, just as the"
    },
    {
      "id": 107,
      "start": 584.0399780273438,
      "end": 591.0399780273438,
      "text": " church at Thessalonica could take and incorporate these principles, abide by them, thus pleasing"
    },
    {
      "id": 108,
      "start": 591.3599853515625,
      "end": 597.9199829101562,
      "text": " God and walking worthy that we too can do that same thing. Tonight, before we jump into"
    },
    {
      "id": 109,
      "start": 597.9199829101562,
      "end": 599.7999877929688,
      "text": " the latter portion of these books..."
    },
    {
      "id": 0,
      "start": 599.7999877929688,
      "end": 604.7199878692627,
      "text": " Tonight I want to briefly examine this church at Thessalonica and really consider why it"
    },
    {
      "id": 1,
      "start": 604.7199878692627,
      "end": 610.119987487793,
      "text": " is that so often we refer to this church as being a model church."
    },
    {
      "id": 2,
      "start": 610.119987487793,
      "end": 614.7199878692627,
      "text": " There are five truths that I want to look at briefly through these two books this evening"
    },
    {
      "id": 3,
      "start": 614.7199878692627,
      "end": 619.9199886322021,
      "text": " that would give us reason to say the church at Thessalonica is a model church."
    },
    {
      "id": 4,
      "start": 619.9199886322021,
      "end": 622.6399879455566,
      "text": " Now why am I laying this groundwork?"
    },
    {
      "id": 5,
      "start": 622.6399879455566,
      "end": 626.7599868774414,
      "text": " We could understand if God is writing to the church in Corinth and saying, hey, here's"
    },
    {
      "id": 6,
      "start": 626.7599868774414,
      "end": 629.6399879455566,
      "text": " some things that you need to do to walk worthy and please God."
    },
    {
      "id": 7,
      "start": 629.6399879455566,
      "end": 630.6399879455566,
      "text": " Why?"
    },
    {
      "id": 8,
      "start": 630.6399879455566,
      "end": 632.3199882507324,
      "text": " Because the church at Corinth was a mess."
    },
    {
      "id": 9,
      "start": 632.3199882507324,
      "end": 637.0799865722656,
      "text": " The church at Corinth had divisions and all sorts of problems that were going on in Corinth."
    },
    {
      "id": 10,
      "start": 637.0799865722656,
      "end": 641.7999877929688,
      "text": " In fact, you can go through the book of 1 Corinthians and you can find 12 or 15 different"
    },
    {
      "id": 11,
      "start": 641.7999877929688,
      "end": 647.0799865722656,
      "text": " things that were going on in Corinth that would help us to understand the church in"
    },
    {
      "id": 12,
      "start": 647.0799865722656,
      "end": 650.8399887084961,
      "text": " Corinth was in no way, shape, or form a model church."
    },
    {
      "id": 13,
      "start": 650.8399887084961,
      "end": 652.2799873352051,
      "text": " They needed some instruction."
    },
    {
      "id": 14,
      "start": 652.2799873352051,
      "end": 653.7999877929688,
      "text": " They needed to apply some things."
    },
    {
      "id": 15,
      "start": 653.8399887084961,
      "end": 658.7199859619141,
      "text": " They were just all sorts of divisions and contentions that were prevalent within that"
    },
    {
      "id": 16,
      "start": 658.7199859619141,
      "end": 659.8399887084961,
      "text": " local church."
    },
    {
      "id": 17,
      "start": 659.8399887084961,
      "end": 664.7199859619141,
      "text": " But we look at a church like Thessalonica, we say, man, this is a model church."
    },
    {
      "id": 18,
      "start": 664.7199859619141,
      "end": 665.7199859619141,
      "text": " This is a good church."
    },
    {
      "id": 19,
      "start": 665.7199859619141,
      "end": 670.4799880981445,
      "text": " This is a church that's doing something for God, and they were."
    },
    {
      "id": 20,
      "start": 670.4799880981445,
      "end": 678.0799865722656,
      "text": " And yet, at the end of each book, God gives them a list of principles and says, listen,"
    },
    {
      "id": 21,
      "start": 678.0799865722656,
      "end": 682.9599914550781,
      "text": " if you want to walk worthy and you want to please me, here's some things that you need"
    },
    {
      "id": 22,
      "start": 682.9599914550781,
      "end": 685.9599914550781,
      "text": " to be aware of and that you need to implement."
    },
    {
      "id": 23,
      "start": 685.9599914550781,
      "end": 691.239990234375,
      "text": " One thing that I find in our Christian life is that we never arrive."
    },
    {
      "id": 24,
      "start": 691.239990234375,
      "end": 692.4799880981445,
      "text": " We never arrive."
    },
    {
      "id": 25,
      "start": 692.4799880981445,
      "end": 695.119987487793,
      "text": " There's always room for spiritual growth."
    },
    {
      "id": 26,
      "start": 695.119987487793,
      "end": 698.1599884033203,
      "text": " We find that there's never time for days off."
    },
    {
      "id": 27,
      "start": 698.1599884033203,
      "end": 701.6799850463867,
      "text": " There's never time that we can just kind of throw in the towel and say, man, we can coast"
    },
    {
      "id": 28,
      "start": 701.6799850463867,
      "end": 703.3199844360352,
      "text": " for a little while."
    },
    {
      "id": 29,
      "start": 703.3199844360352,
      "end": 707.7599868774414,
      "text": " Because if you decide to do that, then before long you're going to be going backwards instead"
    },
    {
      "id": 30,
      "start": 707.7599868774414,
      "end": 708.9199905395508,
      "text": " of going forward."
    },
    {
      "id": 31,
      "start": 708.9199905395508,
      "end": 714.6399841308594,
      "text": " Our theme, continue, the idea to persevere, to go on, to continue, to move forward."
    },
    {
      "id": 32,
      "start": 714.6399841308594,
      "end": 716.8799896240234,
      "text": " We're not just sitting on the premises."
    },
    {
      "id": 33,
      "start": 716.8799896240234,
      "end": 720.1999893188477,
      "text": " We're not just in a defensive posture."
    },
    {
      "id": 34,
      "start": 720.1999893188477,
      "end": 724.5999908447266,
      "text": " We're to be going forth with the gospel of Jesus Christ, continuing, and we find that"
    },
    {
      "id": 35,
      "start": 724.5999908447266,
      "end": 730.4399871826172,
      "text": " even for a model church, a church that is commended for a number of things, we find"
    },
    {
      "id": 36,
      "start": 730.4399871826172,
      "end": 736.5999908447266,
      "text": " that there is instruction, practical principles that are given to them in each of these letters"
    },
    {
      "id": 37,
      "start": 736.9199829101562,
      "end": 740.3199920654297,
      "text": " whereby God is saying, listen, don't forget these things."
    },
    {
      "id": 38,
      "start": 740.3199920654297,
      "end": 746.6799926757812,
      "text": " Remember to continue doing these things, and in so doing, you will walk worthy and please"
    },
    {
      "id": 39,
      "start": 746.6799926757812,
      "end": 747.6799926757812,
      "text": " God."
    },
    {
      "id": 40,
      "start": 747.6799926757812,
      "end": 753.5999908447266,
      "text": " Number one on why this church, why I would say this church is a model church, number"
    },
    {
      "id": 41,
      "start": 753.5999908447266,
      "end": 757.3199920654297,
      "text": " one, they were growing spiritually."
    },
    {
      "id": 42,
      "start": 757.3199920654297,
      "end": 759.5399932861328,
      "text": " They were growing spiritually."
    },
    {
      "id": 43,
      "start": 759.5399932861328,
      "end": 764.1199951171875,
      "text": " So often we speak about the importance of growing numerically, and no doubt that is"
    },
    {
      "id": 44,
      "start": 764.1199951171875,
      "end": 770.47998046875,
      "text": " a byproduct of spiritual growth, and a church should be growing numerically, and we desire"
    },
    {
      "id": 45,
      "start": 770.47998046875,
      "end": 775.6399841308594,
      "text": " to grow numerically, but we must understand the importance of a church growing spiritually,"
    },
    {
      "id": 46,
      "start": 775.6399841308594,
      "end": 779.6399841308594,
      "text": " of individual believers growing spiritually."
    },
    {
      "id": 47,
      "start": 779.6399841308594,
      "end": 784.1199951171875,
      "text": " The Bible tells us as newborn babes desire the sincere milk of the word that ye may grow"
    },
    {
      "id": 48,
      "start": 784.1199951171875,
      "end": 785.1199951171875,
      "text": " thereby."
    },
    {
      "id": 49,
      "start": 785.1199951171875,
      "end": 789.1599884033203,
      "text": " And we find that this church, I would say, is a model church because they were growing"
    },
    {
      "id": 50,
      "start": 789.1599884033203,
      "end": 790.1599884033203,
      "text": " spiritually."
    },
    {
      "id": 51,
      "start": 790.1599884033203,
      "end": 792.1999816894531,
      "text": " They were members of this church."
    },
    {
      "id": 52,
      "start": 792.1999816894531,
      "end": 794.5999908447266,
      "text": " Remember the church is not a building."
    },
    {
      "id": 53,
      "start": 794.5999908447266,
      "end": 799.8799896240234,
      "text": " The church is the believers, the people of God, and they were growing spiritually."
    },
    {
      "id": 54,
      "start": 799.8799896240234,
      "end": 802.7999877929688,
      "text": " Look in 1 Thessalonians chapter 1."
    },
    {
      "id": 55,
      "start": 802.7999877929688,
      "end": 806.9999847412109,
      "text": " Look what the Bible says in verse number 3, and then we're going to go over to 2 Thessalonians"
    },
    {
      "id": 56,
      "start": 806.9999847412109,
      "end": 810.9399871826172,
      "text": " chapter 1 and just make a quick comparison, and I want you to see how they were growing"
    },
    {
      "id": 57,
      "start": 810.9399871826172,
      "end": 812.1999816894531,
      "text": " spiritually."
    },
    {
      "id": 58,
      "start": 812.1999816894531,
      "end": 815.9999847412109,
      "text": " The period of time between writing the first and second book of Thessalonians is not really"
    },
    {
      "id": 59,
      "start": 815.9999847412109,
      "end": 822.4399871826172,
      "text": " that long, and we find that Paul, as he's writing these two letters, in fact many would"
    },
    {
      "id": 60,
      "start": 822.4399871826172,
      "end": 828.1599884033203,
      "text": " have these dated in the same year, maybe just a mere number of months in between the two"
    },
    {
      "id": 61,
      "start": 828.1599884033203,
      "end": 832.8799896240234,
      "text": " writings, and we find that in chapter 1 of the first book, in verse number 3, notice"
    },
    {
      "id": 62,
      "start": 832.8799896240234,
      "end": 841.0399932861328,
      "text": " what Paul says, remembering without ceasing your work of faith and labor of love and patience"
    },
    {
      "id": 63,
      "start": 841.0399932861328,
      "end": 847.5599822998047,
      "text": " of hope in our Lord Jesus Christ in the sight of God and our Father."
    },
    {
      "id": 64,
      "start": 847.5599822998047,
      "end": 851.7199859619141,
      "text": " And so we see that their work of faith, their labor of love, their patience of hope are"
    },
    {
      "id": 65,
      "start": 851.7199859619141,
      "end": 853.8799896240234,
      "text": " referenced in verse number 3 of chapter 1."
    },
    {
      "id": 66,
      "start": 853.8799896240234,
      "end": 860.9400024414062,
      "text": " Turn over to 2 Thessalonians chapter 1, and notice what Paul says, again mere months perhaps"
    },
    {
      "id": 67,
      "start": 860.9400024414062,
      "end": 866.1399841308594,
      "text": " between the two writings of these letters, and we find that Paul, as he's again thanking"
    },
    {
      "id": 68,
      "start": 866.3799743652344,
      "end": 871.0999755859375,
      "text": " God for these believers in Thessalonica, in 2 Thessalonians 1 and verse number 3, notice"
    },
    {
      "id": 69,
      "start": 871.0999755859375,
      "end": 877.4400024414062,
      "text": " what Paul says, we are bound to thank God always for you, brethren, as it is me."
    },
    {
      "id": 70,
      "start": 877.4400024414062,
      "end": 885.1399841308594,
      "text": " Notice what he says, because that your faith, did you see what it says, groweth exceedingly."
    },
    {
      "id": 71,
      "start": 885.1399841308594,
      "end": 887.5799865722656,
      "text": " I like that verbiage, don't you?"
    },
    {
      "id": 72,
      "start": 887.5799865722656,
      "end": 890.9599914550781,
      "text": " The Bible says, and then faith cometh by hearing, and hearing by the word of God."
    },
    {
      "id": 73,
      "start": 890.9599914550781,
      "end": 894.4199829101562,
      "text": " We find that Paul, as he's writing, again under the inspiration of the Holy Spirit of"
    },
    {
      "id": 74,
      "start": 894.4199829101562,
      "end": 899.4599914550781,
      "text": " God, he mentions their faith in the first book, but now as he's writing the second book,"
    },
    {
      "id": 75,
      "start": 899.4599914550781,
      "end": 904.8399963378906,
      "text": " he says, listen, we're thanking God because we're understanding that your faith groweth,"
    },
    {
      "id": 76,
      "start": 904.8399963378906,
      "end": 906.8399963378906,
      "text": " and he says it groweth exceedingly."
    },
    {
      "id": 77,
      "start": 906.8399963378906,
      "end": 912.8599853515625,
      "text": " Now I'm not sure in your mind's eye, in your sanctified imagination, what you think of"
    },
    {
      "id": 78,
      "start": 912.8599853515625,
      "end": 915.7599792480469,
      "text": " when you hear that term groweth exceedingly."
    },
    {
      "id": 79,
      "start": 915.7599792480469,
      "end": 918.7999877929688,
      "text": " I appreciate that word exceedingly."
    },
    {
      "id": 80,
      "start": 918.7999877929688,
      "end": 922.6799926757812,
      "text": " He doesn't just say that your faith groweth, that would be sufficient, it would help us"
    },
    {
      "id": 81,
      "start": 922.739990234375,
      "end": 926.2599792480469,
      "text": " to see that there was some growth, there was some progress that's being made, but notice"
    },
    {
      "id": 82,
      "start": 926.2599792480469,
      "end": 929.6199951171875,
      "text": " Paul says that your faith groweth exceedingly."
    },
    {
      "id": 83,
      "start": 929.6199951171875,
      "end": 932.1199951171875,
      "text": " Man, this is exciting."
    },
    {
      "id": 84,
      "start": 932.1199951171875,
      "end": 938.5,
      "text": " Notice he continues and says, and the charity, that's the love of every one of you all toward"
    },
    {
      "id": 85,
      "start": 938.5,
      "end": 941.4599914550781,
      "text": " each other, then notice the word, aboundeth."
    },
    {
      "id": 86,
      "start": 941.4599914550781,
      "end": 948.5,
      "text": " Man, this is exciting to see the spiritual growth of this church in Thessalonica."
    },
    {
      "id": 87,
      "start": 948.5,
      "end": 954.97998046875,
      "text": " We begin to look at this church and we begin to say, why is it that I would say, why is"
    },
    {
      "id": 88,
      "start": 954.97998046875,
      "end": 960.4599914550781,
      "text": " it that theologians of yesteryear would say that the church of Thessalonica is a model"
    },
    {
      "id": 89,
      "start": 960.4599914550781,
      "end": 961.4599914550781,
      "text": " church?"
    },
    {
      "id": 90,
      "start": 961.4599914550781,
      "end": 965.3399963378906,
      "text": " Number one, that I've looked through these books and I've come up with is that they were"
    },
    {
      "id": 91,
      "start": 965.3399963378906,
      "end": 967.3799743652344,
      "text": " growing spiritually."
    },
    {
      "id": 92,
      "start": 967.3799743652344,
      "end": 972.2599792480469,
      "text": " Number two, number two, they were examples to other believers."
    },
    {
      "id": 93,
      "start": 972.2599792480469,
      "end": 976.7799987792969,
      "text": " Turn back to the first book, if you will, of Thessalonians, 1 Thessalonians chapter"
    },
    {
      "id": 94,
      "start": 976.7799987792969,
      "end": 981.3799743652344,
      "text": " 1, and we find that they were examples."
    },
    {
      "id": 95,
      "start": 981.3799743652344,
      "end": 985.6199951171875,
      "text": " I'm thankful that the Lord Jesus Christ is our example."
    },
    {
      "id": 96,
      "start": 985.6199951171875,
      "end": 990.6599731445312,
      "text": " Peter mentions that, that he left us an example that we should follow his steps, but we find"
    },
    {
      "id": 97,
      "start": 990.6599731445312,
      "end": 995.6599731445312,
      "text": " that we understand the importance of being examples to others."
    },
    {
      "id": 98,
      "start": 995.6599731445312,
      "end": 1000.4199829101562,
      "text": " Remember the Apostle Paul, he mentioned about be ye followers of me even as I also am of"
    },
    {
      "id": 99,
      "start": 1000.4199829101562,
      "end": 1001.4199829101562,
      "text": " Christ."
    },
    {
      "id": 100,
      "start": 1001.5799865722656,
      "end": 1003.1199951171875,
      "text": " We find that in the church at Corinth."
    },
    {
      "id": 101,
      "start": 1003.1199951171875,
      "end": 1007.8999938964844,
      "text": " We find that he says to Timothy, the things that thou hast heard of me among many witnesses,"
    },
    {
      "id": 102,
      "start": 1007.8999938964844,
      "end": 1012.6599731445312,
      "text": " the same commit thou to faithful men, which we'll be able to teach others also in 2 Timothy"
    },
    {
      "id": 103,
      "start": 1012.6599731445312,
      "end": 1014.7799987792969,
      "text": " chapter number 2."
    },
    {
      "id": 104,
      "start": 1014.7799987792969,
      "end": 1020.4199829101562,
      "text": " And we find for this church in Thessalonica, they were examples to other believers."
    },
    {
      "id": 105,
      "start": 1020.4199829101562,
      "end": 1026.9400024414062,
      "text": " Notice in 1 Thessalonians 1 and verse number 7, the Bible says so that ye, that's the church,"
    },
    {
      "id": 106,
      "start": 1026.9400024414062,
      "end": 1034.1799926757812,
      "text": " the believers at the church in Thessalonica, so that ye were in samples to all that believe"
    },
    {
      "id": 107,
      "start": 1034.1799926757812,
      "end": 1038.4199829101562,
      "text": " in Macedonia and Achaia."
    },
    {
      "id": 108,
      "start": 1038.4199829101562,
      "end": 1044.1799926757812,
      "text": " Now when he says that you are in sample or an example, I find that as I look at the book"
    },
    {
      "id": 109,
      "start": 1044.1799926757812,
      "end": 1047.8599853515625,
      "text": " and I look at the context that this is given in a positive fashion."
    },
    {
      "id": 110,
      "start": 1047.8599853515625,
      "end": 1053.6999816894531,
      "text": " He's not saying that you were an example of what not to do, no, you were an example of"
    },
    {
      "id": 111,
      "start": 1054.0199890136719,
      "end": 1059.2999877929688,
      "text": " what to do and the proper way to receive God's word."
    },
    {
      "id": 112,
      "start": 1059.2999877929688,
      "end": 1063.8599853515625,
      "text": " In fact, in chapter 2 and verse number 13, the Bible says for this cause also thank we"
    },
    {
      "id": 113,
      "start": 1063.8599853515625,
      "end": 1068.8199768066406,
      "text": " God without ceasing because when you receive the word of God which ye heard of us, notice"
    },
    {
      "id": 114,
      "start": 1068.8199768066406,
      "end": 1074.2999877929688,
      "text": " you received it not as the word of men, but as it is in truth, the word of God which effectually"
    },
    {
      "id": 115,
      "start": 1074.2999877929688,
      "end": 1078.0399780273438,
      "text": " worketh also in you that believe."
    },
    {
      "id": 116,
      "start": 1078.0399780273438,
      "end": 1083.1199951171875,
      "text": " And so their approach and their receiving of God's word, that was an example."
    },
    {
      "id": 117,
      "start": 1083.1199951171875,
      "end": 1087.7200012207031,
      "text": " And it was an example to these other believers, these people that heard the gospel in Macedonia"
    },
    {
      "id": 118,
      "start": 1087.7200012207031,
      "end": 1094.1399841308594,
      "text": " and Achaia, and Paul says that you believers in Thessalonica, you were an example."
    },
    {
      "id": 119,
      "start": 1094.1399841308594,
      "end": 1099.4400024414062,
      "text": " Number three, why is this church, the church at Thessalonica, why are they a model church?"
    },
    {
      "id": 120,
      "start": 1099.4400024414062,
      "end": 1104.2799987792969,
      "text": " Well I would say number three, they were actively sharing the gospel, they were actively sharing"
    },
    {
      "id": 121,
      "start": 1104.2799987792969,
      "end": 1105.5999755859375,
      "text": " the gospel."
    },
    {
      "id": 122,
      "start": 1105.5999755859375,
      "end": 1110.1599731445312,
      "text": " They were growing spiritually, they were examples to other believers, but they were actively"
    },
    {
      "id": 123,
      "start": 1110.1599731445312,
      "end": 1111.6799926757812,
      "text": " sharing the gospel."
    },
    {
      "id": 124,
      "start": 1111.6799926757812,
      "end": 1118.3599853515625,
      "text": " And what a blessing to see in verse number eight of 1 Thessalonians 1 how that God references"
    },
    {
      "id": 125,
      "start": 1118.3599853515625,
      "end": 1120.6400146484375,
      "text": " their work of sharing the gospel."
    },
    {
      "id": 126,
      "start": 1120.6400146484375,
      "end": 1125.6799926757812,
      "text": " Paul says it this way, unto the inspiration of the Holy Spirit of God, for from you, again"
    },
    {
      "id": 127,
      "start": 1125.6799926757812,
      "end": 1130.3599853515625,
      "text": " remember he's writing to the church of the Thessalonians according to 1 1, he says for"
    },
    {
      "id": 128,
      "start": 1130.3599853515625,
      "end": 1136.5199584960938,
      "text": " from you sounded out the word of the Lord, not only in Macedonia and Achaia, but also"
    },
    {
      "id": 129,
      "start": 1136.5199584960938,
      "end": 1143.5199584960938,
      "text": " in every place your faith to God's word is spread abroad so that we need not to speak"
    },
    {
      "id": 130,
      "start": 1143.5199584960938,
      "end": 1144.5199584960938,
      "text": " anything."
    },
    {
      "id": 131,
      "start": 1144.5199584960938,
      "end": 1149.97998046875,
      "text": " And that's pretty exciting, a church."
    },
    {
      "id": 132,
      "start": 1149.97998046875,
      "end": 1155.6400146484375,
      "text": " The apostle Paul, best we can tell from Acts 17, is there for just a very brief time as"
    },
    {
      "id": 133,
      "start": 1155.6400146484375,
      "end": 1160.7999877929688,
      "text": " God would lead him on that second missionary journey to go to the city of Thessalonica,"
    },
    {
      "id": 134,
      "start": 1160.7999877929688,
      "end": 1165.3599853515625,
      "text": " but there was great opposition, but in those few weeks that he had the opportunity to be"
    },
    {
      "id": 135,
      "start": 1165.3599853515625,
      "end": 1170.4400024414062,
      "text": " there, the word of God was preached, souls were saved, a church was established, and"
    },
    {
      "id": 136,
      "start": 1170.4400024414062,
      "end": 1177.0,
      "text": " now as this church is being written to, and we look throughout these two letters, we find"
    },
    {
      "id": 137,
      "start": 1177.0,
      "end": 1180.239990234375,
      "text": " that there's much for which they can be commended for."
    },
    {
      "id": 138,
      "start": 1180.239990234375,
      "end": 1185.2799682617188,
      "text": " Many reasons that we can go to this church and say this is a model church, they were"
    },
    {
      "id": 139,
      "start": 1185.2799682617188,
      "end": 1190.760009765625,
      "text": " actively sharing the gospel, they understood the power of the gospel, they understood how"
    },
    {
      "id": 140,
      "start": 1191.0,
      "end": 1196.719970703125,
      "text": " they had been saved, and because of their salvation and because of understanding the"
    },
    {
      "id": 141,
      "start": 1196.719970703125,
      "end": 1199.7999877929688,
      "text": " power of the gospel, they then wanted to..."
    },
    {
      "id": 0,
      "start": 1199.7999877929688,
      "end": 1201.8799877166748,
      "text": " share that truth with others."
    },
    {
      "id": 1,
      "start": 1201.8799877166748,
      "end": 1203.8399877548218,
      "text": " We shared a prayer letter update"
    },
    {
      "id": 2,
      "start": 1203.8399877548218,
      "end": 1206.2799878120422,
      "text": " from a missionary just a few weeks ago."
    },
    {
      "id": 3,
      "start": 1206.2799878120422,
      "end": 1210.07998752594,
      "text": " And as we talked about that missionary over in Africa,"
    },
    {
      "id": 4,
      "start": 1210.07998752594,
      "end": 1211.8399877548218,
      "text": " and we talked about in Uganda there,"
    },
    {
      "id": 5,
      "start": 1211.8399877548218,
      "end": 1214.999987602234,
      "text": " how this one young man trusted Christ as his savior."
    },
    {
      "id": 6,
      "start": 1214.999987602234,
      "end": 1217.039987564087,
      "text": " And after he trusted Christ as his savior,"
    },
    {
      "id": 7,
      "start": 1217.039987564087,
      "end": 1219.3999881744385,
      "text": " he wanted to go back to his own village"
    },
    {
      "id": 8,
      "start": 1219.3999881744385,
      "end": 1222.1599884033203,
      "text": " to be able to tell his friends and his family"
    },
    {
      "id": 9,
      "start": 1222.1599884033203,
      "end": 1224.6599884033203,
      "text": " about the Lord, tell them about Jesus Christ."
    },
    {
      "id": 10,
      "start": 1224.6599884033203,
      "end": 1225.4999885559082,
      "text": " Why?"
    },
    {
      "id": 11,
      "start": 1225.4999885559082,
      "end": 1226.6799869537354,
      "text": " Because his life had been changed."
    },
    {
      "id": 12,
      "start": 1226.6799869537354,
      "end": 1229.2399883270264,
      "text": " He understood what the gospel did for him,"
    },
    {
      "id": 13,
      "start": 1229.279987335205,
      "end": 1232.559986114502,
      "text": " and he goes back to his village there in Uganda,"
    },
    {
      "id": 14,
      "start": 1232.559986114502,
      "end": 1234.7999877929688,
      "text": " and there's a dozen and a half people"
    },
    {
      "id": 15,
      "start": 1234.7999877929688,
      "end": 1236.9199867248535,
      "text": " that trust Christ as their savior."
    },
    {
      "id": 16,
      "start": 1236.9199867248535,
      "end": 1238.2399864196777,
      "text": " That's exciting."
    },
    {
      "id": 17,
      "start": 1238.2399864196777,
      "end": 1241.5999870300293,
      "text": " And we find that here, this church in Thessalonica,"
    },
    {
      "id": 18,
      "start": 1241.5999870300293,
      "end": 1244.9599876403809,
      "text": " they were actively sharing the gospel."
    },
    {
      "id": 19,
      "start": 1244.9599876403809,
      "end": 1248.0999870300293,
      "text": " They understood that God had saved them,"
    },
    {
      "id": 20,
      "start": 1248.0999870300293,
      "end": 1251.1599884033203,
      "text": " and they had a responsibility to grow spiritually."
    },
    {
      "id": 21,
      "start": 1251.1599884033203,
      "end": 1252.7599868774414,
      "text": " They had a responsibility to be an example"
    },
    {
      "id": 22,
      "start": 1252.7599868774414,
      "end": 1255.0799865722656,
      "text": " to other believers, but they had a responsibility"
    },
    {
      "id": 23,
      "start": 1255.0799865722656,
      "end": 1257.9199867248535,
      "text": " to actively share the gospel."
    },
    {
      "id": 24,
      "start": 1257.9199867248535,
      "end": 1259.839988708496,
      "text": " Number four, I would say this."
    },
    {
      "id": 25,
      "start": 1259.839988708496,
      "end": 1263.1999893188477,
      "text": " Why is the church in Thessalonica a model church?"
    },
    {
      "id": 26,
      "start": 1263.1999893188477,
      "end": 1267.3199844360352,
      "text": " Well, number four, they continued through opposition."
    },
    {
      "id": 27,
      "start": 1267.3199844360352,
      "end": 1270.839988708496,
      "text": " They continued through opposition."
    },
    {
      "id": 28,
      "start": 1270.839988708496,
      "end": 1273.5199890136719,
      "text": " In 1 Thessalonians 3, I want you to notice"
    },
    {
      "id": 29,
      "start": 1273.5199890136719,
      "end": 1274.5199890136719,
      "text": " what the Bible says."
    },
    {
      "id": 30,
      "start": 1274.5199890136719,
      "end": 1277.3599853515625,
      "text": " In verse number one, Paul says,"
    },
    {
      "id": 31,
      "start": 1277.3599853515625,
      "end": 1279.719985961914,
      "text": " wherefore, when we could no longer forbear,"
    },
    {
      "id": 32,
      "start": 1279.719985961914,
      "end": 1283.0799865722656,
      "text": " we thought it good to be left in Athens alone,"
    },
    {
      "id": 33,
      "start": 1283.0799865722656,
      "end": 1285.8799896240234,
      "text": " and sent Timotheus our brother, and minister of God,"
    },
    {
      "id": 34,
      "start": 1285.8799896240234,
      "end": 1288.999984741211,
      "text": " and fellow laborer in the gospel of Christ"
    },
    {
      "id": 35,
      "start": 1288.999984741211,
      "end": 1292.119987487793,
      "text": " to establish you and to comfort you concerning your faith."
    },
    {
      "id": 36,
      "start": 1292.119987487793,
      "end": 1294.999984741211,
      "text": " Now, again, I mentioned briefly from Acts 17"
    },
    {
      "id": 37,
      "start": 1294.999984741211,
      "end": 1297.119987487793,
      "text": " the opposition that they face,"
    },
    {
      "id": 38,
      "start": 1297.119987487793,
      "end": 1300.1999893188477,
      "text": " and they say these that have turned the world upside down"
    },
    {
      "id": 39,
      "start": 1300.1999893188477,
      "end": 1303.0399856567383,
      "text": " have come hither also in that passage of Scripture,"
    },
    {
      "id": 40,
      "start": 1303.0399856567383,
      "end": 1305.8799896240234,
      "text": " and Paul and Silas, they go down to Berea,"
    },
    {
      "id": 41,
      "start": 1305.8799896240234,
      "end": 1307.719985961914,
      "text": " and then they chase them down to Berea,"
    },
    {
      "id": 42,
      "start": 1307.719985961914,
      "end": 1309.719985961914,
      "text": " and Paul ends up in Athens,"
    },
    {
      "id": 43,
      "start": 1309.719985961914,
      "end": 1311.5799865722656,
      "text": " and so Paul is referencing that"
    },
    {
      "id": 44,
      "start": 1311.5799865722656,
      "end": 1313.5199890136719,
      "text": " in verse number one of chapter three,"
    },
    {
      "id": 45,
      "start": 1313.5199890136719,
      "end": 1315.7599868774414,
      "text": " and he says we no longer could forbear."
    },
    {
      "id": 46,
      "start": 1316.5999908447266,
      "end": 1319.3199844360352,
      "text": " Paul was concerned about these believers in Thessalonica."
    },
    {
      "id": 47,
      "start": 1319.3199844360352,
      "end": 1321.2799911499023,
      "text": " He knew that they received the gospel,"
    },
    {
      "id": 48,
      "start": 1321.2799911499023,
      "end": 1323.719985961914,
      "text": " they had been saved, but he knew the opposition"
    },
    {
      "id": 49,
      "start": 1323.719985961914,
      "end": 1326.6399841308594,
      "text": " was so great that he and others had to flee,"
    },
    {
      "id": 50,
      "start": 1326.6399841308594,
      "end": 1329.3399810791016,
      "text": " and so he's saying we could no longer forbear,"
    },
    {
      "id": 51,
      "start": 1329.3399810791016,
      "end": 1330.9599914550781,
      "text": " so what do we do?"
    },
    {
      "id": 52,
      "start": 1330.9599914550781,
      "end": 1333.239990234375,
      "text": " We sent Timothy, and Timothy was gonna come,"
    },
    {
      "id": 53,
      "start": 1333.239990234375,
      "end": 1336.759994506836,
      "text": " and he was going to establish you and to comfort you."
    },
    {
      "id": 54,
      "start": 1336.759994506836,
      "end": 1339.6799926757812,
      "text": " Notice in verse number three that no man"
    },
    {
      "id": 55,
      "start": 1339.6799926757812,
      "end": 1343.2799835205078,
      "text": " should be moved by these afflictions."
    },
    {
      "id": 56,
      "start": 1343.2799835205078,
      "end": 1348.2799835205078,
      "text": " For yourselves know that we are appointed thereunto,"
    },
    {
      "id": 57,
      "start": 1348.3599853515625,
      "end": 1351.5599822998047,
      "text": " and you think about the truth of yea,"
    },
    {
      "id": 58,
      "start": 1351.5599822998047,
      "end": 1353.4399871826172,
      "text": " all those that live godly in Christ Jesus"
    },
    {
      "id": 59,
      "start": 1353.4399871826172,
      "end": 1354.8199920654297,
      "text": " shall suffer persecution."
    },
    {
      "id": 60,
      "start": 1354.8199920654297,
      "end": 1358.3599853515625,
      "text": " Of course, that's in second Timothy three in verse 13,"
    },
    {
      "id": 61,
      "start": 1358.3599853515625,
      "end": 1360.7999877929688,
      "text": " and we find here that Paul is saying listen,"
    },
    {
      "id": 62,
      "start": 1360.7999877929688,
      "end": 1363.3599853515625,
      "text": " these afflictions that you're facing,"
    },
    {
      "id": 63,
      "start": 1363.3599853515625,
      "end": 1365.999984741211,
      "text": " it was our desire that you would not be moved"
    },
    {
      "id": 64,
      "start": 1365.999984741211,
      "end": 1367.0799865722656,
      "text": " by these afflictions."
    },
    {
      "id": 65,
      "start": 1367.0799865722656,
      "end": 1370.0999908447266,
      "text": " Again, that it would not cause you to give up,"
    },
    {
      "id": 66,
      "start": 1370.0999908447266,
      "end": 1371.2799835205078,
      "text": " to turn back."
    },
    {
      "id": 67,
      "start": 1371.2799835205078,
      "end": 1373.719985961914,
      "text": " In verse four, for verily when we were with you,"
    },
    {
      "id": 68,
      "start": 1373.719985961914,
      "end": 1376.8399810791016,
      "text": " we told you before that we should suffer tribulation"
    },
    {
      "id": 69,
      "start": 1376.8399810791016,
      "end": 1379.5999908447266,
      "text": " even as it came to pass, and ye know."
    },
    {
      "id": 70,
      "start": 1379.5999908447266,
      "end": 1383.4399871826172,
      "text": " Now remember, I mentioned this on Sunday morning,"
    },
    {
      "id": 71,
      "start": 1383.4399871826172,
      "end": 1386.6999816894531,
      "text": " the word persecution carries with it"
    },
    {
      "id": 72,
      "start": 1386.6999816894531,
      "end": 1389.2799835205078,
      "text": " of the idea of harass or trouble"
    },
    {
      "id": 73,
      "start": 1389.2799835205078,
      "end": 1393.9199829101562,
      "text": " with the intent or the purpose of making one run or flee,"
    },
    {
      "id": 74,
      "start": 1393.9199829101562,
      "end": 1397.6399841308594,
      "text": " and he says in verse number four that we told you before"
    },
    {
      "id": 75,
      "start": 1397.6399841308594,
      "end": 1399.7999877929688,
      "text": " that we should suffer tribulation"
    },
    {
      "id": 76,
      "start": 1399.7999877929688,
      "end": 1401.8799896240234,
      "text": " even as it come to pass, and ye know."
    },
    {
      "id": 77,
      "start": 1401.8799896240234,
      "end": 1404.6799926757812,
      "text": " And so this tribulation, this persecution"
    },
    {
      "id": 78,
      "start": 1404.6799926757812,
      "end": 1407.0799865722656,
      "text": " that they were facing, Paul was concerned,"
    },
    {
      "id": 79,
      "start": 1407.0799865722656,
      "end": 1408.8799896240234,
      "text": " but I'm saying that they were a model church"
    },
    {
      "id": 80,
      "start": 1408.8799896240234,
      "end": 1412.0399932861328,
      "text": " because they continued through the opposition."
    },
    {
      "id": 81,
      "start": 1412.0399932861328,
      "end": 1414.1599884033203,
      "text": " In verse number five it says for this cause,"
    },
    {
      "id": 82,
      "start": 1414.1599884033203,
      "end": 1415.9599914550781,
      "text": " when I could no longer forbear,"
    },
    {
      "id": 83,
      "start": 1415.9599914550781,
      "end": 1417.7999877929688,
      "text": " I sent to know your faith,"
    },
    {
      "id": 84,
      "start": 1417.7999877929688,
      "end": 1421.3199920654297,
      "text": " lest by some means the tempter have tempted you,"
    },
    {
      "id": 85,
      "start": 1421.3199920654297,
      "end": 1423.2799835205078,
      "text": " and our labor be in vain."
    },
    {
      "id": 86,
      "start": 1423.2799835205078,
      "end": 1425.5799865722656,
      "text": " Can you see the heart of Paul in verse number five?"
    },
    {
      "id": 87,
      "start": 1425.5799865722656,
      "end": 1426.4199829101562,
      "text": " Who's the tempter?"
    },
    {
      "id": 88,
      "start": 1426.4199829101562,
      "end": 1429.1999816894531,
      "text": " Well, that's the enemy, that's the devil,"
    },
    {
      "id": 89,
      "start": 1429.1999816894531,
      "end": 1432.3999938964844,
      "text": " and he says lest the tempter have tempted you,"
    },
    {
      "id": 90,
      "start": 1432.3999938964844,
      "end": 1435.219985961914,
      "text": " and notice he says our labor be in vain."
    },
    {
      "id": 91,
      "start": 1436.2799835205078,
      "end": 1440.3799896240234,
      "text": " But now, when Timotheus came from you unto us,"
    },
    {
      "id": 92,
      "start": 1440.3799896240234,
      "end": 1444.1599884033203,
      "text": " and brought us good tidings of your faith and charity,"
    },
    {
      "id": 93,
      "start": 1444.1599884033203,
      "end": 1446.2799835205078,
      "text": " and that ye have good remembrance of us,"
    },
    {
      "id": 94,
      "start": 1446.2799835205078,
      "end": 1450.6799926757812,
      "text": " always desiring greatly to see us as we also to see you."
    },
    {
      "id": 95,
      "start": 1450.6799926757812,
      "end": 1454.3199920654297,
      "text": " Therefore, brethren, we were comforted over you"
    },
    {
      "id": 96,
      "start": 1454.3199920654297,
      "end": 1457.2799987792969,
      "text": " in all our affliction and distress by your faith,"
    },
    {
      "id": 97,
      "start": 1457.2799987792969,
      "end": 1460.239990234375,
      "text": " for now we live, if you stand fast in the Lord,"
    },
    {
      "id": 98,
      "start": 1460.239990234375,
      "end": 1463.0399780273438,
      "text": " for what thanks can we render to God again for you,"
    },
    {
      "id": 99,
      "start": 1463.0399780273438,
      "end": 1467.0399780273438,
      "text": " for all the joy wherewith we joy for your sakes"
    },
    {
      "id": 100,
      "start": 1467.0399780273438,
      "end": 1469.0,
      "text": " before our God night and day,"
    },
    {
      "id": 101,
      "start": 1469.0,
      "end": 1471.5999755859375,
      "text": " praying exceedingly that we might see your face"
    },
    {
      "id": 102,
      "start": 1471.5999755859375,
      "end": 1474.3199768066406,
      "text": " and might perfect that which is lacking in your faith."
    },
    {
      "id": 103,
      "start": 1474.3199768066406,
      "end": 1476.9599914550781,
      "text": " And so we find that Paul is rejoicing,"
    },
    {
      "id": 104,
      "start": 1476.9599914550781,
      "end": 1480.5199890136719,
      "text": " he's saying listen, this church, they continued"
    },
    {
      "id": 105,
      "start": 1480.5199890136719,
      "end": 1483.0799865722656,
      "text": " even though they faced opposition."
    },
    {
      "id": 106,
      "start": 1483.0799865722656,
      "end": 1484.9599914550781,
      "text": " Notice in the second letter,"
    },
    {
      "id": 107,
      "start": 1484.9599914550781,
      "end": 1487.7599792480469,
      "text": " 2 Thessalonians chapter one,"
    },
    {
      "id": 108,
      "start": 1487.7599792480469,
      "end": 1491.1399841308594,
      "text": " notice what God tells us with regard to this church,"
    },
    {
      "id": 109,
      "start": 1491.1399841308594,
      "end": 1493.6799926757812,
      "text": " and they continued through opposition,"
    },
    {
      "id": 110,
      "start": 1493.6799926757812,
      "end": 1496.3199768066406,
      "text": " we see it in chapter three of the first letter,"
    },
    {
      "id": 111,
      "start": 1496.3199768066406,
      "end": 1498.6799926757812,
      "text": " but now in 2 Thessalonians chapter number one,"
    },
    {
      "id": 112,
      "start": 1498.6799926757812,
      "end": 1500.6999816894531,
      "text": " we looked at verse three a moment ago,"
    },
    {
      "id": 113,
      "start": 1500.6999816894531,
      "end": 1502.6799926757812,
      "text": " but look at verse number four,"
    },
    {
      "id": 114,
      "start": 1502.6799926757812,
      "end": 1504.5199890136719,
      "text": " in 2 Thessalonians one and verse four,"
    },
    {
      "id": 115,
      "start": 1504.5199890136719,
      "end": 1508.97998046875,
      "text": " so that we ourselves glory in you in the churches of God,"
    },
    {
      "id": 116,
      "start": 1508.97998046875,
      "end": 1512.5999755859375,
      "text": " notice for your patience and faith"
    },
    {
      "id": 117,
      "start": 1512.5999755859375,
      "end": 1517.5999755859375,
      "text": " in all your persecutions and tribulations that ye endure."
    },
    {
      "id": 118,
      "start": 1521.0799865722656,
      "end": 1524.5,
      "text": " Paul said, this church, God said,"
    },
    {
      "id": 119,
      "start": 1524.5,
      "end": 1528.7799987792969,
      "text": " this church, they continued through opposition,"
    },
    {
      "id": 120,
      "start": 1528.7799987792969,
      "end": 1530.7999877929688,
      "text": " they faced the opposition, but they didn't quit,"
    },
    {
      "id": 121,
      "start": 1530.7999877929688,
      "end": 1532.0399780273438,
      "text": " they didn't turn back, they didn't say,"
    },
    {
      "id": 122,
      "start": 1532.0399780273438,
      "end": 1533.5999755859375,
      "text": " listen, this isn't what we signed up for,"
    },
    {
      "id": 123,
      "start": 1533.5999755859375,
      "end": 1537.1999816894531,
      "text": " this isn't what we didn't, life was easy before we,"
    },
    {
      "id": 124,
      "start": 1537.1999816894531,
      "end": 1539.6399841308594,
      "text": " no, no, no, they continued,"
    },
    {
      "id": 125,
      "start": 1539.6399841308594,
      "end": 1541.5599975585938,
      "text": " even though they faced the opposition,"
    },
    {
      "id": 126,
      "start": 1541.5599975585938,
      "end": 1544.4400024414062,
      "text": " they dealt with the persecutions and the tribulations"
    },
    {
      "id": 127,
      "start": 1544.4400024414062,
      "end": 1546.7599792480469,
      "text": " that are mentioned in 2 Thessalonians one and verse four,"
    },
    {
      "id": 128,
      "start": 1546.7599792480469,
      "end": 1551.7599792480469,
      "text": " and he says that ye endure, they continued,"
    },
    {
      "id": 129,
      "start": 1551.8799743652344,
      "end": 1553.739990234375,
      "text": " even though they faced the opposition,"
    },
    {
      "id": 130,
      "start": 1553.739990234375,
      "end": 1555.4400024414062,
      "text": " they were growing spiritually,"
    },
    {
      "id": 131,
      "start": 1555.4400024414062,
      "end": 1557.0,
      "text": " even though they faced the opposition,"
    },
    {
      "id": 132,
      "start": 1557.0,
      "end": 1558.8399963378906,
      "text": " they were examples to other believers,"
    },
    {
      "id": 133,
      "start": 1558.8399963378906,
      "end": 1562.239990234375,
      "text": " perhaps in one particular area of continuing"
    },
    {
      "id": 134,
      "start": 1562.239990234375,
      "end": 1566.9599914550781,
      "text": " in spite of opposition, though they faced opposition,"
    },
    {
      "id": 135,
      "start": 1566.9599914550781,
      "end": 1569.6399841308594,
      "text": " they were actively sharing the gospel,"
    },
    {
      "id": 136,
      "start": 1569.6399841308594,
      "end": 1573.0799865722656,
      "text": " wow, that's exciting, the fifth reason"
    },
    {
      "id": 137,
      "start": 1573.0799865722656,
      "end": 1575.3599853515625,
      "text": " that I would say this church is a model church"
    },
    {
      "id": 138,
      "start": 1576.2799987792969,
      "end": 1579.3999938964844,
      "text": " is that they love the brethren, they love the brethren,"
    },
    {
      "id": 139,
      "start": 1579.3999938964844,
      "end": 1581.6399841308594,
      "text": " you know, Jesus said this in John 13,"
    },
    {
      "id": 140,
      "start": 1581.6399841308594,
      "end": 1585.3599853515625,
      "text": " and you can take a moment and turn over there,"
    },
    {
      "id": 141,
      "start": 1585.3599853515625,
      "end": 1587.9599914550781,
      "text": " in John chapter 13, the Lord Jesus Christ"
    },
    {
      "id": 142,
      "start": 1587.9599914550781,
      "end": 1589.5,
      "text": " washed the feet of the disciples,"
    },
    {
      "id": 143,
      "start": 1589.5,
      "end": 1593.5199890136719,
      "text": " began giving instruction with regard to his departure,"
    },
    {
      "id": 144,
      "start": 1593.5199890136719,
      "end": 1595.5199890136719,
      "text": " and in this particular text of scripture,"
    },
    {
      "id": 145,
      "start": 1595.5199890136719,
      "end": 1598.7599792480469,
      "text": " he says that he's giving them a new commandment,"
    },
    {
      "id": 146,
      "start": 1598.7599792480469,
      "end": 1601.5199890136719,
      "text": " and it's recorded for us in John 13 in verse 34,"
    },
    {
      "id": 147,
      "start": 1601.5199890136719,
      "end": 1603.7599792480469,
      "text": " he says a new commandment I give unto you,"
    },
    {
      "id": 148,
      "start": 1603.7599792480469,
      "end": 1606.2799987792969,
      "text": " that you love one another as I have loved you,"
    },
    {
      "id": 149,
      "start": 1606.2799987792969,
      "end": 1608.3199768066406,
      "text": " that you also love one another,"
    },
    {
      "id": 150,
      "start": 1608.3199768066406,
      "end": 1611.0599975585938,
      "text": " by this shall all men know that you're my disciples,"
    },
    {
      "id": 151,
      "start": 1611.0599975585938,
      "end": 1614.0,
      "text": " if you have love one to another,"
    },
    {
      "id": 152,
      "start": 1614.0,
      "end": 1616.5599975585938,
      "text": " and we find that as we look at the church in Thessalonica,"
    },
    {
      "id": 153,
      "start": 1616.5599975585938,
      "end": 1620.5399780273438,
      "text": " they were a church that was known for loving the brethren,"
    },
    {
      "id": 154,
      "start": 1620.5399780273438,
      "end": 1621.9599914550781,
      "text": " notice what the Bible says, if you will,"
    },
    {
      "id": 155,
      "start": 1621.9599914550781,
      "end": 1624.8999938964844,
      "text": " in chapter number four of 1 Thessalonians,"
    },
    {
      "id": 156,
      "start": 1625.7999877929688,
      "end": 1627.739990234375,
      "text": " in 1 Thessalonians chapter four,"
    },
    {
      "id": 157,
      "start": 1629.1799926757812,
      "end": 1631.0199890136719,
      "text": " we mentioned already in the first chapter,"
    },
    {
      "id": 158,
      "start": 1631.0199890136719,
      "end": 1632.5,
      "text": " he talked about their labor of love,"
    },
    {
      "id": 159,
      "start": 1632.5,
      "end": 1635.9400024414062,
      "text": " but now we see specifically talking about brotherly love,"
    },
    {
      "id": 160,
      "start": 1635.9400024414062,
      "end": 1637.5,
      "text": " or this loving the brethren,"
    },
    {
      "id": 161,
      "start": 1637.5,
      "end": 1639.1999816894531,
      "text": " we see the book of 1 John deals with this"
    },
    {
      "id": 162,
      "start": 1639.1999816894531,
      "end": 1642.5,
      "text": " quite a bit as well, but as written to a local church,"
    },
    {
      "id": 163,
      "start": 1642.5,
      "end": 1644.739990234375,
      "text": " we find that they're commended"
    },
    {
      "id": 164,
      "start": 1644.739990234375,
      "end": 1646.6199951171875,
      "text": " with regard to their brotherly love,"
    },
    {
      "id": 165,
      "start": 1646.6199951171875,
      "end": 1649.7799987792969,
      "text": " notice in verse number nine of 1 Thessalonians four,"
    },
    {
      "id": 166,
      "start": 1649.7799987792969,
      "end": 1651.0999755859375,
      "text": " the apostle Paul says this,"
    },
    {
      "id": 167,
      "start": 1651.0999755859375,
      "end": 1653.4599914550781,
      "text": " but as touching brotherly love,"
    },
    {
      "id": 168,
      "start": 1653.4599914550781,
      "end": 1655.5399780273438,
      "text": " you need not that I write unto you,"
    },
    {
      "id": 169,
      "start": 1655.5399780273438,
      "end": 1660.3599853515625,
      "text": " for ye yourselves are taught of God to love one another,"
    },
    {
      "id": 170,
      "start": 1660.3599853515625,
      "end": 1663.1599731445312,
      "text": " we can see as we just read in John 13 and verse 34,"
    },
    {
      "id": 171,
      "start": 1663.1599731445312,
      "end": 1667.0599975585938,
      "text": " how God, the Lord Jesus Christ gave that instruction"
    },
    {
      "id": 172,
      "start": 1667.0599975585938,
      "end": 1670.1399841308594,
      "text": " before his departure, and we find in verse 10,"
    },
    {
      "id": 173,
      "start": 1670.1399841308594,
      "end": 1675.1399841308594,
      "text": " notice what he says, and indeed ye do it,"
    },
    {
      "id": 174,
      "start": 1675.6399841308594,
      "end": 1677.5999755859375,
      "text": " you do what, you love one another,"
    },
    {
      "id": 175,
      "start": 1678.5999755859375,
      "end": 1683.5999755859375,
      "text": " toward all the brethren, which are in all Macedonia,"
    },
    {
      "id": 176,
      "start": 1684.8799743652344,
      "end": 1687.2799987792969,
      "text": " now I love the way that this is worded,"
    },
    {
      "id": 177,
      "start": 1687.2799987792969,
      "end": 1690.3199768066406,
      "text": " because he says that you do it toward all the brethren,"
    },
    {
      "id": 178,
      "start": 1690.3199768066406,
      "end": 1692.6199951171875,
      "text": " not just the ones that you get along with most,"
    },
    {
      "id": 179,
      "start": 1693.8399963378906,
      "end": 1696.3599853515625,
      "text": " amen, not just the ones that you kind of,"
    },
    {
      "id": 180,
      "start": 1696.3599853515625,
      "end": 1698.7599792480469,
      "text": " you know, we kind of connect with better than,"
    },
    {
      "id": 181,
      "start": 1698.7599792480469,
      "end": 1702.0,
      "text": " no, no, he says that you love, why?"
    },
    {
      "id": 182,
      "start": 1702.0,
      "end": 1704.8799743652344,
      "text": " Because we're taught of God to love the brethren,"
    },
    {
      "id": 183,
      "start": 1704.8799743652344,
      "end": 1707.0399780273438,
      "text": " and he says here that you do it,"
    },
    {
      "id": 184,
      "start": 1707.47998046875,
      "end": 1709.3599853515625,
      "text": " but then notice what he says,"
    },
    {
      "id": 185,
      "start": 1709.3599853515625,
      "end": 1711.4400024414062,
      "text": " but we beseech you at the end of verse number 10,"
    },
    {
      "id": 186,
      "start": 1711.4400024414062,
      "end": 1716.3399658203125,
      "text": " brethren, that ye increase more and more,"
    },
    {
      "id": 187,
      "start": 1717.47998046875,
      "end": 1720.3599853515625,
      "text": " we mentioned that in 2 Thessalonians 1 and verse number 3,"
    },
    {
      "id": 188,
      "start": 1720.3599853515625,
      "end": 1722.9599609375,
      "text": " he talked about how your love or your charity"
    },
    {
      "id": 189,
      "start": 1722.9599609375,
      "end": 1726.3999633789062,
      "text": " of every one of you all toward each other aboundeth,"
    },
    {
      "id": 190,
      "start": 1726.3999633789062,
      "end": 1729.1199951171875,
      "text": " and we find here in chapter four of the first letter,"
    },
    {
      "id": 191,
      "start": 1729.1199951171875,
      "end": 1732.4400024414062,
      "text": " that Paul says that ye know,"
    },
    {
      "id": 192,
      "start": 1732.4400024414062,
      "end": 1735.6400146484375,
      "text": " you're taught of God with regard to brotherly love,"
    },
    {
      "id": 193,
      "start": 1735.6400146484375,
      "end": 1737.5599975585938,
      "text": " and indeed you do it,"
    },
    {
      "id": 194,
      "start": 1737.5599975585938,
      "end": 1740.5999755859375,
      "text": " but he says that ye increase more and more,"
    },
    {
      "id": 195,
      "start": 1740.5999755859375,
      "end": 1743.6799926757812,
      "text": " and we find even as I mentioned a few moments ago,"
    },
    {
      "id": 196,
      "start": 1743.6799926757812,
      "end": 1745.8399658203125,
      "text": " that we never arrive in the Christian life,"
    },
    {
      "id": 197,
      "start": 1745.8399658203125,
      "end": 1748.3999633789062,
      "text": " and though they're commended for their love,"
    },
    {
      "id": 198,
      "start": 1748.3999633789062,
      "end": 1750.0800170898438,
      "text": " their love for the brethren,"
    },
    {
      "id": 199,
      "start": 1750.0800170898438,
      "end": 1752.2799682617188,
      "text": " and though they're an example for us,"
    },
    {
      "id": 200,
      "start": 1752.2799682617188,
      "end": 1755.0399780273438,
      "text": " and they're a model church in that regard,"
    },
    {
      "id": 201,
      "start": 1755.0399780273438,
      "end": 1760.0399780273438,
      "text": " that Paul still says increase, increase more and more,"
    },
    {
      "id": 202,
      "start": 1760.5599975585938,
      "end": 1763.0399780273438,
      "text": " and we find that as we look at this particular church,"
    },
    {
      "id": 203,
      "start": 1763.0399780273438,
      "end": 1764.8800048828125,
      "text": " this church in Thessalonica,"
    },
    {
      "id": 204,
      "start": 1764.8800048828125,
      "end": 1767.719970703125,
      "text": " this church that we're gonna study these principles"
    },
    {
      "id": 205,
      "start": 1767.719970703125,
      "end": 1769.6400146484375,
      "text": " at the end of 1 Thessalonians 5,"
    },
    {
      "id": 206,
      "start": 1769.6400146484375,
      "end": 1771.3200073242188,
      "text": " and at the end of 2 Thessalonians 3"
    },
    {
      "id": 207,
      "start": 1771.3200073242188,
      "end": 1772.6400146484375,
      "text": " over the next several months,"
    },
    {
      "id": 208,
      "start": 1772.6400146484375,
      "end": 1776.1199951171875,
      "text": " and consider this subject matter of walk worthy,"
    },
    {
      "id": 209,
      "start": 1776.1199951171875,
      "end": 1777.719970703125,
      "text": " and please God,"
    },
    {
      "id": 210,
      "start": 1777.719970703125,
      "end": 1779.2000122070312,
      "text": " some could give the argument,"
    },
    {
      "id": 211,
      "start": 1779.2000122070312,
      "end": 1781.3599853515625,
      "text": " they're already pleasing God,"
    },
    {
      "id": 212,
      "start": 1782.239990234375,
      "end": 1783.1199951171875,
      "text": " sure they were,"
    },
    {
      "id": 213,
      "start": 1784.2000122070312,
      "end": 1786.2000122070312,
      "text": " but they needed to continue,"
    },
    {
      "id": 214,
      "start": 1786.2000122070312,
      "end": 1788.8800048828125,
      "text": " there were some principles that were necessary"
    },
    {
      "id": 215,
      "start": 1788.8800048828125,
      "end": 1790.5999755859375,
      "text": " for them to be given,"
    },
    {
      "id": 216,
      "start": 1790.5999755859375,
      "end": 1793.3999633789062,
      "text": " for them to be taught that they needed to know,"
    },
    {
      "id": 217,
      "start": 1793.3999633789062,
      "end": 1795.6799926757812,
      "text": " and implement in their lives,"
    },
    {
      "id": 218,
      "start": 1795.6799926757812,
      "end": 1799.3999633789062,
      "text": " so that they could walk worthy."
    },
    {
      "id": 0,
      "start": 1799.3999633789062,
      "end": 1806.4399633407593,
      "text": " please God. And God has providentially preserved these two letters. No, we're not the church"
    },
    {
      "id": 1,
      "start": 1806.4399633407593,
      "end": 1811.4799633026123,
      "text": " of the Thessalonians. We're not the church in Thessalonica, but we are a local New Testament"
    },
    {
      "id": 2,
      "start": 1811.4799633026123,
      "end": 1816.159963607788,
      "text": " church. We're a church just like churches for the last couple thousand years have had"
    },
    {
      "id": 3,
      "start": 1816.159963607788,
      "end": 1821.8799629211426,
      "text": " the opportunity to read and study these books and to understand that God has given instruction"
    },
    {
      "id": 4,
      "start": 1821.8799629211426,
      "end": 1827.8199634552002,
      "text": " to a local church. He's preserved it for every generation of believers so that we too can"
    },
    {
      "id": 5,
      "start": 1827.8199634552002,
      "end": 1832.579963684082,
      "text": " look at this instruction and say, we need to know this and then implement this in our"
    },
    {
      "id": 6,
      "start": 1832.579963684082,
      "end": 1840.6799621582031,
      "text": " lives as a body of believers so that we might walk worthy and please God. Over the next"
    },
    {
      "id": 7,
      "start": 1840.6799621582031,
      "end": 1846.0599632263184,
      "text": " several months, we're going to begin in 1 Thessalonians 5 and verse number 12 next Wednesday,"
    },
    {
      "id": 8,
      "start": 1846.0599632263184,
      "end": 1849.519962310791,
      "text": " we're going to begin there and we're going to take our time going through each of these"
    },
    {
      "id": 9,
      "start": 1849.519962310791,
      "end": 1854.8399620056152,
      "text": " principles and seeking to understand them because this is, listen, the Bible says of"
    },
    {
      "id": 10,
      "start": 1854.8399620056152,
      "end": 1860.8199615478516,
      "text": " itself that all scripture is given by inspiration of God and is profitable. It's profitable."
    },
    {
      "id": 11,
      "start": 1860.8199615478516,
      "end": 1867.1199645996094,
      "text": " And here we find that the instruction contained in the conclusion, in the concluding remarks"
    },
    {
      "id": 12,
      "start": 1867.1199645996094,
      "end": 1872.5599670410156,
      "text": " in both of these letters to the same local church is profitable instruction for each"
    },
    {
      "id": 13,
      "start": 1872.5599670410156,
      "end": 1879.0399627685547,
      "text": " of us still today in 2024 and we must take heed to it so that we could say, we want to"
    },
    {
      "id": 14,
      "start": 1879.0399627685547,
      "end": 1885.9199600219727,
      "text": " walk worthy and please God. Walk worthy and please God. Let's pray. Father, we love you."
    },
    {
      "id": 15,
      "start": 1885.9199600219727,
      "end": 1889.6799621582031,
      "text": " We thank you for loving us. We thank you for the privilege that you've given us to gather"
    },
    {
      "id": 16,
      "start": 1889.6799621582031,
      "end": 1893.6799621582031,
      "text": " tonight. We thank you, God, for your word and for the truth that you've given us. We"
    },
    {
      "id": 17,
      "start": 1893.6799621582031,
      "end": 1900.079963684082,
      "text": " thank you for the opportunity that we have to study these two important books. We thank"
    },
    {
      "id": 18,
      "start": 1900.079963684082,
      "end": 1904.3999633789062,
      "text": " you, God, for the church at Thessalonica and as we had an opportunity just for a little"
    },
    {
      "id": 19,
      "start": 1904.3999633789062,
      "end": 1909.199966430664,
      "text": " while this evening to look at these five reasons that we might conclude that this church"
    },
    {
      "id": 20,
      "start": 1909.199966430664,
      "end": 1914.7599639892578,
      "text": " is a model church and Lord, we thank you for their testimony. We thank you for their example,"
    },
    {
      "id": 21,
      "start": 1914.7599639892578,
      "end": 1918.2999649047852,
      "text": " but Lord, we understand that over the next several months as we study these portions"
    },
    {
      "id": 22,
      "start": 1918.2999649047852,
      "end": 1922.7999649047852,
      "text": " of scripture that even though they were a model church, they were still given instruction"
    },
    {
      "id": 23,
      "start": 1922.7999649047852,
      "end": 1928.8199615478516,
      "text": " principles that they needed to know and implement so that they might walk worthy and please"
    },
    {
      "id": 24,
      "start": 1928.8199615478516,
      "end": 1934.0399627685547,
      "text": " them. Lord, I pray that our heart tonight, that our heart over these next several months"
    },
    {
      "id": 25,
      "start": 1934.0799560546875,
      "end": 1940.1199645996094,
      "text": " as we study these principles would be a heart that would desire to walk worthy and to please"
    },
    {
      "id": 26,
      "start": 1940.1199645996094,
      "end": 1944.6799621582031,
      "text": " God. I pray, Lord, that you'd bless our time of prayer. We thank you for the opportunity"
    },
    {
      "id": 27,
      "start": 1944.6799621582031,
      "end": 1949.9199676513672,
      "text": " that we have on Wednesday evenings to gather, not only to study your word, but to pray corporately."
    },
    {
      "id": 28,
      "start": 1949.9199676513672,
      "end": 1954.199966430664,
      "text": " We thank you for the power of prayer. We pray that you'd work through every aspect of this"
    },
    {
      "id": 29,
      "start": 1954.199966430664,
      "end": 1959.199966430664,
      "text": " service and we'll thank you for it. In Christ's name we pray. Amen."
    }
  ],
  "processed_at": "2025-04-15T09:33:36.372257"
}