[
  {
    "book": "Mark",
    "chapter": 1,
    "verse": 40,
    "reference_text": "Mark 1:40",
    "context": "And go back to the book of Mark, if you will, we're gonna look at two passages of scripture in the gospels to prove the point that our Lord walked with compassion... And so notice, if you will, there in Mark chapter number one, pick it up with me in verse number 40. The Bible says this, and there came a leper to him, beseeching him and kneeling down to him and saying unto him,",
    "is_implicit": false,
    "video_id": "0bvsCvT1aho",
    "start_time": 68.16000366210938,
    "end_time": 134.44000244140625
  },
  {
    "book": "Mark",
    "chapter": 1,
    "verse": 40,
    "reference_text": "Mark 1:40",
    "context": "if thou wilt, thou canst make me clean. I want you to notice several things about this leper. We're gonna look at verse 41 and 42 in just a moment as we deal with how Christ walked compassionately. But I want you to notice just a few things about this leper as the Bible tells us in verse number 40 that there was this leper. And of course, we understand the difficulty with leprosy and the problem during, especially in this particular time and what's going on. The Bible says that he came to Jesus, notice, beseeching him, begging, and kneeling down to him. And then notice what he says at the end of verse number 40. He says, if thou wilt, thou canst make me clean.",
    "is_implicit": false,
    "video_id": "0bvsCvT1aho",
    "start_time": 134.44000244140625,
    "end_time": 202.36000061035156
  },
  {
    "book": "Mark",
    "chapter": 1,
    "verse": 41,
    "reference_text": "Mark 1:41",
    "context": "And the Bible says that Jesus is moved with compassion. He puts forth his hand and he simply says this after he touches him, by the way, that's amazing in of itself because you wouldn't touch a leper. And he touched him and he said, I will, be thou clean.",
    "is_implicit": false,
    "video_id": "0bvsCvT1aho",
    "start_time": 276.7200012207031,
    "end_time": 347.1199951171875
  },
  {
    "book": "Mark",
    "chapter": 1,
    "verse": null,
    "reference_text": "Mark 1",
    "context": "He was moved with compassion in Mark one.",
    "is_implicit": true,
    "video_id": "0bvsCvT1aho",
    "start_time": 413.6400146484375,
    "end_time": 484.20001220703125
  },
  {
    "book": "Mark",
    "chapter": 1,
    "verse": null,
    "reference_text": "Mark chapter number one",
    "context": "Jesus was moved with compassion over a physical need.",
    "is_implicit": true,
    "video_id": "0bvsCvT1aho",
    "start_time": 484.20001220703125,
    "end_time": 554.6400146484375
  }
]